{
	"id": "206.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.82",
	"title": "206.82 PREPARATION OF ELECTRONIC VOTING SYSTEM PROGRAMS AND PLANS.",
	"text": "A program or programs for use in an election conducted by means of an electronic voting system or using an electronic ballot marker shall be prepared at the direction of the county auditor or municipal clerk who is responsible for the conduct of the election and shall be independently verified by a competent person designated by that official. The term \"competent person\" as used in this section means a person who can demonstrate knowledge as a computer programmer and who is other than and wholly independent of any person operating or employed by the counting center or the corporation or other preparer of the program. A test deck prepared by a competent person shall be used for independent verification of the program; it shall test the maximum digits used in totaling the returns and shall be usable by insertion during the tabulation process as well as prior to tabulation. A test deck must also be prepared using the electronic ballot marker program and must also be used to verify that all valid votes counted by the vote tabulator may be selected using the electronic ballot marker. The secretary of state shall adopt rules further specifying test procedures.\nThe municipal clerk in a municipality where an electronic voting system is used and the county auditor of a county in which an electronic voting system is used in more than one municipality and the county auditor of a county in which a counting center serving more than one municipality is located shall prepare a plan which indicates acquisition of sufficient facilities, computer time, and professional services and which describes the proposed manner of complying with section 206.80. The plan must be signed, notarized, and submitted to the secretary of state more than 60 days before the first election at which the municipality uses an electronic voting system. Before May 1 of each subsequent general election year, the clerk or auditor shall submit to the secretary of state notification of any changes to the plan on file with the secretary of state. The secretary of state shall review each plan for its sufficiency and may request technical assistance from the Department of Information Technology Services or other agency which may be operating as the central computer authority. The secretary of state shall notify each reporting authority of the sufficiency or insufficiency of its plan within 20 days of receipt of the plan. The attorney general, upon request of the secretary of state, may seek a district court order requiring an election official to fulfill duties imposed by this subdivision or by rules promulgated pursuant to this section.\nBefore a contract is awarded to any vendor for preparation of a program for use with an electronic voting system, the vendor shall furnish the secretary of state with a sufficient bond conditioned on preparing the program in conformity with Minnesota Election Law and the instructions delivered to the vendor by the county auditor or municipal clerk who is responsible for the conduct of the election. The secretary of state shall send notice of the receipt or forfeiture of any such bond to each official on the user list. On or before March 15 of every even-numbered year the county auditor shall send to the secretary of state the current user list for the county.",
	"repealed": false
}