{
	"id": "317A.133",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.133",
	"title": "317A.133 PROCEDURE FOR AMENDMENT OF ARTICLES.",
	"text": "A majority of incorporators may amend the articles by written action if no directors are named in the original articles, if no directors have been elected, and if there are no members with voting rights. A majority of all directors may amend the articles if there are no members with voting rights, if members with voting rights have authorized the board to amend the articles under subdivision 3, or if the amendment merely restates the existing articles, as amended. Notice of the meeting and of the proposed amendment must be given to the board. An amendment restating the existing articles may, but need not, be submitted to and approved by the members with voting rights as provided in subdivision 2.\nAmendments to the articles must be approved by the affirmative vote of a majority of all directors and by the members with voting rights. If an amendment is initiated by the directors, proper notice of the proposed amendment must precede a meeting of the members with voting rights at which the amendment will be considered and must include the substance of the proposed amendment. If an amendment is proposed and approved by the members with voting rights, those members may demand a special board meeting within 60 days for consideration of the proposed amendment if a regular board meeting would not occur within 60 days.\n(a) The members with voting rights may authorize the board of directors, subject to paragraph (c), to exercise from time to time the power of amendment of the articles without approval of the members with voting rights.\n(b) When the members with voting rights have authorized the board of directors to amend the articles, the board of directors, by the affirmative vote of a majority of all directors, unless the articles, bylaws, or the members' resolution authorizing the board action require a greater vote, may amend the articles at a meeting of the board. Notice of the meeting and of the proposed amendment must be given to the board.\n(c) The members with voting rights may prospectively revoke the authority of the board to exercise the power of the members to amend the articles at a meeting duly called for that purpose.\nArticles or bylaws may require greater than majority approval by the board or approval by greater than a majority of a quorum of the members with voting rights for an action under this section and may limit or prohibit the use of mail ballots by members with voting rights.\nThe articles or bylaws may provide that an amendment also must be approved by the members of a class.",
	"repealed": false
}