{
	"id": "103B.227",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.227",
	"title": "103B.227 WATERSHED MANAGEMENT ORGANIZATIONS.",
	"text": "Watershed management organizations shall notify the Board of Water and Soil Resources of member appointments and vacancies in member positions within 30 days. Appointing authorities shall fill vacant positions by 90 days after the vacancy occurs.\nAppointing authorities for watershed management organization board members shall publish a notice of vacancies resulting from expiration of members' terms and other reasons. The notices must be published at least once in a newspaper of general circulation in the watershed management organization area. The notices must state that persons interested in being appointed to serve on the watershed management organization board may submit their names to the appointing authority for consideration. After December 31, 1999, staff of local units of government that are members of the watershed management organization are not eligible to be appointed to the board. Published notice of the vacancy must be given at least 15 days before an appointment or reappointment is made.\nAppointing authorities may remove members of watershed management organization boards for just cause. The Board of Water and Soil Resources shall adopt rules prescribing standards and procedures for removing members of watershed management organization boards for just cause.\nA watershed management organization shall publish and distribute at least one newsletter or other appropriate written communication each year to residents. The newsletter or other communication must explain the organization's water management programs and list the officers and telephone numbers.\nA watershed management organization shall at least every two years solicit interest proposals for legal, professional, or technical consultant services before retaining the services of an attorney or consultant or extending an annual services agreement.\n[Repealed, 1995 c 184 s 32]\nWatershed management organizations may accept transfer of drainage systems under sections 103B.205 to 103B.255.",
	"repealed": false
}