{
	"id": "120B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.11",
	"title": "120B.11 SCHOOL DISTRICT PROCESS FOR REVIEWING CURRICULUM, INSTRUCTION, AND STUDENT ACHIEVEMENT GOALS; STRIVING FOR COMPREHENSIVE ACHIEVEMENT AND CIVIC READINESS.",
	"text": "For the purposes of this section and section 120B.10, the following terms have the meanings given them.\n(a) \"Instruction\" means methods of providing learning experiences that enable a student to meet state and district academic standards and graduation requirements including applied and experiential learning.\n(b) \"Curriculum\" means district or school adopted programs and written plans for providing students with learning experiences that lead to expected knowledge and skills and career and college readiness.\n(c) \"Comprehensive achievement and civic readiness\" means striving to: meet school readiness goals; close the academic achievement gap among all racial and ethnic groups of students and between students living in poverty and students not living in poverty; have all students attain career and college readiness before graduating from high school; have all students graduate from high school; and prepare students to be lifelong learners.\n(d) \"Experiential learning\" means learning for students that includes career exploration through a specific class or course or through work-based experiences such as job shadowing, mentoring, entrepreneurship, service learning, volunteering, internships, other cooperative work experience, youth apprenticeship, or employment.\n(e) \"Ethnic studies\" as defined in section 120B.25 has the same meaning for purposes of this section. Ethnic studies curriculum may be integrated in existing curricular opportunities or provided through additional curricular offerings.\n(f) \"Antiracist\" means actively working to identify and eliminate racism in all forms in order to change policies, behaviors, and beliefs that perpetuate racist ideas and actions.\n(g) \"Culturally sustaining\" means integrating content and practices that infuse the culture and language of Black, Indigenous, and People of Color communities who have been and continue to be harmed and erased through the education system.\n(h) \"Institutional racism\" means structures, policies, and practices within and across institutions that produce outcomes that disadvantage those who are Black, Indigenous, and People of Color.\nMeasures to determine school district and school site progress in striving for comprehensive achievement and civic readiness must include at least:\n(1) the size of the academic achievement gap, rigorous course taking under section 120B.35, subdivision 3, paragraph (c), clause (2), and enrichment experiences by student subgroup;\n(2) student performance on the Minnesota Comprehensive Assessments;\n(3) high school graduation rates; and\n(4) career and college readiness under section 120B.307.\n(a) A school board, at a public meeting, must adopt a comprehensive, long-term strategic plan to support and improve teaching and learning that is aligned with creating comprehensive achievement and civic readiness and includes:\n(1) clearly defined district and school site goals and benchmarks for instruction and student achievement for all student subgroups identified in section 120B.35, subdivision 3, paragraph (b), clause (2);\n(2) a process to assess and evaluate each student's progress toward meeting state and local academic standards, assess and identify students to participate in gifted and talented programs and accelerate their instruction, and adopt early-admission procedures consistent with section 120B.15, and identifying the strengths and weaknesses of instruction in pursuit of student and school success and curriculum affecting students' progress and growth toward career and college readiness and leading to comprehensive achievement and civic readiness;\n(3) a system to periodically review and evaluate the effectiveness of all instruction and curriculum, taking into account strategies and best practices, student outcomes, school principal evaluations under section 123B.147, subdivision 3, students' access to effective teachers who are members of populations underrepresented among the licensed teachers in the district or school and who reflect the diversity of enrolled students under section 120B.35, subdivision 3, paragraph (b), clause (2), and teacher evaluations under section 122A.40, subdivision 8, or 122A.41, subdivision 5;\n(4) strategies for improving instruction, curriculum, and student achievement, including the English and, where practicable, the native language development and the academic achievement of English learners;\n(5) a process to examine the equitable distribution of teachers and strategies to ensure children in low-income families, children in families of People of Color, and children in American Indian families are not taught at higher rates than other children by inexperienced, ineffective, or out-of-field teachers;\n(6) education effectiveness practices that:\n(i) integrate high-quality instruction, technology, and curriculum that is rigorous, accurate, antiracist, and culturally sustaining;\n(ii) ensure learning and work environments validate, affirm, embrace, and integrate cultural and community strengths for all students, families, and employees; and\n(iii) provide a collaborative professional culture that seeks to retain qualified, racially and ethnically diverse staff effective at working with diverse students while developing and supporting teacher quality, performance, and effectiveness;\n(7) an annual budget for continuing to implement the district plan; and\n(8) identifying a list of suggested and required materials, resources, sample curricula, and pedagogical skills for use in kindergarten through grade 12 that accurately reflect the diversity of the state of Minnesota.\n(b) A school district is not required to include information regarding literacy in a plan or report required under this section, except with regard to the academic achievement of English learners.\nEach school board must establish an advisory committee to ensure active community participation in all phases of planning and improving the instruction and curriculum affecting state and district academic standards, consistent with subdivision 2. A district advisory committee, to the extent possible, must reflect the diversity of the district and its school sites, include teachers, parents, support staff, students, and other community residents, and provide translation to the extent appropriate and practicable. The district advisory committee must pursue community support to accelerate the academic and native literacy and achievement of English learners with varied needs, from young children to adults, consistent with section 124D.59, subdivisions 2 and 2a. The district may establish site teams as subcommittees of the district advisory committee under subdivision 4. The district advisory committee must recommend to the school board: rigorous academic standards; student achievement goals and measures consistent with subdivision 1a and sections 120B.022, subdivisions 1a and 1b, and 120B.35; district assessments; means to improve students' equitable access to effective and more diverse teachers; strategies to ensure the curriculum is rigorous, accurate, antiracist, culturally sustaining, and reflects the diversity of the student population; strategies to ensure that curriculum and learning and work environments validate, affirm, embrace, and integrate the cultural and community strengths of all racial and ethnic groups; and program evaluations. School sites may expand upon district evaluations of instruction, curriculum, assessments, or programs. Whenever possible, parents and other community residents must comprise at least two-thirds of advisory committee members.\nA school must establish a site team to develop and implement strategies and education effectiveness practices to improve instruction, curriculum, cultural competencies, including cultural awareness and cross-cultural communication, and student achievement at the school site, consistent with subdivision 2. The site team must include an equal number of teachers and administrators and at least one parent. The site team advises the board and the advisory committee about developing the annual budget and creates an instruction and curriculum improvement plan to align curriculum, assessment of student progress, and growth in meeting state and district academic standards and instruction.\nConsistent with requirements for school performance reports under section 120B.36, subdivision 1, the school board shall publish a report in the local newspaper with the largest circulation in the district, by mail, or by electronic means on the district website. The school board shall hold an annual public meeting to review, and revise where appropriate, student achievement goals, local assessment outcomes, plans, strategies, and practices for improving curriculum and instruction and cultural competency, and efforts to equitably distribute diverse, effective, experienced, and in-field teachers, and to review district success in realizing the previously adopted student achievement goals and related benchmarks and the improvement plans leading to comprehensive achievement and civic readiness. The school board must transmit an electronic summary of its report to the commissioner in the form and manner the commissioner determines.\n[Repealed by amendment, 2013 c 116 art 2 s 6]\nEach school district shall periodically survey affected constituencies, in their native languages where appropriate and practicable, about their connection to and level of satisfaction with school. The district shall include the results of this evaluation in the summary report required under subdivision 5.\n[Repealed by amendment, 2013 c 116 art 2 s 6]\n(a) The commissioner must identify effective strategies, practices, and use of resources by districts and school sites in striving for comprehensive achievement and civic readiness. The commissioner must assist districts and sites throughout the state in implementing these effective strategies, practices, and use of resources.\n(b) The commissioner must identify those districts in any consecutive three-year period not making sufficient progress toward improving teaching and learning for all students, including English learners with varied needs, consistent with section 124D.59, subdivisions 2 and 2a, and striving for comprehensive achievement and civic readiness. The commissioner, in collaboration with the identified district, may require the district to use up to two percent of its basic general education revenue per fiscal year during the proximate three school years to implement commissioner-specified strategies and practices, consistent with paragraph (a), to improve and accelerate its progress in realizing its goals under this section. In implementing this section, the commissioner must consider districts' budget constraints and legal obligations.\n(c) The commissioner shall report by January 25 of each year to the committees of the legislature having jurisdiction over kindergarten through grade 12 education the list of school districts that have not submitted their report to the commissioner under subdivision 5 and the list of school districts not achieving their performance goals established in their plan under subdivision 2.",
	"repealed": false
}