{
	"id": "260B.235",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.235",
	"title": "260B.235 PETTY OFFENDERS; PROCEDURES; DISPOSITIONS.",
	"text": "A petty offender who has committed a juvenile alcohol or controlled substance offense shall be adjudicated a \"petty offender,\" and shall not be adjudicated delinquent, unless, as in the case of any other child alleged to be delinquent, a petition is filed in the manner provided in section 260B.141, summons issued, notice given, a hearing held, and the court finds as a further fact that the child is also delinquent within the meaning and purpose of the laws related to juvenile courts.\nWhen a peace officer has probable cause to believe that a child is a petty offender, the officer may issue a notice to the child to appear in juvenile court in the county in which the alleged violation occurred. The officer shall file a copy of the notice to appear with the juvenile court of the county in which the alleged violation occurred. Filing with the court a notice to appear containing the name and address of the child who is alleged to be a petty offender, specifying the offense charged, and the time and place of the alleged violation has the effect of a petition giving the juvenile court jurisdiction. Any reputable person having knowledge that a child is a petty offender may petition the juvenile court in the manner provided in section 260B.141. Whenever a notice to appear or petition is filed alleging that a child is a petty offender, the court shall summon and notify the person or persons having custody or control of the child of the nature of the offense charged and the time and place of hearing. This summons and notice shall be served in the time and manner provided in section 260B.151, subdivision 1. If a child fails to appear in response to the notice provided by this subdivision, the court may issue a summons notifying the child of the nature of the offense alleged and the time and place set for the hearing. If the peace officer finds it necessary to take the child into custody, sections 260B.175 and 260B.176 shall apply.\nExcept as otherwise provided in section 260B.163, subdivision 4, a child alleged to be a juvenile petty offender may be represented by counsel but does not have a right to appointment of a public defender or other counsel at public expense.\nIf the juvenile court finds that a child is a petty offender, the court may:\n(1) require the child to pay a fine of up to $100;\n(2) require the child to participate in a community service project;\n(3) require the child to participate in a drug awareness program;\n(4) order the child to undergo a chemical dependency evaluation and if warranted by this evaluation, order participation by the child in an outpatient chemical dependency treatment program;\n(5) place the child on probation for up to six months or, in the case of a juvenile alcohol or controlled substance offense, following a determination by the court that the juvenile is chemically dependent, the court may place the child on probation for a time determined by the court;\n(6) order the child to make restitution to the victim; or\n(7) perform any other activities or participate in any other outpatient treatment programs deemed appropriate by the court.\nIn all cases where the juvenile court finds that a child has purchased or attempted to purchase an alcoholic beverage in violation of section 340A.503, if the child has a driver's license or permit to drive, and if the child used a driver's license, permit, Minnesota identification card, or any type of false identification to purchase or attempt to purchase the alcoholic beverage, the court shall forward its finding in the case and the child's driver's license or permit to the commissioner of public safety. Upon receipt, the commissioner shall suspend the child's license or permit for a period of 90 days.\nIn all cases where the juvenile court finds that a child has purchased or attempted to purchase tobacco in violation of section 609.685, subdivision 3, if the child has a driver's license or permit to drive, and if the child used a driver's license, permit, Minnesota identification card, or any type of false identification to purchase or attempt to purchase tobacco, the court shall forward its finding in the case and the child's driver's license or permit to the commissioner of public safety. Upon receipt, the commissioner shall suspend the child's license or permit for a period of 90 days.\nNone of the dispositional alternatives described in clauses (1) to (6) shall be imposed by the court in a manner which would cause an undue hardship upon the child.\n(a) If the juvenile court finds that a child has committed a second or subsequent juvenile alcohol or controlled substance offense, the court may impose any of the dispositional alternatives described in paragraphs (b) to (d). If the juvenile court finds that a child has committed a second or subsequent juvenile tobacco offense, the court may impose any of the dispositional alternatives described in paragraphs (b) to (d).\n(b) The court may impose any of the dispositional alternatives described in subdivision 4, clauses (1) to (6).\n(c) If the adjudicated petty offender has a driver's license or permit, the court may forward the license or permit to the commissioner of public safety. The commissioner shall revoke the petty offender's driver's license or permit until the offender reaches the age of 18 years or for a period of one year, whichever is longer.\n(d) If the adjudicated petty offender has a driver's license or permit, the court may suspend the driver's license or permit for a period of up to 90 days but may allow the offender driving privileges as necessary to travel to and from work.\n(e) If the adjudicated petty offender does not have a driver's license or permit, the court may prepare an order of denial of driving privileges. The order must provide that the petty offender will not be granted driving privileges until the offender reaches the age of 18 years or for a period of one year, whichever is longer. The court shall forward the order to the commissioner of public safety. The commissioner shall deny the offender's eligibility for a driver's license under section 171.04, for the period stated in the court order.\nIn addition to dispositional alternatives authorized by subdivision 4, in the case of a third or subsequent finding by the court pursuant to an admission in court or after trial that a child has committed a juvenile alcohol or controlled substance offense, the juvenile court shall order a chemical dependency evaluation of the child and if warranted by the evaluation, the court may order participation by the child in an inpatient or outpatient chemical dependency treatment program, or any other treatment deemed appropriate by the court. In the case of a third or subsequent finding that a child has committed any juvenile petty offense, the court shall order a children's mental health screening be conducted as provided in section 260B.157, subdivision 1, and if indicated by the screening, to undergo a diagnostic assessment, including a functional assessment, as defined in section 245.4871.\nAny order for disposition authorized by this section shall contain written findings of fact to support the disposition ordered and shall also set forth in writing the following information:\n(1) why the best interests of the child are served by the disposition ordered; and\n(2) what alternative dispositions were considered by the court and why they were not appropriate in the instant case.\nThe juvenile court shall report to the office of state court administrator each disposition made under this section and section 260B.198 where placement is made outside of this state's jurisdictional boundaries. Each report shall contain information as to date of placement, length of anticipated placement, program costs, reasons for out of state placement, and any other information as the office requires to determine the number of out of state placements, the reasons for these placements, and the costs involved. The report shall not contain the name of the child. Any information contained in the reports relating to factors identifying a particular child is confidential and may be disclosed only by order of the juvenile court. Any person violating this subdivision as to release of this confidential information is guilty of a misdemeanor.\nThe court may expunge the adjudication of a child as a petty offender at any time it deems advisable.",
	"repealed": false
}