{
	"id": "219.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.015",
	"title": "219.015 STATE RAIL SAFETY INSPECTOR.",
	"text": "(a) The commissioner of transportation must establish a state rail safety inspection program that may include state rail safety inspectors and supervision as determined by the commissioner. The commissioner shall apply to and enter into agreements with the Federal Railroad Administration (FRA) of the United States Department of Transportation to participate in the federal State Rail Safety Participation Program to train and certify inspectors under authority of United States Code, title 49, sections 20103, 20105, 20106, and 20113, and Code of Federal Regulations, title 49, part 212.\n(b) A state rail safety inspector may:\n(1) inspect mainline track, secondary track, and yard and industry track;\n(2) inspect railroad right-of-way, including adjacent or intersecting drainage, culverts, bridges, overhead structures, and traffic and other public crossings;\n(3) inspect yards and physical plants;\n(4) inspect train equipment;\n(5) inspect railroad operations;\n(6) inspect railroad-highway grade crossings;\n(7) inspect railroad signal and train control systems;\n(8) review and enforce safety requirements;\n(9) review maintenance and repair records; and\n(10) review railroad security measures.\n(c) A state rail safety inspector may perform, but is not limited to, the duties described in the federal State Rail Safety Participation Program. An inspector may train, be certified, and participate in any of the federal State Rail Safety Participation Program disciplines, including: track, signal and train control, motive power and equipment, operating practices compliance, hazardous materials, and highway-rail grade crossings.\n(d) To the extent delegated by the Federal Railroad Administration and authorized by the commissioner, an inspector may issue citations for violations of this chapter, or to ensure railroad employee and public safety and welfare.\n(a) As provided in this subdivision, the commissioner must annually assess railroad companies that are (1) defined as common carriers under section 218.011; (2) classified by federal law or regulation as Class I Railroads, Class I Rail Carriers, Class II Railroads, or Class II Rail Carriers; and (3) operating in this state.\n(b) The assessment must be calculated to allocate state rail safety inspection program costs proportionally among carriers based on route miles operated in Minnesota at the time of assessment. The commissioner must include in the assessment calculation all state rail safety inspection program costs to support up to six rail safety inspector positions, including but not limited to salary, administration, supervision, travel, equipment, training, and ongoing state rail inspector duties.\n(c) The assessments collected under this subdivision must be deposited in a state rail safety inspection account, which is established in the special revenue fund. The account consists of funds provided by this subdivision and section 221.0255 and any other money donated, allotted, transferred, or otherwise provided to the account. Money in the account is appropriated to the commissioner to administer the state rail safety inspection program and for costs under section 221.0255.\nThe commissioner may exempt a common carrier not federally classified as Class I from violations for a period of up to two years if the common carrier applies for participation in a work site safety coaching program, such as the \"MNSharp\" program administered by the Minnesota Department of Labor and Industry, and the commissioner determines such participation to be preferred enforcement for safety or security violations.\nAny person aggrieved by an assessment levied under this section may appeal within 90 days any assessment, violation, or administrative penalty to the Office of Administrative Hearings, with further appeal and review by the district court.",
	"repealed": false
}