{
	"id": "128C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/128C.08",
	"title": "128C.08 ASSAULTING A SPORTS OFFICIAL PROHIBITED.",
	"text": "For the purposes of this section, the following terms have the meanings given in this subdivision.\n\"Assault\" is (1) an act done with intent to cause fear in another of immediate bodily harm or death, or (2) the infliction of or attempt to inflict bodily harm upon another.\n\"Sports official\" is a person who serves as an umpire, referee, judge, linesperson, timer, scorekeeper, or in another similar capacity for an interscholastic athletic activity.\n\"Interscholastic athletic activity\" or \"activity\" means an interscholastic athletic activity whose control, supervision, and regulation have been delegated to the Minnesota State High School League pursuant to section 128C.01.\nAny person who assaults a sports official in connection with an interscholastic athletic activity may be excluded from attending an activity for up to 12 months.\nThe board of directors of the Minnesota State High School League or a school board may exclude any person except as provided in subdivision 5.\nThe board of directors of the Minnesota State High School League may exclude a person from:\n(1) any activity of the kind in connection with which the assault occurred; or\n(2) all interscholastic athletic activities.\nA school board may exclude a person from any activity sponsored or participated in by the school district.\nThe board of directors of the Minnesota State High School League or a school board may exclude a person from any interscholastic athletic activity if the person assaulted a sports official in connection with an activity. A person alleged to have assaulted a sports official shall be entitled to an informal hearing on the matter by the board of directors of the Minnesota State High School League or school board. Upon finding that the person assaulted a sports official, the board of directors of the Minnesota State High School League or school board shall notify the individual in writing and shall indicate any activity from which, and the period of time for which, the person is excluded.\nA head varsity coach may be excluded under this section only by the school board employing the coach.",
	"repealed": false
}