{
	"id": "624.7181",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7181",
	"title": "624.7181 RIFLES AND SHOTGUNS IN PUBLIC PLACES.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"BB gun\" means a device that fires or ejects a shot measuring .18 of an inch or less in diameter.\n(b) \"Carry\" does not include:\n(1) the carrying of a BB gun, rifle, or shotgun to, from, or at a place where firearms are repaired, bought, sold, traded, or displayed, or where hunting, target shooting, or other lawful activity involving firearms occurs, or at funerals, parades, or other lawful ceremonies;\n(2) the carrying by a person of a BB gun, rifle, or shotgun that is unloaded and in a gun case expressly made to contain a firearm, if the case fully encloses the firearm by being zipped, snapped, buckled, tied, or otherwise fastened, and no portion of the firearm is exposed;\n(3) the carrying of a BB gun, rifle, or shotgun by a person who has a permit under section 624.714;\n(4) the carrying of an antique firearm as a curiosity or for its historical significance or value; or\n(5) the transporting of a BB gun, rifle, or shotgun in compliance with section 97B.045.\n(c) \"Public place\" means property owned, leased, or controlled by a governmental unit and private property that is regularly and frequently open to or made available for use by the public in sufficient numbers to give clear notice of the property's current dedication to public use but does not include: a person's dwelling house or premises, the place of business owned or managed by the person, or land possessed by the person; a gun show, gun shop, or hunting or target shooting facility; or the woods, fields, or waters of this state where the person is present lawfully for the purpose of hunting or target shooting or other lawful activity involving firearms.\nWhoever carries a BB gun, rifle, or shotgun on or about the person in a public place is guilty of a gross misdemeanor. A person under the age of 21 who carries a semiautomatic military-style assault weapon, as defined in section 624.712, subdivision 7, on or about the person in a public place is guilty of a felony.\nThis section does not apply to officers, employees, or agents of law enforcement agencies or the armed forces of this state or the United States, or private detectives or protective agents, to the extent that these persons are authorized by law to carry firearms and are acting in the scope of their official duties.",
	"repealed": false
}