{
	"id": "256K.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/256K.46",
	"title": "256K.46 SHELTER-LINKED YOUTH MENTAL HEALTH GRANT PROGRAM.",
	"text": "(a) The commissioner shall award grants to provide mental health services to homeless or sexually exploited youth. To be eligible, housing providers must partner with community-based mental health practitioners to provide a continuum of mental health services, including short-term crisis response, support for youth in longer-term housing settings, and ongoing relationships to support youth in other housing arrangements in the community for homeless or sexually exploited youth.\n(b) The commissioner shall consult with the commissioner of management and budget to identify evidence-based mental health services for youth and give priority in awarding grants to proposals that include evidence-based mental health services for youth.\n(c) The commissioner may make two-year grants under this section.\n(d) Money appropriated for this section must be expended on activities described under subdivision 4, technical assistance, and capacity building to meet the greatest need on a statewide basis. The commissioner shall provide outreach, technical assistance, and program development support to increase capacity of new and existing service providers to better meet needs statewide, particularly in areas where shelter-linked youth mental health services have not been established, especially in greater Minnesota.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of human services, unless otherwise indicated.\n(c) \"Housing provider\" means a shelter, housing program, or other entity providing services under the Homeless Youth Act in section 256K.45 and the Safe Harbor for Sexually Exploited Youth Act in section 145.4716.\n(d) \"Mental health practitioner\" has the meaning given in section 245.462, subdivision 17.\n(e) \"Youth\" has the meanings given for \"homeless youth,\" \"youth at risk for homelessness,\" and \"runaway\" in section 256K.45, subdivision 1a, \"sexually exploited youth\" in section 260C.007, subdivision 31, and \"youth eligible for services\" in section 145.4716, subdivision 3.\nAn eligible applicant for shelter-linked youth mental health grants under subdivision 1 is a housing provider that:\n(1) demonstrates that the provider received targeted trauma training focused on sexual exploitation and adolescent experiences of homelessness; and\n(2) partners with a community-based mental health practitioner who has demonstrated experience or access to training regarding adolescent development and trauma-informed responses.\n(a) Grant recipients may conduct the following activities with community-based mental health practitioners:\n(1) develop programming to prepare youth to receive mental health services;\n(2) provide on-site mental health services, including group skills and therapy sessions. Grant recipients are encouraged to use evidence-based mental health services;\n(3) provide mental health case management, as defined in section 256B.0625, subdivision 20; and\n(4) consult, train, and educate housing provider staff regarding mental health. Grant recipients are encouraged to provide staff with access to a mental health crisis line 24 hours a day, seven days a week.\n(b) Only after promoting and assisting participants with obtaining health insurance coverage for which the participant is eligible, and only after mental health practitioners bill covered services to medical assistance or health plan companies, grant recipients may use grant funds to fill gaps in insurance coverage for mental health services.\n(c) Grant funds may be used for purchasing equipment, connection charges, on-site coordination, set-up fees, and site fees to deliver shelter-linked youth mental health services defined in this subdivision via telehealth consistent with section 256B.0625, subdivision 3b.\nGrant recipients shall report annually on the use of shelter-linked youth mental health grants to the commissioner by December 31, beginning in 2020. Each report shall include the name and location of the grant recipient, the amount of each grant, the youth mental health services provided, and the number of youth receiving services. The commissioner shall determine the form required for the reports and may specify additional reporting requirements. The commissioner shall include the shelter-linked youth mental health services program in the biennial report required under section 256K.45, subdivision 2.",
	"repealed": false
}