{
	"id": "148E.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.245",
	"title": "148E.245 INVESTIGATIVE POWERS AND PROCEDURES.",
	"text": "(a) The board may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary material as part of its investigation of an applicant or licensee under this section or chapter 214.\n(b) If any person fails or refuses to appear or testify regarding any matter about which the person may be lawfully questioned, or fails or refuses to produce any papers, books, records, documents, or other evidentiary materials in the matter to be heard, after having been required by order of the board or by a subpoena of the board to do so, the board may institute a proceeding in any district court to enforce the board's order or subpoena.\n(c) The board or a designated member of the board acting on behalf of the board may issue subpoenas or administer oaths to witnesses or take affirmations. Depositions may be taken within or out of the state in the manner provided by law for the taking of depositions in civil actions.\n(d) A subpoena or other process or paper may be served upon any person named therein, by mail or by any officer authorized to serve subpoenas or other process or paper in civil actions, with the same fees and mileage and in the same manner as prescribed by law for service of process issued out of the district court of this state.\n(e) Fees, mileage, and other costs must be paid as the board directs.\n(a) Any records obtained as part of an investigation must be treated as investigative data under section 13.41 and be classified as confidential data.\n(b) Notwithstanding paragraph (a), client records must be treated as private data under chapter 13. Client records must be protected as private data in the records of the board and in administrative or judicial proceedings unless the client authorizes the board in writing to make public the identity of the client or a portion or all of the client's records.\n(a) If the board (1) has probable cause to believe that an applicant or licensee has violated a statute or rule enforced by the board or an order issued by the board; and (2) believes the applicant may have a health-related condition relevant to the violation, the board may issue an order directing the applicant or licensee to submit to one or more of the following: a mental examination, a physical examination, or a substance use disorder evaluation.\n(b) An examination or evaluation order issued by the board must include:\n(1) factual specifications on which the order is based;\n(2) the purpose of the examination or evaluation;\n(3) the name of the person or entity that will conduct the examination or evaluation; and\n(4) the means by which the examination or evaluation will be paid for.\n(c) Every applicant or licensee must submit to a mental examination, a physical examination, or a substance use disorder evaluation when ordered to do so in writing by the board.\n(d) By submitting to a mental examination, a physical examination, or a substance use disorder evaluation, an applicant or licensee waives all objections to the admissibility of the examiner or evaluator's testimony or reports on the grounds that the testimony or reports constitute a privileged communication.\n(a) If an applicant or licensee fails to submit to an examination or evaluation ordered by the board according to subdivision 3, unless the failure was due to circumstances beyond the control of the applicant or licensee, the failure is an admission that the applicant or licensee violated a statute or rule enforced by the board as specified in the examination or evaluation order issued by the board. The failure may result in an application being denied or other adversarial, corrective, or disciplinary action being taken by the board without a contested case hearing.\n(b) If an applicant or licensee requests a contested case hearing after the board denies an application or takes other disciplinary or adversarial action, the only issues which may be determined at the hearing are whether:\n(1) the board had probable cause to issue the examination or evaluation order; and\n(2) the failure to submit to the examination or evaluation was due to circumstances beyond the control of the applicant or licensee.\n(c) Neither the record of a proceeding under this subdivision nor an order issued by the board may be admissible, subject to subpoena, or be used against the applicant or licensee in a proceeding in which the board is not a party or decision maker.\n(d) Information obtained under this subdivision must be treated as private data under chapter 13. An order issued by the board as the result of an applicant's or licensee's failure to submit to an examination or evaluation must be treated as public data under chapter 13.\n(a) In addition to ordering a physical or mental examination or substance use disorder evaluation, and notwithstanding section 13.384, 144.651, 595.02, or any other statute limiting access to health records, the board or a designated member of the board acting on behalf of the board may subpoena physical, mental, and substance use disorder health records relating to an applicant or licensee without the applicant's or licensee's consent if the board has:\n(1) probable cause to believe that the applicant or licensee has violated chapter 214, a statute or rule enforced by the board, or an order issued by the board; and\n(2) reason to believe that the records are relevant and necessary to the investigation.\n(b) An applicant, licensee, insurance company, government agency, health care facility, or provider as defined in section 144.291, subdivision 2, paragraph (i), must comply with any subpoena of the board under this subdivision and is not liable in any action for damages for releasing information subpoenaed by the board under this subdivision unless the information provided is false and the person or entity providing the information knew or had reason to know that the information was false.\n(c) Information on individuals obtained under this subdivision must be treated as investigative data under section 13.41 and be classified as confidential data.\n(d) If an applicant, licensee, person, or entity does not comply with any subpoena of the board under this subdivision, the board may institute a proceeding in any district court to enforce the board's subpoena.\nIf, in a proceeding for taking action against an applicant or licensee under this section, the charges involve sexual contact with a client or former client, the board or administrative law judge must not consider evidence of the client's or former client's previous sexual conduct. Reference to the client's or former client's previous sexual conduct must not be made during the proceedings or in the findings, except by motion of the complainant, unless the evidence would be admissible under the applicable provisions of section 609.347, subdivision 3.\n(a) Except as provided in paragraph (b), if the board receives a complaint about a social worker regarding the social worker's involvement in a case of vulnerable adults or children in need of protection, the county or other appropriate public authority may request that the board suspend its investigation, and the board must comply until such time as the court issues its findings on the case.\n(b) Notwithstanding paragraph (a), the board may continue with an investigation if the board determines that doing so is in the best interests of the vulnerable adult or a child in need of protection and is consistent with the board's obligation to protect the public. If the board chooses to continue an investigation, the board must notify the county or other appropriate public authority in writing and state its reasons for doing so.\n(a) In no more than 14 calendar days after receiving a complaint regarding a licensee, the board must notify the complainant that the board has received the complaint.\n(b) The board must periodically notify the complainant of the status of the complaint.\n(a) Except as provided in paragraph (b), in no more than 60 calendar days after receiving a complaint regarding a licensee, the board must notify the licensee that the board has received the complaint and inform the licensee of:\n(1) the substance of the complaint;\n(2) the sections of the law that allegedly have been violated; and\n(3) whether an investigation is being conducted.\n(b) Paragraph (a) does not apply if the board determines that such notice:\n(1) would compromise the board's investigation according to section 214.10; or\n(2) cannot reasonably be accomplished within this time.\n(c) The board must periodically notify the licensee of the status of the complaint.\nIn no more than one year after receiving a complaint regarding a licensee, the board must resolve or dismiss the complaint unless the board determines that resolving or dismissing the complaint cannot reasonably be accomplished within this time.",
	"repealed": false
}