{
	"id": "144.586",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.586",
	"title": "144.586 REQUIREMENTS FOR CERTAIN NOTICES AND DISCHARGE PLANNING.",
	"text": "(a) Each hospital, as defined under section 144.50, subdivision 2, shall provide oral and written notice to each patient that the hospital places in observation status of such placement not later than 24 hours after such placement. The oral and written notices must include:\n(1) a statement that the patient is not admitted to the hospital but is under observation status;\n(2) a statement that observation status may affect the patient's Medicare coverage for:\n(i) hospital services, including medications and pharmaceutical supplies; or\n(ii) home or community-based care or care at a skilled nursing facility upon the patient's discharge; and\n(3) a recommendation that the patient contact the patient's health insurance provider or the Office of the Ombudsman for Long-Term Care or Office of the Ombudsman for State Managed Health Care Programs or the Beneficiary and Family Centered Care Quality Improvement Organization to better understand the implications of placement in observation status.\n(b) The hospital shall document the date in the patient's record that the notice required in paragraph (a) was provided to the patient, and the patient's designated representative such as the patient's health care agent, legal guardian, conservator, or another person acting as the patient's representative.\nEach hospital, including hospitals designated as critical access hospitals, must comply with the federal hospital requirements for discharge planning which include:\n(1) conducting a discharge planning evaluation that includes an evaluation of:\n(i) the likelihood of the patient needing posthospital services and of the availability of those services; and\n(ii) the patient's capacity for self-care or the possibility of the patient being cared for in the environment from which the patient entered the hospital;\n(2) timely completion of the discharge planning evaluation under clause (1) by hospital personnel so that appropriate arrangements for posthospital care are made before discharge, and to avoid unnecessary delays in discharge;\n(3) including the discharge planning evaluation under clause (1) in the patient's medical record for use in establishing an appropriate discharge plan. The hospital must discuss the results of the evaluation with the patient or individual acting on behalf of the patient. The hospital must reassess the patient's discharge plan if the hospital determines that there are factors that may affect continuing care needs or the appropriateness of the discharge plan; and\n(4) providing counseling, as needed, for the patient and family members or interested persons to prepare them for posthospital care. The hospital must provide a list of available Medicare-eligible home care agencies or skilled nursing facilities that serve the patient's geographic area, or other area requested by the patient if such care or placement is indicated and appropriate. Once the patient has designated their preferred providers, the hospital will assist the patient in securing care covered by their health plan or within the care network. The hospital must not specify or otherwise limit the qualified providers that are available to the patient. The hospital must document in the patient's record that the list was presented to the patient or to the individual acting on the patient's behalf.\n(a) This subdivision applies to hospital discharges involving a child with a high-cost medical or chronic condition who needs posthospital continuing aftercare, including but not limited to home health care services, posthospital extended care services, or outpatient services for follow-up or ancillary care, or is at risk of recurrent hospitalization or emergency room services due to a medical or chronic condition.\n(b) In addition to complying with the discharge planning requirements in subdivision 2, the hospital must ensure that the following conditions are met and arrangements made before discharging any patient described in paragraph (a):\n(1) the patient's primary care provider and either the health carrier or, if the patient is enrolled in medical assistance, the managed care organization are notified of the patient's date of anticipated discharge and provided a description of the patient's aftercare needs and a copy of the patient's discharge plan, including any necessary medical information release forms;\n(2) the appropriate arrangements for home health care or posthospital extended care services are made and the initial services as indicated on the discharge plan are scheduled; and\n(3) if the patient is eligible for care coordination services through a health plan or health certified medical home, the appropriate care coordinator has connected with the patient's family.",
	"repealed": false
}