{
	"id": "13.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.47",
	"title": "13.47 EMPLOYMENT AND TRAINING DATA.",
	"text": "(a) \"Employment and training data\" are data on individuals collected, maintained, used, or disseminated because an individual applies for, is currently enrolled in, or has been enrolled in employment and training programs funded with federal, state, or local resources, including those provided under the Workforce Investment Act of 1998, United States Code, title 29, section 2801.\n(b) \"Employment and training service provider\" means an entity certified, or seeking to be certified, by the commissioner of employment and economic development to deliver employment and training services under section 116J.401, subdivision 2, or an organization that contracts with a certified entity or the Department of Employment and Economic Development to deliver employment and training services.\n(c) \"Provider of training services\" means an organization or entity that provides training under the Workforce Investment Act of 1998, United States Code, title 29, section 2801.\nEmployment and training data are private data on individuals.\n(a) Employment and training data may be disseminated by employment and training service providers:\n(1) to other employment and training service providers to coordinate the employment and training services for the data subject or to determine eligibility or suitability for services from other programs;\n(2) to local and state welfare agencies for monitoring the eligibility of the participant for assistance programs, or for any employment or training program administered by those agencies; and\n(3) to the commissioner of employment and economic development.\n(b) The commissioner of employment and economic development may disseminate employment and training data to the Office of Higher Education for purposes of supporting program improvement, system evaluation, and research initiatives including the Statewide Longitudinal Education Data System.\nTo produce data required to certify the eligibility of training service providers under the Workforce Investment Act of 1998, United States Code, title 29, section 2801, or other studies required by law, the commissioner of employment and economic development may enter into a data exchange agreement with a training service provider whereby the commissioner of employment and economic development shall furnish to the provider wage information under section 268.044 on individuals who have received training services from the provider. The provider shall use this wage information to prepare summary data determined necessary by the commissioner. The provider may use this wage information for conducting studies to improve instruction.\nThe commissioner of employment and economic development shall provide the training service providers, as well as make available to the public, summary data on the performance of the training services.",
	"repealed": false
}