{
	"id": "116J.8767",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8767",
	"title": "116J.8767 SUBROGATION OF CLAIMS.",
	"text": "The commissioner may exercise the right of subrogation under this section if the commissioner determines, in the commissioner's discretion, that the lender has not exercised reasonable care and diligence in its collection activities with respect to the loan or that there is a reasonable basis for believing that the lender will not exercise reasonable care and diligence in the future with respect to the collection activities.\nIf the payment of a claim has fully covered the lender's loss on an enrolled loan, or if the payment of a claim when combined with any recovery from the borrower has fully covered the lender's loss, the commissioner, upon request, is subrogated to the rights of the lender with respect to any collateral, security, or other right of recovery in connection with the loan that has not been realized by the lender. The lender thereafter shall assign to the commissioner any right, title, or interest to any collateral, security, or other right of recovery in connection with the loan.\nIf an assignment has been made, the commissioner is not required to undertake any obligations of the lender under its loan documents, except for any obligations directly related to the commissioner's assigned rights of recovery in connection with the loan. The lender shall fulfill any other obligations it may have under the loan documents in the same manner and to the same degree as required had the assignment not been made. The lender shall provide the commissioner with all reasonable assistance the commissioner requests in proceeding with respect to any collateral, security, or other right of recovery, except that the lender need not incur any out-of-pocket expenses.\nIf the commissioner decides to exercise the right of subrogation in connection with an enrolled loan and would be entitled to exercise the right except for the fact that the lender's loss has not been fully covered, the commissioner may pay from money in the reserve fund an amount sufficient to fully cover the lender's loss even though the payment may cover a principal amount not covered under the program or not included in the lender's claim. Upon making the payment, the commissioner is subrogated to the rights of the lender.\nAny money received by the commissioner as a result of enforcement actions taken with respect to any collateral, security, or other rights of recovery must be promptly deposited by the commissioner in the reserve fund, less any out-of-pocket expenses incurred by the commissioner in taking such enforcement actions.",
	"repealed": false
}