{
	"id": "136G.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/136G.03",
	"title": "136G.03 DEFINITIONS.",
	"text": "For purposes of sections 136G.01 to 136G.14, the following terms have the meanings given.\n\"Account\" means the formal record of transactions relating to a Minnesota college savings plan beneficiary.\n\"Account owner\" means a person who enters into a participation agreement and is entitled to conduct transactions on the account, including selecting and changing the beneficiary of an account and receiving distributions from the account.\nMS 2018 [Repealed, 2020 c 109 art 2 s 17]\n\"Application\" means the form executed by a prospective account owner to enter into a participation agreement and open an account in the plan. The application incorporates by reference the participation agreement.\n\"Beneficiary\" means the designated beneficiary for the account, as defined in section 529(e)(1) of the Internal Revenue Code.\n\"Board\" means the State Board of Investment.\n\"Contingent account owner\" means the person designated as the account owner, either in the participation agreement or pursuant to a separate Minnesota college savings plan form, in the event of the death of the account owner.\n\"Contribution\" means a payment directly allocated to an account for the benefit of a beneficiary. For a rollover distribution, only the portion of the rollover amount that constitutes investment in the account is treated as a contribution to the account. For purposes of this chapter, \"contribution\" includes a recontribution that satisfies the requirements of section 529(c)(3)(D) of the Internal Revenue Code.\n\"Commissioner\" means the commissioner of the Minnesota Office of Higher Education.\n\"Distribution\" means a disbursement from an account. Distribution does not include a change of beneficiary to a member of the family of the prior beneficiary or a rollover distribution.\n\"Dormant account\" means an account that has not received contributions for at least three consecutive years and the account statements sent to the account owner have been returned as undeliverable.\n\"Earnings\" means the total account balance minus the investment in the account.\n\"Eligible educational institution\" means an institution as defined in section 529(e)(5) of the Internal Revenue Code.\n\"Inactive account with a matching grant account\" means an account in which the beneficiary:\n(1) is not the account owner, the beneficiary has reached 28 years of age, and the beneficiary has not informed the plan administrator that the beneficiary is enrolled in an eligible educational institution;\n(2) is the account owner, the beneficiary was over the age of 18 when the account was opened, and the beneficiary has not informed the program administrator that the beneficiary is enrolled in an eligible educational institution within ten years of the date of opening the account; or\n(3) is the account owner, the beneficiary was a minor when the account was opened, the account becomes inactive when the beneficiary turns 28 years of age, and the beneficiary has not informed the program administrator that the beneficiary is enrolled in an eligible educational institution.\n\"Executive director\" means the executive director of the State Board of Investment.\n\"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended.\n\"Investment in the account\" means the sum of all contributions made to an account by a particular date minus the aggregate amount of contributions included in distributions or rollover distributions, if any, made from the account as of that date.\n\"Matching grant\" means an amount added to a matching grant account under section 136G.11 for eligible account beneficiaries for account contributions in calendar years 2001 to 2010.\n\"Matching grant account\" means an account owned by the state that contains matching grants and earnings.\n\"Maximum account balance limit\" means the amount established by the office under section 136G.09, subdivision 8, paragraph (b).\n\"Member of the family\" means an individual who is related to the beneficiary as defined in section 529(e)(2) of the Internal Revenue Code.\n\"Minor trust account\" means a Uniform Gift to Minors Act account or a Uniform Transfers to Minors Act account created and operating under the laws of Minnesota or another state.\nMS 2018 [Repealed, 2020 c 109 art 2 s 17]\n\"Office\" means the Minnesota Office of Higher Education.\n\"Participation agreement\" means an agreement to participate in the Minnesota college savings plan between an account owner and the state, through its agencies, the office, and the board.\n[Repealed, 2003 c 133 art 3 s 28]\n\"Person\" means an individual, trust, estate, partnership, association, company, corporation, or the state.\n\"Plan\" refers to the plan established under sections 136G.01 to 136G.14.\n\"Plan administrator\" means the person selected by the office and the board to administer the daily operations of the Minnesota college savings plan and to provide marketing, record keeping, investment management, and other services for the program.\n\"Qualified distribution\" means a distribution made from an account for qualified higher education expenses of the beneficiary.\n\"Qualified higher education expenses\" means expenses as defined in section 529(e)(3) of the Internal Revenue Code.\n\"Qualified rollover distribution\" means a distribution that qualifies as a rollover under section 529(c)(3)(C) of the Internal Revenue Code.\n\"Scholarship\" means a scholarship or educational assistance allowance.\n\"State\" means the state of Minnesota and any Minnesota agency or political subdivision of Minnesota.\n\"Taxable distribution\" means: (1) a distribution made from an account other than a qualified distribution, the earnings on which are subject to one or more federal taxes; or (2) a distribution subject to additional federal tax under section 529(c)(6) of the Internal Revenue Code.\n\"Total account balance\" means the amount in an account on a particular date or the fair market value of an account on a particular date.",
	"repealed": false
}