{
	"id": "352.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.12",
	"title": "352.12 REFUND AFTER DEATH.",
	"text": "If an employee dies before state service has terminated and neither a survivor annuity nor a bounce-back annuity is payable on behalf of the employee, or if a former employee who has sufficient service credit to be entitled to an annuity dies before the annuity has become payable, a refund in an amount equal to the employee's accumulated contributions plus interest is payable upon filing a written application on a form prescribed by the executive director. The refund is payable to the last designated beneficiary or, if there is none, to the surviving spouse or, if none, to the employee's surviving children in equal shares or, if none, to the employee's surviving parents in equal shares or, if none, to the representative of the estate. Interest must be computed as provided in section 352.22, subdivision 2. Upon the death of an employee who has received a refund that was later repaid in full, interest must be paid on the repaid refund only from the date of the repayment. If the repayment was made in installments, interest must be paid only from the date on which the installment payments began. The designated beneficiary, the surviving spouse, or the representative of the estate of an employee who had received a disability benefit is not entitled to the payment of interest upon any balance remaining to the decedent's credit in the fund at the time of death, unless the death occurred before any payment could be negotiated.\n(a) If an employee or former employee has satisfied the applicable allowable service credit requirement under section 352.115, subdivision 1, and dies before an annuity or disability benefit has become payable, notwithstanding any designation of beneficiary to the contrary, the surviving spouse of the employee may elect to receive, in lieu of the refund with interest under subdivision 1, an annuity equal to the joint and 100 percent survivor annuity which the employee or former employee could have qualified for on the date of death.\n(b) If the employee was an active employee at the time of the employee's death, was under age 55, and has credit for at least 30 years of allowable service on the date of death, the surviving spouse may elect to receive a 100 percent joint and survivor annuity based on the age of the employee and surviving spouse on the date of death. The annuity is payable using the full early retirement reduction under section 352.116, subdivision 1, paragraph (b), to age 55 and one-half of the early retirement reduction from age 55 to the age payment begins.\n(c) If the employee was an active employee at the time of the employee's death, was under age 55, and has satisfied the applicable allowable service credit requirement under section 352.115, subdivision 1, but did not yet qualify for retirement, the surviving spouse may elect to receive a 100 percent joint and survivor annuity based on the age of the employee and surviving spouse at the time of death. The annuity is payable using the full early retirement reduction under section 352.116, subdivision 1 or 1a, to age 55 and one-half of the early retirement reduction from age 55 to the age payment begins.\n(d) The surviving spouse eligible for benefits under paragraph (a) may apply for the annuity at any time after the date on which the employee or former employee would have attained the required age for retirement based on the allowable service earned. The surviving spouse eligible for surviving spouse benefits under paragraph (b) or (c) may apply for the annuity at any time after the employee's death. The annuity must be computed under sections 352.115, subdivisions 1, 2, and 3, and 352.116, subdivisions 1, 1a, and 3. Section 352.22, subdivisions 3 and 3a, apply to a deferred annuity payable to a surviving spouse under this subdivision. The annuity must cease with the last payment received by the surviving spouse in the lifetime of the surviving spouse, or upon expiration of a term certain benefit payment to a surviving spouse under subdivision 2a. An amount equal to the excess, if any, of the accumulated contributions credited to the account of the deceased employee in excess of the total of the benefits paid and payable to the surviving spouse must be paid to the deceased employee's or former employee's last designated beneficiary or, if none, as specified under subdivision 1.\n(e) Any employee or former employee may request in writing, with the signed consent of the spouse, that this subdivision not apply and that payment be made only to a designated beneficiary as otherwise provided by this chapter.\n(a) In lieu of the 100 percent optional annuity under subdivision 2, or refund under subdivision 1, the surviving spouse of a deceased employee or former employee may elect to receive survivor coverage in a term certain of ten, 15, or 20 years. The monthly term certain annuity must be actuarially equivalent to the 100 percent optional annuity under subdivision 2.\n(b) If a survivor elects a term certain annuity and dies before the expiration of the specified term certain period, the commuted value of the remaining annuity payments must be paid in a lump sum to the survivor's estate.\nIf there is no surviving spouse eligible for benefits under subdivision 2, a dependent child or children as defined in section 352.01, subdivision 26, is eligible for monthly payments under this subdivision, but only if the dependent child or children did not elect to receive a refund under subdivision 1. Payments to a dependent child must be paid from the date of the employee's death to the date the dependent child attains age 20 if the child is under age 15. If the child is 15 years or older on the date of death, payment must be made for five years. The payment to a dependent child is an amount actuarially equivalent to the value of a 100 percent optional annuity under subdivision 2 using the age of the employee and age of the dependent child at the date of death in lieu of the age of the surviving spouse. If there is more than one dependent child, each dependent child shall receive a proportionate share of the actuarial value of the employee's account.\nA survivor benefit under subdivision 2, 2a, or 2b is eligible for postretirement adjustments under section 356.415.\nIf a state employee or former state employee dies without having designated a beneficiary, or if the beneficiary should die before applying for refund of the sum to the credit of the deceased employee or former employee, and there is no surviving spouse, and the amount of the refund does not exceed $3,000 exclusive of interest, the director may refund the amount to the deceased or former employee's next of kin. The amount may be refunded 90 days after the date of death of the employee or former employee in the absence of probate proceedings, and upon proper application. The next of kin must be determined by the director with the concurrence of the board, to be entitled to the refund consistent with the laws of descent. A determination and payment without notice are conclusive and final and are a bar against claims of all other persons.\nIf an employee or former employee dies having named as a beneficiary a person who is a minor at the time of the application for refund, and the amount of the refund does not exceed $3,000, exclusive of interest, the director in the absence of guardianship or probate proceedings may make payment to the natural guardian having custody of the minor beneficiary, for the benefit of the child. Any annuity, retirement allowance, or disability benefit accrued at the time of death of a disabled or retired employee, payable to a minor beneficiary, may similarly be paid. Payment is a bar to recovery by any other person or persons.\n[Repealed, 1993 c 307 art 7 s 1]\nExcept as provided in subdivision 1, if a former employee covered by the system who has not received an annuity, a retirement allowance, or a disability benefit dies, a refund is payable to the last designated beneficiary or, if there is none, to the surviving spouse or, if none, to the employee's surviving children in equal shares or, if none, to the employee's surviving parents in equal shares or, if none, to the representative of the estate in an amount equal to accumulated employee contributions plus interest. The interest on the refund must be computed as provided in section 352.22, subdivision 2.\nUpon the death of a retired employee who selected neither an optional annuity or a bounce-back annuity, a refund must be paid in an amount equal to the excess, if any, of the accumulated contributions to the credit of the retired employee immediately before retirement in excess of the sum of (1) all annuities, retirement allowances, and disability benefits that had been received and had accrued in the lifetime of the decedent, and (2) the annuity, retirement allowance, or disability benefit if not negotiated, payable to the surviving spouse under section 352.115, subdivision 8, or 352.113, subdivision 4, for the calendar month in which the retired employee died. The refund must be paid to the named beneficiary or, if there be none, to the surviving spouse or, if none, to the employee's surviving children in equal shares or, if none, to the employee's surviving parents in equal shares or, if none, to the representative of the estate.\nIf the last eligible recipient of an optional annuity dies and the total amounts paid under it are less than the accumulated contributions to the credit of the retired employee immediately before retirement, the balance of accumulated contributions must be paid to the person designated by the retired employee in writing to receive payment. If no designation has been made by the retired employee, the remaining balance of accumulated contributions must be paid to the surviving children of the deceased recipient of the optional annuity in equal shares. If there are no surviving children, payment must be made to the deceased recipient's parents or, if none, to the representative of the deceased recipient's estate.\nThe designation of a beneficiary or person to receive any accumulated contributions remaining to the credit of an employee, a former employee, or a retired employee, at the time of death, as provided in this section, must be in writing and must be filed with the director before the death of the employee, former employee, or retired employee.\nIf the last designated beneficiary or beneficiaries and the surviving spouse of a (1) deceased employee, (2) former employee, or (3) retired employee, dies before receiving a refund of the sum to the credit of the deceased employee, former employee, or retired employee at the time of death, the refund must be made to the estate of the deceased employee or as provided in subdivision 3 if the amount of the refund does not exceed $3,000 exclusive of interest.\nIf an employee who has received a disability benefit dies, a payment must be made of an amount equal to the excess, if any, of the accumulated contributions to the credit of the employee at the time the disability benefit began to accrue over and above the aggregate of (1) all disability benefits received and which had accrued during life, and (2) the benefit for the month in which the disabled employee died, payable, if applicable, to the surviving spouse under section 352.113, subdivision 4. The payment must be paid to the last designated beneficiary or, if there be none, to the surviving spouse, or if none, to the employee's surviving children in equal shares or, if none, to the employee's surviving parents in equal shares or, if none, to the representative of the estate.\nIf the last designated beneficiary, surviving spouse, legal representative, or next of kin, as determined by the director with the concurrence of the board, fails to claim the refund as provided in this section (1) within five years from the date of death of a retired employee or disabled employee, or (2) within five years after the last deduction was taken from the salary of a deceased employee or deceased former employee, the accumulated contributions of the deceased employee, former employee, retired employee, or disabled employee must be credited to the retirement fund. However, if claim to refund is made within ten years after the transfer of accumulated contributions to the fund or within ten years after the date of death, whichever is later, and the amount transferred to the fund is over $25, the sum must be restored to the account of the deceased employee, former employee, retired employee, or disabled employee. The refund must then be made to the surviving spouse or, if none, to the legal representative of the estate irrespective of any designation of beneficiary made by the deceased employee, former employee, retired employee, or disabled employee.\nIf upon death a former employee has in possession a commissioner of management and budget's payment which does not exceed $1,000 covering a refund of accumulated contributions in the retirement fund, in the absence of probate proceedings the commissioner of management and budget's payment may be returned for cancellation, and then upon application made by the last designated beneficiary of the deceased former employee, refund of the accumulated contributions must be paid to the last designated beneficiary. Payments made under this subdivision are a bar to recovery by any other person or persons.",
	"repealed": false
}