{
	"id": "336.9-310",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-310",
	"title": "336.9-310 WHEN FILING REQUIRED TO PERFECT SECURITY INTEREST OR AGRICULTURAL LIEN; SECURITY INTERESTS AND AGRICULTURAL LIENS TO WHICH FILING PROVISIONS DO NOT APPLY.",
	"text": "(a) General rule: perfection by filing. Except as otherwise provided in subsection (b) and section 336.9-312(b), a financing statement must be filed to perfect all security interests and agricultural liens.\n(b) Exceptions: filing not necessary. The filing of a financing statement is not necessary to perfect a security interest:\n(1) that is perfected under section 336.9-308(d), (e), (f), or (g);\n(2) that is perfected under section 336.9-309 when it attaches;\n(3) in property subject to a statute, regulation, or treaty described in section 336.9-311(a);\n(4) in goods in possession of a bailee which is perfected under section 336.9-312(d)(1) or (2);\n(5) in certificated securities, documents, goods, or instruments which is perfected without filing, control, or possession under section 336.9-312(e), (f), or (g);\n(6) in collateral in the secured party's possession under section 336.9-313;\n(7) in a certificated security which is perfected by delivery of the security certificate to the secured party under section 336.9-313;\n(8) in controllable accounts, controllable electronic records, controllable payment intangibles, deposit accounts, electronic documents, investment property, or letter of credit rights which is perfected by control under section 336.9-314;\n(8.1) in chattel paper which is perfected by possession and control under section 336.9-314A;\n(9) in proceeds which is perfected under section 336.9-315; or\n(10) that is perfected under section 336.9-316.\n(c) Assignment of perfected security interest. If a secured party assigns a perfected security interest or agricultural lien, a filing under this article is not required to continue the perfected status of the security interest against creditors of and transferees from the original debtor.",
	"repealed": false
}