{
	"id": "383A.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.285",
	"title": "383A.285 CLASSIFIED SERVICE.",
	"text": "(a) All appointments to the classified service shall be based upon merit, fitness, and ability to perform the duties of the position and needs of the appointing authority, including the need to achieve and maintain a representative work force.\n(b) The classified service is a permanent service to which this law applies and comprises each tenured position in the public service existing on, or established after, the effective date of sections 383A.281 to 383A.301.\nThe human resources director shall maintain, revise, and administer a classification and salary plan.\nThe human resources director shall place each position in the classified service in an appropriate class in the classification plan or in a new class to be created, if appropriate. If a class is unique to a department, the human resources director shall consult the head of that department before classifying the unique positions.\nAn appointing authority or an employee affected by a classification or reclassification of a position may protest the action in writing to the human resources director. The human resources director shall review the classification or reclassification and may change the decision. Neither the appointing authority nor the employee shall have any further right to appeal a decision regarding a classification or reclassification to the Personnel Review Board.\nThe human resources director shall complete a reclassification study within 60 days after receiving a reclassification request. The appointing authority shall implement the personnel changes required by the reclassification decision in a timely manner and qualifications for reclassified positions shall be reasonably commensurate with the requirements of the position.\nThe incumbent of a position which has been reclassified shall continue in the position if the employee is eligible for the position in the new class in accordance with sections 383A.281 to 383A.301, and rules adopted under sections 383A.281 to 383A.301. An incumbent who is ineligible to continue in the reclassified position, shall be transferred, promoted, or demoted. The incumbent's salary shall not be less than it was in the former classified position but it may be frozen at the level of the former classified position until it is commensurate with the class and grade of the position to which the incumbent was transferred or demoted.\nAn employee with permanent or probationary status whose position is reclassified shall be considered eligible to compete in any examination held to fill the reclassified position as provided in the rules or administrative procedures.\n(a) An employee who is granted a leave of absence from a position in the classified service to accept a position in the unclassified service, upon request, shall, during the unclassified appointment or within 60 days after the end of the unclassified appointment, be reinstated to the department from which the employee was granted a leave, to a classified position comparable to that which was held immediately prior to being appointed to the unclassified position.\n(b) At the discretion of the appointing authority, any employee who without fault or delinquency has resigned or been demoted, within one year after leaving the position in the classified service, may be appointed or reinstated to a classified position within the same department which is comparable to the position held previously. An employee may be reinstated from a leave of absence as determined by the rules and regulations adopted by the county board pursuant to sections 383A.281 to 383A.301.\nAn employee in an unclassified position on the effective date of sections 383A.281 to 383A.301 which becomes classified by sections 383A.281 to 383A.301 shall continue to serve in the classified position and have all the benefits of classified service notwithstanding any other provision of sections 383A.281 to 383A.301.\nAn employee in the classified service with permanent tenure, who is an incumbent of a position which becomes unclassified and is not appointed to or is removed from the unclassified position, shall be transferred by the human resources director to a classified position within the same department comparable to the unclassified position. If a comparable position is unavailable, the person shall be transferred by the director to a classified position comparable to that held immediately prior to being appointed to the position which was unclassified. If the employee held an unclassified position with the same agency before being appointed to the classified position that is unclassified, the person shall be transferred by the director to a classified position comparable to the classified position next in rank below the position that is unclassified. The employee's salary shall not be less than it was in the position which was unclassified, but it may be frozen until it is commensurate with the class and grade of the position to which the employee was transferred.",
	"repealed": false
}