{
	"id": "200.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/200.04",
	"title": "200.04 HELP AMERICA VOTE ACT COMPLAINTS.",
	"text": "The secretary of state shall establish a procedure for the review of complaints regarding the administration of Title III of the Help America Vote Act of 2002, Public Law 107-252, including complaints about voting system standards, computerized statewide registration lists and equipment, voter registration requirements, and other features of state implementation of that act. The secretary of state shall provide a complaint form that requires the signature of the complainant, an affidavit and notarization, and the attachment of any supporting documentation. The form must indicate that any election judge, while serving, is deemed a notary public for purposes of Public Law 107-252, section 402.\n(a) The procedure in this subdivision applies if a complaint under subdivision 1 pertains to a town, city, school, or county employee or official.\n(b) The secretary of state must provide the town clerk, city clerk, school district clerk, or county auditor with a copy of the complaint within three business days of receiving it.\n(c) The town clerk, city clerk, school district clerk, or county auditor has 20 days to either reach an agreement with the complainant or file a written response to the complaint with the secretary of state.\n(d) The secretary of state shall provide the complainant with a copy of the response and an opportunity for a hearing on the record.\n(e) If a hearing on the record is requested, the town clerk, city clerk, school district clerk, or county auditor must be given notice and the opportunity to participate.\n(f) The secretary of state shall issue a final determination, and, if necessary, a remedial plan, no later than 90 days after the filing of the complaint. If the secretary of state fails to issue the determination within 90 days, the secretary of state must provide alternative dispute resolution for the disposition of the complaint. That process must be completed within 60 days of its commencement.\n(a) The procedure in this subdivision applies if a complaint under subdivision 1 pertains to the secretary of state.\n(b) The secretary of state must forward the complaint to the Office of Administrative Hearings within three business days after receiving it.\n(c) The secretary of state has 20 days to either reach an agreement with the complainant or file a written response to the complaint with the Office of Administrative Hearings.\n(d) The Office of Administrative Hearings must provide the complainant with a copy of the response and an opportunity for a hearing on the record.\n(e) If a hearing on the record is requested, the secretary of state must be given notice and an opportunity to participate.\n(f) The Office of Administrative Hearings must issue a final determination and remedial plan if necessary no later than 90 days after the filing of the complaint. If the Office of Administrative Hearings fails to issue the determination within 90 days, it must provide alternative dispute resolution for the disposition of the complaint. That process must be completed within 60 days of its commencement.\nProceedings under this section are not subject to chapter 14.\nA determination made under subdivision 2 is not an agency determination subject to appellate review. Either party may initiate an appeal from the secretary of state's final order in the district court in the county where the town, city, or county employee or official is employed.\nA determination made under subdivision 3 is subject to appellate review.",
	"repealed": false
}