{
	"id": "12.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.03",
	"title": "12.03 DEFINITIONS.",
	"text": "For the purposes of this chapter, each term defined in this section has the meaning ascribed to it.\n\"Activated\" means engaged in emergency management activities listed in this chapter and authorized by the state director of the Division of Emergency Management.\n[Renumbered subd 1d]\nMS 2004 [Expired]\n\"City\" means a statutory or home rule charter city.\n\"Declared emergency\" means a national security or peacetime emergency declared by the governor under section 12.31.\n\"Disaster\" means a situation that creates an actual or imminent serious threat to the health and safety of persons, or a situation that has resulted or is likely to result in catastrophic loss to property or the environment, and for which traditional sources of relief and assistance within the affected area are unable to repair or prevent the injury or loss.\n\"Division\" means the Division of Emergency Management in the Department of Public Safety.\n\"Dry cask storage facility\" means a high-level radioactive waste facility for storage of spent nuclear fuel produced by a nuclear reactor at Prairie Island nuclear generating plant.\n\"Emergency\" means an unforeseen combination of circumstances that calls for immediate action to prevent a disaster from developing or occurring.\n\"Emergency management\" means the preparation for and the carrying out of emergency functions, other than functions for which military forces are primarily responsible, to prevent, minimize and repair injury and damage resulting from disasters, from acute shortages of energy, or from incidents occurring at nuclear power plants that pose radiological or other health hazards. These functions include, without limitation, firefighting services, police services, medical and health services, rescue, engineering, warning services, communications, radiological, chemical and other special weapons defense, evacuation of persons from stricken areas, emergency human services, emergency transportation, existing or properly assigned functions of plant protection, temporary restoration of public utility services, implementation of energy supply emergency conservation and allocation measures, and other functions related to civilian protection, together with all other activities necessary or incidental to preparing for and carrying out these functions.\n[Renumbered subd 4c]\n\"Emergency response personnel\" means an individual, organization, or team authorized by the state to supplement state or local resources for emergency response in a stricken area.\n\"Energy supply emergency\" means a state of emergency declared by the executive council or the legislature pursuant to section 216C.15 and rules adopted under that section.\n[Renumbered subd 4f]\n\"Entity\" includes a firm, corporation, association, limited liability company, partnership, limited liability partnership, nonprofit organization, or other business, religious, or charitable organization.\n\"Facility\" means any real property, building, structure, or other improvement to real property or any motor vehicle, rolling stock, aircraft, watercraft, or other means of transportation. Facility does not include a private residence but may include a licensed health care facility only when other alternatives are not feasible.\n\"Federal government\" means the United States of America.\n[Renumbered subd 5c]\n\"Hazard mitigation\" means an action taken to reduce or eliminate the long-term risk to human life and property from natural and other types of hazards.\n\"Imminent\" means clear and present danger to life or property rights as a result of an emergency or disaster.\nMS 2022 [Repealed, 2023 c 62 art 6 s 17]\n\"Information and telecommunications technology systems and services\" has the meaning given in section 16E.03, subdivision 1, paragraph (b).\n\"Local government\" has the meaning given in Code of Federal Regulations, title 44, section 206.2 (2012).\n\"Cyber attack\" means the use of unauthorized or malicious code on an information system, or the use of another digital mechanism such as a denial of service or ransomware attack, to interrupt or disrupt the operations of an information system or compromise the confidentiality, availability, or integrity of electronic data stored on, processed by, or transiting an information system.\n\"Local organization for emergency management\" means an organization created in accordance with this chapter by the state or a political subdivision to perform local emergency management functions.\n\"Medical supplies\" means any medication, durable medical equipment, instruments, linens, or any other material that a health care provider deems not essential for the continued operation of the provider's practice or facility. The term medical supplies does not apply to medication, durable medical equipment, or other material that is personal property being used by individuals or that has been borrowed, leased, or rented by individuals for the purpose of treatment or care.\n\"Nonfederal share\" has the meaning given in section 12A.02, subdivision 7.\nMS 1994 [Repealed by amendment, 1996 c 344 s 3]\n\"Person\" includes an individual, firm, corporation, association, limited liability company, partnership, limited liability partnership, and other business organizations.\n[Renumbered subd 10]\n\"Political subdivision\" means a county, city, town, or a metropolitan airports commission organized and existing under sections 473.601 to 473.679.\nMS 2004 [Expired]\n\"Specialized emergency response team\" means a team that has been approved by the state director of the Division of Homeland Security and Emergency Management for the purpose of supplementing state or local resources for responding to an emergency or disaster.\nMS 1994 [Renumbered subd 5a]\n\"Specialized equipment\" means equipment and supplies essential for emergency management in excess of equipment and supplies provided for normal operation of the state or a political subdivision, to the acquisition of which the state or federal government may contribute.\n[Renumbered subd 4a]",
	"repealed": false
}