{
	"id": "148.6418",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6418",
	"title": "148.6418 TEMPORARY LICENSURE.",
	"text": "The board shall issue temporary licensure as an occupational therapist or occupational therapy assistant to applicants who are not the subject of a disciplinary action or past disciplinary action, nor disqualified on the basis of items listed in section 148.6448, subdivision 1.\nTo be eligible for temporary licensure, an applicant must submit a completed application for temporary licensure on forms provided by the board, the fees required by section 148.6445, and one of the following:\n(1) evidence of successful completion of the requirements in section 148.6408, subdivision 1, or 148.6410, subdivision 1;\n(2) a copy of a current and unrestricted credential for the practice of occupational therapy as either an occupational therapist or occupational therapy assistant in another jurisdiction; or\n(3) a copy of a current and unrestricted certificate from the National Board for Certification in Occupational Therapy stating that the applicant is certified as an occupational therapist or occupational therapy assistant.\nPersons who are credentialed by the National Board for Certification in Occupational Therapy or another jurisdiction must provide an affidavit with the application for temporary licensure stating that they are not the subject of a pending investigation or disciplinary action and have not been the subject of a disciplinary action in the past.\nAn applicant who has graduated from an accredited occupational therapy program, as required by section 148.6408, subdivision 1, or 148.6410, subdivision 1, and who has not passed the examination required by section 148.6408, subdivision 2, or 148.6410, subdivision 2, must practice under the supervision of a licensed occupational therapist. The supervising therapist must, at a minimum, supervise the person working under temporary licensure in the performance of the initial evaluation, determination of the appropriate intervention plan, and periodic review and modification of the intervention plan. The supervising therapist must observe the person working under temporary licensure in order to ensure service competency in carrying out evaluation, intervention planning, and intervention implementation. The frequency of face-to-face collaboration between the person working under temporary licensure and the supervising therapist must be based on the condition of each patient or client, the complexity of intervention and evaluation procedures, and the proficiencies of the person practicing under temporary licensure. Following demonstrated service competency of the applicant, supervision must occur no less than every ten intervention days or every 30 calendar days, whichever occurs first. The occupational therapist or occupational therapy assistant working under temporary licensure must provide verification of supervision on the application form provided by the board.\n(a) A person issued a temporary license pursuant to subdivision 2, clause (1), must demonstrate to the board within the temporary licensure period successful completion of the qualifying examination requirement under section 148.6408, subdivision 2, or section 148.6410, subdivision 2. A temporary license holder who fails the qualifying examination for a second time shall have their temporary license revoked effective upon notification to the temporary license holder of the examination score. It is the temporary license holder's obligation to submit to the board their qualifying examination scores and to refrain from practice if their temporary license is revoked. Failure to do so subjects the temporary license holder to disciplinary action pursuant to section 148.6448, subdivision 1, clause (5).\n(b) A temporary license expires six months from the date of issuance or on the date the board grants or denies licensure, whichever occurs first.\n(c) A temporary license is not renewable.",
	"repealed": false
}