{
	"id": "103I.541",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.541",
	"title": "103I.541 ENVIRONMENTAL WELL CONTRACTOR'S REGISTRATION; REPRESENTATIVE'S CERTIFICATION.",
	"text": "A person seeking certification to represent an environmental well contractor must meet examination and experience requirements adopted by the commissioner by rule.\nAn environmental well contractor's certification is valid until the date prescribed in the certification by the commissioner.\n(a) An individual must submit an application and application fee to the commissioner to apply for certification as a representative of an environmental well contractor.\n(b) The application must be on forms prescribed by the commissioner. The application must state the applicant's qualifications for the certification, and other information required by the commissioner.\nIf a person employs a certified representative, submits the bond under subdivision 3, and pays the license fee of $75 for an environmental well contractor license, the commissioner shall issue an environmental well contractor license to the applicant. The fee for an individual registration is $75. The commissioner may not act on an application until the application fee is paid.\n(a) The application fee for certification as a representative of an environmental well contractor is $75. The commissioner may not act on an application until the application fee is paid.\n(b) The renewal fee for certification as a representative of an environmental well contractor is $75. The commissioner may not renew a certification until the renewal fee is paid.\n(c) A certified representative must file an application and a renewal application fee to renew the certification by the date stated in the certification. The renewal application must include information that the certified representative has met continuing education requirements established by the commissioner by rule.\nAfter the commissioner has approved an application, the applicant must take an examination given by the commissioner.\nIf the applicant meets the experience requirements established by rule and passes the examination as determined by the commissioner, the commissioner shall issue the applicant a certification to represent an environmental well contractor.\n(a) As a condition of being issued an environmental well contractor's license, the applicant must submit a corporate surety bond for $10,000 approved by the commissioner. The bond must be conditioned to pay the state on performance of work in this state that is not in compliance with this chapter or rules adopted under this chapter. The bond is in lieu of other license bonds required by a political subdivision of the state.\n(b) From proceeds of the bond, the commissioner may compensate persons injured or suffering financial loss because of a failure of the applicant to perform work or duties in compliance with this chapter or rules adopted under this chapter.\n(a) A person must file an application and a renewal application fee to renew the license by the date stated in the license.\n(b) The renewal application fee for an environmental well contractor's license is $75.\n(c) The renewal application must include information that the certified representative of the applicant has met continuing education requirements established by the commissioner by rule.\n(d) At the time of the renewal, the commissioner must have on file all well and boring construction reports, well and boring sealing reports, well permits, and notifications for work conducted by the licensed person since the last license renewal.\nIf a licensed person submits a renewal application after the required renewal date:\n(1) the licensed person must include a late fee of $75; and\n(2) the licensed person may not conduct activities authorized by the environmental well contractor's license until the renewal application, renewal application fee, late fee, and all other information required in subdivision 4 are submitted.",
	"repealed": false
}