{
	"id": "336.9-523",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-523",
	"title": "336.9-523 INFORMATION FROM FILING OFFICE; SALE OR LICENSE OF RECORDS.",
	"text": "(a) Acknowledgment of filing written record. If a person that files a written record requests an acknowledgment of the filing, the filing office shall send to the person an image of the record showing the number assigned to the record pursuant to section 336.9-519(a)(1) and the date and time of the filing of the record. However, if the person furnishes a copy of the record to the filing office, the filing office may instead:\n(1) note upon the copy the number assigned to the record pursuant to section 336.9-519(a)(1) and the date and time of the filing of the record; and\n(2) send the copy to the person.\n(b) Acknowledgment of filing other record. If a person files a record other than a written record, the filing office shall communicate to the person an acknowledgment that provides:\n(1) the information in the record;\n(2) the number assigned to the record pursuant to section 336.9-519(a)(1); and\n(3) the date and time of the filing of the record.\n(c) Communication of requested information. The filing office shall communicate or otherwise make available in a record the following information to any person that requests it:\n(1) whether there is on file on a date and time specified by the filing office, but not a date earlier than three business days before the filing office receives the request, any financing statement that:\n(A) designates a particular debtor (or, if the request so states, designates a particular debtor at the address specified in the request);\n(B) has not lapsed under section 336.9-515 with respect to all secured parties of record; and\n(C) if the request so states, has lapsed under section 336.9-515 and a record of which is maintained by the filing office under section 336.9-522(a);\n(2) the date and time of filing of each financing statement; and\n(3) the information provided in each financing statement.\n(d) Medium for communicating information. In complying with its duty under subsection (c), the filing office may communicate information in any medium. However, if requested, the filing office shall communicate information by issuing its written certificate.\n(e) Timeliness of filing office performance. The filing office shall perform the acts required by subsections (a) through (d) at the time and in the manner prescribed by filing office rule, but not later than two business days after the filing office receives the request.\n(f) Public availability of records. At least weekly, the secretary of state shall offer to sell or license to the public on a nonexclusive basis, in bulk, copies of all records filed in it under this part, in every medium from time to time available to the filing office.",
	"repealed": false
}