{
	"id": "148E.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.025",
	"title": "148E.025 BOARD OF SOCIAL WORK.",
	"text": "The Board of Social Work consists of 15 members appointed by the governor. The members are:\n(1) ten social workers licensed according to section 148E.055; and\n(2) five public members as defined in section 214.02.\n(a) All social worker members must have engaged in the practice of social work in Minnesota for at least one year during the ten years preceding their appointments.\n(b) The ten social worker members must include at least:\n(1) three licensed social workers;\n(2) two licensed independent clinical social workers; and\n(3) two licensed graduate social workers or licensed independent social workers.\n(c) Five social worker members must be engaged at the time of their appointment in the practice of social work in Minnesota in the following settings:\n(1) one member must be engaged in the practice of social work in either a county or state agency;\n(2) one member must be engaged in the practice of social work in an elementary, middle, or secondary school;\n(3) one member must be engaged in the practice of social work in a health care setting;\n(4) one member must be engaged in the practice of social work in a private setting; and\n(5) one member must be an educator engaged in regular teaching duties at a program of social work accredited by the Council on Social Work Education or a similar accreditation body that the board designates.\n(d) At the time of their appointments, at least six members must reside outside of the 11-county metropolitan area.\n(e) At the time of their appointments, at least five members must be members of:\n(1) a community of color; or\n(2) an underrepresented community, as defined in section 148E.010, subdivision 20.\nThe board must biennially elect from its membership a chair, vice-chair, and secretary-treasurer.\nThe board must adopt bylaws to govern its proceedings.\nThe board must appoint and employ an executive director who is not a member of the board. The employment of the executive director shall be subject to the terms described in section 214.04, subdivision 2a.",
	"repealed": false
}