{
	"id": "609.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.115",
	"title": "609.115 PRESENTENCE INVESTIGATION.",
	"text": "(a) When a defendant has been convicted of a misdemeanor or gross misdemeanor, the court may, and when the defendant has been convicted of a felony, the court shall, before sentence is imposed, cause a presentence investigation and written report to be made to the court concerning the defendant's individual characteristics, circumstances, needs, potentialities, criminal record and social history, the circumstances of the offense and the harm caused by it to others and to the community. At the request of the prosecutor in a gross misdemeanor case, the court shall order that a presentence investigation and report be prepared. The investigation shall be made by a probation officer of the court, if there is one; otherwise it shall be made by the commissioner of corrections. The officer conducting the presentence or predispositional investigation shall make reasonable and good faith efforts to contact and provide the victim with the information required under section 611A.037, subdivision 2. Presentence investigations shall be conducted and summary hearings held upon reports and upon the sentence to be imposed upon the defendant in accordance with this section, section 244.10, and the Rules of Criminal Procedure.\n(b) When the crime is a violation of sections 609.561 to 609.563, 609.5641, or 609.576 and involves a fire, the report shall include a description of the financial and physical harm the offense has had on the public safety personnel who responded to the fire. For purposes of this paragraph, \"public safety personnel\" means the state fire marshal; employees of the Division of the State Fire Marshal; firefighters, regardless of whether the firefighters receive any remuneration for providing services; peace officers, as defined in section 626.05, subdivision 2; individuals providing emergency management services; and individuals providing emergency medical services.\n(c) When the crime is a felony violation of chapter 152 involving the sale or distribution of a controlled substance, the report may include a description of any adverse social or economic effects the offense has had on persons who reside in the neighborhood where the offense was committed.\n(d) The report shall also include the information relating to crime victims required under section 611A.037, subdivision 1. If the court directs, the report shall include an estimate of the prospects of the defendant's rehabilitation and recommendations as to the sentence which should be imposed. In misdemeanor cases the report may be oral.\n(e) When a defendant has been convicted of a felony, and before sentencing, the court shall cause a sentencing worksheet to be completed to facilitate the application of the Minnesota Sentencing Guidelines. The worksheet shall be submitted as part of the presentence investigation report.\n(f) When a person is convicted of a felony for which the Sentencing Guidelines presume that the defendant will be committed to the commissioner of corrections under an executed sentence and no motion for a sentencing departure has been made by counsel, the court may, when there is no space available in the local correctional facility, commit the defendant to the custody of the commissioner of corrections, pending completion of the presentence investigation and report. When a defendant is convicted of a felony for which the Sentencing Guidelines do not presume that the defendant will be committed to the commissioner of corrections, or for which the Sentencing Guidelines presume commitment to the commissioner but counsel has moved for a sentencing departure, the court may commit the defendant to the commissioner with the consent of the commissioner, pending completion of the presentence investigation and report. The county of commitment shall return the defendant to the court when the court so orders.\nThe supreme court shall promulgate rules uniformly applicable to all district courts for the form and contents of sentencing worksheets. These rules shall be promulgated by and effective on January 2, 1982.\n[Repealed, 1987 c 331 s 13]\n[Repealed, 1987 c 331 s 13]\nIf the defendant has been convicted of a crime for which a mandatory sentence of life imprisonment is provided by law, the probation officer of the court, if there is one, otherwise the commissioner of corrections, shall forthwith make a postsentence investigation and make a written report as provided by subdivision 1.\nIf the defendant has been convicted of a felony, including a felony for which a mandatory life sentence is required by law, the court shall cause a sentencing worksheet as provided in subdivision 1 to be completed and forwarded to the Sentencing Guidelines Commission.\nFor the purpose of this section, \"mandatory life sentence\" means a sentence under section 609.106, subdivision 2; 609.185; 609.3455; 609.385, subdivision 2; or Minnesota Statutes 2004, section 609.109, subdivision 3, and governed by section 244.05.\nAll criminal justice agencies shall make available at no cost to the probation officer or the commissioner of corrections the criminal record and other relevant information relating to the defendant which they may have, when requested for the purposes of subdivisions 1 and 2.\n(a) Any report made pursuant to subdivision 1 shall be, if written, provided to counsel for all parties before sentence. The written report shall not disclose confidential sources of information unless the court otherwise directs. On the request of the prosecuting attorney or the defendant's attorney a summary hearing in chambers shall be held on any matter brought in issue, but confidential sources of information shall not be disclosed unless the court otherwise directs. If the presentence report is given orally the defendant or the defendant's attorney shall be permitted to hear the report.\n(b) Any report made under subdivision 1 or 2 shall be provided to counsel for the defendant for purposes of representing the defendant on any appeal or petition for postconviction relief. The reports shall be provided by the court and the commissioner of corrections at no cost to the defendant or the defendant's attorney.\nIf the defendant is sentenced to the commissioner of corrections, a copy of any report made pursuant to this section and not made by the commissioner shall accompany the commitment. If the defendant is sentenced to a local correctional agency or facility, a copy of the report must be provided to that agency or facility.\nExcept as provided in subdivisions 4 and 5 or as otherwise directed by the court any report made pursuant to this section shall not be disclosed.\nIf imposition of sentence is stayed by reason of an appeal taken or to be taken, the presentence investigation provided for in this section shall not be made until such stay has expired or has otherwise been terminated.\n(a) If a person is convicted of a felony, the probation officer shall determine in the report prepared under subdivision 1 whether or not alcohol or drug use was a contributing factor to the commission of the offense. If so, the report shall contain the results of a chemical use assessment conducted in accordance with this subdivision. The probation officer shall make an appointment for the defendant to undergo the chemical use assessment if so indicated.\n(b) The chemical use assessment report must include a recommended level of care for the defendant in accordance with the criteria contained in rules adopted by the commissioner of human services under section 254A.03, subdivision 3. The assessment must be conducted by an assessor qualified under rules adopted by the commissioner of human services under section 254A.03, subdivision 3. An assessor providing a chemical use assessment may not have any direct or shared financial interest or referral relationship resulting in shared financial gain with a treatment provider, except as authorized under section 254A.19, subdivision 3. If an independent assessor is not available, the probation officer may use the services of an assessor authorized to perform assessments for the county social services agency under a variance granted under rules adopted by the commissioner of human services under section 254A.03, subdivision 3.\n(a) If a person is convicted of theft under section 609.52, embezzlement of public funds under section 609.54, or forgery under section 609.625, 609.63, or 609.631, the probation officer shall determine in the report prepared under subdivision 1 whether or not compulsive gambling contributed to the commission of the offense. If so, the report shall contain the results of a compulsive gambling assessment conducted in accordance with this subdivision. The probation officer shall make an appointment for the offender to undergo the assessment if so indicated.\n(b) The compulsive gambling assessment report must include a recommended level of treatment for the offender if the assessor concludes that the offender is in need of compulsive gambling treatment. The assessment must be conducted by an assessor qualified either under Minnesota Rules, part 9585.0040, subpart 1, item C, or qualifications determined to be equivalent by the commissioner, to perform these assessments or to provide compulsive gambling treatment. An assessor providing a compulsive gambling assessment may not have any direct or shared financial interest or referral relationship resulting in shared financial gain with a treatment provider. If an independent assessor is not available, the probation officer may use the services of an assessor with a financial interest or referral relationship as authorized under rules adopted by the commissioner of human services under section 245.98, subdivision 2a.\n(c) The commissioner of human services shall reimburse the assessor for each compulsive gambling assessment at a rate established by the commissioner. To the extent practicable, the commissioner shall standardize reimbursement rates for assessments. The commissioner shall reimburse the assessor after receiving written verification from the probation officer that the assessment was performed and found acceptable.\n(a) When a defendant appears in court and is convicted of a crime, the court shall inquire whether the defendant is currently serving in or is a veteran of the armed forces of the United States.\n(b) If the defendant is currently serving in the military or is a veteran and has been diagnosed as having a mental illness by a qualified psychiatrist or clinical psychologist or physician, the court may:\n(1) order that the officer preparing the report under subdivision 1 consult with the United States Department of Veterans Affairs, Minnesota Department of Veterans Affairs, or another agency or person with suitable knowledge or experience, for the purpose of providing the court with information regarding treatment options available to the defendant, including federal, state, and local programming; and\n(2) consider the treatment recommendations of any diagnosing or treating mental health professionals together with the treatment options available to the defendant in imposing sentence.",
	"repealed": false
}