{
	"id": "273.1231",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1231",
	"title": "273.1231 TAX RELIEF FOR DESTROYED PROPERTY; DEFINITIONS.",
	"text": "For purposes of sections 273.1231 to 273.1235, the following words, terms, and phrases have the meanings given them in this section unless the language or context clearly indicates that a different meaning is intended.\n\"Disaster or emergency\" means:\n(1) a major disaster as determined by the president of the United States;\n(2) a natural disaster as determined by the secretary of agriculture;\n(3) a disaster as determined by the administrator of the Small Business Administration; or\n(4) a tornado, storm, flood, earthquake, landslide, explosion, fire, or similar catastrophe, as a result of which a local emergency is declared pursuant to section 12.29.\n(a) \"Disaster or emergency area\" means a geographic area for which:\n(1)(i) the president of the United States, the secretary of agriculture, or the administrator of the Small Business Administration has determined that a disaster exists pursuant to federal law, or\n(ii) a local emergency has been declared pursuant to section 12.29; and\n(2) an application by the local unit of government requesting property tax relief under this section has been received by the governor and approved by the executive council.\n(b) The executive council must not approve an application unless:\n(1) a completed disaster survey is included; and\n(2) within the boundaries of the applicant, (i) the average damage for the buildings that are damaged is at least $5,000, and (ii) either at least 25 taxable buildings were damaged, or the total dollar amount of damage to all taxable buildings equals or exceeds one percent of the total taxable market value of buildings for the applicant as reported to the commissioner of revenue under section 270C.85, subdivision 2, clause (4), for the assessment in the year prior to the year of the damage.\n\"Homestead property\" means a homestead dwelling that is classified as class 1a, 1b, or 2a property or a manufactured home or sectional home used as a homestead and taxed pursuant to section 273.125, subdivision 8, paragraph (b), (c), or (d).\n\"Nonhomestead property\" means any class of taxable real or personal property except homestead property and property that is required by law to be appraised for property tax purposes by the commissioner of revenue.\n\"Net tax\" means the market value and net tax capacity taxes imposed on real and personal property under section 272.01, including the levy under section 275.025, after the subtractions listed in section 273.1393, clauses (2) to (9). Net tax excludes special assessments regardless of how computed.\n\"Reassessed market value\" means the taxable market value of the property established for the January 2 assessment in the year that the disaster or destruction occurs, as adjusted by the county assessor or the commissioner of revenue to reflect the loss in market value caused by the damage.\n\"Utility property\" means property appraised and classified for tax purposes by order of the commissioner of revenue under sections 273.33 to 273.3711.",
	"repealed": false
}