{
	"id": "241.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.025",
	"title": "241.025 FUGITIVE APPREHENSION UNIT.",
	"text": "The commissioner of corrections may appoint peace officers, as defined in section 626.84, subdivision 1, paragraph (c), who shall serve in the classified service subject to the provisions of section 43A.01, subdivision 2, and establish a law enforcement agency, as defined in section 626.84, subdivision 1, paragraph (f), known as the Department of Corrections Fugitive Apprehension Unit, to perform the duties necessary to make statewide arrests under sections 629.30 and 629.34. The jurisdiction of the law enforcement agency is primarily the arrest of Department of Corrections' discretionary and statutory released violators and Department of Corrections' escapees and this must be its primary focus. The Department of Corrections Fugitive Apprehension Unit may respond to a law enforcement agency's request to exercise general law enforcement duties during the course of official duties by carrying out law enforcement activities at the direction of the law enforcement agency of jurisdiction. In addition, the unit may investigate criminal offenses in agency-operated correctional facilities and surrounding property.\nThe initial processing of a person arrested by the fugitive apprehension unit for an offense is the responsibility of the fugitive apprehension unit unless otherwise directed by the law enforcement agency with primary jurisdiction. A subsequent investigation is the responsibility of the law enforcement agency of the jurisdiction unless the law enforcement agency authorizes the fugitive apprehension unit to assume the subsequent investigation. At the request of the primary jurisdiction, the fugitive apprehension unit may assist in subsequent investigations or law enforcement efforts being carried out by the primary jurisdiction. Persons arrested for violations that the fugitive apprehension unit determines are not within the agency's jurisdiction must be referred to the appropriate local law enforcement agency for further investigation or disposition.\nThe fugitive apprehension unit must develop and file all policies required under state law for law enforcement agencies. The fugitive apprehension unit also must develop a policy for contacting law enforcement agencies in a city or county before initiating any fugitive surveillance, investigation, or apprehension within the city or county. Revisions of any of these policies must be filed with the board within ten days of the effective date of the revision. The Department of Corrections shall train all of its peace officers regarding the application of these policies.\nThe commissioner of corrections shall appoint a full-time peace officer, who shall serve in the classified service subject to the provisions of section 43A.01, subdivision 2, to be the chief law enforcement officer and to be responsible for the management of the fugitive apprehension unit. The chief law enforcement officer shall possess the necessary police and management experience to manage a law enforcement agency. The chief law enforcement officer will have supervisory responsibility for all fugitive apprehension unit members as defined in section 179A.03, subdivision 17. Supervisory personnel must be available any time fugitive apprehension unit members are on duty. The chief law enforcement officer may not hire part-time peace officers as defined in section 626.84, subdivision 1, paragraph (d).\n(a) The commissioner of corrections shall ensure that all emergency vehicles used by the fugitive apprehension unit are equipped with radios capable of receiving and transmitting on the same frequencies used by the law enforcement agencies that have primary jurisdiction.\n(b) When the fugitive apprehension unit receives an emergency call, it shall notify the public safety agency with primary jurisdiction and coordinate the appropriate response.\n(c) Fugitive apprehension unit officers shall notify the primary jurisdiction of their response to the emergency.\nExcept as otherwise provided in this section, the fugitive apprehension unit shall comply with all other statutes to include all deadly force training requirements as defined in section 626.8452 and all administrative rules relating to the operation and management of a law enforcement agency.",
	"repealed": false
}