{
	"id": "136A.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.091",
	"title": "136A.091 SUMMER ACADEMIC ENRICHMENT PROGRAM.",
	"text": "The summer academic enrichment program is established to enable elementary and secondary students to attend academic summer programs sponsored by postsecondary institutions and nonprofit organizations.\nTo be eligible for a program stipend, a student shall:\n(1) be a resident of Minnesota;\n(2) attend an eligible office-approved program;\n(3) be in grades 3 through 12, but not have completed high school;\n(4) meet income requirements for free or reduced-price school meals; and\n(5) be 19 years of age or younger.\nNeed for financial assistance is based on student eligibility for free or reduced-price school meals under the national school lunch program. Student eligibility shall be verified by sponsors of approved academic programs. The office shall award stipends for students within the limits of available appropriations for this section. If the amount appropriated is insufficient, the office shall allocate the available appropriation in the manner it determines. A stipend must not exceed $1,000 per student.\n(a) A program stipend may be used only at an eligible sponsor that is a postsecondary institution or nonprofit educational organization. A Minnesota public postsecondary institution is an eligible program sponsor. A private postsecondary institution is an eligible program sponsor if it:\n(1) is accredited by an agency recognized by the United States Department of Education for purposes of eligibility to participate in title IV federal financial aid programs;\n(2) offers an associate or baccalaureate degree program approved under sections 136A.61 to 136A.71; and\n(3) is located in Minnesota.\n(b) A nonprofit educational organization is an eligible program sponsor if it:\n(1) is incorporated;\n(2) has had favorable financial performance with federal or state funds; and\n(3) has not had significant audit findings.\nA program stipend may be used only for an eligible program. To be eligible, a program must:\n(1) provide, as its primary purpose, academic instruction for student enrichment in core curricular areas of English and language arts, humanities, social studies, science, mathematics, fine arts, performing arts, and world languages and culture;\n(2) not be offered for credit to postsecondary students;\n(3) not provide remedial instruction;\n(4) meet any other program requirements established by the office; and\n(5) be approved by the commissioner.\nThe office shall assemble and distribute information about eligible student participants, program stipends, and eligible programs.\nThe office shall determine the time and manner of program applications, program approval, stipend applications, and final awards.\nEach program sponsor must annually submit a report to the office stating its program goals, activities, and stipend recipient eligibility and demographic information.\nAnnually, the office shall submit a report to the legislative committees with jurisdiction over higher education finance regarding the program providers, stipend recipients, and program activities. The report shall include information about the students served, the organizations providing services, program goals and outcomes, and student outcomes.",
	"repealed": false
}