{
	"id": "327.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.23",
	"title": "327.23 CONSTRUCTION OF TERMS; MUNICIPAL PARKS.",
	"text": "Nothing in sections 327.10, 327.11, and 327.14 to 327.28, should be construed to include any of the state parks in Minnesota.\n(a) The term \"manufactured home park\" shall not be construed to include:\n(1) manufactured homes, buildings, tents or other structures temporarily maintained by any individual or company on premises associated with a work project and used exclusively to house labor or other personnel occupied in such work project; or\n(2) two or fewer manufactured homes maintained by an individual or company on premises associated with an agricultural operation in an area zoned agricultural, provided the homes:\n(i) are located within 100 yards of an existing residence on those premises;\n(ii) are used exclusively to house either family of the individual, at least one of whose members is engaged in agricultural work on the premises, or agricultural labor as defined in section 3121(g) of the Internal Revenue Code; and\n(iii) meet the requirements of sections 327.31 to 327.35, and Minnesota Rules, chapter 1350, and parts 4630.0600, subpart 1; 4630.0700; 4630.1200; 4630.3500; and 4714.0311.\n(b) The Department of Health may by rule prescribe such sanitary facilities as it may deem necessary to provide for the sanitation of such structures and the safety of the occupants thereof.\nThe term \"manufactured home park\" shall not be construed to include up to four manufactured homes maintained by an individual or a company on premises associated with a seasonal agricultural operation, in an area zoned agricultural, and used exclusively to house individuals or families performing labor as defined in section 3121(g) of the Internal Revenue Code if:\n(1) the manufactured homes are equipped with indoor plumbing facilities and meet the standards for water and sanitation established in Minnesota Rules, parts 4630.0600, subpart 1; 4630.0700; 4630.1200; 4630.3500; and 4714.0311;\n(2) each manufactured home provides at least 80 square feet of indoor living space for each of its inhabitants;\n(3) the manufactured homes and their installation comply with section 327.34, subdivision 1, and Minnesota Rules, chapter 1350;\n(4) the individual or company maintaining the manufactured homes, with the assistance and approval of the political subdivision where the homes are located, develops and posts in conspicuous locations near the homes, a shelter or safe evacuation plan in the event of severe weather conditions, such as tornadoes, high winds, and floods; and\n(5) the individual or company maintains the homes in a clean, orderly, and sanitary condition.\nAny manufactured home park or recreational camping area owned or operated by any municipality or political subdivision of this state shall meet all sanitary and safety provisions of sections 327.10, 327.11, 327.14 to 327.28, shall be inspected as herein provided, pay all fees, and make all reports, as herein required of a licensee.",
	"repealed": false
}