{
	"id": "327C.097",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.097",
	"title": "327C.097 NOTICE OF UNSOLICITED SALE.",
	"text": "For the purposes of this section, \"nonprofit\" means a nonprofit organization under chapter 317A.\nThis section does not apply to:\n(1) a purchase of a manufactured home park by a nonprofit or a representative acting on behalf of residents pursuant to a bona fide offer to purchase the park pursuant to subdivision 4;\n(2) a purchase of a manufactured home park by a governmental entity under its powers or threat of eminent domain;\n(3) a transfer by a corporation or limited liability company to an affiliate, including any shareholder or member of the transferring corporation; any corporation or entity owned or controlled, directly or indirectly, by the transferring corporation; or any other corporation or entity owned or controlled, directly or indirectly, by any shareholder or member of the transferring corporation;\n(4) a transfer by a partnership to any of its partners;\n(5) a sale or transfer between or among joint tenants or tenants in common owning a manufactured home park;\n(6) an exchange of a manufactured home park for other real property, whether or not such exchange also invoices the payment of cash or boot;\n(7) a conveyance of an interest in a manufactured home park incidental to the financing of the manufactured home park;\n(8) a conveyance resulting from the foreclosure of a mortgage, cancellation of a contract for deed, or other instrument encumbering a manufactured home park or any deed given in lieu of such foreclosure or cancellation;\n(9) a sale or transfer to a person who would be included within the intestate table of descent and distribution of the park owner; or\n(10) a park owner who, within the past year, has provided written notice pursuant to section 327C.096.\n(a) If a park owner receives an unsolicited bona fide offer to purchase the park that the park owner intends to consider or make a counteroffer to, the park owner's only obligation shall be to mail a notice to the Minnesota Housing Finance Agency, by certified mail, and to each park resident household, by regular mail. The notice must indicate that the park owner has received an offer that it is considering, and it must disclose the price range and material terms and conditions upon which the park owner would consider selling the park and consider any offer made by a representative acting on behalf of residents or a nonprofit that will become a representative acting on behalf of residents, as provided below. The park owner shall be under no obligation either to sell to the nonprofit or representative acting on behalf of residents or to interrupt or delay other negotiations and shall be free to execute a purchase agreement or contract for the sale of the park to a party or parties other than the representative acting on behalf of residents. Substantial compliance with the notice requirement in this paragraph shall be deemed sufficient.\n(b) The Minnesota Housing Finance Agency must, within five days of receipt of the notice required under paragraph (a), distribute a copy of the notice to any representative acting on behalf of residents and to any nonprofits that register with the agency to receive such notices. The agency shall make a list of any representatives acting on behalf of residents and any registered nonprofits publicly available on its website.\nNothing contained in this section or section 327C.096 shall prevent a representative acting on behalf of residents or a nonprofit from making an unsolicited bona fide offer to purchase the manufactured home park to the park owner at any time.",
	"repealed": false
}