{
	"id": "53B.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.70",
	"title": "53B.70 SCOPE.",
	"text": "(a) Sections 53B.71 to 53B.74 do not apply to the exchange, transfer, or storage of virtual currency or to virtual-currency administration to the extent the Electronic Fund Transfer Act of 1978, United States Code, title 15, sections 1693 to 1693r, as amended or recodified from time to time; the Securities Exchange Act of 1934, United States Code, title 15, sections 78a to 78oo, as amended or recodified from time to time; the Commodities Exchange Act of 1936, United States Code, title 7, sections 1 to 27f, as amended or recodified from time to time; or chapter 80A govern the activity.\n(b) Sections 53B.71 to 53B.74 do not apply to activity by:\n(1) a person that:\n(i) contributes only connectivity software or computing power to a decentralized virtual currency, or to a protocol governing transfer of the digital representation of value;\n(ii) provides only data storage or security services for a business engaged in virtual-currency business activity and does not otherwise engage in virtual-currency business activity on behalf of another person; or\n(iii) provides only to a person otherwise exempt from this chapter virtual currency as one or more enterprise solutions used solely among each other and has no agreement or relationship with a person that is an end-user of virtual currency;\n(2) a person using virtual currency, including creating, investing, buying or selling, or obtaining virtual currency as payment for the purchase or sale of goods or services, solely:\n(i) on the person's own behalf;\n(ii) for personal, family, or household purposes; or\n(iii) for academic purposes;\n(3) a person whose virtual-currency business activity with or on behalf of persons is reasonably expected to be valued, in the aggregate, on an annual basis at $5,000 or less, measured by the United States dollar equivalent of virtual currency;\n(4) an attorney to the extent of providing escrow services to a person;\n(5) a title insurance company to the extent of providing escrow services to a person; or\n(6) a securities intermediary, as defined under section 336.8-102 (14), or a commodity intermediary, as defined under section 336.9-102 (17), that:\n(i) does not engage in the ordinary course of business in virtual-currency business activity with or on behalf of a person in addition to maintaining securities accounts or commodities accounts and is regulated as a securities intermediary or commodity intermediary under federal law, law of Minnesota other than this chapter, or law of another state; and\n(ii) affords a person protections comparable to those set forth under section 53B.37.\n(c) Sections 53B.71 to 53B.74 do not apply to a secured creditor, as defined under sections 336.9-101 to 336.9-809 or to a creditor with a judicial lien or lien arising by operation of law on collateral that is virtual currency, if the virtual-currency business activity of the creditor is limited to enforcement of the security interest in compliance with sections 336.9-101 to 336.9-809 or lien in compliance with the law applicable to the lien.\n(d) Sections 53B.71 to 53B.74 do not apply to a virtual-currency control-services vendor.\n(e) Sections 53B.71 to 53B.74 do not apply to a person that:\n(1) does not receive compensation from a person to:\n(i) provide virtual-currency products or services; or\n(ii) conduct virtual-currency business activity; or\n(2) is engaged in testing products or services with the person's own money.\n(f) The commissioner may determine that a person or class of persons, given facts particular to the person or class, should be exempt from this chapter, whether the person or class is covered by requirements imposed under federal law on a money-service business.",
	"repealed": false
}