{
	"id": "115A.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.93",
	"title": "115A.93 LICENSING; SOLID WASTE COLLECTION.",
	"text": "(a) A person may not collect mixed municipal solid waste for hire without a license from the jurisdiction where the mixed municipal solid waste is collected. The local licensing entity shall submit a list of licensed collectors to the agency.\n(b) A person may not collect recyclable materials for hire unless registered with the agency. If a person is licensed under paragraph (a), the person need not register with the agency under this paragraph.\n(c) The agency, in consultation with the Solid Waste Management Coordinating Board, the Association of Minnesota Counties, the Minnesota Solid Waste Administrators Association, and representatives from the waste industry, shall, by July 1, 2016, develop uniform short and long reporting forms that will reduce duplicative reporting to governmental units by collectors of solid waste and recyclable materials.\n(d) A collector of mixed municipal solid waste or recyclable materials shall separately report to the agency on an annual basis information including, but not limited to, the quantity of mixed municipal solid waste and the quantity of recyclable materials collected:\n(1) from commercial customers;\n(2) from residential customers;\n(3) by county of origin; and\n(4) by destination of the material.\n(a) Each city and town may issue licenses for persons to collect mixed municipal solid waste for hire within their jurisdictions.\n(b) County boards shall by resolution adopt the licensing authority of a city or town that does not issue licenses. A county may delegate its licensing authority to a consortium of counties or to municipalities to license collection of mixed municipal solid waste within the county.\n(a) A licensing authority shall require licensees to impose charges for collection of mixed municipal solid waste that increase with the volume or weight of the waste collected.\n(b) A licensing authority may impose requirements that are consistent with the county's solid waste policies as a condition of receiving and maintaining a license.\n(c) A licensing authority shall prohibit mixed municipal solid waste collectors from imposing a greater charge on residents who recycle than on residents who do not recycle.\n(d) The commissioner may exempt a licensing authority from the requirements of paragraph (a) if the county within which the authority is located has an approved solid waste management plan that concludes that variable rate pricing is not appropriate for that jurisdiction because it is inconsistent with other incentives and mechanisms implemented within the jurisdiction that are more effective in attaining the goals of this chapter to discourage on-site disposal, littering, and illegal dumping.\n(e) In the interim between revisions to the county solid waste management plan, the commissioner may exempt a licensing authority from the requirements of paragraph (a) if the commissioner makes the determination otherwise made by the plan in paragraph (d) and finds that the licensing authority:\n(1) operates or contracts for the operation of a residential recycling program that collects more categories of recyclable materials than required in section 115A.552;\n(2) has a residential participation rate in its recycling programs of at least 70 percent or in excess of the participation rate for the county in which it is located, whichever is greater; and\n(3) is located in a county that has exceeded the recycling goals in section 115A.551.\nAn exemption granted by the commissioner in the interim between revisions to the county solid waste management plan is only effective until the county solid waste management plan is revised.\nA licensing authority that requires a pricing system based on volume instead of weight under subdivision 3 shall determine a base unit size for an average small quantity household generator and establish, or require the licensee to establish, a multiple unit pricing system that ensures that amounts of waste generated in excess of the base unit amount are priced higher than the base unit price.\nBy January 1, 1993, each county shall ensure that each city or town within the county requires each mixed municipal solid waste collector that provides curbside collection service in the city or town to obtain a license under this section or the county shall directly require and issue the licenses. No person may collect mixed municipal solid waste after January 1, 1993, without a license.\nCustomer lists provided to counties or cities by solid waste collectors are private data on individuals as defined in section 13.02, subdivision 12, with regard to data on individuals, or nonpublic data as defined in section 13.02, subdivision 9, with regard to data not on individuals.",
	"repealed": false
}