{
	"id": "473.541",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.541",
	"title": "473.541 DEBT OBLIGATIONS.",
	"text": "At any time or times after approval of an annual budget, and in anticipation of the collection of tax and other revenues appropriated in the budget, the council may by resolution authorize the issuance, negotiation, and sale, in such form and manner and upon such terms as it may determine, of general obligation certificates of indebtedness in aggregate principal amounts not exceeding 50 percent of the total amount of such appropriations, and maturing not later than April 1 following the close of the budget year. All receipts of tax and other revenues included in the budget, after the expenditure of appropriated funds, shall be irrevocably appropriated to a special fund to pay the principal of and the interest on the certificates when due. If for some reason the anticipated revenues are insufficient to pay the certificates and interest thereon when due, the council shall levy a tax in the amount of the deficiency on all taxable property in the metropolitan area, and shall appropriate this amount to the special fund, to be credited thereto from the first tax and other revenues received in the following budget year.\nIf in any budget year the receipts of tax and other revenues should from some unforeseen cause become insufficient to pay the council's current wastewater services expenses, or if any calamity or other public emergency should subject it to the necessity of making extraordinary wastewater services expenditures, the council may make an emergency appropriation of an amount sufficient to meet the deficiency and may authorize the issuance, negotiation, and sale of certificates of indebtedness in this amount in the same manner and upon the same conditions as provided in subdivision 1. The council may levy on all taxable property in the metropolitan area a tax sufficient to pay the certificates and interest thereon, and shall appropriate all collections of such tax to a special fund created for that purpose. The certificates may mature not later than April in the year following the year in which any levied tax is collectible.\nThe council may by resolution authorize the issuance of general obligation bonds for the acquisition or betterment of any interceptors or treatment works determined to be necessary or desirable for the metropolitan disposal system, or for the refunding of outstanding bonds, certificates of indebtedness, or judgments. The council shall provide for the issuance and sale and for the security of such bonds in the manner provided in chapter 475, and shall have the same powers and duties as a municipality issuing bonds under that law, except that no election shall be required and the net debt limitations in chapter 475 shall not apply to such bonds. The council may also pledge for the payment of such bonds any revenues receivable under section 473.517.\n(a) The council may, by resolution, authorize the issuance of revenue bonds for any purpose for which general obligation bonds may be issued under subdivision 3. The bonds shall be sold, issued, and secured in the manner provided in chapter 475 for bonds payable solely from revenues, except as otherwise provided in this subdivision, and the council shall have the same powers and duties as a municipality and its governing body in issuing bonds under that chapter. The bonds shall be payable from and secured by a pledge of all or any part of revenues receivable under section 473.517, shall not, and shall state they do not, represent or constitute a general obligation or debt of the council, and shall not be included in the net debt of any city, county, or other subdivision of the state for the purpose of any net debt limitation. The proceeds of the bonds may be used to pay credit enhancement fees.\n(b) The bonds may be secured by a bond resolution, or a trust indenture entered into by the council with a corporate trustee within or outside the state, which shall define the revenues and bond proceeds pledged for the payment and security of the bonds. The pledge shall be a valid charge on the revenues received under section 473.517. No mortgage of or security interest in any tangible real or personal property shall be granted to the bondholders or the trustee, but they shall have a valid security interest in the revenues and bond proceeds received by the council and pledged to the payment of the bonds as against the claims of all persons in tort, contract, or otherwise, irrespective of whether such parties have notice thereof and without possession or filing as provided in the Uniform Commercial Code or any other law, subject, however, to the rights of the holders of any general obligation bonds issued under subdivision 3. In the bond resolution or trust indenture, the council may make such covenants as it determines to be reasonable for the protection of the bondholders, including a covenant to issue general obligation bonds to refund the revenue bonds if and to the extent required to pay principal and interest on the bonds and to certify a deficiency tax levy as provided in section 473.521, subdivision 4.\n(c) Neither the council, nor any council member, officer, employee, or agent of the council, nor any person executing the bonds shall be liable personally on the bonds by reason of their issuance. The bonds shall not be payable from nor a charge upon any funds other than the revenues and bond proceeds pledged to the payment thereof, nor shall the council be subject to any liability thereon or have the power to obligate itself to pay or to pay the bonds from funds other than the revenues and bond proceeds pledged, and no holder or holders of bonds shall ever have the right to compel any exercise of the taxing power of the council (except any deficiency tax levy the council covenants to certify under section 473.521, subdivision 4) or any other public body, to the payment of principal of or interest on the bonds, nor to enforce payment thereof against any property of the council or other public body other than that expressly pledged for the payment thereof.",
	"repealed": false
}