{
	"id": "62S.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.22",
	"title": "62S.22 MINIMUM STANDARDS FOR HOME HEALTH AND COMMUNITY CARE BENEFITS.",
	"text": "A long-term care insurance policy or certificate shall not, if it provides benefits for home health care or community care services, limit or exclude benefits by:\n(1) requiring that the insured would need care in a skilled nursing facility if home health care services were not provided;\n(2) requiring that the insured first or simultaneously receive nursing or therapeutic services in a home, community, or institutional setting before home health care services are covered;\n(3) limiting eligible services to services provided by a registered nurse or licensed practical nurse;\n(4) requiring that a nurse or therapist provide services covered by the policy that can be provided by a home health aide or other licensed or certified home care worker acting within the scope of licensure or certification;\n(5) excluding coverage for personal care services provided by a home health aide;\n(6) requiring that the provision of home health care services be at a level of certification or licensure greater than that required by the eligible service;\n(7) requiring that the insured have an acute condition before home health care services are covered;\n(8) limiting benefits to services provided by Medicare-certified agencies or providers;\n(9) excluding coverage for adult day care services; or\n(10) excluding coverage based upon location or type of residence in which the home health care services would be provided.\nA long-term care insurance policy or certificate, if it provides for home health or community care services, must provide total home health or community care coverage that is a dollar amount equivalent to at least one-half of one year's coverage available for nursing home benefits under the policy or certificate, at the time covered home health or community care services are being received. This requirement does not apply to policies or certificates issued to residents of continuing care retirement communities.\nHome health care coverage may be applied to the nonhome health care benefits provided in the policy or certificate when determining maximum coverage under the terms of the policy or certificate.",
	"repealed": false
}