{
	"id": "115A.921",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.921",
	"title": "115A.921 CITY OR TOWN; FEE AUTHORITY.",
	"text": "(a) A city or town may impose a fee, not to exceed $1 per cubic yard of waste, or its equivalent, on operators of facilities for the disposal of mixed municipal solid waste located within the city or town. The revenue from the fees must be credited to the city or town general fund. Revenue produced by 25 cents of the fee must be used only for purposes of landfill abatement or for purposes of mitigating and compensating for the local risks, costs, and other adverse effects of facilities. Revenue produced by the balance of the fee may be used for any general fund purpose.\n(b) Waste residue from recycling facilities at which recyclable materials are separated or processed for the purpose of recycling, or from energy and resource recovery facilities at which solid waste is processed for the purpose of extracting, reducing, converting to energy, or otherwise separating and preparing solid waste for reuse shall be exempt from the fee imposed by a city or town under this section if there is at least an 85 percent weight reduction in the solid waste processed. Before any fee is reduced, the verification procedures of section 473.843, subdivision 1, paragraph (c), must be followed and submitted to the appropriate city or town, except that for facilities operating outside of the metropolitan area the commissioner shall prescribe procedures for verifying the required 85 percent weight reduction.\n(a) A city or town may impose a fee, not to exceed 50 cents per cubic yard of waste, or its equivalent, on operators of facilities for the disposal of construction debris located within the city or town. The revenue from the fees must be credited to the city or town general fund. Two-thirds of the revenue must be used only for purposes of landfill abatement or for purposes of mitigating and compensating for the local risks, costs, and other adverse effects resulting from the facilities.\n(b) A facility permitted for the disposal of construction debris is exempt from 25 percent of a fee imposed under this subdivision if the facility has implemented a recycling program that has been approved by the county and 25 percent if the facility contains a liner and leachate collection system approved by the agency.\n(c) Two-thirds of the revenue from fees collected under this subdivision must offset any financial assurances required by the city or town for a construction debris facility.\n(d) The maximum revenue that may be collected under this subdivision must be determined by multiplying the total permitted capacity of a facility by 15 cents per cubic yard. Once the maximum revenue has been collected for a facility, the fees in this subdivision may no longer be imposed.",
	"repealed": false
}