{
	"id": "353.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.37",
	"title": "353.37 REEMPLOYMENT OF ANNUITANT.",
	"text": "(a) If a member who is receiving an annuity from a retirement plan administered by the association is employed by (1) a governmental employer in a nonelected position not required by law to be covered by a plan administered by the Minnesota State Retirement System, the Teachers Retirement Association, or the St. Paul Teachers Retirement Fund Association, or (2) by a labor organization that represents public employees who are association members under this chapter, and the member's salary exceeds the annual maximum salary defined in paragraph (b), the annuity shall be suspended under subdivision 2 or reduced under subdivision 3, whichever results in the higher annuity amount.\n(b) The annual maximum salary means the annual maximum earnings allowable at the member's age for the continued receipt of full benefit amounts monthly under the federal Old Age, Survivors and Disability Insurance Program as set by the secretary of health and human services under United States Code, title 42, section 403, in effect for the calendar year. If the member has not yet reached the minimum age for the receipt of Social Security benefits, the maximum salary means the annual maximum earnings allowable for the minimum age for the receipt of Social Security benefits.\n(c) The provisions of paragraph (a) do not apply to the members of the general employees plan of the Public Employees Retirement Association who were former members of MERF.\n[Repealed, 1981 c 180 s 18]\nFor purposes of this section, \"retirement age\" means retirement age as defined in United States Code, title 42, section 416(l).\nMS 1971 [Repealed, 1973 c 753 s 85]\n(a) The association shall suspend the annuity on the first of the month after the month in which the salary of the reemployed annuitant described in subdivision 1, paragraph (a), exceeds the maximums set in subdivision 1, paragraph (b), based only on those months in which the annuitant is actually employed in nonelective public service in a position covered under this chapter or employment with a labor organization that represents public employees who are members of a retirement plan under this chapter or chapter 353E.\n(b) An annuitant who is elected to public office after retirement may hold that office and receive an annuity otherwise payable from a retirement plan administered by the association.\nMS 1971 [Repealed, 1973 c 753 s 85]\n(a) The association shall reduce the amount of the annuity of a person who has not reached the retirement age by one-half of the amount in excess of the applicable maximums under subdivision 1, paragraph (b).\n(b) There is no reduction upon reemployment, regardless of income, for a person who has reached the retirement age.\n(a) The balance of the annual retirement annuity after suspension or the amount of the retirement annuity reduction must be handled or disposed of as provided in section 356.47.\n(b) If a reemployed annuitant whose annuity is suspended is having insurance premium amounts withheld under section 356.87, subdivision 2, insurance premium amounts must continue to be withheld and transferred from the suspended portion of the annuity. The balance of the annual retirement annuity after cessation, after deduction of the insurance premium amounts, must be treated as specified in paragraph (a).\nThe association shall resume paying a full annuity to the reemployed annuitant described in subdivision 1, paragraph (a), at the start of each calendar year until the salary exceeds the maximums under subdivision 1, paragraph (b), or on the first of the month following the termination of the employment which resulted in the suspension of the annuity. The executive director may adopt policies regarding the suspension and reduction of annuities under this section.\nExcept as provided under this section, public service performed by an annuitant described in subdivision 1, paragraph (a), subsequent to retirement from the general employees retirement plan, the public employees police and fire retirement plan, or the local government correctional employees retirement plan does not increase or decrease the amount of an annuity. The annuitant shall not make any further contributions to a defined benefit plan administered by the association by reason of this subsequent public service.\nNotwithstanding other subdivisions of this section, if a reemployed annuitant whose annuity is suspended or reduced under this section has a former spouse receiving a portion of the annuity under section 518.58, subdivision 1, the portion payable to the former spouse must not be suspended or deferred.",
	"repealed": false
}