{
	"id": "121A.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.43",
	"title": "121A.43 EXCLUSION AND EXPULSION OF PUPILS WITH A DISABILITY.",
	"text": "(a) Consistent with federal law governing days of removal and section 121A.46, school personnel may suspend a child with a disability. When a child with a disability has been suspended for more than five consecutive school days or ten cumulative school days in the same school year, and that suspension does not involve a recommendation for expulsion or exclusion or other change of placement under federal law, relevant members of the child's individualized education program team, including at least one of the child's teachers, shall meet and determine the extent to which the child needs services in order to continue to participate in the general education curriculum, although in another setting, and to progress toward meeting the goals in the child's individualized education program. That meeting must occur as soon as possible, but no more than ten days after the sixth consecutive day of suspension or the tenth cumulative day of suspension has elapsed.\n(b) A dismissal for one school day or less is a day or a partial day of suspension if the child with a disability does not receive regular or special education instruction during that dismissal period. The notice requirements under section 121A.46 do not apply to a dismissal of one day or less.\n(c) A child with a disability shall be provided alternative educational services to the extent a suspension exceeds five consecutive school days.\n(d) Before initiating an expulsion or exclusion under sections 121A.40 to 121A.56, the district, relevant members of the child's individualized education program team, and the child's parent shall, consistent with federal law, determine whether the child's behavior was caused by or had a direct and substantial relationship to the child's disability and whether the child's conduct was a direct result of a failure to implement the child's individualized education program. When a child with a disability who has an individualized education program is excluded or expelled under sections 121A.40 to 121A.56 for misbehavior that is not a manifestation of the child's disability, the district shall continue to provide special education and related services during the exclusion or expulsion.",
	"repealed": false
}