{
	"id": "507.235",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.235",
	"title": "507.235 FILING CONTRACTS FOR DEED.",
	"text": "All contracts for deed executed on or after January 1, 1984, shall be recorded by the vendee within four months in the office of the county recorder or registrar of titles in the county in which the land is located. Any other person may record the contract. This filing period may be extended if failure to pay the property tax due in the current year on a parcel as required in section 272.121 has prevented filing and recording of the contract. In the case of a parcel that was divided and classified under section 273.13 as class 1a or 1b, the period may be extended to October 31 of the year in which the sale occurred, and in the case of a parcel that was divided and classified under section 273.13 as class 2a, the period may be extended to November 30 of the year in which the sale occurred.\nA person receiving an assignment of a vendee's interest in a contract for deed that is transferred on or after January 1, 1989, shall record the assignment within four months of the date of transfer in the office of the county recorder or registrar of titles in the county in which the land is located. For the purpose of this section, \"assignment\" means an assignment or other transfer of all or part of a vendee's interest in a contract for deed. Any other person may record an assignment.\n(a) A vendor entering into a contract for deed involving residential real property must, contemporaneously with the execution of the contract for deed deliver to the vendee a copy of the contract for deed containing original signatures in recordable form.\n(b) Within four months of the execution of the contract for deed, the vendor must:\n(1) pay any delinquent taxes necessary for recordation of the contract for deed; and\n(2) record the contract for deed in the office of the county recorder or registrar of titles in the county in which the land is located.\n(c) The following statement included in a contract for deed for other than residential real property shall constitute prima facie evidence that this subdivision does not apply: \"The property is not residential real property.\"\n(d) If the contract for deed is not in recordable form, within four months of the execution of the contract for deed, the vendor must make a good faith effort to correct the defects that rendered the contract unrecordable. A good faith effort includes but is not limited to determining the reason or reasons why the contract was not in recordable form, and revising and, if necessary, having all parties re-execute, the contract to render it in recordable form. The vendee must, in good faith, cooperate with the vendor to the extent that cooperation is necessary to correct the defects.\n(e) For purposes of this subdivision:\n(1) \"contract for deed\" means an executory contract for the conveyance of residential real property under which the seller provides financing for the purchase of the residential real property and under which the purchaser does or has a right to go into possession. Contract for deed does not include:\n(i) a purchase agreement;\n(ii) an earnest money contract;\n(iii) an exercised option or a lease, including a lease with an option to purchase; or\n(iv) a mortgage, as defined in section 287.01; and\n(2) \"residential real property\" means real property consisting of one to four family dwelling units, one of which is intended to be occupied as the principal place of residence by:\n(i) the purchaser;\n(ii) if the purchaser is an entity, the natural person who is the majority or controlling owner of the entity; or\n(iii) if the purchaser is a trust, the settlor of the trust.\nResidential real property does not include a transaction subject to sections 583.20 to 583.32.\n(f) The performance of the obligations by the vendor required under this subdivision satisfies any of the obligations of the original vendee, as required under subdivision 1.\n(g) The requirements of this subdivision may not be waived or altered by any provision in a contract for deed. A provision in a contract for deed to the contrary is void and unenforceable.\n(a) A vendee who fails to record a contract for deed, as required by subdivision 1, is subject to a civil penalty, payable under subdivision 5, equal to two percent of the principal amount of the contract debt, unless the vendee has not received a copy of the contract for deed in recordable form, as required under subdivision 1a. Payments of the penalty shall be deposited in the general fund of the county. The penalty may be enforced as a lien against the vendee's interest in the property.\n(b) A person receiving an assignment of a vendee's interest in a contract for deed who fails to record the assignment as required by subdivision 1 is subject to a civil penalty, payable under subdivision 5, equal to two percent of the original principal amount of the contract debt. Payments of the penalty must be deposited in the general fund of the county. The penalty may be enforced as a lien against the vendee's interest in the property.\n(a) Whenever a contract for deed or assignment of a vendee's interest in a contract for deed is not recorded and a city or county attorney requires information concerning the contract for deed or assignment of contract for deed for the performance of the attorney's duties on behalf of the city or county, the city or county attorney may request disclosure under paragraph (b).\n(b) A vendor, vendee, or current or former holder of a vendor's or vendee's interest in a contract for deed, a person who collects payments made under a contract for deed, or a person in possession of the property subject to a contract for deed shall, on written request that includes a copy of this section made by the city or county attorney of the city or county in which the property is located, disclose all information known to the person relating to:\n(1) the identity and residence or office mailing address of the parties to the contract for deed; and\n(2) any assignments of the contract for deed.\nThe disclosure also must include any legible, true and correct copies of each contract for deed and assignment documents in the possession of or reasonably available to the person required to disclose.\nThe information must be disclosed in writing to the city or county attorney within 14 days of receipt of the written request.\nMS 2012 [Repealed, 2013 c 85 art 6 s 13]\n(a) A city in which the land is located or, if the land is not located within a city, the county in which the land is located, may enforce the provisions of this section. The city or county may bring an action to compel the recording of a contract for deed or any assignments of a contract for deed, an action to impose the civil penalty, or an action to compel disclosure of information.\n(b) Prior to bringing an action under this subdivision to compel recording or to impose the penalty, the city or county must provide written notice to the person, subject to subdivision 1, of the person's duty to record the contract for deed or the assignment. If the person so notified fails to record the contract for deed or assignment documents within 14 days of receipt of the notice, an action may be brought.\n(c) It is an affirmative defense in an enforcement action under this section that the contract for deed or assignment document is not recordable, or that section 272.121 prohibits the recording of the contract for deed or assignment, and that the defendant has provided to the city or county attorney true and correct copies of the documents within 14 days after receipt of the notice.\n(d) In an action brought under this subdivision, the city or county attorney may recover costs and disbursements, including reasonable attorney fees.",
	"repealed": false
}