{
	"id": "326.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.71",
	"title": "326.71 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 326.70 to 326.81.\n\"Asbestos\" means the asbestiform varieties of chrysotile (serpentine), crocidolite (riebeckite), amosite (cummingtonite-grunerite), anthophyllite, tremolite, and actinolite.\n\"Asbestos-containing material\" means material that contains more than one percent asbestos by microscopic visual estimation by area.\n\"Asbestos-related work\" means the enclosure, removal, or encapsulation of asbestos-containing material in a quantity that meets or exceeds 260 linear feet of friable asbestos-containing material on pipes, 160 square feet of friable asbestos-containing material on other facility components, or, if linear feet or square feet cannot be measured, a total of 35 cubic feet of friable asbestos-containing material on or off all facility components in one facility. In the case of single or multifamily residences, \"asbestos-related work\" also means the enclosure, removal, or encapsulation of greater than ten but less than 260 linear feet of friable asbestos-containing material on pipes, greater than six but less than 160 square feet of friable asbestos-containing material on other facility components, or, if linear feet or square feet cannot be measured, greater than one cubic foot but less than 35 cubic feet of friable asbestos-containing material on or off all facility components in one facility. Asbestos-related work includes asbestos abatement area preparation; enclosure, removal, or encapsulation operations; and an air quality monitoring specified in rule to assure that the abatement and adjacent areas are not contaminated with asbestos fibers during the project and after completion.\nFor purposes of this subdivision, the quantity of asbestos-containing material applies separately for every project.\n\"Asbestos inspector\" means an individual who inspects a site for the presence and condition of asbestos-containing material, or who reinspects a site to assess the condition of previously identified asbestos-containing material or the presence of other asbestos-containing material.\n\"Asbestos management activity\" means the performance of periodic inspections to determine the existence and condition of asbestos-containing material, the development of site specific written programs for the maintenance of asbestos-containing material in a condition which prevents the release of asbestos fibers, the development of site specific written programs governing response procedures in the event of an asbestos fiber release episode, and the development of project specifications for asbestos-related work projects.\n\"Asbestos management planner\" means an individual who develops a written site specific asbestos-containing material maintenance plan and a written site specific asbestos fiber release episode response plan addressing asbestos-containing material at the site.\n\"Asbestos project designer\" means an individual who designs the asbestos-related work project specifications.\n\"Commissioner\" means the commissioner of health.\n\"Contracting entity\" means a public or private body, board, natural person, corporation, partnership, proprietorship, joint venture, fund, authority, or similar entity that contracts with a person to do asbestos-related work or asbestos management activity for the benefit of the contracting entity.\n[Repealed, 1993 c 303 s 21]\n\"Person\" means an individual, body, board, corporation, partnership, proprietorship, joint venture, fund, authority, or similar entity. This term also applies to the state, its political subdivisions, and any boards, commissions, schools, institutions, or authorities created or recognized by them.",
	"repealed": false
}