{
	"id": "148.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.76",
	"title": "148.76 PROHIBITED CONDUCT.",
	"text": "No person shall:\n(1) provide physical therapy unless the person is licensed as a physical therapist or physical therapist assistant under sections 148.65 to 148.78;\n(2) use the title of physical therapist without a license as a physical therapist or use the title physical therapist assistant without a license as a physical therapist assistant issued under sections 148.65 to 148.78;\n(3) in any manner hold out as a physical therapist, or use in connection with the person's name the words or letters Physical Therapist, Physiotherapist, Physical Therapy Technician, Registered Physical Therapist, Licensed Physical Therapist, PT, PTT, RPT, LPT, or any letters, words, abbreviations or insignia indicating or implying that the person is a physical therapist, without a license as a physical therapist issued under sections 148.65 to 148.78. To do so is a gross misdemeanor;\n(4) in any manner hold out as a physical therapist assistant, or use in connection with the person's name the words or letters Physical Therapist Assistant, P.T.A., or any letters, words, abbreviations, or insignia indicating or implying that the person is a physical therapist assistant, without a license as a physical therapist assistant under sections 148.65 to 148.78. To do so is a gross misdemeanor; or\n(5) employ fraud or deception in applying for or securing a license as a physical therapist or physical therapist assistant.\nNothing in sections 148.65 to 148.78 prohibits a person licensed or registered in this state under another law from carrying out the therapy or practice for which the person is duly licensed or registered.\n(a) No physical therapist may:\n(1) treat human ailments by physical therapy after an initial 90-day period of patient admittance to treatment has lapsed, except by the order or referral of a person licensed in this state to practice medicine as defined in section 147.081, the practice of chiropractic as defined in section 148.01, the practice of podiatry as defined in section 153.01, the practice of dentistry as defined in section 150A.05, or the practice of advanced practice nursing as defined in section 62A.15, subdivision 3a, when orders or referrals are made in collaboration with a physician, chiropractor, podiatrist, or dentist, and whose license is in good standing; or when a previous diagnosis exists indicating an ongoing condition warranting physical therapy treatment, subject to periodic review defined by Board of Physical Therapy rule. The 90-day limitation of treatment by a physical therapist without an order or referral does not apply to prevention, wellness, education, or exercise;\n(2) use any chiropractic manipulative technique whose end is the chiropractic adjustment of an abnormal articulation of the body; and\n(3) treat human ailments other than by physical therapy unless duly licensed or registered to do so under the laws of this state.\n(b) No physical therapist licensed less than one year may treat human ailments, without referral, by physical therapy treatment without first having practiced one year in collaboration with a physical therapist with more than one year of experience or under a physician's orders or referrals as verified by the board's records.",
	"repealed": false
}