{
	"id": "17.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.63",
	"title": "17.63 REFUND OF FEES.",
	"text": "(a) Any producer, except a producer of potatoes in area number one, as listed in section 17.54, subdivision 9, a producer of wheat or barley, a producer of canola, or a producer of cultivated wild rice, may, by the use of forms to be provided by the commissioner and upon presentation of such proof as the commissioner requires, have the checkoff fee paid pursuant to sections 17.51 to 17.69 fully or partially refunded, provided the checkoff fee was remitted on a timely basis. The request for refund must be received in the office of the commissioner within the time specified in the promotion order following the payment of the checkoff fee. In no event shall these requests for refund be accepted more often than 12 times per year. Refund shall be made by the commissioner and council within 30 days of the request for refund provided that the checkoff fee sought to be refunded has been received. Rules governing the refund of checkoff fees for all commodities shall be formulated by the commissioner, shall be fully outlined in the promotion order, and shall be available for the information of all producers concerned with the referendum.\n(b) The commissioner must allow partial refund requests from corn producers who have checked off and must allow for assignment of payment to the Minnesota Corn Growers Association if the Minnesota Corn Research and Promotion Council requests such action by the commissioner.\n(c) The Minnesota Corn Research and Promotion Council shall not elect to impose membership on any individual producer not requesting a partial refund or assignment of payment to the association.\n(d) For any wheat, barley, or cultivated wild rice for which the checkoff fee must be paid pursuant to sections 17.51 to 17.69 and for which a checkoff fee or fee that serves a comparable purpose in a jurisdiction outside Minnesota had been previously paid for the same wheat, barley, or cultivated wild rice, the producer of the wheat, barley, or cultivated wild rice is exempt from payment of the checkoff fee. The commissioner, in consultation with the Wheat Research and Promotion Council, Barley Research and Promotion Council, and Cultivated Wild Rice Research and Promotion Council, shall determine jurisdictions outside of Minnesota which collect a checkoff fee or fee that serves a comparable purpose. In order to qualify for the exemption, the producer must demonstrate to the first purchaser that a checkoff fee or fee has been paid to such a jurisdiction.",
	"repealed": false
}