{
	"id": "145.9574",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9574",
	"title": "145.9574 GRANTS.",
	"text": "The commissioner of health must, within available appropriations, make a grant to a nonprofit organization to create or sustain a multidisciplinary network of representatives of health care systems, health care providers, academic institutions, local and state agencies, and community partners that will collaboratively improve pregnancy and infant outcomes through evidence-based, population-level quality improvement initiatives.\n(a) The commissioner of health must award grants to eligible applicants to convene, coordinate, and implement data-driven strategies and culturally relevant activities to improve infant health by reducing preterm birth, sleep-related infant deaths, and congenital malformations and address social and environmental determinants of health. Eligible entities include community nonprofit organizations, Tribal governments, and community health boards. In accordance with available funding, the commissioner may award grants on a noncompetitive basis to the 11 sovereign Tribal governments if their respective proposals demonstrate the ability to implement programs designed to achieve the purposes in subdivision 1 and meet other requirements of this section. An eligible applicant must submit a complete application to the commissioner of health by the deadline established by the commissioner. The commissioner must award all other grants competitively to eligible applicants in metropolitan and rural areas of the state and may consider geographic representation in grant awards.\n(b) Grantee activities must:\n(1) address the leading cause or causes of infant mortality;\n(2) be based on community input;\n(3) focus on policy, systems, and environmental changes that support infant health; and\n(4) address the health disparities and inequities that are experienced in the grantee's community.\n(c) The commissioner must review each application to determine whether the application is complete and whether the applicant and the project are eligible for a grant. In evaluating applications according to this subdivision, the commissioner must establish criteria including but not limited to: the eligibility of the applicant's project under this section; the applicant's thoroughness and clarity in describing the infant health issues grant funds are intended to address; a description of the applicant's proposed project; the project's likelihood to achieve the grant's purposes as described in this section; a description of the population demographics and service area of the proposed project; and evidence of efficiencies and effectiveness gained through collaborative efforts.\n(d) Grant recipients must report their activities to the commissioner in a format and at a time specified by the commissioner.",
	"repealed": false
}