{
	"id": "123A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.21",
	"title": "123A.21 SERVICE COOPERATIVES.",
	"text": "(a) Ten service cooperatives, hereafter designated as SCs, are established. Geographical boundaries for each SC shall coincide with those identified in governor's executive orders 8, dated September 1, 1971, and 59, dated May 29, 1973, issued pursuant to the Regional Development Act of 1969, sections 462.381 to 462.397, with the following exceptions:\n(1) development regions one and two shall be combined to form a single SC;\n(2) development regions six east and six west shall be combined to form a single SC; and\n(3) development regions seven east and seven west shall be combined to form a single SC.\n(b) The SC shall cooperate with the regional development commission for the region with which its boundaries coincide but shall not be responsible to nor governed by that regional development commission.\n(c) Two or more identified SCs may, upon approval by a majority of the members in each affected SC, be combined and administered as a single SC.\nThe primary purposes of designation as a SC shall be to perform planning on a regional basis and to assist in meeting specific needs of clients in participating governmental units which could be better provided by a SC than by the members themselves. The SC must provide those programs and services which are determined, pursuant to subdivision 7, to be priority needs of the particular region and must assist in meeting special needs which arise from fundamental constraints upon individual members.\nFull membership in a SC shall be limited to public school districts, cities, counties, and other governmental units as defined in section 471.59, but nonvoting memberships shall be available to nonpublic school administrative units and other partnership agencies or organizations within the SC. A school district, city, county, or other governmental unit or nonprofit organization may belong to one or more SCs. Participation in programs and services provided by the SC shall be discretionary. No school district, city, county, or other governmental unit shall be compelled to participate in these services under authority of this section. Nonpublic school students and personnel are encouraged to participate in programs and services to the extent allowed by law.\n(a) The care, management, and control of a SC shall be vested in a board of directors composed of not less than six nor more than 15 members. A majority of the members of the SC board of directors shall be current members of school boards of participating public school districts. Election of the school board members to the SC board of directors shall be by vote of all current school board members of participating public school districts with each school board member having one vote. The remaining board members may be representatives at large appointed by the board members or elected as representatives by other participating agencies, such as cities, counties, or other governmental units.\n(b) The election timeline shall be compatible with those for school board members and shall be addressed within the bylaws of each SC.\n(c) A vacancy on the SC board which results in an unexpired term may be filled by appointment by the SC board of directors until such vacancy can be filled at the next board election.\n(d) At the organizational meeting, the SC board shall choose its officers and conduct any other necessary organizational business. The SC board may, at its discretion, appoint up to three members at large to the SC board as ex officio, nonvoting members of the board and shall encourage the advisory participation of a cross-section of school and agency personnel within the SC to the extent allowed by law.\n(e) The officers of the SC board shall be a chair, vice-chair, clerk, and treasurer, no two of whom when possible shall be from the same agency.\n(f) A member of the SC board shall have the same liability applicable to a member of an independent school board or other elected governmental officials.\nThe board of directors shall have authority to maintain and operate a SC. Subject to the availability of necessary resources, the powers and duties of this board shall include the following:\n(a) The board of directors shall submit, by June 1 of each year to each participating member, an annual plan which describes the objectives and procedures to be implemented in assisting in resolution of the needs of the SC.\n(b) The SC board of directors shall provide adequate office, service center, and administrative facilities by lease, purchase, gift, or otherwise.\n(c) The SC board of directors shall employ a central administrative staff and other personnel as necessary to provide and support the agreed-upon programs and services. The board may discharge staff and personnel pursuant to applicable provisions of law. SC staff and personnel may participate in retirement programs and any other programs available to public school staff and personnel.\n(d) The SC board of directors may appoint special advisory committees composed of superintendents, central office personnel, building principals, teachers, parents, lay persons, and representatives from cities, counties, and other governmental units.\n(e) The SC board of directors may employ service area personnel pursuant to licensure and certification standards developed by the appropriate state agency such as the commissioner and the Professional Educator Licensing and Standards Board.\n(f) The SC board of directors may enter into contracts with school boards of local districts including school districts outside the SC area.\n(g) The SC board of directors may enter into contracts with other public and private agencies and institutions to provide administrative staff and other personnel as necessary to furnish and support the agreed-upon programs and services.\n(h) The SC board of directors shall exercise all powers and carry out all duties delegated to it by members under provisions of the SC bylaws. The SC board of directors shall be governed, when not otherwise provided, by applicable laws of the state.\n(i) The SC board of directors shall submit an annual evaluation report of the effectiveness of programs and services to the members by September 1 of each year following the previous June 30 in which the programs and services were provided.\n(j) The SC board is encouraged to establish cooperative, working relationships and partnerships with postsecondary educational institutions, other public agencies, business, and industry.\nThere may be advisory councils selected to give advice and counsel to the SC board of directors. The councils may be composed of representatives from public and nonpublic schools, cities, counties, and other governmental units.\n(a) The board of directors of each SC shall submit annually a plan to the members. The plan shall identify the programs and services which are suggested for implementation by the SC during the following year and shall contain components of long-range planning determined by the SC. These programs and services may include, but are not limited to, the following areas:\n(1) administrative services;\n(2) curriculum development;\n(3) data processing;\n(4) distance learning and other telecommunication services;\n(5) evaluation and research;\n(6) staff development;\n(7) media and technology centers;\n(8) publication and dissemination of materials;\n(9) pupil personnel services;\n(10) planning;\n(11) secondary, postsecondary, community, adult, and adult vocational education;\n(12) teaching and learning services, including services for students with special talents and special needs;\n(13) employee personnel services;\n(14) vocational rehabilitation;\n(15) health, diagnostic, and child development services and centers;\n(16) leadership or direction in early childhood and family education;\n(17) community services;\n(18) shared time programs;\n(19) fiscal services and risk management programs, including health insurance programs providing reinsurance or stop loss coverage;\n(20) technology planning, training, and support services;\n(21) health and safety services;\n(22) student academic challenges; and\n(23) cooperative purchasing services.\nAn SC is subject to regulation and oversight by the commissioner of commerce under the insurance laws of this state when operating a health reinsurance program pursuant to clause (19) providing reinsurance or stop loss coverage.\n(b) A group health, dental, or long-term disability coverage program provided by one or more service cooperatives may provide coverage to nursing homes licensed under chapter 144A and to boarding care homes licensed under sections 144.50 to 144.56 and certified for participation in the medical assistance program located in this state.\n(c) A group health, dental, or long-term disability coverage program provided by one or more service cooperatives:\n(1) must rebid contracts for insurance and third-party administration at least every four years. The contracts may be regional or statewide in the discretion of the SC; and\n(2) may determine premiums for its health, dental, or long-term disability coverage individually for specific employers or may determine them on a pooled or other basis established by the SC.\nService cooperatives shall, to the extent possible, make technical assistance for long-range planning available to school districts upon request and shall establish a common database for local and regional decision making.\n(a) Financial support for SC programs and services shall be provided by participating members with private, state, and federal financial support supplementing as available. The SC board of directors may, in each year, for the purpose of paying any administrative, planning, operating, or capital expenses incurred or to be incurred, assess and certify to each participating school district, nonpublic school administrative unit, city, county, and other governmental unit its proportionate share of all expenses. This share shall be based upon the extent of participation by each school district, nonpublic school administrative unit, city, county, or other governmental unit and shall be in the form of a service fee. Each participating school district, nonpublic school administrative unit, city, county, or other governmental unit shall remit its assessment to the SC board as provided in the SC bylaws. The assessments shall be paid within the maximum levy limitations of each participating member. No participating member shall have any additional liability for the debts or obligations of the SC except that assessment which has been certified as its proportionate share and any other liability the member assumes under section 123A.24, subdivisions 1 and 2.\n(b) Any property acquired by the SC board is public property to be used for essential public and governmental purposes which shall be exempt from all taxes and special assessments levied by a city, county, state, or political subdivision thereof. If the SC is dissolved, its property must be distributed to the members at the time of the dissolution.\n(c) A member may elect to withdraw participation in the SC by a majority vote of its full board membership and upon compliance with the applicable withdrawal provisions of the SC organizational agreement. The withdrawal shall be effective on the June 30 following receipt by the board of directors of written notification of the withdrawal by February 1 of the same year. Notwithstanding the withdrawal, the proportionate share of any expenses already certified to the withdrawing member for the SC shall be paid to the SC board.\n(d) The SC is a public corporation and agency and its board of directors may make application for, accept, and expend private, state, and federal funds that are available for programs of the members.\n(e) The SC is a public corporation and agency and as such, no earnings or interests of the SC may inure to the benefit of an individual or private entity.\nEach SC shall conduct a meeting at least annually for its members.\nNothing in this section shall restrict the authority granted to school district boards of education by section 471.59.\n(a) Service cooperatives must permit school districts and other political subdivisions participating in a service cooperative health coverage pool to solicit bids and other information from competing sources of health coverage at any time other than within five months prior to the end of a master agreement.\n(b) A service cooperative must not impose a fine or other penalty against an enrolled entity for soliciting a bid or other information during the allowed period. The service cooperative may prohibit the entity from participating in service cooperative coverage for a period of up to one year, if the entity leaves the service cooperative pool and obtains other health coverage.\n(c) A service cooperative must provide each enrolled entity with the entity's monthly claims data. This paragraph applies notwithstanding section 13.203.",
	"repealed": false
}