{
	"id": "289A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.09",
	"title": "289A.09 FILING REQUIREMENTS FOR TAXES WITHHELD FROM WAGES, FROM COMPENSATION OF ENTERTAINERS, AND FROM PAYMENTS TO OUT-OF-STATE CONTRACTORS; AND TAXES WITHHELD BY PARTNERSHIPS AND SMALL BUSINESS CORPORATIONS.",
	"text": "(a) An employer who is required to deduct and withhold tax under section 290.92, subdivision 2a or 3, and a person required to deduct and withhold tax under section 290.923, subdivision 2, must file a return with the commissioner for each quarterly period unless otherwise prescribed by the commissioner.\n(b) A person or corporation required to make deposits under section 290.9201, subdivision 8, must file an entertainer withholding tax return with the commissioner.\n(c) A person required to withhold an amount under section 290.9705, subdivision 1, must file a return.\n(d) A partnership required to deduct and withhold tax under section 290.92, subdivision 4b, must file a return.\n(e) An S corporation required to deduct and withhold tax under section 290.92, subdivision 4c, must also file a return.\n(f) The commissioner shall prescribe the content, format, and manner of the returns pursuant to section 270C.30. Every return for taxes withheld must be signed by the employer, entertainment entity, contract payor, partnership, or S corporation, or a designee.\n(a) A person required to deduct and withhold from an employee a tax under section 290.92, subdivision 2a or 3, or 290.923, subdivision 2, or who would have been required to deduct and withhold a tax under section 290.92, subdivision 2a or 3, or persons required to withhold tax under section 290.923, subdivision 2, determined without regard to section 290.92, subdivision 19, if the employee or payee had claimed no more than one withholding allowance, or who paid wages or made payments not subject to withholding under section 290.92, subdivision 2a or 3, or 290.923, subdivision 2, to an employee or person receiving royalty payments in excess of $600, or who has entered into a voluntary withholding agreement with a payee under section 290.92, subdivision 20, must give every employee or person receiving royalty payments in respect to the remuneration paid by the person to the employee or person receiving royalty payments during the calendar year, on or before January 31 of the succeeding year, or, if employment is terminated before the close of the calendar year, within 30 days after the date of receipt of a written request from the employee if the 30-day period ends before January 31, a written statement showing the following:\n(1) name of the person;\n(2) the name of the employee or payee and the employee's or payee's Social Security account number;\n(3) the total amount of wages as that term is defined in section 290.92, subdivision 1, paragraph (1); the total amount of remuneration subject to withholding under section 290.92, subdivision 20; the amount of sick pay as required under section 6051(f) of the Internal Revenue Code; and the amount of royalties subject to withholding under section 290.923, subdivision 2; and\n(4) the total amount deducted and withheld as tax under section 290.92, subdivision 2a or 3, or 290.923, subdivision 2.\n(b) The statement required to be furnished by paragraph (a) with respect to any remuneration must be furnished at those times, must contain the information required, and must be in the form the commissioner prescribes.\n(c) The commissioner may prescribe rules providing for reasonable extensions of time, not in excess of 30 days, to employers or payers required to give the statements to their employees or payees under this subdivision.\n(d) A duplicate of any statement made under this subdivision and in accordance with rules prescribed by the commissioner must be filed with the commissioner on or before January 31 of the year after the payments were made.\n(e) If an employer cancels the employer's Minnesota withholding account number required by section 290.92, subdivision 24, the information required by paragraph (d), must be filed with the commissioner within 30 days of the end of the quarter in which the employer cancels its account number.\n(f) The employer must submit the statements required to be sent to the commissioner. The commissioner shall prescribe the content, format, and manner of the statement pursuant to section 270C.30.\n(g) A \"third-party bulk filer\" as defined in section 290.92, subdivision 30, paragraph (a), clause (2), must submit the returns required by this subdivision and subdivision 1, paragraph (a), with the commissioner by electronic means.\nThe commissioner of revenue shall participate with the United States Office of Personnel Management in a program of voluntary state income tax withholding on the federal annuities of retired federal employees. Upon the request of the taxpayer to the commissioner of revenue, and only on request of the taxpayer, the commissioner shall provide for state income tax withholding on federal annuities paid to the taxpayer.",
	"repealed": false
}