{
	"id": "345.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/345.47",
	"title": "345.47 SALE OF ABANDONED PROPERTY.",
	"text": "Except as provided in subdivisions 3 and 5, all abandoned property other than money delivered to the commissioner under sections 345.31 to 345.60 shall be sold by the commissioner to the highest bidder at public sale in whatever city in the state the commissioner judges to afford the most favorable market for the property involved. The sale must be held whenever the commissioner deems necessary but at least once every ten years. The commissioner may decline the highest bid and reoffer the property for sale if the commissioner considers the price bid insufficient. The commissioner need not offer any property for sale if of the opinion that the probable cost of sale exceeds the value of the property.\nAny sale held under this section shall be preceded by a single publication of notice thereof, at least three weeks in advance of sale in an English language newspaper of general circulation in the county where the property is to be sold.\nSecurities listed on an established stock exchange shall be sold at the prevailing prices on the exchange. Other securities may be sold over the counter at prevailing prices or by another method the commissioner determines advisable. United States government savings bonds and United States war bonds shall be presented to the United States for payment.\nIf the property is of a type customarily sold on a recognized market or of a type that may be sold over the counter at prevailing prices, the commissioner may sell the property without notice by publication or otherwise. The commissioner may proceed with the liquidation after holding for one year, with the exception of securities being held as the result of an insurance company demutualization, these types of securities may be sold upon receipt. This section grants to the commissioner express authority to sell any property, including, but not limited to, stocks, bonds, notes, bills, and all other public or private securities. A person making a claim under section 345.35 is entitled to receive the securities delivered to the administrator by the holder, if they remain in the custody of the administrator, or the net proceeds received from sale, and is not entitled to receive any appreciation in the value of the property occurring after sale by the commissioner. The commissioner may liquidate all unclaimed securities currently held in custody in accordance with this section.\nThe purchaser at any sale conducted by the commissioner pursuant to sections 345.31 to 345.60 and the Minnesota Historical Society under subdivision 5 shall receive title to the property purchased or selected, free from all claims of the owner or prior holder thereof and of all persons claiming through or under them. The commissioner shall execute all documents necessary to complete the transfer of title.\nThe commissioner shall provide the Minnesota Historical Society with an inventory of abandoned property, other than money, six months prior to public sale. The society may select for its collections any items it finds of historical value. The society shall make its selection before the commissioner appraises or sorts the material for public sale. The society has 90 days from the date of notification by the commissioner to exercise the authority granted by this subdivision.",
	"repealed": false
}