{
	"id": "430.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.031",
	"title": "430.031 APPEALS FROM PEDESTRIAN MALL ORDINANCES.",
	"text": "No action may be commenced or maintained, and no defense interposed, questioning the validity, regularity, or legality of all or part of a pedestrian mall ordinance, or an amendment, to it adopted by a city under section 430.011, subdivision 3 or 13 except by an appeal to the district court of the county in which the city is located within 20 days after the final adoption and publication of the ordinance or amendment.\nAn appeal under this section may be commenced and maintained on the grounds that the ordinance is unreasonable or arbitrary or unlawfully obstructs the public use and interest in a street or part of a street named in the ordinance or takes or interferes with the appellant's property without due process of law, or on any other lawful grounds. An appeal under this section may be taken by a citizen or taxpayer of the city or a person whose property is or may be taken or interfered with without due process of law by reason of the enactment or enforcement of the ordinance.\nAn appeal under this section may be made by serving a written notice on the city clerk setting forth the grounds for the appeal and any property the appellant claims to be taken or interfered with. The city clerk shall make out and send to the court administrator of the district court (1) a certified copy of the ordinance, (2) if not previously filed, a certified copy of the award of the commissioners as confirmed by the council, and (3) the order of the council confirming the award in any improvement proceeding connected with the ordinance. No other pleadings are required. No surety bond is required except upon motion of the city under chapter 562.\nAn appeal under this section suspends the ordinance until the action is determined by a final order of the court. The court shall advance the case on its calendar for trial at the earliest feasible date. An appeal from a district court judgment in the action must be taken within 30 days after notice of entry of the judgment. A party may apply to the court of appeals for an order fixing the time and manner of hearing the appeal; the court may provide for a speedy hearing.",
	"repealed": false
}