{
	"id": "611A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.04",
	"title": "611A.04 ORDER OF RESTITUTION.",
	"text": "(a) A victim of a crime has the right to receive restitution as part of the disposition of a criminal charge or juvenile delinquency proceeding against the offender if the offender is convicted or found delinquent. The court, or a person or agency designated by the court, shall request information from the victim to determine the amount of restitution owed. The court or its designee shall obtain the information from the victim in affidavit form or by other competent evidence. Information submitted relating to restitution must describe the items or elements of loss, itemize the total dollar amounts of restitution claimed, and specify the reasons justifying these amounts, if restitution is in the form of money or property. A request for restitution may include, but is not limited to, any out-of-pocket losses resulting from the crime, including medical and therapy costs, replacement of wages and services, expenses incurred to return a child who was a victim of a crime under section 609.26 to the child's parents or lawful custodian, and funeral expenses. An actual or prospective civil action involving the alleged crime shall not be used by the court as a basis to deny a victim's right to obtain court-ordered restitution under this section. In order to be considered at the sentencing or dispositional hearing, all information regarding restitution must be received by the court administrator of the appropriate court at least three business days before the sentencing or dispositional hearing. The court administrator shall provide copies of this request to the prosecutor and the offender or the offender's attorney at least 24 hours before the sentencing or dispositional hearing. The issue of restitution is reserved or the sentencing or dispositional hearing or hearing on the restitution request may be continued if the victim's affidavit or other competent evidence submitted by the victim is not received in time. At the sentencing or dispositional hearing, the court shall give the offender an opportunity to respond to specific items of restitution and their dollar amounts in accordance with the procedures established in section 611A.045, subdivision 3.\n(b) The court may amend or issue an order of restitution after the sentencing or dispositional hearing if:\n(1) the offender is on probation, committed to the commissioner of corrections, or on supervised release;\n(2) sufficient evidence of a right to restitution has been submitted; and\n(3) the true extent of the victim's loss or the loss of the Crime Victims Reimbursement Board was not known at the time of the sentencing or dispositional hearing, or hearing on the restitution request.\nIf the court holds a hearing on the restitution request, the court must notify the offender, the offender's attorney, the victim, the prosecutor, and the Crime Victims Reimbursement Board at least five business days before the hearing. The court's restitution decision is governed by this section and section 611A.045.\n(c) The court shall grant or deny restitution or partial restitution and shall state on the record its reasons for its decision on restitution if information relating to restitution has been presented. If the court grants partial restitution it shall also specify the full amount of restitution that may be docketed as a civil judgment under subdivision 3. The court may not require that the victim waive or otherwise forfeit any rights or causes of action as a condition of granting restitution or partial restitution. In the case of a defendant who is on probation, the court may not refuse to enforce an order for restitution solely on the grounds that the order has been docketed as a civil judgment.\nThe Crime Victims Reimbursement Board may request restitution on behalf of a victim by filing a copy of orders of the board, if any, which detail any amounts paid by the board to the victim. The board may file the payment order with the court administrator or with the person or agency the court has designated to obtain information relating to restitution. The board shall submit the payment order not less than three business days after it is issued by the board. The court administrator shall provide copies of the payment order to the prosecutor and the offender or the offender's attorney within 48 hours of receiving it from the board or at least 24 hours before the sentencing or dispositional hearing, whichever is earlier. By operation of law, the issue of restitution is reserved if the payment order is not received at least three days before the sentencing or dispositional hearing. The filing of a payment order for reimbursement with the court administrator shall also serve as a request for restitution by the victim. The restitution requested by the board may be considered to be both on its own behalf and on behalf of the victim. If the board has not paid reimbursement to the victim or on the victim's behalf, reimbursement may be made directly to the victim. If the board has paid reimbursement to the victim or on the victim's behalf, the court shall order restitution payments to be made directly to the board.\nAn offender who has been ordered by the court to make restitution in an amount of $500 or more shall file an affidavit of financial disclosure with the correctional agency responsible for investigating the financial resources of the offender on request of the agency. The commissioner of corrections shall prescribe what financial information the affidavit must contain.\nThe offender shall make restitution payments to the court administrator of the county, municipal, or district court of the county in which the restitution is to be paid. The court administrator shall disburse restitution in incremental payments and may not keep a restitution payment for longer than 30 days; except that the court administrator is not required to disburse a restitution payment that is under $10 unless the payment would fulfill the offender's restitution obligation. The court administrator shall keep records of the amount of restitution ordered in each case, any change made to the restitution order, and the amount of restitution actually paid by the offender. The court administrator shall forward the data collected to the state court administrator who shall compile the data and make it available to the supreme court and the legislature upon request.\nAn order of restitution may be enforced by any person named in the order to receive the restitution, or by the Crime Victims Reimbursement Board in the same manner as a judgment in a civil action. Any order for restitution in favor of a victim shall also operate as an order for restitution in favor of the Crime Victims Reimbursement Board, if the board has paid reimbursement to the victim or on the victim's behalf. Filing fees for docketing an order of restitution as a civil judgment are waived for any victim named in the restitution order. An order of restitution shall be docketed as a civil judgment, in the name of any person named in the order and in the name of the Crime Victims Reimbursement Board, by the court administrator of the district court in the county in which the order of restitution was entered. The court administrator also shall notify the commissioner of revenue of the restitution debt in the manner provided in chapter 270A, the Revenue Recapture Act. A juvenile court is not required to appoint a guardian ad litem for a juvenile offender before docketing a restitution order. Interest shall accrue on the unpaid balance of the judgment as provided in section 549.09. Whether the order of restitution has been docketed or not, it is a debt that is not dischargeable in bankruptcy. A decision for or against restitution in any criminal or juvenile proceeding is not a bar to any civil action by the victim or by the state pursuant to section 611A.61 against the offender. The offender shall be given credit, in any order for judgment in favor of a victim in a civil action, for any restitution paid to the victim for the same injuries for which the judgment is awarded.\nWhen the court orders the payment of restitution and the payment of a fine, fees, surcharges, or other financial obligations, the court administrator shall apply any payments to the restitution obligation before applying payments to the fine, fees, surcharges, or other financial obligations, unless otherwise ordered by the court.\nRestitution payments held by the court for a victim that remain unclaimed by the victim for more than three years shall be deposited in the crime victims account created in section 611A.612.\nAt the time the deposit is made, the court shall record the name and last known address of the victim and the amount being deposited, and shall forward the data to the Crime Victims Reimbursement Board.\nIf a victim dies before or after a request for restitution is made or an order for restitution is issued, the personal representative of the victim's estate may request or enforce an order for restitution on behalf of the victim. If a personal representative is not appointed and no application is pending, an heir of the victim may file an affidavit to request or enforce an order for restitution pursuant to this subdivision. Appointment of a personal representative does not affect the right of other victims, as defined in section 611A.01, to request an order for restitution on their behalf.",
	"repealed": false
}