{
	"id": "216.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/216.17",
	"title": "216.17 NOTICES AND ORDERS; FILINGS; SERVICE.",
	"text": "All notices and orders in proceedings before the commission must be signed by the secretary. Electronic signature by the secretary is permitted.\nService of all notices, orders, and other documents by the commission may be made by mail, personal delivery, or electronic service upon any person or firm, or upon the president, general manager, or other proper executive officer of any corporation interested. If any party has appeared by attorney, such service must be made upon the attorney. Notwithstanding section 14.62, orders and decisions may be served by mail, by personal delivery, or by electronic service. The commission may provide electronic service to any person who has provided an electronic address to the commission for service purposes. For purposes of this section, the term \"person\" includes a natural person or an organization, whether for profit or not for profit. Regulated utilities and state agencies must provide an electronic address for electronic service purposes and must accept electronic service as official service.\nAs of January 1, 2008, any telephone company or telecommunications carrier subject to chapter 237; any public utility, cooperative association, or municipal utility subject to chapter 216B; and state agencies, shall file documents with the commission via the commission's electronic filing system. The executive secretary may approve an exemption from this requirement if an affected company or agency is unable to submit filings via the commission's electronic filing system. All parties, participants, or other interested persons shall submit filings to the commission via the commission's electronic filing system whenever practicable, but may also file by personal delivery or by mail.\nWhen an applicable statute or commission rule requires service of a filing or other document by a party, participant, or other interested person upon persons on a service list maintained by the commission, service may be made by personal delivery, mail, or electronic service, except that electronic service may only be made upon persons on the official service list who have previously agreed in writing to accept electronic service at an electronic address provided to the commission for electronic service purposes. This section does not apply to the extent another provision of this chapter or chapter 216A requires a specific method of service. Regulated utilities and state agencies must provide an electronic address to the commission for electronic service purposes and agree to accept electronic service as official service.",
	"repealed": false
}