{
	"id": "60A.1391",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.1391",
	"title": "60A.1391 CORPORATE GOVERNANCE ANNUAL DISCLOSURE.",
	"text": "(a) Nothing in this section shall be construed to prescribe or impose corporate governance standards and internal procedure beyond that which is required under applicable state corporate law. Nothing in this section shall be construed to limit the commissioner's authority, or the rights or obligations of third parties.\n(b) The requirements of this section apply to all insurers domiciled in this state.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Commissioner\" means the commissioner of commerce.\n(c) \"Corporate Governance Annual Disclosure (CGAD)\" means a confidential report filed by the insurer or insurance group according to this section.\n(d) \"Insurance group\" means those insurers and affiliates included within an insurance holding company system as defined in section 60D.15, subdivision 5.\n(e) \"Insurer\" has the meaning given in section 60A.705, subdivision 4, except that it does not include agencies, authorities, or instrumentalities of the United States, its possessions and territories, the Commonwealth of Puerto Rico, the District of Columbia, or a state or political subdivision of a state.\n(f) \"ORSA summary report\" means the report filed under section 60D.54.\n(g) \"Senior management\" means any corporate officer responsible for reporting information to the board of directors at regular intervals or providing this information to shareholders or regulators and shall include, for example and without limitation, the Chief Executive Officer (CEO), Chief Financial Officer (CFO), Chief Operations Officer (COO), Chief Procurement Officer (CPO), Chief Legal Officer (CLO), Chief Information Officer (CIO), Chief Technology Officer (CTO), Chief Revenue Officer (CRO), Chief Visionary Officer (CVO), or any other \"C\" level executive.\n(a) An insurer, or the insurance group of which the insurer is a member, shall, no later than June 1 of each calendar year, submit to the commissioner a Corporate Governance Annual Disclosure (CGAD) that contains the information described in subdivision 4. Notwithstanding any request from the commissioner made pursuant to paragraph (c), if the insurer is a member of an insurance group, the insurer shall submit the report required by this section to the commissioner of the lead state for the insurance group, in accordance with the laws of the lead state, as determined by the procedures outlined in the most recent Financial Analysis Handbook adopted by the NAIC.\n(b) The CGAD must include a signature of the insurer or insurance group's chief executive officer or corporate secretary attesting to the best of that individual's belief and knowledge that the insurer has implemented the corporate governance practices and that a copy of the disclosure has been provided to the insurer's or the insurance group's board of directors or the appropriate committee thereof.\n(c) An insurer not required to submit a CGAD under this section shall do so upon the commissioner's request.\n(d) For purposes of completing the CGAD, the insurer or insurance group may provide information regarding corporate governance at the ultimate controlling parent level, an intermediate holding company level, or the individual legal entity level, depending upon how the insurer or insurance group has structured its system of corporate governance. The insurer or insurance group is encouraged to make the CGAD disclosures at the level at which the insurer's or insurance group's risk appetite is determined, or at which the earnings, capital, liquidity, operations, and reputation of the insurer are overseen collectively and at which the supervision of those factors are coordinated and exercised, or the level at which legal liability for failure of general corporate governance duties would be placed. If the insurer or insurance group determines the level of reporting based on these criteria, it shall indicate which of the three criteria was used to determine the level of reporting and explain any subsequent changes in level of reporting.\n(e) The review of the CGAD and any additional requests for information shall be made through the lead state as determined by the procedures within the most recent Financial Analysis Handbook referenced in paragraph (a). If the CGAD is completed at the insurance group level, then it must be filed with the lead state of the group as determined by the procedures outlined in the most recent Financial Analysis Handbook adopted by the NAIC. In these instances, a copy of the CGAD must also be provided to the chief regulatory official of any state in which the insurance group has a domestic insurer, upon request.\n(f) Insurers providing information substantially similar to the information required under this section in other documents provided to the commissioner, including proxy statements filed in conjunction with Form B requirements, or other state or federal filings provided to this department shall not be required to duplicate that information in the CGAD, but shall be required to clearly cross-reference the location of the relevant information within the CGAD and attach the referenced document in which the information is included if not already filed with or available to the regulator.\n(g) Each year following the initial filing of the CGAD, the insurer or insurance group shall file an amended version of the previously filed CGAD indicating where changes have been made. If no changes were made in the information or activities reported by the insurer or insurance group, the filing should so state.\n(a) The insurer or insurance group shall have discretion regarding the appropriate format for providing the information required by this section, provided the CGAD shall contain the material information necessary to permit the commissioner to gain an understanding of the insurer's or group's corporate governance structure, policies, and practices. The commissioner may request additional information deemed material and necessary to provide the commissioner with a clear understanding of the corporate governance policies, the reporting or information system, or controls implementing those policies. Documentation and supporting information shall be maintained and made available upon examination or upon request of the commissioner.\n(b) The insurer or insurance group shall be as descriptive as possible in completing the CGAD, with inclusion of attachments or example documents that are used in the governance process, as these may provide a means to demonstrate the strengths of their governance framework and practices.\n(c) The CGAD shall describe the insurer's or insurance group's corporate governance framework and structure including consideration of the following:\n(1) the board and various committees thereof ultimately responsible for overseeing the insurer or insurance group and the level(s) at which that oversight occurs (e.g., ultimate control level, intermediate holding company, legal entity, etc.). The insurer or insurance group shall describe and discuss the rationale for the current board size and structure; and\n(2) the duties of the board and each of its significant committees and how they are governed (e.g., bylaws, charters, informal mandates, etc.), as well as how the board's leadership is structured, including a discussion of the roles of Chief Executive Officer and Chairman of the Board within the organization.\n(d) The insurer or insurance group shall describe the policies and practices of the most senior governing entity and significant committees thereof, including a discussion of the following factors:\n(1) how the qualifications, expertise, and experience of each board member meet the needs of the insurer or insurance group;\n(2) how an appropriate amount of independence is maintained on the board and its significant committees;\n(3) the number of meetings held by the board and its significant committees over the past year as well as the information on director attendance;\n(4) how the insurer or insurance group identifies, nominates, and elects members to the board and its committees. The discussion should include, for example:\n(i) whether the nomination committee is in place to identify and select individuals for consideration;\n(ii) whether term limits are placed on directors;\n(iii) how the election and reelection processes function; and\n(iv) whether a board diversity policy is in place and if so, how it functions; and\n(5) the processes in place for the board to evaluate its performance and the performance of its committees, as well as any recent measures taken to improve performance, including any board or committee training programs that have been put in place.\n(e) The insurer or insurance group shall describe the policies and practices for directing senior management, including a description of the following factors:\n(1) any processes or practices (i.e., sustainability standards) to determine whether officers and key persons in control functions have the appropriate background, experience, and integrity to fulfill their prospective roles, including:\n(i) identification of the specific positions for which suitability standards have been developed and a description of the standards employed; and\n(ii) any changes in an officer's or key person's suitability as outlined by the insurer's or insurance group's standards and procedures to monitor and evaluate such changes;\n(2) the insurer's or insurance group's code of business conduct and ethics, the discussion of which considers, for example:\n(i) compliance with laws, rules, and regulations; and\n(ii) proactive reporting of any illegal or unethical behavior;\n(3) the insurer's or insurance group's processes for performance evaluation, compensation, and corrective action to ensure effective senior management throughout the organization, including a description of the general objectives of significant compensation programs and what the programs are designed to reward. The description shall include sufficient detail to allow the commissioner to understand how the organization ensures that compensation programs do not encourage or reward excessive risk taking. Elements to be discussed may include, for example:\n(i) the board's role in overseeing management compensation programs and practices;\n(ii) the various elements of compensation awarded in the insurer's or insurance group's compensation programs and how the insurer or insurance group determines and calculates the amount of each element of compensation paid;\n(iii) how compensation programs are related to both company and individual performance over time;\n(iv) whether compensation programs include risk adjustments and how those adjustments are incorporated into the programs for employees at different levels;\n(v) any clawback provisions built into the programs to recover awards or payments if the performance measures upon which they are based are restated or otherwise adjusted; and\n(vi) any other factors relevant in understanding how the insurer or insurance group monitors its compensation policies to determine whether its risk management objectives are met by incentivizing its employees; and\n(4) the insurer's or insurance group's plans for CEO and senior management succession.\n(f) The insurer or insurance group shall describe the processes by which the board, its committees, and senior management ensure an appropriate amount of oversight to the critical risk areas impacting the insurer's business activities, including a discussion of:\n(1) how oversight and management responsibilities are delegated between the board, its committees, and senior management;\n(2) how the board is kept informed of the insurer's strategic plans, the associated risks, and steps that senior management is taking to monitor and manage those risks; and\n(3) how reporting responsibilities are organized for each critical risk area. The description should allow the commissioner to understand the frequency at which information on each critical risk area is reported to and reviewed by senior management and the board. This description may include, for example, the following critical risk areas of the insurer:\n(i) risk management processes (an ORSA Summary Report filer may refer to its ORSA Summary Report pursuant to the Risk Management and Own Risk and Solvency Assessment Model Act);\n(ii) actuarial function;\n(iii) investment decision-making processes;\n(iv) reinsurance decision-making processes;\n(v) business strategy and finance decision-making processes;\n(vi) compliance function;\n(vii) financial reporting and internal auditing; and\n(viii) market conduct decision-making processes.\n(a) Documents, materials, or other information, including the CGAD, in the possession or control of the department that are obtained by, created by, or disclosed to the commissioner or any other person under this section are recognized by this state as being confidential, protected nonpublic, and containing trade secrets. Those documents, materials, or other information are classified as confidential, protected nonpublic, or both, are not subject to subpoena, and are not subject to discovery or admissible in evidence in any private civil action. However, the commissioner may use the documents, materials, or other information in the furtherance of a regulatory or legal action brought as a part of the commissioner's official duties. The commissioner shall not otherwise make the documents, materials, or other information public without the prior written consent of the insurer. Nothing in this section shall be construed to require written consent of the insurer before the commissioner may share or receive confidential documents, materials, or other CGAD-related information pursuant to paragraph (c) below to assist in the performance of the commissioner's regular duties.\n(b) Neither the commissioner nor any person who received documents, materials, or other CGAD-related information, through examination or otherwise, while acting under the authority of the commissioner, or with whom the documents, materials, or other information are shared pursuant to this section are permitted or required to testify in any private civil action concerning documents, materials, or information subject to this subdivision that are classified as confidential, protected nonpublic, or both.\n(c) In order to assist in the performance of the commissioner's regulatory duties, the commissioner:\n(1) may, upon request, share documents, materials, or other CGAD-related information, including the confidential, protected nonpublic, and privileged documents, materials, or information subject to this subdivision including trade secret information or documents, with other state, federal, and international financial regulatory agencies, including members of any supervisory college as defined in section 60D.215, with the NAIC, and with third-party consultants pursuant to subdivision 7, provided that the recipient agrees in writing to maintain the confidentiality and privileged status of the CGAD-related documents, material, or other information and has verified in writing the legal authority to maintain confidentiality; and\n(2) may receive documents, materials, or other CGAD-related information, including otherwise confidential, protected nonpublic, and privileged documents, materials, or information including trade secret information or documents, from regulatory officials of other state, federal, and international financial regulatory agencies, including members of any supervisory college as defined in section 60D.215 and from the NAIC, and shall maintain as confidential, protected nonpublic, or privileged any documents, materials, or information received with notice or the understanding that it is confidential, protected nonpublic, or privileged under the laws of the jurisdiction that is the source of the document, material, or information.\n(d) The sharing of information and documents by the commissioner pursuant to this section shall not constitute a delegation of regulatory authority or rulemaking, and the commissioner is solely responsible for the administration, execution, and enforcement of the provisions of this section.\n(e) No waiver of any applicable privilege or claim of confidentiality in the documents, trade-secret materials, or other CGAD-related information shall occur as a result of disclosure of such CGAD-related information or documents to the commissioner under this subdivision or as a result of sharing as authorized under this section.\n(a) The commissioner may retain, at the insurer's expense, third-party consultants, including attorneys, actuaries, accountants, and other experts not otherwise a part of the commissioner's staff as may be reasonably necessary to assist the commissioner in reviewing the CGAD and related information or the insurer's compliance with this section.\n(b) Any person retained under paragraph (a) shall be under the direction and control of the commissioner and shall act in a purely advisory capacity.\n(c) The NAIC and third-party consultants shall be subject to the same confidentiality standards and requirements as the commissioner.\n(d) As part of the retention process, a third-party consultant shall verify to the commissioner, with notice to the insurer, that it is free of a conflict of interest and that it has internal procedures in place to monitor compliance with a conflict and to comply with the confidentiality standards and requirements of this section.\n(e) A written agreement with the NAIC or a third-party consultant governing sharing and use of information provided pursuant to this section shall contain the following provisions and expressly require the written consent of the insurer prior to making public information provided under this section:\n(1) specific procedures and protocols for maintaining the confidentiality and security of CGAD-related information shared with the NAIC or a third-party consultant pursuant to this section;\n(2) procedures and protocols for sharing by the NAIC only with other state regulators from states in which the insurance group has domiciled insurers. The agreement shall provide that the recipient agrees in writing to maintain the confidentiality and privileged status of the CGAD-related documents, materials, or other information and has verified in writing the legal authority to maintain confidentiality;\n(3) a provision specifying that ownership of the CGAD-related information shared with the NAIC or a third-party consultant remains with the department and the NAIC's or third-party consultant's use of the information is subject to the direction of the commissioner;\n(4) a provision that prohibits the NAIC or a third-party consultant from storing the information shared pursuant to this section in a permanent database after the underlying analysis is completed;\n(5) a provision requiring the NAIC or third-party consultant to provide prompt notice to the commissioner and to the insurer or insurance group regarding any subpoena, request for disclosure, or request for production of the insurer's CGAD-related information; and\n(6) a requirement that the NAIC or a third-party consultant to consent to intervention by an insurer in any judicial or administrative action in which the NAIC or a third-party consultant may be required to disclose confidential information about the insurer shared with the NAIC or a third-party consultant pursuant to this section.\nAny insurer failing, without just cause, to timely file the CGAD as required in this section shall be required to pay a penalty of $1,000 for each day's delay, to be recovered by the commissioner and to be paid into the general fund of this state. The commissioner may reduce the penalty if the insurer demonstrates to the commissioner that the imposition of the penalty would constitute a financial hardship to the insurer.",
	"repealed": false
}