{
	"id": "40A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/40A.15",
	"title": "40A.15 AGRICULTURAL LAND PRESERVATION AND CONSERVATION ASSISTANCE PROGRAM.",
	"text": "An agricultural land preservation and conservation assistance program is created to provide technical and financial assistance for agricultural land preservation and conservation activities and to provide assistance to counties and municipalities in preparing agricultural land preservation plans and official controls. The commissioner shall administer the program under rules promulgated under chapter 14. The commissioner shall actively seek the involvement of local government officials in the rulemaking process.\nAll counties within the state, municipalities that prepare plans and official controls instead of a county, and districts are eligible for assistance under the program. Counties and districts may apply for assistance on behalf of other municipalities. In order to be eligible for financial assistance a county or municipality must agree to levy at least 0.01209 percent of estimated market value for agricultural land preservation and conservation activities or otherwise spend the equivalent amount of local money on those activities, or spend $15,000 of local money, whichever is less.\nIn administering the program the commissioner shall time the promotion of public awareness and the distribution of technical and financial assistance in order to maximize the use of available resources, facilitate the agricultural land preservation process, and promote sound soil conservation practices.\nThe commissioner shall administer grants for up to 50 percent of the cost of the activity to be funded, except that grants to the pilot counties shall be for 100 percent of the cost up to $30,000 of preparing new plans and official controls required under this chapter. Grants may not be used to reimburse the recipient for activities that are already completed. Grants may be used to employ and train staff, contract with other units of government or private consultants, and pay other expenses related to promoting and implementing agricultural land preservation and conservation activities. The commissioner shall prepare and publish an inventory of sources of financial assistance. To the extent practicable, the commissioner shall assist recipients in obtaining matching grants from other sources.\nThe commissioner shall provide for technical assistance for eligible recipients. The commissioner shall provide model plans and model official controls for the preservation of land for long-term agricultural use that address the elements contained in this chapter. To the extent practicable, the commissioner shall provide technical assistance through existing administrative structures. The commissioner may contract for the delivery of technical assistance by a regional development commission, a district, any state or federal agency, any political subdivision of the state, or private consultants. The commissioner shall prepare and publish an inventory of sources of technical assistance, including studies, publications, agencies, and persons available.",
	"repealed": false
}