{
	"id": "325E.386",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.386",
	"title": "325E.386 PRODUCTS CONTAINING CERTAIN POLYBROMINATED DIPHENYL ETHERS BANNED; EXEMPTIONS.",
	"text": "Except as provided in subdivision 2, beginning January 1, 2008, a person may not manufacture, process, or distribute in commerce a product or flame-retardant part of a product containing more than one-tenth of one percent of pentabromodiphenyl ether or octabromodiphenyl ether by mass.\nThe following products containing polybrominated diphenyl ethers are exempt from subdivision 1 and section 325E.387, subdivision 2:\n(1) the sale or distribution of any used transportation vehicle with component parts containing polybrominated diphenyl ethers;\n(2) the sale or distribution of any used transportation vehicle parts or new transportation vehicle parts manufactured before January 1, 2008, that contain polybrominated diphenyl ethers;\n(3) the manufacture, sale, repair, distribution, maintenance, refurbishment, or modification of equipment containing polybrominated diphenyl ethers and used primarily for military or federally funded space program applications. This exemption does not cover consumer-based goods with broad applicability;\n(4) the sale or distribution by a business, charity, public entity, or private party of any used product containing polybrominated diphenyl ethers;\n(5) the manufacture, sale, or distribution of new carpet cushion made from recycled foam containing more than one-tenth of one percent polybrominated diphenyl ether;\n(6) medical devices; or\n(7) the manufacture, sale, repair, distribution, maintenance, refurbishment, or modification of telecommunications equipment containing polybrominated diphenyl ethers used by entities eligible to hold authorization in the Public Safety Pool under Code of Federal Regulations, title 47, part 90.\nIn-state retailers in possession of products on January 1, 2008, that are banned for sale under subdivision 1 may exhaust their stock through sales to the public. Nothing in this section restricts the ability of a manufacturer, importer, or distributor from transporting products containing polybrominated diphenyl ethers through the state, or storing such products in the state for later distribution outside the state.",
	"repealed": false
}