{
	"id": "342.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.27",
	"title": "342.27 RETAIL SALE OF CANNABIS FLOWER AND PRODUCTS; GENERAL REQUIREMENTS.",
	"text": "Every cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products must comply with the requirements of this section.\n(a) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may only sell immature cannabis plants and seedlings, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products to individuals who are at least 21 years of age.\n(b) A cannabis business with a license or endorsement authorizing the retail sale of adult-use cannabis flower or adult-use cannabis products may sell immature cannabis plants and seedlings, adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, and hemp-derived consumer products that:\n(1) are obtained from a business licensed under this chapter; and\n(2) meet all applicable packaging and labeling requirements.\n(c) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may sell up to two ounces of adult-use cannabis flower or hemp-derived consumer products consisting primarily of hemp plant parts, up to eight grams of adult-use cannabis concentrate or hemp-derived consumer products consisting primarily of hemp concentrate or artificially derived cannabinoids, and edible cannabis products and lower-potency hemp edibles infused with up to 800 milligrams of tetrahydrocannabinol during a single transaction to a customer.\n(d) Edible adult-use cannabis products and hemp-derived consumer products intended to be eaten may not include more than ten milligrams of tetrahydrocannabinol per serving and a single package may not include more than a total of 200 milligrams of tetrahydrocannabinol. A package may contain multiple servings of ten milligrams of tetrahydrocannabinol provided that each serving is indicated by scoring, wrapping, or other indicators designating the individual serving size.\n(e) Edible adult-use cannabis products and hemp-derived consumer products intended to be consumed as beverages may not include more than ten milligrams of tetrahydrocannabinol per serving. A single beverage container may not contain more than two servings.\n(a) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may sell cannabis paraphernalia, including but not limited to childproof packaging containers and other devices designed to ensure the safe storage and monitoring of cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products in the home to prevent access by individuals under 21 years of age.\n(b) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may sell hemp-derived topical products.\n(c) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may sell the following products that do not contain cannabis flower, cannabis concentrate, hemp concentrate, artificially derived cannabinoids, or tetrahydrocannabinol:\n(1) drinks that do not contain alcohol and are packaged in sealed containers labeled for retail sale;\n(2) books and videos on the cultivation and use of cannabis flower and products that contain cannabinoids;\n(3) magazines and other publications published primarily for information and education on cannabis plants, cannabis flower, and products that contain cannabinoids;\n(4) multiple-use bags designed to carry purchased items;\n(5) clothing marked with the specific name, brand, or identifying logo of the retailer;\n(6) hemp fiber products and products that contain hemp grain; and\n(7) products that detect the presence of fentanyl or a fentanyl analog.\n(a) Prior to initiating a sale, an employee of a cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products must verify that the customer is at least 21 years of age.\n(b) Proof of age may be established only by one of the following:\n(1) a valid driver's license or identification card issued by Minnesota, another state, or a province of Canada, and including the photograph and date of birth of the licensed person;\n(2) a valid Tribal identification card as defined in section 171.072, paragraph (b);\n(3) a valid passport issued by the United States;\n(4) a valid instructional permit issued under section 171.05 to a person of legal age to purchase adult-use cannabis flower or adult-use cannabis products, which includes a photograph and the date of birth of the person issued the permit; or\n(5) in the case of a foreign national, by a valid passport.\n(c) A retailer may seize a form of identification listed under paragraph (b) if the cannabis retailer has reasonable grounds to believe that the form of identification has been altered or falsified or is being used to violate any law. A retailer that seizes a form of identification as authorized under this paragraph must deliver it to a law enforcement agency within 24 hours of seizing it.\n(a) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products must designate a retail area where customers are permitted. The retail area shall include the portion of the premises where samples of cannabis flower and cannabis products available for sale are displayed. All other cannabis flower and cannabis products must be stored in the secure storage area.\n(b) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may display one sample of each type of cannabis flower or cannabis product available for sale. Samples of cannabis flower and cannabis products must be stored in a sample jar or display case and be accompanied by a label or notice containing the information required to be affixed to the packaging or container containing cannabis flower and cannabis products sold to customers. A sample may not contain more than eight grams of adult-use cannabis flower or adult-use cannabis concentrate or an edible cannabis product infused with more than 100 milligrams of tetrahydrocannabinol. A cannabis retailer may allow customers to smell the cannabis flower or cannabis product before purchase.\n(c) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may not sell cannabis flower or cannabis products used as a sample for display. If the retailer uses display samples of lower-potency hemp edibles or hemp-derived consumer products, the retailer may not sell the product used as a sample for display.\nA cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products must post all notices as required by the office, including but not limited to:\n(1) information about any product recall;\n(2) a statement that operating a motor vehicle under the influence of intoxicating cannabinoids is illegal; and\n(3) a statement that cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products are only intended for consumption by individuals who are at least 21 years of age.\n(a) Except as provided by paragraph (b), a cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may not sell cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products between 2:00 a.m. and 8:00 a.m. on the days of Monday through Saturday nor between 2:00 a.m. and 10:00 a.m. on Sunday.\n(b) A city or county may adopt an ordinance to prohibit sales for any period between 9:00 p.m. and 2:00 a.m. the following day or between 8:00 a.m. and 10:00 a.m. on the days of Monday through Saturday.\n(c) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may not be open to the public or sell any other products at times when the cannabis business is prohibited from selling cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products.\n(a) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products shall maintain compliance with state and local building, fire, and zoning requirements or regulations.\n(b) A cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products shall ensure that the licensed premises is maintained in a clean and sanitary condition, free from infestation by insects, rodents, or other pests.\nA cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products shall maintain compliance with security requirements established by the office, including but not limited to requirements for maintaining video surveillance records, using specific locking mechanisms, establishing secure entries, and the number of employees working at all times.\nA cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products must keep all lighting outside and inside the dispensary in good working order and sufficient wattage for security cameras.\nA cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products may only accept deliveries of cannabis flower, cannabis products, and hemp-derived consumer products in a limited access area. Deliveries may not be accepted through the public access areas unless otherwise approved by the office.\nA cannabis business with a license or endorsement authorizing the retail sale of cannabis flower or cannabis products shall not:\n(1) sell cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products to a person who is visibly intoxicated;\n(2) knowingly sell more cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products than a customer is legally permitted to possess;\n(3) give away immature cannabis plants or seedlings, cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products;\n(4) operate a drive-through window;\n(5) allow for the dispensing of cannabis plants, cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products in vending machines; or\n(6) sell cannabis plants, cannabis flower, or cannabis products if the cannabis retailer knows that any required security or statewide monitoring systems are not operational.\nMS 2023 Supp [Repealed, 2024 c 121 art 2 s 154]\nNothing in this section applies to the operations of a lower-potency hemp edible retailer.",
	"repealed": false
}