{
	"id": "202A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/202A.19",
	"title": "202A.19 CAUCUS, SCHOOL SCHEDULE PREEMPTION, EXCUSAL FROM EMPLOYMENT TO ATTEND.",
	"text": "No special taxing district governing body, school board, county board of commissioners, township board, or city council may conduct a meeting after 6:00 p.m. on the day of a major political party precinct caucus. As used in this subdivision, \"special taxing district\" has the meaning given in section 275.066.\nEvery employee who is entitled to attend a major political party precinct caucus is entitled, after giving the employer at least ten days' written notice, to be absent from work for the purpose of attending the caucus during the time for which the caucus is scheduled without penalty or deduction from salary or wages on account of the absence other than a deduction in salary for the time of absence from employment.\nThe University of Minnesota may not schedule an event which will take place after 6:00 p.m. on the day of a major political party precinct caucus unless permission to do so has been received from the Board of Regents. No Minnesota state college or university may schedule an event which will take place after 6:00 p.m. on the day of a major political party precinct caucus unless permission to do so has been received from the Board of Trustees of the Minnesota State Colleges and Universities.\nNo school official may deny the use of a public school building for the holding of a major political party precinct caucus if the school office has received a written request for the use of the school building 30 days or more prior to the date of the caucus.\nNo public elementary or secondary school may hold a school sponsored event after 6:00 p.m. on the day of a major political party precinct caucus.\nNo state agency, board, commission, department, or committee shall conduct a public meeting after 6:00 p.m. on the day of a major political party precinct caucus.",
	"repealed": false
}