{
	"id": "62J.495",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.495",
	"title": "62J.495 ELECTRONIC HEALTH RECORD TECHNOLOGY.",
	"text": "The commissioner of health, in consultation with the e-Health Advisory Committee, shall develop uniform standards to be used for the interoperable electronic health records system for sharing and synchronizing patient data across systems. The standards must be compatible with federal efforts. The uniform standards must be developed by January 1, 2009, and updated on an ongoing basis. Individual health care providers in private practice with no other providers and health care providers that do not accept reimbursement from a group purchaser, as defined in section 62J.03, subdivision 6, are excluded from the requirements of this section.\n(a) \"Certified electronic health record technology\" means an electronic health record that is certified pursuant to section 3001(c)(5) of the HITECH Act to meet the standards and implementation specifications adopted under section 3004 as applicable.\n(b) \"Commissioner\" means the commissioner of health.\n(c) \"Pharmaceutical electronic data intermediary\" means any entity that provides the infrastructure to connect computer systems or other electronic devices utilized by prescribing practitioners with those used by pharmacies, health plans, third-party administrators, and pharmacy benefit managers in order to facilitate the secure transmission of electronic prescriptions, refill authorization requests, communications, and other prescription-related information between such entities.\n(d) \"HITECH Act\" means the Health Information Technology for Economic and Clinical Health Act in division A, title XIII and division B, title IV of the American Recovery and Reinvestment Act of 2009, including federal regulations adopted under that act.\n(e) \"Interoperable electronic health record\" means an electronic health record that securely exchanges health information with another electronic health record system that meets requirements specified in subdivision 3, and national requirements for certification under the HITECH Act.\n(f) \"Qualified electronic health record\" means an electronic record of health-related information on an individual that includes patient demographic and clinical health information and has the capacity to:\n(1) provide clinical decision support;\n(2) support provider order entry;\n(3) capture and query information relevant to health care quality; and\n(4) exchange electronic health information with, and integrate such information from, other sources.\n(a) The commissioner shall establish an e-Health Advisory Committee governed by section 15.059 to advise the commissioner on the following matters:\n(1) assessment of the adoption and effective use of health information technology by the state, licensed health care providers and facilities, and local public health agencies;\n(2) recommendations for implementing a statewide interoperable health information infrastructure, to include estimates of necessary resources, and for determining standards for clinical data exchange, clinical support programs, patient privacy requirements, and maintenance of the security and confidentiality of individual patient data;\n(3) recommendations for encouraging use of innovative health care applications using information technology and systems to improve patient care and reduce the cost of care, including applications relating to disease management and personal health management that enable remote monitoring of patients' conditions, especially those with chronic conditions; and\n(4) other related issues as requested by the commissioner.\n(b) The members of the e-Health Advisory Committee shall include the commissioners, or commissioners' designees, of health, human services, administration, and commerce and additional members to be appointed by the commissioner to include persons representing Minnesota's local public health agencies, licensed hospitals and other licensed facilities and providers, private purchasers, the medical and nursing professions, health insurers and health plans, the state quality improvement organization, academic and research institutions, consumer advisory organizations with an interest and expertise in health information technology, and other stakeholders as identified by the commissioner to fulfill the requirements of section 3013, paragraph (g), of the HITECH Act.\n(c) This subdivision expires June 30, 2031.\n(a) Hospitals and health care providers must meet the following criteria when implementing an interoperable electronic health records system within their hospital system or clinical practice setting.\n(b) The electronic health record must be a qualified electronic health record.\n(c) The electronic health record must be certified by the Office of the National Coordinator pursuant to the HITECH Act. This criterion only applies to hospitals and health care providers if a certified electronic health record product for the provider's particular practice setting is available. This criterion shall be considered met if a hospital or health care provider is using an electronic health records system that has been certified within the last three years, even if a more current version of the system has been certified within the three-year period.\n(d) The electronic health record must meet the standards established according to section 3004 of the HITECH Act as applicable.\n(e) The electronic health record must have the ability to generate information on clinical quality measures and other measures reported under sections 4101, 4102, and 4201 of the HITECH Act.\n(f) The electronic health record system must be connected to a state-certified health information organization either directly or through a connection facilitated by a health data intermediary as defined in section 62J.498.\n(g) A health care provider who is a prescriber or dispenser of legend drugs must have an electronic health record system that meets the requirements of section 62J.497.\n(a) The commissioner, in consultation with the e-Health Advisory Committee, shall update the statewide implementation plan required under subdivision 2 and released June 2008, to be consistent with the updated federal plans.\n(b) The commissioner, in consultation with the e-Health Advisory Committee, shall work to ensure coordination between state, regional, and national efforts to support and accelerate efforts to effectively use health information technology to improve the quality and coordination of health care and the continuity of patient care among health care providers, to reduce medical errors, to improve population health, to reduce health disparities, and to reduce chronic disease. The commissioner's coordination efforts shall include but not be limited to:\n(1) providing financial and technical support to Minnesota health care providers to encourage implementation of admission, discharge and transfer alerts, and care summary document exchange transactions and to evaluate the impact of health information technology on cost and quality of care. Communications about available financial and technical support shall include clear information about the interoperable health record requirements in subdivision 1, including a separate statement in bold-face type clarifying the exceptions to those requirements;\n(2) providing educational resources and technical assistance to health care providers and patients related to state and national privacy, security, and consent laws governing clinical health information, including the requirements in sections 144.291 to 144.298. In carrying out these activities, the commissioner's technical assistance does not constitute legal advice;\n(3) assessing Minnesota's legal, financial, and regulatory framework for health information exchange, including the requirements in sections 144.291 to 144.298, and making recommendations for modifications that would strengthen the ability of Minnesota health care providers to securely exchange data in compliance with patient preferences and in a way that is efficient and financially sustainable; and\n(4) seeking public input on both patient impact and costs associated with requirements related to patient consent for release of health records for the purposes of treatment, payment, and health care operations, as required in section 144.293, subdivision 2. The commissioner shall provide a report to the legislature on the findings of this public input process no later than February 1, 2017.\n(c) The commissioner, in consultation with the e-Health Advisory Committee, shall monitor national activity related to health information technology and shall coordinate statewide input on policy development. The commissioner shall coordinate statewide responses to proposed federal health information technology regulations in order to ensure that the needs of the Minnesota health care community are adequately and efficiently addressed in the proposed regulations. The commissioner's responses may include, but are not limited to:\n(1) reviewing and evaluating any standard, implementation specification, or certification criteria proposed by the national HIT standards committees;\n(2) reviewing and evaluating policy proposed by national HIT policy committees relating to the implementation of a nationwide health information technology infrastructure; and\n(3) monitoring and responding to national activity related to privacy, security, and data stewardship of electronic health information and individually identifiable health information.\n(d) To the extent that the state is either required or allowed to apply, or designate an entity to apply for or carry out activities and programs, the commissioner of health, in consultation with the e-Health Advisory Committee and the commissioner of human services, shall be the lead applicant or sole designating authority. The commissioner shall make such designations consistent with the goals and objectives of sections 62J.495 to 62J.497 and 62J.50 to 62J.61.\n(e) The commissioner of human services shall apply for funding necessary to administer the incentive payments to providers authorized under title IV of the American Recovery and Reinvestment Act.\n(a) The commissioner of health, in consultation with the commissioner of human services, may require providers, dispensers, group purchasers, and pharmaceutical electronic data intermediaries to submit data in a form and manner specified by the commissioner to assess the status of adoption, effective use, and interoperability of electronic health records for the purpose of:\n(1) demonstrating Minnesota's progress on goals established by the Office of the National Coordinator to accelerate the adoption and effective use of health information technology established under the HITECH Act;\n(2) assisting the Centers for Medicare and Medicaid Services and the Department of Human Services in determining eligibility of health care professionals and hospitals to receive federal incentives for the adoption and effective use of health information technology under the HITECH Act or other federal incentive programs;\n(3) assisting the Office of the National Coordinator in completing required assessments of the impact of the implementation and effective use of health information technology in achieving goals identified in the national strategic plan, and completing studies required by the HITECH Act;\n(4) providing the data necessary to assist the Office of the National Coordinator in conducting evaluations of regional extension centers as required by the HITECH Act; and\n(5) other purposes as necessary to support the implementation of the HITECH Act.\n(b) The commissioner shall coordinate with the commissioner of human services and other state agencies in the collection of data required under this section to:\n(1) avoid duplicative reporting requirements;\n(2) maximize efficiencies in the development of reports on state activities as required by HITECH; and\n(3) determine health professional and hospital eligibility for incentives available under the HITECH Act.\n(c) The commissioner must not collect data or publish analyses that identify, or could potentially identify, individual patients. The commissioner must not collect individual patient data in identified or de-identified form.\nDevelopment of state agency information systems necessary to implement this section is subject to the authority of the Department of Information Technology Services in chapter 16E, including, but not limited to:\n(1) evaluation and approval of the system as specified in section 16E.03, subdivisions 3 and 4;\n(2) review of the system to ensure compliance with security policies, guidelines, and standards as specified in section 16E.03, subdivision 7; and\n(3) assurance that the system complies with accessibility standards developed under section 16E.03, subdivision 9.\nThe commissioner of human services shall administer an electronic health record incentives program according to section 4201 of the American Recovery and Reinvestment Act, Public Law 111-5 and Code of Federal Regulations, title 42, part 495.\n(a) For purposes of subdivisions 7 to 11, the following terms have the meanings given.\n(b) \"Certified electronic health record technology\" has the same meaning as defined in Code of Federal Regulations, title 42, part 495.4.\n(c) \"Commissioner\" means the commissioner of the Department of Human Services.\n(d) \"National Level Repository\" or \"NLR\" has the same meaning as defined in Code of Federal Regulations, title 42, part 495.\n(e) \"SMHP\" means the state Medicaid health information technology plan.\n(f) \"MEIP\" means the Minnesota electronic health record incentive program in this section.\n(g) \"Pediatrician\" means a physician who is certified by either the American Board of Pediatrics or the American Osteopathic Board of Pediatrics.\n(a) Eligible providers and eligible hospitals must successfully complete the NLR registration process defined by the Centers for Medicare and Medicaid Services before applying for the Minnesota electronic health record incentives program.\n(b) The commissioner shall collect any improper payments made under the Minnesota electronic health record incentives program.\n(c) Eligible providers and eligible hospitals enrolled in the Minnesota electronic health record incentives program must retain all records supporting eligibility for a minimum of six years.\n(d) The commissioner shall determine the allowable methodology options to be used by eligible providers and eligible hospitals for purposes of attesting to and calculating their Medicaid patient volume per Code of Federal Regulations, title 42, part 495.306.\n(e) Minnesota electronic health record incentives program payments must be processed and paid to the tax identification number designated by the eligible provider or eligible hospital.\n(f) The payment mechanism for Minnesota electronic health record incentives program payments must be determined by the commissioner.\n(g) The commissioner shall determine the 12-month period selected by the state as referenced in Code of Federal Regulation, title 42, part 495.310 (g)(1)(i)(B).\nThe commissioner is authorized to audit an eligible provider or eligible hospital that applies for an incentive payment through the Minnesota electronic health record incentives program, both before and after payment determination. The commissioner is authorized to use state and federal laws, regulations, and circulars to develop the department's audit criteria.\nAn eligible provider or eligible hospital who has received notification of an adverse action related to the Minnesota electronic health record incentives program may appeal the action pursuant to this section.\nAn eligible provider or eligible hospital who has received notice of an appealable issue related to the Minnesota electronic health record incentives program may appeal the action in accordance with procedures in this section.\n(a) For purposes of subdivisions 12 to 15, the following terms have the meanings given.\n(b) \"Provider\" means an eligible provider or eligible hospital for purposes of the Minnesota electronic health record incentives program.\n(c) \"Appealable issue\" means one or more of the following issues related to the Minnesota electronic health record incentives program:\n(1) incentive payments;\n(2) incentive payment amounts;\n(3) provider eligibility determination; or\n(4) demonstration of adopting, implementing, and upgrading, and meaningful use eligibility for incentives.\nTo appeal, the provider shall file with the commissioner a written notice of appeal. The appeal must be postmarked or received by the commissioner within 30 days of the date of issuance specified in the notice of action regarding the appealable issue. The notice of appeal must specify:\n(1) the appealable issues;\n(2) each disputed item;\n(3) the reason for the dispute;\n(4) the total dollar amount in dispute;\n(5) the computation that the provider believes is correct;\n(6) the authority relied upon for each disputed item;\n(7) the name and address of the person or firm with whom contacts may be made regarding the appeal; and\n(8) other information required by the commissioner.\n(a) Upon receipt of an appeal notice satisfying subdivision 14, the commissioner shall review the appeal and issue a written appeal determination on each appealed item with 90 days. Upon mutual agreement, the commissioner and the provider may extend the time for issuing a determination for a specified period. The commissioner shall notify the provider of the appeal determination. The appeal determination takes effect upon the date of issuance specified in the determination.\n(b) In reviewing the appeal, the commissioner may request additional written or oral information from the provider.\n(c) The provider has the right to present information by telephone, in writing, or in person concerning the appeal to the commissioner prior to the issuance of the appeal determination within 30 days of the date the appeal was received by the commissioner. The provider must request an in-person conference in writing, separate from the appeal letter. Statements made during the review process are not admissible in a contested case hearing absent an express stipulation by the parties to the contested case.\n(d) For an appeal item on which the provider disagrees with the appeal determination, the provider may file with the commissioner a written demand for a contested case hearing to determine the proper resolution of specified appeal items. The demand must be postmarked or received by the commissioner within 30 days of the date of issuance specified in the determination. A contested case demand for an appeal item nullifies the written appeal determination issued by the commissioner for that appeal item. The commissioner shall refer any contested case demand to the Office of the Attorney General.\n(e) A contested case hearing must be heard by an administrative law judge according to sections 14.48 to 14.56. In any proceeding under this section, the appealing party must demonstrate by a preponderance of the evidence that the Minnesota electronic health record incentives program eligibility determination is incorrect.\n(f) Regardless of any appeal, the Minnesota electronic health record incentives program eligibility determination must remain in effect until final resolution of the appeal.\n(g) The commissioner has discretion to issue to the provider a proposed resolution for specified appeal items upon a request from the provider filed separately from the notice of appeal. The proposed resolution is final upon written acceptance by the provider within 30 days of the date the proposed resolution was mailed to or personally received by the provider, whichever is earlier.",
	"repealed": false
}