{
	"id": "14.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.381",
	"title": "14.381 UNADOPTED RULES.",
	"text": "(a) A person may petition the Office of Administrative Hearings seeking an order of an administrative law judge determining that an agency is enforcing or attempting to enforce a policy, guideline, bulletin, criterion, manual standard, or similar pronouncement as though it were a duly adopted rule. The petition must be supported by affidavit and must be served upon the agency. The agency shall respond in writing to the petition within ten working days. The administrative law judge may order oral argument on the petition, but only if necessary to a decision.\n(b) An agency determination is not considered an unadopted rule when the agency enforces a law or rule by applying the law or rule to specific facts on a case-by-case basis.\nThe order of the administrative law judge must direct the agency to cease enforcement of the unadopted rule that is the subject of the petition. The order must be served upon the parties and the Legislative Coordinating Commission by first class mail and must be published by the agency in the State Register. The decision of the administrative law judge may be appealed under sections 14.44 and 14.45.\nThe agency is liable for all Office of Administrative Hearings costs associated with review of the petition. If the administrative law judge rules in favor of the agency, the agency may recover all or a portion of the costs from the petitioner unless the petitioner is entitled to proceed in forma pauperis under section 563.01 or the administrative law judge determines that the petition was brought in good faith and that an assessment of the costs would constitute an undue hardship for the petitioner. If an agency has reason to believe it will prevail in the consideration of a petition, and that an effort to recover costs from the petitioner will be unsuccessful, it may request the chief administrative law judge to require the petitioner to provide bond or a deposit to the agency in an amount the chief administrative law judge estimates will be the cost to the Office of Administrative Hearings to review the petition.",
	"repealed": false
}