{
	"id": "290.0121",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0121",
	"title": "290.0121 DEPENDENT EXEMPTION.",
	"text": "(a) A taxpayer's dependent exemption equals:\n(1) the exemption amount multiplied by the number of individuals who are dependents, as defined in sections 151 and 152 of the Internal Revenue Code, of the taxpayer for the taxable year; minus\n(2) the disallowed exemption amount under subdivision 2, but the remainder may not be less than zero.\n(b) The exemption amount equals $4,250.\n(a) The disallowed exemption amount equals the dependent exemption allowed under subdivision 1, paragraph (a), clause (1), multiplied by the applicable percentage.\n(b) For a married individual filing a separate return, \"applicable percentage\" means two percentage points for each $1,250, or fraction of that amount, by which the taxpayer's federal adjusted gross income for the taxable year exceeds the threshold amount. For all other filers, applicable percentage means two percentage points for each $2,500, or fraction of that amount, by which the taxpayer's federal adjusted gross income for the taxable year exceeds the threshold amount. The applicable percentage must not exceed 100 percent.\n(c) \"Threshold amount\" means:\n(1) $291,950 for a joint return or a surviving spouse;\n(2) $243,300 for a head of a household;\n(3) $194,650 for an individual who is not married and who is not a surviving spouse or head of a household; and\n(4) half the amount for a joint return for a married individual filing a separate return.\nFor taxable years beginning after December 31, 2019, the commissioner must adjust for inflation the exemption amount in subdivision 1, paragraph (b), and the threshold amounts in subdivision 2, as provided in section 270C.22. The statutory year is taxable year 2019. The amounts as adjusted must be rounded down to the nearest $50 amount. The threshold amount for married individuals filing separate returns must be one-half of the adjusted amount for married individuals filing joint returns.",
	"repealed": false
}