{
	"id": "580.032",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.032",
	"title": "580.032 REQUEST FOR NOTICE; MAILED NOTICE.",
	"text": "A person having a redeemable interest in real property under section 580.23 or 580.24, may record a request for notice of a mortgage foreclosure by advertisement with the county recorder or registrar of titles of the county where the property is located. To be effective for purposes of this section, a request for notice must be recorded as a separate and distinct document, except a mechanic's lien statement recorded pursuant to section 514.08 also constitutes a request for notice if the mechanic's lien statement includes a legal description of the real property and the name and mailing address of the mechanic's lien claimant.\nA request for notice must specify: (1) the name and mailing address of the person requesting notice; (2) a legal description of the real property; (3) a description of the person's redeemable interest including, if applicable, the date and recording information of the document creating the interest; and (4) a request for notice of a mortgage foreclosure by advertisement. The request must be executed and acknowledged by the person requesting notice.\nA person foreclosing a mortgage by advertisement shall record a notice of the pendency of the foreclosure with the county recorder or registrar of titles in the county in which the property is located before the first date of publication of the foreclosure notice but not more than six months before the first date of publication.\nA person foreclosing a mortgage by advertisement shall mail, at least 14 days before the date of sale, a copy of the notice of sale to each person requesting notice in a recorded request for notice at the address specified in the recorded request for notice. Mailed notice is deemed given upon deposit in the United States mail first class, postage prepaid, and addressed to the person requesting notice. Notice need not be mailed to a person: (1) whose request for notice was recorded before the recording of the mortgage being foreclosed or after the recording of the notice of pendency provided in subdivision 3; (2) served pursuant to section 580.03; or (3) who no longer has a redeemable interest.\nIf a person foreclosing a mortgage by advertisement fails to mail a notice of the sale in accordance with subdivision 4, the failure does not invalidate the foreclosure.\nIf notice of the sale is not mailed in accordance with subdivision 4 to a person with a properly recorded request for notice, the person requesting notice has a cause of action against the person foreclosing the mortgage for money damages for the lesser of: (1) the equity in the mortgaged premises that would have been available to the person if the person had redeemed; or (2) the value of the person's redeemable interest. The value of a lienholder's redeemable interest is the amount due on and secured by the lien. The person requesting notice has the burden of proving that the notice of the sale was not mailed in accordance with subdivision 4 and that the person requesting notice had a valid redeemable interest in the mortgaged premises, had measurable damages, had the financial ability to redeem, and did not have actual notice of the sale at least 60 days before expiration of the mortgagor's period of redemption. An action for damages resulting from failure to mail notice must be brought within two years of the date of the sheriff's sale.\nNotwithstanding subdivision 6, if notice was not mailed in accordance with subdivision 4 to a person requesting notice, the requester has no cause of action against the person foreclosing the mortgage if at least 60 days before the mortgagor's period of redemption expires, a copy of the sheriff's certificate of sale is mailed in the manner provided in this section to the person requesting notice.\nThe recording of a request for notice by itself does not give the person requesting notice any interest in the mortgaged premises for any purpose. A recorded request for notice does not constitute actual or constructive notice of any interest in the real property.\nThis section is effective August 1, 1992. This section applies only to mortgages foreclosed by advertisement when the first date of publication is after January 1, 1993.",
	"repealed": false
}