{
	"id": "306.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.111",
	"title": "306.111 VACANCIES AMONG ASSOCIATES, PROCEDURE FOR FILLING.",
	"text": "An incorporated public cemetery association without capital stock, organized under state law, which has acquired a burial site and sold lots in it and for which a majority of the associates of the corporation are deceased or have for three years or more not acted as associates, may by a meeting of the lot owners of the cemetery fill the vacancies among the associates.\nThree or more lot owners of the cemetery may mail notice to all the lot owners known to them or whose addresses appear in the cemetery records that a meeting of the lot owners will be held not less than 14 days after the mailing at a time and place to be fixed by them and designated in the notice, in the county where the cemetery is located, for the purpose of filling the vacancies among the associates.\nThe meeting must be held at the time and place provided in the notice. An owner of one or more lots in the cemetery may attend in person or by proxy and is entitled to one vote at that and all subsequent meetings of the lot owners. The meeting may be called to order by any lot owner and shall be organized by choosing in the usual manner a chair and a secretary. The meeting must then proceed to fill the vacancies among the associates. A voice vote must be used unless otherwise ordered by those present at the meeting. A majority of the lot owners voting at the meeting shall elect.\nThe chair and the secretary of the meeting shall, within five days after the meeting is held, prepare a certificate that recites the facts required by subdivision 1. It must also state that the meeting was held, giving the names of the chair and the secretary and the names of the lot owners present and voting. However, if more than ten are present and voting, the names of ten of the voters are sufficient, but in that case the number of lot owners present and voting must be stated. The certificate must also give the names of the persons elected as associates. The certificate must be recorded at length in the office of the county recorder in the county where the cemetery is located. The certificate or the record of it is prima facie evidence of all the facts stated in it that are required to be stated.\nThe associates elected at the meeting of the lot owners shall exercise the powers of associates provided by law and the articles of incorporation of the association, and fill any vacancy in the board of directors or trustees of the association.",
	"repealed": false
}