{
	"id": "374.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/374.20",
	"title": "374.20 SALE OR LEASE OF LANDS NOT USED.",
	"text": "If any land or buildings owned and used by either the county or the city, or jointly owned and used by them, is not required for use by the county or city, or both of them, after the new building is completed, the land and buildings shall be sold as soon as practicable. The proceeds shall be placed in separate funds of the county and city and used for the payment of bonds or certificates of indebtedness authorized by the county and courthouse and city hall bonds issued by the city. The proceeds of the sales shall be paid to the county and city in the proportion of ownership of each in the real property sold. So far as practicable the proceeds of the sales shall be used to pay a portion of the bonds or certificates of indebtedness maturing in each year after sales so that the annual payments from the proceeds of the sales as nearly equal as may be in each of the years in which bonds or certificates of indebtedness mature. No part of the proceeds of the sales shall be used to pay interest charges on any bonds issued. No part shall be used for any purpose other than the payment of maturing bond or certificates of indebtedness, unless there is a surplus after the payment of all bonds or certificates of indebtedness. The surplus shall then be paid into the general sinking fund of the city and county.\nThe city and county may sell or lease to the other for a nominal or other consideration, all or part of its interest in the land. If the purchasing city or county resells the land to a purchaser other than the city or county as soon as practicable, the proceeds of the resale shall be equally divided between the city and county. If the land or any part is leased by either the city or county, as provided under this section, the lease must permit the sale of the land to a purchaser other than the city or county as soon as practicable.\nIf either the city or county acquires full title to the property, the city or county may, in the sale of the property, consider their combined economic, financial and industrial interests, as well as the price offered, with relation to a proposed project, and include these factors in the specifications or proposals for the sale.\nThis section shall be liberally construed to carry out its purpose. If any portion or clause of the section is held invalid, the validity of the balance shall not be affected.",
	"repealed": false
}