{
	"id": "354B.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/354B.211",
	"title": "354B.211 COVERAGE.",
	"text": "(a) The following persons are eligible to have coverage by the individual retirement account plan or coverage by another plan as further specified in this section:\n(1) employees who are employed for at least 25 percent of a full academic year, exclusive of the summer session, in eligible unclassified faculty positions under section 354B.20, subdivision 6a; and\n(2) employees who are employed for at least 25 percent of a full fiscal year in eligible unclassified administrative positions under section 354B.20, subdivision 6.\n(b) An employee who becomes eligible under paragraph (a), clause (1) or (2), remains eligible regardless of (1) a break in service, or (2) the percentage of full time worked in any covered employment.\n(a) The default retirement coverage specified under this subdivision for an eligible employee applies to all covered employment unless the eligible employee makes a coverage election under subdivision 4.\n(b) The individual retirement account plan is the default coverage if:\n(1) the eligible employee does not have continuing coverage under subdivision 3; and\n(2) the eligible employee:\n(i) was employed before July 1, 2011; or\n(ii) is employed on or after July 1, 2011, and does not have allowable service credit or an account in any retirement plan listed in section 356.30, subdivision 3.\n(c) The Teachers Retirement Association is the default coverage if the eligible employee (1) does not have continuing coverage under subdivision 3, paragraph (c) or (d), (2) is employed on or after July 1, 2011, and (3) has allowable service credit or an account in any retirement plan listed in section 356.30, subdivision 3.\n(d) At the time of hire, the employee must certify to the employer the existence of any allowable service credit or an account within any plan listed in section 356.30, subdivision 3. If an employee fails to provide certification, the Minnesota State Colleges and Universities system and its board shall be held harmless and, notwithstanding any law to the contrary, any resulting cost or financial liability becomes the employee's responsibility.\n(a) If an employee was employed in a technical college faculty position with Teachers Retirement Association coverage on or before June 30, 1997, that coverage continues for all covered employment unless the employee elects coverage under paragraph (e).\n(b) If an employee was employed in a technical college faculty position on or before June 30, 1995, and covered by a former first class city teacher retirement fund association, the Teachers Retirement Association shall provide coverage for all covered employment unless the employee elects coverage under paragraph (e).\n(c) If an employee was employed in a technical college faculty position with St. Paul Teachers Retirement Fund Association coverage on or before June 30, 1995, that coverage continues for all covered employment unless the employee elects coverage under paragraph (e).\n(d) If an employee was employed in a technical college position with Public Employees Retirement Association coverage on or before June 30, 1995, that coverage continues for all covered employment unless the employee elects coverage under paragraph (e).\n(e) If an employee under this subdivision changes employment within the Minnesota State Colleges and Universities system, the employee is authorized to elect prospective coverage by the individual retirement account plan pursuant to subdivision 4 for all subsequent covered employment.\n(a) Unless a timely coverage election is made as specified below, an eligible employee retains the default coverage specified in subdivision 2 for all covered employment.\n(1) An eligible employee who has default coverage with the individual retirement account plan under subdivision 2 may elect prospective Teachers Retirement Association coverage.\n(2) An eligible employee who has default coverage with the Teachers Retirement Association under subdivision 2 may elect prospective coverage by the individual retirement account plan.\n(b) An election under paragraph (a) must be made within one year of commencing covered employment. If an election is not made within one year of commencing covered employment and the employee separated from such covered employment prior to completion of the year, an election may be made within 90 days of returning to covered employment.\n(c) Except as provided in subdivision 6, purchasing service credit in the Teachers Retirement Association for any period of Minnesota State Colleges and Universities system employment occurring before the election under this section is prohibited.\n(d) An election made under this subdivision is irrevocable unless a subsequent election is made under subdivision 6.\n(a) No later than 90 days before the end of any applicable election period specified in this section, the employer must provide an eligible employee the following information:\n(1) the eligible employee's default retirement coverage;\n(2) the form for electing alternative coverage other than the default coverage; and\n(3) the website addresses for the plan providing default coverage and comparable information for the applicable optional coverage.\n(b) The election of coverage forms must include a certification statement that the employee has received and reviewed materials on the alternative and default coverages prior to making the election.\n(a) A faculty member, defined as a person employed in an eligible unclassified faculty position under section 354B.20, subdivision 6a, who is a member of the individual retirement account plan may elect to transfer retirement coverage to the Teachers Retirement Association within one year of the faculty member first achieving tenure or its equivalent at a Minnesota state college or university.\n(b) A faculty member electing Teachers Retirement Association coverage must purchase service credit in the Teachers Retirement Association for the entire period of time covered under the individual retirement account plan. The purchase payment amount must be determined under section 356.551. The Teachers Retirement Association may charge a faculty member transferring coverage a reasonable fee to cover the costs associated with computing the actuarial cost of purchasing service credit and making the transfer.\n(c) A faculty member purchasing service credit in the Teachers Retirement Association may use:\n(1) any balances in the faculty member's individual retirement account plan or higher education supplemental retirement plan established under chapter 354C; or\n(2) any source specified in section 356.441, subdivision 1.\nIf the total amount of payments under this paragraph is less than the total purchase payment amount under section 356.551, and the employee fails to make timely payments as determined by the Teachers Retirement Association, all payment amounts must be refunded to the applicable source.\nAn employee on a leave of absence from a classified position who is appointed to an acting, interim, or temporary unclassified position retains the retirement coverage that the employee had in the prior classified position for up to one year of covered employment. If the employee continues in the unclassified position, the employee has the option to make an election under subdivision 4, provided no previous election had been made under that subdivision.\nNotwithstanding subdivision 1, an employee in a part-time eligible unclassified administrative position or eligible unclassified faculty position that constitutes less than 25 percent of a full academic year is eligible for Teachers Retirement Association coverage for all covered employment if the person certifies to the employer existing membership in the Teachers Retirement Association.",
	"repealed": false
}