{
	"id": "48A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.20",
	"title": "48A.20 SUPERVISION OF OUT-OF-STATE TRUST INSTITUTIONS.",
	"text": "To the extent consistent with subdivision 3, the commissioner may make examinations of an office established and maintained in this state under this chapter by an out-of-state trust institution as the commissioner considers necessary to determine whether the office is being operated in compliance with the laws of this state and according to safe and sound banking practices. Section 46.04 applies to these examinations.\nThe commissioner may require periodic reports regarding an out-of-state trust institution that has established and maintained an office in this state according to this chapter. The required reports shall be provided by the trust institution or by the home state regulator. Any reporting requirements prescribed by the commissioner under this subdivision shall be:\n(1) consistent with the reporting requirements applicable to state trust companies; and\n(2) appropriate to allow the commissioner to carry out the commissioner's responsibilities under this chapter.\n(a) The commissioner may enter into cooperative, coordinating, and information-sharing agreements with any other bank supervisory agencies or an organization affiliated with or representing one or more bank supervisory agencies with respect to the periodic examination or other supervision of an office in this state of an out-of-state trust institution, or an office of a state trust institution in a host state. The commissioner may accept a report of examination and report of investigation from a party to the agreement in lieu of conducting the commissioner's own examination or investigation.\n(b) The commissioner may enter into contracts with any bank supervisory agency that has concurrent jurisdiction over a state trust institution or an out-of-state trust institution maintaining an office in this state to engage the services of that agency's examiners at a reasonable rate of compensation or to provide the services of the commissioner's examiners to the agency at a reasonable rate of compensation.\n(c) The commissioner may enter into joint examinations or joint enforcement actions with other bank supervisory agencies having concurrent jurisdiction over any office established and maintained in this state by an out-of-state trust institution or an office established and maintained by a state trust institution in any host state. The commissioner may at any time take actions independently if the commissioner considers the actions to be necessary or appropriate to carry out the commissioner's responsibilities under this section or to ensure compliance with the laws of this state. In the case of an out-of-state trust institution, the commissioner shall recognize the exclusive authority of the home state regulator over corporate governance matters and the primary responsibility of the home state regulator with respect to safety and soundness matters.\nEach out-of-state trust institution that maintains one or more offices in this state may be assessed and, if assessed, shall pay supervisory and examination fees according to the laws of this state and rules of the commissioner. The fees may be shared with other bank supervisory agencies or an organization affiliated with or representing one or more bank supervisory agencies under agreements between the parties and the commissioner.",
	"repealed": false
}