{
	"id": "326.3382",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.3382",
	"title": "326.3382 APPLICATION FOR LICENSE.",
	"text": "(a) Application for a private detective or protective agent license shall be made on a form prescribed by the board. Each applicant shall provide the following information:\n(1) the full name, date of birth, and sex of each person signing the application, and the residences of those persons for the past five years;\n(2) all past and present occupations and employers, length of employment, and the name, address, and telephone numbers of supervisors for all persons signing the application;\n(3) the address or a description indicating the location of the place of business of the applicant;\n(4) a statement indicating that each person signing the application has attained the age of 18;\n(5) if the applicant is a corporation, the name of the corporation, the date and place of incorporation, and the location of its principal place of business or registered office in its state of incorporation; and\n(6) further facts as may be required by the board to show the good character, competency, and integrity of each person signing the application; and\n(b) each application shall be signed and acknowledged as follows:\n(1) if the applicant is an individual, by the individual;\n(2) if the applicant is a partnership, by each partner, one of whom must be a qualified representative; or\n(3) if the applicant is a corporation, by the chief executive officer, chief financial officer, and the qualified representative of the corporation. If the principal place of the applicant's business is outside Minnesota, the application shall also include the signature of the Minnesota manager.\n(a) Each individual signing the application shall submit:\n(1) references, on forms provided by the board, from five persons who have known the signer for at least five years, and who are not related by blood or marriage to the signer; and\n(2) a recent photograph and a full set of fingerprints for each person signing the application.\n(b) If the application is for a private detective license, the individual signing the application shall submit a statement under oath by a present or previous employer that the applicant for an individual license, the qualified representative for a partnership or corporate license, or the Minnesota manager, as appropriate, has been employed as an investigator for a minimum of 6,000 hours by any of the following:\n(1) a licensed private detective agency;\n(2) a United States government investigative service;\n(3) a city police department or sheriff's office; or\n(4) an occupation that, the board finds equivalent in scope, responsibility, and training to one of the specific occupations listed;\nand has the qualifications established in the rules of the board.\n(c) If the application is for a protective agent license, each person signing the application shall submit a statement under oath by a present or previous employer that the applicant for an individual license, the qualified representative for a partnership or corporate license, or the Minnesota manager has been employed as an investigator or protective agent for a minimum of 6,000 hours by any of the following:\n(1) a licensed protective agent or licensed private detective, having gained experience in security systems, audits, and supervision;\n(2) a United States government investigative service;\n(3) a city police department or sheriff's office; or\n(4) an occupation that the board finds equivalent in scope, responsibility, and training to one of the specific occupations listed;\nand has the qualifications established in the rules of the board.\n(a) No license may be issued to a private detective or protective agent applicant until the applicant has complied with the requirements in this subdivision.\n(b) The applicant shall execute a surety bond to the state of Minnesota in the penal sum of $10,000 and file it with the board. The surety bond must be executed by a company authorized to do business in the state of Minnesota, must name the applicant as principal, and must state that the applicant and each of the applicant's employees shall faithfully observe all of the laws of Minnesota and of the United States and shall pay all damages suffered by any person by reason of a violation of law by the applicant or by the commission of any willful and malicious wrong by the applicant in the course of business.\n(c) The applicant shall furnish proof, acceptable to the board, of the applicant's ability to respond in damages for liability on account of accidents or wrongdoings arising out of the ownership and operation of a private detective or protective agent business. Compliance with paragraph (d), (e), or (f) is satisfactory proof of financial responsibility for purposes of this paragraph.\n(d) The applicant may file with the board a certificate of insurance demonstrating coverage for general liability, completed operations, and personal injury. Personal injury insurance must include coverage for:\n(1) false arrest, detention, imprisonment, and malicious prosecution;\n(2) libel, slander, defamation, and violation of rights of privacy; and\n(3) wrongful entry, eviction, and other invasion of rights of private occupancy.\nIn the event of a policy cancellation, the insurer will send notice to the board at the same time that a cancellation request is received from or a notice is sent to the insured.\n(e) The applicant may file with the board an annual net worth statement, signed by a licensed certified public accountant, evidencing that the applicant has a net worth of at least the following:\n(1) for an applicant with no employees, $10,000;\n(2) for an applicant with one to ten employees, $15,000;\n(3) for an applicant with 11 to 25 employees, $25,000;\n(4) for an applicant with 26 to 50 employees, $50,000; or\n(5) for an applicant with 51 or more employees, $100,000.\nData indicating with which of the above requirements an applicant must comply is public data. The contents of the net worth statement are private data on individuals or nonpublic data, as defined in section 13.02.\n(f) The applicant may file with the board an irrevocable letter of credit from a financial institution acceptable to the board in the amount listed in the appropriate category in paragraph (e).\nUnlicensed activity will not be considered as legitimate experience for qualification in being licensed. An individual, partnership, corporation, qualified representative, or Minnesota manager engaged in the business of a private detective or protective agent without a license issued by the board is prohibited from applying for licensing for a period of one year from the date of a finding of the violation.\nThe board shall establish a special protective agent license classification that provides that a person described in section 326.338, subdivision 4, clause (4), who is otherwise qualified under this section need not meet the requirements of subdivision 2, paragraph (c).\nThe board shall establish a temporary license to engage in the business of private detective or protective agent in accordance with section 197.4552. The fee for the temporary license under this subdivision for a private detective is $1,000. The fee for a temporary license under this subdivision for a protective agent is $800.",
	"repealed": false
}