{
	"id": "604.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.02",
	"title": "604.02 APPORTIONMENT OF DAMAGES.",
	"text": "When two or more persons are severally liable, contributions to awards shall be in proportion to the percentage of fault attributable to each, except that the following persons are jointly and severally liable for the whole award:\n(1) a person whose fault is greater than 50 percent;\n(2) two or more persons who act in a common scheme or plan that results in injury;\n(3) a person who commits an intentional tort; or\n(4) a person whose liability arises under chapters 18B - pesticide control, 115 - water pollution control, 115A - waste management, 115B - environmental response and liability, 115C - leaking underground storage tanks, and 299J - pipeline safety, public nuisance law for damage to the environment or the public health, any other environmental or public health law, or any environmental or public health ordinance or program of a municipality as defined in section 466.01.\nThis section applies to claims arising from events that occur on or after August 1, 2003.\nUpon motion made not later than one year after judgment is entered, the court shall determine whether all or part of a party's equitable share of the obligation is uncollectible from that party and shall reallocate any uncollectible amount among the other parties, including a claimant at fault, according to their respective percentages of fault. A party whose liability is reallocated is nonetheless subject to contribution and to any continuing liability to the claimant on the judgment.\nIn the case of a claim arising from the manufacture, sale, use or consumption of a product, an amount uncollectible from any person in the chain of manufacture and distribution shall be reallocated among all other persons in the chain of manufacture and distribution but not among the claimant or others at fault who are not in the chain of manufacture or distribution of the product. Provided, however, that a person whose fault is less than that of a claimant is liable to the claimant only for that portion of the judgment which represents the percentage of fault attributable to the person whose fault is less.",
	"repealed": false
}