{
	"id": "114E.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/114E.40",
	"title": "114E.40 DURATION; MODIFICATION OR TERMINATION BY ADMINISTRATIVE OR COURT ACTION.",
	"text": "(a) An environmental covenant is perpetual unless it is:\n(1) by its terms limited to a specific duration or terminated by the occurrence of a specific event;\n(2) terminated by consent pursuant to section 114E.45;\n(3) terminated pursuant to paragraph (b) or (e);\n(4) terminated by foreclosure of an interest that has priority over the environmental covenant; or\n(5) terminated or modified in an eminent domain proceeding, but only if:\n(i) the environmental agency that signed the covenant is a party to the proceeding;\n(ii) all persons identified in paragraph (c) are given notice of the pendency of the proceeding; and\n(iii) the court determines, after hearing, that the activity and use limitations subject to termination or modification are no longer required to protect public health or welfare or the environment.\n(b) The environmental agency that approved an environmental covenant may determine whether to terminate or reduce the burden on the real property of the covenant if the agency determines that some or all of the activity and use limitations under the covenant are no longer required to protect public health or welfare or the environment or modify the covenant if the agency determines that modification is required to adequately protect public health or welfare or the environment.\n(c) The environmental agency shall provide notice of any proposed action under paragraph (b) to each person with a current recorded interest in the real property subject to the environmental covenant, each holder, all other persons who originally signed the environmental covenant, or their successors or assigns, and any other person with rights or obligations under the covenant. The environmental agency shall provide 30 days for comment on the proposed action by parties entitled to notice. Any person entitled to notice under this paragraph may request a contested case under chapter 14 by making the request in writing within the 30-day comment period. A determination by an environmental agency under this paragraph is a final agency decision subject to judicial review in the same manner as provided in sections 14.63 to 14.68 or under applicable federal law.\n(d) Any person entitled to notice under paragraph (c) may apply in writing to the environmental agency for a determination under paragraph (b) that an existing covenant be terminated, that the burden of a covenant be reduced, or that the covenant be modified. The application must specify the determination sought by the applicant, the reasons why the environmental agency should make the determination, and the information which would support it. If the environmental agency fails to commence a proceeding under paragraph (b) within 60 days of receipt of the application, the applicant may bring a de novo action in the district court for termination, reduction of burden, or modification of the environmental covenant pursuant to paragraph (e).\n(e) The district court for the county in which the real property subject to an environmental covenant is located may, under the doctrine of changed circumstances, terminate the covenant, reduce its burden on the real property, or modify its terms in a de novo action if an environmental agency fails to commence a proceeding within 60 days as provided under paragraph (d). The applicant under paragraph (d), any party to the environmental covenant, or any other person identified in paragraph (c) may commence an action under this paragraph. The person commencing the action shall serve notice of the action on the environmental agency and any person entitled to notice under paragraph (c). The court shall terminate, reduce the burden of, or modify the environmental covenant if the court determines that the person bringing the action shows that some or all of the activity and use limitations under the covenant do not, or are no longer required to, protect public health or welfare or the environment.\n(f) An environmental covenant may not be extinguished, limited, or impaired through issuance of a tax deed, foreclosure of a tax lien, or application of the doctrine of adverse possession, prescription, abandonment, waiver, lack of enforcement, or acquiescence, or a similar doctrine.\n(g) An environmental covenant may not be extinguished, limited, or impaired by application of section 500.20 or 541.023.",
	"repealed": false
}