{
	"id": "268.059",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.059",
	"title": "268.059 GARNISHMENT FOR DELINQUENT TAXES AND UNEMPLOYMENT BENEFIT OVERPAYMENTS.",
	"text": "The commissioner may give notice to any employer that an employee owes any amounts due under this chapter or section 116L.20, and that the obligation should be withheld from the employee's wages. The commissioner may proceed only if the amount due is uncontested or if the time for any appeal has expired. The commissioner may not proceed until 30 calendar days after sending to the debtor employee, by mail or electronic transmission, a notice of intent to garnish wages and exemption notice. That notice must list:\n(1) the amount due from the debtor;\n(2) demand for immediate payment; and\n(3) the intention to serve a garnishment notice on the debtor's employer.\nThe notice expires 180 calendar days after it has been sent to the debtor provided that the notice may be renewed by sending a new notice that is in accordance with this section. The renewed notice has the effect of reinstating the priority of the original notice. The exemption notice must be in substantially the same form as in section 571.72. The notice must inform the debtor of the right to claim exemptions contained in section 550.37, subdivision 14. If no claim of exemption is received by the commissioner within 30 calendar days after sending of the notice, the commissioner may proceed with the garnishment. The notice to the debtor's employer may be served by mail or electronic transmission and must be in substantially the same form as in section 571.75.\n(a) Upon receipt of the garnishment notice, the employer must withhold from the earnings due or to become due to the employee, the amount shown on the notice plus accrued interest, subject to section 571.922. The employer must continue to withhold each pay period the amount shown on the notice plus accrued interest until the garnishment notice is released by the commissioner. Upon receipt of notice by the employer, the claim of the commissioner has priority over any subsequent garnishments or wage assignments. The commissioner may arrange between the employer and employee for withholding a portion of the total amount due the employee each pay period, until the total amount shown on the notice plus accrued interest has been withheld.\nThe \"earnings due\" any employee is as defined in section 571.921.\n(b) The maximum garnishment allowed for any one pay period must be decreased by any amounts payable under any other garnishment action served before the garnishment notice, and any amounts covered by any irrevocable and previously effective assignment of wages; the employer must give notice to the commissioner of the amounts and the facts relating to the assignment within ten calendar days after the service of the garnishment notice on the form provided by the commissioner.\n(c) Within ten calendar days after the expiration of the pay period, the employer must remit to the commissioner, on a form and in the manner prescribed by the commissioner, the amount withheld during each pay period.\n(a) If the employee ceases to be employed by the employer before the full amount set forth on the garnishment notice plus accrued interest has been withheld, the employer must immediately notify the commissioner in writing or by electronic transmission, as prescribed by the commissioner, of the termination date of the employee and the total amount withheld. No employer may discharge or discipline any employee because the commissioner has proceeded under this section. If an employer discharges an employee in violation of this section, the employee has the same remedy as provided in section 571.927, subdivision 2.\n(b) This section applies if the employer is the state of Minnesota or any political subdivision.\n(c) The commissioner must refund to the employee any excess amounts withheld from the employee.\n(d) An employer that fails or refuses to comply with this section is jointly and severally liable for the total amount due from the employee. Any amount due from the employer under this paragraph may be collected in the same manner as any other amounts due from an employer under this chapter.",
	"repealed": false
}