{
	"id": "62J.4982",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.4982",
	"title": "62J.4982 ENFORCEMENT AUTHORITY; COMPLIANCE.",
	"text": "(a) The commissioner may, for any violation of statute or rule applicable to a health information organization, levy an administrative penalty in an amount up to $25,000 for each violation. In determining the level of an administrative penalty, the commissioner shall consider the following factors:\n(1) the number of participating entities affected by the violation;\n(2) the effect of the violation on participating entities' access to health information exchange services;\n(3) if only one participating entity is affected, the effect of the violation on the patients of that entity;\n(4) whether the violation is an isolated incident or part of a pattern of violations;\n(5) the economic benefits derived by the health information organization by virtue of the violation;\n(6) whether the violation hindered or facilitated an individual's ability to obtain health care;\n(7) whether the violation was intentional;\n(8) whether the violation was beyond the direct control of the health information organization;\n(9) any history of prior compliance with the provisions of this section, including violations;\n(10) whether and to what extent the health information organization attempted to correct previous violations;\n(11) how the health information organization responded to technical assistance from the commissioner provided in the context of a compliance effort; and\n(12) the financial condition of the health information organization including but not limited to whether the health information organization had financial difficulties that affected its ability to comply or whether the imposition of an administrative monetary penalty would jeopardize the ability of the health information organization to continue to deliver health information exchange services.\nThe commissioner shall give reasonable notice in writing to the health information organization of the intent to levy the penalty and the reasons for it. A health information organization may have 15 days within which to contest whether the facts found constitute a violation of sections 62J.4981 and 62J.4982, according to the contested case and judicial review provisions of sections 14.57 to 14.69.\n(b) If the commissioner has reason to believe that a violation of section 62J.4981 or 62J.4982 has occurred or is likely, the commissioner may confer with the persons involved before commencing action under subdivision 2. The commissioner may notify the health information organization and the representatives, or other persons who appear to be involved in the suspected violation, to arrange a voluntary conference with the alleged violators or their authorized representatives. The purpose of the conference is to attempt to learn the facts about the suspected violation and, if it appears that a violation has occurred or is threatened, to find a way to correct or prevent it. The conference is not governed by any formal procedural requirements, and may be conducted as the commissioner considers appropriate.\n(c) The commissioner may issue an order directing a health information organization or a representative of a health information organization to cease and desist from engaging in any act or practice in violation of sections 62J.4981 and 62J.4982.\n(d) Within 20 days after service of the order to cease and desist, a health information organization may contest whether the facts found constitute a violation of sections 62J.4981 and 62J.4982 according to the contested case and judicial review provisions of sections 14.57 to 14.69.\n(e) In the event of noncompliance with a cease and desist order issued under this subdivision, the commissioner may institute a proceeding to obtain injunctive relief or other appropriate relief in Ramsey County District Court.\n(a) The commissioner may suspend or revoke a certificate of authority issued to a health information organization under section 62J.4981 if the commissioner finds that:\n(1) the health information organization is operating significantly in contravention of its basic organizational document, or in a manner contrary to that described in and reasonably inferred from any other information submitted under section 62J.4981, unless amendments to the submissions have been filed with and approved by the commissioner;\n(2) the health information organization is unable to fulfill its obligations to furnish comprehensive health information exchange services as required under its health information exchange contract;\n(3) the health information organization is no longer financially solvent or may not reasonably be expected to meet its obligations to participating entities;\n(4) the health information organization has failed to implement the complaint system in a manner designed to reasonably resolve valid complaints;\n(5) the health information organization, or any person acting with its sanction, has advertised or merchandised its services in an untrue, misleading, deceptive, or unfair manner;\n(6) the continued operation of the health information organization would be hazardous to its participating entities or the patients served by the participating entities; or\n(7) the health information organization has otherwise failed to substantially comply with section 62J.4981 or with any other statute or administrative rule applicable to health information exchange service providers, or has submitted false information in any report required under sections 62J.498 to 62J.4982.\n(b) A certificate of authority shall be suspended or revoked only after meeting the requirements of subdivision 3.\n(c) If the certificate of authority of a health information organization is suspended, the health information organization shall not, during the period of suspension, enroll any additional participating entities, and shall not engage in any advertising or solicitation.\n(d) If the certificate of authority of a health information organization is revoked, the organization shall proceed, immediately following the effective date of the order of revocation, to wind up its affairs, and shall conduct no further business except as necessary to the orderly conclusion of the affairs of the organization. The organization shall engage in no further advertising or solicitation. The commissioner may, by written order, permit further operation of the organization as the commissioner finds to be in the best interest of participating entities, to the end that participating entities will be given the greatest practical opportunity to access continuing health information exchange services.\n(a) When the commissioner has cause to believe that grounds for the denial, suspension, or revocation of a certificate of authority exist, the commissioner shall notify the health information organization in writing stating the grounds for denial, suspension, or revocation and setting a time within 20 days for a hearing on the matter.\n(b) After a hearing before the commissioner at which the health information organization may respond to the grounds for denial, suspension, or revocation, or upon the failure of the health information organization to appear at the hearing, the commissioner shall take action as deemed necessary and shall issue written findings and mail them to the health information organization.\n(c) If suspension, revocation, or administrative penalty is proposed according to this section, the commissioner must deliver, or send by certified mail with return receipt requested, to the health information organization written notice of the commissioner's intent to impose a penalty. This notice of proposed determination must include:\n(1) a reference to the statutory basis for the penalty;\n(2) a description of the findings of fact regarding the violations with respect to which the penalty is proposed;\n(3) the nature and amount of the proposed penalty;\n(4) any circumstances described in subdivision 1, paragraph (a), that were considered in determining the amount of the proposed penalty;\n(5) instructions for responding to the notice, including a statement of the health information organization's right to a contested case proceeding and a statement that failure to request a contested case proceeding within 30 calendar days permits the imposition of the proposed penalty; and\n(6) the address to which the contested case proceeding request must be sent.\nThe commissioner shall, to the extent possible, seek the advice of the Minnesota e-Health Advisory Committee, in the review and update of criteria for the certification and recertification of health information organizations when implementing sections 62J.498 to 62J.4982.\n(a) The commissioner shall assess fees on every health information organization subject to sections 62J.4981 and 62J.4982 as follows:\n(1) filing an application for certificate of authority to operate as a health information organization, $7,000; and\n(2) annual health information organization certificate fee, $7,000.\n(b) Fees collected under this section shall be deposited in the state treasury and credited to the state government special revenue fund.\n(c) Administrative monetary penalties imposed under this subdivision shall be credited to an account in the special revenue fund and are appropriated to the commissioner for the purposes of sections 62J.498 to 62J.4982.",
	"repealed": false
}