{
	"id": "103G.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.251",
	"title": "103G.251 INVESTIGATING ACTIVITIES AFFECTING WATERS OF THE STATE.",
	"text": "If the commissioner determines that an investigation is in the public interest, the commissioner may investigate and monitor activities being conducted with or without a permit that may affect waters of the state.\n(a) With or without a public hearing, the commissioner may make findings and issue orders related to activities being conducted without a permit that affect waters of the state as otherwise authorized under this chapter.\n(b) A copy of the findings and order must be served on the person to whom the order is issued.\n(c) If the commissioner issues the findings and order without a hearing, the person to whom the order is issued may file a demand for a hearing with the commissioner. The demand for a hearing must be accompanied by the bond as provided in section 103G.311, subdivision 6, and the hearing must be held in the same manner and with the same requirements as a hearing held under section 103G.311, subdivision 5. The demand for a hearing and bond must be filed by 30 days after the person is served with a copy of the commissioner's order.\n(d) The hearing must be conducted as a contested case hearing under chapter 14.\n(e) If the person to whom the order is addressed does not demand a hearing or demands a hearing but fails to file the required bond:\n(1) the commissioner's order becomes final at the end of 30 days after the person is served with the order; and\n(2) the person may not appeal the order.\n(f) An order of the commissioner may be recorded or filed by the commissioner in the office of the county recorder or registrar of titles, as appropriate, in the county where the real property is located as a deed restriction on the property that runs with the land and is binding on the owners, successors, and assigns until the conditions of the order are met or the order is rescinded.",
	"repealed": false
}