{
	"id": "609.712",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.712",
	"title": "609.712 REAL AND SIMULATED WEAPONS OF MASS DESTRUCTION.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Biological agent\" means any microorganism, virus, infectious substance, or biological product that may be engineered as a result of biotechnology, or any naturally occurring or bioengineered component of a microorganism, virus, infectious substance, or biological product, that is capable of causing:\n(1) death, disease, or other biological malfunction in a human, an animal, a plant, or another living organism;\n(2) deterioration of food, water, equipment, supplies, or material of any kind; or\n(3) deleterious alteration of the environment.\n(c) \"Simulated weapon of mass destruction\" means any device, substance, or object that by its design, construction, content, or characteristics, appears to be or to contain, or is represented to be, constitute, or contain, a weapon of mass destruction, but that is, in fact, an inoperative facsimile, imitation, counterfeit, or representation of a weapon of mass destruction that does not meet the definition of a weapon of mass destruction or that does not actually contain or constitute a weapon, biological agent, toxin, vector, or delivery system prohibited by this section.\n(d) \"Toxin\" means the toxic material of plants, animals, microorganisms, viruses, fungi, or infectious substances, or a recombinant molecule, whatever its origin or method of production, including:\n(1) any poisonous substance or biological product that may be engineered as a result of biotechnology or produced by a living organism; or\n(2) any poisonous isomer or biological product, homolog, or derivative of such a substance.\n(e) \"Vector\" means a living organism or molecule, including a recombinant molecule or biological product that may be engineered as a result of biotechnology, capable of carrying a biological agent or toxin to a host.\n(f) \"Weapon of mass destruction\" includes weapons, substances, devices, vectors, or delivery systems that:\n(1) are designed or have the capacity to cause death or great bodily harm to a considerable number of people through the release, dissemination, or impact of toxic or poisonous chemicals, or their precursors, disease organisms, biological agents, or toxins; or\n(2) are designed to release radiation or radioactivity at a level dangerous to human life.\n(a) Whoever manufactures, acquires, possesses, or makes readily accessible to another a weapon of mass destruction with the intent to cause injury to another is guilty of a crime and may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $100,000, or both.\n(b) It is an affirmative defense to criminal liability under this subdivision if the defendant proves by a preponderance of the evidence that the conduct engaged in:\n(1) was specifically authorized under state or federal law and conducted in accordance with that law; or\n(2) was part of a legitimate scientific or medical research project, or constituted legitimate medical treatment.\n(a) Whoever knowingly manufactures, acquires, possesses, or makes readily accessible to another the following, or substances that are substantially similar in chemical makeup to the following, in levels dangerous to human life, is guilty of a crime:\n(1) variola major (smallpox);\n(2) bacillus anthracis (anthrax);\n(3) yersinia pestis (plague);\n(4) botulinum toxin (botulism);\n(5) francisella tularensis (tularemia);\n(6) viral hemorrhagic fevers;\n(7) a mustard agent;\n(8) lewisite;\n(9) hydrogen cyanide;\n(10) GA (Tabun);\n(11) GB (Sarin);\n(12) GD (Soman);\n(13) GF (cyclohexymethyl phosphonofluoridate);\n(14) VX (0-ethyl, supdiisopropylaminomethyl methylphosphonothiolate);\n(15) radioactive materials; or\n(16) any combination of the above.\n(b) A person who violates this subdivision may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $100,000, or both.\n(c) This subdivision does not apply to conduct:\n(1) specifically authorized under state or federal law and conducted in accordance with that law;\n(2) that is part of a legitimate scientific or medical research project; or\n(3) that constitutes legitimate medical treatment.\nWhoever manufactures, acquires, possesses, or makes readily accessible to another a simulated weapon of mass destruction with the intent of terrorizing another may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\nWhoever does the following with intent to terrorize another or cause evacuation of a place, whether a building or not, or disruption of another's activities, or with reckless disregard of the risk of causing terror, evacuation, or disruption, may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both:\n(1) displays a weapon of mass destruction or a simulated weapon of mass destruction;\n(2) threatens to use a weapon of mass destruction; or\n(3) communicates, whether directly or indirectly, that a weapon of mass destruction is or will be present or introduced at a place or location, or will be used to cause death, disease, or injury to another or to another's property, whether or not the same is in fact present or introduced.\nA person who violates this section is liable in a civil action brought by:\n(1) an individual for damages resulting from the violation; and\n(2) a municipality, the state, or a rescue organization to recover expenses incurred to provide investigative, rescue, medical, or other services for circumstances or injuries which resulted from the violation.",
	"repealed": false
}