{
	"id": "469.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.47",
	"title": "469.47 STATE INFRASTRUCTURE AID.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Construction projects\" means:\n(1) for expenditures by a medical business entity, construction of buildings in the city for which the building permit was issued after June 30, 2013; and\n(2) for any other expenditures, construction of privately owned buildings and other improvements that are undertaken pursuant to or as part of the development plan and are located within a medical center development district.\n(d) \"Expenditures\" means expenditures made by a medical business entity or by an individual or private entity on construction projects for the capital cost of the project including but not limited to:\n(1) design and predesign, including architectural, engineering, and similar services;\n(2) legal, regulatory, and other compliance costs of the project;\n(3) land acquisition, demolition of existing improvements, and other site preparation costs;\n(4) construction costs, including all materials and supplies of the project; and\n(5) equipment and furnishings that are attached to or become part of the real property.\nExpenditures excludes supplies and other items with a useful life of less than a year that are not used or consumed in constructing improvements to real property or are otherwise chargeable to capital costs.\n(e) \"Qualified expenditures for the year\" means the total certified expenditures since June 30, 2013, through the end of the preceding year, minus $200,000,000.\n(f) \"Transit costs\" means the portions of a public infrastructure project that are for public transit intended primarily to serve the district, including but not limited to buses and other means of transit, transit stations, equipment, bus charging stations or bus charging equipment, rights-of-way, and costs permitted under section 469.40, subdivision 11. This provision includes transit costs incurred on or after March 16, 2020.\nBy April 1 of each year, the medical business entity must certify to the commissioner the amount of expenditures made by the medical business entity in the preceding year. For expenditures made by an individual or entity other than the medical business entity, the corporation shall compile the information on the expenditures and may certify the amount to the commissioner. The certification must be made in the form that the commissioner prescribes and include any documentation of and supporting information regarding the expenditures that the commissioner requires. By August 1 of each year, the commissioner must determine the amount of the expenditures for the preceding year.\n(a) The amount of the general state infrastructure aid for a year equals the qualified expenditures for the year, as certified by the commissioner, multiplied by 2.75 percent. The maximum amount of state aid payable in any year is limited to no more than $30,000,000. If the commissioner determines that the city has made the required matching local contribution under subdivision 4, the commissioner must pay to the city the amount of general state infrastructure aid for the year by September 1. If the commissioner determines that the city has not made the full required matching local contribution for the year, the commissioner must pay only the aid permitted under the agreement for the matching contribution made and any unpaid amount is a carryover aid. The carryover aid must be paid in the first year after the required matching contribution is made and in which the aid entitlement for the current year is less than the maximum annual limit, but only to the extent the carryover, when added to the current year aid, is less than the maximum annual limit.\n(b) The city must use general state infrastructure aid it receives under this subdivision for improvements and other capital costs related to the public infrastructure projects approved or adopted by the corporation, other than transit costs. The city must maintain appropriate records to document the use of the funds under this requirement.\n(c) The commissioner, in consultation with the commissioner of management and budget, and representatives of the city and the corporation, must establish a total limit on the amount of state aid payable under this subdivision that will be adequate to finance, in combination with the local contribution, $455,000,000 of general public infrastructure projects.\nIn order to qualify for general state infrastructure aid, the city must enter a written agreement with the commissioner that requires the city to make a qualifying local matching contribution to pay for $128,000,000 of the cost of public infrastructure projects approved by the corporation, including financing costs, using funds other than state aid received under this section. The required local matching contribution is reduced by any amounts the city pays out of funds other than state aid received under this section for the support, administration, or operations of the corporation and the economic development agency up to a maximum amount agreed to by the board and the city. These amounts include any costs the city incurs in providing services, goods, or other support to the corporation or agency. The agreement must provide for the manner, timing, and amounts of the city contributions, including the city's commitment for each year. Notwithstanding any law to the contrary, the agreement may provide that the city contributions for public infrastructure project principal costs may be made over a 20-year period at a rate not greater than $1 from the city for each $2.55 from the state. The local match contribution may be provided by the city from any source identified in section 469.45 and any other local tax proceeds or other funds from the city and may include providing funds to prepare the development plan, to assist developers undertaking projects in accordance with the development plan, or by the city directly undertaking public infrastructure projects in accordance with the development plan, provided the projects have been approved by the corporation. City contributions that are in excess of this ratio carry forward and are credited toward subsequent years. The commissioner and city may agree to amend the agreement at any time in light of new information or other appropriate factors. The city may enter into arrangements with the county to pay for or otherwise meet the local matching contribution requirement. Any public infrastructure project within the area that will be in the destination medical center development district whose implementation is started or funded by the city after June 22, 2013, but before the development plan is adopted, as provided by section 469.43, subdivision 1, will be included for the purposes of determining the amount the city has contributed as required by this section and the agreement with the commissioner, subject to approval by the corporation.\n(a) The city qualifies for state transit aid under this section if the county contributes the required local matching contribution under subdivision 6 or the city or county has agreed to make an equivalent contribution out of other funds for the year.\n(b) If the city qualifies for aid under paragraph (a), the commissioner must pay the city the state transit aid in the amount calculated under this paragraph. The amount of the state transit aid for a year equals the qualified expenditures for the year, as certified by the commissioner, multiplied by 0.75 percent, subject to the amount of the required local contribution under subdivision 6. City or county contributions that are in excess of this ratio carry forward and are credited toward subsequent years. The maximum amount of state transit aid payable in any year is limited to no more than $7,500,000. If the commissioner determines that the city or county has not made the full required matching local contribution for the year, the commissioner must pay state transit aid only for the matching contribution made and any unpaid amount is a carryover aid. The carryover aid must be paid in the first year after the required matching contribution is made and in which the aid entitlement for the current year is less than the maximum annual limit, but only to the extent the carryover, when added to the current year aid, is less than the maximum annual limit.\n(c) The commissioner, in consultation with the commissioner of management and budget, and representatives of the city and the corporation, must establish a total limit on the amount of state aid payable under this subdivision that will be adequate to finance, in combination with the local contribution, $116,000,000 of transit costs.\n(d) The city must use state transit aid it receives under this subdivision for transit costs. The city must maintain appropriate records to document the use of the funds under this requirement.\n(a) The required local matching contribution for state transit aid equals the lesser of:\n(1) 40 percent of the state transit aid subject to the $7,500,000 limit under subdivision 5; or\n(2) the amount that would be raised by a 0.15 percent sales tax imposed by the county in the preceding year.\nThe county may impose the sales tax or the wheelage tax under section 469.46 to meet this obligation.\n(b) If the county elects not to impose any of the taxes authorized under section 469.46, the county, or city, or both, may agree to make the local contribution out of other available funds, other than state aid payable under this section. The commissioner of revenue must estimate the required amount and certify it to the commissioner, city, and county.\nDuring the construction, installation, remodelling, and repairs of any public infrastructure project funded by state aid or a local matching contribution under this section, laborers and mechanics at the site must be paid the prevailing wage rate as defined in section 177.42, subdivision 6, and the project is subject to the requirements of sections 177.30 and 177.41 to 177.44.\nNo aid may be paid under this section after fiscal year 2049.\nAn amount sufficient to pay the state general infrastructure and state transit aid authorized under this section is appropriated to the commissioner from the general fund.",
	"repealed": false
}