{
	"id": "256B.038",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.038",
	"title": "256B.038 PROVIDER RATE INCREASES AFTER JUNE 30, 1999.",
	"text": "(a) For fiscal years beginning on or after July 1, 1999, the commissioner of management and budget shall include an annual inflationary adjustment in payment rates for the services listed in paragraph (b) as a budget change request in each biennial detailed expenditure budget submitted to the legislature under section 16A.11. The adjustment shall be accomplished by indexing the rates in effect for inflation based on the change in the Consumer Price Index-All Items (United States city average)(CPI-U) as forecasted by Data Resources, Inc., in the fourth quarter of the prior year for the calendar year during which the rate increase occurs.\n(b) Within the limits of appropriations specifically for this purpose, the commissioner shall apply the rate increases in paragraph (a) to home and community-based waiver services for persons with developmental disabilities under section 256B.501; home and community-based waiver services for the elderly under chapter 256S; waivered services under community access for disability inclusion under section 256B.49; community alternative care waivered services under section 256B.49; brain injury waivered services under section 256B.49; nursing services and home health services under section 256B.0625, subdivision 6a; personal care services and nursing supervision of personal care services under section 256B.0625, subdivision 19a; home care nursing services under section 256B.0625, subdivision 7; day training and habilitation services for adults with developmental disabilities under sections 252.41 to 252.46; physical therapy services under section 256B.0625, subdivision 8; occupational therapy services under section 256B.0625, subdivision 8a; speech-language therapy services under Minnesota Rules, part 9505.0390; respiratory therapy services under Minnesota Rules, part 9505.0295; physician services under section 256B.0625, subdivision 3; dental services under section 256B.0625, subdivision 9; alternative care services under section 256B.0913; adult residential program grants under section 245.73; adult and family community support grants under Minnesota Rules, parts 9535.1700 to 9535.1760; and semi-independent living services under section 252.275, including SILS funding under county social services grants formerly funded under chapter 256I.\n(c) The commissioner shall increase prepaid medical assistance program capitation rates as appropriate to reflect the rate increases in this section.\n(d) In implementing this section, the commissioner shall consider proposing a schedule to equalize rates paid by different programs for the same service.",
	"repealed": false
}