{
	"id": "171.0605",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.0605",
	"title": "171.0605 EVIDENCE OF IDENTITY AND LAWFUL PRESENCE.",
	"text": "This section applies only to driver's licenses and Minnesota identification cards that meet all requirements of the REAL ID Act. Except as otherwise provided under this section, the requirements of Minnesota Rules, chapter 7410, or successor rules, apply.\n(a) Only the following is satisfactory evidence of an applicant's identity and date of birth under section 171.06, subdivision 3, paragraph (b):\n(1) a driver's license or identification card that:\n(i) complies with all requirements of the REAL ID Act;\n(ii) is not designated as temporary or limited term; and\n(iii) is current or has been expired for five years or less;\n(2) a valid, unexpired United States passport, including a passport booklet or passport card, issued by the United States Department of State;\n(3) a certified copy of a birth certificate issued by a government bureau of vital statistics or equivalent agency in the applicant's state of birth, which must bear the raised or authorized seal of the issuing government entity;\n(4) a consular report of birth abroad, certification of report of birth, or certification of birth abroad, issued by the United States Department of State, Form FS-240, Form DS-1350, or Form FS-545;\n(5) a valid, unexpired permanent resident card issued by the United States Department of Homeland Security or the former Immigration and Naturalization Service of the United States Department of Justice, Form I-551. If the Form I-551 validity period has been automatically extended by the United States Department of Homeland Security, it is deemed unexpired, regardless of the expiration date listed;\n(6) a foreign passport with an unexpired temporary I-551 stamp or a temporary I-551 printed notation on a machine-readable immigrant visa with a United States Department of Homeland Security admission stamp within the validity period;\n(7) a United States Department of Homeland Security Form I-94 or Form I-94A with a photograph and an unexpired temporary I-551 stamp;\n(8) a United States Department of State Form DS-232 with a United States Department of Homeland Security admission stamp and validity period;\n(9) a certificate of naturalization issued by the United States Department of Homeland Security, Form N-550 or Form N-570;\n(10) a certificate of citizenship issued by the United States Department of Homeland Security, Form N-560 or Form N-561;\n(11) an unexpired employment authorization document issued by the United States Department of Homeland Security, Form I-766 or Form I-688B. If the Form I-766 validity period has been automatically extended by the United States Department of Homeland Security, it is deemed unexpired, regardless of the expiration date listed;\n(12) a valid, unexpired passport issued by a foreign country and a valid, unexpired United States visa accompanied by documentation of the applicant's most recent lawful admittance into the United States;\n(13) a document as designated by the United States Department of Homeland Security under Code of Federal Regulations, title 6, part 37.11 (c)(1)(x);\n(14) a copy of the applicant's certificate of marriage certified by the issuing government jurisdiction;\n(15) a certified copy of a court order that specifies the applicant's name change; or\n(16) a certified copy of a divorce decree or dissolution of marriage that specifies the applicant's name change, issued by a court.\n(b) A document under paragraph (a) must be legible and unaltered.\nOnly a form of documentation identified under subdivision 2, paragraph (a), clauses (2) to (10), or a document issued by a federal agency that demonstrates the applicant's lawful status are satisfactory evidence of an applicant's lawful status under section 171.06, subdivision 3, paragraph (b), clause (2).\nMS 2022 [Repealed, 2024 c 104 art 1 s 110]\n(a) Submission of two forms of documentation from the following is satisfactory evidence of an applicant's principal residence address in Minnesota under section 171.06, subdivision 3, paragraph (b):\n(1) a home utility services bill issued no more than 12 months before the application;\n(2) a home utility services hook-up work order issued no more than 12 months before the application;\n(3) United States bank or financial information issued no more than 12 months before the application, with account numbers redacted, including:\n(i) a bank account statement;\n(ii) a credit card or debit card statement;\n(iii) a brokerage account statement;\n(iv) a money market account statement;\n(v) a Health Savings Account statement; or\n(vi) a retirement account statement;\n(4) a certified transcript from a United States high school, if issued no more than 180 days before the application;\n(5) a certified transcript from a Minnesota college or university, if issued no more than 180 days before the application;\n(6) a student summary report from a United States high school signed by a school principal or designated authority and issued no more than 180 days before the application;\n(7) an employment pay stub issued no more than 12 months before the application that lists the employer's name and address;\n(8) a Minnesota unemployment insurance benefit statement issued no more than 12 months before the application;\n(9) a statement from an assisted living facility licensed under chapter 144G, nursing home licensed under chapter 144A, or a boarding care facility licensed under sections 144.50 to 144.56, that was issued no more than 12 months before the application;\n(10) a current policy or card for health, automobile, homeowner's, or renter's insurance;\n(11) a federal or state income tax return for the most recent tax filing year;\n(12) a Minnesota property tax statement for the current or prior calendar year or a proposed Minnesota property tax notice for the current year that shows the applicant's principal residential address both on the mailing portion and the portion stating what property is being taxed;\n(13) a Minnesota vehicle certificate of title;\n(14) a filed property deed or title for current residence;\n(15) a Supplemental Security Income award statement issued no more than 12 months before the application;\n(16) mortgage documents for the applicant's principal residence;\n(17) a residential lease agreement for the applicant's principal residence issued no more than 12 months before the application;\n(18) an affidavit of residence for an applicant whose principal residence is a group home, communal living arrangement, cooperative, or a religious order issued no more than 90 days before the application;\n(19) an assisted living or nursing home statement issued no more than 90 days before the application;\n(20) a valid driver's license, including an instruction permit, issued under this chapter;\n(21) a valid Minnesota identification card;\n(22) an unexpired Minnesota professional license;\n(23) an unexpired Selective Service card;\n(24) military orders that are still in effect at the time of application;\n(25) a cellular phone bill issued no more than 12 months before the application; or\n(26) a valid license issued pursuant to the game and fish laws.\n(b) In lieu of one of the two documents required by paragraph (a), an applicant under the age of 18 may use a parent or guardian's proof of principal residence as provided in this paragraph. The parent or guardian of the applicant must provide a document listed under paragraph (a) that includes the parent or guardian's name and the same address as the address on the document provided by the applicant. The parent or guardian must also certify that the applicant is the child of the parent or guardian and lives at that address.\n(c) A document under paragraph (a) must include the applicant's name and principal residence address in Minnesota.\n(d) For purposes of this subdivision, Internet service and cable service are utilities.\n(a) The commissioner may grant a variance from the requirements of this section as provided under Minnesota Rules, part 7410.0600, or successor rules, for evidence of:\n(1) identity or date of birth under subdivision 2;\n(2) lawful status under subdivision 3, only for demonstration of United States citizenship; and\n(3) residence in Minnesota under subdivision 5.\n(b) The commissioner must not grant a variance for an applicant having a lawful temporary admission period.",
	"repealed": false
}