{
	"id": "62V.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/62V.06",
	"title": "62V.06 DATA PRACTICES.",
	"text": "MNsure is a state agency for purposes of the Minnesota Government Data Practices Act and is subject to all provisions of chapter 13, in addition to the requirements contained in this section.\nAs used in this section:\n(1) \"individual\" means an individual according to section 13.02, subdivision 8, but does not include a vendor of services; and\n(2) \"participating\" means that an individual, employee, or employer is seeking, or has sought an eligibility determination, enrollment processing, or premium processing through MNsure.\nThe following data collected, created, or maintained by MNsure are classified as private data on individuals, as defined in section 13.02, subdivision 12, or nonpublic data, as defined in section 13.02, subdivision 9:\n(1) data on any individual participating in MNsure;\n(2) data on any individuals participating in MNsure as employees of an employer participating in MNsure; and\n(3) data on employers participating in MNsure.\n(a) Data submitted by an insurance producer in an application for certification to sell a health plan through MNsure, or submitted by an applicant seeking permission or a commission to act as a navigator or in-person assister, are classified as follows:\n(1) at the time the application is submitted, all data contained in the application are private data, as defined in section 13.02, subdivision 12, or nonpublic data as defined in section 13.02, subdivision 9, except that the name of the applicant is public; and\n(2) upon a final determination related to the application for certification by MNsure, all data contained in the application are public, with the exception of trade secret data as defined in section 13.37.\n(b) Data created or maintained by a government entity as part of the evaluation of an application are protected nonpublic data, as defined in section 13.02, subdivision 13, until a final determination as to certification is made and all rights of appeal have been exhausted. Upon a final determination and exhaustion of all rights of appeal, these data are public, with the exception of trade secret data as defined in section 13.37 and data subject to attorney-client privilege or other protection as provided in section 13.393.\n(c) If an application is denied, the public data must include the criteria used by the board to evaluate the application and the specific reasons for the denial, and these data must be published on the MNsure website.\n(a) MNsure may share or disseminate data classified as private or nonpublic in subdivision 3 as follows:\n(1) to the subject of the data, as provided in section 13.04;\n(2) according to a court order;\n(3) according to a state or federal law specifically authorizing access to the data;\n(4) with other state or federal agencies, only to the extent necessary to verify the identity of, determine the eligibility of, process premiums for, process enrollment of, or investigate fraud related to an individual, employer, or employee participating in MNsure, provided that MNsure must enter into a data-sharing agreement with the agency prior to sharing data under this clause; and\n(5) with a nongovernmental person or entity, only to the extent necessary to verify the identity of, determine the eligibility of, process premiums for, process enrollment of, or investigate fraud related to an individual, employer, or employee participating in MNsure, provided that MNsure must enter into a contract with the person or entity, as provided in section 13.05, subdivision 6 or 11, prior to disseminating data under this clause.\n(b) MNsure may share or disseminate data classified as private or nonpublic in subdivision 4 as follows:\n(1) to the subject of the data, as provided in section 13.04;\n(2) according to a court order;\n(3) according to a state or federal law specifically authorizing access to the data;\n(4) with other state or federal agencies, only to the extent necessary to carry out the functions of MNsure, provided that MNsure must enter into a data-sharing agreement with the agency prior to sharing data under this clause; and\n(5) with a nongovernmental person or entity, only to the extent necessary to carry out the functions of MNsure, provided that MNsure must enter a contract with the person or entity, as provided in section 13.05, subdivision 6 or 11, prior to disseminating data under this clause.\n(c) Sharing or disseminating data outside of MNsure in a manner not authorized by this subdivision is prohibited. The list of authorized dissemination and sharing contained in this subdivision must be included in the Tennessen warning required by section 13.04, subdivision 2.\n(d) Until July 1, 2014, state agencies must share data classified as private or nonpublic on individuals, employees, or employers participating in MNsure with MNsure, only to the extent such data are necessary to verify the identity of, determine the eligibility of, process premiums for, process enrollment of, or investigate fraud related to a MNsure participant. The agency must enter into a data-sharing agreement with MNsure prior to sharing any data under this paragraph.\n(a) In addition to the Tennessen warning required by section 13.04, subdivision 2, MNsure must provide any data subject asked to supply private data with:\n(1) a notice of rights related to the handling of genetic information, pursuant to section 13.386; and\n(2) a notice of the records retention policy of MNsure, detailing the length of time MNsure will retain data on the individual and the manner in which it will be destroyed upon expiration of that time.\n(b) All notices required by this subdivision, including the Tennessen warning, must be provided in an electronic format suitable for downloading or printing.\nIn addition to creation and disclosure of summary data derived from private data on individuals, as permitted by section 13.05, subdivision 7, MNsure may create and disclose summary data derived from data classified as nonpublic under this section.\n(a) Only individuals with explicit authorization from the board may enter, update, or access not public data collected, created, or maintained by MNsure. The ability of authorized individuals to enter, update, or access data must be limited through the use of role-based access that corresponds to the official duties or training level of the individual, and the statutory authorization that grants access for that purpose. All queries and responses, and all actions in which data are entered, updated, accessed, or shared or disseminated outside of MNsure, must be recorded in a data audit trail. Data contained in the audit trail are public, to the extent that the data are not otherwise classified by this section.\nThe board shall immediately and permanently revoke the authorization of any individual determined to have willfully entered, updated, accessed, shared, or disseminated data in violation of this section, or any provision of chapter 13. If an individual is determined to have willfully gained access to data without explicit authorization from the board, the board shall forward the matter to the county attorney for prosecution.\n(b) This subdivision shall not limit or affect the authority of the legislative auditor to access data needed to conduct audits, evaluations, or investigations of MNsure or the obligation of the board and MNsure employees to comply with section 3.978, subdivision 2.\n(c) This subdivision does not apply to actions taken by a MNsure participant to enter, update, or access data held by MNsure, if the participant is the subject of the data that is entered, updated, or accessed.\nMNsure may not sell any data collected, created, or maintained by MNsure, regardless of its classification, for commercial or any other purposes.\nMNsure shall not collect information that indicates whether or not an individual owns a gun or has a firearm in the individual's home.",
	"repealed": false
}