{
	"id": "144A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.61",
	"title": "144A.61 NURSING ASSISTANT TRAINING.",
	"text": "The commissioner of health, in consultation with the commissioner of human services, shall implement the provisions of Public Law 100-203, the Omnibus Budget Reconciliation Act of 1987, that relate to training and competency evaluation programs, testing, and the establishment of a registry for nursing assistants in nursing homes and boarding care homes certified for participation in the medical assistance or Medicare programs. The commissioner of health may adopt permanent rules that may be necessary to implement Public Law 100-203 and provisions of this section. The commissioner of health may contract with outside parties for the purpose of implementing the provisions of this section. At the request of the commissioner, the Board of Nursing may establish training and competency evaluation standards; review, evaluate, and approve curricula; review and approve training programs; and establish a registry of nursing assistants.\nFor the purposes of this section and section 144A.611 \"nursing assistant\" means a nursing home or certified boarding care home employee, including a nurse's aide or an orderly, who is assigned by the director of nursing to provide or assist in the provision of nursing or nursing-related services under the supervision of a registered nurse. \"Nursing assistant\" includes nursing assistants employed by nursing pool companies but does not include a licensed health professional.\nThe chancellor of vocational technical education shall develop curricula to be used for nursing assistant training programs for employees of nursing homes and boarding care homes.\n(a) The commissioner of health shall approve the competency evaluation program.\n(b) A competency evaluation must be administered to persons who desire to be listed in the nursing assistant registry. The tests may only be administered by technical colleges, community colleges, or other organizations approved by the commissioner of health. The commissioner must ensure any written portions of the competency evaluation are available in languages other than English that are commonly spoken by persons who desire to be listed in the nursing assistant registry. The commissioner may consult with the state demographer or the commissioner of employment and economic development when identifying languages that are commonly spoken by persons who desire to be listed in the nursing assistant registry.\n(c) The commissioner of health shall approve a nursing assistant for the registry without requiring a competency evaluation if the nursing assistant is in good standing on a nursing assistant registry in another state.\nThe chancellor of vocational technical education shall, upon request, provide necessary and appropriate technical assistance in the development of nursing assistant training programs.\n[Repealed, 1977 c 326 s 18]\n[Repealed, 1989 c 282 art 3 s 98]\nEach nursing assistant hired to work in a nursing home or in a certified boarding care home on or after January 1, 1990, must have successfully completed an approved competency evaluation prior to employment or an approved nursing assistant training program and competency evaluation within four months from the date of employment.\nViolation of this section by a nursing home or certified boarding care home shall be grounds for the issuance of a correction order. Under the provisions of sections 144.653 or 144A.10, the failure of the nursing home or certified boarding care home to comply with the correction order shall result in the assessment of a fine in the amount of $300.\nEmployees of nursing homes conducted in accordance with the teachings of the body known as the Church of Christ, Scientist, shall be exempt from the requirements of this section and section 144A.611.\nThe commissioner of health must accept electronic transmission of applications and supporting documentation for interstate endorsement for the nursing assistant registry.",
	"repealed": false
}