{
	"id": "256B.4911",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.4911",
	"title": "256B.4911 CONSUMER-DIRECTED COMMUNITY SUPPORTS.",
	"text": "Consumer-directed community supports, as referenced in sections 256B.0913, subdivision 5, paragraph (a), clause (17); 256B.092, subdivision 1b, clause (4); 256B.49, subdivision 16, paragraph (c); and chapter 256S are governed, in whole, by the federally-approved waiver plans for home and community-based services.\nThe expenses allowed for adults under the consumer-directed community supports option must include the costs at the lowest rate available considering daily, monthly, semiannual, annual, or membership rates, including transportation, associated with physical exercise or other physical activities to maintain or improve the person's health and functioning.\n(a) The commissioner of human services must provide up to 30 percent more funds for either:\n(1) consumer-directed community supports participants under sections 256B.092 and 256B.49 who have a support plan which identifies the need for more services or supports under consumer-directed community supports than the amount the participants are currently receiving under the consumer-directed community supports budget methodology to:\n(i) increase the amount of time a person works or otherwise improves employment opportunities;\n(ii) plan a transition to, move to, or live in a setting described in section 256D.44, subdivision 5, paragraph (g), clause (1), item (iii); or\n(iii) develop and implement a positive behavior support plan; or\n(2) home and community-based waiver participants under sections 256B.092 and 256B.49 who are currently using licensed providers for: (i) employment supports or services during the day; or (ii) residential services, either of which cost more annually than the person would spend under a consumer-directed community supports plan for any or all of the supports needed to meet a goal identified in clause (1), item (i), (ii), or (iii).\n(b) The exception under paragraph (a), clause (1), is limited to persons who can demonstrate that they will have to discontinue using consumer-directed community supports and accept other non-self-directed waiver services because their supports needed for a goal described in paragraph (a), clause (1), item (i), (ii), or (iii), cannot be met within the consumer-directed community supports budget limits.\n(c) The exception under paragraph (a), clause (2), is limited to persons who can demonstrate that, upon choosing to become a consumer-directed community supports participant, the total cost of services, including the exception, will be less than the cost of current waiver services.\n(a) The commissioner must establish an institutional and crisis bed consumer-directed community supports budget exception process in the home and community-based services waivers under sections 256B.092 and 256B.49. This budget exception process must be available for any individual who:\n(1) is not offered available and appropriate services within 60 days since approval for discharge from the individual's current institutional setting; and\n(2) requires services that are more expensive than appropriate services provided in a noninstitutional setting using the consumer-directed community supports option.\n(b) Institutional settings for purposes of this exception include intermediate care facilities for persons with developmental disabilities, nursing facilities, acute care hospitals, Anoka Metro Regional Treatment Center, Minnesota Security Hospital, and crisis beds.\n(c) The budget exception must be limited to no more than the amount of appropriate services provided in a noninstitutional setting as determined by the lead agency managing the individual's home and community-based services waiver. The lead agency must notify the Department of Human Services of the budget exception.\n(a) Medical assistance payments for shared services under consumer-directed community supports are limited to this subdivision.\n(b) For purposes of this subdivision, \"shared services\" means services provided at the same time by the same direct care worker for individuals who have entered into an agreement to share consumer-directed community support services.\n(c) Shared services may include services in the personal assistance category as outlined in the consumer-directed community supports assessment summary and shared services agreement, except:\n(1) services for more than three individuals provided by one worker at one time;\n(2) use of more than one worker for the shared services; and\n(3) a child care program licensed under chapter 142B or operated by a local school district or private school.\n(d) The individuals, or as needed the individuals' representatives, must develop the plan for shared services when developing or amending the consumer-directed community supports plan, and must follow the consumer-directed community supports process for approval of the plan by the lead agency. The plan for shared services in an individual's consumer-directed community supports plan must include the intention to utilize shared services based on individuals' needs and preferences.\n(e) Individuals sharing services must use the same financial management services provider.\n(f) Individuals whose consumer-directed community supports assessment summaries include an intent to utilize shared services must jointly develop, with the support of the individuals' representatives as needed, a shared services agreement. This agreement must include:\n(1) the names of the individuals receiving shared services;\n(2) the individuals' representative, if identified in their consumer-directed community supports plans, and their duties;\n(3) the names of the case managers;\n(4) the financial management services provider;\n(5) the shared services that must be provided;\n(6) the schedule for shared services;\n(7) the location where shared services must be provided;\n(8) the training specific to each individual served;\n(9) the training specific to providing shared services to the individuals identified in the agreement;\n(10) instructions to follow all required documentation for time and services provided;\n(11) a contingency plan for each individual that accounts for service provision and billing in the absence of one of the individuals in a shared services setting due to illness or other circumstances;\n(12) signatures of all parties involved in the shared services; and\n(13) agreement by each individual who is sharing services on the number of shared hours for services provided.\n(g) Any individual or any individual's representative may withdraw from participating in a shared services agreement at any time.\n(h) The lead agency for each individual must authorize the use of the shared services option based on the criteria that the shared service is appropriate to meet the needs, health, and safety of each individual for whom they provide case management or care coordination.\n(i) This subdivision must not be construed to reduce the total authorized consumer-directed community supports budget for an individual.\n(j) No later than September 30, 2019, the commissioner of human services must:\n(1) submit an amendment to the Centers for Medicare and Medicaid Services for the home and community-based services waivers authorized under sections 256B.0913, 256B.092, and 256B.49, and chapter 256S, to allow for a shared services option under consumer-directed community supports; and\n(2) with stakeholder input, develop guidance for shared services in consumer-directed community supports within the community-based services manual. Guidance must include:\n(i) recommendations for negotiating payment for one-to-two and one-to-three services; and\n(ii) a template of the shared services agreement.\n(a) This subdivision limits medical assistance payments under the consumer-directed community supports option for personal assistance services provided by a parent to the parent's minor child or by a participant's spouse. This subdivision applies to the consumer-directed community supports option available under all of the following:\n(1) alternative care program;\n(2) brain injury waiver;\n(3) community alternative care waiver;\n(4) community access for disability inclusion waiver;\n(5) developmental disabilities waiver; and\n(6) elderly waiver.\n(b) For the purposes of this subdivision, \"parent\" means a parent, stepparent, or legal guardian of a minor.\n(c) If multiple parents are providing personal assistance services to their minor child or children, each parent may provide up to 40 hours of personal assistance services in any seven-day period regardless of the number of children served. The total number of hours of medical assistance home and community-based services provided by all of the parents must not exceed 80 hours in a seven-day period regardless of the number of children served.\n(d) If only one parent is providing personal assistance services to a minor child or children, the parent may provide up to 60 hours of medical assistance home and community-based services in a seven-day period regardless of the number of children served.\n(e) If a participant's spouse is providing personal assistance services, the spouse may provide up to 60 hours of medical assistance home and community-based services in a seven-day period.\n(f) This subdivision must not be construed to permit an increase in the total authorized consumer-directed community supports budget for an individual.\n[See Note.]\nWhen a lead agency authorizes or reauthorizes consumer-directed community supports services for a home and community-based services waiver participant, the lead agency must provide to the waiver participant and the waiver participant's legal representative the following information in an accessible format and in a manner that meets the participant's needs:\n(1) an explanation of how the participant's consumer-directed community supports services budget was calculated, including a detailed explanation of the variables used in the budget formula;\n(2) a copy of the formula used to calculate the participant's consumer-directed community supports services budget; and\n(3) information about the participant's right to appeal the consumer-directed community supports services budget in accordance with sections 256.045 and 256.0451.\nPolicies governing the consumer-directed community supports program must be created solely by the commissioner. Lead agencies must not create or implement any policies that are in addition to or inconsistent with policies created by the commissioner or federal or state laws. Any handbooks, procedures, or other guidance documents maintained by a lead agency do not have the force or effect of law, and must not be given deference if introduced in a state fair hearing conducted under sections 256.045 and 256.0451.",
	"repealed": false
}