{
	"id": "308A.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.801",
	"title": "308A.801 MERGER AND CONSOLIDATION.",
	"text": "Unless otherwise prohibited, cooperatives or associations organized under the laws of this state may merge or consolidate with each other or with associations incorporated under the laws of another state by complying with the provisions of this section or the law of the state where the surviving or new association will exist.\nTo initiate a merger or consolidation, a written plan of merger or consolidation must be prepared by the board or by a committee selected by the board or the members to prepare a plan. The plan must state:\n(1) the names of the constituent cooperatives or associations;\n(2) the name of the surviving or new cooperative or association;\n(3) the manner and basis of converting stock or membership of the constituent cooperatives or associations into stock or membership in the surviving or new cooperative or association;\n(4) the terms of the merger or consolidation;\n(5) the proposed effect of the consolidation or merger on the members of the cooperative; and\n(6) for a consolidation, the plan must contain the articles of the new association.\n(a) The board must mail a merger or consolidation notice to each member. The notice must contain:\n(1) the full text of the plan; and\n(2) the time and place of the meeting at which the plan will be considered.\n(b) A cooperative or association with more than 200 members may publish the merger or consolidation notice in the same manner as a regular members' meeting notice.\n(a) A plan of merger or consolidation is adopted if:\n(1) a quorum of the members is registered as being present or represented by mail vote at the meeting; and\n(2) the plan is approved by two-thirds of the votes cast, or for a cooperative with articles or bylaws requiring more than two-thirds of the votes cast or other conditions for approval, the plan is approved by a proportion of the votes cast or a number of total members as required by the articles or bylaws and the conditions for approval in the articles or bylaws have been satisfied.\n(b) After the plan has been adopted, articles of merger or consolidation stating the plan and that the plan was adopted according to this chapter shall be signed by the chair, vice-chair, president, vice-president, secretary, or assistant secretary of each cooperative or association merging or consolidating.\n(c) The articles of merger or consolidation shall be filed in the Office of the Secretary of State.\n(d) For a merger, the articles of the surviving cooperative or association are deemed amended to the extent provided in the articles of merger.\n(e) Unless a later date is provided in the plan, the merger or consolidation is effective when the articles of merger or consolidation are filed in the Office of the Secretary of State.\n(f) The secretary of state shall issue a certificate of the merged or consolidated cooperative or association.\n(a) After the effective date, the cooperatives and associations that are parties to the plan become a single association. For a merger, the surviving association is the association designated in the plan. For a consolidation, the new cooperative is the association provided for in the plan. Except for the surviving or new association, the separate existence of all cooperatives and associations that are parties to the plan cease on the effective date of the merger or consolidation.\n(b) The surviving or new association possesses all of the rights and property of each of the merged or consolidated cooperatives or associations, and is responsible for all their obligations. The title to property of the merged or consolidated association is vested in the surviving or new association without reversion or impairment of the title caused by the merger or consolidation.\n(c) The right of a creditor may not be impaired by the merger or consolidation without the creditor's consent.\nThe fee to be paid to the secretary of state for filing articles of merger or consolidation is $60.",
	"repealed": false
}