{
	"id": "115A.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.58",
	"title": "115A.58 STATE WASTE MANAGEMENT BONDS.",
	"text": "The commissioner of management and budget shall sell bonds of the state of Minnesota for the prompt and full payment of which, together with interest, the full faith, credit, and taxing powers of the state are irrevocably pledged. Bonds shall be sold only upon request of the commissioner of the Pollution Control Agency and in the amount as may otherwise be authorized by this or a subsequently enacted law which authorizes the sale of additional bonds and the deposit of the proceeds in a waste management account in the bond proceeds fund. Any authorized amount of bonds in this law or any subsequently enacted law authorizing the issuance of bonds for the purposes of the waste management account, together with this section, constitute complete authority for the issue. The bonds shall not be subject to restrictions or limitations contained in any other law.\nUpon request by the commissioner of the Pollution Control Agency and upon authorization as provided in subdivision 1, the commissioner of management and budget shall sell Minnesota state waste management bonds. The bonds shall be in the aggregate amount requested, and sold upon sealed bids upon the notice, at the price in the form and denominations, bearing interest at the rate or rates, maturing in the amounts and on the dates (with or without option of prepayment upon notice and at specified times and prices), payable at a bank or banks within or outside the state (with provisions, if any, for registration, conversion, and exchange and for the issuance of temporary bonds or notes in anticipation of the sale or delivery of definitive bonds), and in accordance with further provisions as the commissioner of management and budget shall determine, subject to the approval of the attorney general, but not subject to chapter 14, including section 14.386. The bonds shall be executed by the commissioner of management and budget under official seal. The signature on the bonds and any interest coupons and the seal may be printed, lithographed, engraved, stamped, or otherwise reproduced thereon, except that each bond shall be authenticated by the manual signature on its face of the commissioner of management and budget or of an authorized representative of a bank designated by the commissioner of management and budget as registrar or other authenticating agent. The commissioner of management and budget shall ascertain and certify to the purchasers of the bonds the performance and existence of all acts, conditions, and things necessary to make them valid and binding general obligations of the state of Minnesota, subject to the approval of the attorney general.\nAll expenses incidental to the sale, printing, execution, and delivery of bonds pursuant to this section, including but not limited to actual and necessary travel and subsistence expenses of state officers and employees for these purposes, and any expenses of litigation relating to the validity of the bonds, shall be paid from the waste management account, and the amounts necessary are appropriated from that account.\nThe commissioner of management and budget shall maintain in the state bond fund a separate account to be called the state waste management debt service account. It shall record receipts of premium and accrued interest, loan repayments, project revenue or other money transferred to the fund and income from the investment of the money and record any disbursements to pay the principal and interest on waste management bonds. Income from investment shall be credited to the account in each fiscal year. The amount credited shall be equal to the average return that year on all funds invested by the commissioner of management and budget, as determined by the commissioner of management and budget, times the average balance in the account that year.\nThe premium and accrued interest received on each issue of Minnesota state waste management bonds, and all payments received in repayment of loans and other revenues received, are appropriated to the debt service account. All income from the investment of the waste management account in the bond proceeds fund is appropriated to the debt service account. In order to reduce the amount of taxes otherwise required to be levied, there is also appropriated to the debt service account from any funds available in the general fund on November 1 in each year, a sum of money sufficient in amount, when added to the balance then on hand, to pay all principal and interest on Minnesota waste management bonds due and to become due before July 1 in the second ensuing year. So much of the debt service account as is necessary to pay principal and interest on waste management bonds is annually appropriated from the debt service account for the payment of principal and interest of the waste management bonds. All funds appropriated by this subdivision shall be available in the debt service account prior to any levy of the tax in any year required by the Minnesota Constitution, article XI, section 7.\nOn or before December 1 in each year, the state auditor shall levy on all taxable property within the state whatever tax may be necessary to produce an amount sufficient, with all money currently credited to the debt service account, to pay the entire amount of principal and interest currently due and the principal and interest to become due before July 1 in the second year thereafter on Minnesota waste management bonds. This tax shall be subject to no limitation of rate or amount until all the bonds and interest thereon are fully paid. The proceeds of this tax are appropriated to the debt service account. The principal of and interest on the bonds are payable from the proceeds of this tax.",
	"repealed": false
}