{
	"id": "116U.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/116U.26",
	"title": "116U.26 FILM PRODUCTION JOBS PROGRAM.",
	"text": "(a) The film production jobs program is created. The program shall be operated by Explore Minnesota Film with administrative oversight and control by the director of Explore Minnesota. The program shall make payment to producers of feature films, national television or Internet programs, documentaries, music videos, and commercials that directly create new film jobs in Minnesota. To be eligible for a payment, a producer must submit documentation to Explore Minnesota Film of expenditures for production costs incurred in Minnesota that are directly attributable to the production in Minnesota of a film product.\nExplore Minnesota Film shall make recommendations to the director of Explore Minnesota about program payment, but the director has the authority to make the final determination on payments. The director's determination must be based on proper documentation of eligible production costs submitted for payments. No more than five percent of the funds appropriated for the program in any year may be expended for administration, including costs for independent audits and financial reviews of projects.\n(b) For the purposes of this section:\n(1) \"production costs\" means the cost of the following:\n(i) a story and scenario to be used for a film;\n(ii) salaries of talent, management, and labor, including payments to personal services corporations for the services of a performing artist;\n(iii) set construction and operations, wardrobe, accessories, and related services;\n(iv) photography, sound synchronization, lighting, and related services;\n(v) editing and related services;\n(vi) rental of facilities and equipment;\n(vii) other direct costs of producing the film in accordance with generally accepted entertainment industry practice;\n(viii) above-the-line talent fees for nonresident talent; or\n(ix) costs incurred during postproduction; and\n(2) \"film\" means a feature film, television or Internet pilot, program, series, documentary, music video, or television commercial, whether on film, video, or digital media. Film does not include news, current events, public programming, or a program that includes weather or market reports; a talk show; a production with respect to a questionnaire or contest; a sports event or sports activity; a gala presentation or awards show; a finished production that solicits funds; or a production for which the production company is required under United States Code, title 18, section 2257, to maintain records with respect to a performer portrayed in a single-media or multimedia program.\n(c) Notwithstanding any other law to the contrary, Explore Minnesota Film may make reimbursements of: (1) up to 25 percent of production costs for films that locate production outside the metropolitan area, as defined in section 473.121, subdivision 2, or that incur a minimum Minnesota expenditure of $1,000,000 in the metropolitan area within a 12-month period; or (2) up to 20 percent of production costs for films that incur less than $1,000,000 in Minnesota production costs in the metropolitan area within a 12-month period.",
	"repealed": false
}