{
	"id": "325E.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.14",
	"title": "325E.14 PROHIBITED ACTS.",
	"text": "No person shall knowingly tamper with, adjust, alter, change, set back, disconnect or, with intent to defraud, fail to connect the odometer of any motor vehicle or off-road recreational vehicle, or cause any of the foregoing to occur to an odometer of a motor vehicle or off-road recreational vehicle, so as to reflect a lower mileage than has actually been driven by the motor vehicle or off-road recreational vehicle.\nNo person shall with intent to defraud, operate a motor vehicle on any street or highway knowing that the odometer of the motor vehicle is disconnected or nonfunctional.\nNo person shall advertise for sale, sell, use or install on any part of a motor vehicle or off-road recreational vehicle, or on any odometer in a motor vehicle or off-road recreational vehicle, any device that causes the odometer to register any mileage other than the true mileage.\nNo person shall sell or offer for sale any motor vehicle or off-road recreational vehicle with knowledge that the mileage registered on the odometer has been altered so as to reflect a lower mileage than has actually been driven by the motor vehicle or off-road recreational vehicle without disclosing the fact to prospective purchasers.\nNo person shall conspire with any other person to violate this section or section 325E.15.\nNothing in this section shall prevent the service, repair, or replacement of an odometer, provided the mileage indicated thereon remains the same as before the service, repair, or replacement. Where the odometer is incapable of registering the same mileage as before the service, repair, or replacement, the odometer shall be adjusted to read zero and a written notice shall be attached to the left door frame of the motor vehicle by the owner or an agent specifying the mileage prior to repair or replacement of the odometer and the date on which it was repaired or replaced. No person shall remove or alter a notice so affixed.",
	"repealed": false
}