{
	"id": "383A.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.321",
	"title": "383A.321 DEFINITIONS.",
	"text": "For purposes of this section, the following terms have the meanings given them, unless the language or context clearly indicates that a different meaning is intended.\n\"Small business\" means a business entity organized for profit, including an individual, partnership, corporation, joint venture, association or cooperative which has its principal place of business in Minnesota, and which\n(a) is not dominant in its field of operation, and\n(b) is not an affiliate or subsidiary of a business dominant in its field of operations.\nIf a federal or state program prohibits any geographical limitation on the principal place of business of an eligible business in order for the county to be eligible for funds, the federal or state requirement shall prevail.\n\"Dominant in its field of operation\" means exercising a controlling or major influence in a business activity in which a number of businesses are engaged. In determining whether a business is dominant, the following criteria, among others, shall be considered: number of employees; volume of business; financial resources; competitive status or position; ownership or control of materials, processes, patents, license agreements and facilities; sales territory; and nature of business activity. The following businesses shall be deemed dominant in their field of operation:\n(a) manufacturing businesses which employ more than 100 persons and have in the preceding three fiscal years exceeded a total of $15,000,000 in gross receipts for the three-year period;\n(b) general construction businesses which in the preceding three fiscal years have exceeded a total of $6,000,000 in gross receipts for the three-year period;\n(c) specialty construction businesses which in the preceding three fiscal years have exceeded a total of $3,000,000 in gross receipts for the three-year period; and\n(d) nonmanufacturing businesses which employ more than 25 persons and have in the preceding three fiscal years exceeded a total of $3,000,000 in gross receipts for the three-year period.\n\"Affiliate or subsidiary of a business dominant in its field of operation\" means a business which is at least 20 percent owned by a business dominant in that field of operation, or by partners, officers, directors, majority stockholders, or their equivalent, of a business dominant in that field of operation.",
	"repealed": false
}