{
	"id": "383B.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.27",
	"title": "383B.27 DEFINITIONS FOR HUMAN RESOURCES BOARD AND DEPARTMENT.",
	"text": "For the purposes of sections 383B.26 to 383B.42 and rules promulgated under them, unless the context clearly indicates that a different meaning is intended, the terms defined in this section have the meanings given them.\n\"Board\" means the county Human Resources Board.\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\n\"Appointing authority\" means an elected official, county administrator, or the director and management staff of a department who have the power by law, by resolution of the county board or by lawfully delegated authority to make appointments to positions in the county service within the scope of sections 383B.26 to 383B.42.\n\"Classified service\" means the service which includes all positions except those in the unclassified service under sections 383B.26 to 383B.42.\n\"Position\" means a group of current duties and responsibilities assigned or delegated by an appointing authority.\n\"Class\" means one or more positions similar with respect to duties and responsibilities for which the same descriptive title can be used with clarity to designate each position; that similar general qualifications are needed for the performance of the duties; and that the same schedule of compensation shall be applied to all positions.\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\nMS 1998 [Repealed by amendment, 2000 c 416 s 2]\n\"Permanent employee\" means an employee in the classified service who has satisfactorily completed a probationary period.\n\"Probationary period\" means that part of the hiring process following certification and appointment from a list of certified candidates, to enable the appointing authority to determine whether employees are fit and suitable for the position to which they have been appointed, transferred, or promoted. The appointing authority may discharge a newly appointed employee during the probationary period without specifying cause or granting a hearing, except as provided by section 197.46. The appointing authority may, during the probationary period, demote an employee appointed to a position as a result of a promotion without specifying cause or granting a hearing, except as provided by section 197.46. The employee so demoted shall be returned to a position in the class previously held by the affected employee. The appointing authority may, during the probationary period, return a transferred employee back to a position in the classification and organizational unit the employee previously held without specifying cause or granting a hearing, except as provided by section 197.46. When an employee has been transferred from one department to another and upon the request of the new appointing authority the employee may be required to serve a probationary period.\n\"Classification plan\" means a list of the classes of positions in the county service by their official title.\n\"Unclassified service\" means those positions which are exempted from the jurisdiction of the Human Resources Board unless otherwise provided by sections 383B.26 to 383B.42.\n\"Transfer\" means a change by an employee from a position in the same class to a different department or organizational unit; or a change from a position in one class to a position in another class of comparable level in the same department or organizational unit or another department or organizational unit.\n\"Reassignment\" means a change by an employee from one position to another position in the same class in the same organizational unit.",
	"repealed": false
}