{
	"id": "394.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.36",
	"title": "394.36 NONCONFORMITIES.",
	"text": "Except as provided in subdivision 2, 3, or 4, any nonconformity, including the lawful use or occupation of land or premises existing at the time of the adoption of an official control under this chapter, may be continued, although the use or occupation does not conform to the official control. If the nonconformity or occupancy is discontinued for a period of more than one year, or any nonconforming building or structure is destroyed by fire or other peril to the extent of 50 percent of its estimated market value, any subsequent use or occupancy of the land or premises shall be a conforming use or occupancy.\nNotwithstanding subdivision 1, Minnesota Rules, parts 6105.0351 to 6105.0550, may allow for the continuation and improvement of substandard structures, as defined in Minnesota Rules, part 6105.0354, subpart 30, in the Lower Saint Croix National Scenic Riverway.\nNotwithstanding subdivision 1, a county shall regulate the repair, replacement, maintenance, improvement, or expansion of nonconforming uses and structures in floodplain areas to the extent necessary to maintain eligibility in the national flood insurance program and not increase flood damage potential or increase the degree of obstruction to flood flows in the floodway.\nThe board may by ordinance adopt such regulations not contrary to law as it deems desirable or necessary to classify, regulate and control, reduce the number or extent of and provide for the gradual elimination of nonconformities and occupancies, including requiring nonconformities to conform with the official controls of the county or terminate within a reasonable time as specified in the official controls. The board may by ordinance impose upon nonconformities additional regulations relating to appearance, signs, lighting, hours of operation and other aesthetic performance characteristics including but not limited to noise, heat, glare, vibrations, and smoke.\nA nonconformity that is determined by the board to be detrimental to the achievement of the goals and objectives of the comprehensive plan may be acquired by the board by purchase.\nThis subdivision applies to homestead and nonhomestead residential real estate and seasonal residential real estate occupied for recreational purposes. Except as otherwise provided by law, a nonconformity, including the lawful use or occupation of land or premises existing at the time of the adoption of an official control under this chapter, may be continued, including through repair, replacement, restoration, maintenance, or improvement, but not including expansion. If the nonconformity or occupancy is discontinued for a period of more than one year, or any nonconforming building or structure is destroyed by fire or other peril to the extent of greater than 50 percent of its estimated market value, as indicated in the records of the county assessor at the time of damage, and no building permit has been applied for within 180 days of when the property is damaged, any subsequent use or occupancy of the land or premises must be a conforming use or occupancy. If a nonconforming building or structure is destroyed by fire or other peril to the extent of greater than 50 percent of its estimated market value, as indicated in the records of the county assessor at the time of damage, the board may impose reasonable conditions upon a zoning or building permit in order to mitigate any newly created impact on adjacent property or water body. When a nonconforming structure in the shoreland district with less than 50 percent of the required setback from the water is destroyed by fire or other peril to greater than 50 percent of its estimated market value, as indicated in the records of the county assessor at the time of damage, the structure setback may be increased if practicable and reasonable conditions are placed upon a zoning or building permit to mitigate created impacts on the adjacent property or water body.\n(a) This subdivision applies to shoreland lots of record in the office of the county recorder on the date of adoption of local shoreland controls that do not meet the requirements for lot size or lot width. A county shall regulate the use of nonconforming lots of record and the repair, replacement, maintenance, improvement, or expansion of nonconforming uses and structures in shoreland areas according to this subdivision.\n(b) A nonconforming single lot of record located within a shoreland area may be allowed as a building site without variances from lot size requirements, provided that:\n(1) all structure and septic system setback distance requirements can be met;\n(2) a Type 1 sewage treatment system consistent with Minnesota Rules, chapter 7080, can be installed or the lot is connected to a public sewer; and\n(3) the impervious surface coverage does not exceed 25 percent of the lot.\n(c) In a group of two or more contiguous lots of record under a common ownership, an individual lot must be considered as a separate parcel of land for the purpose of sale or development, if it meets the following requirements:\n(1) the lot must be at least 66 percent of the dimensional standard for lot width and lot size for the shoreland classification consistent with Minnesota Rules, chapter 6120;\n(2) the lot must be connected to a public sewer, if available, or must be suitable for the installation of a Type 1 sewage treatment system consistent with Minnesota Rules, chapter 7080, and local government controls;\n(3) impervious surface coverage must not exceed 25 percent of each lot; and\n(4) development of the lot must be consistent with an adopted comprehensive plan.\n(d) A lot subject to paragraph (c) not meeting the requirements of paragraph (c) must be combined with the one or more contiguous lots so they equal one or more conforming lots as much as possible.\n(e) Notwithstanding paragraph (c), contiguous nonconforming lots of record in shoreland areas under a common ownership must be able to be sold or purchased individually if each lot contained a habitable residential dwelling at the time the lots came under common ownership and the lots are suitable for, or served by, a sewage treatment system consistent with the requirements of section 115.55 and Minnesota Rules, chapter 7080, or connected to a public sewer.\n(f) In evaluating all variances, zoning and building permit applications, or conditional use requests, the zoning authority shall require the property owner to address, when appropriate, stormwater runoff management, reducing impervious surfaces, increasing setback, restoration of wetlands, vegetative buffers, sewage treatment and water supply capabilities, and other conservation-designed actions.\n(g) A portion of a conforming lot may be separated from an existing parcel as long as the remainder of the existing parcel meets the lot size and sewage system requirements of the zoning district for a new lot and the newly created parcel is combined with an adjacent parcel.",
	"repealed": false
}