{
	"id": "260C.228",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.228",
	"title": "260C.228 VOLUNTARY FOSTER CARE; CHILD IS COLOCATED WITH PARENT IN TREATMENT PROGRAM.",
	"text": "When a parent requests assistance from an agency and both the parent and agency agree that a child's placement in foster care and colocation with a parent in a licensed residential family-based substance use treatment facility as defined by section 260C.007, subdivision 22a, is in the child's best interests, the agency must specify the recommendation for the placement in the child's case plan. After the child's case plan includes the recommendation, the agency and the parent may enter into a written voluntary placement agreement on a form approved by the commissioner.\n(a) A judicial review of a child's voluntary placement is required within 165 days of the date the voluntary agreement was signed. The agency responsible for the child's placement in foster care shall request the judicial review.\n(b) The agency must forward a written report to the court at least five business days prior to the judicial review in paragraph (a). The report must contain:\n(1) a statement regarding whether the colocation of the child with a parent in a licensed residential family-based substance use disorder treatment program meets the child's needs and continues to be in the child's best interests;\n(2) the child's name, date of birth, race, gender, and current address;\n(3) the names, race, dates of birth, residences, and post office addresses of the child's parents or custodian;\n(4) a statement regarding the child's eligibility for membership or enrollment in an Indian tribe and the agency's compliance with applicable provisions of sections 260.751 to 260.835;\n(5) the name and address of the licensed residential family-based substance use disorder treatment program where the child and parent or custodian are colocated;\n(6) a copy of the out-of-home placement plan under section 260C.212, subdivisions 1 and 3;\n(7) a written summary of the proceedings of any administrative review required under section 260C.203; and\n(8) any other information the agency, parent or custodian, child, or licensed residential family-based substance use disorder treatment program wants the court to consider.\n(c) The agency must inform a child, if the child is 12 years of age or older; the child's parent; and the licensed residential family-based substance use disorder treatment program of the reporting and court review requirements of this section and of their rights to submit information to the court as follows:\n(1) if the child, the child's parent, or the licensed residential family-based substance use disorder treatment program wants to send information to the court, the agency shall advise those persons of the reporting date and the date by which the agency must receive the information to submit to the court with the agency's report; and\n(2) the agency must inform the child, the child's parent, and the licensed residential family-based substance use disorder treatment program that they have the right to be heard in person by the court. An in-person hearing must be held if requested by the child, parent or legal guardian, or licensed residential family-based substance use disorder treatment program.\n(d) If, at the time required for the agency's report under this section, a child 12 years of age or older disagrees about the placement colocating the child with the parent in a licensed residential family-based substance use disorder treatment program or services provided under the out-of-home placement plan under section 260C.212, subdivision 1, the agency shall include information regarding the child's disagreement and to the extent possible the basis for the child's disagreement in the report.\n(e) Regardless of whether an in-person hearing is requested within ten days of receiving the agency's report, the court has jurisdiction to and must determine:\n(1) whether the voluntary foster care arrangement is in the child's best interests;\n(2) whether the parent and agency are appropriately planning for the child; and\n(3) if a child 12 years of age or older disagrees with the foster care placement colocating the child with the parent in a licensed residential family-based substance use disorder treatment program or services provided under the out-of-home placement plan, whether to appoint counsel and a guardian ad litem for the child according to section 260C.163.\n(f) Unless requested by the parent, representative of the licensed residential family-based substance use disorder treatment program, or child, an in-person hearing is not required for the court to make findings and issue an order.\n(g) If the court finds the voluntary foster care arrangement is in the child's best interests and that the agency and parent are appropriately planning for the child, the court shall issue an order containing explicit individualized findings to support the court's determination. The individual findings shall be based on the agency's written report and other materials submitted to the court. The court may make this determination notwithstanding the child's disagreement, if any, reported to the court under paragraph (d).\n(h) The court shall send a copy of the order to the county attorney, the agency, the parent, a child 12 years of age or older, and the licensed residential family-based substance use disorder treatment program.\n(i) If the court finds continuing the voluntary foster care arrangement is not in the child's best interests or that the agency or the parent is not appropriately planning for the child, the court shall notify the agency, the parent, the licensed residential family-based substance use disorder treatment program, a child 12 years of age or older, and the county attorney of the court's determination and the basis for the court's determination. The court shall set the matter for hearing and appoint a guardian ad litem for the child under section 260C.163, subdivision 5.\nThe voluntary placement agreement terminates at the parent's discharge from the licensed residential family-based substance use disorder treatment program, or upon receipt of a written and dated request from the parent, unless the request specifies a later date. If the child's voluntary foster care placement meets the calculated time to require a permanency proceeding under section 260C.503, subdivision 3, paragraph (a), and the child is not returned home, the agency must file a petition according to section 260C.141 or 260C.505.",
	"repealed": false
}