{
	"id": "459.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/459.06",
	"title": "459.06 MUNICIPAL AND MEMORIAL FORESTS.",
	"text": "Any county, city, or town may by resolution of its governing body accept donations of land that the governing body deems to be better adapted for the production of timber and wood than for any other purpose, for a forest, and may manage it on forestry principles. The donor of not less than 100 acres of any such land shall be entitled to have the land perpetually bear the donor's name. The governing body of any city or town, when funds are available or have been levied therefor, may, when authorized by a majority vote by ballot of the voters voting at any general or special city election or town meeting where the question is properly submitted, purchase or obtain by condemnation proceedings, and preferably at the sources of streams, any tract of land for a forest which is better adapted for the production of timber and wood than for any other purpose, and which is conveniently located for the purpose, and manage it on forestry principles. The city or town may annually levy a tax on all taxable property within its boundaries to procure and maintain such forests.\nAny county may by resolution of the county board set aside tax-forfeited land which is more suitable for forest purposes than for any other purpose and dedicate said lands as a memorial forest and manage the same on forestry principles. Any moneys received as income from the land so dedicated and set aside may be expended from the forfeited tax fund for the development and maintenance of the dedicated forest.\nAny tax-forfeited land which has been included in a memorial forest established in any county under the provisions of subdivision 2, and which is found more suitable for other purposes may by resolution of the county board be withdrawn from the forest for disposal as tax-forfeited land if the commissioner of natural resources approves the sale of such land.",
	"repealed": false
}