{
	"id": "342.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.57",
	"title": "342.57 PROTECTIONS FOR REGISTRY PROGRAM PARTICIPANTS.",
	"text": "There is a presumption that a patient or other person enrolled in the registry program is engaged in the authorized use or possession of medical cannabis flower and medical cannabinoid products. This presumption may be rebutted by evidence that the use or possession of medical cannabis flower or medical cannabinoid products by a patient or other person enrolled in the registry program was not for the purpose of assisting with, treating, or alleviating the patient's qualifying medical condition or symptoms associated with the patient's qualifying medical condition.\n(a) Subject to section 342.56, the following are not violations of this chapter or chapter 152:\n(1) use or possession of medical cannabis flower, medical cannabinoid products, or medical cannabis paraphernalia by a patient enrolled in the registry program or by a visiting patient to whom medical cannabis flower or medical cannabinoid products are distributed under section 342.51, subdivision 5;\n(2) possession of medical cannabis flower, medical cannabinoid products, or medical cannabis paraphernalia by a registered designated caregiver or a parent, legal guardian, or spouse of a patient enrolled in the registry program; or\n(3) possession of medical cannabis flower, medical cannabinoid products, or medical cannabis paraphernalia by any person while carrying out duties required under sections 342.51 to 342.60.\n(b) The Office of Cannabis Management, members of the Cannabis Advisory Council, Office of Cannabis Management employees, agents or contractors of the Office of Cannabis Management, and health care practitioners participating in the registry program are not subject to any civil penalties or disciplinary action by the Board of Medical Practice, the Board of Nursing, or any business, occupational, or professional licensing board or entity solely for participating in the registry program either in a professional capacity or as a patient. A pharmacist licensed under chapter 151 is not subject to any civil penalties or disciplinary action by the Board of Pharmacy when acting in accordance with sections 342.51 to 342.60 either in a professional capacity or as a patient. Nothing in this section prohibits a professional licensing board from taking action in response to a violation of law.\n(c) Notwithstanding any law to the contrary, a Cannabis Advisory Council member, the governor, or an employee of a state agency must not be held civilly or criminally liable for any injury, loss of property, personal injury, or death caused by any act or omission while acting within the scope of office or employment under sections 342.51 to 342.60.\n(d) Federal, state, and local law enforcement authorities are prohibited from accessing the registry except when acting pursuant to a valid search warrant. Notwithstanding section 13.09, a violation of this paragraph is a gross misdemeanor.\n(e) Notwithstanding any law to the contrary, the office and employees of the office must not release data or information about an individual contained in any report or document or in the registry and must not release data or information obtained about a patient enrolled in the registry program, except as provided in sections 342.51 to 342.60. Notwithstanding section 13.09, a violation of this paragraph is a gross misdemeanor.\n(f) No information contained in a report or document, contained in the registry, or obtained from a patient under sections 342.51 to 342.60 may be admitted as evidence in a criminal proceeding, unless:\n(1) the information is independently obtained; or\n(2) admission of the information is sought in a criminal proceeding involving a criminal violation of sections 342.51 to 342.60.\n(g) Possession of a registry verification or an application for enrollment in the registry program:\n(1) does not constitute probable cause or reasonable suspicion;\n(2) must not be used to support a search of the person or property of the person with a registry verification or application to enroll in the registry program; and\n(3) must not subject the person or the property of the person to inspection by any government agency.\n(a) No school may refuse to enroll or otherwise penalize a patient or person enrolled in the registry program as a pupil solely because the patient or person is enrolled in the registry program, unless failing to do so would violate federal law or regulations or cause the school to lose a monetary or licensing-related benefit under federal law or regulations.\n(b) No landlord may refuse to lease to a patient or person enrolled in the registry program or otherwise penalize a patient or person enrolled in the registry program solely because the patient or person is enrolled in the registry program, unless failing to do so would violate federal law or regulations or cause the landlord to lose a monetary or licensing-related benefit under federal law or regulations.\nFor purposes of medical care, including organ transplants, a patient's use of medical cannabis flower or medical cannabinoid products according to sections 342.51 to 342.60 is considered the equivalent of the authorized use of a medication used at the discretion of a health care practitioner and does not disqualify a patient from needed medical care.\n(a) Unless a failure to do so would violate federal or state law or regulations or cause an employer to lose a monetary or licensing-related benefit under federal law or regulations, an employer may not discriminate against a person in hiring, termination, or any term or condition of employment, or otherwise penalize a person, if the discrimination is based on:\n(1) the person's status as a patient or person enrolled in the registry program; or\n(2) a patient's positive drug test for cannabis components or metabolites, unless the patient used, possessed, sold, transported, or was impaired by medical cannabis flower or a medical cannabinoid product on work premises, during working hours, or while operating an employer's machinery, vehicle, or equipment.\n(b) An employee who is a patient and whose employer requires the employee to undergo drug testing according to section 181.953 may present the employee's registry verification as part of the employee's explanation under section 181.953, subdivision 6.\nA person must not be denied custody of a minor child or visitation rights or parenting time with a minor child based solely on the person's status as a patient or person enrolled in the registry program. There must be no presumption of neglect or child endangerment for conduct allowed under sections 342.51 to 342.60, unless the person's behavior creates an unreasonable danger to the safety of the minor as established by clear and convincing evidence.\nIn addition to any other remedy provided by law, a patient or person enrolled in the registry program may bring an action for damages against any person who violates subdivision 3, 4, or 5. A person who violates subdivision 3, 4, or 5 is liable to a patient or person enrolled in the registry program injured by the violation for the greater of the person's actual damages or a civil penalty of $100 and reasonable attorney fees.\n(a) This subdivision applies to an individual placed on parole, supervised release, or conditional release.\n(b) The commissioner of corrections may not:\n(1) prohibit an individual from participating in the registry program as a condition of release; or\n(2) revoke an individual's parole, supervised release, or conditional release or otherwise sanction an individual solely:\n(i) for participating in the registry program; or\n(ii) for a positive drug test for cannabis components or metabolites.",
	"repealed": false
}