{
	"id": "641.15#stat.641.15.3a",
	"url": "https://www.revisor.mn.gov/statutes/cite/641.15#stat.641.15.3a",
	"title": "641.15 PRISONERS; FEEDING; CARE.",
	"text": "The county board shall provide suitable jail clothing, without distinctive marks, underclothing, linen and bedding, towels, and medical aid for prisoners, and fuel for the jail and, if adjoining and connected, the sheriff's residence. The sheriff may require a prisoner to wear jail clothing during confinement, but shall restore personal clothing upon discharge. No prisoner must be required to wear clothing previously used until it has been thoroughly cleansed. The sheriff or jailer shall keep the jail in a clean and healthy condition, have each prisoner's clothing washed at least once a week, furnish to each sufficient clean water for drinking and bathing, and serve each three times a day with a sufficient quantity of wholesome, well cooked food.\nExcept as provided in section 466.101, the county board shall pay the costs of medical services provided to prisoners pursuant to this section. The amount paid by the county board for a medical service shall not exceed the maximum allowed medical assistance payment rate for the service, as determined by the commissioner of human services. In the absence of a health or medical insurance or health plan that has a contractual obligation with the provider or the prisoner, medical providers shall charge no higher than the rate negotiated between the county and the provider. In the absence of an agreement between the county and the provider, the provider may not charge an amount that exceeds the maximum allowed medical assistance payment rate for the service, as determined by the commissioner of human services. The county is entitled to reimbursement from the prisoner for payment of medical bills to the extent that the prisoner to whom the medical aid was provided has the ability to pay the bills. The prisoner shall, at a minimum, incur co-payment obligations for health care services provided by a county correctional facility. The county board shall determine the co-payment amount. Notwithstanding any law to the contrary, the co-payment shall be deducted from any of the prisoner's funds held by the county, to the extent possible. If there is a disagreement between the county and a prisoner concerning the prisoner's ability to pay, the court with jurisdiction over the defendant shall determine the extent, if any, of the prisoner's ability to pay for the medical services. If a prisoner is covered by health or medical insurance or other health plan when medical services are provided, the medical provider shall bill that health or medical insurance or other plan. If the county providing the medical services for a prisoner that has coverage under health or medical insurance or other plan, that county has a right of subrogation to be reimbursed by the insurance carrier for all sums spent by it for medical services to the prisoner that are covered by the policy of insurance or health plan, in accordance with the benefits, limitations, exclusions, provider restrictions, and other provisions of the policy or health plan. The county may maintain an action to enforce this subrogation right. The county does not have a right of subrogation against the medical assistance program. The county shall not charge prisoners for telephone calls to MNsure navigators, the Minnesota Warmline, a mental health provider, or calls for the purpose of providing case management or mental health services as defined in section 245.462 to prisoners.\nAs part of its intake procedure for new prisoners, the sheriff shall ask the prisoner whether the prisoner has health coverage. If the prisoner has coverage under a policy of accident and health insurance regulated under chapter 62A, a health maintenance contract regulated under chapter 62D, a group subscriber contract regulated under chapter 62C, a health benefit certificate regulated under chapter 64B, a self-insured plan, or other health coverage, the prisoner shall provide to the sheriff the name of the carrier or administrator and other information and authorizations necessary for the sheriff to obtain specific information about coverage.\n(a) As part of its intake procedure for new inmates, the sheriff or local corrections shall use a mental health screening tool approved by the commissioner of corrections in consultation with the commissioner of human services and local corrections staff to identify persons who may have mental illness.\n(b) Names of persons who have screened positive or may have a mental illness may be shared with the local county social services agency. The jail may refer an offender to county personnel of the welfare system, as defined in section 13.46, subdivision 1, paragraph (c), in order to arrange for services upon discharge and may share private data on the offender as necessary to:\n(1) provide assistance in filling out an application for medical assistance or MinnesotaCare;\n(2) make a referral for case management as provided under section 245.467, subdivision 4;\n(3) provide assistance in obtaining a state photo identification;\n(4) secure a timely appointment with a psychiatrist or other appropriate community mental health provider;\n(5) provide prescriptions for a 30-day supply of all necessary medications; or\n(6) coordinate behavioral health services.\n(c) Notwithstanding section 138.17, if an offender is referred to a government entity within the welfare system pursuant to paragraph (b), and the offender refuses all services from the entity, the entity must, within 15 days of the refusal, destroy all private data on the offender that it created or received because of the referral.\nA county board may authorize the sheriff to fulfill the county board's obligation to provide the medical aid required by subdivision 1 in accordance with the terms of the health plan covering the prisoner, where possible, subject to any rules and exceptions provided by the county board. The sheriff has no obligation to the prisoner to obtain the prisoner's health care in accordance with the prisoner's health coverage.\nSubdivisions 2, 3, and 4 apply to any medical aid, including dental care, provided to prisoners held in a county jail or workhouse.",
	"repealed": false
}