{
	"id": "260C.143",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.143",
	"title": "260C.143 PROCEDURE; HABITUAL TRUANTS, RUNAWAYS, OFFENDERS.",
	"text": "When a peace officer, or attendance officer in the case of a habitual truant, has probable cause to believe that a child is in need of protection or services under section 260C.007, subdivision 6, clause (13) or (14), the officer may issue a notice to the child to appear in juvenile court in the county in which the child is found or in the county of the child's residence. If there is a school attendance review board or county attorney mediation program operating in the child's school district, a notice to appear in juvenile court for a habitual truant may not be issued until the applicable procedures under section 260A.06 or 260A.07 have been followed. The officer shall file a copy of the notice to appear with the juvenile court of the appropriate county. If a child fails to appear in response to the notice, the court may issue a summons notifying the child of the nature of the offense alleged and the time and place set for the hearing. If the peace officer finds it necessary to take the child into custody, sections 260C.175 and 260C.176 shall apply.\nFiling with the court a notice to appear containing the name and address of the child, specifying the offense alleged and the time and place it was committed, has the effect of a petition giving the juvenile court jurisdiction. In the case of running away, the place where the offense was committed may be stated in the notice as either the child's custodial parent's or guardian's residence or lawful placement or where the child was found by the officer. In the case of truancy, the place where the offense was committed may be stated as the school or the place where the child was found by the officer.\nWhenever a notice to appear or petition is filed alleging that a child is in need of protection or services under section 260C.007, subdivision 6, clause (13) or (14), the court shall summon and notify the person or persons having custody or control of the child of the nature of the offense alleged and the time and place of hearing. This summons and notice shall be served in the time and manner provided in section 260C.151, subdivision 1.\nWhen a peace officer or probation officer has probable cause to believe that a child is absent from school without lawful excuse, consistent with section 120A.22, subdivisions 5 and 8, the officer may:\n(1) transport the child to the child's home and deliver the child to the custody of the child's parent or guardian;\n(2) transport the child to the child's school of enrollment and deliver the child to the custody of a school superintendent or teacher;\n(3) transport the child to a truancy service center under section 260A.04, subdivision 3; or\n(4) transport the child from the child's home to the child's school of enrollment or to a truancy service center.",
	"repealed": false
}