{
	"id": "393.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/393.07",
	"title": "393.07 POWERS AND DUTIES.",
	"text": "(a) To assist in carrying out the child protection, delinquency prevention and family assistance responsibilities of the state, the local social services agency shall administer a program of social services and financial assistance to be known as the public child welfare program. The public child welfare program shall be supervised by the commissioner of children, youth, and families and administered by the local social services agency in accordance with law and with rules of the commissioner.\n(b) The purpose of the public child welfare program is to assure protection for and financial assistance to children who are confronted with social, physical, or emotional problems requiring protection and assistance. These problems include, but are not limited to the following:\n(1) mental, emotional, or physical disability;\n(2) birth of a child to a mother who was not married to the child's father when the child was conceived nor when the child was born, including but not limited to costs of prenatal care, confinement and other care necessary for the protection of a child born to a mother who was not married to the child's father at the time of the child's conception nor at the birth;\n(3) dependency, neglect;\n(4) delinquency;\n(5) abuse or rejection of a child by its parents;\n(6) absence of a parent or guardian able and willing to provide needed care and supervision;\n(7) need of parents for assistance with child rearing problems, or in placing the child in foster care.\n(c) A local social services agency shall make the services of its public child welfare program available as required by law, by the commissioner, or by the courts and shall cooperate with other agencies, public or private, dealing with the problems of children and their parents as provided in this subdivision.\n(d) A local social services agency may rent, lease, or purchase property, or in any other way approved by the commissioner, contract with individuals or agencies to provide needed facilities for foster care of children. It may purchase services or child care from duly authorized individuals, agencies or institutions when in its judgment the needs of a child or the child's family can best be met in this way.\nMS 1978 [Repealed, 1979 c 256 s 3]\nThe local social services agency, subject to the supervision of the commissioners of human services and children, youth, and families, shall administer all forms of public welfare, both for children and adults, responsibility for which now or hereafter may be imposed on the commissioners of human services and children, youth, and families by law, including general assistance, aid to dependent children, county supplementation, if any, or state aid to recipients of Supplemental Security Income for aged, blind and disabled, child welfare services, mental health services, and other public assistance or public welfare services, provided that the local social services agency shall not employ public health nursing or home health service personnel other than homemaker-home help aides, but shall contract for or purchase the necessary services from existing community agencies. The duties of the local social services agency shall be performed in accordance with the standards and rules which may be promulgated by the commissioners of human services and children, youth, and families to achieve the purposes intended by law and in order to comply with the requirements of the federal Social Security Act in respect to public assistance and child welfare services, so that the state may qualify for grants-in-aid available under that act. To avoid administrative penalties under section 256.017, the local social services agency must comply with (1) policies established by state law and (2) instructions from the commissioner relating (i) to public assistance program policies consistent with federal law and regulation and state law and rule and (ii) to local agency program operations. The commissioner may enforce local social services agency compliance with the instructions, and may delay, withhold, or deny payment of all or part of the state and federal share of benefits and federal administrative reimbursement, according to the provisions under section 256.017. The local social services agency shall supervise wards of the commissioner and, when so designated, act as agent of the commissioner of human services or children, youth, and families in the placement of the commissioner's wards in adoptive homes or in other foster care facilities. The local social services agency shall cooperate as needed when the commissioner of children, youth, and families contracts with a licensed child placement agency for adoption services for a child under the guardianship of the commissioner of children, youth, and families. The local social services agency may contract with a bank or other financial institution to provide services associated with the processing of public assistance checks and pay a service fee for these services, provided the fee charged does not exceed the fee charged to other customers of the institution for similar services.\nThe local social services agency shall be charged with the duties of administration of all forms of public assistance and public child welfare or other programs within the purview of the federal Social Security Act, other than public health nursing and home health services, and which now are, or hereafter may be, imposed on the commissioners of human services and children, youth, and families by law, of both children and adults. The duties of such local social services agency shall be performed in accordance with the standards and rules which may be promulgated by the commissioners of human services and children, youth, and families in order to achieve the purposes of the law and to comply with the requirements of the federal Social Security Act needed to qualify the state to obtain grants-in-aid available under that act. Notwithstanding the provisions of any other law to the contrary, the welfare board shall delegate to the director the authority to determine eligibility and disburse funds without first securing board action, provided that the director shall present to the board, at the next scheduled meeting, any such action taken for ratification by the board.\nThe commissioners of human services and children, youth, and families shall be the authority to adopt and enforce rules concerning the use and publication of lists of public assistance recipients and governing the custody, use, and preservation of public assistance, mental health or child welfare records, files, and communications. The commissioners of human services and children, youth, and families shall adopt such rules as may be necessary to comply with the requirements of the federal Social Security Act; but in any event shall provide for the annual publication of a summary financial statement giving total expenditures for each of the several programs of public assistance; and shall make all finance records available for such examinations and audits as are required by law. No use or publication of the lists, records, files, and communications herein referred to shall be made until such rules are adopted, and then only in the manner and form therein provided. All other laws, or parts of laws, now in effect inconsistent with the provisions of this chapter are hereby repealed, superseded, modified, or amended so far as necessary to conform to and give full force and effect to the provisions of this chapter. The provisions of this chapter will not be construed to apply to poor relief or direct relief given solely in behalf of adult persons.\nThe commissioners of human services and children, youth, and families shall have authority to require such methods of administration as are necessary for compliance with requirements of the federal Social Security Act, as amended, and for the proper and efficient operation of all welfare programs. This authority to require methods of administration includes methods relating to the establishment and maintenance of personnel standards on a merit basis as concerns all employees of local social services agencies except those employed in an institution, sanitarium, or hospital. The commissioners of human services and children, youth, and families shall exercise no authority with respect to the selection, tenure of office, and compensation of any individual employed in accordance with such methods. The adoption of methods relating to the establishment and maintenance of personnel standards on a merit basis of all such employees of the local social services agencies and the examination thereof, and the administration thereof shall be directed and controlled exclusively by the commissioners of human services and children, youth, and families.\nNotwithstanding the provisions of any other law to the contrary, every employee of every local social services agency who occupies a position which requires as prerequisite to eligibility therefor graduation from an accredited four-year college or a certificate of registration as a registered nurse under section 148.231, must be employed in such position under the merit system established under authority of this subdivision. Every such employee now employed by a local social services agency and who is not under said merit system is transferred, as of January 1, 1962, to a position of comparable classification in the merit system with the same status therein as the employee had in the county of employment prior thereto and every such employee shall be subject to and have the benefit of the merit system, including seniority within the local social services agency, as though the employee had served thereunder from the date of entry into the service of the local social services agency.\nEvery local social services agency authorizing braces, crutches, trusses, wheel chairs and hearing aids for use by recipients of Supplemental Security Income for the aged, blind and disabled, the Minnesota family investment program and relief shall secure such devices at the lowest cost obtainable conducive to the well being of the recipient and fix the recipient's grant in an amount to cover the cost of the device providing it will be purchased at the lowest cost obtainable, or may make payment for the device directly to the vendor.\nIn accordance with procedures established by the commissioners of human services and children, youth, and families, the local social services agencies may establish volunteer service programs. Persons who participate in these programs may be reimbursed for expenses incurred in performing assigned duties. For purposes of this section, a volunteer worker shall not receive compensation for services rendered but shall be entitled to workers' compensation coverage as provided for in section 176.011, subdivision 9.\nIn accordance with procedures established by the commissioners of human services and children, youth, and families, local social services agencies may appoint citizen advisory committees to consult with the agency on any of the programs or services administered by the agency. Within the limits of the appropriation provided, the agency may authorize the reimbursement of committee members for expenses incurred in the performance of their duties.\nWhen directed by a judge of district court or when a person under court order is in default in making child support payments to another person who has custody of the children for whom such payments have been ordered, the local social services agency shall take such steps as may be necessary to compel the person in default on such payments to make them; to take such steps as may be necessary to compel such persons to make reimbursement to comply with the order of court when in default; and to institute, if necessary, contempt proceedings on behalf of such person or persons to whom money or property is ordered to be paid or delivered. It shall be the duty of the county attorney to conduct such contempt proceedings when directed by a judge of the district court or when requested by the local social services agency. The county attorney in such contempt proceedings or upon a separate motion supported by order to show cause and affidavits may move the court that any defaults or delinquent payments under such order of support be reduced to a judgment against the defaulting party, and where the local social services agency or any other public agency has advanced and expended funds to supply the unmet needs of such children because of such default by failure to pay the court order, such local social services agency or other public agency shall be subrogated and may recover under such judgment to the extent that public funds were expended for the care and support of such children. The additional cost incurred by the county attorney to bring contempt actions under this subdivision shall be paid from the moneys collected in such actions in whatever manner and amount approved by a judge of the district court.\n(a) The public authority, as defined in section 518A.26, subdivision 18, may sanction an employer or payor of funds $25 per day, up to $500 per incident, for failing to comply with section 518A.46, subdivision 5, paragraph (a), clauses (5) and (8), if:\n(1) the public authority mails the employer or payor of funds by certified mail a notice of an administrative sanction, at the employer's or payor's of funds last known address, which includes the date the sanction will take effect, the amount of the sanction, the reason for imposing the sanction, and the corrective action that must be taken to avoid the sanction; and\n(2) the employer or payor of funds fails to correct the violation before the effective date of the sanction.\n(b) The public authority shall include with the sanction notice an additional notice of the right to appeal the sanction and the process for making the appeal.\n(c) Unless an appeal is made, the administrative determination of the sanction is final and binding.\n(a) The local social services agency shall establish and administer the Supplemental Nutrition Assistance Program (SNAP) according to rules of the commissioner of children, youth, and families, the supervision of the commissioner as specified in section 256.01, and all federal laws and regulations. The commissioner of children, youth, and families shall monitor SNAP delivery on an ongoing basis to ensure that each county complies with federal laws and regulations. Program requirements to be monitored include, but are not limited to, number of applications, number of approvals, number of cases pending, length of time required to process each application and deliver benefits, number of applicants eligible for expedited issuance, length of time required to process and deliver expedited issuance, number of terminations and reasons for terminations, client profiles by age, household composition and income level and sources, and the use of phone certification and home visits. The commissioner shall determine the county-by-county and statewide participation rate.\n(b) On July 1 of each year, the commissioner of children, youth, and families shall determine a statewide and county-by-county SNAP participation rate. The commissioner may designate a different agency to administer the SNAP in a county if the agency administering the program fails to increase the SNAP participation rate among families or eligible individuals, or comply with all federal laws and regulations governing the SNAP. The commissioner shall review agency performance annually to determine compliance with this paragraph.\n(c) A person who commits any of the following acts has violated section 256.98 or 609.821, or both, and is subject to both the criminal and civil penalties provided under those sections:\n(1) obtains or attempts to obtain, or aids or abets any person to obtain by means of a willful statement or misrepresentation, or intentional concealment of a material fact, SNAP benefits or vouchers issued according to sections 145.891 to 145.897 to which the person is not entitled or in an amount greater than that to which that person is entitled or which specify nutritional supplements to which that person is not entitled; or\n(2) presents or causes to be presented, coupons or vouchers issued according to sections 145.891 to 145.897 for payment or redemption knowing them to have been received, transferred or used in a manner contrary to existing state or federal law; or\n(3) willfully uses, possesses, or transfers SNAP benefits, authorization to purchase cards or vouchers issued according to sections 145.891 to 145.897 in any manner contrary to existing state or federal law, rules, or regulations; or\n(4) buys or sells SNAP benefits, authorization to purchase cards, other assistance transaction devices, vouchers issued according to sections 145.891 to 145.897, or any food obtained through the redemption of vouchers issued according to sections 145.891 to 145.897 for cash or consideration other than eligible food.\n(d) A peace officer or welfare fraud investigator may confiscate SNAP benefits, authorization to purchase cards, or other assistance transaction devices found in the possession of any person who is neither a recipient of SNAP benefits nor otherwise authorized to possess and use such materials. Confiscated property shall be disposed of as the commissioner may direct and consistent with state and federal SNAP law. The confiscated property must be retained for a period of not less than 30 days to allow any affected person to appeal the confiscation under section 256.045.\n(e) Establishment of an overpayment is limited to 12 months prior to the month of discovery due to agency error. Establishment of an overpayment is limited to six years prior to the month of discovery due to client error or an intentional program violation determined under section 256.046.\n(f) With regard to the federal tax revenue offset program only, recovery incentives authorized by the federal food and consumer service shall be retained at the rate of 50 percent by the state agency and 50 percent by the certifying county agency.\n(g) A peace officer, welfare fraud investigator, federal law enforcement official, or the commissioner of health may confiscate vouchers found in the possession of any person who is neither issued vouchers under sections 145.891 to 145.897, nor otherwise authorized to possess and use such vouchers. Confiscated property shall be disposed of as the commissioner of health may direct and consistent with state and federal law. The confiscated property must be retained for a period of not less than 30 days.\n(h) The commissioner of children, youth, and families may seek a waiver from the United States Department of Agriculture to allow the state to specify foods that may and may not be purchased in Minnesota with benefits funded by the federal Supplemental Nutrition Assistance Program. The commissioner shall consult with the members of the house of representatives and senate policy committees having jurisdiction over SNAP issues in developing the waiver. The commissioner, in consultation with the commissioners of health and education, shall develop a broad public health policy related to improved nutrition and health status. The commissioner must seek legislative approval prior to implementing the waiver.\nThe commissioner of children, youth, and families shall continually monitor the expedited issuance of SNAP benefits to ensure that each county complies with federal regulations and that households eligible for expedited issuance of SNAP benefits are identified, processed, and certified within the time frames prescribed in federal regulations.\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]",
	"repealed": false
}