{
	"id": "326B.164",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.164",
	"title": "326B.164 LICENSES.",
	"text": "(a) Except as otherwise provided by law, no individual shall perform or supervise elevator work, unless:\n(1) the individual is licensed by the commissioner as a master elevator constructor; and\n(2) the elevator work is for a licensed elevator contractor and the individual is an employee, partner, or officer of, or is the licensed contractor.\n(b) An applicant for a master elevator constructor license shall:\n(1) have at least one year of experience, acceptable to the commissioner, as a licensed journeyworker elevator constructor; or\n(2) have at least six years' experience, acceptable to the commissioner, in planning for, laying out, supervising, and installing apparatus, equipment, and wiring for elevators.\n(c) Except for the initial license term, as a condition of license renewal, master elevator constructors must attain a minimum of 16 hours of continuing education credit approved by the commissioner every renewal period. Not less than 12 hours shall be based on the Minnesota Elevator Code or elevator technology, and not less than four hours shall be based on the National Electrical Code.\n(a) Except as otherwise provided by law, no individual shall perform or supervise elevator work on residential elevators, platform lifts, stairway chairlifts, dumbwaiters, material lifts, limited use or limited application elevator equipment, conveyors, and special purpose personnel elevators, unless:\n(1) the individual is licensed by the commissioner as a limited master elevator constructor; and\n(2) the elevator work is for a limited elevator contractor and the individual is an employee, partner, or officer of, or is the licensed contractor.\n(b) An applicant for a limited master elevator constructor license shall have at least three years of experience, acceptable to the commissioner, in installing apparatus, equipment, and wiring for elevators.\n(c) Except for the initial license term, as a condition of license renewal, limited master elevator constructors must attain a minimum of eight hours of continuing education credit approved by the commissioner every renewal period. Not less than six hours shall be based on the Minnesota Elevator Code or elevator technology, and not less than two hours on the National Electrical Code.\n(a) Except as otherwise provided by law, no individual shall perform and supervise elevator work except for planning or laying out of elevator work, unless:\n(1) the individual is licensed by the commissioner as a journeyworker elevator constructor; and\n(2) the elevator work is for an elevator contractor, and the individual is an employee, partner, or officer of the licensed elevator contractor.\n(b) An applicant for a journeyworker elevator constructor license shall have completed a four-year elevator mechanics apprenticeship registered with the United States Department of Labor or worked at least 9,000 hours in five consecutive years for a licensed elevator contractor, acceptable to the commissioner, installing, maintaining, modernizing, testing, wiring, and repairing elevators.\n(c) As a condition of license renewal, journeyworker elevator constructors must attain a minimum of 16 hours of continuing education credit approved by the commissioner every renewal period. Not less than 12 hours shall be based on the Minnesota Elevator Code or elevator technology, and not less than four hours shall be based on the National Electrical Code.\n(a) Except as otherwise provided by law, no individual shall perform or supervise elevator work on residential elevators, platform lifts, stairway chairlifts, dumbwaiters, material lifts, limited use or limited application elevator equipment, conveyors, and special purpose personnel elevators, except for planning or laying out of elevator work, unless:\n(1) the individual is licensed by the commissioner as a limited journeyworker elevator constructor; and\n(2) the elevator work is for a limited elevator contractor or an elevator contractor, and the individual is an employee, partner, or officer of the licensed limited elevator contractor or licensed elevator contractor.\n(b) An applicant for a limited journeyworker elevator constructor license shall have at least two years of experience, acceptable to the commissioner, in installing apparatus, equipment, and wiring for elevators.\n(c) Except for the initial license term, as a condition of license renewal, limited journeyworker elevator constructors must attain a minimum of eight hours of continuing education credit approved by the commissioner every renewal period. Not less than six hours shall be based on the Minnesota Elevator Code or elevator technology, and not less than two hours on the National Electrical Code.\n(a) An unlicensed individual shall not perform elevator work, unless the individual has first registered with the department as an unlicensed elevator constructor. Except as allowed by subdivision 13, a registered unlicensed elevator constructor shall not perform elevator work unless the work is performed under the direct supervision of an individual actually licensed to perform such work. The licensed elevator constructor and the registered unlicensed elevator constructor must be employed by the same employer. Unlicensed individuals shall not supervise the performance of elevator work or make assignments of elevator work to unlicensed individuals. Licensed elevator constructors shall provide direct supervision for no more than two registered unlicensed elevator constructors.\n(b) Notwithstanding any other provision of this section, no individual other than a master elevator constructor or limited master elevator constructor shall plan or lay out elevator wiring, apparatus, or equipment.\n(c) Contractors employing registered unlicensed elevator constructors performing elevator work shall maintain records establishing compliance with this subdivision that shall identify all unlicensed individuals performing elevator work and shall permit the department to examine and copy all such records.\n(d) When a licensed elevator constructor supervises the elevator work of an unlicensed individual, the licensed elevator constructor is responsible for ensuring that the elevator work complies with this section and the Minnesota Elevator Code.\n(e) A registered unlicensed elevator constructor with a minimum of one year experience may perform the following maintenance tasks for elevator equipment without being provided with direct supervision: oiling, cleaning, greasing, painting, relamping, and replacing of escalator and moving walk comb teeth.\n(a) Unlicensed individuals performing elevator work for a contractor shall register with the department in the manner prescribed by the commissioner. Experience credit for elevator work performed in Minnesota after January 1, 2009, by an applicant for a license identified in this section shall not be granted where the applicant has not registered with the department or is not licensed by the department.\n(b) As a condition of renewal of registration, unlicensed individuals shall attain a minimum of two hours of continuing education credit, approved by the commissioner, every renewal period. The continuing education course shall be based on the Minnesota Elevator Code or elevator technology.\nNo individual, other than an employee, partner, or officer of a licensed contractor, as defined by section 326B.163, subdivision 10, shall perform or offer to perform elevator work with or without compensation, unless the individual obtains a contractor's license. A contractor's license does not of itself qualify its holder to perform or supervise the elevator work authorized by holding any class of personal license.\nAs a condition of licensing, each contractor shall give and maintain bond to the state in the penal sum of $25,000. The bond must comply with section 326B.0921.\nEach elevator contractor shall have and maintain in effect general liability insurance, which includes premises and operations insurance and products and completed operations insurance, with limits of at least $100,000 per occurrence, $300,000 aggregate limit for bodily injury, and property damage insurance with limits of at least $50,000, or a policy with a single limit for bodily injury and property damage of $300,000 per occurrence and $300,000 aggregate limits. The insurance shall be written by an insurer licensed to do business in the state of Minnesota, and each contractor shall maintain on file with the commissioner a certificate evidencing such insurance. In the event of a policy cancellation, the insurer shall send written notice to the commissioner at the same time that a cancellation request is received from or a notice is sent to the insured.\n(a) Each elevator contractor must designate a responsible master elevator constructor or limited master elevator constructor who shall be the responsible individual for the performance of all elevator work in accordance with the requirements of sections 326B.163 to 326B.191, all rules adopted under these sections, and all orders issued under section 326B.082. The classes of work that a licensed contractor is authorized to perform shall be limited to the classes of work that the responsible individual is allowed to perform.\n(b) When a contractor's license is held by an individual, sole proprietorship, partnership, limited liability company, or corporation, and the individual, proprietor, one of the partners, one of the members, or an officer of the corporation, respectively, is not the responsible master elevator constructor or limited master elevator constructor, all elevator permits shall be submitted by the responsible master elevator constructor or limited master elevator constructor. If the contractor is an individual or a sole proprietorship, the responsible master or limited master elevator constructor must be the individual, proprietor, or managing employee. If the contractor is a partnership, the responsible master or limited master elevator constructor must be a general partner or managing employee. If the licensed contractor is a limited liability company, the responsible master or limited master elevator constructor must be a chief manager or managing employee. If the contractor is a corporation, the responsible master or limited master elevator constructor must be an officer or managing employee. If the responsible master or limited master elevator constructor is a managing employee, the responsible individual must be actively engaged in performing elevator work on behalf of the contractor and cannot be employed in any capacity performing elevator work for any other elevator contractor or employer. An individual may be the responsible individual for only one contractor.\n(c) All applications and renewals for contractor licenses shall include a verified statement that the applicant and responsible individual are in compliance with this subdivision.\nIn addition to the other requirements described in this section and sections 326B.091 to 326B.098, as a precondition to issuance of a personal license, each applicant must pass a written or oral examination developed and administered by the commissioner to ensure the competence of each applicant for license. An oral examination shall be administered only to an applicant who furnishes a written statement from a certified teacher or other professional, trained in the area of reading disabilities, stating that the applicant has a specific reading disability that would prevent the applicant from performing satisfactorily on a written test. The oral examination shall be structured so that an applicant who passes the examination will not impair the applicant's own safety or that of others while acting as a licensed individual.\n(a) Unless revoked or suspended under this chapter, all licenses issued or renewed under this section expire on the following schedule:\n(1) master licenses expire March 1 of each odd-numbered year after issuance or renewal;\n(2) elevator contractor licenses expire March 1 of each even-numbered year after issuance or renewal;\n(3) journeyworker elevator constructor licenses expire two years from the date of original issuance and every two years thereafter; and\n(4) registrations of unlicensed individuals expire one year from the date of original issuance and every year thereafter.\n(b) For purposes of calculating license fees and renewal license fees required under section 326B.092:\n(1) the registration of an unlicensed individual under subdivision 5 shall be considered an entry-level license;\n(2) the journeyworker elevator constructor and the limited journeyworker elevator constructor shall be considered a journeyworker license;\n(3) the master elevator constructor and limited master elevator constructor licenses shall be considered master licenses; and\n(4) an elevator contractor license shall be considered a business license.\n(a) Employees of a licensed elevator contractor or licensed limited elevator contractor are not required to hold or obtain a license under this section or be provided with direct supervision by a licensed master elevator constructor, licensed limited master elevator constructor, licensed elevator constructor, or licensed limited elevator constructor to install, maintain, or repair platform lifts and stairway chairlifts. Unlicensed employees performing elevator work under this exemption must comply with subdivision 6. This exemption does not include the installation, maintenance, repair, or replacement of electrical wiring for elevator equipment.\n(b) Contractors or individuals shall not be required to hold or obtain a license under this section when performing work on:\n(1) conveyors, excluding vertical reciprocating conveyors;\n(2) platform lifts not covered under section 326B.163, subdivision 5a; or\n(3) dock levelers.\n(a) The commissioner may enter into reciprocity agreements for personal licenses with another state and issue a personal license without requiring the applicant to pass an examination provided the applicant:\n(1) submits an application under this section;\n(2) pays the application and examination fee and license fee required under section 326B.092; and\n(3) holds a valid comparable license in the state participating in the agreement.\n(b) Reciprocity agreements are subject to the following:\n(1) the parties to the agreement must administer a statewide licensing program that includes examination and qualifying experience or training comparable to Minnesota's;\n(2) the experience and training requirements under which an individual applicant qualified for examination in the qualifying state must be deemed equal to or greater than required for an applicant making application in Minnesota at the time the applicant acquired the license in the qualifying state;\n(3) the applicant must have acquired the license in the qualifying state through an examination deemed equivalent to the same class of license examination in Minnesota. A lesser class of license may be granted where the applicant has acquired a greater class of license in the qualifying state, and the applicant otherwise meets the conditions of this subdivision;\n(4) at the time of application, the applicant must hold a valid license in the qualifying state and have held the license continuously for at least one year before making application in Minnesota;\n(5) an applicant is not eligible for a license under this subdivision if the applicant has failed the same or greater class of license examination in Minnesota, or if the applicant's license of the same or greater class has been revoked or suspended; and\n(6) an applicant who has failed to renew a personal license for two years or more after its expiration is not eligible for a license under this subdivision.",
	"repealed": false
}