{
	"id": "326B.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.093",
	"title": "326B.093 LICENSES REQUIRING EXAMINATION ADMINISTERED BY COMMISSIONER.",
	"text": "If the applicant for a license must pass an examination administered by the commissioner in order to obtain the license, then the applicant's complete application must demonstrate that the applicant is qualified to take the examination. The applicant is qualified to take the examination if the applicant meets all requirements for the license except for passing the examination.\nIf the applicant is not qualified to take the examination, then the commissioner must deny the application. The applicant may subsequently submit another application, accompanied by the required fee.\nIf the applicant is qualified to take the examination, then the department must notify the applicant, and the applicant may schedule a time to take the examination within one year after the notification date. If the applicant does not take the examination at the scheduled time, the applicant may, one time only, reschedule a time to take the examination on a date within one year after the notification date. If the applicant fails to take the examination within one year after the notification date, the commissioner must deny the application and the applicant forfeits the application/examination fee. The applicant may subsequently submit another application, accompanied by the required application/examination fee.\nIf the applicant receives a passing score on the examination and meets all other requirements for licensure, the commissioner must approve the application and notify the applicant of the approval within 60 days of the date of the passing score. The applicant must, within 180 days after the notification of approval, pay the license fee. Upon receipt of the license fee, the commissioner must issue the license. If the applicant does not pay the license fee within 180 days after the notification of approval, the commissioner will rescind the approval and must deny the application. If the applicant does not receive a passing score on the examination, the commissioner must deny the application. If the application is denied because of the applicant's failure to receive a passing score on the examination, then the applicant cannot submit a new application for the license until at least 30 days after the date of the failed examination.",
	"repealed": false
}