{
	"id": "116L.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.35",
	"title": "116L.35 INVENTORY OF ECONOMIC DEVELOPMENT PROGRAMS.",
	"text": "(a) By January 15, 2020, and by January 15 of each even-numbered year thereafter, the commissioner of employment and economic development must submit a report to the chairs of the legislative committees with jurisdiction over economic development that provides an inventory of all economic development programs, including any workforce development programs, either provided by or overseen by any agency of the state of Minnesota.\n(b) Programs related to economic development that must be included in the report include those that:\n(1) receive federal funds or state funds;\n(2) provide assistance to either businesses or individuals; or\n(3) support internships, apprenticeships, career and technical education, or any form of employment training.\n(c) For each economic development program, the report must include, at a minimum, the following information:\n(1) details of program costs;\n(2) the number of staff, both within the department and any outside organization;\n(3) the number of program participants;\n(4) the demographic information including, but not limited to, race, age, gender, and income of program participants;\n(5) a list of any and all subgrantees receiving funds from the program, as well as the amount of funding received;\n(6) information about other sources of funding including other public or private funding or in-kind donations;\n(7) evidence that:\n(i) the organization administering a program;\n(ii) a business receiving a loan for a new or expanded business from a program; or\n(iii) a subgrantee of a program is in good standing with the Minnesota Secretary of State and the Minnesota Department of Revenue;\n(8) a short description of what each program does; and\n(9) to the extent practical, quantifiable measures of program success.\n(d) In addition to the information required under paragraph (c), a program related to economic development under paragraph (b) that requests an increase in state funding over the previous biennium must provide the following:\n(1) detailed information regarding the need for increased funds; and\n(2) the planned uses of the increased funds.",
	"repealed": false
}