{
	"id": "43A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.01",
	"title": "43A.01 POLICIES.",
	"text": "It is the policy of the state to maintain an efficient and effective merit based personnel management system to meet the management needs of the state and the social, economic and program needs of the people of the state. The system shall provide means to recruit, select and develop an effective, productive and responsive work force representative of the labor market according to the demands of society, equity and law, and shall include policies and procedures for employee hiring and advancement, training and career development, job classification, salary administration, employee benefits, discipline, discharge, retirement and other related activities as appropriate, taking into consideration formal and informal labor relations arrangements.\nIt is the policy of this state to provide for equal employment opportunity consistent with chapter 363A by ensuring that all personnel actions be based on the ability to perform the duties and responsibilities assigned to the position without regard to age, race, creed or religion, color, disability, sex, national origin, marital status, status with regard to public assistance, or political affiliation. It is the policy of this state to take affirmative action to eliminate the underutilization of qualified members of protected groups in the civil service, where such action is not in conflict with other provisions of this chapter or chapter 179, in order to correct imbalances and eliminate the effects of discrimination and support full and equal participation in the social and economic life in the state. Heads of departments and agencies must provide training to managers and supervisors that are responsible for hiring and evaluating employee performance regarding bias that can be present in the hiring and performance evaluation processes.\nNo contract executed pursuant to chapter 179A shall modify, waive or abridge this section and sections 43A.07 to 43A.121, 43A.15, and 43A.17 to 43A.21, except to the extent expressly permitted in those sections.\nIt is the policy of this state to attempt to establish equitable compensation relationships between female-dominated, male-dominated, and balanced classes of employees in the executive branch. Compensation relationships are equitable within the meaning of this subdivision when the primary consideration in negotiating, establishing, recommending, and approving total compensation is comparability of the value of the work in relationship to other positions in the executive branch.",
	"repealed": false
}