{
	"id": "204B.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.45",
	"title": "204B.45 MAIL BALLOTING.",
	"text": "A town of any size or a city having fewer than 400 registered voters on June 1 of an election year may provide balloting by mail at any municipal, county, or state election with no polling place other than the office of the auditor or clerk or other locations designated by the auditor or clerk. The governing body may apply to the county auditor for permission to conduct balloting by mail. The county board may provide for balloting by mail in unorganized territory. The governing body of any municipality may designate for mail balloting any precinct having fewer than 100 registered voters, subject to the approval of the county auditor.\nVoted ballots may be returned in person to any location designated by the county auditor or municipal clerk.\n[Repealed, 2000 c 467 s 35]\nNotice of the election and the special mail procedure must be given at least ten weeks prior to the election. Not more than 46 days nor later than 14 days before a regularly scheduled election and not more than 30 days nor later than 14 days before any other election, the auditor shall mail ballots by nonforwardable mail to all voters registered in the city, town, or unorganized territory. No later than 14 days before the election, the auditor must make a subsequent mailing of ballots to those voters who register to vote after the initial mailing but before the 20th day before the election. Eligible voters not registered at the time the ballots are mailed may apply for ballots as provided in chapter 203B. Ballot return envelopes, with return postage provided, must be preaddressed to the auditor or clerk and the voter may return the ballot by mail or in person to the office of the auditor or clerk. The auditor or clerk must appoint a ballot board to examine the mail and absentee ballot return envelopes and mark them \"accepted\" or \"rejected\" within three days of receipt if there are 14 or fewer days before election day, or within five days of receipt if there are more than 14 days before election day. The board may consist of deputy county auditors or deputy municipal clerks who have received training in the processing and counting of mail ballots, who need not be affiliated with a major political party. Election judges performing the duties in this section must be of different major political parties, unless they are exempt from that requirement under section 205.075, subdivision 4, or section 205A.10. If an envelope has been rejected at least five days before the election, the ballots in the envelope must remain sealed and the auditor or clerk shall provide the voter with a replacement ballot and return envelope in place of the spoiled ballot. If the ballot is rejected within five days of the election, the envelope must remain sealed and the official in charge of the ballot board must attempt to contact the voter by telephone or email to notify the voter that the voter's ballot has been rejected. The official must document the attempts made to contact the voter.\nIf the ballot is accepted, the county auditor or municipal clerk must mark the roster to indicate that the voter has already cast a ballot in that election. After the close of business on the 19th day before the election, the ballots from return envelopes marked \"Accepted\" may be opened, duplicated as needed in the manner provided by section 206.86, subdivision 5, initialed by the members of the ballot board, and deposited in the ballot box.\nIn all other respects, the provisions of the Minnesota Election Law governing deposit and counting of ballots apply.\nThe mail and absentee ballots for a precinct must be counted together and reported as one vote total. No vote totals from mail or absentee ballots may be made public before the close of voting on election day.\nThe costs of the mailing shall be paid by the election jurisdiction in which the voter maintains residence. Any ballot received by 8:00 p.m. on the day of the election must be counted.\n(a) The county auditor may make available a ballot counter and ballot box for use during voting hours on election day by the voters voting under this section. If a ballot counter and ballot box is provided on election day, a voter must be given the option to either:\n(1) vote using the procedures provided in subdivision 2; or\n(2) vote in the manner provided in this subdivision.\n(b) When a voter appears in the designated polling place, the voter must state the voter's name, address, and, if requested, the voter's date of birth to the mail ballot voting official. The mail ballot voting official must confirm that the voter's registration is current in the statewide voter registration system and that the voter has not already cast a ballot in the election. If the voter's status is challenged, the voter may resolve the challenge as provided in section 204C.12. An individual who is not registered to vote or whose name or address has changed must register in the manner provided in section 201.061, subdivision 3. A voter who has already cast a ballot in the election must not be provided with a ballot.\n(c) Each voter must sign the certification provided in section 204C.10. The signature of an individual on the voter's certificate and the issuance of a ballot to the individual is evidence of the intent of the individual to vote at that election. After signing the voter certification, two mail ballot voting officials must initial the ballot and issue it to the voter, and the voter must immediately retire to a voting station or other designated location in the polling place to mark the ballot. The voter must not take the ballot from the polling place. If the voter spoils the ballot, the voter may return it to the mail ballot voting official in exchange for a new ballot. After completing the ballot, the voter must deposit the ballot into the ballot counter and ballot box. The mail ballot voting official must immediately record that the voter has voted in the manner provided in section 203B.121, subdivision 3.\n(d) The mail ballot voting official must remove and secure the ballots following the procedures in section 203B.121, subdivision 5, paragraph (a). The ballot board must count the ballots after the polls have closed on election day following the procedures in section 203B.121, subdivision 5, paragraph (b).\n(e) For purposes of this subdivision, \"mail ballot voting official\" means the county auditor, the city clerk, a deputy of the auditor or clerk, or an election judge assigned by the auditor or clerk.\nThe Minnesota Election Law is applicable to mail balloting except as provided by this section or by rules adopted by the secretary of state, but only paper ballots may be used. The secretary of state shall adopt rules for the conduct of mail balloting, including instructions to voters, procedures for challenge of voters, public observation of the counting of ballots, and procedures for proper handling and safeguarding of ballots to ensure the integrity of the election.",
	"repealed": false
}