{
	"id": "245D.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.22",
	"title": "245D.22 FACILITY SANITATION AND HEALTH.",
	"text": "The license holder must maintain the interior and exterior of buildings, structures, or enclosures used by the facility, including walls, floors, ceilings, registers, fixtures, equipment, and furnishings in good repair and in a sanitary and safe condition. The facility must be clean and free from accumulations of dirt, grease, garbage, peeling paint, mold, vermin, and insects. The license holder must correct building and equipment deterioration, safety hazards, and unsanitary conditions.\n(a) The license holder must ensure that service sites owned or leased by the license holder are free from hazards that would threaten the health or safety of a person receiving services by ensuring the requirements in paragraphs (b) to (h) are met.\n(b) Chemicals, detergents, and other hazardous or toxic substances must not be stored with food products or in any way that poses a hazard to persons receiving services.\n(c) The license holder must install handrails and nonslip surfaces on interior and exterior runways, stairways, and ramps according to the applicable building code.\n(d) If there are elevators in the facility, the license holder must have elevators inspected each year. The date of the inspection, any repairs needed, and the date the necessary repairs were made must be documented.\n(e) The license holder must keep stairways, ramps, and corridors free of obstructions.\n(f) Outside property must be free from debris and safety hazards. Exterior stairs and walkways must be kept free of ice and snow.\n(g) Heating, ventilation, air conditioning units, and other hot surfaces and moving parts of machinery must be shielded or enclosed.\n(h) Use of dangerous items or equipment by persons served by the program must be allowed in accordance with the person's support plan addendum or the program abuse prevention plan, if not addressed in the support plan addendum.\nSchedule II controlled substances in the facility that are named in section 152.02, subdivision 3, must be stored in a locked storage area permitting access only by persons and staff authorized to administer the medication. This must be incorporated into the license holder's medication administration policy and procedures required under section 245D.11, subdivision 2, clause (3). Medications must be disposed of according to the Environmental Protection Agency recommendations.\n(a) A staff person trained in first aid must be available on site and, when required in a person's support plan or support plan addendum, be able to provide cardiopulmonary resuscitation, whenever persons are present and staff are required to be at the site to provide direct service. The CPR training must include instruction, hands-on practice, and an observed skills assessment under the direct supervision of a CPR instructor.\n(b) A facility must have first aid kits readily available for use by, and that meet the needs of, persons receiving services and staff. At a minimum, the first aid kit must be equipped with accessible first aid supplies including bandages, sterile compresses, scissors, an ice bag or cold pack, an oral or surface thermometer, mild liquid soap, adhesive tape, and first aid manual.\n(a) The license holder must have a written plan for responding to emergencies as defined in section 245D.02, subdivision 8, to ensure the safety of persons served in the facility. The plan must include:\n(1) procedures for emergency evacuation and emergency sheltering, including:\n(i) how to report a fire or other emergency;\n(ii) procedures to notify, relocate, and evacuate occupants, including use of adaptive procedures or equipment to assist with the safe evacuation of persons with physical or sensory disabilities; and\n(iii) instructions on closing off the fire area, using fire extinguishers, and activating and responding to alarm systems;\n(2) a floor plan that identifies:\n(i) the location of fire extinguishers;\n(ii) the location of audible or visual alarm systems, including but not limited to manual fire alarm boxes, smoke detectors, fire alarm enunciators and controls, and sprinkler systems;\n(iii) the location of exits, primary and secondary evacuation routes, and accessible egress routes, if any; and\n(iv) the location of emergency shelter within the facility;\n(3) a site plan that identifies:\n(i) designated assembly points outside the facility;\n(ii) the locations of fire hydrants; and\n(iii) the routes of fire department access;\n(4) the responsibilities each staff person must assume in case of emergency;\n(5) procedures for conducting quarterly drills each year and recording the date of each drill in the file of emergency plans;\n(6) procedures for relocation or service suspension when services are interrupted for more than 24 hours;\n(7) for a community residential setting with three or more dwelling units, a floor plan that identifies the location of enclosed exit stairs; and\n(8) an emergency escape plan for each resident.\n(b) The license holder must:\n(1) maintain a log of quarterly fire drills on file in the facility;\n(2) provide an emergency response plan that is readily available to staff and persons receiving services;\n(3) inform each person of a designated area within the facility where the person should go for emergency shelter during severe weather and the designated assembly points outside the facility; and\n(4) maintain emergency contact information for persons served at the facility that can be readily accessed in an emergency.\nThe facility must have a flashlight and a portable radio or television set that do not require electricity and can be used if a power failure occurs.\nA facility must have a non-coin-operated telephone that is readily accessible. A list of emergency numbers must be posted in a prominent location. When an area has a 911 number or a mental health crisis intervention team number, both numbers must be posted and the emergency number listed must be 911. In areas of the state without a 911 number, the numbers listed must be those of the local fire department, police department, emergency transportation, and poison control center. The names and telephone numbers of each person's representative; physician, advanced practice registered nurse, or physician assistant; and dentist must be readily available.",
	"repealed": false
}