{
	"id": "60B.335",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.335",
	"title": "60B.335 FEDERAL HOME LOAN BANK RIGHTS; COLLATERAL PLEDGED BY INSURER-MEMBERS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Federal home loan bank\" means a federal home loan bank established under the federal Home Loan Bank Act, United States Code, title 12, section 1421 et seq.\n(c) \"Insurer-member\" means an insurer that is a member of a federal home loan bank.\n(a) Notwithstanding any law to the contrary, after the seventh day following the filing of a delinquency proceeding, a federal home loan bank must not be stayed or prohibited from exercising the federal home loan bank's rights regarding collateral pledged by an insurer-member.\n(b) If a federal home loan bank exercises rights regarding collateral pledged by an insurer-member subject to a delinquency proceeding, the federal home loan bank must repurchase any outstanding capital stock that is in excess of the amount of federal home loan bank stock that the insurer-member is required to hold as a minimum investment, to the extent the federal home loan bank determines in good faith that the repurchase is: (1) permissible under applicable laws, regulations, regulatory obligations, and the federal home loan bank's capital plan; and (2) consistent with the federal home loan bank's current capital stock practices applicable to the federal home loan bank's entire membership.\nFollowing the appointment of a receiver for an insurer-member, the federal home loan bank must, within ten business days after the date a request is received from the receiver, provide a process and establish a timeline for:\n(1) release of collateral that exceeds the amount required to support secured obligations remaining after any repayment of loans, as determined in accordance with the applicable agreements between the federal home loan bank and the insurer-member;\n(2) release of any of the insurer-member's collateral remaining in the federal home loan bank's possession following repayment in full of the insurer-member's outstanding secured obligations;\n(3) payment of fees owed by the insurer-member and the operation of the insurer-member's deposits and other accounts with the federal home loan bank; and\n(4) possible redemption or repurchase of federal home loan bank stock or excess stock of any class that an insurer-member is required to own.\nUpon request from a receiver, the federal home loan bank must provide the options available for an insurer-member subject to a delinquency proceeding to renew or restructure a loan to defer associated prepayment fees, subject to: (1) market conditions; (2) the terms of any loans outstanding to the insurer-member; (3) the federal home loan bank's applicable policies; and (4) the federal home loan bank's compliance with federal laws and regulations.\n(a) Notwithstanding any law to the contrary, the receiver for an insurer-member is prohibited from voiding any transfer of, or any obligation to transfer, money or any other property arising under or in connection with: (1) any federal home loan bank security agreement; (2) any pledge, security, collateral, or guarantee agreement; or (3) any other similar arrangement or credit enhancement relating to a federal home loan bank security agreement made in the ordinary course of business and in compliance with the applicable federal home loan bank agreement.\n(b) A transfer may be voided under this section if the transfer was made with intent to hinder, delay, or defraud the insurer-member, the receiver for the insurer-member, or existing or future creditors.\n(c) This section does not affect a receiver's rights regarding advances to an insurer-member in delinquency proceedings pursuant to Code of Federal Regulations, title 12, part 1266.4.",
	"repealed": false
}