{
	"id": "383A.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.43",
	"title": "383A.43 LEGISLATIVE RESEARCH COMMITTEE.",
	"text": "In Ramsey County, there is created a Legislative Research Committee. The committee consists of all the legislative members in the county.\nThe committee may investigate and study, accumulate, compile, analyze and report on information concerning policies, plans, programs and procedures relating to or affecting the fiscal and legislative needs of the county and the governmental or political subdivisions therein, including school districts and any metropolitan or district authority having jurisdiction in an area of the county. The prime motive of the committee is to gather information and provide material to be used by the delegation in the legislature from the county in its work while the legislature is in session and in connection with legislative proposals affecting the county and local subdivisions.\nThe committee may assign the research director and staff to the house of representatives and senate delegations from the county in the legislature during each regular legislative session to explain the work of the committee and develop additional data with reference thereto. Each department, board, commission, agency, officer and employee in the county government and those in local government in the county, including school districts and metropolitan or district authorities having jurisdiction over an area of the county shall furnish the information and render the assistance to the committee that it, from time to time, requests.\nThe committee or a subcommittee that it appoints may sit at the time and place as it considers advisable but the committee shall meet at least once in each quarter and shall meet at any time upon the call of the chair. At a meeting of the committee eight members constitute a quorum and a majority of the quorum may act in a matter falling within the jurisdiction of the committee.\nThe committee shall select a chair and a vice-chair from its own members and may prescribe its own rules of procedure. It may appoint a secretary who need not be a member. The committee may employ the other persons and obtain the assistance of research agencies that it considers necessary.\nThe committee shall keep minutes of its meetings which are open to the public. At least 30 days before each biennial legislative session, the committee shall make a written report summarizing its activities, investigations, surveys and findings of facts to the public.\nThe committee may require that suggested legislation to be presented by a department, board, commission, agency, officer, official or employee of the county and its local subdivisions, desiring the consideration of the committee, be presented to it at least 60 days before a regular session.\nThe members of the committee and the members of a committee appointed as a subcommittee are entitled to be compensated for their expenses necessarily incurred in attending meetings and in the performance of their official duties and shall be paid mileage at the rate of ten cents for each mile necessarily traveled in attending meetings and in the performance of these duties.\nThe county shall appropriate $5,000 each year from the county general revenue fund for the use of the committee. For the payment of the expenses of the committee, it shall draw its warrants upon the county treasurer. These warrants shall be signed by the chair and one other member of the committee and approved by the county auditor. The county treasurer shall pay them as and when presented but not exceeding in the aggregate the amount herein provided in any one year.",
	"repealed": false
}