{
	"id": "124D.861",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.861",
	"title": "124D.861 ACHIEVEMENT AND INTEGRATION FOR MINNESOTA.",
	"text": "(a) The \"Achievement and Integration for Minnesota\" program is established to pursue racial and economic integration and increase student academic achievement, create equitable educational opportunities, and reduce academic disparities based on students' diverse racial, ethnic, and economic backgrounds in Minnesota public schools.\n(b) For purposes of this section and section 124D.862, \"eligible district\" means a district required to submit a plan to the commissioner under Minnesota Rules governing school desegregation and integration, or be a member of a multidistrict integration collaborative that files a plan with the commissioner.\n(c) Eligible districts must use the revenue under section 124D.862 to pursue academic achievement and racial and economic integration through:\n(1) integrated learning environments that give students improved and equitable access to effective and more diverse teachers, prepare all students to be effective citizens, and enhance social cohesion;\n(2) policies and curricula and trained instructors, administrators, school counselors, and other advocates to support and enhance integrated learning environments under this section, including through magnet schools, innovative, research-based instruction, differentiated instruction, improved and equitable access to effective and diverse teachers, and targeted interventions to improve achievement; and\n(3) rigorous career and college readiness programs and effective and more diverse instructors for underserved student populations, consistent with section 120B.307; integrated learning environments to increase student academic achievement; cultural fluency, competency, and interaction; graduation and educational attainment rates; and parent involvement.\n(d) Consistent with paragraph (c), eligible districts may adopt policies to increase the diversity of district teachers and administrators using the revenue under section 124D.862 for recruitment, retention, and hiring incentives or additional compensation.\n(a) The school board of each eligible district must formally develop and implement a long-term plan under this section. The plan must be incorporated into the district's comprehensive strategic plan under section 120B.11.\n(b) The plan must contain goals for:\n(1) reducing the disparities in academic achievement and in equitable access to effective and more diverse teachers among all students and specific categories of students under section 120B.35, subdivision 3, paragraph (b), excluding the student categories of gender, disability, and English learners; and\n(2) increasing racial and economic diversity and integration in schools and districts.\n(c) The plan must include strategies to validate, affirm, embrace, and integrate cultural and community strengths of all students, families, and employees in the district's curriculum as well as learning and work environments. The plan must address issues of institutional racism as defined in section 120B.11, subdivision 1, in schools that create opportunity and achievement gaps for students, families, and staff who are of color or who are American Indian. Examples of institutional racism experienced by students who are of color or who are American Indian include policies and practices that intentionally or unintentionally result in disparate discipline referrals and suspension, inequitable access to advanced coursework, overrepresentation in lower-level coursework, inequitable participation in cocurricular activities, inequitable parent involvement, and lack of equitable access to racially and ethnically diverse teachers who reflect the racial or ethnic diversity of students because it has not been a priority to hire or retain such teachers.\n(d) School districts must use local data, to the extent practicable, to develop plan components and strategies. Plans may include:\n(1) innovative and integrated prekindergarten through grade 12 learning environments that offer students school enrollment choices;\n(2) family engagement initiatives that involve families in their students' academic life and success and improve relations between home and school;\n(3) opportunities for students, families, staff, and community members who are of color or American Indian to share their experiences in the school setting with school staff and administration and to inform the development of specific proposals for making school environments more validating, affirming, embracing, and integrating of their cultural and community strengths;\n(4) professional development opportunities for teachers and administrators focused on improving the academic achievement of all students, including knowledge, skills, and dispositions needed to be antiracist and culturally sustaining as defined in section 120B.11, subdivision 1, for serving students who are from racially and ethnically diverse backgrounds;\n(5) recruitment and retention of teachers, administrators, cultural and family liaisons, paraprofessionals, and other staff from racial, ethnic, and linguistic backgrounds represented in the student population to strengthen relationships with all students, families, and other members of the community;\n(6) collection, examination, and evaluation of academic and discipline data for institutional racism as defined in section 120B.11, subdivision 1, in structures, policies, and practices that result in the education disparities, in order to propose antiracist changes as defined in section 120B.11, subdivision 1, that increase access, meaningful participation, representation, and positive outcomes for students of color and American Indian students;\n(7) increased programmatic opportunities and effective and more diverse instructors focused on rigor and college and career readiness for students who are impacted by racial, gender, linguistic, and economic disparities, including students enrolled in area learning centers or alternative learning programs under section 123A.05, state-approved alternative programs under section 126C.05, subdivision 15, and contract alternative programs under section 124D.69, among other underserved students;\n(8) instruction in ethnic studies, as defined in section 120B.25, to provide all students with opportunities to learn about their own and others' cultures and historical experiences; or\n(9) examination and revision of district curricula in all subjects to be inclusive of diverse racial and ethnic groups while meeting state academic standards and being culturally sustaining as defined in section 120B.11, subdivision 1, ensuring content being studied about any group is accurate and based in knowledge from that group.\n(e) Among other requirements, an eligible district must implement effective, research-based interventions that include multiple measures of assessment and engagement in order to eliminate academic disparities for students impacted by racial, gender, linguistic, and economic inequities as aligned with section 120B.11.\n(f) Eligible districts must create efficiencies and eliminate duplicative programs and services under this section, which may include forming collaborations or a single, seven-county metropolitan areawide partnership of eligible districts for this purpose.\n(a) To receive revenue under section 124D.862, the school board of an eligible district must incorporate school and district plan components under section 120B.11 into the district's comprehensive integration plan.\n(b) A school board must hold at least one formal annual hearing to publicly report its progress in realizing the goals identified in its plan. At the hearing, the board must provide the public with longitudinal data demonstrating district and school progress in reducing the disparities in student academic performance among the specified categories of students, in improving students' equitable access to effective and more diverse teachers, and in realizing racial and economic diversity and integration, consistent with the district plan and the measures in paragraph (a). At least 30 days before the formal hearing under this paragraph, the board must post its plan, its preliminary analysis, relevant student performance data, and other longitudinal data on the district's website. A district must hold one hearing to meet the hearing requirements of both this section and section 120B.11.\n(c) The district must submit a detailed budget to the commissioner by March 15 in the year before it implements its plan. The commissioner must review, and approve or disapprove the district's budget by June 1 of that year.\n(d) The longitudinal data required under paragraph (b) must be based on student growth and progress in reading and mathematics, as defined under section 120B.303, and student performance data and achievement reports from fully adaptive reading and mathematics assessments for grades 3 through 7 beginning in the 2015-2016 school year under section 120B.302, and either (i) school enrollment choices, (ii) the number of world language proficiency or high achievement certificates awarded under section 120B.022, subdivision 1a, or the number of state bilingual and multilingual seals issued under section 120B.022, subdivision 1b, or (iii) school safety and students' engagement and connection at school under section 120B.35, subdivision 3, paragraph (d). Additional longitudinal data may be based on: students' progress toward career and college readiness under section 120B.307; or rigorous coursework completed under section 120B.35, subdivision 3, paragraph (c), clause (2).\nA board must approve its plan and submit it to the department by March 15. If a district that is part of a multidistrict council applies for revenue for a plan, the individual district shall not receive revenue unless it ratifies the plan adopted by the multidistrict council. Each plan has a term of three years. For the 2014-2015 school year, an eligible district under this section must submit its plan to the commissioner for review by March 15, 2014. For the 2013-2014 school year only, an eligible district may continue to implement its current plan until the commissioner approves a new plan under this section.\nThe commissioner must evaluate the efficacy of district plans in reducing the disparities in student academic performance among the specified categories of students within the district, improving students' equitable access to effective and diverse teachers, and in realizing racial and economic diversity and integration. The commissioner shall report evaluation results to the kindergarten through grade 12 education committees of the legislature by February 1 of every odd-numbered year.",
	"repealed": false
}