{
	"id": "256R.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.08",
	"title": "256R.08 REPORTING OF FINANCIAL STATEMENTS.",
	"text": "(a) No later than February 1 of each year, a nursing facility must:\n(1) provide the state agency with a copy of its working trial balance;\n(2) provide the state agency with a copy of its audited financial statements for each year an audit is conducted;\n(3) provide the state agency with a statement of ownership for the facility;\n(4) provide the state agency with separate, audited financial statements and working trial balances for every other facility owned in whole or in part by an individual or entity that has an ownership interest in the facility;\n(5) provide the state agency with information regarding whether the licensee or a general partner, director, or officer of the licensee controls or has an ownership interest of five percent or more in a related organization that provides any services, facilities, or supplies to the nursing facility;\n(6) upon request, provide the state agency with separate, audited financial statements and working trial balances for every organization with which the facility conducts business and which is owned in whole or in part by an individual or entity which has an ownership interest in the facility;\n(7) provide the state agency with copies of leases, purchase agreements, and other documents related to the lease or purchase of the nursing facility; and\n(8) upon request, provide the state agency with copies of leases, purchase agreements, and other documents related to the acquisition of equipment, goods, and services which are claimed as allowable costs.\n(b) If the licensee or the general partner, director, or officer of the licensee controls or has an interest as described in paragraph (a), clause (5), the licensee must disclose all services, facilities, or supplies provided to the nursing facility; the number of individuals who provide services, facilities, or supplies at the nursing facility; and any other information requested by the state agency.\n(c) Audited financial statements submitted under paragraphs (a) and (b) must include a balance sheet, income statement, statement of the rate or rates charged to private paying residents, statement of retained earnings, statement of cash flows, notes to the financial statements, audited applicable supplemental information, and the public accountant's report. Public accountants must conduct audits in accordance with chapter 326A. The cost of an audit must not be an allowable cost unless the nursing facility submits its audited financial statements in the manner otherwise specified in this subdivision. A nursing facility must permit access by the state agency to the public accountant's audit work papers that support the audited financial statements submitted under paragraphs (a) and (b).\n(d) Documents or information provided to the state agency pursuant to this subdivision must be public unless prohibited by the Health Insurance Portability and Accountability Act or any other federal or state regulation. Data, notes, and preliminary drafts of reports created, collected, and maintained by the audit offices of government entities, or persons performing audits for government entities, and relating to an audit or investigation are confidential data on individuals or protected nonpublic data until the final report has been published or the audit or investigation is no longer being pursued actively, except that the data must be disclosed as required to comply with section 6.67 or 609.456.\n(e) If the requirements of paragraphs (a), (b), and (c) are not met, the reimbursement rate may be reduced to 80 percent of the rate in effect on the first day of the fourth calendar month after the close of the reporting period and the reduction must continue until the requirements are met.\n(f) Licensees must provide the information required in this section to the commissioner in a manner prescribed by the commissioner.\n(g) For purposes of this section, \"related organization\" and \"control\" have the meanings given in section 256R.02, subdivision 43.\nMS 2020 [Repealed, 2022 c 98 art 7 s 32]\nIf a nursing facility knowingly supplies inaccurate or false information in a required report that results in an overpayment, the commissioner shall:\n(1) immediately adjust the nursing facility's payment rate to recover the entire overpayment within the rate year;\n(2) terminate the commissioner's agreement with the nursing facility;\n(3) prosecute under applicable state or federal law; or\n(4) use any combination of the foregoing actions.\nA nursing facility that violates this section is subject to section 256R.04, subdivisions 7 and 8.\n(a) Nursing homes must annually report to the commissioner, in a manner determined by the commissioner, their cost associated with leases, rent, and use of land or other real property and any other related information requested by the state agency.\n(b) A nursing facility that violates this subdivision is subject to the penalties and procedures under section 256R.04, subdivision 7.",
	"repealed": false
}