{
	"id": "122A.183",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.183",
	"title": "122A.183 TIER 3 LICENSE.",
	"text": "(a) The Professional Educator Licensing and Standards Board must issue a Tier 3 license to an applicant who provides information sufficient to demonstrate all of the following:\n(1) the applicant has obtained a passing score on the required licensure exams under section 122A.185;\n(2) the applicant holds a bachelor's degree, unless specifically exempt by statute or rule; and\n(3) the applicant has completed the coursework required under subdivision 2.\n(b) The board must issue a Tier 3 license to an applicant who:\n(1) has completed student teaching comparable to the student teaching expectations in Minnesota;\n(2) has obtained a passing score on the required licensure exams under section 122A.185; and\n(3) has completed either:\n(i) a teacher preparation program from a culturally specific Minority Serving Institution in the United States, such as Historically Black Colleges and Universities, Tribal Colleges and Universities, or Hispanic-Serving Institutions, including those in Puerto Rico; or\n(ii) a university teacher preparation program in another country.\nAn applicant for a Tier 3 license must meet the coursework requirement by demonstrating one of the following:\n(1) completion of a Minnesota-approved teacher preparation program;\n(2) completion of a state-approved teacher preparation program that includes field-specific student teaching equivalent to field-specific student teaching in Minnesota-approved teacher preparation programs. The field-specific student teaching requirement does not apply to an applicant that has two years of field-specific teaching experience;\n(3) a recommendation for licensure through the licensure via portfolio process;\n(4) a professional teaching license from another state, evidence that the applicant's license is in good standing, and two years of field-specific teaching experience; or\n(5) three years of teaching experience under a Tier 2 license and evidence of summative teacher evaluations that did not result in placing or otherwise keeping the teacher on an improvement process pursuant to section 122A.40, subdivision 8, or 122A.41, subdivision 5.\n(a) The following applicants for a Tier 3 license are exempt from the requirement to hold a bachelor's degree in subdivision 1:\n(1) an applicant for a Tier 3 license to teach career and technical education or career pathways courses of study when the applicant has:\n(i) an associate's degree;\n(ii) a professional certification; or\n(iii) five years of relevant work experience;\n(2) an applicant for a Tier 3 license to teach world languages and culture pursuant to Minnesota Rules, part 8710.4950, when the applicant is a native speaker of the language; and\n(3) an applicant for a Tier 3 license in the performing or visual arts pursuant to Minnesota Rules, parts 8710.4300, dance and theatre; 8710.4310, dance; 8710.4320, theatre; 8710.4650, vocal music and instrumental music; and 8710.4900, visual arts, when the applicant has at least five years of relevant work experience.\n(b) The Professional Educator Licensing and Standards Board must adopt rules regarding the qualifications and determinations for applicants exempt from the requirement to hold a bachelor's degree in subdivision 1.\nThe Professional Educator Licensing and Standards Board must issue an initial Tier 3 license for a term of three years. A Tier 3 license may be renewed every three years without limitation.\nA teacher holding a Tier 3 license must participate in the employing district or charter school's mentorship and evaluation program, including an individual growth and development plan.",
	"repealed": false
}