{
	"id": "156.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.12",
	"title": "156.12 PRACTICE OF VETERINARY MEDICINE.",
	"text": "The practice of veterinary medicine, as used in this chapter, shall mean the diagnosis, treatment, correction, relief, or prevention of animal disease, deformity, defect, injury, or other physical or mental conditions; the performance of obstetrical procedures for animals, including determination of pregnancy and correction of sterility or infertility; and the rendering of advice or recommendations with regard to any of the above. The practice of veterinary medicine shall include but not be limited to the prescription or administration of any drug, medicine, biologic, apparatus, application, anesthetic, or other therapeutic or diagnostic substance or technique. The practice shall not be construed to include the dehorning of cattle and goats or the castration of cattle, swine, goats, and sheep, or the docking of sheep.\nNo provision of this chapter shall be construed to prohibit:\n(a) a person from rendering necessary gratuitous assistance in the treatment of any animal when the assistance does not amount to prescribing, testing for, or diagnosing, operating, or vaccinating and when the attendance of a licensed veterinarian cannot be procured;\n(b) a person who is a regular student in an accredited or approved college of veterinary medicine from performing duties or actions assigned by instructors or preceptors or working under the direct supervision of a licensed veterinarian;\n(c) a veterinarian regularly licensed in another jurisdiction from consulting with a licensed veterinarian in this state;\n(d) the owner of an animal and the owner's regular employee from caring for and administering to the animal belonging to the owner, except where the ownership of the animal was transferred for purposes of circumventing this chapter;\n(e) veterinarians who are in compliance with section 156.0721 and who are employed by the University of Minnesota from performing their duties with the College of Veterinary Medicine, Veterinary Diagnostic Laboratory, Agricultural Experiment Station, Agricultural Extension Service, Medical School, School of Public Health, School of Nursing, or other unit within the university; or a person from lecturing or giving instructions or demonstrations at the university or in connection with a continuing education course or seminar to veterinarians;\n(f) any person from selling or applying any pesticide, insecticide or herbicide;\n(g) any person from engaging in bona fide scientific research or investigations which reasonably requires experimentation involving animals;\n(h) any employee of a licensed veterinarian from performing duties other than diagnosis, prescription or surgical correction under the direction and supervision of the veterinarian, who shall be responsible for the performance of the employee;\n(i) a graduate of a foreign college of veterinary medicine from working under the direct personal instruction, control, or supervision of a veterinarian faculty member of the College of Veterinary Medicine, University of Minnesota in order to complete the requirements necessary to obtain an ECFVG or PAVE certificate;\n(j) a licensed chiropractor registered under section 148.01, subdivision 1a, from practicing animal chiropractic; or\n(k) a person certified by the director of the Office of Emergency Medical Services under chapter 144E from providing emergency medical care to a police dog wounded in the line of duty.\n[See Note.]\nAny person who sells or offers to apply, any prescription drug, biologic preparation, including sera, vaccines, bacterins, tuberculin, mallein, johnin, or any other agent for the treatment, vaccination, or testing of any animal belonging to another, shall be engaged in the practice of veterinary medicine.\nIt is unlawful for a person who has not received a professional degree from an accredited or approved college of veterinary medicine, ECFVG or PAVE certification, or an institutional license under section 156.0721 to use any of the following titles or designations: Veterinary, veterinarian, animal doctor, animal surgeon, animal dentist, animal chiropractor, animal acupuncturist, or any other title, designation, word, letter, abbreviation, sign, card, or device tending to indicate that the person is qualified to practice veterinary medicine.\n[See Note.]\n[Repealed, 1996 c 415 s 33]\nMS 2022 [Repealed, 2024 c 127 art 20 s 12]",
	"repealed": false
}