{
	"id": "211B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.04",
	"title": "211B.04 CAMPAIGN MATERIAL MUST INCLUDE DISCLAIMER.",
	"text": "(a) A person who participates in the preparation or dissemination of campaign material other than as provided in section 211B.05, subdivision 1, that does not prominently include the name and address of the person or committee causing the material to be prepared or disseminated in a disclaimer substantially in the form provided in paragraph (b) or (c) is guilty of a misdemeanor.\n(b) Except in cases covered by paragraph (c), the required form of disclaimer is: \"Prepared and paid for by the ....... committee, ....... (address)\" for material prepared and paid for by a principal campaign committee, or \"Prepared and paid for by the ....... committee, ....... (address)\" for material prepared and paid for by a person or committee other than a principal campaign committee. The address must be either the committee's mailing address or the committee's website, if the website includes the committee's mailing address. If the material is produced and disseminated without cost, the words \"paid for\" may be omitted from the disclaimer.\n(c) In the case of broadcast media, the required form of disclaimer is: \"Paid for by the ....... committee.\" If the material is produced and broadcast without cost, the required form of the disclaimer is: \"The ....... committee is responsible for the content of this message.\"\n(a) The required form of the disclaimer on a written independent expenditure is: \"This is an independent expenditure prepared and paid for by ....... (name of entity participating in the expenditure), ....... (address). It is not coordinated with or approved by any candidate nor is any candidate responsible for it.\" The address must be either the entity's mailing address or the entity's website, if the website includes the entity's mailing address. When a written independent expenditure is produced and disseminated without cost, the words \"and paid for\" may be omitted from the disclaimer.\n(b) The required form of the disclaimer on a broadcast independent expenditure is: \"This independent expenditure is paid for by ....... (name of entity participating in the expenditure). It is not coordinated with or approved by any candidate nor is any candidate responsible for it.\" When a broadcast independent expenditure is produced and disseminated without cost, the following disclaimer may be used: \"....... (name of entity participating in the expenditure) is responsible for the contents of this independent expenditure. It is not coordinated with or approved by any candidate nor is any candidate responsible for it.\"\n(a) This section does not apply to fundraising tickets, business cards, personal letters, or similar items that are clearly being distributed by the candidate.\n(b) This section does not apply to an individual or association that is not required to register or report under chapter 10A or 211A.\n(c) This section does not apply to the following:\n(1) bumper stickers, pins, buttons, pens, or similar small items on which the disclaimer cannot be conveniently printed;\n(2) skywriting, wearing apparel, or other means of displaying an advertisement of such a nature that the inclusion of a disclaimer would be impracticable; and\n(3) online banner ads and similar electronic communications that link directly to an online page that includes the disclaimer.\n(d) This section does not modify or repeal section 211B.06.\nThe requirements of this section are satisfied for an entire website or social media page when the disclaimer required in subdivision 1 or 2 appears once on the home page of the site.\nFor written communications other than an outdoor sign, website, or social media page, the disclaimer must be printed in 8-point font or larger.",
	"repealed": false
}