{
	"id": "256M.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/256M.30",
	"title": "256M.30 SERVICE PLAN.",
	"text": "Effective January 1, 2012, each county must have a service plan approved by the commissioner in order to receive funds. Counties may submit multicounty or regional service plans. Plans must be updated as needed to reflect current county policy and procedures regarding requirements and use of funds under this chapter.\nThe service plan shall be completed in a form prescribed by the commissioner. The plan must include:\n(1) a statement of the needs of the vulnerable children and adults who experience the conditions defined in section 256M.10, subdivision 2, paragraph (a), and strengths and resources available in the community to address those needs;\n(2) strategies the county will pursue to achieve the performance targets. Strategies must include specification of how funds under this section and other community resources will be used to achieve desired performance targets;\n(3) a description of the county's process to solicit public input and a summary of that input;\n(4) performance targets on statewide indicators for each county to measure outcomes of vulnerable children and adult's safety, permanency, and well-being. The commissioner shall consult with counties and other stakeholders to develop these indicators and collect baseline data to inform the establishment of individual county performance targets for the 2012-2013 biennium and subsequent years; and\n(5) a budget for services to be provided with funds under this section.\n[Repealed by amendment, 1Sp2011 c 9 art 1 s 25]\nThe commissioner shall provide each county with information and technical assistance needed to complete the service plan, including: information on child and adult safety, permanency, and well-being in the county; comparisons with other counties; baseline performance on outcome measures; and promising program practices.\nThe service plan must be submitted to the commissioner by October 15, 2011.\nThe county board must determine how citizens in the county will participate in the development of the service plan and provide opportunities for such participation. The county must allow a period of no less than 30 days prior to the submission of the plan to the commissioner to solicit comments from the public on the contents of the plan.\nThe commissioner must inform the county if the service plan has been approved. If the service plan is not approved, the commissioner must inform the county of any revisions needed for approval.",
	"repealed": false
}