{
	"id": "174.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.51",
	"title": "174.51 MINNESOTA STATE TRANSPORTATION BONDS.",
	"text": "For the purpose of providing money appropriated to agencies or subdivisions of the state from the Minnesota state transportation fund for the acquisition and betterment of public land, buildings, and capital improvements needed for the development of the state transportation system, when such appropriations or loans are authorized by Laws 1976, chapter 339, section 3 or another law and funds therefor are requested by the governor, the commissioner of management and budget shall sell and issue bonds of the state of Minnesota for the prompt and full payment of which, with interest thereon, the full faith and credit and taxing powers of the state are irrevocably pledged. Bonds shall be issued pursuant to this section only as authorized by a law specifying the purpose thereof and the maximum amount of the proceeds authorized to be expended for that purpose. Any such law, together with this section, constitutes complete authority for the issue, and such bonds shall not be subject to restrictions or limitations contained in any other law.\nThe bonds shall be sold upon sealed bids and upon notice, at a price, in form and denominations, bearing interest at a rate or rates, maturing in amounts and on dates, without option of prior redemption or subject to prepayment upon notice and at times and prices, payable at a bank or banks within or outside the state, with or without provisions for registration, conversion, exchange, and issuance of temporary bonds or notes in anticipation of the sale or delivery of definitive bonds, and in accordance with further provisions, as the commissioner of management and budget shall determine subject to the approval of the attorney general, but not subject to the provisions of chapter 14, including section 14.386. Each bond shall mature within 20 years from its date of issue and shall be executed by the commissioner of management and budget under official seal. The signature on the bonds and on any interest coupons and the seal may be printed or otherwise reproduced, except that each bond shall be authenticated by the manual signature on its face of the commissioner of management and budget or of a person authorized to sign on behalf of a bank designated by the commissioner as registrar or other authenticating agent. The commissioner of management and budget shall ascertain and certify to the purchasers of the bonds the performance and existence of all acts, conditions, and things necessary to make them valid and binding general obligations of the state of Minnesota, subject to the approval of the attorney general.\nAll expenses incidental to the sale, printing, execution, and delivery of bonds pursuant to this section, including but not limited to actual and necessary travel and subsistence expenses of state officers and employees for such purposes, shall be paid from the Minnesota state transportation fund and the amounts necessary therefor are appropriated from that fund.\nThe commissioner of management and budget shall maintain in the state bond fund a separate bookkeeping account designated as the Minnesota state transportation bond account, to record receipts and disbursements of money transferred to the fund to pay Minnesota state transportation bonds and interest thereon, and of income from the investment of such money, which income shall be credited to the account in each fiscal year in an amount equal to the approximate average rate of return that year on all funds invested by the commissioner of management and budget, as determined by the commissioner of management and budget, times the average balance in the account that year.\nThe premium and accrued interest received on each issue of Minnesota state transportation bonds shall be credited to the bond account. There shall also be credited to the bond account from the general fund in the state treasury, on November 1 in each year, a sum of money equal to the amount of the tax which article XI of the constitution would otherwise require to be levied for collection in the following year, to increase the balance in the account to an amount sufficient to pay principal and interest due and to become due with respect to Minnesota state transportation bonds. All money so credited and all income from the investment thereof is annually appropriated to the bond account for the payment of such bonds and interest thereon, and shall be available in the bond account prior to the levy of a tax for the state bond fund in any year as required by article XI of the constitution. No money shall be transferred to the Minnesota state transportation bond account from the highway user tax distribution fund or any other fund created by article XIV of the constitution. The commissioner of management and budget is directed to make the appropriate entries in the accounts of the respective funds.\nOn or before December 1 in each year, if the full amount appropriated to the bond account in subdivision 5 has not been credited thereto, the tax required by article XI of the constitution shall be levied upon all taxable property within the state. This tax shall be subject to no limitation of rate or amount until all Minnesota state transportation bonds and interest thereon are fully paid. The proceeds of this tax are appropriated and shall be credited to the state bond fund, and the principal of and interest on the bonds are payable from such proceeds, and the whole thereof, or so much as may be necessary, is appropriated for such payments. If at any time there is not sufficient money from the proceeds of such taxes to pay the principal and interest when due on Minnesota state transportation bonds, such principal and interest shall be paid out of the general fund in the state treasury, and the amount necessary therefor is hereby appropriated.",
	"repealed": false
}