{
	"id": "442A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.17",
	"title": "442A.17 SPECIFIC PURPOSES AND POWERS.",
	"text": "A district may construct, install, improve, maintain, and operate any system, works, or facilities within or without the district required to control and prevent pollution of any waters of the state within its territory.\nA district may construct, install, improve, maintain, and operate any system, works, or facilities within or without the district required to provide for, regulate, and control the disposal of sewage, industrial waste, and other waste originating within its territory. The district may require any person upon whose premises there is any source of sewage, industrial waste, or other waste within the district to connect the premises with the disposal system, works, or facilities of the district whenever reasonable opportunity therefor is provided.\nA district may construct, install, improve, maintain, and operate any system, works, or facilities within or without the district required to provide for, regulate, and control the disposal of garbage or refuse originating within the district. The district may require any person upon whose premises any garbage or refuse is produced or accumulated to dispose of the garbage or refuse through the system, works, or facilities of the district whenever reasonable opportunity therefor is provided.\nA district may procure supplies of water necessary for any purpose under subdivisions 1 to 3 and may construct, install, improve, maintain, and operate any system, works, or facilities required therefor within or without the district.\n(a) To maintain the integrity of and facilitate access to district systems, works, or facilities, the district may maintain and repair a road by agreement with the entity that was responsible for the performance of maintenance and repair immediately prior to the agreement. Maintenance and repair includes but is not limited to providing lighting, snow removal, and grass mowing.\n(b) A district shall establish a taxing subdistrict of benefited property and shall levy special taxes, pursuant to section 442A.24, subdivision 2, for the purposes of paying the cost of improvement or maintenance of a road under paragraph (a).\n(c) For purposes of this subdivision, a district shall not be construed as a road authority under chapter 160.\n(d) The district and its officers and employees are exempt from liability for any tort claim for injury to person or property arising from travel on a road maintained by the district and related to the road's maintenance or condition.",
	"repealed": false
}