{
	"id": "205A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/205A.05",
	"title": "205A.05 SPECIAL ELECTIONS.",
	"text": "Special elections must be held for a school district on a question on which the voters are authorized by law to pass judgment. The school board may on its own motion call a special election to vote on any matter requiring approval of the voters of a district. Upon petition filed with the school board of 50 or more voters of the school district or five percent of the number of voters voting at the preceding school district general election, whichever is greater, the school board shall by resolution call a special election to vote on any matter requiring approval of the voters of a district. A question is carried only with the majority in its favor required by law. The election officials for a special election are the same as for the most recent school district general election unless changed according to law. Otherwise, special elections must be conducted and the returns made in the manner provided for the school district general election.\n(a) Except as allowed in paragraph (b), a special election held in a school district must be held on one of the following dates: the second Tuesday in February, the second Tuesday in April, the second Tuesday in May, the second Tuesday in August, or the first Tuesday after the first Monday in November.\n(b) A special election may be held on a date other than those designated in paragraph (a) if the special election is held in response to an emergency or disaster. \"Emergency\" means an unforeseen combination of circumstances that calls for immediate action to prevent a disaster from developing or occurring. \"Disaster\" means a situation that creates an actual or imminent serious threat to the health and safety of persons or a situation that has resulted or is likely to result in catastrophic loss to property or the environment.\nSpecial elections to fill vacancies in elective school district offices shall be held in school districts pursuant to section 123B.09, subdivision 5b. When more than one vacancy exists in an office elected at-large, voters must be instructed to vote for up to the number of vacancies to be filled.\nA special election ordered by the school board on its own motion under subdivision 1 may be canceled by motion of the school board, but not less than 84 days before any election.",
	"repealed": false
}