{
	"id": "473.146",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.146",
	"title": "473.146 POLICY PLANS FOR METROPOLITAN AGENCIES.",
	"text": "The council shall adopt a long-range comprehensive policy plan for transportation and wastewater treatment. The plans must substantially conform to all policy statements, purposes, goals, standards, and maps in the development guide developed and adopted by the council under this chapter. Each policy plan must include, to the extent appropriate to the functions, services, and systems covered, the following:\n(1) forecasts of changes in the general levels and distribution of population, households, employment, land uses, and other relevant matters, for the metropolitan area and appropriate subareas;\n(2) a statement of issues, problems, needs, and opportunities with respect to the functions, services, and systems covered;\n(3) a statement of the council's goals, objectives, and priorities with respect to the functions, services, and systems covered, addressing areas and populations to be served, the levels, distribution, and staging of services; a general description of the facility systems required to support the services; the estimated cost of improvements required to achieve the council's goals for the regional systems, including an analysis of what portion of the funding for each improvement is proposed to come from the state, Metropolitan Council levies, and cities, counties, and towns in the metropolitan area, respectively, and other similar matters;\n(4) a statement of policies to effectuate the council's goals, objectives, and priorities;\n(5) a statement of the fiscal implications of the council's plan, including a statement of: (i) the resources available under existing fiscal policy; (ii) the adequacy of resources under existing fiscal policy and any shortfalls and unattended needs; (iii) additional resources, if any, that are or may be required to effectuate the council's goals, objectives, and priorities; and (iv) any changes in existing fiscal policy, on regional revenues and intergovernmental aids respectively, that are expected or that the council has recommended or may recommend;\n(6) a statement of the relationship of the policy plan to other policy plans and chapters of the Metropolitan Development Guide;\n(7) a statement of the relationships to local comprehensive plans prepared under sections 473.851 to 473.871; and\n(8) additional general information as may be necessary to develop the policy plan or as may be required by the laws relating to the metropolitan agency and function covered by the policy plan.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe transportation chapter must include policies relating to all transportation forms and be designed to promote the legislative determinations, policies, and goals set forth in section 473.371. In addition to the requirements of subdivision 1 regarding the contents of the policy plan, the nontransit element of the transportation chapter must include the following:\n(1) a statement of the needs and problems of the metropolitan area with respect to the functions covered, including the present and prospective demand for and constraints on access to regional business concentrations and other major activity centers and the constraints on and acceptable levels of development and vehicular trip generation at such centers;\n(2) the objectives of and the policies to be forwarded by the policy plan;\n(3) a general description of the physical facilities and services to be developed;\n(4) a statement as to the general location of physical facilities and service areas;\n(5) a general statement of timing and priorities in the development of those physical facilities and service areas;\n(6) a detailed statement, updated every two years, of timing and priorities for improvements and expenditures needed on the metropolitan highway system;\n(7) a general statement on the level of public expenditure appropriate to the facilities; and\n(8) a long-range assessment of air transportation trends and factors that may affect airport development in the metropolitan area and policies and strategies that will ensure a comprehensive, coordinated, and timely investigation and evaluation of alternatives for airport development.\nThe council shall develop the nontransit element in consultation with the transportation advisory board and the Metropolitan Airports Commission and cities having an airport located within or adjacent to its corporate boundaries. The council shall also take into consideration the airport development and operations plans and activities of the commission. The council shall transmit the results to the state Department of Transportation.\n(a) The Metropolitan Council is the designated planning agency for any long-range comprehensive transportation planning required by section 134 of the Federal Highway Act of 1962, Section 4 of Urban Mass Transportation Act of 1964 and Section 112 of Federal Aid Highway Act of 1973 and other federal transportation laws. The council shall assure administration and coordination of transportation planning with appropriate state, regional and other agencies, counties, and municipalities.\n(b) The council shall establish an advisory body consisting of citizens and representatives of municipalities, counties, and state agencies in fulfillment of the planning responsibilities of the council. The membership of the advisory body must consist of:\n(1) the commissioner of transportation or the commissioner's designee;\n(2) the commissioner of the Pollution Control Agency or the commissioner's designee;\n(3) one member of the Metropolitan Airports Commission appointed by the commission;\n(4) one person appointed by the council to represent nonmotorized transportation;\n(5) one person appointed by the commissioner of transportation to represent the freight transportation industry;\n(6) two persons appointed by the council to represent public transit;\n(7) ten elected officials of cities within the metropolitan area, including one representative from each first-class city, appointed by the Association of Metropolitan Municipalities;\n(8) one member of the county board of each county in the seven-county metropolitan area, appointed by the respective county boards;\n(9) eight citizens appointed by the council, one from each council precinct;\n(10) one elected official from a city participating in the replacement service program under section 473.388, appointed by the Suburban Transit Association; and\n(11) one member of the council, appointed by the council.\n(c) The council shall appoint a chair from among the members of the advisory body.",
	"repealed": false
}