{
	"id": "360.531",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.531",
	"title": "360.531 TAXATION.",
	"text": "All aircraft using the air space overlying the state of Minnesota or the airports thereof, except as set forth in section 360.55, shall be taxed in lieu of all other taxes thereon, on the basis and at the rate for each fiscal year as follows.\nThe tax shall be as follows:\n\"First year of life\" means the year the aircraft was manufactured.\nFor the purpose of fixing a base price for taxation, the base price is defined as follows:\n(a) The base price for taxation of an aircraft shall be the manufacturer's list price.\n(b) The commissioner shall have authority to fix the base value for taxation purposes of any aircraft of which no such similar or corresponding model has been manufactured, and of any rebuilt or foreign aircraft, any aircraft on which a record of the list price is not available, or any military aircraft converted for civilian use, using as a basis for valuation the list price of aircraft with comparable performance characteristics, and taking into consideration the age and condition of the aircraft.\nModels shall be deemed similar if substantially alike and of the same make. Models shall be deemed to be corresponding models for the purpose of taxation under sections 360.54 to 360.67 if of the same make and having approximately the same weight and type of frame and the same style and size of motor.\nMS 2012 [Repealed by amendment, 2013 c 143 art 5 s 22]\nWhen an aircraft first becomes subject to taxation during the period for which the tax is to be paid, the tax on it shall be for the remainder of that period, prorated on a monthly basis of 1/12 of the annual tax for each calendar month counting the month during which it becomes subject to the tax as the first month of such period.\nEvery aircraft subject to the provisions of sections 360.511 to 360.67 which has at any time since April 19, 1945, used the air space overlying the state of Minnesota or the airports thereof shall be taxed for each fiscal year in which it is so used. Any aircraft which does not use the air space overlying the state of Minnesota or the airports thereof at any time during any fiscal year shall not be subject to the tax provided by sections 360.511 to 360.67 for such period. Rebuilt aircraft shall be subject to the tax provided by sections 360.511 to 360.67 for that portion of the fiscal year remaining after the aircraft has been rebuilt, prorated on a monthly basis.\nAircraft subject to taxation under the provisions of sections 360.54 to 360.67 shall not be assessed as personal property and shall be subject to no tax except as provided for by these sections. Aircraft not subject to taxation as provided in these sections, but subject to taxation as personal property within the state of Minnesota shall be assessed and valued at 33-1/3 percent of the market value thereof and taxed at the rate and in the manner provided by law for the taxation of ordinary personal property. If the person against whom any tax has been levied on the ad valorem basis because of any aircraft shall, during the calendar year for which such ad valorem tax is levied, be also taxed under provisions of these sections, then and in that event, upon proper showing, the commissioner of revenue shall grant to the person against whom said ad valorem tax was levied, such reduction or abatement of net tax capacity or taxes as was occasioned by the so-called ad valorem tax imposed. If the ad valorem tax upon any aircraft has been assessed against a dealer in new and used aircraft, and the tax imposed by these sections for the required period is thereafter paid by the owner, then and in that event, upon proper showing, the commissioner of revenue, upon the application of said dealer, shall grant to such dealer against whom said ad valorem tax was levied such reduction or abatement of net tax capacity or taxes as was occasioned by the so-called ad valorem tax imposed.",
	"repealed": false
}