{
	"id": "626.8469",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8469",
	"title": "626.8469 TRAINING IN CRISIS RESPONSE, CONFLICT MANAGEMENT, AND CULTURAL DIVERSITY.",
	"text": "(a) Beginning July 1, 2018, the chief law enforcement officer of every state and local law enforcement agency shall provide in-service training in crisis intervention and mental illness crises; conflict management and mediation; recognizing and valuing community diversity and cultural differences to include implicit bias training; and training to assist peace officers in identifying, responding to, and reporting incidents committed in whole or in substantial part because of the victim's actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, or because of the victim's actual or perceived association with another person or group of a certain actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, to every peace officer and part-time peace officer employed by the agency. The training shall comply with learning objectives developed and approved by the board and shall meet board requirements for board-approved continuing education credit. Every three years the board shall review the learning objectives and must consult and collaborate with communities most targeted by hate crimes because of their characteristics as described above, organizations with expertise in providing training on hate crimes, and the statewide coalition of organizations representing communities impacted by hate crimes in identifying appropriate objectives and training courses related to identifying, responding to, and reporting incidents committed in whole or in substantial part because of the victim's or another's actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, or because of the victim's actual or perceived association with another person or group of a certain actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03. The training shall consist of at least 16 continuing education credits within an officer's three-year licensing cycle. Each peace officer with a license renewal date after June 30, 2018, is not required to complete this training until the officer's next full three-year licensing cycle.\n(b) Beginning July 1, 2021, the training mandated under paragraph (a) must be provided by an approved entity. The board shall create a list of approved entities and training courses and make the list available to the chief law enforcement officer of every state and local law enforcement agency. Each peace officer (1) with a license renewal date before June 30, 2022, and (2) who received the training mandated under paragraph (a) before July 1, 2021, is not required to receive this training by an approved entity until the officer's next full three-year licensing cycle.\n(c) For every peace officer and part-time peace officer with a license renewal date of June 30, 2022, or later, the training mandated under paragraph (a) must:\n(1) include a minimum of six hours for crisis intervention and mental illness crisis training that meets the standards established in subdivision 1a; and\n(2) include a minimum of four hours to ensure safer interactions between peace officers and persons with autism in compliance with section 626.8474.\n(a) The board, in consultation with the commissioner of human services and mental health stakeholders, shall create a list of approved entities and training courses to instruct peace officers in techniques for responding to a mental illness crisis. A course must include scenario-based instruction and cover most of the following issues:\n(1) techniques for relating to individuals with mental illnesses and the individuals' families;\n(2) techniques for crisis de-escalation;\n(3) techniques for relating to diverse communities and education on mental illness diversity;\n(4) mental illnesses and the criminal justice system;\n(5) community resources and supports for individuals experiencing a mental illness crisis and for the individuals' families;\n(6) psychotropic medications and the medications' side effects;\n(7) co-occurring mental illnesses and substance use disorders;\n(8) suicide prevention; and\n(9) mental illnesses and disorders and the symptoms.\n(b) A course must also include training on children and families of individuals with mental illnesses to enable officers to respond appropriately to others who are present during a mental illness crisis. The board shall update the list of approved entities and training courses periodically as it considers appropriate.\nThe board, in consultation with stakeholders, including but not limited to the Minnesota Crisis Intervention Team and the Alzheimer's Association, shall create a list of approved entities and training courses primarily focused on issues associated with persons with dementia and Alzheimer's disease. To receive the board's approval, a training course must:\n(1) have trainers with at least two years of direct care of a person with Alzheimer's disease or dementia, crisis intervention training, and mental health experience;\n(2) cover techniques for responding to and issues associated with persons with dementia and Alzheimer's disease, including at a minimum wandering, driving, abuse, and neglect; and\n(3) meet the crisis intervention and mental illness crisis training standards established in subdivision 1a.\nThe head of every local and state law enforcement agency shall maintain written records of the agency's compliance with the requirements of subdivisions 1 and 1a including, at a minimum:\n(1) documentation of the training provider;\n(2) documentation of the content of the training provided;\n(3) documentation that crisis intervention and mental illness crisis training included scenario-based instruction in compliance with the standards described in subdivision 1a;\n(4) compiled evaluations; and\n(5) explanation of expenditure of funds.\nThe documentation shall be submitted to the board. The board shall include in the compliance reviews required in section 626.8459 an evaluation of the effectiveness of in-service training provided under this section in reducing officer use of force and diverting people experiencing a mental illness crisis from arrest.\nThe board may impose licensing sanctions and seek injunctive relief under section 214.11 for failure to comply with the requirements of this section.",
	"repealed": false
}