{
	"id": "515B.2-114",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-114",
	"title": "515B.2-114 RELOCATION OF BOUNDARIES BETWEEN ADJOINING UNITS.",
	"text": "(a) Subject to the provisions of the declaration and applicable law, the boundaries between adjoining units may be relocated by an amendment to the declaration upon the submission of an application to the association by the owners of those units and approval by the association. The application shall contain, at a minimum, a general description of the proposed relocation, and shall specify in detail the matters required by subsection (b)(2) and (3).\n(b) The association shall establish fair and reasonable procedures and time frames for the submission and prompt processing of the applications. The basis for disapproval shall be limited to structural or safety considerations, or a failure to comply with the declaration, this chapter, or governmental laws, ordinances or regulations. If the application is approved, the unit owners making the application shall cause an amendment and amended CIC plat to be prepared based upon the approved application, and submit them to the association for approval. The amendment shall:\n(1) be executed by the association and the unit owners making the application, and consented to by any secured party with respect to the units;\n(2) identify the units involved;\n(3) reallocate the common element interest, votes in the association and common expense liability formerly allocated to the units among the newly defined units on the basis described in the declaration;\n(4) contain words of conveyance between them;\n(5) contain such other provisions as may be reasonably required by the association; and\n(6) conform to the requirements of the declaration and this chapter.\n(c) The interest and remedies of a secured party which joins in the amendment pursuant to this section shall be deemed to be modified as provided in the amendment.\n(d) The association may require the unit owners making the application to build a boundary wall and other common elements between the units, and to pay all fees and costs for reviewing, preparing and recording the amendment and the amended CIC plat, and any other fees or costs incurred by the association in connection therewith.\n(e) The applicant shall deliver a copy of the recorded amendment and amended CIC plat to the association.",
	"repealed": false
}