{
	"id": "48.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.99",
	"title": "48.99 SPECIAL ACQUISITIONS AUTHORIZED.",
	"text": "Pursuant to the present requirement of the United States Code, title 12, section 1842(d) and notwithstanding any other provision of state law, an out-of-state bank holding company, or any subsidiary of a bank holding company, may acquire a bank located in this state where the commissioner has determined that a merger, consolidation, or purchase of assets and assumption of liabilities is necessary and in the public interest to prevent the probable failure of a bank or is made for the incorporation of a new bank in the same locality coincidental with the closing of an existing bank by the commissioner or federal authorities and does not increase the number of banks in the community affected. The acquisition is subject to the prior written approval of the commissioner of an application submitted under this section and after the following considerations:\n(1) the financial and managerial resources of the applicant;\n(2) the future prospects of the applicant and the state bank or its subsidiary whose assets, interest in, or shares it will acquire;\n(3) the financial history of the applicant;\n(4) whether the acquisition or holding may result in undue concentration of resources or substantial lessening of competition in this state, but any deposit concentration limitations imposed on the acquisition by Public Law 103-328, title 1, section 101, (a)(2), may be waived by order of the commissioner;\n(5) the convenience and needs of the public of this state; and\n(6) whether the acquisition or holding will strengthen the financial condition of the state bank.\nIn determining the priority of applications submitted to seek approval to acquire a bank located in this state which meets the criteria in subdivision 1, the commissioner shall give first consideration to the approval of applications from applicants located in this state, then to reciprocating state bank holding companies.\nThe department may enter into cooperative and reciprocal agreements with federal or bank regulatory authorities of other states for exchange or acceptance of reports of examination and other records from the authorities in lieu of conducting its own examinations of acquiring reciprocating state bank holding companies. The department may enter into joint actions with federal or bank regulatory authorities of other states to carry out its responsibilities under Laws 1986, chapter 339 and assure compliance with the laws of this state.\nA reciprocating state bank holding company that directly or indirectly, through any subsidiary, acquires a bank pursuant to Laws 1986, chapter 339 shall file with the commissioner copies of all regular and periodic reports which the bank holding company is required to file under section 13 or 15(d) of the Securities and Exchange Act of 1934, as amended, but excluding any portions not available to the public, and such other reports as the commissioner may require by rule.",
	"repealed": false
}