{
	"id": "116.943",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.943",
	"title": "116.943 PRODUCTS CONTAINING PFAS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Adult mattress\" means a mattress other than a crib mattress or toddler mattress.\n(c) \"Air care product\" means a chemically formulated consumer product labeled to indicate that the purpose of the product is to enhance or condition the indoor environment by eliminating odors or freshening the air.\n(d) \"Automotive maintenance product\" means a chemically formulated consumer product labeled to indicate that the purpose of the product is to maintain the appearance of a motor vehicle, including products for washing, waxing, polishing, cleaning, or treating the exterior or interior surfaces of motor vehicles. Automotive maintenance product does not include automotive paint or paint repair products.\n(e) \"Carpet or rug\" means a fabric marketed or intended for use as a floor covering.\n(f) \"Cleaning product\" means a finished product used primarily for domestic, commercial, or institutional cleaning purposes, including but not limited to an air care product, an automotive maintenance product, a general cleaning product, or a polish or floor maintenance product.\n(g) \"Commissioner\" means the commissioner of the Pollution Control Agency.\n(h) \"Cookware\" means durable houseware items used to prepare, dispense, or store food, foodstuffs, or beverages. Cookware includes but is not limited to pots, pans, skillets, grills, baking sheets, baking molds, trays, bowls, and cooking utensils.\n(i) \"Cosmetic\" means articles, excluding soap:\n(1) intended to be rubbed, poured, sprinkled, or sprayed on, introduced into, or otherwise applied to the human body or any part thereof for the purpose of cleansing, beautifying, promoting attractiveness, or altering the appearance; and\n(2) intended for use as a component of any such article.\n(j) \"Currently unavoidable use\" means a use of PFAS that the commissioner has determined by rule under this section to be essential for health, safety, or the functioning of society and for which alternatives are not reasonably available.\n(k) \"Fabric treatment\" means a substance applied to fabric to give the fabric one or more characteristics, including but not limited to stain resistance or water resistance.\n(l) \"Intentionally added\" means PFAS deliberately added during the manufacture of a product where the continued presence of PFAS is desired in the final product or one of the product's components to perform a specific function.\n(m) \"Juvenile product\" means a product designed or marketed for use by infants and children under 12 years of age:\n(1) including but not limited to a baby or toddler foam pillow; bassinet; bedside sleeper; booster seat; changing pad; child restraint system for use in motor vehicles and aircraft; co-sleeper; crib mattress; highchair; highchair pad; infant bouncer; infant carrier; infant seat; infant sleep positioner; infant swing; infant travel bed; infant walker; nap cot; nursing pad; nursing pillow; play mat; playpen; play yard; polyurethane foam mat, pad, or pillow; portable foam nap mat; portable infant sleeper; portable hook-on chair; soft-sided portable crib; stroller; and toddler mattress; and\n(2) not including a children's electronic product such as a personal computer, audio and video equipment, calculator, wireless phone, game console, handheld device incorporating a video screen, or any associated peripheral such as a mouse, keyboard, power supply unit, or power cord; or an adult mattress.\n(n) \"Manufacturer\" means the person that creates or produces a product or whose brand name is affixed to the product. In the case of a product imported into the United States, manufacturer includes the importer or first domestic distributor of the product if the person that manufactured or assembled the product or whose brand name is affixed to the product does not have a presence in the United States.\n(o) \"Medical device\" has the meaning given \"device\" under United States Code, title 21, section 321, subsection (h).\n(p) \"Perfluoroalkyl and polyfluoroalkyl substances\" or \"PFAS\" means a class of fluorinated organic chemicals containing at least one fully fluorinated carbon atom.\n(q) \"Product\" means an item manufactured, assembled, packaged, or otherwise prepared for sale to consumers, including but not limited to its product components, sold or distributed for personal, residential, commercial, or industrial use, including for use in making other products.\n(r) \"Product component\" means an identifiable component of a product, regardless of whether the manufacturer of the product is the manufacturer of the component.\n(s) \"Ski wax\" means a lubricant applied to the bottom of snow runners, including but not limited to skis and snowboards, to improve their grip or glide properties. Ski wax includes related tuning products.\n(t) \"Textile\" means an item made in whole or part from a natural or synthetic fiber, yarn, or fabric. Textile includes but is not limited to leather, cotton, silk, jute, hemp, wool, viscose, nylon, and polyester.\n(u) \"Textile furnishings\" means textile goods of a type customarily used in households and businesses, including but not limited to draperies, floor coverings, furnishings, bedding, towels, and tablecloths.\n(v) \"Upholstered furniture\" means an article of furniture that is designed to be used for sitting, resting, or reclining and that is wholly or partly stuffed or filled with any filling material.\n(a) On or before January 1, 2026, a manufacturer of a product sold, offered for sale, or distributed in the state that contains intentionally added PFAS must submit to the commissioner information that includes:\n(1) a brief description of the product, including a universal product code (UPC), stock keeping unit (SKU), or other numeric code assigned to the product;\n(2) the purpose for which PFAS are used in the product, including in any product components;\n(3) the amount of each PFAS, identified by its chemical abstracts service registry number, in the product, reported as an exact quantity determined using commercially available analytical methods or as falling within a range approved for reporting purposes by the commissioner;\n(4) the name and address of the manufacturer and the name, address, and phone number of a contact person for the manufacturer; and\n(5) any additional information requested by the commissioner as necessary to implement the requirements of this section.\n(b) With the approval of the commissioner, a manufacturer may supply the information required in paragraph (a) for a category or type of product rather than for each individual product.\n(c) A manufacturer must submit the information required under this subdivision whenever a new product that contains intentionally added PFAS is sold, offered for sale, or distributed in the state and update and revise the information whenever there is significant change in the information or when requested to do so by the commissioner.\n(d) A person may not sell, offer for sale, or distribute for sale in the state a product containing intentionally added PFAS if the manufacturer has failed to provide the information required under this subdivision and the person has received notification under subdivision 4.\n(a) The commissioner may waive all or part of the information requirement under subdivision 2 if the commissioner determines that substantially equivalent information is already publicly available. The commissioner may grant a waiver under this paragraph to a manufacturer or a group of manufacturers for multiple products or a product category.\n(b) For a pesticide regulated under chapter 18B, a fertilizer, an agricultural liming material, a plant amendment, or a soil amendment regulated under chapter 18C, a manufacturer may satisfy the requirements of subdivision 2 by submitting the information required by that subdivision as part of its annual registration or approval process under chapter 18B or 18C. For information that is regulated under chapters 18B and 18C, the commissioner and the commissioner of agriculture must jointly determine whether to make the information publicly available based on applicable statutes.\n(c) The commissioner may enter into an agreement with one or more other states or political subdivisions of a state to collect information and may accept information to a shared system as meeting the information requirement under subdivision 2.\n(d) The commissioner may extend the deadline for submission by a manufacturer of the information required under subdivision 2 if the commissioner determines that more time is needed by the manufacturer to comply with the submission requirement.\n(a) If the commissioner has reason to believe that a product contains intentionally added PFAS and the product is being offered for sale in the state, the commissioner may direct the manufacturer of the product to, within 30 days, provide the commissioner with testing results that demonstrate the amount of each of the PFAS, identified by its chemical abstracts service registry number, in the product, reported as an exact quantity determined using commercially available analytical methods or as falling within a range approved for reporting purposes by the commissioner.\n(b) If testing demonstrates that the product does not contain intentionally added PFAS, the manufacturer must provide the commissioner a certificate attesting that the product does not contain intentionally added PFAS, including testing results and any other relevant information.\n(c) If testing demonstrates that the product contains intentionally added PFAS, the manufacturer must provide the commissioner with the testing results and the information required under subdivision 2.\n(d) A manufacturer must notify persons who sell or offer for sale a product prohibited under subdivision 2 or 5 that the sale of that product is prohibited in this state and provide the commissioner with a list of the names and addresses of those notified.\n(e) The commissioner may notify persons who sell or offer for sale a product prohibited under subdivision 2 or 5 that the sale of that product is prohibited in this state.\n(a) Beginning January 1, 2025, a person may not sell, offer for sale, or distribute for sale in this state the following products if the product contains intentionally added PFAS:\n(1) carpets or rugs;\n(2) cleaning products;\n(3) cookware;\n(4) cosmetics;\n(5) dental floss;\n(6) fabric treatments;\n(7) juvenile products;\n(8) menstruation products;\n(9) textile furnishings;\n(10) ski wax; or\n(11) upholstered furniture.\n(b) The commissioner may by rule identify additional products by category or use that may not be sold, offered for sale, or distributed for sale in this state if they contain intentionally added PFAS and designate effective dates. A prohibition adopted under this paragraph must be effective no earlier than January 1, 2025, and no later than January 1, 2032. The commissioner must prioritize the prohibition of the sale of product categories that, in the commissioner's judgment, are most likely to contaminate or harm the state's environment and natural resources if they contain intentionally added PFAS.\n(c) Beginning January 1, 2032, a person may not sell, offer for sale, or distribute for sale in this state any product that contains intentionally added PFAS, unless the commissioner has determined by rule that the use of PFAS in the product is a currently unavoidable use. The commissioner may specify specific products or product categories for which the commissioner has determined the use of PFAS is a currently unavoidable use. The commissioner may not determine that the use of PFAS in a product is a currently unavoidable use if the product is listed in paragraph (a).\n(d) The commissioner may not take action under paragraph (b) or (c) with respect to a pesticide, as defined under chapter 18B, a fertilizer, an agricultural liming material, a plant amendment, or a soil amendment as defined under chapter 18C, unless the commissioner of agriculture approves the action.\nThe commissioner may establish by rule a fee payable by a manufacturer to the commissioner upon submission of the information required under subdivision 2 to cover the agency's reasonable costs to implement this section. Fees collected under this subdivision must be deposited in an account in the environmental fund.\n(a) The commissioner may enforce this section under sections 115.071 and 116.072. The commissioner may coordinate with the commissioners of agriculture, commerce, and health in enforcing this section.\n(b) When requested by the commissioner, a person must furnish to the commissioner any information that the person may have or may reasonably obtain that is relevant to show compliance with this section.\n(a) This section does not apply to:\n(1) a product for which federal law governs the presence of PFAS in the product in a manner that preempts state authority;\n(2) a product regulated under section 325F.072 or 325F.075; or\n(3) the sale or resale of a used product.\n(b) Subdivisions 4 and 5 do not apply to a prosthetic or orthotic device or to any product that is a medical device or drug or that is otherwise used in a medical setting or in medical applications regulated by the United States Food and Drug Administration.\nThe commissioner may adopt rules necessary to implement this section. Section 14.125 does not apply to the commissioner's rulemaking authority under this section.\nThis section is \"Amara's Law.\"",
	"repealed": false
}