{
	"id": "271.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/271.21",
	"title": "271.21 SMALL CLAIMS DIVISION.",
	"text": "There shall be a division of the Tax Court known as the Small Claims Division. The judges of the Tax Court shall sit as judges of the Small Claims Division. Each judge shall have authority to hear and decide the cases heard as small claims judge.\nAt the election of the taxpayer, the Small Claims Division shall have jurisdiction only in the following matters:\n(a) cases involving valuation, assessment, or taxation of real or personal property, if:\n(i) the issue is a denial of a current year application for the homestead classification for the taxpayer's property;\n(ii) only one parcel is included in the petition, the entire parcel is classified as homestead class 1a or 1b under section 273.13, and the parcel contains no more than one dwelling unit;\n(iii) the entire property is classified as agricultural homestead class 2a or 1b under section 273.13; or\n(iv) the assessor's estimated market value of the property included in the petition is less than $300,000; or\n(b) any case not involving valuation, assessment, or taxation of real and personal property in which the amount in controversy does not exceed $15,000, including penalty and interest.\nA taxpayer may elect to appeal in the Small Claims Division instead of appealing to the regular division of the Tax Court. If the taxpayer elects to appeal to the Small Claims Division, and 30 days have elapsed since the filing of the appeal, or briefs have been filed or a hearing held on the matter, whichever occurs first, the taxpayer shall not appeal to the regular division in the same matter. A taxpayer who elects to appeal to the regular division shall not appeal to the Small Claims Division in the same matter.\nMS 1988 [Repealed, 1989 c 324 s 29]\nA taxpayer shall commence a proceeding in the Small Claims Division by filing with the court administrator of the Tax Court a petition in the form prescribed by the rules of the Tax Court, which shall state the nature of the taxpayer's claim. Upon the filing of a petition by the taxpayer to the Small Claims Division, the court administrator of the Tax Court shall give notice thereof to the commissioner or to the appropriate unit of government, who shall thereafter be deemed a party to the proceeding. In the event a petition is filed, the Small Claims Division shall thereafter have exclusive jurisdiction over the case if it meets the requirements of subdivision 2.\nThe hearing in the Small Claims Division shall be informal and without a jury. The judge may hear any testimony and receive any evidence the judge deems necessary or desirable for a just determination of the case. Sales ratio studies published by the Department of Revenue may be admissible as a public record without foundation. All testimony shall be given under oath. A party may appear personally or may be represented or accompanied by an attorney. No transcript of the proceedings shall be kept.\nAt any time prior to entry of judgment, a taxpayer may dismiss a case in the Small Claims Division by notifying the court administrator of the Tax Court in writing. The dismissal shall be with prejudice and shall not revoke the election specified in subdivision 3.\nThe judgment in the Small Claims Division shall be conclusive upon all parties and may not be appealed. The court may order the commissioner or the appropriate unit of government to modify or cancel an assessment, pay or allow a refund, or take other action necessary to effectuate the judgment. Notice that no appeal may be had from a small claims judgment shall appear prominently on the petition form. The judgment shall not be considered as judicial precedent and shall have no force or effect in any other case, hearing, or proceeding. No judgment shall be rendered in a case dealing with property valuation or assessment for property tax purposes until after the state Board of Equalization has issued its order, if any, for that area or property.\nSubpoenas in a proceeding in the Small Claims Division will be issued only at the discretion of the court.\nWhenever the Small Claims Division trial docket becomes congested with appeals involving valuation, classification, and assessment of property for tax purposes, the judges of the Tax Court may appoint referees to hear the cases appealed to the Small Claims Division. Each referee shall have authority to hear and decide the cases heard as small claims referee. Each referee shall be a citizen of Minnesota and shall have experience with and knowledge of tax law or property taxation and property values, depending on the case at issue. A referee shall be paid at a rate of 80 percent of the salary of the judges of the district court in that county, prorated by the length of time served as a referee. Each referee shall receive actual and necessary expenses paid or incurred in the performance of duties.\nThe provisions of sections 271.01 to 271.20 shall apply to proceedings in the Small Claims Division unless this section expressly provides otherwise.",
	"repealed": false
}