{
	"id": "13.7905",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.7905",
	"title": "13.7905 LABOR AND INDUSTRY DATA CODED ELSEWHERE.",
	"text": "The sections referred to in subdivisions 2 to 6 are codified outside chapter 13. Those sections classify labor and industry data as other than public, place restrictions on access to government data, or involve data sharing.\n(a) Workers' Compensation Division. Disclosure of proceedings of the Workers' Compensation Division is governed by sections 175.10; 176.231, subdivision 9b; and 176.2611, subdivision 6.\n(b) Computer access to data. Computer access to and electronic data interchange of data maintained by the Department of Labor and Industry are governed by section 175.171.\n(c) Reporters. Disclosure of the names of certain persons supplying information to the Department of Labor and Industry is prohibited by sections 175.24 and 175.27.\n(a) Loggers; payroll data. Data sharing of payroll data by the commissioner of labor and industry with a workers' compensation insurer or the Workers' Compensation Insurance Association, is governed by section 176.130, subdivision 5.\n(b) Medical data. Access to medical data in connection with a workers' compensation claim is governed by section 176.138.\n(c) Employment status. Data sharing, between the commissioner of labor and industry and other persons, regarding the employment status of individuals, is governed by section 176.181, subdivision 8.\n(d) Identity of reporters. Access to the identity of anyone reporting that an employer may not have workers' compensation insurance is governed by section 176.184, subdivision 5.\n(e) Report of death or injury to labor and industry. Access to a report related to a workers' compensation injury under chapter 176 is governed by sections 176.231, subdivisions 8 and 9a to 9c, and 176.234.\n(f) Investigative and enforcement data. Classification of data related to a department workers' compensation enforcement action or investigation is governed by section 176.231, subdivision 9c, paragraph (c).\n(g) Disputes. Certain documents filed with or issued by the Department of Labor and Industry or the Office of Administrative Hearings related to workers' compensation disputes are classified under sections 176.231 and 176.2611.\nRepresentation authorization signatures, contained in employee organization petitions or joint requests, are classified by section 179A.12, subdivision 6.\nData in registration applications, in required documentation submitted to the commissioner of labor and industry by persons who perform public or private sector commercial or residential building construction or improvement services, and in registration certificates issued by the commissioner are classified under section 326B.701, subdivision 8.\n(a) Disclosure of lie detector tests. Disclosure of lie detector tests is governed by section 181.76.\n(b) Identity of employees making complaints. The disclosure of the identity of employees making certain complaints is also governed by section 181.932, subdivision 2.\n(c) Employee drug and alcohol test results. Test results and other information acquired in the drug and alcohol testing process, with respect to public sector employees and applicants, are classified by section 181.954, subdivision 2, and access to them is governed by section 181.954, subdivision 3.\n(d) Data provided to licensing agencies, contracting agencies, and employees. Data provided to licensing agencies, contracting agencies, and employees when the commissioner issues an order to comply or resolves a compliance order through settlement or other final disposition is governed by section 177.27, subdivision 11.\nCertain data gathered or prepared by the commissioner of labor and industry as part of occupational safety and health inspections or reports are classified under sections 182.659, subdivision 8, 182.663, subdivision 4, and 182.668, subdivision 2.\nMS 2018 [Repealed, 2020 c 83 art 3 s 6]\nDisclosure of data on minors is governed by section 181A.112.\nWorkers' compensation insurance data reported to or collected by the department is governed by section 176.185, subdivision 11.\nApprentice data reported to, maintained by, or collected by the department is governed by section 178.071.",
	"repealed": false
}