{
	"id": "578.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/578.17",
	"title": "578.17 HEARING BY COURT; DETERMINATION OF DEATH OF AN ABSENTEE.",
	"text": "A person in interest may request a hearing in the following circumstances:\n(1) if an absentee is absent from the domicile without being in communication after being exposed to a specific peril and a diligent search has been made; or\n(2) if an absentee has been absent from the domicile for a period of four consecutive years or more without being in communication and a diligent search has been made; or\n(3) if unforeseeable or changing circumstances necessitate court authorization for action in respect to the management or disposition of the absentee's business or property.\nThe person requesting the hearing shall file a petition stating name, address, relationship to the absentee, and the specific grounds for the hearing requested.\nUpon the filing of the petition, the court shall notify all proper persons in interest of the date, time and place of the hearing.\nThe notice shall in all cases be served as follows:\n(1) by publication in the county in which the petition is filed once in each of three successive weeks, in a newspaper designated by the court; and\n(2) upon all persons in interest by ordinary mail.\nThe court, if satisfied by the evidence adduced at a hearing in support of a petition alleging the absentee is missing after being exposed to a specific peril or that an absentee has been absent for four or more consecutive years, shall enter an order establishing as a matter of law the death of the absentee and the date thereof. The court shall order the distribution of the absentee's property to the persons and in the manner prescribed in chapters 524 and 525.\nUpon a hearing brought pursuant to subdivision 1, clause (3), the court shall have full power to make orders appropriate to conserve the absentee's property or business or to protect the rights of the persons in interest.",
	"repealed": false
}