{
	"id": "144.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.70",
	"title": "144.70 BIENNIAL REPORT.",
	"text": "The commissioner of health shall prepare a report every two years concerning the status and operations of the health care markets in Minnesota. The commissioner of health shall transmit the reports to the governor, and to the members of the legislature under section 3.195. The first report must be submitted on January 15, 1987, and succeeding reports on January 15 every two years. Each report must contain information, analysis, and appropriate recommendations concerning the following issues associated with Minnesota health care markets:\n(1) the overall status of the health care cost problem, including the costs faced by employers and individuals, and prospects for the problem's improving or getting worse;\n(2) the status of competitive forces in the market for health services and the market for health plans, and the effect of the forces on the health care cost problem;\n(3) the feasibility and cost-effectiveness of facilitating development of strengthened competitive forces through state initiatives;\n(4) the feasibility of limiting health care costs by means other than competitive forces, including direct forms of government intervention such as price regulation; the commissioner of health may exclude this issue from the report if the report concludes that the overall status of the health care cost problem is improving, or that competitive forces are contributing significantly to health care cost containment;\n(5) the overall status of access to adequate health services by citizens of Minnesota, the scope of financial and geographic barriers to access, the effect of competitive forces on access, and prospects for access improving or getting worse;\n(6) the feasibility and cost-effectiveness of enhancing access to adequate health services by citizens of Minnesota through state initiatives; and\n(7) the commissioner of health's operations and activities for the preceding two years as they relate to the duties imposed on the commissioner of health by sections 144.695 to 144.703.\nIn completing the report required by subdivision 1, in fulfilling the requirements of sections 144.695 to 144.703, and in undertaking other initiatives concerning health care costs, access, or quality, the commissioner of health shall cooperate with and consider potential benefits to other state agencies that have a role in the market for health services or the market for health plans. Other agencies include the Department of Management and Budget, as administrator of the state employee health benefits program; the Department of Human Services, as administrator of health services entitlement programs; the Department of Commerce, in its regulation of health plans; the Department of Labor and Industry, in its regulation of health service costs under workers' compensation.",
	"repealed": false
}