{
	"id": "501B.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/501B.32",
	"title": "501B.32 PRIVATE FOUNDATIONS; CHARITABLE TRUSTS; SPLIT-INTEREST TRUSTS.",
	"text": "A will or trust instrument that creates a trust that is: (1) a \"private foundation,\" as defined in section 501(a) of the Internal Revenue Code of 1986; or (2) a \"charitable trust,\" as defined in section 4947(a)(1) of the Internal Revenue Code of 1986; or (3) a \"split-interest trust,\" as defined in section 4947(a)(2) of the Internal Revenue Code of 1986, and any other instrument governing the trustee of one of those trusts or the use, retention, or disposition of any of the income or property of one of those trusts, must be considered to have incorporated within it the provisions in paragraphs (a) to (e) with respect to the trust and its trustee. Except as provided in subdivision 2, paragraphs (a) to (e) govern the administration and distribution of the trust notwithstanding provisions of the governing instrument, statute, or law of this state to the contrary.\n(a) The trustee shall distribute for each taxable year of the trust amounts at least sufficient to avoid liability for the tax imposed by section 4942(a) of the Internal Revenue Code of 1986.\n(b) The trustee shall not engage in an act of \"self-dealing,\" as defined in section 4941(d) of the Internal Revenue Code of 1986, which would give rise to liability for the tax imposed by section 4941(a) of the Internal Revenue Code of 1986.\n(c) The trustee shall not keep \"excess business holdings,\" as defined in section 4943(c) of the Internal Revenue Code of 1986, that would give rise to liability for the tax imposed by section 4943(a) of the Internal Revenue Code of 1986.\n(d) The trustee shall not make investments that would jeopardize the carrying out of any of the exempt purposes of the trust, within the meaning of section 4944 of the Internal Revenue Code of 1986, so as to give rise to liability for the tax imposed by section 4944(a) of the Internal Revenue Code of 1986.\n(e) The trustee shall not make a \"taxable expenditure,\" as defined in section 4945(d) of the Internal Revenue Code of 1986, that would give rise to liability for the tax imposed by section 4945(a) of the Internal Revenue Code of 1986.\nSubdivision 1 does not apply to the extent that a court of competent jurisdiction determines that application would be contrary to the terms of the will, trust instrument, or other governing instrument described in subdivision 1 and that the will, trust instrument, or other governing instrument may not be changed to conform to subdivision 1.\nNothing in this section impairs the rights and powers of the attorney general or the courts of this state with respect to a trust.",
	"repealed": false
}