{
	"id": "48.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.59",
	"title": "48.59 COMMISSIONER MAY ACCEPT EXAMINATIONS AND REPORTS OF CORPORATION.",
	"text": "(a) The commissioner may accept, in lieu of any examination authorized by the laws of this state to be conducted by the department of a banking institution, the examination that may have been made of same within a reasonable period by the Federal Deposit Insurance Corporation, or the Federal Reserve Bank, provided a copy of this examination is furnished to the commissioner. The commissioner also has the discretionary authority to accept any report relative to the condition of a banking institution which may have been obtained by the corporation within a reasonable period, in lieu of a report authorized by the laws of this state to be required of the institution by the department, provided a copy of this report is furnished to the commissioner.\n(b) The commissioner may furnish to the corporation, or to any official or examiner thereof, a copy or copies of any or all examinations made of any such banking institutions any deposits of which are insured by the corporation and of any or all reports made by same, and shall give access to and disclose to the corporation, or any official or examiner thereof, any and all information possessed by the office of the commissioner with reference to the conditions or affairs of any such insured institution.\n(c) Nothing in this section shall be construed to limit the duty of any banking institution in this state, deposits of which are to any extent insured under the provisions of Section 8 of the \"Banking Act of 1933\" (Section 12B of the Federal Reserve Act, as amended (Mason's United States Code Annotated, title 12, section 264)), or of any amendment of or substitution for the same, to comply with the provisions of that act, its amendments or substitutions, or requirements of the corporation relative to examinations and reports, nor to limit the powers of the commissioner with reference to examinations and reports under any law of this state.",
	"repealed": false
}