{
	"id": "383B.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.20",
	"title": "383B.20 PARKING FACILITIES.",
	"text": "The county of Hennepin may use and develop any property heretofore acquired or hereafter acquired by gift, lease, purchase or condemnation proceedings, which condemnation proceedings shall be in accordance with chapter 117, any real property within said county of Hennepin, or any interest therein, deemed by the board of county commissioners to be needed for the purposes of providing off-street parking facilities. If the off-street parking facilities are not acquired or bettered in conjunction with or primarily to serve any of the public buildings which are under the control of the board of county commissioners for county purposes, the off-street parking project must be approved by the city council of the city in which the facilities are to be located. The term \"off-street parking facilities\" as used in this section includes lots, lanes, garages, ramps or other structures and accessories.\nTo finance the acquisition and betterment of off-street parking facilities referred to in subdivision 1, the board of county commissioners may issue general obligation bonds or revenue bonds of Hennepin County, or any combination of them. The bonds shall be sold and issued in accordance with chapter 475. The net revenues derived from any and all off-street parking facilities, whether financed by the bonds or previously owned by the county, may be pledged to repay the bonds and interest on them. The board may by resolution establish covenants concerning the operation, maintenance, and financial records of the facilities, the establishment and collection of sufficient charges for service, the custody and use of the revenues, the priority of claims on revenues for the payment of particular bonds, and other matters the board may determine to be necessary or desirable for the marketing of the bonds and the security of the holders or of the taxpayers. No election shall be required to authorize revenue bonds or general obligation bonds for which revenues are pledged, and the bonds shall be included in computing the net debt of the county. Revenue bonds, for which the taxing power of the county is not pledged, may be sold by private negotiation on the terms and conditions the board of county commissioners may determine.\nThe county of Hennepin may make such provision for the operation and management of the facilities provided herein as it may deem necessary, and it may lease and rent all or any off-street parking facilities to persons, firms or corporations to be used for purposes of automobile parking and fix the rentals to be charged therefor, and when so leased, to regulate the rates and charges to be exacted for the services so provided. Such lease may require the lessee to make improvements to become the property of the county upon expiration or termination of the lease. The county may, in the alternative, employ any person, firm, or corporation as operating manager and agent for the county to operate and maintain any such facility or facilities in behalf of the county under a contract defining the terms of such employment.\nMS 2000 [Repealed, 2002 c 359 s 3]",
	"repealed": false
}