{
	"id": "508A.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.71",
	"title": "508A.71 ALTERATIONS; COURT, EXAMINER'S ORDER; NEW CERTIFICATE.",
	"text": "No erasure, alteration, or amendment shall be made upon the register of titles after the entry of a CPT or of any memorial on it, and the attestation of the same by the registrar, except by order of the court or except as otherwise provided in this chapter.\nThe registrar may correct clerical errors or omissions made by the registrar's staff in producing CPTs. An error shall not be erased or obliterated. The registrar may sign and file a correction document and memorialize it upon the affected CPT or may make a correction memorial without a correction document. The memorial shall show the date, time of entry, the nature of the error or omission, and the correct information. Where the error or omission may adversely affect the interest of any party, the registrar shall refer the correction to the examiner of titles. The registrar shall prepare subsequent CPTs correctly and omit the memorial of the correction.\nA registered owner or other person in interest may, at any time, apply by petition to the court, upon the ground that (1) registered interests of any description, whether vested, contingent, expectant, or inchoate, have terminated and ceased; (2) new interests have arisen or been created which do not appear upon the CPT; (3) any error or omission was made in entering a CPT or any memorial on it; (4) the name of any person on the CPT has been changed; (5) the registered owner has married, or, if registered as married, that the marriage has been terminated; (6) a corporation which owned land registered under sections 508A.01 to 508A.85 and has been dissolved has not conveyed it within three years after its dissolution; or (7) upon any reasonable ground, that any other alteration or adjudication should be made. The court may hear and determine the petition after notice given to all parties in interest, as determined by the examiner of titles, by a summons issued in the form and served in the manner as in initial applications pursuant to chapter 508 or by an order to show cause, as the court may deem appropriate. After notice has been given as ordered, the court may order the entry of a new CPT, the entry, amendment, or cancellation of a memorial upon a CPT, or grant any other relief upon terms, requiring security if necessary, as it may consider proper. A certified copy of the petition may be filed as a memorial on any appropriate CPT which shall be notice forever to purchasers and encumbrancers of the pendency of the proceeding and all matters referred to in the court files and records pertaining to the proceeding.\nAt the request of a registered owner or other person in interest the examiner of titles by a written directive may order (1) the amendment or cancellation of a memorial relating to racial restrictions, rights which are barred by a statute or rights which have expired by the terms of the instrument creating the rights, (2) upon the submission of evidence satisfactory to the examiner, the correction of the name or designation of a party who is a registered owner or who has an interest registered on a certificate of title, or (3) the deletion of easements or other nonfee interests that are terminated by their own terms or by a written instrument satisfactory to the examiner. The registrar of titles shall register the directives of the examiner of titles upon the CPT, and shall give full faith to the directives.\nWithout order of court or directive of the examiner the registrar of titles may receive and register as memorials upon any CPT to which they pertain, the following instruments; receipt or certificate of county treasurer showing redemption from any tax sale or payment of any tax described in a CPT, a certified copy of a marriage certificate showing the subsequent marriage of any party shown by a CPT to be unmarried, a certified copy of a final decree of divorce or dissolution of a marriage entered in the state of Minnesota, or in any state, territory or possession of the United States, or the District of Columbia to establish the dissolution of a marriage relationship of any party shown on the certificate to be married, a certified copy of the death record of party listed in any CPT as being the spouse of the registered owner when accompanied by an affidavit satisfactory to the registrar identifying the decedent with the spouse. In all subsequent dealings with the land covered by CPTs the registrar shall give full faith to these memorials.\nIn case of a CPT outstanding to two or more owners as joint tenants, upon the filing for registration of a record of death of one of the joint tenants and an affidavit of survivorship, the registrar without an order or directive shall issue a new CPT for the premises to the survivor in severalty or to the survivors in joint tenancy as the case may be.\nWhen instruments affecting land registered under sections 508A.01 to 508A.85 have been recorded in the office of any county recorder in this state, a certified copy of it may be filed for registration and registered with like effect as the original instrument without an order or directive.",
	"repealed": false
}