{
	"id": "216B.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.162",
	"title": "216B.162 COMPETITIVE RATE FOR ELECTRIC UTILITY.",
	"text": "(a) The terms used in this section have the meanings given them in this subdivision.\n(b) \"Effective competition\" means a market situation in which an electric utility serves a customer that:\n(1) is located within the electric utility's assigned service area determined under section 216B.39; and\n(2) has the ability to obtain its energy requirements from an energy supplier that is not regulated by the commission under section 216B.16.\n(c) \"Competitive rate schedule\" means a rate schedule under which an electric utility may set or change the price for its service to an individual customer or group of customers subject to effective competition.\n(d) \"Competitive rate\" means the actual rate offered by the utility, and approved by the commission, to a customer subject to effective competition.\n(e) \"Discretionary rate reduction\" means a specific reduction to an existing rate, offered voluntarily by the utility to an individual customer or group of customers and approved by the commission in accordance with subdivisions 10 and 11.\n(a) Notwithstanding section 216B.03, 216B.05, 216B.06, 216B.07, or 216B.16, the commission shall approve a competitive rate schedule when:\n(1) the provision of service to a customer or a class of customers is subject to effective competition; and\n(2) the schedule applies only to customers requiring electric service with a connected load of at least 2,000 kilowatts.\n(b) The commission may approve a competitive rate schedule that applies to customers subject to effective competition and requiring electric service with a connected load less than 2,000 kilowatts.\n(c) The commission shall make a final determination in a proceeding begun under this section within 90 days of a miscellaneous rate filing by the electric utility.\nThe commission shall establish or change a competitive rate schedule through a miscellaneous or general rate filing by the utility.\nWhen the commission authorizes a competitive rate schedule for a customer class, it shall set the terms and conditions of service for that schedule, which must include:\n(1) that the minimum rate for the schedule recover at least the incremental cost of providing the service, including the cost of additional capacity that is to be added while the rate is in effect and any applicable on-peak or off-peak differential;\n(2) that the maximum possible rate reduction under a competitive rate schedule does not exceed the difference between the electric utility's applicable standard tariff and the cost to the customer of the lowest cost competitive energy supply;\n(3) that the electric utility, within a general rate case, be allowed to seek recovery of the difference between the standard tariff and the competitive rate times the usage level during the test year period;\n(4) a determination that a rate within a competitive rate schedule meets the conditions of section 216B.03, for other customers in the same customer class;\n(5) that the rate does not compete with district heating or cooling provided by a district heating utility as defined by section 216B.166, subdivision 2, paragraph (c); and\n(6) that the rate may not be offered to a customer in which the utility has a financial interest greater than 50 percent.\nWithin its own assigned service territory, the utility, at its discretion and using its best judgment at the time, may offer a competitive rate to a customer subject to effective competition.\nNotwithstanding section 216B.16, subdivision 3, a proposed competitive rate takes effect on an interim basis after filing the proposed rate with the commission and on the date established by the electric utility. While an interim competitive rate is in effect, the difference between rates under the competitive rate and rates under the standard tariff for that class are not subject to recovery or refund. If the commission does not approve the competitive rate, the electric utility may seek to recover the difference in revenues between the interim competitive rate and the standard tariff from the customer that was offered the competitive rate.\n(a) Except as provided under subdivision 6, competitive rates offered by electric utilities under this section must be filed with the commission and must be approved, modified, or rejected by the commission within 90 days. The utility's filing must include statements of fact demonstrating that the proposed rates meet the standards of this subdivision. The filing must be served on the department and the Office of the Attorney General at the same time as it is served on the commission.\n(b) In reviewing a specific rate proposal, the commission shall determine:\n(1) that the rate meets the terms and conditions in subdivision 4, unless the commission determines that waiver of one or more terms and conditions would be in the public interest;\n(2) that the consumer can obtain its energy requirements from an energy supplier not rate-regulated by the commission under section 216B.16;\n(3) that the customer is not likely to take service from the electric utility seeking to offer the competitive rate if the customer was charged the electric utility's standard tariffed rate; and\n(4) that after consideration of environmental and socioeconomic impacts it is in the best interest of all other customers to offer the competitive rate to the customer subject to effective competition.\n(c) If the commission approves the competitive rate, it becomes effective as agreed to by the electric utility and the customer. If the competitive rate is modified by the commission, the commission shall issue an order modifying the competitive rate subject to the approval of the electric utility and the customer. Each party has ten days in which to reject the proposed modification. If no party rejects the proposed modification, the commissioner's order becomes final. If either party rejects the commission's proposed modification, the electric utility, on its behalf or on the behalf of the customer, may submit to the commission a modified version of the commission's proposal. The commission shall accept or reject the modified version within 30 days. If the commission rejects the competitive rate, it shall issue an order indicating the reasons for the rejection.\nIf the commission approves a competitive rate or the parties agree to a modified rate, the commission may require the electric utility to provide the customer with an energy audit and assist in implementing cost-effective energy efficiency improvements to assure that the customer's use of electricity is efficient. An investment in cost-effective energy conservation improvements required under this section must be treated as an energy conservation improvement program and included in the department's determination of significant investments under section 216B.241. The utility shall recover energy conservation improvement expenses in a rate proceeding under section 216B.16 or 216B.17 in the same manner as the commission authorizes for the recovery of conservation expenditures made under section 216B.241.\n[Repealed, 1995 c 6 s 2]\nNotwithstanding sections 216B.03, 216B.06, 216B.07, and 216B.16, a public utility whose rates are regulated under this chapter may, at its discretion, offer a reduced rate for tariffed electric services to eligible customers. The commission may approve a discretionary rate reduction provided that:\n(1) the reduction is offered to customers who are located within the exclusive service territory of the public utility that offers discretionary rate reductions or to potential customers who are not customers of a Minnesota electric utility, as defined in section 216B.38, but who propose to be located within the exclusive service territory of the public utility;\n(2) the reduction applies to customers requiring electric service with a connected load of at least 2,000 kilowatts;\n(3) the reduced rate recovers at least the incremental cost of providing the service, including the cost of additional capacity that is to be added while the rate is in effect and any applicable on-peak or off-peak differential;\n(4) in the event the commission has approved unbundled rates, the reduction is not offered for any unbundled service other than generation, unless the unbundled service is available to the customer from a competitive supplier;\n(5) the reduced rate does not compete with district heating or cooling services provided by a district heating utility as defined by section 216B.166, subdivision 2, paragraph (c); and\n(6) the reduced rate does not compete with a natural gas service provided by a natural gas utility and regulated by the commission.\n(a) Proposals for discretionary rate reductions offered by utilities must be filed with the commission, with copies of the filing served upon the department and the office of attorney general at the same time it is served upon the commission. The commission shall review the proposals according to procedures developed under section 216B.05, subdivision 2a. The commission shall not approve discretionary rate reductions offered by public utilities that do not have an accepted resource plan on file with the commission. The commission shall not approve discretionary rate reductions unless the utility has made the customer aware of all cost-effective opportunities for energy efficiency improvements offered by the utility.\n(b) Public utilities that provide service under discretionary rate reductions shall not, through increased revenue requirements or through prospective rate design changes, recover any revenues forgone due to the discretionary rate reductions, nor shall the commission grant such recovery.",
	"repealed": false
}