{
	"id": "260C.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.301",
	"title": "260C.301 TERMINATION OF PARENTAL RIGHTS.",
	"text": "The juvenile court may upon petition, terminate all rights of a parent to a child:\n(a) with the written consent of a parent who for good cause desires to terminate parental rights; or\n(b) if it finds that one or more of the following conditions exist:\n(1) that the parent has abandoned the child;\n(2) that the parent has substantially, continuously, or repeatedly refused or neglected to comply with the duties imposed upon that parent by the parent and child relationship, including but not limited to providing the child with necessary food, clothing, shelter, education, and other care and control necessary for the child's physical, mental, or emotional health and development, if the parent is physically and financially able, and either reasonable efforts by the social services agency have failed to correct the conditions that formed the basis of the petition or reasonable efforts would be futile and therefore unreasonable;\n(3) that a parent is palpably unfit to be a party to the parent and child relationship because of a consistent pattern of specific conduct before the child or of specific conditions directly relating to the parent and child relationship either of which are determined by the court to be of a duration or nature that renders the parent unable, for the reasonably foreseeable future, to care appropriately for the ongoing physical, mental, or emotional needs of the child. It is presumed that a parent is palpably unfit to be a party to the parent and child relationship upon a showing that the parent's parental rights to one or more other children were involuntarily terminated or that the parent's custodial rights to another child have been involuntarily transferred to a relative under a juvenile protection proceeding or a similar process of another jurisdiction;\n(4) that following the child's placement out of the home, reasonable efforts, under the direction of the court, have failed to correct the conditions leading to the child's placement. It is presumed that reasonable efforts under this clause have failed upon a showing that:\n(i) a child has resided out of the parental home under court order for a cumulative period of 12 months within the preceding 22 months. In the case of a child under age eight at the time the petition was filed alleging the child to be in need of protection or services, the presumption arises when the child has resided out of the parental home under court order for six months unless the parent has maintained regular contact with the child and the parent is complying with the out-of-home placement plan;\n(ii) the court has approved the out-of-home placement plan required under section 260C.212 and filed with the court under section 260C.178;\n(iii) conditions leading to the out-of-home placement have not been corrected. It is presumed that conditions leading to a child's out-of-home placement have not been corrected upon a showing that the parent or parents have not substantially complied with the court's orders and a reasonable case plan; and\n(iv) reasonable efforts have been made by the social services agency to rehabilitate the parent and reunite the family.\nThis clause does not prohibit the termination of parental rights prior to one year, or in the case of a child under age eight, prior to six months after a child has been placed out of the home.\nIt is also presumed that reasonable efforts have failed under this clause upon a showing that:\n(A) the parent has been diagnosed as chemically dependent by a professional certified to make the diagnosis;\n(B) the parent has been required by a case plan to participate in a chemical dependency treatment program;\n(C) the treatment programs offered to the parent were culturally, linguistically, and clinically appropriate;\n(D) the parent has either failed two or more times to successfully complete a treatment program or has refused at two or more separate meetings with a caseworker to participate in a treatment program; and\n(E) the parent continues to abuse chemicals.\n(5) that a child has experienced egregious harm in the parent's care that is of a nature, duration, or chronicity that indicates a lack of regard for the child's well-being, such that a reasonable person would believe it contrary to the best interest of the child or of any child to be in the parent's care;\n(6) that in the case of a child born to a mother who was not married to the child's father when the child was conceived nor when the child was born the person is not entitled to notice of an adoption hearing under section 259.49 and the person has not registered with the fathers' adoption registry under section 259.52;\n(7) that the child is neglected and in foster care; or\n(8) that the parent has been convicted of a crime listed in section 260.012, paragraph (g), clauses (1) to (5).\nIn an action involving an American Indian child, sections 260.751 to 260.835 and the Indian Child Welfare Act, United States Code, title 25, sections 1901 to 1923, control to the extent that the provisions of this section are inconsistent with those laws.\nFor purposes of subdivision 1, clause (b), item (1):\n(a) Abandonment is presumed when:\n(1) the parent has had no contact with the child on a regular basis and not demonstrated consistent interest in the child's well-being for six months and the social services agency has made reasonable efforts to facilitate contact, unless the parent establishes that an extreme financial or physical hardship or treatment for mental disability or chemical dependency or other good cause prevented the parent from making contact with the child. This presumption does not apply to children whose custody has been determined under chapter 257 or 518; or\n(2) the child is an infant under two years of age and has been deserted by the parent under circumstances that show an intent not to return to care for the child.\nThe court is not prohibited from finding abandonment in the absence of the presumptions in clauses (1) and (2).\n(b) The following are prima facie evidence of abandonment where there has been a showing that the person was not entitled to notice of an adoption proceeding under section 259.49:\n(1) failure to register with the fathers' adoption registry under section 259.52; or\n(2) if the person registered with the fathers' adoption registry under section 259.52:\n(i) filing a denial of paternity within 30 days of receipt of notice under section 259.52, subdivision 8;\n(ii) failing to timely file an intent to claim parental rights with entry of appearance form within 30 days of receipt of notice under section 259.52, subdivision 10; or\n(iii) timely filing an intent to claim parental rights with entry of appearance form within 30 days of receipt of notice under section 259.52, subdivision 10, but failing to initiate a paternity action within 30 days of receiving the fathers' adoption registry notice where there has been no showing of good cause for the delay.\n[Repealed, 2013 c 125 art 1 s 108]\nExcept for cases where the child is in placement due solely to the child's developmental disability or emotional disturbance, where custody has not been transferred to the responsible social services agency, and where the court finds compelling reasons to continue placement, the county attorney shall file a termination of parental rights petition or a petition to transfer permanent legal and physical custody to a relative under section 260C.515, subdivision 4, for all children who have been in out-of-home care for 15 of the most recent 22 months. This requirement does not apply if there is a compelling reason approved by the court for determining that filing a termination of parental rights petition or other permanency petition would not be in the best interests of the child or if the responsible social services agency has not provided reasonable efforts necessary for the safe return of the child, if reasonable efforts are required.\nFor purposes of subdivision 1, clause (a), an adoptive parent may not terminate parental rights to an adopted child for a reason that would not apply to a birth parent seeking termination of parental rights to a child under subdivision 1, clause (a).\nFor purposes of subdivision 1, clause (b), no prior judicial finding of need for protection or services, or neglected and in foster care is required, except as provided in subdivision 1, clause (b), item (5).\nIn any proceeding under this section, the best interests of the child must be the paramount consideration, provided that the conditions in subdivision 1, clause (a), or at least one condition in subdivision 1, clause (b), are found by the court. In proceedings involving an American Indian child, as defined in section 260.755, subdivision 8, the best interests of the child must be determined consistent with the Indian Child Welfare Act of 1978, United States Code, title 25, section 1901, et seq. Where the interests of parent and child conflict, the interests of the child are paramount.\nIn any proceeding under this section, the court shall make specific findings:\n(1) that reasonable efforts to finalize the permanency plan to reunify the child and the parent were made including individualized and explicit findings regarding the nature and extent of efforts made by the social services agency to rehabilitate the parent and reunite the family; or\n(2) that reasonable efforts for reunification are not required as provided under section 260.012.",
	"repealed": false
}