{
	"id": "103I.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.005",
	"title": "103I.005 DEFINITIONS.",
	"text": "The definitions in this chapter apply to this chapter.\n\"Bored geothermal heat exchanger\" means an earth-coupled heating or cooling device consisting of a sealed closed-loop piping system installed in a boring in the ground to transfer heat to or from the surrounding earth with no discharge.\n\"Boring\" means a hole or excavation that includes exploratory borings, bored geothermal heat exchangers, temporary borings, and elevator borings.\n\"Certified representative\" means a person certified by the commissioner to represent a well contractor, limited well/boring contractor, environmental well contractor, or elevator boring contractor.\n\"Commissioner\" means the commissioner of health.\n\"Department\" means the Department of Health.\n\"Dewatering well\" means a nonpotable well used to lower groundwater levels to allow for construction or use of underground space. A dewatering well does not include:\n(1) an excavation 25 feet or less in depth for temporary dewatering during construction; or\n(2) a well used to lower groundwater levels for control or removal of groundwater contamination.\n\"Drive point well\" means a well constructed by forcing a pointed well screen, attached to sections of pipe, into the ground with the screen and casing forced or driven into the ground with a hammer, maul, or weight.\n\"Elevator boring\" means a bore hole, jack hole, drilled hole, or excavation constructed to install an elevator hydraulic cylinder.\n\"Elevator boring contractor\" means a person with an elevator boring contractor's license issued by the commissioner.\n[Repealed, 1Sp2017 c 6 art 10 s 148]\n\"Environmental well\" means an excavation 15 or more feet in depth that is drilled, cored, bored, washed, driven, dug, jetted, or otherwise constructed to:\n(1) conduct physical, chemical, or biological testing of groundwater, and includes a groundwater quality monitoring or sampling well;\n(2) lower a groundwater level to control or remove contamination in groundwater, and includes a remedial well and excludes horizontal trenches; or\n(3) monitor or measure physical, chemical, radiological, or biological parameters of the earth and earth fluids, or for vapor recovery or venting systems. An environmental well includes an excavation used to:\n(i) measure groundwater levels, including a piezometer;\n(ii) determine groundwater flow direction or velocity;\n(iii) measure earth properties such as hydraulic conductivity, bearing capacity, or resistance;\n(iv) obtain samples of geologic materials for testing or classification; or\n(v) remove or remediate pollution or contamination from groundwater or soil through the use of a vent, vapor recovery system, or sparge point.\nAn environmental well does not include an exploratory boring.\n\"Environmental well contractor\" means a person with an environmental well contractor's license issued by the commissioner.\n\"Exploratory boring\" means a surface drilling done to explore or prospect for oil, natural gas, apatite, diamonds, graphite, gemstones, kaolin clay, and metallic minerals, including iron, copper, zinc, lead, gold, silver, titanium, vanadium, nickel, cadmium, molybdenum, chromium, manganese, cobalt, zirconium, beryllium, thorium, uranium, aluminum, platinum, palladium, radium, tantalum, tin, and niobium, and a drilling or boring for petroleum.\n\"Explorer\" means a person with an explorer's license issued by the commissioner.\n\"Groundwater thermal exchange device\" means a heating or cooling device that depends on extraction and reinjection of groundwater from an independent aquifer to operate.\n\"Limited well/boring contractor\" means a person with a limited well/boring contractor's license issued by the commissioner. Limited well/boring contractor's licenses are issued for:\n(1) constructing, repairing, and sealing bored geothermal heat exchangers;\n(2) installing, repairing, and modifying pitless units and pitless adaptors, well casings above the pitless unit or pitless adaptor, well screens, well diameters, and well pumps and pumping equipment;\n(3) constructing, repairing, and sealing dewatering wells; and\n(4) sealing wells and borings.\n[Repealed, 2005 c 106 s 68]\n[Repealed, 1Sp2017 c 6 art 10 s 148]\n[Repealed, 1Sp2017 c 6 art 10 s 148]\n\"Person\" means an individual, firm, partnership, association, or corporation or other entity including the United States government, any interstate body, the state, and any agency, department, or political subdivision of the state.\n\"Provisions of this chapter\" means the sections in this chapter and rules adopted by the commissioner under this chapter.\n\"Submerged closed loop heat exchanger\" means a heating and cooling device that:\n(1) is installed in a water supply well;\n(2) utilizes the convective flow of groundwater as the primary medium of heat exchange;\n(3) contains water as the heat transfer fluid; and\n(4) operates using a nonconsumptive recirculation.\nA submerged closed loop heat exchanger includes other necessary appurtenances such as submersible pumps, a heat exchanger, and piping.\n\"Temporary boring\" means an excavation that is 15 feet or more in depth, is sealed within 72 hours of the time of construction, and is drilled, cored, washed, driven, dug, jetted, or otherwise constructed to:\n(1) conduct physical, chemical, or biological testing of groundwater, including groundwater quality monitoring;\n(2) monitor or measure physical, chemical, radiological, or biological parameters of earth materials or earth fluids, including hydraulic conductivity, bearing capacity, or resistance;\n(3) measure groundwater levels, including use of a piezometer; and\n(4) determine groundwater flow direction or velocity.\n[Repealed, 1991 c 199 art 2 s 29; 1991 c 355 s 54]\n[Repealed, 1990 c 597 s 73]\n[Repealed, 2013 c 108 art 12 s 109]\n\"Water supply well\" means a well that is not a dewatering well or environmental well and includes wells used:\n(1) for potable water supply;\n(2) for irrigation;\n(3) for agricultural, commercial, or industrial water supply;\n(4) for heating or cooling;\n(5) for containing a submerged closed loop heat exchanger; and\n(6) for testing water yield for irrigation, commercial or industrial uses, residential supply, or public water supply.\n\"Well\" means an excavation that is drilled, cored, bored, washed, driven, dug, jetted, or otherwise constructed if the excavation is intended for the location, diversion, artificial recharge, monitoring, testing, remediation, or acquisition of groundwater. Well includes environmental wells, drive point wells, and dewatering wells. \"Well\" does not include:\n(1) an excavation by backhoe, or otherwise for temporary dewatering of groundwater for nonpotable use during construction, if the depth of the excavation is 25 feet or less;\n(2) an excavation made to obtain or prospect for oil, natural gas, minerals, or products of mining or quarrying;\n(3) an excavation to insert media to repressure oil or natural gas bearing formations or to store petroleum, natural gas, or other products;\n(4) an excavation for nonpotable use for wildfire suppression activities; or\n(5) borings.\n\"Well disclosure certificate\" means a certificate containing the requirements of section 103I.235, subdivision 1, paragraph (j).\n\"Well contractor\" means a person with a well contractor's license.\nA \"well that is in use\" means a well that operates on a daily, regular, or seasonal basis. A well in use includes a well that operates for the purpose of irrigation, fire protection, or emergency pumping.\n\"Wellhead protection area\" means the surface and subsurface area surrounding a well or well field that supplies a public water system, through which contaminants are likely to move toward and reach the well or well field.",
	"repealed": false
}