{
	"id": "17.985",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.985",
	"title": "17.985 PASSING ON THE FARM CENTER.",
	"text": "The Passing on the Farm Center is established as a part of Southwest Technical College in Granite Falls to assist individuals beginning farming and family farming operations. The center shall also assist in facilitating the transition of farming operations from established farmers to beginning farmers by creating and maintaining an information base inventorying land and facilities available for acquisition and bringing them together to increase the number of family farming operations in this state. The objectives of the center include, but are not limited to, the following:\n(1) using the services of a certified public accountant, real estate agents, and attorneys to provide education in estate planning and farm transfer programs for interested retiring farmers;\n(2) assessing needs of beginning farmers and retiring farmers in order to identify program and service opportunities including developing statewide apprenticeship programs between beginning and retiring farmers; and\n(3) developing, coordinating, and delivering statewide through Southwest Technical College in Granite Falls and other entities, as appropriate, targeted education to beginning farmers and retiring farm families.\nPrograms and services provided by the center must include, but are not limited to, the development of skills and knowledge in farm estate planning and other topics related to intergenerational farm transfer. The center shall develop and distribute a detailed questionnaire for interested retired farmers and landowners and beginning farmers for the purpose of connecting them with each other and to develop computerized lists. The center shall coordinate to the extent practicable with agricultural information centers.\nThe center shall submit a report annually to the legislature on or before February 1. The report shall include, but is not limited to, recommendations for methods by which more individuals may be encouraged to enter agriculture.",
	"repealed": false
}