{
	"id": "268.0625",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.0625",
	"title": "268.0625 REVOCATIONS OF BUSINESS LICENSES.",
	"text": "The state of Minnesota or a political subdivision may not issue, transfer, or renew, and must revoke a license for the conduct of any profession, trade, or business, if the commissioner notifies the licensing authority that the licensee, applicant, or employer owes any amount due under this chapter or section 116L.20, of $500 or more. A licensing authority that has received a notice may issue, transfer, renew, or not revoke the license only if the licensing authority has received a copy of the debt clearance certificate issued by the commissioner.\nThe commissioner may issue a debt clearance certificate only if:\n(1) the licensee has fully paid any amounts due under this chapter or section 116L.20; or\n(2) the licensee has entered into an agreement to pay the total amount due and is current with all the terms of that agreement.\nFor the purposes of this section, \"licensee\" means:\n(1) an individual if the license is issued to or in the name of an individual, or the corporation, limited liability company, or partnership if the license is issued to or in the name of a corporation, limited liability company, or partnership; or\n(2) an officer of a corporation, manager of a limited liability company, or a member of a partnership, or an individual who is liable for amounts due under this chapter or section 116L.20, either for the entity that the license is at issue or for another entity that the liability was incurred, or personally as a licensee. \"Licensee\" includes both the transferor and the transferee of the license and any holder of a license.\nAt least 30 calendar days before the commissioner notifies a licensing authority, a determination of action under this section must be sent to the licensee by mail or electronic transmission. If the licensee disputes the action, the licensee must appeal within 45 calendar days after the sending of the determination to the licensee. The only issue on any appeal is whether the commissioner has complied with the requirements of this section. Proceedings on the appeal are conducted in accordance with section 268.105.\nUpon request, the licensing authority must provide the commissioner with a list of all licensees, including the name, address, business name and address, Social Security number, and business identification number. The commissioner may request a list of the licensees no more than once each calendar year. Regardless of section 268.19, the commissioner may release information necessary to accomplish this section.",
	"repealed": false
}