{
	"id": "256D.024",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.024",
	"title": "256D.024 PERSONS PROHIBITED FROM RECEIVING BENEFITS.",
	"text": "(a) An individual who has been convicted of a felony-level drug offense during the previous ten years from the date of application or recertification may be subject to random drug testing. The county must provide information about substance use disorder treatment programs to a person who tests positive for an illegal controlled substance.\n(b) For the purposes of this subdivision, \"drug offense\" means a conviction that occurred during the previous ten years from the date of application or recertification of sections 152.021 to 152.025, 152.0261, 152.0262, or 152.096. Drug offense also means a conviction in another jurisdiction of the possession, use, or distribution of a controlled substance, or conspiracy to commit any of these offenses, if the conviction occurred during the previous ten years from the date of application or recertification and the conviction is for a crime that would be a felony if committed in Minnesota.\n(c) This subdivision does not apply for convictions or positive test results related to cannabis, marijuana, or tetrahydrocannabinols.\nAn individual violating a condition of probation or parole or supervised release imposed under federal law or the law of any state is ineligible to receive benefits under this chapter.\nAn individual who is fleeing to avoid prosecution, or custody, or confinement after conviction for a crime that would be a felony if committed in Minnesota, is ineligible to receive benefits under this chapter.\nAn individual who is convicted in federal or state court of having made a fraudulent statement or representation with respect to the place of residence of the individual in order to receive assistance simultaneously from two or more states is ineligible to receive benefits under this chapter for ten years beginning on the date of the conviction.",
	"repealed": false
}