{
	"id": "144.9501",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9501",
	"title": "144.9501 DEFINITIONS.",
	"text": "Sections 144.9501 to 144.9512 may be cited as the \"Lead Poisoning Prevention Act.\"\nThe definitions in this section apply to sections 144.9501 to 144.9512.\n\"Abatement\" means any set of measures intended to eliminate known or presumed lead hazards. Abatement includes:\n(1) the removal of lead-based paint and lead-contaminated dust, the permanent enclosure or encapsulation of lead-based paint, the replacement of lead-painted surfaces or fixtures, and the removal or enclosure of lead-contaminated soil; and\n(2) all preparation, cleanup, disposal, and postabatement clearance testing activities associated with these measures.\n\"Areas at high risk for toxic lead exposure\" means a census tract in a city of the first class or a county or area within a county outside a city of the first class that has been determined to be at high risk for toxic lead exposure under section 144.9503.\n\"Assessing agency\" means the commissioner or a community health board with authority and responsibility to conduct lead risk assessments in response to reports of children or pregnant women with elevated blood lead levels.\n\"Bare soil\" means any visible soil that is at least an area of 36 contiguous square inches.\n[Renumbered subd 7a]\n\"Child\" means an individual up to 72 months of age.\n\"Clearance inspection\" means a visual identification of deteriorated paint and bare soil and a resampling and analysis of interior dust lead concentrations in a residence to ensure that the lead standards established in rules adopted under section 144.9508 are not exceeded.\n\"Capillary blood sample\" means a quantity of blood drawn from a capillary. The sample generally is collected by finger stick.\n\"Certified lead firm\" means a person that employs individuals to perform regulated lead work, with the exception of renovation, and is certified by the commissioner under section 144.9505.\n\"Certified renovation firm\" means a person that employs individuals to perform renovation and is certified by the commissioner under section 144.9505.\n\"Commissioner\" means the commissioner of the Minnesota Department of Health.\n[Renumbered subd 7b]\n\"Community health board\" means an administrative authority established under section 145A.03.\n\"Contracting entity\" means a public or private body, board, individual, corporation, partnership, proprietorship, joint venture, fund, authority, or similar entity that contracts with a person to do regulated lead work.\n\"Deteriorated paint\" means paint that is chipped, peeled, or otherwise separated from its substrate or that is attached to damaged substrate.\n\"Disclosure pamphlet\" means the EPA pamphlet titled \"Renovate Right: Important Lead Hazard Information for Families, Child Care Providers and Schools\" developed under section 406(a) of the Toxic Substance Control Act.\n\"Elevated blood lead level\" means a diagnostic blood lead test with a result that is equal to or greater than 3.5 micrograms of lead per deciliter of whole blood in any person, unless the commissioner finds that a lower concentration is necessary to protect public health.\n\"Encapsulation\" means covering a surface coated with paint that exceeds the standards under section 144.9508 with a liquid or solid material that adheres to the surface, rather than mechanically attaches to it; or covering bare soil that exceeds the standards under section 144.9508 with a permeable material such as vegetation, mulch, or soil that meets the standards under section 144.9508.\n\"Enclosure\" means covering a surface coated with paint that exceeds the standards under section 144.9508 by mechanically fastening to the surface a durable, solid material; or covering bare soil that exceeds the standards under section 144.9508 with an impermeable material, such as asphalt or concrete.\n[Repealed, 1998 c 407 art 2 s 109]\n\"Intact paint\" means paint that is not chipped, peeled, or otherwise separated from its substrate or attached to damaged substrate. Painted surfaces which may generate dust but are not chipped, peeled, or otherwise separated from their substrate or attached to damaged substrate are considered to be intact paint.\n\"Interim controls\" means a set of measures intended to temporarily reduce human exposure or likely exposure to known or presumed lead hazards, including specialized cleaning, repairs, maintenance, painting, temporary encapsulation, or enclosure.\n[Repealed, 1998 c 407 art 2 s 109]\n\"Lead hazard\" means a condition that causes exposure to lead from dust, bare soil, drinking water, or deteriorated paint that exceeds the standards adopted under section 144.9508.\n[Repealed, 1998 c 407 art 2 s 109]\n(a) \"Lead hazard reduction\" means abatement, swab team services, or interim controls undertaken to make a residence, child care facility, school, playground, or other location where lead hazards are identified lead-safe by complying with the lead standards and methods adopted under section 144.9508.\n(b) Lead hazard reduction does not include renovation activity that is primarily intended to remodel, repair, or restore a given structure or dwelling rather than abate or control lead-based paint hazards.\n(c) Lead hazard reduction does not include activities that disturb painted surfaces that total:\n(1) less than 20 square feet (two square meters) on exterior surfaces; or\n(2) less than two square feet (0.2 square meters) in an interior room.\n\"Lead hazard screen\" means a limited risk assessment activity that involves the visual identification of dust, paint, or bare soil and sampling and analysis of dust.\n[Repealed, 2009 c 79 art 10 s 51]\n\"Lead inspection\" means a surface by surface investigation to determine the presence of lead content of paint and a visual identification of the existence and location of bare soil.\n\"Lead inspector\" means a person who is licensed by the commissioner to perform a lead inspection under section 144.9505.\n\"Lead project design\" means site-specific written project specifications for a regulated lead work project. Lead project design includes written technical project specifications incorporated into bidding documents.\n\"Lead order\" means a legal instrument to compel a property owner to engage in lead hazard reduction according to the specifications given by the assessing agency.\n\"Lead project designer\" means an individual who is responsible for planning the site-specific performance of regulated lead work and who has been licensed by the commissioner under section 144.9505.\n\"Lead risk assessment\" means an investigation to determine the existence, nature, severity, and location of lead hazards.\n\"Lead risk assessor\" means an individual who performs lead risk assessments or lead inspections and who has been licensed by the commissioner under section 144.9505.\n\"Lead-safe\" means a condition in which:\n(1) lead is not present;\n(2) lead may be present at the residence, child care facility, school, or playground, if the lead concentration in the dust, paint, soil, and water of a residence does not exceed the standards adopted under section 144.9508; or\n(3) if the lead concentrations in the paint or soil do exceed the standards, the paint is intact and the soil is not bare soil.\n\"Lead-safe practices\" means methods for construction, renovation, remodeling, or maintenance activities that are not regulated lead work and that are performed so that they do not:\n(1) violate the standards under section 144.9508;\n(2) create lead dust through the use of prohibited practices;\n(3) leave debris or a lead residue that can form a dust;\n(4) provide a readily accessible source of lead dust, lead paint, lead paint chips, or lead-contaminated soil, after the use of containment methods; and\n(5) result in improper disposal of lead-contaminated debris, dust, or soil.\n\"Lead supervisor\" means an individual who is responsible for the on-site performance of abatement or interim controls and who has been licensed by the commissioner under section 144.9505.\n\"Lead sampling technician\" means an individual who performs clearance inspections for renovation sites and lead dust sampling for nonabatement sites.\n\"Lead worker\" means an individual who performs abatement or interim control work and who has been licensed by the commissioner under section 144.9505.\n\"Person\" has the meaning given in section 326.71, subdivision 8.\n\"Persons at high risk for elevated blood lead level\" means:\n(1) a child between six and 72 months of age:\n(i) who lives in or visits, at least weekly, a residence, child care facility, or school built before 1978 which has peeling or chipping paint, ongoing remodeling or renovation, or bare soil; or\n(ii) who has a sibling, housemate, or playmate who has been diagnosed with an elevated blood lead level in the last 12 months; and\n(2) a pregnant female or a child between six and 72 months of age:\n(i) who lives in a census tract found to have a median foundation soil lead value exceeding 100 parts per million of lead;\n(ii) who lives near an industrial point source that emits lead;\n(iii) who lives near a road with an average daily traffic which exceeded 5,000 vehicles per day in 1986 or earlier; or\n(iv) who lives with a person whose occupation or hobby involves exposure to lead.\n\"Play area\" means any established area where children play, or on residential property, any established area where children play or bare soil is accessible to children.\n\"Primary prevention\" means preventing toxic lead exposure before blood levels become elevated.\n\"Regulated lead work\" means:\n(1) abatement;\n(2) interim controls;\n(3) a clearance inspection;\n(4) a lead hazard screen;\n(5) a lead inspection;\n(6) a lead risk assessment;\n(7) lead project designer services;\n(8) lead sampling technician services;\n(9) swab team services;\n(10) renovation activities;\n(11) lead hazard reduction; or\n(12) activities performed to comply with lead orders issued by an assessing agency.\n(a) \"Renovation\" means the modification of any pre-1978 affected property for compensation that results in the disturbance of known or presumed lead-containing painted surfaces defined under section 144.9508, unless that activity is performed as lead hazard reduction. A renovation performed for the purpose of converting a building or part of a building into an affected property is a renovation under this subdivision.\n(b) Renovation does not include minor repair and maintenance activities described in this paragraph. All activities that disturb painted surfaces and are performed within 30 days of other activities that disturb painted surfaces in the same room must be considered a single project when applying the criteria below. Unless the activity involves window replacement or demolition of a painted surface, building component, or portion of a structure, for purposes of this paragraph, \"minor repair and maintenance\" means activities that disturb painted surfaces totaling:\n(1) less than 20 square feet (two square meters) on exterior surfaces; or\n(2) less than six square feet (0.6 square meters) in an interior room.\n(c) Renovation does not include total demolition of a freestanding structure. For purposes of this paragraph, \"total demolition\" means demolition and disposal of all interior and exterior painted surfaces, including windows. Unpainted foundation building components remaining after total demolition may be reused.\n\"Lead renovator\" means an individual who directs individuals who perform renovations. A lead renovator also performs renovation, surface coating testing, and cleaning verification.\n\"Safe housing\" means a residence that is lead-safe.\n\"Secondary prevention\" means intervention to mitigate health effects on people with elevated blood lead levels.\n\"Standard\" means a quantitative assessment of lead in any environmental media or consumer product.\n\"Swab team services\" means activities that provide protection from lead hazards primarily through the use of interim controls, such as:\n(1) removing lead dust by washing, vacuuming with high efficiency particle accumulator (HEPA) or wet vacuum cleaners, and cleaning the interior of residential property;\n(2) removing loose paint and paint chips and repainting or installing guards to protect intact paint;\n(3) covering or replacing bare soil that has a lead concentration of 100 parts per million or more;\n(4) health education;\n(5) advice and assistance to help residents locate and move to a temporary residence while lead hazard reduction is being completed; or\n(6) any other assistance necessary to meet the resident's immediate needs as a result of the relocation.\n\"Swab team worker\" means an individual who performs swab team services and who has been licensed by the commissioner as a lead worker under section 144.9505.\n\"Venous blood sample\" means a quantity of blood drawn from a vein.\n[Repealed, 2001 c 205 art 1 s 43]\n\"Compensation\" means money or other mutually agreed upon form of payment given or received for regulated lead work, including rental payments, rental income, or salaries derived from rental payments.\n\"Individual\" means a natural person.",
	"repealed": false
}