{
	"id": "123B.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.53",
	"title": "123B.53 DEBT SERVICE EQUALIZATION PROGRAM.",
	"text": "(a) For purposes of this section, the eligible debt service revenue of a district is defined as follows:\n(1) the amount needed to produce between five and six percent in excess of the amount needed to meet when due the principal and interest payments on the obligations of the district for eligible projects according to subdivision 2, excluding the amounts listed in paragraph (b), minus\n(2) the amount of debt service excess levy reduction for that school year calculated according to the procedure established by the commissioner.\n(b) The obligations in this paragraph are excluded from eligible debt service revenue:\n(1) obligations under section 123B.61;\n(2) the part of debt service principal and interest paid from the taconite environmental protection fund or Douglas J. Johnson economic protection trust, excluding the portion of taconite payments from the Iron Range schools and community development account under section 298.28, subdivision 7a;\n(3) obligations for long-term facilities maintenance under section 123B.595;\n(4) obligations under section 123B.62; and\n(5) obligations equalized under section 123B.535.\n(c) For purposes of this section, if a preexisting school district reorganized under sections 123A.35 to 123A.43, 123A.46, and 123A.48 is solely responsible for retirement of the preexisting district's bonded indebtedness or capital loans, debt service equalization aid must be computed separately for each of the preexisting districts.\n(d) For purposes of this section, the adjusted net tax capacity determined according to sections 127A.48 and 273.1325 shall be adjusted to include the tax capacity of property generally exempted from ad valorem taxes under section 272.02, subdivision 64.\n(a) The following portions of a district's debt service levy qualify for debt service equalization:\n(1) debt service for repayment of principal and interest on bonds issued before July 2, 1992;\n(2) debt service for bonds refinanced after July 1, 1992, if the bond schedule has been approved by the commissioner and, if necessary, adjusted to reflect a 20-year maturity schedule; and\n(3) debt service for bonds issued after July 1, 1992, for construction projects that have received a positive review and comment according to section 123B.71, if the commissioner has determined that the district has met the criteria under section 126C.69, subdivision 3, and if the bond schedule has been approved by the commissioner and, if necessary, adjusted to reflect a 20-year maturity schedule.\n(b) The criterion described in section 126C.69, subdivision 3, paragraph (a), clause (9), does not apply to bonds authorized by elections held before July 1, 1992.\n(c) For the purpose of this subdivision the department shall determine the eligibility for sparsity at the location of the new facility, or the site of the new facility closest to the nearest operating school if there is more than one new facility.\n(d) Notwithstanding paragraphs (a) to (c), debt service for repayment of principal and interest on bonds issued after July 1, 1997, does not qualify for debt service equalization aid unless the primary purpose of the facility is to serve students in kindergarten through grade 12.\nA district eligible for debt service equalization revenue under subdivision 2 must notify the commissioner of the amount of its intended debt service revenue calculated under subdivision 1 for all bonds sold prior to the notification by July 1 of the calendar year the levy is certified.\n(a) The debt service equalization revenue of a district equals the sum of the first tier debt service equalization revenue and the second tier debt service equalization revenue.\n(b) The first tier debt service equalization revenue of a district equals the greater of zero or the eligible debt service revenue minus the amount raised by a levy of 15.74 percent times the adjusted net tax capacity of the district minus the second tier debt service equalization revenue of the district.\n(c) The second tier debt service equalization revenue of a district equals the greater of zero or the eligible debt service revenue, minus the amount raised by a levy of 26.24 percent times the adjusted net tax capacity of the district.\n(d) Notwithstanding paragraphs (b) and (c), for a district with a capital loan under sections 126C.60 to 126C.72, the first tier debt equalization revenue equals zero, and the second tier debt equalization revenue equals the portion of the district's eligible debt service levy under subdivision 2 in excess of the district's maximum effort debt service levy under section 126C.63, subdivision 8.\n(a) The equalized debt service levy of a district equals the sum of the first tier equalized debt service levy and the second tier equalized debt service levy.\n(b) A district's first tier equalized debt service levy equals the district's first tier debt service equalization revenue times the lesser of one or the ratio of:\n(1) the quotient derived by dividing the adjusted net tax capacity of the district for the year before the year the levy is certified by the adjusted pupil units in the district for the school year ending in the year prior to the year the levy is certified; to\n(2) $3,400 in fiscal year 2016, $4,430 in fiscal year 2017, and the greater of $4,430 or 55.33 percent of the initial equalizing factor in fiscal year 2018 and later.\n(c) A district's second tier equalized debt service levy equals the district's second tier debt service equalization revenue times the lesser of one or the ratio of:\n(1) the quotient derived by dividing the adjusted net tax capacity of the district for the year before the year the levy is certified by the adjusted pupil units in the district for the school year ending in the year prior to the year the levy is certified; to\n(2) $8,000 in fiscal years 2016 and 2017, and the greater of $8,000 or 100 percent of the initial equalizing factor in fiscal year 2018 and later.\n(d) For the purposes of this subdivision, the initial equalizing factor equals the quotient derived by dividing the total adjusted net tax capacity of all school districts in the state for the year before the year the levy is certified by the total number of adjusted pupil units in all school districts in the state in the year before the year the levy is certified.\n(a) A district's debt service equalization aid is the sum of the district's first tier debt service equalization aid and the district's second tier debt service equalization aid.\n(b) A district's first tier debt service equalization aid equals the difference between the district's first tier debt service equalization revenue and the district's first tier equalized debt service levy.\n(c) A district's second tier debt service equalization aid equals the difference between the district's second tier debt service equalization revenue and the district's second tier equalized debt service levy.\nDebt service equalization aid must be paid according to section 127A.45, subdivision 10.",
	"repealed": false
}