{
	"id": "13.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.045",
	"title": "13.045 SAFE AT HOME PROGRAM PARTICIPANT DATA.",
	"text": "As used in this section:\n(1) \"program participant\" has the meaning given in section 5B.02, paragraph (g);\n(2) \"location data\" means data the participant specifies that may be used to physically locate a program participant, such as the program participant's residential address, work address, or school address, and that is collected, received, or maintained by a government entity prior to the date a program participant's certification expires, or the date the entity receives notice that the program participant has withdrawn from the program, whichever is earlier;\n(3) \"identity data\" means data that may be used to identify a program participant, including the program participant's name, phone number, email address, address designated under chapter 5B, Social Security number, or driver's license number, and that is collected, received, or maintained by a government entity before the date a program participant's certification expires, or the date the entity receives notice that the program participant has withdrawn from the program, whichever is earlier;\n(4) \"county recorder\" means the county official who performs the functions of the county recorder or registrar of titles to record a document as part of the county real estate document recording system, regardless of title or office; and\n(5) \"real property records\" means any record of data that is maintained as part of the county real estate document recording system for use by the public, data on assessments, data on real or personal property taxation, and other data on real property.\n(a) A program participant may notify the responsible authority of any government entity other than the county recorder in writing, on a form prescribed by the secretary of state, that the participant is certified in the Safe at Home address confidentiality program pursuant to chapter 5B. The notice must include the program participant's name, date of birth, address designated under chapter 5B, program participant signature, signature of the participant's parent or guardian if the participant is a minor, date the program participant's certification in the program expires, and any other information specified by the secretary of state. A program participant may submit a subsequent notice of certification, if the participant's certification is renewed. The contents of the notification of certification are private data on individuals. A notice provided pursuant to this paragraph is a request to protect location data unless the participant requests that specific identity data also be protected.\n(b) To affect real property records, a program participant must submit a real property notice in writing to the county recorder in the county where the property identified in the real property notice is located. To affect real property records maintained by any other government entity, a program participant must submit a real property notice in writing to the other government entity's responsible authority. A real property notice must be on a form prescribed by the secretary of state and must include:\n(1) the full legal name of the program participant, including middle name;\n(2) the last four digits of the program participant's Social Security number;\n(3) the participant's date of birth;\n(4) the designated address of the program participant as assigned by the secretary of state, including lot number;\n(5) the legal description and street address, if any, of the real property affected by the notice;\n(6) the address of the Office of the Secretary of State; and\n(7) the signature of the program participant.\nOnly one parcel of real property may be included in each notice, but more than one notice may be presented. The recipient of the notice may require a program participant to provide additional information necessary to identify the records of the program participant or the real property described in the notice. A program participant must submit a subsequent real property notice for the real property if the participant's legal name changes. The real property notice is private data on individuals.\n(a) Identity and location data for which a program participant seeks protection under subdivision 2, paragraph (a), that are not otherwise classified by law as not public are private data on individuals.\n(b) Notwithstanding any provision of law to the contrary, private or confidential location data on a program participant who submits a notice under subdivision 3, paragraph (a), may not be shared with any other government entity or nongovernmental entity unless:\n(1) the program participant has expressly consented in writing to sharing or dissemination of the data for the purpose for which the sharing or dissemination will occur;\n(2) the data are subject to sharing or dissemination pursuant to court order under section 13.03, subdivision 6;\n(3) the data are subject to sharing pursuant to section 5B.07, subdivision 2;\n(4) the location data related to county of residence are needed to provide public assistance or other government services, or to allocate financial responsibility for the assistance or services;\n(5) the data are necessary to perform a government entity's health, safety, or welfare functions, including the provision of emergency 911 services, the assessment and investigation of child or vulnerable adult abuse or neglect, or the assessment or inspection of services or locations for compliance with health, safety, or professional standards; or\n(6) the data are necessary to aid an active law enforcement investigation of the program participant.\n(c) Data disclosed under paragraph (b), clauses (4) to (6), may be used only for the purposes authorized in this subdivision and may not be further disclosed to any other person or government entity. Government entities receiving or sharing private or confidential data under this subdivision shall establish procedures to protect the data from further disclosure.\n(d) Real property record data are governed by subdivision 4a.\n(e) Notwithstanding sections 15.17 and 138.17, a government entity may amend records to replace a participant's location data with the participant's designated address.\nRegardless of whether a notice of certification has been submitted under subdivision 2, a government entity must accept the address designated by the secretary of state as a program participant's address, and is subject to the requirements contained in section 5B.05, paragraphs (a) to (c).\n(a) If a program participant submits a notice under subdivision 2, paragraph (b), the government entity must not disclose the program participant's identity data in conjunction with the property identified in the written notice in the entity's real property records, unless:\n(1) the program participant has consented to sharing or dissemination of the data for the purpose identified in a writing acknowledged by the program participant;\n(2) the data are subject to sharing or dissemination pursuant to court order under section 13.03, subdivision 6;\n(3) the secretary of state authorizes the sharing or dissemination of the data under subdivision 4b for the purpose identified in the authorization; or\n(4) the data is shared with a government entity subject to this chapter for the purpose of administering assessment and taxation laws.\nThis subdivision does not prevent a county recorder from returning original documents to the individuals that submitted the documents for recording. This subdivision does not prevent the public disclosure of the participant's name and address designated under chapter 5B in the county reception index if the participant's name and designated address are not disclosed in conjunction with location data. Each government entity shall establish procedures for recording or filing documents to comply with this subdivision. These procedures may include masking identity or location data and making documents or certificates of title containing the data private and not viewable except as allowed by this paragraph. The procedure must comply with the requirements of chapters 386, 507, 508, and 508A and other laws as appropriate, to the extent these requirements do not conflict with this section. The procedures must provide public notice of the existence of recorded documents and certificates of title that are not publicly viewable and the provisions for viewing them under this subdivision. Notice that a document or certificate is private and viewable only under this subdivision or subdivision 4b is deemed constructive notice of the document or certificate.\n(b) If the recipient of the real property notice is the county recorder, the county recorder shall notify the county's responsible authority and provide a copy to the secretary of state at the address specified in the notice. If the recipient of the notice is the responsible authority, the responsible authority shall provide a copy to the secretary of state at the address specified by the secretary of state in the notice.\n(c) Paragraph (a) applies only to the records recorded or filed concurrently with the real property notice specified in subdivision 2, paragraph (b), and real property records affecting the same real property created or recorded subsequent to the government entity's receipt of the real property notice.\n(d) The prohibition on disclosure in paragraph (a) continues until:\n(1) the program participant has consented to the termination of the real property notice in a writing acknowledged by the program participant. Notification under this paragraph must be given by the government entity to the secretary of state within 90 days of the termination;\n(2) the real property notice is terminated pursuant to a court order. Notification under this paragraph must be given by the government entity to the secretary of state within 90 days of the termination;\n(3) the program participant no longer holds a record interest in the real property identified in the real property notice. Notification under this paragraph must be given by the government entity to the secretary of state within 90 days of the termination; or\n(4) the secretary of state has given written notice to the government entity who provided the secretary of state with a copy of a participant's real property notice that the program participant's certification has terminated. Notification under this paragraph must be given by the secretary of state within 90 days of the termination.\nUpon termination of the prohibition of disclosure, the government entity shall make publicly viewable all documents and certificates of title relative to the participant that were previously partially or wholly private and not viewable.\n(a) Upon request, the secretary of state may share data regarding a program participant's real property records for the purpose of confirming or denying that the program participant's real property is the property subject to a bona fide title examination. The request must include:\n(1) the name, title, address, and affiliated organization, if applicable, of the person requesting data;\n(2) the purpose for requesting data;\n(3) the requestor's relationship, if any, to the program participant subject to the data; and\n(4) the legal description of the property subject to the title examination and any other information required by the secretary of state to respond to the request.\nThe secretary of state shall approve or deny a request for access to data within two business days.\n(b) In responding to a bona fide request, the secretary of state may respond by an affirmation in writing that the property subject to the title examination is or is not the property subject to a program participant's real property notice. Notwithstanding subdivision 4a, or any law to the contrary, a party examining title may rely conclusively on the information contained in a written affirmation from the secretary of state.\n(c) Location data disclosed under this subdivision may be used only for the purposes authorized in this subdivision and may not be further disclosed to any other person. A person receiving private data under this subdivision shall establish procedures to protect the data from further disclosure.\nNothing in this section establishes a duty for:\n(1) the Office of the Secretary of State to identify other government entities that may hold data on a program participant; or\n(2) the responsible authority of any government entity to independently determine whether it maintains data on a program participant, unless a request is received pursuant to section 13.04 or a notice of certification is submitted pursuant to this section.\nNotwithstanding any law to the contrary, after a government entity receives a notice under subdivision 2 or 4a, if the government entity seeks to serve process upon a program participant, the service must be made by personal service or service by mail upon the secretary of state under section 5B.03, subdivision 1, clause (3). In an action in which service by publication is required or necessary, publication is valid if the publication omits the name of the program participant and the secretary of state has been served as provided in this subdivision.\nNothing in this section prevents a government entity from sharing program participant data with the secretary of state for the purpose of facilitating compliance with this section.",
	"repealed": false
}