{
	"id": "149A.96",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.96",
	"title": "149A.96 DISINTERMENT AND REINTERMENT.",
	"text": "Except as provided in this section, no dead human body or human remains shall be disinterred and reinterred without the written authorization of the person or persons legally entitled to control the body or remains and a disinterment-reinterment permit properly issued by the commissioner or a licensed mortician. Permits shall contain the information required on the permit form as furnished by the commissioner.\nFor purposes of this section, \"interment\" means final disposition by burial or entombment. Bodies held in a receiving vault for nonwinter burials pursuant to a directive from the person or persons with legal right to control final disposition and section 306.99 shall not be considered interred for purposes of this section.\nThe authorities in charge of a cemetery may disinter and reinter a body or remains within the same dedicated cemetery upon receipt of the written and notarized authorization of the person or persons with the right to control the disposition as described in section 149A.80.\nIf the disinterment is opposed, no disinterment-reinterment permit shall be issued until the state registrar or licensed mortician receives a certified copy of a court order that specifically orders the disinterment and reinterment.\nA presumption against removal operates against anyone who seeks to have a body or remains disinterred. To overcome the presumption, the party requesting disinterment must show reasonable cause for disinterment. A district court in the district where the body or remains are interred shall consider the following factors when deciding whether reasonable cause for disinterment exists:\n(1) the degree of relationship that the party seeking disinterment bears to the body or remains;\n(2) the degree of relationship that the party seeking to prevent disinterment bears to the body or remains;\n(3) if applicable, the expressed wishes of the decedent;\n(4) the conduct of the party requesting disinterment, especially as it may relate to the circumstances of the original interment;\n(5) the conduct of the party opposing disinterment, especially as it may relate to the circumstances of the original interment;\n(6) the length of time that has elapsed since the original interment;\n(7) the strength of the reasons offered both in favor of and in opposition to disinterment; and\n(8) the integrity and capacity of the party seeking disinterment to provide a secure and comparable resting place for the body or remains.\nAll disinterred bodies or remains removed from a dedicated cemetery shall be transported in an appropriate container and manner.\nThe cemetery where the body or remains were originally interred shall retain a copy of the disinterment-reinterment permit, the authorization to disinter, and, if applicable, the court order showing reasonable cause to disinter. Until the body or remains are reinterred the original permit and other documentation shall be in the possession of the person in physical or legal custody of the body or remains, or attached to the transportation container which holds the body or remains. At the time of reinterment, the permit and other documentation shall be filed according to the laws, rules, or regulations of the state or country where reinterment occurs. If the death occurred in Minnesota, the state registrar or a licensed mortician shall inform the person requesting the disinterment and reinterment of the right to request an amendment to the death record according to Minnesota Rules, chapter 4601.\nThe opening of any disinterred casket or alternative container is prohibited except when so ordered by a court of competent jurisdiction.\nSubject to section 149A.95, subdivision 16, inurnment of the hydrolyzed or cremated remains and release to an appropriate party is considered final disposition and no further permits or authorizations are required for disinterment, transportation, or placement of the hydrolyzed or cremated remains.\nIn addition to any disciplinary action or measures taken by the commissioner pursuant to this chapter, any person violating this section may be guilty of a felony pursuant to section 307.08, subdivision 2.",
	"repealed": false
}