{
	"id": "216B.023",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.023",
	"title": "216B.023 SHARED-METERED RESIDENTIAL BUILDINGS; BILLING; CONSUMER PROTECTIONS.",
	"text": "(a) If utility service is submetered, utility bills provided by landlords to tenants must be based on actual submeter readings. If natural gas service is apportioned, landlords must comply with section 504B.216, subdivisions 5 and 6.\n(b) Landlords are prohibited from billing submetered tenants or tenants whose natural gas service is apportioned less frequently than the landlord is billed by the utility. Landlords must include in the lease, or provide a written statement at the outset of the lease term, notice of when utility bills will be issued.\n(c) Landlords must include the following information on each submetered utility service bill:\n(1) the present and last preceding submeter readings;\n(2) the date of the present reading;\n(3) the rate at which the utility service is being billed, the amount of the service billed at the rate, and the rate at which the landlord is being billed by the utility provider for the utility service;\n(4) the tenant's portion of taxes and surcharges;\n(5) if any, the portion of any bill credit the landlord received from the utility provider that is credited to the tenant;\n(6) any administrative billing charge, as provided in subdivision 4;\n(7) the total amount of the bill; and\n(8) the date by which payment is due; the date after which, if the bill is not paid, a late payment charge may be imposed; and the amount of the charge, if any, as provided in subdivision 6.\n(a) A landlord who bills a tenant separately from rent for electricity service (1) must not apportion the service; (2) must comply with this section, section 216B.022, and applicable provisions of section 504B.216; and (3) is subject to section 216B.024.\n(b) A landlord who submeters electricity must:\n(1) charge only for the electricity used in the tenant's unit, calculated by multiplying the kilowatt-hours used during the billing period, as measured by the submeter, by the rate charged to the landlord by the utility provider. A landlord must not charge a tenant for electricity consumed in common areas or in spaces used exclusively or primarily by the landlord;\n(2) charge a tenant only for the tenant's pro rata share of nonusage charges, calculated by dividing the charges the landlord is billed by the utility provider equally among the number of units in the building; and\n(3) deduct from a tenant's total bill the tenant's pro rata share of any bill credits or adjustments received by the landlord on the bill from the utility provider by dividing the credit or adjustment equally among the number of units in the building.\n(a) A landlord who submeters natural gas service must bill tenants according to the methodology described in subdivision 2, paragraph (b), and comply with:\n(1) subdivision 1, paragraph (c);\n(2) section 216B.022; and\n(3) applicable provisions of section 504.216.\n(b) A landlord who submeters or apportions natural gas service (1) must comply with subdivisions 4 to 8, and (2) is subject to section 216B.024.\nA landlord who bills separately from rent for utility service may impose an administrative billing charge, as provided in section 504B.216, subdivision 8. No other fees or charges may be imposed on or collected from tenants for utility service, except as otherwise provided in subdivision 6 and section 216B.022, subdivision 5.\n(a) If a billing error occurs that has resulted in an overcharge, the landlord must promptly refund the difference between what the tenant paid and what the tenant would have paid but for the error.\n(b) If a billing error has occurred that has resulted in an undercharge, the landlord may bill the tenant for the difference between what the tenant paid and what the tenant would have paid but for the billing error, for a period not exceeding six months. Any undercharge must be recovered in accordance with subdivision 8.\nA late payment charge may be imposed as provided under section 504B.216, subdivision 9. No other fees or charges may be imposed on or collected from tenants for utility service, except as otherwise provided in subdivision 4 and section 216B.022, subdivision 5.\nA landlord must offer a payment plan for overdue utility service bills. The plan must be reasonable and take into account the tenant's financial circumstances and any extenuating circumstances that are voluntarily disclosed by the tenant. If the landlord and tenant cannot agree on a mutually acceptable payment plan, the landlord must inform the tenant of the right to seek assistance from the commission's consumer affairs office in resolving the dispute and provide the tenant the office's current telephone number and email address.\nA landlord must offer a payment plan to tenants who have been undercharged if no culpable conduct by the tenant or member of the tenant's household caused the undercharge. The agreement must cover a period equal to the time over which the undercharge occurred or a different time period that is mutually agreeable to the tenant and the landlord. No interest or delinquency fee may be charged as part of a payment plan under this subdivision.",
	"repealed": false
}