{
	"id": "45.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.31",
	"title": "45.31 COURSE COORDINATOR.",
	"text": "Each course of study must have at least one coordinator, approved by the commissioner, who is responsible for supervising the program and assuring compliance with all laws and rules. Education providers may engage an additional coordinator, approved for their providership, in order to assist the coordinator or to act as a substitute for the coordinator in the event of an emergency or illness.\n(a) A person applying for approval as a course coordinator must:\n(1) be qualified or have experience in the applicable subject matter of courses offered by the education provider or have experience in the administration of an education program; and\n(2) make available upon request such records and data required by the commissioner to administer the provisions and further the purposes of this chapter.\n(b) Coordinator approval may not be transferred to an individual who has not already been approved as an additional coordinator for the applicable license type for the providership in question. An individual must be approved as a coordinator by the commissioner before acting on behalf of an approved education provider.\nAn education provider is responsible for:\n(1) assuring compliance with all laws and rules relating to educational offerings governed by the commissioner;\n(2) assuring that students are provided with current and accurate information relating to the laws and rules governing their licensed activity;\n(3) supervising and evaluating courses and instructors. Supervision includes assuring, especially when a course will be taught by more than one instructor, that all areas of the curriculum are addressed without redundancy and that continuity is present throughout the entire course;\n(4) ensuring that instructors are qualified to teach the course offering;\n(5) furnishing the commissioner, upon request, with copies of course and instructor evaluations and qualifications of instructors. Evaluations must be completed by students and coordinators;\n(6) investigating complaints related to course offerings and instructors and forwarding a copy of the written complaints to the Department of Commerce;\n(7) maintaining accurate records relating to course offerings, instructors, tests taken by students, and student attendance for a period of three years from the date on which the course was completed. These records must be made available to the commissioner upon request. In the event that an education provider ceases operation for any reason, the coordinator is responsible for maintaining the records or providing a custodian for the records acceptable to the commissioner. The coordinator must notify the commissioner of the name and address of that person. In order to be acceptable to the commissioner, custodians must agree to make copies of acknowledgments available to students at a reasonable fee. Under no circumstances will the commissioner act as custodian of the records;\n(8) ensuring that the coordinator is available to instructors and students throughout course offerings and providing to the students and instructor the name of the coordinator and a telephone number at which the coordinator can be reached;\n(9) attending workshops or instructional programs as reasonably required by the commissioner;\n(10) providing course completion certificates within ten days of, but not before, completion of the entire course. Course completion certificates must be completed in their entirety. It is not necessary to provide a written course completion certificate if the course completion certificate has been electronically delivered to the department or its designated licensing contractor. A coordinator may require payment of the course tuition as a condition for receiving the course completion certificate;\n(11) notifying the commissioner immediately of any change in an application for the course, coordinator, or instructor approval application; and\n(12) in conjunction with the instructor, assuring and certifying attendance of students enrolled in courses.",
	"repealed": false
}