{
	"id": "473H.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.03",
	"title": "473H.03 REQUIRED SIZE OF PARCEL; EXCEPTIONS.",
	"text": "Long-term agricultural land comprising 40 or more acres shall be eligible for designation as an agricultural preserve.\nNoncontiguous parcels may be included to achieve the minimum acreage requirement in subdivision 1, provided that each parcel is at least ten acres in size and provided that all separate parcels are farmed together as a unit.\nThe minimum acreage requirement in subdivision 1 may be reduced to 35 acres provided the land is a single quarter/quarter parcel and the amount less than 40 acres is due to a public road right-of-way or a perturbation in the rectangular survey system resulting in a quarter/quarter of less than 40 acres.\nContiguous long-term agricultural land comprising not less than 20 acres and surrounded by eligible land on not less than two sides shall be eligible for designation as an agricultural preserve provided the authority by resolution determines that: (i) the land area predominantly comprises Class I, II, III, or irrigated Class IV land according to the Land Capability Classification Systems of the Natural Resources Conservation Service and the county soil survey; (ii) the land area is considered by the authority to be an essential part of the agricultural region; and (iii) the parcel was a parcel of record prior to January 1, 1980, or the land was an agricultural preserve prior to becoming a separate parcel of at least 20 acres.\nContiguous long-term agricultural land meeting the total acreage requirements of this section but located in two or more authorities so that the minimum acreage requirement is not met in one or more of the authorities shall be eligible by joint resolution of the affected authorities.\nContiguous long-term agricultural land not meeting the total acreage requirements of this section but under the same ownership as an agricultural preserve adjoining it on at least one side shall be eligible for designation as an agricultural preserve.",
	"repealed": false
}