{
	"id": "297A.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.62",
	"title": "297A.62 SALES TAX IMPOSED; RATES.",
	"text": "Except as otherwise provided in subdivision 3 or in this chapter, a sales tax of 6.5 percent is imposed on the gross receipts from retail sales as defined in section 297A.61, subdivision 4, made in this state or to a destination in this state by a person who is required to have or voluntarily obtains a permit under section 297A.83, subdivision 1.\nExcept as otherwise provided in subdivision 3 or in this chapter, an additional sales tax of 0.375 percent, as required under the Minnesota Constitution, article XI, section 15, is imposed on the gross receipts from retail sales as defined in section 297A.61, subdivision 4, made in this state or to a destination in this state by a person who is required to have or voluntarily obtains a permit under section 297A.83, subdivision 1. This additional tax expires July 1, 2034.\n[Repealed, 1Sp2001 c 5 art 12 s 95; 2002 c 377 art 3 s 24; 1Sp2003 c 21 art 8 s 15; 1Sp2005 c 3 art 5 s 33]\n(a) For retail sales of manufactured homes as defined in section 327.31, subdivision 6, for residential uses, the sales tax under subdivisions 1 and 1a is imposed on 65 percent of the dealer's cost of the manufactured home. For retail sales of new or used park trailers, as defined in section 168.002, subdivision 23, the sales tax under subdivisions 1 and 1a is imposed on 65 percent of the sales price of the park trailer.\n(b) For retail sales of a modular home as defined in section 297A.668, subdivision 8, paragraph (b), for residential uses, the sales tax under subdivisions 1 and 1a is imposed on 65 percent of the modular home manufacturer's sales price of the modular home.\nIn this chapter, wherever there is a reference to the rate under subdivision 1, or to a combined rate under subdivisions 1 and 1a, the rate to be applied is the combined rate under subdivisions 1 and 1a until the additional tax imposed by subdivision 1a expires. This subdivision does not apply to section 297A.65.\nWhen there is a change in the rate of tax imposed by this section, the following transitional period shall apply to the retail sale of services covering a billing period starting before and ending after the statutory effective date of the rate change:\n(1) for a rate increase, the new rate shall apply to the first billing period starting on or after the effective date; and\n(2) for a rate decrease, the new rate shall apply to bills rendered on or after the effective date.",
	"repealed": false
}