{
	"id": "148E.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.105",
	"title": "148E.105 LICENSED GRADUATE SOCIAL WORKERS WHO DO NOT PRACTICE CLINICAL SOCIAL WORK; SUPERVISED PRACTICE.",
	"text": "After receiving a license from the board as a licensed graduate social worker, a licensed graduate social worker not engaged in clinical practice must obtain at least 100 hours of supervision according to the requirements of this section.\nThe supervision required by subdivision 1 must be obtained during the first 4,000 hours of postgraduate social work practice authorized by law. At least four hours of supervision must be obtained during every 160 hours of practice.\n(a) Notwithstanding the requirements in subdivisions 1 and 2, the board shall approve hours of supervised practice completed prior to August 1, 2011, which comply with Minnesota Statutes 2010, sections 148D.100 to 148D.125. These hours shall apply to supervised practice requirements in effect as specified in this section.\n(b) Any additional hours of supervised practice obtained effective August 1, 2011, must comply with the increased requirements specified in this section.\nOf the 100 hours of supervision required under subdivision 1:\n(1) 50 hours must be provided through one-on-one supervision. The supervision must be provided either in person or via eye-to-eye electronic media, while maintaining visual contact. The board must allow a licensed graduate social worker to satisfy the supervision requirement of this clause with all required hours of supervision provided via eye-to-eye electronic media, while maintaining visual contact; and\n(2) 50 hours must be provided through: (i) one-on-one supervision, or (ii) group supervision. The supervision may be in person, by telephone, or via eye-to-eye electronic media, while maintaining visual contact. The supervision must not be provided by email. Group supervision is limited to six supervisees.\nThe supervision required by subdivision 1 must be provided by a supervisor who meets the requirements specified in section 148E.120. The supervision must be provided by a:\n(1) licensed independent social worker;\n(2) licensed graduate social worker who has completed the supervised practice requirements;\n(3) licensed independent clinical social worker; or\n(4) a supervisor who meets the requirements specified in section 148E.120, subdivision 2.\nThe supervisee must:\n(1) to the satisfaction of the supervisor, practice competently and ethically according to professional social work knowledge, skills, and values;\n(2) receive supervision in the following content areas:\n(i) development of professional values and responsibilities;\n(ii) practice skills;\n(iii) authorized scope of practice;\n(iv) ensuring continuing competence; and\n(v) ethical standards of practice;\n(3) submit a supervision plan according to section 148E.125, subdivision 1; and\n(4) verify supervised practice according to section 148E.125, subdivision 3, when:\n(i) a licensed graduate social worker applies for the renewal of a license; or\n(ii) a licensed graduate social worker applies for a licensed independent social worker license.\nA licensed graduate social worker who fulfills the supervision requirements specified in subdivisions 1 to 5, and who does not practice clinical social work, is not required to be supervised after completion of the supervision requirements.\nA social worker and the social worker's supervisor must submit verification that the supervisee has met or has made progress on meeting the applicable supervision requirements according to section 148E.125, subdivision 3.\nUpon completion of 4,000 hours of social work practice, including at least 100 hours of supervision according to the requirements of this section, a licensed graduate social worker is eligible to apply for a licensed independent social worker license according to section 148E.110.",
	"repealed": false
}