{
	"id": "473.751",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.751",
	"title": "473.751 DEFINITIONS.",
	"text": "As used in sections 473.75 to 473.763, the terms defined in this section have the meanings given them in this section, except as otherwise expressly provided or indicated by the context.\n\"Authority\" means the Minnesota Ballpark Authority established under section 473.755.\n\"Ballpark\" means the stadium suitable for major league baseball to be constructed and financed under Laws 2006, chapter 257.\n\"Ballpark costs\" means the cost of designing, constructing, and equipping a ballpark suitable for major league baseball. Ballpark costs excludes the cost of land acquisition, site improvements, utilities, site demolition, environmental remediation, railroad crash wall, site furnishings, landscaping, railroad right-of-way development, district energy, site graphics and artwork and other site improvements identified by the authority, public infrastructure, capital improvement reserves, bond reserves, capitalized interest, and financing costs.\n\"County\" means Hennepin County.\n\"Development area\" means the area in the city of Minneapolis bounded by marked Interstate Highway 394, vacated Holden Street, the Burlington Northern right-of-way, Seventh Street North, Sixth Avenue North, Fifth Street North, the Burlington Northern right-of-way, and the Interstate Highway 94 exit ramp.\n\"Public infrastructure\" means all property, facilities, and improvements determined by the authority or the county to facilitate the development and use of the ballpark, including but not limited to property and improvements for drainage, environmental remediation, parking, roadways, walkways, skyways, pedestrian bridges, bicycle paths, and transit improvements to facilitate public access to the ballpark, lighting, landscaping, utilities, streets, and streetscapes.\n\"Streetscape\" means improvements to streets and sidewalks or other public right-of-way for the purpose of enhancing the movement, safety, convenience, or enjoyment of ballpark patrons and other pedestrians, including decorative lighting and surfaces, plantings, display and exhibit space, adornments, seating, and transit and bus shelters, which are designated as streetscape by the county.\n\"Team\" means the owner and operator of the baseball team currently known as the Minnesota Twins or any team owned and operated by someone who purchases or otherwise takes ownership or control of or reconstitutes the baseball team currently known as the Minnesota Twins.",
	"repealed": false
}