{
	"id": "13.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.39",
	"title": "13.39 CIVIL INVESTIGATION.",
	"text": "A \"pending civil legal action\" includes but is not limited to judicial, administrative or arbitration proceedings. Whether a civil legal action is pending shall be determined by the chief attorney acting for the government entity.\n(a) Except as provided in paragraph (b), data collected by a government entity as part of an active investigation undertaken for the purpose of the commencement or defense of a pending civil legal action, or which are retained in anticipation of a pending civil legal action, are classified as protected nonpublic data pursuant to section 13.02, subdivision 13, in the case of data not on individuals and confidential pursuant to section 13.02, subdivision 3, in the case of data on individuals. Any government entity may make any data classified as confidential or protected nonpublic pursuant to this subdivision accessible to any person, agency or the public if the government entity determines that the access will aid the law enforcement process, promote public health or safety or dispel widespread rumor or unrest.\n(b) A complainant has access to a statement provided by the complainant to a government entity under paragraph (a).\nDuring the time when a civil legal action is determined to be pending under subdivision 1, any person may bring an action in the district court in the county where the data are maintained to obtain disclosure of data classified as confidential or protected nonpublic under subdivision 2. The court may order that all or part of the data be released to the public or to the person bringing the action. In making the determination whether data shall be disclosed, the court shall consider whether the benefit to the person bringing the action or to the public outweighs any harm to the public, the government entity, or any person identified in the data. The data in dispute shall be examined by the court in camera.\nInactive civil investigative data are public, unless the release of the data would jeopardize another pending civil legal action, and except for those portions of a civil investigative file that are classified as not public data by this chapter or other law. Any civil investigative data presented as evidence in court or made part of a court record shall be public. Civil investigative data become inactive upon the occurrence of any of the following events:\n(1) a decision by the government entity or by the chief attorney acting for the government entity not to pursue the civil action;\n(2) expiration of the time to file a complaint under the statute of limitations or agreement applicable to the civil action; or\n(3) exhaustion of or expiration of rights of appeal by either party to the civil action.\nData determined to be inactive under clause (1) may become active if the government entity or its attorney decides to renew the civil action.\nThis section does not apply when the sole issue or dispute is a government entity's timeliness in responding to a data request.",
	"repealed": false
}