{
	"id": "245I.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.04",
	"title": "245I.04 PROVIDER QUALIFICATIONS AND SCOPE OF PRACTICE.",
	"text": "For purposes of this section, a Tribal entity may credential an individual according to section 256B.02, subdivision 7, paragraphs (b) and (c).\nThe following individuals may provide services to a client as a mental health professional:\n(1) a registered nurse who is licensed under sections 148.171 to 148.285 and is certified as a: (i) clinical nurse specialist in child or adolescent, family, or adult psychiatric and mental health nursing by a national certification organization; or (ii) nurse practitioner in adult or family psychiatric and mental health nursing by a national nurse certification organization;\n(2) a licensed independent clinical social worker as defined in section 148E.050, subdivision 5;\n(3) a psychologist licensed by the Board of Psychology under sections 148.88 to 148.98;\n(4) a physician licensed under chapter 147 if the physician is: (i) certified by the American Board of Psychiatry and Neurology; (ii) certified by the American Osteopathic Board of Neurology and Psychiatry; or (iii) eligible for board certification in psychiatry;\n(5) a marriage and family therapist licensed under sections 148B.29 to 148B.392; or\n(6) a licensed professional clinical counselor licensed under section 148B.5301.\nA mental health professional must maintain a valid license with the mental health professional's governing health-related licensing board and must only provide services to a client within the scope of practice determined by the applicable health-related licensing board.\n(a) An individual who is qualified in at least one of the ways described in paragraph (b) to (d) may serve as a mental health practitioner.\n(b) An individual is qualified as a mental health practitioner through relevant coursework if the individual completes at least 30 semester hours or 45 quarter hours in behavioral sciences or related fields and:\n(1) has at least 2,000 hours of experience providing services to individuals with:\n(i) a mental illness or a substance use disorder; or\n(ii) a traumatic brain injury or a developmental disability, and completes the additional training described in section 245I.05, subdivision 3, paragraph (c), before providing direct contact services to a client;\n(2) is fluent in the non-English language of the ethnic group to which at least 50 percent of the individual's clients belong, and completes the additional training described in section 245I.05, subdivision 3, paragraph (c), before providing direct contact services to a client;\n(3) is working in a day treatment program under section 256B.0671, subdivision 3, or 256B.0943;\n(4) has completed a practicum or internship that (i) required direct interaction with adult clients or child clients, and (ii) was focused on behavioral sciences or related fields; or\n(5) is in the process of completing a practicum or internship as part of a formal undergraduate or graduate training program in social work, psychology, or counseling.\n(c) An individual is qualified as a mental health practitioner through work experience if the individual:\n(1) has at least 4,000 hours of experience in the delivery of services to individuals with:\n(i) a mental illness or a substance use disorder; or\n(ii) a traumatic brain injury or a developmental disability, and completes the additional training described in section 245I.05, subdivision 3, paragraph (c), before providing direct contact services to clients; or\n(2) receives treatment supervision at least once per week until meeting the requirement in clause (1) of 4,000 hours of experience and has at least 2,000 hours of experience providing services to individuals with:\n(i) a mental illness or a substance use disorder; or\n(ii) a traumatic brain injury or a developmental disability, and completes the additional training described in section 245I.05, subdivision 3, paragraph (c), before providing direct contact services to clients.\n(d) An individual is qualified as a mental health practitioner if the individual has a master's or other graduate degree in behavioral sciences or related fields.\n(a) A mental health practitioner under the treatment supervision of a mental health professional or certified rehabilitation specialist may provide an adult client with client education, rehabilitative mental health services, functional assessments, level of care assessments, and treatment plans. A mental health practitioner under the treatment supervision of a mental health professional may provide skill-building services to a child client and complete treatment plans for a child client.\n(b) A mental health practitioner must not provide treatment supervision to other staff persons. A mental health practitioner may provide direction to mental health rehabilitation workers and mental health behavioral aides.\n(c) A mental health practitioner who provides services to clients according to section 256B.0624 may perform crisis assessments and interventions for a client.\n(a) A clinical trainee is a staff person who: (1) is enrolled in an accredited graduate program of study to prepare the staff person for independent licensure as a mental health professional and who is participating in a practicum or internship with the license holder through the individual's graduate program; (2) has completed an accredited graduate program of study to prepare the staff person for independent licensure as a mental health professional and who is in compliance with the requirements of the applicable health-related licensing board, including requirements for supervised practice; or (3) has completed an accredited graduate program of study to prepare the staff person for independent licensure as a mental health professional, has completed a practicum or internship and has not yet taken or received the results from the required test or is waiting for the final licensure decision.\n(b) A clinical trainee is responsible for notifying and applying to a health-related licensing board to ensure that the trainee meets the requirements of the health-related licensing board. As permitted by a health-related licensing board, treatment supervision under this chapter may be integrated into a plan to meet the supervisory requirements of the health-related licensing board but does not supersede those requirements.\n(a) A clinical trainee under the treatment supervision of a mental health professional may provide a client with psychotherapy, client education, rehabilitative mental health services, diagnostic assessments, functional assessments, level of care assessments, and treatment plans.\n(b) A clinical trainee must not provide treatment supervision to other staff persons. A clinical trainee may provide direction to mental health behavioral aides and mental health rehabilitation workers.\n(c) A psychological clinical trainee under the treatment supervision of a psychologist may perform psychological testing of clients.\n(d) A clinical trainee must not provide services to clients that violate any practice act of a health-related licensing board, including failure to obtain licensure if licensure is required.\nA certified rehabilitation specialist must have:\n(1) a master's degree from an accredited college or university in behavioral sciences or related fields;\n(2) at least 4,000 hours of post-master's supervised experience providing mental health services to clients; and\n(3) a valid national certification as a certified rehabilitation counselor or certified psychosocial rehabilitation practitioner.\n(a) A certified rehabilitation specialist may provide an adult client with client education, rehabilitative mental health services, functional assessments, level of care assessments, and treatment plans.\n(b) A certified rehabilitation specialist may provide treatment supervision to a mental health certified peer specialist, mental health practitioner, and mental health rehabilitation worker.\nA mental health certified peer specialist must:\n(1) have been diagnosed with a mental illness;\n(2) be a current or former mental health services client; and\n(3) have a valid certification as a mental health certified peer specialist under section 256B.0615.\nA mental health certified peer specialist under the treatment supervision of a mental health professional or certified rehabilitation specialist must:\n(1) provide individualized peer support to each client;\n(2) promote a client's recovery goals, self-sufficiency, self-advocacy, and development of natural supports; and\n(3) support a client's maintenance of skills that the client has learned from other services.\nA mental health certified family peer specialist must:\n(1) have raised or be currently raising a child with a mental illness;\n(2) have experience navigating the children's mental health system; and\n(3) have a valid certification as a mental health certified family peer specialist under section 256B.0616.\nA mental health certified family peer specialist under the treatment supervision of a mental health professional must provide services to increase the child's ability to function in the child's home, school, and community. The mental health certified family peer specialist must:\n(1) provide family peer support to build on a client's family's strengths and help the family achieve desired outcomes;\n(2) provide nonadversarial advocacy to a child client and the child's family that encourages partnership and promotes the child's positive change and growth;\n(3) support families in advocating for culturally appropriate services for a child in each treatment setting;\n(4) promote resiliency, self-advocacy, and development of natural supports;\n(5) support maintenance of skills learned from other services;\n(6) establish and lead parent support groups;\n(7) assist parents in developing coping and problem-solving skills; and\n(8) educate parents about mental illnesses and community resources, including resources that connect parents with similar experiences to one another.\n(a) A mental health rehabilitation worker must:\n(1) have a high school diploma or equivalent;\n(2) have the training required under section 245I.05, subdivision 3, paragraph (c); and\n(3) meet one of the following qualification requirements:\n(i) be fluent in the non-English language or competent in the culture of the ethnic group to which at least 20 percent of the mental health rehabilitation worker's clients belong;\n(ii) have an associate of arts degree;\n(iii) have two years of full-time postsecondary education or a total of 15 semester hours or 23 quarter hours in behavioral sciences or related fields;\n(iv) be a registered nurse;\n(v) have, within the previous ten years, three years of personal life experience with mental illness;\n(vi) have, within the previous ten years, three years of life experience as a primary caregiver to an adult with a mental illness, traumatic brain injury, substance use disorder, or developmental disability; or\n(vii) have, within the previous ten years, 2,000 hours of work experience providing health and human services to individuals.\n(b) A mental health rehabilitation worker who is exclusively scheduled as an overnight staff person is exempt from the additional qualification requirements in paragraph (a), clause (3).\nA mental health rehabilitation worker under the treatment supervision of a mental health professional or certified rehabilitation specialist may provide rehabilitative mental health services to an adult client according to the client's treatment plan.\n(a) A level 1 mental health behavioral aide must have the training required under section 245I.05, subdivision 3, paragraph (c), and: (1) a high school diploma or equivalent; or (2) two years of experience as a primary caregiver to a child with mental illness within the previous ten years.\n(b) A level 2 mental health behavioral aide must have the training required under section 245I.05, subdivision 3, paragraph (c), and an associate or bachelor's degree.\nWhile under the treatment supervision of a mental health professional, a mental health behavioral aide may practice psychosocial skills with a child client according to the child's treatment plan and individual behavior plan that a mental health professional, clinical trainee, or mental health practitioner has previously taught to the child.\n(a) A recovery peer must:\n(1) have a minimum of one year in recovery from substance use disorder; and\n(2) hold a current credential from the Minnesota Certification Board, the Upper Midwest Indian Council on Addictive Disorders, or the National Association for Alcoholism and Drug Abuse Counselors that demonstrates skills and training in the domains of ethics and boundaries, advocacy, mentoring and education, and recovery and wellness support.\n(b) A recovery peer who receives a credential from a Tribal Nation when providing peer recovery support services in a tribally licensed program satisfies the requirement in paragraph (a), clause (2).\n(c) A recovery peer hired on or after July 1, 2024, must not be classified or treated as an independent contractor. Beginning January 1, 2025, a recovery peer must not be classified or treated as an independent contractor.\n(a) A recovery peer, under the supervision of a licensed alcohol and drug counselor or mental health professional who meets the qualifications under subdivision 2, must:\n(1) provide individualized peer support and individual recovery planning to each client;\n(2) promote a client's recovery goals, self-sufficiency, self-advocacy, and development of natural supports; and\n(3) support a client's maintenance of skills that the client has learned from other services.\n(b) A licensed alcohol and drug counselor or mental health professional providing supervision to a recovery peer must meet with the recovery peer face-to-face, either remotely or in person, at least once per month in order to provide adequate supervision to the recovery peer. Supervision must include reviewing individual recovery plans, as defined in section 254B.01, subdivision 4e, and reviewing documentation of peer recovery support services provided for clients and may include client updates, discussion of ethical considerations, and any other questions or issues relevant to peer recovery support services.",
	"repealed": false
}