{
	"id": "216B.631",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.631",
	"title": "216B.631 COMPENSATION FOR PARTICIPANTS IN PROCEEDINGS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Participant\" means a person who files comments or appears in a commission proceeding concerning one or more public utilities, excluding public hearings held in contested cases and commission proceedings conducted to receive general public comments.\n(c) \"Party\" means a person by or against whom a proceeding before the commission is commenced or a person permitted to intervene in a proceeding, other than public hearings, concerning one or more public utilities.\n(d) \"Proceeding\" means:\n(1) a rate change proceeding under section 216B.16, including a request to withdraw, defer, or modify a petition to change rates;\n(2) a proceeding in which the commission considers a utility request for cost recovery through general rates or riders;\n(3) a proceeding in which the commission considers a determination related to ratepayer protections, service quality, or disconnection policies and practices, including but not limited to utility compliance with the requirements of sections 216B.091 to 216B.0993;\n(4) a proceeding in which the commission considers determinations directly related to low-income affordability programs, including but not limited to utility compliance with the requirements of section 216B.16, subdivisions 14, 15, and 19, paragraph (a), clause (3);\n(5) a proceeding related to the design or approval of utility tariffs or rates;\n(6) a proceeding related to utility performance measures or incentives, including but not limited to proceedings under sections 216B.16, subdivision 19, paragraph (h); 216B.167; and 216B.1675;\n(7) proceedings related to distribution system planning and grid modernization, including but not limited to proceedings in compliance with the requirements in section 216B.2425, subdivision 2, paragraph (e);\n(8) investigations or inquiries initiated by the commission or the Department of Commerce; or\n(9) proceedings related to utility pilot programs in which the commission considers a proposal with a proposed cost of at least $5,000,000.\n(e) \"Public utility\" has the meaning given in section 216B.02, subdivision 4.\nAny of the following participants is eligible to receive compensation under this section:\n(1) a nonprofit organization that:\n(i) is exempt from taxation under section 501(c)(3) of the Internal Revenue Code;\n(ii) is incorporated or organized in Minnesota;\n(iii) is governed under chapter 317A or section 322C.1101; and\n(iv) the commission determines under subdivision 3, paragraph (c), would suffer financial hardship if not compensated for the nonprofit organization's participation in the applicable proceeding; or\n(2) a Tribal government of a federally recognized Indian Tribe that is located in Minnesota.\n(a) The commission may order a public utility to compensate all or part of a participant's reasonable costs incurred to participate in a proceeding before the commission if the participant is eligible under subdivision 2 and the commission finds:\n(1) that the participant has materially assisted the commission's deliberation; and\n(2) if the participant is a nonprofit organization, that the participant would suffer financial hardship if the nonprofit organization's participation in the proceeding was not compensated.\n(b) In determining whether a participant has materially assisted the commission's deliberation, the commission must find that:\n(1) the participant made a unique contribution to the record and represented an interest that would not otherwise have been adequately represented;\n(2) the evidence or arguments presented or the positions taken by the participant were an important factor in producing a fair decision;\n(3) the participant's position promoted a public purpose or policy;\n(4) the evidence presented, arguments made, issues raised, or positions taken by the participant would not otherwise have been part of the record;\n(5) the participant was active in any stakeholder process included in the proceeding; and\n(6) the proceeding resulted in a commission order that adopted, in whole or in part, a position advocated by the participant.\n(c) In determining whether a nonprofit participant has demonstrated that a lack of compensation would present financial hardship, the commission must find that the nonprofit participant:\n(1) had an average annual payroll expense less than $600,000 for participation in commission proceedings over the previous three years; and\n(2) has fewer than 30 full-time equivalent employees.\n(d) In reviewing a compensation request, the commission must consider whether the costs presented in the participant's claim are reasonable. If the commission determines that an eligible participant materially assisted the commission's deliberation, the commission shall award all or part of the requested compensation, up to the maximum amounts provided under subdivision 4.\n(a) Compensation must not exceed $50,000 for a single participant in any proceeding, except that:\n(1) if a proceeding extends longer than 12 months, a participant may request and be awarded compensation of up to $50,000 for costs incurred in each calendar year; and\n(2) for a contested case proceeding, a participant may request and be awarded up to $75,000.\n(b) No single participant may be awarded more than $200,000 under this section in a single calendar year.\n(c) Compensation requests from joint participants must be presented as a single request.\n(d) Notwithstanding paragraphs (a) and (b), the commission must not, in any calendar year, require a single public utility to pay aggregate compensation under this section that exceeds the following amounts:\n(1) $100,000, for a public utility with up to $300,000,000 annual gross operating revenue in Minnesota;\n(2) $275,000, for a public utility with at least $300,000,000 but less than $900,000,000 annual gross operating revenue in Minnesota;\n(3) $375,000, for a public utility with at least $900,000,000 but less than $2,000,000,000 annual gross operating revenue in Minnesota; and\n(4) $1,250,000, for a public utility with $2,000,000,000 or more annual gross operating revenue in Minnesota.\n(e) When requests for compensation from any public utility approach the limits established in paragraph (d), the commission may give priority to requests from participants that received less than $150,000 in total compensation during the previous two years and from participants who represent residential ratepayers, particularly those residential ratepayers who the participant can demonstrate have been underrepresented in past commission proceedings.\n(a) A participant seeking compensation must file a request and an affidavit of service with the commission, and serve a copy of the request on each party to the proceeding. The request must be filed no more than 30 days after the later of:\n(1) the expiration of the period within which a petition for rehearing, amendment, vacation, reconsideration, or reargument must be filed; or\n(2) the date the commission issues an order following rehearing, amendment, vacation, reconsideration, or reargument.\n(b) A compensation request must include:\n(1) the name and address of the participant or nonprofit organization the participant is representing;\n(2) evidence of the organization's nonprofit, tax-exempt status, if applicable;\n(3) the name and docket number of the proceeding for which compensation is requested;\n(4) for a nonprofit participant, evidence supporting the nonprofit organization's eligibility for compensation under the financial hardship test under subdivision 3, paragraph (c);\n(5) amounts of compensation awarded to the participant under this section during the current year and any pending requests for compensation, itemized by docket;\n(6) an itemization of the participant's costs, not including overhead costs;\n(7) participant revenues dedicated to the proceeding;\n(8) the total compensation request; and\n(9) a narrative describing the unique contribution made to the proceeding by the participant.\n(c) A participant must comply with reasonable requests for information by the commission and other parties or participants. A participant must reply to information requests within ten calendar days of the date the request is received, unless doing so would place an extreme hardship upon the replying participant. The replying participant must provide a copy of the information to any other participant or interested person upon request. Disputes regarding information requests may be resolved by the commission.\n(d) A party or participant objecting to a request for compensation must, within 30 days after service of the request for compensation, file a response and an affidavit of service with the commission. A copy of the response must be served on the requesting participant and all other parties to the proceeding.\n(e) The requesting participant may file a reply with the commission within 15 days after a response is filed under paragraph (d). A copy of the reply and an affidavit of service must be served on all other parties to the proceeding.\n(f) If additional costs are incurred by a participant as a result of additional proceedings following the commission's initial order, the participant may file an amended request within 30 days after the commission issues an amended order. Paragraphs (b) to (e) apply to an amended request.\n(g) The commission must issue a decision on participant compensation within 120 days of the date a request for compensation is filed by a participant.\n(h) The commission may extend the deadlines in paragraphs (d), (e), and (g) for up to 30 days upon the request of a participant or on the commission's own initiative.\n(i) A participant may request reconsideration of the commission's compensation decision within 30 days of the decision date.\n(a) If the commission issues an order requiring payment of participant compensation, the public utility that was the subject of the proceeding must pay the full compensation to the participant and file proof of payment with the commission within 30 days after the later of:\n(1) the expiration of the period within which a petition for reconsideration of the commission's compensation decision must be filed; or\n(2) the date the commission issues an order following reconsideration of the commission's order on participant compensation.\n(b) If the commission issues an order requiring payment of participant compensation in a proceeding involving multiple public utilities, the commission must apportion costs among the public utilities in proportion to each public utility's annual revenue.\n(c) The commission may issue orders necessary to allow a public utility to recover the costs of participant compensation on a timely basis.\nBy July 1, 2026, the commission must report to the chairs and ranking minority members of the legislative committees with primary jurisdiction over energy policy on the operation of this section. The report must include but is not limited to:\n(1) the amount of compensation paid each year by each utility;\n(2) each recipient of compensation, the commission dockets in which compensation was awarded, and the compensation amounts; and\n(3) the impact of the participation of compensated participants.\nThis section expires July 1, 2031.",
	"repealed": false
}