{
	"id": "299C.157",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.157",
	"title": "299C.157 FORENSIC LABORATORIES; ACCREDITATION.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"forensic analysis\" means the application of scientific knowledge and methodology by an individual who:\n(i) has or should have specialized training and utilizes standardized procedures to conduct examinations on items of evidence;\n(ii) forms an opinion or conclusion based on the outcome of the procedure or comparison under item (i) and the individual's training, experience, or both, and writes a report including the individual's conclusions; and\n(iii) has the potential to offer expert testimony of the individual's analysis in a court of law.\nForensic analysis does not pertain to activities limited to evidence documentation, collection, screening, processing, preservation, or storage.\n(2) \"forensic laboratory\" means a publicly financed laboratory within the state that conducts forensic analysis on items of evidence that are part of or have the potential to be used in a criminal investigation. The term does not include the following laboratories:\n(i) medical examiners and coroners;\n(ii) educational institutions; and\n(iii) clinical laboratories and medical facilities.\n(a) A forensic laboratory operating on or after January 1, 2015, that conducts forensic analysis in the disciplines of DNA, must: (1) be accredited by an accrediting body that requires conformance to the appropriate quality assurance standards set forth by the Federal Bureau of Investigation (Quality Assurance Standards for DNA Testing Laboratories or Quality Assurance Standards for Databasing Laboratories), forensic-specific requirements and which is a signatory to the International Laboratory Accreditation Cooperation (ILAC) Mutual Recognition Arrangements for Testing Laboratories (ISO/IEC 17025); or (2) have begun the formal process of seeking accreditation under clause (1) and follow the standards necessary for accreditation.\n(b) A forensic laboratory operating on or after January 1, 2015, that conducts forensic analysis in the disciplines of toxicology, identification of controlled substances, or trace evidence must: (1) be accredited by an accrediting body that requires conformance to forensic-specific requirements and which is a signatory to the ILAC Mutual Recognition Arrangements for Testing Laboratories (ISO/IEC 17025); or (2) have begun the formal process of seeking accreditation under clause (1) and follow the standards necessary for accreditation.\n(c) A forensic laboratory operating on or after January 1, 2015, that conducts forensic analysis in the disciplines of latent print, impression evidence, firearms, toolmarks, questioned documents, or bloodstain pattern analysis must: (1) be accredited by an accrediting body that requires conformance to forensic-specific requirements and which is a signatory to the ILAC Mutual Recognition Arrangements for Testing Laboratories (ISO/IEC 17025) or Inspection Agencies (ISO/IEC 17020); or (2) have begun the formal process of seeking accreditation under clause (1) and follow the standards necessary for accreditation.\n(d) No forensic laboratory may operate on or after July 1, 2015, unless:\n(1) it is accredited as provided in paragraph (a), (b), or (c); or\n(2) for laboratories that have either begun or resumed operation after a hiatus on or after July 1, 2011, the laboratory complies with paragraph (a), clause (2); paragraph (b), clause (2); or paragraph (c), clause (2), and becomes accredited within three years of August 1, 2014, or beginning operation, whichever is later.\n(e) An accredited forensic laboratory operating on or after July 1, 2015, may conduct forensic analysis in a new forensic discipline as provided in this paragraph. If the standard described in paragraph (a), (b), or (c), under which the laboratory is accredited applies to the new discipline, the laboratory must become accredited in the new discipline under the appropriate standard within one year of when it first begins conducting forensic analysis in the new discipline. If the standard described in paragraph (a), (b), or (c), under which the laboratory is accredited does not apply to the new discipline, the laboratory must become accredited in the new discipline under the appropriate standard within three years of when it first begins conducting forensic analysis in the new discipline. A laboratory seeking accreditation in a new discipline under this paragraph must follow the standards necessary for accreditation during the period before accreditation.\n(f) Notwithstanding paragraphs (d) and (e), upon the written request of a laboratory that contains the specific reasons for the request, the commissioner of public safety may extend by one year the three-year and one-year periods described in paragraphs (d) and (e) by which a laboratory must become initially accredited or accredited in a new discipline. Each deadline may be extended only once.\n(g) A forensic laboratory must forward to the commissioner of public safety copies of the laboratory's certificate of accreditation and scope of accreditation or, every six months, an affirmation that the laboratory is in compliance with paragraph (a), clause (2); paragraph (b), clause (2); or paragraph (c), clause (2). A forensic laboratory seeking accreditation in a new discipline must forward to the commissioner every six months an affirmation that the laboratory is in compliance with paragraph (e). The commissioner shall post these items on the department's website. In addition, the commissioner shall post any approved requests for extensions of a laboratory's deadline to become accredited along with the laboratory's stated reasons for the extension. The commissioner shall ensure that the website is kept up to date and delete affirmations of compliance with paragraph (a), clause (2); paragraph (b), clause (2); paragraph (c), clause (2); and paragraph (e) once the laboratory has achieved accreditation or is no longer working towards accreditation.",
	"repealed": false
}