{
	"id": "60A.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.031",
	"title": "60A.031 EXAMINATIONS.",
	"text": "(1) Insurers and other licensees. At any time and for any reason related to the enforcement of the insurance laws, or to ensure that companies are being operated in a safe and sound manner and to protect the public interest, the commissioner may examine the affairs and conditions of any foreign or domestic insurance or reinsurance company, including reciprocals and fraternals, licensee or applicant for a license under the insurance laws, or any other person or organization of persons doing or in the process of organizing to do any insurance business in this state, and of any licensed advisory organization serving any of the foregoing in this state.\nThe commissioner shall examine the affairs and conditions of every insurer licensed in this state not less frequently than once every five years.\n(2) Who may be examined. The commissioner in making any examination of an insurance company as authorized by this section may, if in the commissioner's discretion, there is cause to believe the commissioner is unable to obtain relevant information from such insurance company or that the examination or investigation is, in the discretion of the commissioner, necessary or material to the examination of the company, examine any person, association, or corporation:\n(a) transacting, having transacted, or being organized to transact the business of insurance in this state;\n(b) engaged in or proposing to be engaged in the organization, promotion, or solicitation of shares or capital contributions to or aiding in the formation of a domestic insurance company;\n(c) holding shares of capital stock of an insurance company for the purpose of controlling the management thereof as voting trustee or otherwise;\n(d) having a contract, written or oral, pertaining to the management or control of an insurance company as general agent, managing agent, attorney-in-fact, or otherwise;\n(e) which has substantial control directly or indirectly over an insurance company whether by ownership of its stock or otherwise, or owning stock in any domestic insurance company, which stock constitutes a substantial proportion of either the stock of the domestic insurance company or of the assets of the owner thereof;\n(f) which is a subsidiary or affiliate of an insurance company;\n(g) which is a licensed agent or solicitor or has made application for the licenses;\n(h) engaged in the business of adjusting losses or financing premiums.\nNothing contained in this clause shall authorize the commissioner to examine any person, association, or corporation which is subject to regular examination by another division of the Commerce Department of this state. The commissioner shall notify the other division when an examination is deemed advisable.\n[Repealed, 1981 c 211 s 42]\nAn examination may, but need not, cover comprehensively all aspects of the examinee's affairs, practices, and conditions. The commissioner shall determine the nature and scope of each examination and in doing so shall take into account all available relevant factors concerning the financial and business affairs, practices and conditions of the examinee. For examinations undertaken pursuant to this section, the commissioner shall issue an order stating the scope of the examination and designating the person responsible for conducting the examination. A copy of the order shall be provided to the examinee.\nIn conducting the examination, the examiner shall observe the guidelines and procedures in the examiner's handbook adopted by the National Association of Insurance Commissioners. The commissioner may also employ other guidelines or procedures that the commissioner may consider appropriate.\n(a) The commissioner, or the designated person, shall have timely, convenient, and free access at all reasonable hours to all books, records, securities, accounts, documents, and any or all computer or other records and papers relating to the property, assets, business, and affairs of any company, applicant, association, or person which may be examined pursuant to this section for the purpose of ascertaining, appraising, and evaluating the assets, conditions, affairs, operations, ability to fulfill obligations, and compliance with all the provisions of law of the company or person insofar as any of the above pertain to the business of insurance of a person, organization, or corporation transacting, having transacted, or being organized to transact business in this state. Every company or person being examined, its officers, directors, and agents, shall provide to the commissioner or the designated person timely, convenient, and free access at all reasonable hours at its office to all its books, records, accounts, papers, securities, documents, any or all computer or other records relating to the property, assets, business, and affairs of the company or person. The officers, directors, and agents of the company or person shall facilitate the examination and aid in the examination so far as it is in their power to do so.\nThe refusal of a company, by its officers, directors, employees, or agents, to submit to examination or to comply with a reasonable request of the examiners is grounds for suspension or refusal of, or nonrenewal of, a license or authority held by the company to engage in an insurance or other business subject to the commissioner's jurisdiction. The proceedings for suspension, revocation, or refusal of a license or authority must be conducted as provided in section 45.027.\n(b) The commissioner or any examiners may issue subpoenas, administer oaths, and examine under oath any person as to any matter pertinent to the examination. If a person fails or refuses to obey a subpoena, the commissioner may petition a court of competent jurisdiction, and upon proper showing, the court may enter an order compelling the witness to appear and testify or produce documentary evidence. Failure to obey the court order is punishable as contempt of court.\n(c) When making an examination or audit under this section, the commissioner may retain attorneys, appraisers, independent actuaries, independent certified public accountants, or other professionals and specialists as examiners, the cost of which must be paid by the company that is the subject of the examination or audit.\n(d) This section does not limit the commissioner's authority to terminate or suspend any examination in order to pursue other legal or regulatory action pursuant to the insurance laws of this state. Findings of fact and conclusions made pursuant to an examination are prima facie evidence in a legal or regulatory action.\n(e) Nothing contained in this section shall be construed to limit the commissioner's authority to use as evidence a final or preliminary examination report, examiner or company work papers or other documents, or other information discovered or developed during the course of an examination in the furtherance of a legal or administrative action which the commissioner may, in the commissioner's sole discretion, consider appropriate.\n(a) The commissioner shall make a full and true report of every examination conducted pursuant to this chapter, which shall include (1) a statement of findings of fact relating to the financial status and other matters ascertained from the books, papers, records, documents, and other evidence obtained by investigation and examination or ascertained from the testimony of officers, agents, or other persons examined under oath concerning the business, affairs, assets, obligations, ability to fulfill obligations, and compliance with all the provisions of the law of the company, applicant, organization, or person subject to this chapter and (2) a summary of important points noted in the report, conclusions, recommendations and suggestions as may reasonably be warranted from the facts so ascertained in the examinations. The report of examination shall be verified by the oath of the examiner in charge thereof, and shall be prima facie evidence in any action or proceedings in the name of the state against the company, applicant, organization, or person upon the facts stated therein.\n(b) No later than 60 days following completion of the examination, the examiner in charge shall file with the department a verified written report of examination under oath. Upon receipt of the verified report, the department shall transmit the report to the company examined, together with a notice which provides the company examined with a reasonable opportunity of not more than 30 days to make a written submission or rebuttal with respect to matters contained in the examination report.\n(c) Within 30 days of the end of the period allowed for the receipt of written submissions or rebuttals, the commissioner shall fully consider and review the report, together with the written submissions or rebuttals and the relevant portions of the examiner's work papers and enter an order:\n(1) adopting the examination report as filed or with modification or corrections. If the examination report reveals that the company is operating in violation of any law, rule, or prior order of the commissioner, the commissioner may order the company to take any action the commissioner considers necessary and appropriate to cure the violation;\n(2) rejecting the examination report with directions to the examiners to reopen the examination for purposes of obtaining additional data, documentation, or information, and refiling the report as required under paragraph (b); or\n(3) calling for an investigatory hearing with no less than 20 days' notice to the company for purposes of obtaining additional documentation, data, information, and testimony.\n(d)(1) All orders entered under paragraph (c), clause (1), must be accompanied by findings and conclusions resulting from the commissioner's consideration and review of the examination report, relevant examiner work papers, and any written submissions or rebuttals. The order is a final administrative decision and may be appealed as provided under chapter 14. The order must be served upon the company by certified mail, together with a copy of the adopted examination report. Within 30 days of the issuance of the adopted report, the company shall file affidavits executed by each of its directors stating under oath that they have received a copy of the adopted report and related orders.\n(2) A hearing conducted under paragraph (c), clause (3), by the commissioner or authorized representative, must be conducted as a nonadversarial confidential investigatory proceeding as necessary for the resolution of inconsistencies, discrepancies, or disputed issues apparent upon the face of the filed examination report or raised by or as a result of the commissioner's review of relevant work papers or by the written submission or rebuttal of the company. Within 20 days of the conclusion of the hearing, the commissioner shall enter an order as required under paragraph (c), clause (1).\n(3) The commissioner shall not appoint an examiner as an authorized representative to conduct the hearing. The hearing must proceed expeditiously. Discovery by the company is limited to the examiner's work papers which tend to substantiate assertions in a written submission or rebuttal. The commissioner or the commissioner's representative may issue subpoenas for the attendance of witnesses or the production of documents considered relevant to the investigation whether under the control of the department, the company, or other persons. The documents produced must be included in the record. Testimony taken by the commissioner or the commissioner's representative must be under oath and preserved for the record.\nThis section does not require the department to disclose information or records which would indicate or show the existence or content of an investigation or activity of a criminal justice agency.\n(4) The hearing must proceed with the commissioner or the commissioner's representative posing questions to the persons subpoenaed. Thereafter, the company and the department may present testimony relevant to the investigation. Cross-examination may be conducted only by the commissioner or the commissioner's representative. The company and the department shall be permitted to make closing statements and may be represented by counsel of their choice.\n(e)(1) Upon the adoption of the examination report under paragraph (c), clause (1), the commissioner shall continue to hold the content of the examination report as private and confidential information for a period of 30 days except as otherwise provided in paragraph (b). Thereafter, the commissioner may open the report for public inspection if a court of competent jurisdiction has not stayed its publication.\n(2) Nothing contained in this subdivision prevents or shall be construed as prohibiting the commissioner from disclosing the content of an examination report, preliminary examination report or results, or any matter relating to the reports, to the Commerce Department or the insurance department of another state or country, or to law enforcement officials of this or another state or agency of the federal government at any time, if the agency or office receiving the report or matters relating to the report agrees in writing to hold it confidential and in a manner consistent with this subdivision.\n(3) If the commissioner determines that regulatory action is appropriate as a result of an examination, the commissioner may initiate proceedings or actions as provided by law.\n(f) All working papers, scheduling orders, recorded information, documents and copies thereof produced by, obtained by, or disclosed to the commissioner or any other person in the course of an examination made under this subdivision, or in the course of market analysis, including documents related to scheduling conferences, must be given confidential treatment and are not subject to subpoena and may not be made public by the commissioner or any other person, except to the extent provided in paragraph (e). Access may also be granted to the National Association of Insurance Commissioners (NAIC), the Financial Industry Regulatory Authority, and any national securities association registered under the Securities Exchange Act of 1934. The parties must agree in writing prior to receiving the information to provide to it the same confidential treatment as required by this section, unless the prior written consent of the company to which it pertains has been obtained. For purposes of this section, \"market analysis\" means a process whereby market conduct surveillance personnel collect and analyze information from filed schedules, surveys, required reports, such as the NAIC Market Conduct Annual Statement, or other sources in order to develop a baseline profile of an insurer, to review the operation or activity of an insurer, or to identify patterns or practices of insurers licensed to do business in this state that deviate significantly from the norm or that may pose a potential risk to the insurance consumer.\n(g) Information in the possession or control of, or obtained or disclosed to, the commissioner in the course of, or derived from, market analysis, as defined in paragraph (f), by an insurance company and any scheduling order, supplement to a scheduling order, or document related to a scheduling conference required under section 60A.033 is:\n(1) subject to confidential treatment as provided under paragraph (f); and\n(2) not subject to subpoena or other discovery nor admissible in evidence in a private civil action. Neither the commissioner nor any person who received information while acting under the authority of the commissioner is permitted or required to testify in a private civil action concerning the information. Nothing in this paragraph limits the ability of the commissioner to use the information in furtherance of an action brought by the commissioner.\n(h) Requests for information issued by the commissioner to an insurance company in the course of a market analysis, as defined in paragraph (f), must be issued under the commissioner's authority as provided in this section.\n(i) Notwithstanding paragraph (h), the commissioner may request information from an insurance company pursuant to the commissioner's authority under section 45.027, subdivision 1a or 2, if:\n(1) the request for information is in connection with an unresolved consumer complaint; or\n(2) there is an imminent risk of significant harm to a consumer.\n(j) Requests for information from the commissioner to an insurance company under paragraph (i) are not subject to section 60A.033.\nWithin a reasonable time of receipt of an examination report the commissioner may issue an order to the examinee directing compliance within a time specified in the order or by law with one or more of the following:\n(a) to restore within the time and extent prescribed by law or the commissioner's order any deficiency, whenever its capital, reserves or surplus have become impaired,\n(b) to cease and desist from transaction of any business or from any business practice which if transacted or continued might result in the examinee's condition or further transaction of business being hazardous to its policyholders, its creditors, or the public,\n(c) to cease and desist from any other violation of its charter or any law of the state.\n(a) Notwithstanding section 72A.05, any person who violates or aids and abets any violation of a written order issued pursuant to this section may be fined not more than $10,000 for each day the violation continues for each violation of the order and the money so recovered shall be paid into the general fund.\n(b) For conduct prohibited under chapters 60A to 79, multiple violations of an identical or substantially similar law, rule, or order shall be considered a single violation under this section and section 45.027. This paragraph does not apply to willful violations by the insurer. This paragraph does not apply to violations that the insurer has not taken corrective action for and that:\n(1) cause financial harm to the policyholder;\n(2) constitute an unfair method of competition; or\n(3) constitute an unfair or deceptive act or practice.\n(c) For any applicable penalty imposed by the commissioner under this section, the commissioner must consider whether corrective action for the consumer was taken promptly after a violation was discovered or the violation was not part of a pattern or practice, and shall reduce or eliminate the penalty accordingly.\n(d) This subdivision does not apply if a different penalty is specified under law.\nIn lieu of an examination under this section of a foreign or an alien insurer licensed in this state, the commissioner may accept an examination report on the company as prepared by the insurance department for the company's state of domicile or port of entry state until January 1, 1994. After January 1, 1994, the reports may only be accepted if:\n(1) the insurance department is accredited under the National Association of Insurance Commissioners Financial Regulation Standards and Accreditation Program at the time of the examination; or\n(2) the examination is performed under the supervision of an accredited insurance department or with the participation of one or more examiners who are employed by an accredited state insurance department and who, after a review of the examination work papers and report, state under oath that the examination was performed in a manner consistent with the standards and procedures required by their insurance department.\nThe department shall establish reasonable procedures so that no examiner, either directly or indirectly, has a conflict of interest or is affiliated with the management of or owns a pecuniary interest in a person subject to examination under this chapter. This section shall not be construed to automatically preclude an examiner from being:\n(1) a policyholder or claimant under an insurance policy;\n(2) a grantor of a mortgage or similar instrument on the examiner's residence to a regulated entity if done under customary terms and in the ordinary course of business;\n(3) an investment owner in shares of regulated diversified investment companies; or\n(4) a settlor or beneficiary of a \"blind trust\" into which any otherwise impermissible holdings have been placed.\nNotwithstanding the requirements of this section, the commissioner may retain from time to time, on an individual basis, qualified actuaries, certified public accountants, or other similar individuals who are independently practicing their professions, even though the persons may from time to time be similarly employed or retained by persons subject to examination under this chapter.\nThe commissioner may promulgate any rules which may be necessary to the administration of subdivisions 1 to 9.\n(a) No cause of action shall arise nor shall liability be imposed against the commissioner, the commissioner's authorized representatives, or an examiner appointed by the commissioner for statements made or conduct performed in good faith while carrying out the provisions of this section.\n(b) No cause of action shall arise, nor shall liability be imposed against a person for the act of communicating or delivering information or data to the commissioner or the commissioner's authorized representative or examiner pursuant to an examination made under this section, if the act of communication or delivery is performed in good faith and without fraudulent intent or the intent to deceive.\n(c) This section does not abrogate or modify a common law or statutory privilege or immunity enjoyed by a person identified in paragraph (a).\n(d) A person identified in paragraph (a) may be awarded attorney fees and costs if the person is the prevailing party in a civil cause of action for libel, slander, or other relevant tort arising out of activities in carrying out the provisions of this section, and the party bringing the action was not substantially justified in doing so. For purposes of this section, a proceeding is \"substantially justified\" if it had a reasonable basis in law or fact at the time that it was initiated.\nAn enforcement action or administrative proceeding brought by the commissioner against a licensee who violates any law, rule, or order related to the duties and responsibilities entrusted to the commissioner in chapters 60A to 79, including without limitation the issuance of an order pursuant to chapters 60A to 79, must be commenced within nine years of the date the violation occurs unless the violation arises out of a contract that remains in force, in which case the action or administrative proceeding must be commenced within two years of the date of the discovery of the violation. If the licensee attempts to conceal a violation, an enforcement action or administrative proceeding must be brought by the commissioner within nine years of discovery of the violation by the commissioner.\nIf the commissioner elects to participate in an examination of a licensee that involves multiple states, the commissioner is prohibited from commencing, undertaking, or continuing an examination under this section against the subject examinee related to the same alleged conduct, including without limitation incurring or charging any examination costs, unless and until the multistate examination is complete or Minnesota has formally withdrawn from that examination. With respect to any completed multistate examination that Minnesota elected to participate in, the commissioner is prohibited from taking separate action against a licensee that was subject to the multistate examination unless the commissioner follows the procedures set forth in this section and section 60A.033, as applicable.",
	"repealed": false
}