{
	"id": "256.977",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.977",
	"title": "256.977 SENIOR COMPANION PROGRAM.",
	"text": "This section may be cited as the \"Minnesota Senior Companion Act.\"\nThere is established a senior companion program to engage the services of low-income persons aged 60 or over to provide supportive person to person assistance in health, education, welfare and related fields primarily to adults with a disability and elderly people living in their own homes. Senior companions may also be used to provide such services to adults with a disability and elderly persons living or receiving care in resident group homes for dependent and neglected persons, nursing homes, private homes, or other public or private nonprofit institutions or agencies providing care for adults with a disability or elderly persons. Foster grandparents currently serving individuals over 21 years of age pursuant to section 256.976 shall, after July 1, 1976, be called senior companions.\nPersons serving as senior companions shall be compensated for no more than 20 hours per week at an hourly rate not to exceed the rate established under the Older Americans Act. In addition, senior companions shall receive such other assistance as the Minnesota Board on Aging may prescribe. No person serving as a senior companion shall be terminated as a result of a change in the eligibility requirements set by the Minnesota Board on Aging, nor as a result of a change in income, marital status, or number of dependents.\nThe Minnesota Board on Aging may make grants-in-aid for the purchase of senior companion services by nonprofit agencies and institutions and individuals who have access to or responsibility for adults with a disability and the elderly. Applications to provide senior companion services to individuals in their homes shall have priority over applications to provide services to individuals living in group homes, nursing homes, or other institutions. Applications for grants shall be made on forms prescribed by the Minnesota Board on Aging.\nGrants shall be paid as follows: 90 percent of the program expenditures authorized by the Minnesota Board on Aging shall be paid by the state and ten percent shall be paid by local matching funds. Grants shall be for a period of 12 months or less. Grants shall not be used to match other state funds nor shall any person paid from grant funds be used to replace any staff members of the grantee. Each grantee shall file a semiannual report with the Minnesota Board on Aging at the time and containing the information as the board shall prescribe.\nThe Minnesota Board on Aging shall promulgate rules necessary to implement the provisions of this section and may employ necessary assistance in performing its administrative duties. Rules adopted shall be consistent with applicable federal guidelines.",
	"repealed": false
}