{
	"id": "356.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.32",
	"title": "356.32 PROPORTIONATE ANNUITY AT AGE 65.",
	"text": "(a) Notwithstanding any provision to the contrary of the laws governing any of the retirement funds enumerated in subdivision 2, any person who is an active member of any applicable fund, who has credit for at least one year of allowable service in one or more of the covered plans, and who terminates active service under a mandatory retirement law or policy or at the normal retirement age but not less than age 65, is entitled upon making written application on the form prescribed by the chief administrative officer of the plan to a proportionate retirement annuity from each covered plan in which the person has at least six months of allowable service credit.\n(b) The proportionate annuity must be calculated under the applicable laws governing annuities based upon allowable service credit at the time of retirement and the person's average salary for the highest five successive years of allowable service or the average salary for the entire period of allowable service if less than five years.\n(c) Nothing in this section prevents the imposition of the appropriate early retirement reduction of an annuity which commences before the normal retirement age.\nThe provisions of this section apply to the following retirement plans:\n(1) the general state employees retirement plan of the Minnesota State Retirement System, established under chapter 352;\n(2) the correctional state employees retirement plan of the Minnesota State Retirement System, established under chapter 352;\n(3) the State Patrol retirement plan, established under chapter 352B;\n(4) the general employees retirement plan of the Public Employees Retirement Association, established under chapter 353;\n(5) the public employees police and fire plan of the Public Employees Retirement Association, established under chapter 353;\n(6) the local government correctional service retirement plan of the Public Employees Retirement Association, established under chapter 353E;\n(7) the Teachers Retirement Association, established under chapter 354; and\n(8) the St. Paul Teachers Retirement Fund Association, established under chapter 354A.",
	"repealed": false
}