{
	"id": "48A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.10",
	"title": "48A.10 SUBSTITUTION; PROCEDURE.",
	"text": "A bank or trust company may file an application with the district court in the county in which an affiliated bank or other bank or trust company for which it seeks to be substituted is located requesting that it be substituted, except as is expressly excluded in the application, in every fiduciary capacity held by the affiliated bank or other bank or trust company that is specified in the application. The affiliated bank or other bank or trust company for which substitution is sought shall join in the application. The application need not list the fiduciary capacities in which substitution is requested.\nWhen the application is filed with the district court, the court shall set a date and time for hearing and direct that notice of the hearing be given as provided in this subdivision. The applicant shall cause a copy of the notice to be published at least once a week for two consecutive weeks in a legal newspaper in the county where the hearing is to be held, the last publication of which is to be at least ten days before the time set for the hearing. The court may require additional notice as it considers necessary. A defect in giving notice does not limit or affect the validity of an order entered according to this section.\nUpon finding that the applicant is authorized to exercise fiduciary powers, the district court shall enter an order substituting the applicant bank or trust company in every fiduciary capacity held by the affiliated bank or other bank or trust company for which substitution is sought and which joined in the application, except as may be otherwise specified in the application, and except for fiduciary capacities in any account with respect to which a person beneficially interested in the account has filed objection to the substitution and has appeared and been heard in support of the objection. Upon entry of the order, or at a later date as may be specified in the order, the applicant bank or trust company is substituted in every fiduciary capacity to which the order extends. The substitution may be made a matter of record in any county of this state by filing a certified copy of the order of substitution in the office of the court administrator of a district court, or by filing a certified copy of the order in the office of the county recorder.\nA designation in a will or other instrument of an affiliated bank as fiduciary is considered a designation of the bank or trust company substituted for the affiliated bank according to this section except where the will or other instrument is executed after the substitution and expressly provides that this section does not apply. Except as otherwise provided in this subdivision, a grant in a will or other instrument of a discretionary power is considered conferred upon the bank or trust company substituted as the fiduciary according to this section.\nAn affiliated bank or other bank or trust company shall account jointly with the substituted bank or trust company for the accounting period during which the substitution occurred. Upon substitution according to this section, the affiliated bank or other bank or trust company shall deliver to the substituted bank or trust company all assets held by the affiliated bank or other bank or trust company as fiduciary, except assets held for fiduciary accounts with respect to which no substitution occurs. Upon substitution, all assets become the property of the substituted bank or trust company without the necessity of any instrument of transfer or conveyance.\nThe trustees of an estate or property may surrender and resign the trust in favor of the trust company that will accept the trust and convey and deliver to it all property and assets of the trust, upon condition that the grantor, cestui que trust, and all parties in any manner interested in the execution and performance of the trust shall execute, acknowledge, and deliver an instrument in writing, consenting to the transfer, releasing and discharging the original trustee, and appointing the trust company as successor. If either party to the original trust is dead or does not join in the written consent, or if the original trust was created under a last will or an order or decree of a court of record, then the transfer is not valid except after full compliance with the judgment or decree of a court having jurisdiction to remove the acting trustee.\nA bank or trust company that receives $500 or more as executor, administrator, guardian, or other trustee, or by order of court, that is not required for the purposes of the trust, or does not have to be accounted for within one year, shall invest it as soon as practicable in authorized securities either then held by it or specially obtained by it. The income, less its proper charges, becomes part of the trust estate. The net accumulations on the income must be invested, accounted for, and allowed in the settlement of the trust.\nExcept as may be otherwise provided in the governing will, trust agreement, court order, or other instrument, any amount in a trust account may be invested in certificates of deposit, share certificates, or savings accounts in a bank or banks, or credit union, if the beneficial owner is a member, if the certificates of deposit, share certificates, or savings accounts are fully insured by an agency of the federal government insuring deposits and receive the prevailing rate of interest on the certificates or savings accounts.",
	"repealed": false
}