{
	"id": "65A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.08",
	"title": "65A.08 SPECIAL PROVISIONS.",
	"text": "[Repealed, 1979 c 175 s 1]\n(a) In the absence of any change increasing the risk, without the consent of the insurer, of which the burden of proof shall be upon it, and in the absence of intentional fraud on the part of the insured, the insurer shall pay the whole amount mentioned in the policy or renewal upon which it receives a premium, in case of total loss, and in case of partial loss, the full amount thereof.\n(b) Notwithstanding paragraph (a), on a policy issued by the Minnesota FAIR plan under section 65A.36, the Minnesota FAIR plan may contest the whole amount set forth in the policy in the case of a total loss. If the Minnesota FAIR plan takes the position that the value of the property was less than the whole amount set forth in the policy, the Minnesota FAIR plan has the burden of proving by clear and convincing evidence that the value was less than that set forth in the policy. If the Minnesota FAIR plan pays less than the whole amount mentioned in the policy for a total loss, pursuant to this paragraph, the Minnesota FAIR plan shall refund to the insured the premium paid attributable to the difference between the whole amount mentioned in the policy and the amount paid for the total loss.\nPolicies on farm buildings or other structures may, in consideration of a reduction in the premium by the company, include a provision determining the amount of loss in connection with repair or replacement of the insured property.\nIf there are two or more policies upon the property, each shall contribute to the payment of the whole or partial loss in proportion to the amount specified.\nAny policy may contain a coinsurance clause, if the insured requests the same, in writing, of which fact such writing shall be the only evidence, and if, in consideration thereof, a reduction in the rate of premium is made by the company. When so demanded and attached to the policy, this agreement shall be binding upon both the insured and the company, and, in case of loss, the actual cash value of the property so insured at the time of the loss, including the buildings, shall be the basis for determining the proper amount of the coinsurance, and the amount of loss, notwithstanding any previous valuation of the building.\nNo company shall knowingly issue any policy upon property in this state for a longer term than five years.",
	"repealed": false
}