{
	"id": "43A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.07",
	"title": "43A.07 CLASSIFIED SERVICE.",
	"text": "The commissioner shall maintain, revise and administer a classification plan.\nAn appointing authority shall notify the commissioner when a new position is to be established in the classified service. The commissioner shall allocate the position to an appropriate class in the classification plan or if the position cannot be allocated to an existing class, establish a new class. The commissioner shall assign an appropriate salary rate or range to the class. If the class is in a bargaining unit under the provisions of section 179A.10, and there is an applicable provision in the collective bargaining agreement the commissioner shall establish the salary rate or range pursuant to the agreement.\nThe commissioner may independently conduct classification studies or, upon request of a permanent employee, may investigate the duties of a classified position. If a request is denied, the employee must be given a written explanation. The commissioner shall investigate the duties of a classified position upon request of an appointing authority. The commissioner may reclassify the position, change the title of the position or establish a new class. The commissioner shall assign an appropriate salary rate or range to the class. If the class is in a collective bargaining unit under the provisions of section 179A.10, and there is an applicable provision in the collective bargaining agreement, the commissioner shall establish the salary rate or range pursuant to the agreement.\nAn appointing authority who is affected by a position allocation or reclassification or an employee who is affected by a position reclassification may protest the allocation or reclassification in writing to the commissioner. The commissioner shall review the allocation or reclassification and may change the allocation or reclassification decision. This procedure shall not be subject to contested case provisions of the Administrative Procedure Act.\nExcept as provided in section 43A.17, subdivision 5, the incumbent of a position which has been reclassified shall continue in the position only if the employee is eligible for and is appointed to the position of the new class in accordance with the provisions of this chapter and the rules, administrative procedures or a collective bargaining agreement entered into under sections 179A.01 to 179A.25 governing reallocation or change in allocation of positions, promotion, transfer, and demotion. If the incumbent is ineligible to continue in the position and is not transferred, promoted or demoted, the layoff provisions of plans pursuant to section 43A.18 or a collective bargaining agreement entered into under sections 179A.01 to 179A.25 shall apply. Personnel changes required by the reclassification of positions shall be completed within a reasonable period of time, as prescribed by the commissioner, following the reclassification notice to an appointing authority.\nAn employee may be granted a leave of absence from a position in the classified service to accept a position in the unclassified service. Upon request, during the unclassified appointment or within 60 days of the end of the unclassified appointment, the employee shall be reappointed in the agency from which the employee was granted the leave, to a classified position comparable to that held immediately prior to being appointed to the unclassified position.\nExcept for just cause, an incumbent with permanent status shall not be removed from a position which is declassified for a period of one year following the declassification. An appointing authority may remove an incumbent of a declassified position after one year with 30 days' prior notice. At any time after the declassification, and prior to the end of the 30-day notice period, if so requested, the employee shall be appointed within the same agency to a classified position comparable to the position that was declassified or, if a comparable position is unavailable, to a position in that agency comparable to that held immediately prior to being appointed to the declassified position. This section applies only to the incumbent at the time the position is declassified and not to employees subsequently appointed to the declassified position.",
	"repealed": false
}