{
	"id": "216G.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/216G.07",
	"title": "216G.07 PROTECTING PUBLIC FACILITIES AND AGRICULTURAL LAND.",
	"text": "Unless waived in the manner provided in subdivisions 2 or 3, any pipeline installed after May 26, 1979, shall be buried with a minimum level cover of not less than 4-1/2 feet in all areas where the pipeline crosses the right-of-way of any public drainage facility or any county, town or municipal street or highway and where the pipeline crosses cultivated agricultural land. Where the pipeline crosses the right-of-way of any drainage ditch, the pipeline shall be at least 4-1/2 feet below the authorized depth of the ditch, unless waived in the manner provided in subdivisions 2 and 3.\nIn any easement granting right-of-way for a pipeline over cultivated agricultural land the grantor of the easement may waive the minimum depth of cover requirement of subdivision 1 with respect to all or part of the pipeline to be buried under that land. A waiver of the minimum depth of cover requirement of subdivision 1 shall be effective only if the waiver:\n(1) is separately and expressly stated in the easement agreement and includes an express statement by the grantor acknowledging that the grantor has read and understood the waiver;\n(2) is printed in capital letters and in language understandable to an average person not learned in law; and\n(3) is separately signed or initialed by the grantor.\nAny political subdivision authorized by law to approve the use of the right-of-way of any public drainage facility or any public street or highway for a pipeline may:\n(1) waive the minimum depth of cover requirement of subdivision 1 if the depth of cover or other means approved for the use of the right-of-way adequately protects the health and safety of the public; or\n(2) adopt and enforce by ordinance or resolution reasonable rules or regulations establishing a greater depth of cover than the minimum required in subdivision 1 and other measures for protection of public roads and drainage facilities under their jurisdiction.\nSubdivisions 1 to 3 shall not apply to interstate natural gas pipelines subject to safety regulations under the federal Natural Gas Pipeline Safety Act of 1968, Public Law 90-481, as amended.\nA county board may establish by ordinance reasonable standards and conditions for pipeline construction which are necessary to protect and restore cultivated agricultural land crossed by a pipeline and to mitigate the adverse impact of pipeline construction on the productive use of that land. The standards may include but shall not be limited to standards and conditions concerning restoration of drainage tile and drainage patterns, soil compaction and removal of rocks and debris after construction. A county adopting standards and conditions for pipeline construction shall consult with adjacent counties and other counties in the same development region and shall endeavor to adopt standards and conditions which are reasonably uniform with standards and conditions in adjacent counties and in other counties in that region.\nBefore beginning construction a person proposing to construct a pipeline shall pay an inspection fee to the treasurer of each county through which the pipeline will be constructed. The fee shall be in the amount of $500 for each mile or fraction of a mile of pipeline that will be constructed in the county.\nThe county board of each county through which a pipeline will be constructed shall designate an inspector who shall conduct on-site inspections of the construction to determine whether the pipeline is constructed in compliance with the provisions of this section and ordinances or resolutions adopted pursuant to this section. The inspector shall promptly report to the county board any failure or refusal to comply with the provisions of this section or ordinances or resolutions adopted pursuant to this section and shall issue a written notice to the person constructing the pipeline specifying the violation and the action to be taken in order to comply.\nDuring on-site inspection the inspector shall maintain a written log which shall include a record of comments and complaints concerning the pipeline construction made by owners and lessees of land crossed by the pipeline and by local officials. The log shall note in particular any complaints concerning failure to settle damage claims filed by any owner or lessee or failure to comply with the terms of an easement agreement. The log, reports and other records of the inspector shall be preserved by the county board.\nThe provisions of subdivision 1 or of ordinances or resolutions adopted pursuant to subdivisions 3 and 5 may be enforced by injunction, action to compel performance or other appropriate equitable relief in the district court of the county in which the violation occurs. The relief may be sought by petition of the county attorney or the attorney of the political subdivision that adopted the ordinance or resolution violated or in which the violation occurs.\nAny person who violates the provisions of subdivision 1 or any ordinance or resolution adopted pursuant to subdivisions 3 and 5 is guilty of a misdemeanor for each offense.\nWhen the court finds that any person has violated the provisions of subdivision 1 or any ordinance or resolution adopted pursuant to subdivisions 3 and 5 or has violated any court order issued under subdivision 8 the court may impose a civil penalty of not more than $5,000 for each violation. These penalties shall be paid to the county in which the violation occurred.",
	"repealed": false
}