{
	"id": "116C.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.71",
	"title": "116C.71 DEFINITIONS.",
	"text": "For the purposes of sections 116C.71 to 116C.74, the terms defined in this section have the meaning given them.\n\"Area characterization plan\" means the official plan prepared by the Department of Energy for a specific geographic area outlining the proposed laboratory or field activities to be undertaken to establish the geologic, environmental, social, and economic characteristics of the area.\n\"Area recommendation report\" means the official report prepared by the Department of Energy identifying specific geographic areas within a state for further evaluation as a repository for radioactive waste.\n\"Board\" means the Minnesota Environmental Quality Board.\n\"By-product nuclear material\" means any material, except special nuclear material, yielded in or made radioactive by:\n(a) exposure to the radiation incident to the process of producing or utilizing special nuclear material; or\n(b) exposure to radiation produced or accelerated in an atomic or subatomic particle accelerating machine.\n\"Chair\" means the chair of the board.\n\"Consultation and cooperation agreement\" means the formal agreement, as defined in the Nuclear Waste Policy Act, United States Code, title 42, section 10137(c), between a state and the federal government setting forth procedures for information exchanges, state consultation, and other matters related to repository siting and construction.\n\"Council\" means the governor's Nuclear Waste Council.\n\"Department of Energy\" means the United States Department of Energy.\n\"Dispose\" or \"disposal\" means the permanent or temporary placement of high-level radioactive waste at a site within the state other than a point of generation.\n\"High-level radioactive waste\" means:\n(1) irradiated reactor fuel;\n(2) liquid wastes resulting from reprocessing irradiated reactor fuel;\n(3) solids into which the liquid wastes have been converted;\n(4) transuranic wastes, meaning any radioactive waste containing alpha emitting transuranic elements that is not acceptable for near-surface disposal as defined in the Code of Federal Regulations, title 10, section 61.55;\n(5) any other highly radioactive materials that the Nuclear Regulatory Commission or Department of Energy determines by law to require permanent isolation; or\n(6) any by-product material as defined in section 11e (2) of the Atomic Energy Act of 1954, United States Code, title 42, section 2014, as amended.\n\"Person\" means any individual, corporation, partnership or other unincorporated association or governmental agency.\n\"Potentially impacted area\" means the area designated or described in a draft or final area recommendation report or area characterization plan for study or consideration.\n\"Radiation\" means any or all of the following: alpha rays, beta rays, gamma rays, high energy neutrons or protons or electrons, and other atomic particles; but not x-rays and electromagnetic radiations of wavelengths greater than 2,000 Angstrom units and sound waves.\n\"Radioactive material\" means any matter which emits radiation. Radioactive material includes special nuclear material, source nuclear material, and by-product nuclear material.\n(a) \"Radioactive waste\" means:\n(1) useless or unwanted capturable radioactive residues produced incidental to the use of radioactive material; or\n(2) useless or unwanted radioactive material; or\n(3) otherwise nonradioactive material made radioactive by contamination with radioactive material.\n(b) Radioactive waste does not include discharges of radioactive effluents to air or surface water when subject to applicable federal or state regulations or excreta from persons undergoing medical diagnosis or therapy with radioactive material or naturally occurring radioactive isotopes.\n\"Radioactive waste management facility\" means a geographic site, including buildings, structures, and equipment in or upon which radioactive waste is retrievably or irretrievably disposed by burial in soil or permanently stored. An independent spent-fuel storage installation located on the site of a Minnesota nuclear generation facility for dry cask storage of spent nuclear fuel generated solely by that facility is not a radioactive waste management facility.\n\"Source nuclear material\" means:\n(1) uranium or thorium or any combination thereof, in any physical or chemical form; or\n(2) ores which contain by weight 1/20 of one percent or more of uranium, thorium, or any combination thereof. Source nuclear material does not include special nuclear material.\n\"Special nuclear material\" means:\n(1) plutonium, uranium 233, uranium enriched in the isotope 233 or in the isotope 235, and any other material which the Nuclear Regulatory Commission, pursuant to the Atomic Energy Act of 1954 as amended, determines to be special nuclear material; or\n(2) any material artificially enriched by any of the materials described in clause (1). Special nuclear material does not include source nuclear material.\n[Renumbered subd 1a]\n[Renumbered subd 1b]\n[Renumbered subd 1c]\n[Renumbered subd 2a]\n[Renumbered subd 2b]\n[Renumbered subd 2c]\n[Renumbered subd 2d]\n[Renumbered subd 2e]\n[Renumbered subd 2f]\n[Renumbered subd 3a]",
	"repealed": false
}