{
	"id": "609.344",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.344",
	"title": "609.344 CRIMINAL SEXUAL CONDUCT IN THE THIRD DEGREE.",
	"text": "A person who engages in sexual penetration with another person is guilty of criminal sexual conduct in the third degree if any of the following circumstances exists:\n(a) the actor uses coercion to accomplish the penetration;\n(b) the actor knows or has reason to know that the complainant is mentally impaired, mentally incapacitated, or physically helpless;\n(c) the actor uses force, as defined in section 609.341, subdivision 3, clause (2); or\n(d) at the time of the act, the actor is in a prohibited occupational relationship with the complainant.\nA person who engages in sexual penetration with anyone under 18 years of age is guilty of criminal sexual conduct in the third degree if any of the following circumstances exists:\n(a) the complainant is under 14 years of age and the actor is no more than 36 months older than the complainant. Neither mistake as to the complainant's age nor consent to the act by the complainant shall be a defense;\n(b) the complainant is at least 14 but less than 16 years of age and the actor is more than 24 months older than the complainant. In any such case if the actor is no more than 60 months older than the complainant, it shall be an affirmative defense, which must be proved by a preponderance of the evidence, that the actor reasonably believes the complainant to be 16 years of age or older. In all other cases, mistake as to the complainant's age shall not be a defense. Consent by the complainant is not a defense;\n(c) the actor uses coercion to accomplish the penetration;\n(d) the actor knows or has reason to know that the complainant is mentally impaired, mentally incapacitated, or physically helpless;\n(e) the complainant is at least 16 but less than 18 years of age and the actor is more than 36 months older than the complainant and in a current or recent position of authority over the complainant. Neither mistake as to the complainant's age nor consent to the act by the complainant is a defense;\n(f) the actor has a significant relationship to the complainant and the complainant was at least 16 but under 18 years of age at the time of the sexual penetration. Neither mistake as to the complainant's age nor consent to the act by the complainant is a defense;\n(g) the actor has a significant relationship to the complainant, the complainant was at least 16 but under 18 years of age at the time of the sexual penetration, and:\n(i) the actor or an accomplice used force or coercion to accomplish the penetration;\n(ii) the complainant suffered personal injury; or\n(iii) the sexual abuse involved multiple acts committed over an extended period of time.\nNeither mistake as to the complainant's age nor consent to the act by the complainant is a defense;\n(h) the actor uses force, as defined in section 609.341, subdivision 3, clause (2); or\n(i) at the time of the act, the actor is in a prohibited occupational relationship with the complainant.\nExcept as otherwise provided in section 609.3455, a person convicted under subdivision 1 or subdivision 1a may be sentenced:\n(1) to imprisonment for not more than 15 years or to a payment of a fine of not more than $30,000, or both; or\n(2) if the person was convicted under subdivision 1a, paragraph (b), and if the actor was no more than 36 months but more than 24 months older than the complainant, to imprisonment for not more than five years or a fine of not more than $30,000, or both.\nA person convicted under this section is also subject to conditional release under section 609.3455.\nExcept when imprisonment is required under section 609.3455; or Minnesota Statutes 2004, section 609.109, if a person is convicted under subdivision 1a, clause (f), the court may stay imposition or execution of the sentence if it finds that:\n(a) a stay is in the best interest of the complainant or the family unit; and\n(b) a professional assessment indicates that the offender has been accepted by and can respond to a treatment program.\nIf the court stays imposition or execution of sentence, it shall include the following as conditions of probation:\n(1) incarceration in a local jail or workhouse;\n(2) a requirement that the offender complete a treatment program; and\n(3) a requirement that the offender have no unsupervised contact with the complainant until the offender has successfully completed the treatment program unless approved by the treatment program and the supervising correctional agent.",
	"repealed": false
}