{
	"id": "211B.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.15",
	"title": "211B.15 CORPORATE POLITICAL CONTRIBUTIONS.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given. Unless otherwise provided, the definitions in section 10A.01 also apply to this section.\n(b) \"Chief executive officer\" means the highest-ranking officer or decision-making individual with authority over a corporation's affairs.\n(c) \"Corporation\" means:\n(1) a corporation organized for profit that does business in this state;\n(2) a nonprofit corporation that carries out activities in this state; or\n(3) a limited liability company formed under chapter 322C, or under similar laws of another state, that does business in this state.\n(d) \"Foreign-influenced corporation\" means a corporation as defined in paragraph (c), clause (1) or (3), for which at least one of the following conditions is met:\n(1) a single foreign investor holds, owns, controls, or otherwise has direct or indirect beneficial ownership of one percent or more of the total equity, outstanding voting shares, membership units, or other applicable ownership interests of the corporation;\n(2) two or more foreign investors in aggregate hold, own, control, or otherwise have direct or indirect beneficial ownership of five percent or more of the total equity, outstanding voting shares, membership units, or other applicable ownership interests of the corporation; or\n(3) a foreign investor participates directly or indirectly in the corporation's decision-making process with respect to the corporation's political activities in the United States.\nThe calculation of a person's or entity's ownership interest for purposes of clauses (1) and (2) must exclude any portion of the person's or entity's direct or indirect beneficial ownership of equity, outstanding voting shares, membership units, or otherwise applicable ownership interests of a corporation that are held or owned in a mutual fund based in the United States.\n(e) \"Foreign investor\" means a person or entity that:\n(1) holds, owns, controls, or otherwise has direct or indirect beneficial ownership of equity, outstanding voting shares, membership units, or otherwise applicable ownership interests of a corporation; and\n(2) is any of the following:\n(i) a government of a foreign country;\n(ii) a political party organized in a foreign country;\n(iii) a partnership, association, corporation, organization, or other combination of persons organized under the laws of or having its principal place of business in a foreign country;\n(iv) an individual outside of the United States who is not a citizen or national of the United States and who is not lawfully admitted for permanent residence in the United States; or\n(v) a corporation in which a foreign investor as defined in items (i) to (iv) holds, owns, controls, or otherwise has directly or indirectly acquired beneficial ownership of equity or voting shares in an amount that is equal to or greater than 50 percent of the total equity or outstanding voting shares.\n(a) A corporation may not make a contribution or offer or agree to make a contribution directly or indirectly, of any money, property, free service of its officers, employees, or members, or thing of monetary value to a political party, organization, committee, or individual to promote or defeat the candidacy of an individual for nomination, election, or appointment to a political office.\n(b) A political party, organization, committee, or individual may not accept a contribution or an offer or agreement to make a contribution that a corporation is prohibited from making under paragraph (a).\n(c) For the purpose of this subdivision, \"contribution\" includes an expenditure to promote or defeat the election or nomination of a candidate to a political office that is made with the authorization or expressed or implied consent of, or in cooperation or in concert with, or at the request or suggestion of, a candidate or committee established to support or oppose a candidate but does not include an independent expenditure authorized by subdivision 3.\nA corporation may not make an expenditure or offer or agree to make an expenditure to promote or defeat the candidacy of an individual for nomination, election, or appointment to a political office, unless the expenditure is an independent expenditure. For the purpose of this subdivision, \"independent expenditure\" has the meaning given in section 10A.01, subdivision 18.\nA corporation may make contributions or expenditures to promote or defeat a ballot question, to qualify a question for placement on the ballot unless otherwise prohibited by law, or to express its views on issues of public concern. A corporation may not make a contribution to a candidate for nomination, election, or appointment to a political office or to a committee organized wholly or partly to promote or defeat a candidate.\n(a) Notwithstanding subdivisions 3 and 4, a foreign-influenced corporation must not:\n(1) make an expenditure, or offer or agree to make an expenditure, to promote or defeat the candidacy of an individual for nomination, election, or appointment to a public office;\n(2) make contributions or expenditures to promote or defeat a ballot question, or to qualify a question for placement on the ballot;\n(3) make a contribution to a candidate for nomination, election, or appointment to a public office or to a candidate's principal campaign committee; or\n(4) make a contribution to a political committee, political fund, or political party unit.\n(b) A foreign-influenced corporation must not make a contribution or donation to any other person or entity with the express or implied condition that the contribution or donation or any part of it be used for any of the purposes prohibited by this subdivision. This section does not prohibit donations to any association for its general purposes such that the funds qualify as general treasury money pursuant to section 10A.01, subdivision 17c, nor does it impose any additional limitations on the use of such funds.\nA corporation as defined in subdivision 1, paragraph (c), clause (1) or (3), that makes a contribution or expenditure authorized by subdivision 3 or 4 must submit a certification to the Campaign Finance and Public Disclosure Board that it was not a foreign-influenced corporation as of the date the contribution or expenditure was made. The certification must be submitted within seven business days after the contribution or expenditure is made and must be signed by the corporation's chief executive officer after reasonable inquiry, under penalty of perjury. If the activity requiring certification was a contribution to an independent expenditure committee, the corporation must additionally provide a copy of the certification to that committee. For purposes of this certification, the corporation shall ascertain beneficial ownership in a manner consistent with chapter 302A or, if it is registered on a national securities exchange, as set forth in Code of Federal Regulations, title 17, sections 240.13d-3 and 240.13d-5. The corporation shall provide a copy of the statement of certification to any candidate or committee to which it contributes, and upon request of the recipient, to any other person to which it contributes.\nThis section does not prohibit publication or broadcasting of news items or editorial comments by the news media.\n(a) An officer, manager, stockholder, member, agent, employee, attorney, or other representative of a corporation acting on behalf of the corporation who violates this section is subject to a civil penalty of up to ten times the amount of the violation, but in no case more than $10,000, imposed by the Campaign Finance and Public Disclosure Board under chapter 10A or imposed by the Office of Administrative Hearings under this chapter.\n(b) Knowingly violating this section is a crime. An officer, manager, stockholder, member, agent, employee, attorney, or other representative of a corporation acting in behalf of the corporation who is convicted of knowingly violating this section may be fined not more than $20,000 or be imprisoned for not more than five years, or both.\n(a) A corporation that violates this section is subject to a civil penalty of up to ten times the amount of the violation, but in no case more than $10,000, imposed by the Campaign Finance and Public Disclosure Board under chapter 10A or imposed by the Office of Administrative Hearings under this chapter.\n(b) Knowingly violating this section is a crime. A corporation convicted of knowingly violating this section is subject to a fine not greater than $40,000. A convicted domestic corporation may be dissolved as well as fined. If a foreign or nonresident corporation is convicted, in addition to being fined, its right to do business in this state may be declared forfeited.\nNo penalty may be imposed for a violation of this section that is subject to a civil penalty under section 10A.121.\nAn individual or a corporation knowingly violates this section if, at the time of a transaction, the individual or the corporation knew:\n(1) that the transaction causing the violation constituted a contribution under chapter 10A, 211A, or 383B; and\n(2) that the contributor was a corporation subject to the prohibitions of subdivision 2 or 4a.\nIt is not a violation of this section for a political party, as defined in section 200.02, subdivision 6, to form a nonprofit corporation for the sole purpose of holding real property to be used exclusively as the party's headquarters.\nIt is not a violation of this section for a corporation to contribute to or conduct public media projects to encourage individuals to attend precinct caucuses, register, or vote if the projects are not controlled by or operated for the advantage of a candidate, political party, or committee.\nIt is not a violation of this section for a corporation to provide meeting facilities to a committee, political party, or candidate on a nondiscriminatory and nonpreferential basis.\nIt is not a violation of this section for a corporation selling products or services to the public to post on its public premises messages that promote participation in precinct caucuses, voter registration, or elections if the messages are not controlled by or operated for the advantage of a candidate, political party, or committee.\n[Repealed, 2010 c 397 s 20]\nAn individual who aids, abets, or advises a violation of this section is guilty of a gross misdemeanor.\nViolations of this section may be prosecuted in the county where the payment or contribution was made, where services were rendered, or where money was paid or distributed.\nThe prohibitions in this section do not apply to a nonprofit corporation that:\n(1) is not organized or operating for the principal purpose of conducting a business;\n(2) has no shareholders or other persons affiliated so as to have a claim on its assets or earnings; and\n(3) was not established by a business corporation or a labor union and has a policy not to accept significant contributions from those entities.\nAny solicitation of political contributions by an employee must be in writing, informational and nonpartisan in nature, and not promotional for any particular candidate or group of candidates. The solicitation must consist only of a general request on behalf of an independent political committee (conduit fund) and must state that there is no minimum contribution, that a contribution or lack thereof will in no way impact the employee's employment, that the employee must direct the contribution to candidates of the employee's choice, and that any response by the employee shall remain confidential and shall not be directed to the employee's supervisors or managers. Questions from an employee regarding a solicitation may be answered orally or in writing consistent with the above requirements. Nothing in this subdivision authorizes a corporate donation of an employee's time prohibited under subdivision 2.\nIt is not a violation of this section for a nonprofit corporation to provide administrative assistance to one political committee or political fund that is associated with the nonprofit corporation and registered with the Campaign Finance and Public Disclosure Board under section 10A.14. Such assistance must be limited to accounting, clerical or legal services, bank charges, utilities, office space, and supplies. The records of the political committee or political fund may be kept on the premises of the nonprofit corporation.\nThe administrative assistance provided by the nonprofit corporation to the political committee or political fund is limited annually to the lesser of $5,000 or 7-1/2 percent of the expenditures of the political committee or political fund.",
	"repealed": false
}