{
	"id": "360.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.83",
	"title": "360.83 PERMIT, NECESSITY.",
	"text": "Until a permit therefor has been issued by the commissioner, no person shall erect, or add to the height of any structure at any place in this state which will result in a structure extending more than 500 feet above the highest point of land within a one mile radius from the structure, except when allowed under subdivision 2 or 3.\nIn territory surrounding public airports for which zoning regulations have not been adopted pursuant to sections 360.061 to 360.074, no person may erect, or add to the height of any structure which will result in an obstruction to air navigation as defined by rules of the commissioner of transportation, until a permit therefor has been issued by the commissioner. In accordance with section 360.015, subdivision 4, these rules of the commissioner must be kept in conformity with federal legislation and federal rules and standards. The commissioner may designate the airport reference point for all airports affected by this subdivision.\nIn territory for which zoning regulations have been adopted pursuant to sections 360.061 to 360.074, no permit from the commissioner is required. Regulations effective on or after April 25, 1959, shall control the erection, addition to the height of, or replacement of a structure. No person may erect, add to the height of, or replace any structure except as allowed by those zoning regulations.\nUnder subdivisions 1 and 2, the commissioner may issue a permit for a structure which will be located with respect to natural formations or other objects of a permanent character so that no material increase in the aeronautical hazard results therefrom. The commissioner shall issue permits where a literal application or enforcement of the regulations would result in practical difficulty or unnecessary hardship and the relief granted would not be contrary to the public interest but do substantial justice and be in accordance with the spirit of the rules and sections 360.011 to 360.074.\nNo permit is required for structures existing or authorized by an agency of the federal government prior to April 25, 1959. No change in the rules of the commissioner and no relocation or alteration of an airport imposes a new restriction on any structure existing or authorized by an agency of the federal government at the time of the change, relocation, or alteration.",
	"repealed": false
}