{
	"id": "62A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.41",
	"title": "62A.41 PENALTIES.",
	"text": "Any insurer, general agent, agent, or other person who knowingly or willfully, either directly or indirectly, makes or causes to be made or induces or seeks to induce the making of any false statement or representation of a material fact with respect to compliance of any policy with the standards and requirements set forth in this section; falsely assumes or pretends to be acting, or misrepresents in any way, including a violation of section 62A.37, that the person is acting, under the authority or in association with Medicare, or any federal agency, for the purpose of selling or attempting to sell insurance, or in such pretended character demands, or obtains money, paper, documents, or anything of value; or knowingly sells a health insurance policy to an individual entitled to benefits under part A or part B of Medicare with the knowledge that such policy substantially duplicates health benefits to which such individual is otherwise entitled under a requirement of state or federal law other than under Medicare shall be guilty of a felony and subject to a civil penalty of not more than $5,000 per violation, and the commissioner may revoke or suspend the license of any company, association, society, other insurer, or agent thereof.\nAn insurer or general agent, agent, manager's general agent, or other representative, who knowingly or willfully violates section 62A.40 is guilty of a felony and is subject to a civil penalty of not more than $5,000 per violation.\nAn agent who knowingly or willfully violates section 62A.43, subdivision 1, is guilty of a felony and is subject to a civil penalty of not more than $5,000 per violation.\nNotwithstanding section 60K.32, a person who acts or assumes to act as an insurance producer without a valid license for the purpose of selling or attempting to sell Medicare supplement insurance, and the person who aids or abets the actor, is guilty of a felony and is subject to a civil penalty of not more than $5,000 per violation.",
	"repealed": false
}