{
	"id": "260B.198",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.198",
	"title": "260B.198 DISPOSITIONS; DELINQUENT CHILD.",
	"text": "(a) If the court finds that the child is delinquent, it shall enter an order making any of the following dispositions of the case which are deemed necessary to the rehabilitation of the child:\n(1) counsel the child or the parents, guardian, or custodian;\n(2) place the child under the supervision of a probation officer or other suitable person in the child's own home under conditions prescribed by the court including reasonable rules for the child's conduct and the conduct of the child's parents, guardian, or custodian, designed for the physical, mental, and moral well-being and behavior of the child, or with the consent of the commissioner of corrections, in a group foster care facility which is under the management and supervision of said commissioner;\n(3) if the court determines that the child is a danger to self or others, subject to the supervision of the court, transfer legal custody of the child to one of the following:\n(i) a child-placing agency;\n(ii) the local social services agency;\n(iii) a reputable individual of good moral character. No person may receive custody of two or more unrelated children unless licensed as a residential facility pursuant to sections 245A.01 to 245A.16;\n(iv) a county home school, if the county maintains a home school or enters into an agreement with a county home school; or\n(v) a county probation officer for placement in a group foster home established under the direction of the juvenile court and licensed pursuant to section 241.021;\n(4) transfer legal custody by commitment to the commissioner of corrections;\n(5) if the child is found to have violated a state or local law or ordinance which has resulted in damage to the person or property of another, the court may order the child to make reasonable restitution for such damage;\n(6) require the child to pay a fine of up to $1,000. The court shall order payment of the fine in accordance with a time payment schedule which shall not impose an undue financial hardship on the child;\n(7) if the child is in need of special treatment and care for reasons of physical or mental health, the court may order the child's parent, guardian, or custodian to provide it. If the parent, guardian, or custodian fails to provide this treatment or care, the court may order it provided;\n(8) if the court believes that it is in the best interests of the child and of public safety that the driver's license of the child be canceled until the child's 18th birthday, the court may recommend to the commissioner of public safety the cancellation of the child's license for any period up to the child's 18th birthday, and the commissioner is hereby authorized to cancel such license without a hearing. At any time before the termination of the period of cancellation, the court may, for good cause, recommend to the commissioner of public safety that the child be authorized to apply for a new license, and the commissioner may so authorize;\n(9) if the court believes that it is in the best interest of the child and of public safety that the child is enrolled in school, the court may require the child to remain enrolled in a public school until the child reaches the age of 18 or completes all requirements needed to graduate from high school. Any child enrolled in a public school under this clause is subject to the provisions of the Pupil Fair Dismissal Act in chapter 127;\n(10) if the child is petitioned and found by the court to have committed a controlled substance offense under sections 152.021 to 152.027, the court shall determine whether the child unlawfully possessed or sold the controlled substance while driving a motor vehicle. If so, the court shall notify the commissioner of public safety of its determination and order the commissioner to revoke the child's driver's license for the applicable time period specified in section 152.0271. If the child does not have a driver's license or if the child's driver's license is suspended or revoked at the time of the delinquency finding, the commissioner shall, upon the child's application for driver's license issuance or reinstatement, delay the issuance or reinstatement of the child's driver's license for the applicable time period specified in section 152.0271. Upon receipt of the court's order, the commissioner is authorized to take the licensing action without a hearing;\n(11) if the child is petitioned and found by the court to have committed or attempted to commit an act in violation of section 609.342; 609.343; 609.344; 609.345; 609.3451; 609.746, subdivision 1; 609.79; or 617.23, or another offense arising out of a delinquency petition based on one or more of those sections, the court shall order an independent professional assessment of the child's need for sex offender treatment. An assessor providing an assessment for the court must be experienced in the evaluation and treatment of juvenile sex offenders. If the assessment indicates that the child is in need of and amenable to sex offender treatment, the court shall include in its disposition order a requirement that the child undergo treatment. Notwithstanding section 13.384, 13.85, 144.291 to 144.298, or 260B.171, or chapter 260E, the assessor has access to the following private or confidential data on the child if access is relevant and necessary for the assessment:\n(i) medical data under section 13.384;\n(ii) corrections and detention data under section 13.85;\n(iii) health records under sections 144.291 to 144.298;\n(iv) juvenile court records under section 260B.171; and\n(v) local welfare agency records under chapter 260E.\nData disclosed under this clause may be used only for purposes of the assessment and may not be further disclosed to any other person, except as authorized by law; or\n(12) if the child is found delinquent due to the commission of an offense that would be a felony if committed by an adult, the court shall make a specific finding on the record regarding the juvenile's mental health and chemical dependency treatment needs.\n(b) Any order for a disposition authorized under this section shall contain written findings of fact to support the disposition ordered and shall also set forth in writing the following information:\n(1) why the best interests of the child are served by the disposition ordered; and\n(2) what alternative dispositions were considered by the court and why such dispositions were not appropriate in the instant case. Clause (1) does not apply to a disposition under subdivision 1a.\nIf the court finds that the child is 15 years of age or older, is delinquent due to a violation of section 609.342, 609.343, 609.344, 609.345, 609.3451, subdivision 3, or 609.3453, and does not reside in the same home as the victim, in addition to other dispositions authorized under this section, the court may prohibit the child from residing within 1,000 feet or three city blocks, whichever distance is greater, from the victim for a portion or the entire period that the court has jurisdiction over the child.\nIf the child is petitioned and found delinquent by the court, and the court also finds that the child was in possession of a firearm at the time of the offense, in addition to any other disposition the court shall order that the firearm be immediately seized and shall order that the child be required to serve at least 100 hours of community work service unless the child is placed in a residential treatment program or a juvenile correctional facility. If the child is petitioned and found delinquent by the court, and the court finds that the child was in possession of a dangerous weapon in a school zone, as defined in section 152.01, subdivision 14a, clauses (1) and (3), at the time of the offense, the court also shall order that the child's driver's license be canceled or driving privileges denied until the child's 18th birthday. The court shall send a copy of its order to the commissioner of public safety and, upon receipt of the order, the commissioner is authorized to cancel the child's driver's license or deny the child's driving privileges without a hearing.\nAn adjudicated juvenile may not be placed in a licensed juvenile secure treatment facility unless the placement is approved by the juvenile court. However, the program administrator may determine the juvenile's length of stay in the secure portion of the facility. The administrator shall notify the court of any movement of juveniles from secure portions of facilities. However, the court may, in its discretion, order that the juveniles be moved back to secure portions of the facility.\nBefore a postadjudication placement of a juvenile in a secure treatment facility either inside or outside the state, the court may:\n(1) consider whether the juvenile has been adjudicated for a felony offense against the person or that in addition to the current adjudication, the juvenile has failed to appear in court on one or more occasions or has run away from home on one or more occasions;\n(2) conduct a subjective assessment to determine whether the child is a danger to self or others or would abscond from a nonsecure facility or if the child's health or welfare would be endangered if not placed in a secure facility;\n(3) conduct a culturally appropriate psychological evaluation which includes a functional assessment of anger and abuse issues; and\n(4) conduct an educational and physical assessment of the juvenile.\nIn determining whether to order secure placement, the court shall consider the necessity of:\n(i) protecting the public;\n(ii) protecting program residents and staff; and\n(iii) preventing juveniles with histories of absconding from leaving treatment programs.\n(a) For each disposition ordered for an out-of-home placement potentially exceeding 30 days, the court shall order the appropriate agency to develop a case plan in consultation with the child's parent or parents, guardian or custodian, and other appropriate parties. At a minimum, the case plan must specify:\n(1) the actions to be taken by the child and, if appropriate, the child's parent, guardian, or custodian to insure the child's safety, future lawful conduct, and compliance with the court's disposition order; and\n(2) the services to be offered and provided by the agency to the child and, if appropriate, the child's parent, guardian, or custodian.\n(b) The court shall review the case plan and, upon approving it, incorporate it into its disposition order. The court may review and modify the terms of the case plan as appropriate. A party has a right to request a court review of the reasonableness of the case plan upon a showing of a substantial change of circumstances.\n(a) The court may expunge all records relating to delinquency at any time if the court determines that expungement of the record would yield a benefit to the subject of the record that outweighs the detriment to the public and public safety in sealing the record and the burden on the court and public agencies or jurisdictions in issuing, enforcing, and monitoring the order.\n(b) In making a determination under this subdivision, the court shall consider:\n(1) the age, education, experience, and background, including mental and emotional development, of the subject of the record at the time of commission of the offense;\n(2) the circumstances and nature and severity of the offense, including any aggravating or mitigating factors in the commission of the offense;\n(3) victim and community impact, including age and vulnerability of the victim;\n(4) the level of participation of the subject of the record in the planning and carrying out of the offense, including familial or peer influence in the commission of the offense;\n(5) the juvenile delinquency and criminal history of the subject of the record;\n(6) the programming history of the subject of the record, including child welfare, school and community-based, and probation interventions, and the subject's willingness to participate meaningfully in programming, probation, or both;\n(7) any other aggravating or mitigating circumstance bearing on the culpability or potential for rehabilitation of the subject of the record; and\n(8) the benefit that expungement would yield to the subject of the record in pursuing education, employment, housing, or other necessities.\n(c) A record expunged under this subdivision prior to January 1, 2015, may not be opened or exchanged. A record expunged under this subdivision on or after January 1, 2015, is sealed and access only allowed pursuant to paragraph (d).\n(d) Notwithstanding paragraph (a), a record that is expunged under this subdivision on or after January 1, 2015, may be opened, used, or exchanged between criminal justice agencies in the same manner as a criminal record under section 609A.03, subdivision 7a, paragraph (b).\n(e) Section 609A.03, subdivision 3, paragraph (d), applies to the disclosure of private or confidential data in a proceeding under this subdivision. Section 609A.03, subdivision 9, applies to an appeal of an order under this subdivision.\n(a) When it is in the best interests of the child to do so and not inimical to public safety and when the child has admitted the allegations contained in the petition before the judge or referee, or when a hearing has been held as provided for in section 260B.163 and the allegations contained in the petition have been duly proven but, in either case, before a finding of delinquency has been entered, the court may continue the case for a period not to exceed 180 days on any one order. Except as otherwise provided in paragraph (c), the continuance may be extended for one additional successive period not to exceed 180 days, but only with the consent of the prosecutor and only after the court has reviewed the case and entered its order for the additional continuance without a finding of delinquency. During a continuance the court may enter an order in accordance with the provisions of subdivision 1, except clause (4), or enter an order to hold the child in detention for a period not to exceed 15 days on any one order for the purpose of completing any consideration, or any investigation or examination ordered in accordance with the provisions of section 260B.157.\n(b) A prosecutor may appeal a continuance ordered in contravention of this subdivision. This subdivision does not extend the court's jurisdiction under section 260B.193 and does not apply to an extended jurisdiction juvenile proceeding.\n(c) A continuance granted under paragraph (a) for a violation of section 609.342; 609.343; 609.344; 609.345; 609.3451; 609.746, subdivision 1; 609.79; or 617.23 or another offense arising out of a delinquency petition based on one or more of those sections that would require the child to register as a predatory offender under section 243.166 may be extended for additional successive periods not to exceed a total of 24 months so the offender can receive sex offender treatment, but only with the consent of the prosecutor and only after the court has reviewed the case and entered its order for the additional continuance without a finding of delinquency.\nIf the court orders payment of restitution and the child fails to pay the restitution in accordance with the payment schedule or structure established by the court or the probation officer, the child's probation officer may, on the officer's own motion or at the request of the victim, file a petition for violation of probation or ask the court to hold a hearing to determine whether the conditions of probation should be changed. The child's probation officer shall ask for the hearing if the restitution order has not been paid prior to 60 days before the term of probation expires. The court shall schedule and hold this hearing before the child's term of probation expires.\nAll orders for supervision under subdivision 1, clause (2), shall be for an indeterminate period, unless otherwise specified by the court, and shall be reviewed by the court at least annually. All orders under subdivision 1, clause (3), shall be for a specified length of time set by the court. However, before an order has expired and upon the court's own motion or that of any interested party, the court has continuing jurisdiction to renew the order or, after notice to the parties and a hearing, make some other disposition of the case, until the individual becomes 19 years of age. Any person to whom legal custody is transferred shall report to the court in writing at such periods as the court may direct.\nWhen the court transfers legal custody of a child to any licensed child-placing agency, county home school, local social services agency, or the commissioner of corrections, it shall transmit with the order transferring legal custody a copy of its findings and a summary of its information concerning the child.\n(a) A court may not place a preadjudicated delinquent, an adjudicated delinquent, or a convicted extended jurisdiction juvenile in a residential or detention facility outside Minnesota unless the commissioner of corrections has certified that the facility:\n(1) meets or exceeds the standards for Minnesota residential treatment programs set forth in rules adopted by the commissioner of human services or the standards for juvenile residential facilities set forth in rules adopted by the commissioner of corrections or the standards for juvenile detention facilities set forth in rules adopted by the commissioner of corrections, as provided under paragraph (b); and\n(2) provides education, health, dental, and other necessary care equivalent to that which the child would receive if placed in a Minnesota facility licensed by the commissioner of corrections or commissioner of human services.\n(b) The interagency licensing agreement between the commissioners of corrections and human services shall be used to determine which rule shall be used for certification purposes under this subdivision.\n(c) The commissioner of corrections may charge each facility evaluated a reasonable amount. Money received is annually appropriated to the commissioner of corrections to defray the costs of the certification program.\nA person who has reached the age of 20 may not be kept in a residential facility licensed by the commissioner of corrections together with persons under the age of 20. The commissioner may adopt criteria for allowing exceptions to this prohibition.\n(a) If a court orders a juvenile adjudicated delinquent to serve any portion of the juvenile's disposition on electronic surveillance, the court may require that the juvenile be kept in custody, or that the juvenile's probation agent directly supervise the juvenile until electronic surveillance is activated.\n(b) It is the responsibility of the parent or guardian of the juvenile placed on electronic surveillance to ensure that the juvenile's residence is properly equipped and the residence's telecommunications system is properly configured to support electronic surveillance prior to the juvenile being released from custody or the direct supervision of a probation agent.",
	"repealed": false
}