{
	"id": "245.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.97",
	"title": "245.97 OMBUDSMAN COMMITTEE.",
	"text": "The Ombudsman Committee consists of 15 members appointed by the governor to three-year terms. Members shall be appointed on the basis of their knowledge of and interest in the health and human services system subject to the ombudsman's authority. In making the appointments, the governor shall try to ensure that the overall membership of the committee adequately reflects the agencies, facilities, and programs within the ombudsman's authority and that members include consumer representatives, including clients, former clients, and relatives of present or former clients; representatives of advocacy organizations for clients and other individuals served by an agency, facility, or program; human services and health care professionals, including specialists in psychiatry, psychology, internal medicine, and forensic pathology; and other providers of services or treatment to clients.\nMembers do not receive compensation, but are entitled to receive reimbursement for reasonable and necessary expenses incurred. The governor shall designate one member of the committee to serve as its chair at the pleasure of the governor.\nThe committee shall meet at least four times a year at the request of its chair or the ombudsman.\nThe committee shall advise and assist the ombudsman in selecting matters for attention; developing policies, plans, and programs to carry out the ombudsman's functions and powers; and making reports and recommendations for changes designed to improve standards of competence, efficiency, justice, and protection of rights. The committee shall function as an advisory body.\nAt least five members of the committee, including at least three physicians, one of whom is a psychiatrist, must be designated by the governor to serve as a Medical Review Subcommittee. Terms of service, vacancies, and compensation are governed by subdivision 2. The governor shall designate one of the members to serve as chair of the subcommittee. The Medical Review Subcommittee may have access to private and confidential data collected or created by the ombudsman that are necessary to fulfill the duties of the Medical Review Subcommittee under this section and may:\n(1) make a preliminary determination of whether the death of a client that has been brought to its attention is unusual or reasonably appears to have resulted from causes other than natural causes and warrants investigation;\n(2) review the causes of and circumstances surrounding the death;\n(3) request the county coroner or medical examiner to conduct an autopsy;\n(4) assist an agency in its investigations of unusual deaths and deaths from causes other than natural causes;\n(5) make a preliminary determination of whether the death of a participant in a clinical drug trial conducted by the University of Minnesota Department of Psychiatry appears to have resulted from causes other than natural causes and warrants investigation and reporting as required by federal laws on the protection of human subjects; and\n(6) submit a report regarding the death of a client to the committee, the ombudsman, the client's next-of-kin, and the facility where the death occurred and, where appropriate, make recommendations to prevent recurrence of similar deaths to the head of each affected agency or facility, or the Board of Regents of the University of Minnesota.\nThe membership terms, compensation, and removal of members of the committee and the filling of membership vacancies are governed by section 15.0597.\n[Repealed, 2014 c 286 art 8 s 40]",
	"repealed": false
}