{
	"id": "97A.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.015",
	"title": "97A.015 DEFINITIONS.",
	"text": "The terms defined in this section apply to this chapter and chapters 97B and 97C.\n\"Angling\" means taking fish with a hook and line. An \"angler\" is a person who takes fish by angling.\n\"Big game\" means deer, moose, elk, bear, antelope, and caribou.\n\"Bonus permit\" means a license to take deer by archery or firearms, in addition to deer authorized to be taken under regular firearms or archery licenses, or a license issued under section 97A.441, subdivision 7.\n[See Note.]\n\"Bow fishing\" means taking native rough fish and common carp by archery where the arrows are tethered or controlled by an attached line.\n\"Buy\" includes barter, exchange for consideration, offer to buy, or attempt to buy.\n\"Camp\" means the temporary abode of a person fishing, hunting, trapping, vacationing, or touring, while on a trip or tour including resorts, tourist camps, and other establishments providing temporary lodging.\n\"Certifiable diseases\" has the meaning given it in section 17.4982.\n\"Chub\" means shortnose cisco, shortjaw cisco, longjaw cisco, bloater, kiyi, blackfin cisco, and deepwater cisco.\n\"Cisco\" means Coregonus artedii and includes lake herring and tullibee.\n\"Closed season\" means the period when a specified protected wild animal may not be taken.\n\"Commercial fishing\" means taking fish, except minnows, for sale.\n\"Commissioner\" means the commissioner of natural resources.\n\"Condemnation\" means the exercise of the power of eminent domain in the manner provided under chapter 117.\n\"Contraband\" means:\n(1) a wild animal taken, bought, sold, transported, or possessed in violation of the game and fish laws, and all instrumentalities and devices used in taking wild animals in violation of the game and fish laws that are subject to confiscation; and\n(2) wild rice and other aquatic vegetation harvested, bought, sold, transported, or possessed in violation of chapter 84.\n\"Conviction\" means:\n(1) a final conviction after a trial or a plea of guilty;\n(2) a forfeiture of cash or collateral deposited to guarantee an appearance of a defendant in court, if the forfeiture has not been vacated or the court has not reinstated the trial within 15 days after the forfeiture; or\n(3) a breach of a condition of release without bail.\n\"Dark house\" means a structure set on the ice of state waters that is darkened to view fish in the water beneath the structure.\n\"Deer\" means white-tailed or mule deer.\n\"Designated trout lake\" or \"designated trout stream\" means a lake or stream designated by the commissioner as a trout lake or a trout stream under section 97C.005.\n\"Director\" means the director of any or all of the Divisions of Enforcement, Fisheries, Wildlife, and Ecological Services unless a specific division is identified.\n\"Division\" means any or all of the Divisions of Enforcement, Fisheries, Wildlife, and Ecological Services unless a specific division is identified.\n\"Enforcement officer\" means the commissioner, the director of the Enforcement Division, or a conservation officer.\n\"Firearm\" means a gun that discharges shot or a projectile by means of an explosive, a gas, or compressed air.\n\"Firearms safety certificate\" means the certificate issued under section 97B.015 or an equivalent certificate issued by another state or other evidence that meets with the requirements of section 97B.020.\n\"Fish house\" means a structure set on the ice of state waters to provide shelter while taking fish by angling.\n\"Fur-bearing animals\" means mammals that are protected wild animals, except big game.\n\"Game\" means big game and small game.\n\"Game birds\" means migratory waterfowl, ring-necked pheasant, ruffed grouse, sharp-tailed grouse, Canada spruce grouse, prairie chickens, gray partridge, bobwhite quail, wild turkeys, coots, gallinules, sora and Virginia rails, mourning dove, sandhill crane, American woodcock, and common snipe.\n\"Game fish\" means fish from the following families and species: Acipenseridae (lake sturgeon and shovelnose sturgeon), Anguillidae (American eel), Centrarchidae (black crappie; largemouth bass; rock bass; smallmouth bass; white crappie; and sunfishes, including bluegill, green sunfish, longear sunfish, orangespotted sunfish, pumpkinseed, and warmouth), Esocidae (muskellunge and northern pike), Gadidae (burbot), Ictaluridae (blue catfish, channel catfish, and flathead catfish), Moronidae (white bass and yellow bass), Percidae (sauger, walleye, and yellow perch), Polyodontidae (paddlefish), and Salmonidae (Atlantic salmon, brook trout, brown trout, chinook salmon, cisco (tullibee), coho salmon, kokanee salmon, lake trout, lake whitefish, pink salmon, and rainbow trout). Game fish includes hybrids of game fish.\n\"Guardian\" means a legal guardian of a person under age 16, or a person 18 or older who has been authorized by the parent or legal guardian to supervise the person under age 16.\n\"Hunting\" means taking birds or mammals.\n\"In-the-round\" means fish with heads, tails, fins, skins, and scales intact.\n[Repealed, 1Sp2011 c 2 art 5 s 70]\n\"Immediately released\" or \"immediately returned to the water\" means that a fish must not be retained longer than is needed at the site of capture to unhook, identify, measure, or photograph the fish. Placing a fish on a stringer, in a live well, or in a cooler, bucket, or other container is not \"immediately released\" or \"immediately returned to the water.\"\n\"License\" means a license or stamp issued under the game and fish laws.\n\"License identification number\" means a verification number issued under the authority of the commissioner in conjunction with the electronic purchase of a license or stamp and valid until the license is received by the purchaser.\n[See Note.]\n[Repealed, 1Sp2011 c 2 art 5 s 70]\n[Repealed, 1Sp2011 c 2 art 5 s 70]\n\"Migratory waterfowl\" means brant, ducks, geese, tundra swans, trumpeter swans, and whooper swans.\n\"Minnows\" means:\n(1) members of the minnow family, Cyprinidae, except carp and goldfish;\n(2) members of the mudminnow family, Umbridae;\n(3) members of the sucker family, Catostomidae, not over 12 inches in length;\n(4) bullheads, ciscoes, lake whitefish, goldeyes, and mooneyes, not over seven inches long;\n(5) leeches; and\n(6) tadpole madtoms (willow cats) and stonecats.\n\"Minnow dealer\" means a person taking minnows for sale, buying minnows for resale, selling minnows at wholesale, or transporting minnows for sale.\n\"Minnow retailer\" means a person selling minnows at retail from an established place of business.\n\"Motor vehicle\" means a self-propelled vehicle or a vehicle propelled or drawn by a self-propelled vehicle that is operated on a highway, on a railroad track, on the ground, in the water, or in the air.\n\"Muzzleloader season\" means the deer season open only for legal muzzle-loading firearms, as prescribed by the commissioner.\n[Renumbered subd 32d]\n\"Native rough fish\" means Amiidae (bowfin), Catostomidae (bigmouth, smallmouth, and black buffalo; white, blue, spotted, and longnose sucker; northern hogsucker; quillback; river and highfin carpsucker; and black, river, shorthead, golden, silver, and greater redhorse), Hiodontidae (goldeye and mooneye), Ictaluridae (black, brown, and yellow bullhead), Lepisosteidae (longnose and shortnose gar), and Sciaenidae (freshwater drum), except for any fish species listed as endangered, threatened, or of special concern in Minnesota Rules, chapter 6134.\n\"Native swan\" means a trumpeter swan or a tundra swan but does not include a mute swan.\n\"Nonresident\" means a person who is not a resident.\n\"Open season\" means the period when a specified protected wild animal may be taken.\n\"Person\" means an individual only if used in reference to issuing licenses to take wild animals, but otherwise means an individual, firm, partnership, joint stock company, association, or public or private corporation.\n\"Portable shelter\" means a fish house, dark house, or other shelter that is set on the ice of state waters to provide shelter and that collapses, folds, or is disassembled for transportation.\n\"Possession\" means both actual and constructive possession and control of the things referred to.\n\"Predator\" means a wolf, coyote, fox, lynx, or bobcat.\n\"Processing\" means rendering a species of aquatic life for food, bait, or other purposes so that it is no longer alive.\n\"Protected birds\" means all birds except unprotected birds.\n\"Protected wild animals\" means big game, small game, game fish, native rough fish, minnows, leeches, chubs, frogs, turtles, clams, mussels, wolf, mourning doves, bats, snakes, salamanders, lizards, any animal species listed as endangered, threatened, or of special concern in Minnesota Rules, chapter 6134, and wild animals that are protected by a restriction in the time or manner of taking, other than a restriction in the use of artificial lights, poison, or motor vehicles.\n\"Public access\" means an access that is publicly owned and accessible to the public without charge.\n\"Public waters\" means waters defined in section 103G.005, subdivision 15.\n\"Regular firearms season\" means any of the firearms deer seasons prescribed by the commissioner that begin in November, exclusive of the muzzleloader season.\n\"Resident\" means:\n(1) an individual who is a citizen of the United States or a resident alien, and has maintained a legal residence in the state at least the immediately preceding 60 days;\n(2) a nonresident under the age of 21 who is the child of a resident;\n(3) a domestic corporation; or\n(4) a foreign corporation authorized to do business in the state that has conducted a licensed business at a location within the state for at least ten years.\n\"Restitution value of the wild animals\" means the total value of the wild animals taken in a violation based on:\n(1) the values established under section 97A.345; or\n(2) the values determined by the court under section 97A.341, subdivision 4, if the values are not established under section 97A.345.\n[Renumbered subd 32c]\n\"Sale\" means an exchange for consideration, and includes barter, offer to sell, and possession with intent to sell.\n\"Shelter\" means any structure, other than a self-propelled motor vehicle, that is set on the ice of state waters to provide shelter.\n\"Small game\" means game birds, gray squirrel, fox squirrel, cottontail rabbit, snowshoe hare, jack rabbit, raccoon, lynx, bobcat, short-tailed weasel, long-tailed weasel, wolf, red fox and gray fox, fisher, pine marten, opossum, badger, cougar, wolverine, muskrat, mink, otter, and beaver.\n\"Sunfish\" means bluegill, pumpkinseed, green sunfish, orange spotted sunfish, longear sunfish, and warmouth. \"Sunfish\" includes hybrids of sunfish.\n\"Taking\" means pursuing, shooting, killing, capturing, trapping, snaring, angling, spearing, or netting wild animals, or placing, setting, drawing, or using a net, trap, or other device to take wild animals. Taking includes attempting to take wild animals, and assisting another person in taking wild animals.\n\"Taxidermist\" means a person who engages in the business or operation of preserving or mounting wild animals or parts thereof that do not belong to the person.\n\"Transport, transportation\" means causing or attempting to cause wild animals to be carried or moved by a device and includes accepting or receiving wild animals for transportation or shipment.\n\"Undressed bird\" means:\n(1) a bird, including ducks, with a fully feathered wing intact; or\n(2) a pheasant, Hungarian partridge, or wild turkey with one leg and foot intact.\n\"Undressed fish\" means fish with heads, tails, fins and skins intact, whether entrails, gills, or scales are removed or not.\n\"Unloaded\" means, with reference to a firearm, without ammunition in the barrels and magazine, if the magazine is in the firearm. A muzzle-loading firearm is unloaded if:\n(1) for a flintlock ignition, it does not have priming powder in a pan;\n(2) for a percussion ignition, it does not have a percussion cap on a nipple;\n(3) for an electronic ignition system, the battery is removed and is disconnected from the firearm; and\n(4) for an encapsulated powder charge ignition system, the primer and powder charge are removed from the firearm.\n\"Unprotected birds\" means English sparrow, starling, cormorant, common pigeon, Eurasian collared dove, chukar partridge, quail other than bobwhite quail, and mute swan.\n\"Unprotected wild animals\" means wild animals that are not protected wild animals including coyote, plains pocket gopher, porcupine, striped skunk, and unprotected birds, except any animal species listed as endangered, threatened, or of special concern in Minnesota Rules, chapter 6134.\n\"Validation\" means the documentation process for taking a specific species under a license for that species, which can be completed electronically or on the corresponding paper license, permit, or endorsement to include information specified by the commissioner.\n[See Note.]\n\"Waters of this state\" and \"state waters\" include all boundary and inland waters.\n\"Wild animals\" means all creatures, whether dead or alive, not human, wild by nature, endowed with sensation and power of voluntary motion, and includes mammals, birds, fish, amphibians, reptiles, crustaceans, and mollusks.",
	"repealed": false
}