{
	"id": "10A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.07",
	"title": "10A.07 CONFLICTS OF INTEREST.",
	"text": "(a) A public official or a local official elected to or appointed by a metropolitan governmental unit who in the discharge of official duties would be required to take an action or make a decision that would substantially affect the official's financial interests or those of an associated business, unless the effect on the official is no greater than on other members of the official's business classification, profession, or occupation, must take the following actions:\n(1) prepare a written statement describing the matter requiring action or decision and the nature of the potential conflict of interest;\n(2) deliver copies of the statement to the official's immediate superior, if any; and\n(3) if a member of the legislature or of the governing body of a metropolitan governmental unit, deliver a copy of the statement to the presiding officer of the body of service.\nIf a potential conflict of interest presents itself and there is insufficient time to comply with clauses (1) to (3), the public or local official must orally inform the superior or the official body of service or committee of the body of the potential conflict.\n(b) For purposes of this section, \"financial interest\" means any ownership or control in an asset that has the potential to produce a monetary return.\n(a) If the official is not a member of the legislature or of the governing body of a metropolitan governmental unit, the superior must assign the matter, if possible, to another employee who does not have a potential conflict of interest.\n(b) If there is no immediate superior, the official must abstain, if possible, by assigning the matter to a subordinate for disposition or requesting the appointing authority to designate another to determine the matter. The official shall not chair a meeting, participate in any vote, or offer any motion or discussion on the matter giving rise to the potential conflict of interest.\n(c) If the official is a member of the legislature, the house of service may, at the member's request, excuse the member from taking part in the action or decision in question.\n(d) If an official is not permitted or is otherwise unable to abstain from action in connection with the matter, the official must file a statement describing the potential conflict and the action taken. A public official must file the statement with the board and a local official must file the statement with the governing body of the official's political subdivision. The statement must be filed within a week of the action taken.\nThis section does not apply to a local official with respect to a matter governed by sections 471.87 and 471.88.\nNotwithstanding subdivisions 1 and 2, a public official who is a district court judge, an appeals court judge, or a supreme court justice is not required to comply with the provisions of this section.",
	"repealed": false
}