{
	"id": "60A.0812",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.0812",
	"title": "60A.0812 PROPERTY AND CASUALTY POLICY EXCLUSIONS.",
	"text": "This section may be cited as the \"Family Protection Act.\"\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Boat\" means a motorized or nonmotorized vessel that floats and is used for personal, noncommercial use on waters in Minnesota.\n(c) \"Boat insurance policy\" means an insurance policy that provides liability coverage for bodily injury resulting from the ownership, maintenance, or use of a boat, although the policy may also provide for property insurance coverage for the boat for noncommercial use.\n(d) \"Insured\" means an insured under a policy specified in subdivision 3, clauses (1) to (4), including the named insured and the following persons not identified by name as an insured while residing in the same household with the named insured:\n(1) a spouse of a named insured;\n(2) a relative of a named insured; or\n(3) a minor in the custody of a named insured, spouse of a named insured, or of a relative residing in the same household with a named insured.\nFor purposes of this section, a person resides in or is a member of the same household with the named insured if the person's home is usually in the same family unit, even if the person is temporarily living elsewhere.\n(e) \"Permitted exclusion\" means an exclusion of or limitation on liability for damages for bodily injury resulting from fraud, intentional conduct, criminal conduct that intentionally causes an injury, and other exclusions permitted by law, including a permitted exclusion contained in a boat insurance policy issued in this state pursuant to subdivision 6.\n(f) \"Prohibited exclusion\" means an exclusion of or limitation on liability for damages for bodily injury because the injured person is:\n(1) an insured other than a named insured;\n(2) a resident or member of the insured's household; or\n(3) related to the insured by blood or marriage.\nA prohibited exclusion contained in a plan or policy identified in clauses (1) to (4) is against public policy and is void. The following insurance coverage issued in this state must not contain a prohibited exclusion, unless expressly provided otherwise under this section:\n(1) a plan of reparation security, as defined under section 65B.43;\n(2) a boat insurance policy;\n(3) a personal excess liability policy; and\n(4) a personal umbrella policy.\nAn insurance policy listed in this section may contain a permitted exclusion for bodily injury to an insured.\nAn excess or umbrella policy may contain a requirement that coverage for family or household members under an excess or umbrella policy governed by this section is available only to the extent coverage is first available from an underlying policy that provides coverage for damages for bodily injury.\n(a) An insurer issuing bodily injury liability coverage for a boat insurance policy under this section must notify a person at the time of sale of the person's rights under this section to decline coverage for insureds and be provided an updated quote reflecting the appropriate premium for the coverage provided.\n(b) Named insureds must affirmatively make an election to decline coverage, in a form approved by the commissioner, after being informed that an updated quote will be provided. The election must be signed and dated, and is binding on all persons insured under the policy and to any renewal of the policy.\n(c) An insurer offering an election of coverage under this subdivision must have the disclosure approved by the commissioner. The notice must be in 14-point bold type, in a conspicuous location of the notice document, and contain at least the following:\nELECTION TO DECLINE COVERAGE: YOU HAVE THE RIGHT TO DECLINE BODILY INJURY COVERAGE FOR INJURIES TO YOUR FAMILY AND HOUSEHOLD MEMBERS FOR WHICH YOU WOULD OTHERWISE BE ENTITLED TO UNDER MINNESOTA LAW. IF YOU ELECT TO DECLINE THIS COVERAGE, YOU WILL RECEIVE AN UPDATED PREMIUM QUOTE BASED ON THE COVERAGE YOU ARE ELECTING TO PURCHASE. READ YOUR POLICY CAREFULLY TO DETERMINE WHICH FAMILY AND HOUSEHOLD MEMBERS WOULD NOT BE COVERED FOR BODILY INJURY IF YOU ELECT TO DECLINE COVERAGE.\nAn endorsement, rider, or contract amendment is not required for this section to be effective.",
	"repealed": false
}