{
	"id": "260.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.66",
	"title": "260.66 EMERGENCY REMOVAL.",
	"text": "Nothing in this section shall be construed to prevent the emergency removal of an African American or a disproportionately represented child's parent or custodian or the emergency placement of the child in a foster setting in order to prevent imminent physical damage or harm to the child.\nA petition for a court order authorizing the emergency removal or continued emergency placement of an African American or a disproportionately represented child or the petition's accompanying documents must contain a statement of the risk of imminent physical damage or harm to the African American or disproportionately represented child and any evidence that the emergency removal or placement continues to be necessary to prevent imminent physical damage or harm to the child. The petition or its accompanying documents must also contain the following information:\n(1) the name, age, and last known address of the child;\n(2) the name and address of the child's parents and custodians or, if unknown, a detailed explanation of efforts made to locate and contact them;\n(3) the steps taken to provide notice to the child's parents and custodians about the emergency proceeding;\n(4) a specific and detailed account of the circumstances that led the agency responsible for the emergency removal of the child to take that action; and\n(5) a statement of the efforts that have been taken to assist the child's parents or custodians so that the child may safely be returned to their custody.\n(a) The court shall hold a hearing no later than 72 hours, excluding weekends and holidays, after the emergency removal of the African American or disproportionately represented child. The court shall determine whether the emergency removal continues to be necessary to prevent imminent physical damage or harm to the child and whether, after considering the child's particular circumstances, the imminent physical damage or harm to the child outweighs the harm that the child will experience as a result of continuing the emergency removal.\n(b) The court shall hold additional hearings whenever new information indicates that the emergency situation has ended. The court shall consider all such new information at any court hearing after the emergency proceeding to determine whether the emergency removal or placement is no longer necessary to prevent imminent physical damage or harm to the child.\n(c) Notwithstanding section 260C.163, subdivision 3, and the provisions of Minnesota Rules of Juvenile Protection Procedure, rule 25, a parent or custodian of an African American or a disproportionately represented child who is subject to an emergency hearing under this section and Minnesota Rules of Juvenile Protection Procedure, rule 30, has a right to counsel appointed by the court. The court must appoint qualified counsel to represent a parent if the parent meets the eligibility requirements in section 611.17.\n(a) An emergency removal or placement of an African American or a disproportionately represented child must immediately terminate once the responsible social services agency or court possesses sufficient evidence to determine that the emergency removal or placement is no longer necessary to prevent imminent physical damage or harm to the child and the child shall be immediately returned to the custody of the child's parent or custodian. The responsible social services agency or court shall ensure that the emergency removal or placement terminates immediately when the removal or placement is no longer necessary to prevent imminent physical damage or harm to the African American or disproportionately represented child.\n(b) An emergency removal or placement ends when the court orders, after service upon the African American or disproportionately represented child's parents or custodians, that the child shall be placed in foster care upon a determination supported by clear and convincing evidence that custody of the child by the child's parent or custodian is likely to result in serious emotional or physical damage to the child.\n(c) In no instance shall emergency removal or emergency placement of an African American or a disproportionately represented child extend beyond 30 days unless the court finds by a showing of clear and convincing evidence that:\n(1) continued emergency removal or placement is necessary to prevent imminent physical damage or harm to the child; and\n(2) it has not been possible to initiate a child placement proceeding with all of the protections under sections 260.61 to 260.68.",
	"repealed": false
}