{
	"id": "383B.217",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.217",
	"title": "383B.217 HMO AND CLINICS.",
	"text": "MS 2006 [Repealed, 2005 c 125 art 2 s 9]\nMS 2006 [Repealed, 2005 c 125 art 2 s 9]\nMS 2006 [Repealed, 2005 c 125 art 2 s 9]\nMS 2006 [Repealed, 2005 c 125 art 2 s 9]\nMS 2006 [Repealed, 2005 c 125 art 2 s 9]\nMS 2006 [Repealed, 2005 c 125 art 2 s 9]\n(a) Contracting and purchasing made on behalf of the HMO, ambulatory health center, or other clinics authorized under section 383B.219, of goods, materials, supplies, equipment, and services that are incidental to or that are included as part of a contract for the purchase of goods, materials, supplies, or equipment are specifically exempted from sections 383B.141 to 383B.151 and 471.345 or other applicable laws related to public procurement. Contracting and purchasing of services shall comply with sections 383B.141 to 383B.151 or other applicable laws related to public procurement.\n(b) Notwithstanding chapter 13D, the county board on behalf of the HMO or Hennepin Healthcare System, Inc., may meet in closed session to discuss and take action on specific products or services that are in direct competition with other providers of goods or services in the public or private sector, if disclosure of information pertaining to those matters would clearly harm the competitive position of the HMO or Hennepin Healthcare System, Inc.\n(c) The HMO or Hennepin Healthcare System, Inc., shall inform the county board when there are matters that are appropriate for discussion or action under paragraph (b). The county administrator or the administrator's designee shall give the board an opinion on the propriety of discussion or action under paragraph (b) for each of the matters. The county board may, by a majority vote in a public meeting, decide to hold a closed meeting under paragraph (b). The purpose, time, and place of the meeting must be announced at a public meeting. A written roll of members present at a closed meeting must be made available to the public after the closed meeting. The proceedings of a closed meeting must be tape recorded at the expense of the county board and be preserved for not less than five years after the meeting. The data on the tape are nonpublic data under section 13.02, subdivision 9, until two years after the meeting. A contract entered into by the county board at a meeting held on behalf of the HMO is subject to section 471.345. All bids and any related materials that are considered at the meeting must be retained for a period of not less than five years. After the expiration of the term of any contract entered into pursuant to this subdivision or a period of two years, whichever is less, the contract, the bids, and any related materials are public data. The contract, the bids, and any related materials are subject to review by the state auditor at any time.\n(d) Data concerning specific products or services that are in direct competition with other providers of goods or services in the public or private sector are trade secret information for purposes of section 13.37, to the extent disclosure of information pertaining to the matters would clearly harm the competitive position of the HMO. The data are trade secret information for the term of the contract or a two-year period, whichever is less.\n(e) Notwithstanding section 471.345 or other applicable law, the county board on behalf of the HMO, ambulatory health center, or other clinics authorized under section 383B.219, may contract, except for services, by any means that the county board or at its direction the HMO, ambulatory health center, or other clinics authorized under section 383B.219, may determine. When contracting for services, the county board must comply with sections 383B.141 to 383B.151 and other applicable law, except that the board may contract with a private or public cooperative purchasing organization if it can be established that the purchasing organization's services that are purchased have been awarded through a competitive or request for proposal process.\n(f) This subdivision applies to the HMO, Hennepin Healthcare System, Inc., ambulatory health centers, or other clinics authorized under section 383B.219, as well as any other organization, association, partnership, or corporation authorized by Hennepin County under section 144.581.\nMS 2006 [Repealed, 2005 c 125 art 2 s 9]",
	"repealed": false
}