{
	"id": "260C.008",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.008",
	"title": "260C.008 FOSTER CARE SIBLING BILL OF RIGHTS.",
	"text": "(a) A child placed in foster care who has a sibling has the right to:\n(1) be placed in foster care homes with the child's siblings, when possible and when it is in the best interest of each sibling, in order to sustain family relationships;\n(2) be placed in close geographical distance to the child's siblings, if placement together is not possible, to facilitate frequent and meaningful contact;\n(3) have frequent contact with the child's siblings in foster care and, whenever possible, with the child's siblings who are not in foster care, unless the responsible social services agency has documented that contact is not in the best interest of any sibling. Contact includes but is not limited to telephone calls, text messaging, social media and other Internet use, and video calls;\n(4) annually receive a telephone number, address, and email address for all siblings in foster care, and receive updated photographs of siblings regularly, by regular mail or email;\n(5) participate in regular face-to-face visits with the child's siblings in foster care and, whenever possible, with the child's siblings who are not in foster care. Participation in these visits shall not be withheld or restricted as a consequence for behavior, and shall only be restricted if the responsible social services agency documents that the visits are contrary to the safety or well-being of any sibling. Social workers, parents, foster care providers, and older children must cooperate to ensure regular visits and must coordinate dates, times, transportation, and other accommodations as necessary. The timing and regularity of visits shall be outlined in each sibling's service plan, based on the individual circumstances and needs of each child. A social worker need not give explicit permission for each visit or possible overnight visit, but foster care providers shall communicate with social workers about these visits;\n(6) be actively involved in each other's lives and share celebrations, if they choose to do so, including but not limited to birthdays, holidays, graduations, school and extracurricular activities, cultural customs in the siblings' native language, and other milestones;\n(7) be promptly informed about changes in sibling placements or circumstances, including but not limited to new placements, discharge from placements, significant life events, and discharge from foster care;\n(8) be included in permanency planning decisions for siblings, if appropriate; and\n(9) be informed of the expectations for and possibility of continued contact with a sibling after an adoption or transfer of permanent physical and legal custody to a relative.\n(b) Adult siblings of children in foster care shall have the right to be considered as foster care providers, adoptive parents, and relative custodians for their siblings, if they choose to do so.\nThe rights under this section are established for the benefit of siblings in foster care. This statement of rights does not replace or diminish other rights, liberties, and responsibilities that may exist relative to children in foster care, adult siblings of children in foster care, foster care providers, parents, relatives, or responsible social services agencies.\nChild welfare agency staff shall provide a copy of these rights to a child who has a sibling at the time the child enters foster care, to any adult siblings of a child entering foster care, if known, and to the foster care provider, in a format specified by the commissioner of children, youth, and families. The copy shall contain the address and telephone number of the Office of Ombudsperson for Families and a brief statement describing how to file a complaint with the office.",
	"repealed": false
}