{
	"id": "400.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/400.16",
	"title": "400.16 SOLID WASTE AND SEWAGE SLUDGE MANAGEMENT REGULATIONS.",
	"text": "The county may by ordinance establish and revise rules, regulations, and standards for solid waste and sewage sludge management and land pollution, relating to (a) the location, sanitary operation, and maintenance of solid waste facilities and sewage sludge disposal facilities by the county and any municipality or other public agency and by private operators; (b) the collection, processing, and disposal of solid waste and sewage sludge; (c) the amount and type of equipment required in relation to the amount and type of material received at any solid waste facility or sewage sludge disposal facility; (d) the control of salvage operations, water or air or land pollution, and rodents at such facilities; (e) the termination or abandonment of the facilities or activities; and (f) other matters relating to the facilities as may be determined necessary for the public health, welfare, and safety. The county may issue permits or licenses for solid waste facilities and may require that the facilities be registered with an appropriate county office. The county shall adopt the ordinances for mixed municipal solid waste management. The county shall make provision for issuing permits or licenses for mixed municipal solid waste facilities and shall require that the facilities be registered with an appropriate county office. No permit or license shall be issued for a mixed municipal solid waste facility unless the applicant has demonstrated to the satisfaction of the county board the availability of revenues necessary to operate the facility in accordance with applicable state and local laws, ordinances, and rules. No permit shall be issued for a solid waste facility used primarily for resource recovery or a transfer station serving such a facility, if the facility or station is owned or operated by a public agency or if the acquisition or betterment of the facility or station is secured by public funds or obligations issued by a public agency, unless the county finds and determines that adequate markets exist for the products recovered and that any displacement of existing resource recovery facilities and transfer stations serving such facilities that may result from the establishment of the new facility is required in order to achieve the waste management objectives of the county. The county ordinance shall require appropriate procedures for termination or abandonment of any mixed municipal solid waste facilities or services, which shall include provision for long-term monitoring for possible land pollution, and for the payment by the owners or operators thereof, or both, of any costs incurred by the county in completing the procedures. The county may require the procedures and payments with respect to any facilities or services regulated pursuant to this section. In the event the operators or owners fail to complete the procedures in accordance with the ordinance, the county may recover the costs of completion in a civil action in any court of competent jurisdiction or, in the discretion of the board, the costs may be certified to the county auditor as a special tax against the land to be collected as other taxes are collected. The ordinance may be enforced by injunction, action to compel performance, other appropriate action in the district court, or administrative penalty order authorized under section 116.072. Any ordinance enacted under this section shall embody minimum standards and requirements established by rule of the agency.",
	"repealed": false
}