{
	"id": "53C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.01",
	"title": "53C.01 MOTOR VEHICLE RETAIL INSTALLMENT SALES; DEFINITIONS.",
	"text": "For the purposes of sections 53C.01 to 53C.14, the terms defined in this section have the meanings given them.\n\"Cash sale price\" means the price at which the seller would in good faith sell to the buyer, and the buyer would in good faith buy from the seller, the motor vehicle which is the subject matter of the retail installment contract, if such sale were a sale for cash, instead of a retail installment sale. The cash sale price may include any taxes, charges for delivery, servicing, repairing, or improving the motor vehicle, including accessories and their installation, and any other charges agreed upon between the parties. The cash price may include a documentary fee or document administration fee authorized under section 168.27, subdivision 31.\n\"Commissioner\" means the commissioner of commerce of the state of Minnesota.\n\"Finance charge\" means any charge payable directly or indirectly by the buyer and imposed directly or indirectly by the seller as a condition of the extension of credit under a retail installment contract, and includes a time price differential. The term does not include the cost of any insurance and other benefits included in the retail installment contract and any other permissible cost or expense incidental to the retail installment sale or any charge of a type payable in a comparable cash transaction, or any taxes, fees, or charges that actually are or will be paid to public officials or government agencies for determining the existence of or for perfecting, releasing, or satisfying a security interest. The term also does not include premiums for insurance against loss of or damage to property, or against liability arising out of the ownership or use of property if the insurance coverage may be obtained from a person of the buyer's choice.\n\"Global positioning system starter interrupt device\" or \"GPS starter interrupt device\" means a device installed on a motor vehicle by a motor vehicle dealer that enables an individual who is not in possession of the motor vehicle to remotely disable the motor vehicle's ignition. GPS starter interrupt device includes a device commonly referred to as a fuel or ignition kill switch.\n\"Motor vehicle\" means any device propelled or drawn by any power other than muscular power, in, upon, or by which any person or property is, or may be transported or drawn upon a highway, excepting building and road construction equipment not subject to motor vehicle registration fees, snowmobiles, three-wheel off-road vehicles, boat, snowmobile, and other utility trailers, farm tractors, and agricultural machinery not designed primarily for highway transportation, but which may incidentally transport persons or property on a public highway, or any other device which may not be lawfully operated upon a highway at the time of sale.\n\"Person\" means an individual, partnership, corporation, association, and other group however organized.\n\"Retail buyer\" or \"buyer\" means a person who buys or agrees to buy a motor vehicle from a retail seller not for the purpose of resale and who executes a retail installment contract in connection therewith.\n\"Retail installment contract\" means any agreement, entered into in this state, evidencing a retail installment sale of a motor vehicle, other than for the purpose of resale, when purchased primarily for personal, family or household use, pursuant to which title to, or a lien upon the motor vehicle is retained by the retail seller as security for the retail buyer's obligation. This term includes a mortgage, conditional sale contract, or any contract for the bailment or leasing of a motor vehicle by which the bailee or lessee contracts to pay as compensation for its use a sum substantially equivalent to the retail installment sale price of the motor vehicle and by which it is agreed that the bailee or lessee is bound to become, or has the option of becoming, the owner of such motor vehicle for no additional consideration or for nominal additional consideration. \"Retail installment contract\" does not include any agreement, entered into in this state, evidencing an installment sale of a motor vehicle purchased primarily for use in business. For purposes of this subdivision, \"business\" means a commercial or industrial enterprise which is carried on for the purpose of active or passive investment or profit.\n\"Retail installment sale\" means any sale evidenced by a retail installment contract wherein retail buyer agrees to buy and retail seller agrees to sell a motor vehicle at a sale price payable in one or more installments with the payment of a finance charge.\n\"Retail seller\" or \"seller\" means a person who sells or agrees to sell a motor vehicle under a retail installment contract to a retail buyer.\nWords in the singular include the plural and vice versa.\n\"Sales finance company\" means a person engaged, in whole or in part, in the business of purchasing retail installment contracts entered into in this state from one or more retail sellers. The term includes a bank, trust company, or industrial loan and thrift company, if so engaged. The term also includes a retail seller engaged, in whole or in part, in the business of creating and holding retail installment contracts. The term does not include the pledges of an aggregate number of the contracts to secure a bona fide loan thereon.\n\"Service contract\" has the meaning given it in section 59B.02, subdivision 11.\n\"Surface protection product\" means the following products:\n(1) undercoating;\n(2) rustproofing;\n(3) chemical or film paint sealant or protectant; or\n(4) chemical sealant or stain inhibitor for carpet and fabric.\n\"Theft deterrent device\" means the following devices:\n(1) a vehicle alarm system;\n(2) a window etch product;\n(3) a body part marking product;\n(4) a steering lock; or\n(5) a pedal or ignition lock.\n\"Total of payments\" means the amount which the buyer contracts to pay under a retail installment contract, excluding any down payment.\n\"Optional electronic transfer fee\" means a charge for services agreed upon between the parties for electronic transmission of ownership records. The charge must be separately stated and identified as \"optional electronic transfer fee\" on the sales agreement maintained under Minnesota Rules, part 7400.5200. At least half of the fee must be paid to an electronic transmission service provider.",
	"repealed": false
}