{
	"id": "514.976",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.976",
	"title": "514.976 DISCLOSURE AND ACTIONS.",
	"text": "There shall be disclosed to the occupant either in the rental agreement or otherwise in writing prior to commencement of the occupancy the name and address of:\n(1) the person authorized to manage the premises; and\n(2) an owner of the premises or an agent authorized by the owner to accept service of process and receive and give receipt for notices and demands.\nEither in the rental agreement or otherwise in writing the occupant shall also be notified that the owner prohibits the storage of hazardous materials.\nA printed or typewritten notice containing the information that must be disclosed under subdivision 1 must be placed in a conspicuous place on the premises.\nIf subdivisions 1 and 2 have not been complied with and an occupant desiring to make service of process upon or give a notice or demand to the owner does not know the name and address of the owner or the owner's agent, as that term is used in subdivision 1, then a caretaker or manager of the premises or an individual to whom rental payments for the premises are made is deemed to be an agent authorized to accept service of process and receive and give receipt for notices and demands on behalf of the owner.\nExcept as otherwise provided in this subdivision, an owner may not maintain an action to recover rent or possession of the premises unless the information required by this section has been disclosed to the occupant, or unless the information is known by or has been disclosed to the occupant at least 30 days prior to the initiation of the action. Failure by the owner to post a notice required by subdivision 2 does not prevent any action to recover rent or possession of the premises. Any action begun by the owner or occupant shall be venued in the county where the facility is located. If an action to recover possession of personal property in the facility is begun by the occupant, the burden of proof shall be borne by the owner that default has occurred and the provisions of sections 514.970 to 514.979 have been followed.\nThis section applies to any successor owner, caretaker, manager, or individual to whom rental payments for the storage space are made.",
	"repealed": false
}