{
	"id": "354D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/354D.08",
	"title": "354D.08 INDIVIDUAL RETIREMENT ACCOUNT PLAN ADMINISTRATION; MINNESOTA HISTORICAL SOCIETY.",
	"text": "The Minnesota Historical Society is the plan administrator and has the administrative responsibility for the individual retirement account plan for those eligible employees listed in section 354D.02, subdivision 2, clause (3).\n(a) The plan administrator shall arrange for the purchase of fixed annuity contracts, variable annuity contracts, a combination of fixed and variable annuity contracts, or custodial accounts from financial institutions which have been selected by the State Board of Investment and approved by the plan administrator under subdivision 3, as the investment vehicle for the retirement coverage of plan participants and to provide retirement benefits to plan participants. Custodial accounts from financial institutions shall include open-end investment companies registered under the Federal Investment Company Act of 1940, as amended.\n(b) The annuity contracts or accounts must be purchased with contributions under section 354D.05, or with money or assets otherwise provided by law by authority of the Minnesota Historical Society and deemed acceptable by the applicable financial institution.\nThe plan administrator may approve up to two financial institutions selected by the State Board of Investment under section 354B.25, subdivision 3, to provide annuity products and custodial accounts for those employees listed in section 354D.02, subdivision 2, clause (3). Only those financial institutions selected by the State Board of Investment and approved by the plan administrator may provide annuity products and custodial accounts for those employees listed in section 354D.02, subdivision 2, clause (3).\nThe State Board of Investment must periodically review at least every three years each financial institution selected. The State Board of Investment may retain consulting services to assist in the periodic review, may establish a budget for its costs in the periodic review process, and may charge a proportional share of those costs to each financial institution selected. All contracts must be approved by the State Board of Investment before execution by the Minnesota Historical Society. The State Board of Investment shall also establish policies and procedures under section 11A.04, clause (2), to carry out this subdivision.\nThe retirement benefits provided by the annuity contracts and custodial accounts of the individual retirement account plan are held for the benefit of plan participants and must be paid according to this chapter and the plan document.\n(a) The reasonable and necessary administrative expenses of the individual retirement account plan for those employees enumerated in section 354D.02, subdivision 2, clause (3), must be paid by plan participants. The plan administrator may charge to plan participants purchasing annuity contracts and custodial accounts pursuant to subdivision 2, paragraph (a), an administrative expenses assessment of a designated amount, not to exceed two percent of member and employer contributions, as those contributions are made.\n(b) Any administrative expense charge that is not actually needed for the administrative expenses of the individual retirement account plan must be refunded to member accounts.",
	"repealed": false
}