{
	"id": "62D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.09",
	"title": "62D.09 INFORMATION TO ENROLLEES.",
	"text": "(a) Any written marketing materials which may be directed toward potential enrollees and which include a detailed description of benefits provided by the health maintenance organization shall include a statement of enrollee information and rights as described in section 62D.07, subdivision 3, clauses (2) and (3). Prior to any oral marketing presentation, the agent marketing the plan must inform the potential enrollees that any complaints concerning the material presented should be directed to the health maintenance organization, the commissioner of health, or, if applicable, the employer.\n(b) Detailed marketing materials must affirmatively disclose all exclusions and limitations in the organization's services or kinds of services offered to the contracting party, including but not limited to the following types of exclusions and limitations:\n(1) health care services not provided;\n(2) health care services requiring co-payments or deductibles paid by enrollees;\n(3) the fact that access to health care services does not guarantee access to a particular provider type; and\n(4) health care services that are or may be provided only by referral of a physician, advanced practice registered nurse, or physician assistant.\n(c) No marketing materials may lead consumers to believe that all health care needs will be covered. All marketing materials must alert consumers to possible uncovered expenses with the following language in bold print: \"THIS HEALTH CARE PLAN MAY NOT COVER ALL YOUR HEALTH CARE EXPENSES; READ YOUR CONTRACT CAREFULLY TO DETERMINE WHICH EXPENSES ARE COVERED.\" Immediately following the disclosure required under paragraph (b), clause (3), consumers must be given a telephone number to use to contact the health maintenance organization for specific information about access to provider types.\n(d) The disclosures required in paragraphs (b) and (c) are not required on billboards or image, and name identification advertisement.\nThe application for coverage by the health maintenance organization shall be accompanied by the statement of consumer information and rights as described in section 62D.07, subdivision 3, clause (3).\nEvery health maintenance organization or its representative shall annually, before June 1, provide to its enrollees the following:\n(1) a summary of its most recent annual financial statement including a balance sheet and statement of receipts and disbursements;\n(2) a description of the health maintenance organization, its health care plan or plans, its facilities and personnel, any material changes therein since the last report;\n(3) the current evidence of coverage, or amendments thereto; and\n(4) a statement of enrollee information and rights as described in section 62D.07, subdivision 3, clause (3).\nUnder clause (3), a health maintenance organization may annually alternate between providing enrollees with amendments and providing current evidence of coverage.\nHealth maintenance organizations which issue contracts to persons who are covered by title XVIII of the Social Security Act (Medicare) must give the applicant, at the time of application, an outline containing at least the following information:\n(1) a description of the principal benefits and coverage provided in the contract, including a clear description of nursing home and home care benefits covered by the health maintenance organization;\n(2) a statement of the exceptions, reductions, and limitations contained in the contract;\n(3) the following language: \"This contract does not cover all skilled nursing home care or home care services and does not cover custodial or residential nursing care. Read your contract carefully to determine which nursing home facilities and home care services are covered by your contract, and what procedures you must follow to receive these benefits.\";\n(4) a statement of the renewal provisions including any reservation by the health maintenance organization of the right to change fees;\n(5) a statement that the outline of coverage is a summary of the contract issued or applied for and that the contract should be read to determine governing contractual provisions; and\n(6) a statement explaining that the enrollee's Medicare coverage is altered by enrollment with the health maintenance organization, if applicable.\nHealth maintenance organizations shall provide enrollees with a list of the names and locations of participating providers to whom enrollees have direct access without referral no later than the effective date of enrollment or date the evidence of coverage is issued and upon request. Health maintenance organizations need not provide the names of their employed providers.\nAny list of providers issued by the health maintenance organization shall include the date the list was published and contain a bold type notice in a prominent location on the list of providers with the following language, or substantially similar language approved in advance by the commissioner:\n\"Enrolling in (name of health maintenance organization) does not guarantee services by a particular provider on this list. If you wish to be certain of receiving care from a specific provider listed, you should contact that provider to ask whether or not the provider is still a (name of health maintenance organization) provider and whether or not the provider is accepting additional patients.\"\nEvery health maintenance organization shall provide the information described in section 62D.07, subdivision 3, clauses (2) and (3), to enrollees or their representatives on request, within a reasonable time. Information on how to obtain referrals, prior authorization, or second opinion shall be given to the enrollee or an enrollee's representative in person or by telephone within one business day following the day the health maintenance organization or its representative receives the request for information.\nEach health maintenance organization shall issue a membership card to its enrollees. The membership card must:\n(1) identify the health maintenance organization;\n(2) include the name, address, and telephone number to call if the enrollee has a complaint;\n(3) include the telephone number to call or the instruction on how to receive authorization for emergency care; and\n(4) include one of the following:\n(i) the telephone number to call to appeal to or file a complaint with the commissioner of health; or\n(ii) for persons enrolled under section 256B.69, 256B.77, or 256L.12, the telephone number to call to file a complaint with the ombudsperson designated by the commissioner of human services under section 256B.69 or the Office of Ombudsman for Mental Health and Developmental Disabilities under section 256B.77 and the address to appeal to the commissioner of human services. The ombudsperson shall annually provide the commissioner of health with a summary of complaints and actions taken.",
	"repealed": false
}