{
	"id": "48.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.605",
	"title": "48.605 STATE BANKS, EMPLOYEE STOCK OPTION AND STOCK PURCHASE PLANS.",
	"text": "Any state bank may grant options to purchase, sell, or enter into agreements to sell shares of its capital stock to its employees, for a consideration of not less than 100 percent of the fair market value of the shares on the date the option is granted or, if pursuant to a stock purchase plan, 85 percent of the fair market value on the date the purchase price is fixed, pursuant to the terms of an employee restricted stock option plan or employee stock purchase plan which has been adopted by the board of directors of the bank and approved by the holders of at least three-fourths of the outstanding shares of the bank entitled to vote and by the commissioner of commerce. Stock options issued hereunder shall not extend beyond a period of ten years from date of issuance and shall otherwise qualify as restricted stock options under the Internal Revenue Code, and acts amendatory thereof.\nEmployee stock options and stock purchase agreements may provide that options may be exercisable or that shares may be purchased on any business day.\nAny state bank to carry out the provisions of this section, may increase its capital stock as provided by law and upon approval of the commissioner of commerce as provided by Minnesota Statutes 1961, section 48.04, except that the provisions of said section requiring the entire new capital to be immediately paid in cash shall not apply. Notwithstanding any law to the contrary the bank may hold such authorized but unissued new capital stock but only for the purpose of disposing of the same by the issuing of shares to its employees as authorized by this section. All proceeds from the issuance and sale of such shares shall be paid into the capital and surplus of the bank. Stock and options issued pursuant to this section shall not increase the capital or surplus of the bank until the stock is paid for in full in cash and certified to the commissioner.",
	"repealed": false
}