{
	"id": "524.2-803",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-803",
	"title": "524.2-803 EFFECT OF HOMICIDE ON INTESTATE SUCCESSION, WILLS, JOINT ASSETS, LIFE INSURANCE AND BENEFICIARY DESIGNATIONS; EMERGENCY ORDER.",
	"text": "(a) A surviving spouse, heir or devisee who feloniously and intentionally kills the decedent is not entitled to any benefits under the will or under this article, including an intestate share, an elective share, an omitted spouse's or child's share, homestead, exempt property, and a family allowance, and the estate of decedent passes as if the killer had predeceased the decedent. Property appointed by the will of the decedent to or for the benefit of the killer passes as if the killer had predeceased the decedent.\n(b) Any joint tenant who feloniously and intentionally kills another joint tenant thereby effects a severance of the interest of the decedent so that the share of the decedent passes as the decedent's property and the killer has no rights by survivorship. This provision applies to joint tenancies in real and personal property, joint accounts in banks, savings associations, credit unions and other institutions, and any other form of co-ownership with survivorship incidents.\n(c) A named beneficiary of a bond or other contractual arrangement who feloniously and intentionally kills the principal obligee is not entitled to any benefit under the bond or other contractual arrangement and it becomes payable as though the killer had predeceased the decedent.\n(d) A named beneficiary of a life insurance policy who feloniously and intentionally kills the person upon whose life the policy is issued is not entitled to any benefit under the policy and the proceeds of the policy shall be paid and distributed by order of the court as hereinafter provided. If a person who feloniously and intentionally kills a person upon whose life a life insurance policy is issued is a beneficial owner as shareholder, partner or beneficiary of a corporation, partnership, trust or association which is the named beneficiary of the life insurance policy, to the extent of the killer's beneficial ownership of the corporation, partnership, trust or association, the proceeds of the policy shall be paid and distributed by order of the court as hereinafter provided.\nUpon receipt of written notice by the insurance company at its home office that the insured may have been intentionally and feloniously killed by one or more named beneficiaries or that the insured may have been intentionally and feloniously killed by one or more persons who have a beneficial ownership in a corporation, partnership, trust or association, which is the named beneficiary of the life insurance policy, the insurance company shall, pending court order, withhold payment of the policy proceeds to all beneficiaries. In the event that the notice has not been received by the insurance company before payment of the policy proceeds, the insurance company shall be fully and finally discharged and released from any and all responsibility under the policy to the extent that the policy proceeds have been paid.\nThe named beneficiary, the insurance company or any other party claiming an interest in the policy proceeds may commence an action in the district court to compel payment of the policy proceeds. The court may order the insurance company to pay the policy proceeds to any person equitably entitled thereto, including the deceased insured's spouse, children, issue, parents, creditors or estate, and may order the insurance company to pay the proceeds of the policy to the court pending the final determination of distribution of the proceeds by the court. The insurance company, upon receipt of a court order, judgment or decree ordering payment of the policy proceeds, shall pay the policy proceeds according to the terms of the order, and upon payment of such proceeds according to the terms of the court order, shall be fully and completely discharged and released from any and all responsibility for payment under the policy.\n(e) Any other acquisition of property or interest by the killer shall be treated in accordance with the principles of this section.\n(f) A final judgment of conviction of felonious and intentional killing is conclusive for purposes of this section. In the absence of a conviction of felonious and intentional killing the court may determine by a preponderance of evidence whether the killing was felonious and intentional for purposes of this section.\n(g) This section does not affect the rights of any person who, before rights under this section have been adjudicated, purchases from the killer for value and without notice property which the killer would have acquired except for this section, but the killer is liable for the amount of the proceeds or the value of the property. Any insurance company, bank, or other obligor making payment according to the terms of its policy or obligation is not liable by reason of this section unless prior to payment it has received at its home office or principal address written notice of a claim under this section.\n(h) If a complaint or indictment is issued charging a defendant in the felonious and intentional killing of the decedent, the personal representative, special administrator, or an interested person may file with the court a copy of the complaint or indictment and an inventory of the decedent's personal property that may be affected by a determination under this section, including the following:\n(1) personal property that is the subject of a specific devise under the decedent's will or separate writing under section 524.2-513;\n(2) exempt property identified in section 524.2-403;\n(3) personal property claimed to have sentimental value to an eligible child under section 525.152; or\n(4) any other personal property believed, in good faith, to belong to the decedent.\nThe person filing the inventory shall attest that the inventory is correct and complete to the best of the person's knowledge. The inventory and affidavit shall be filed with the court administrator.\n(i) Upon motion of the personal representative, special administrator, or an interested person, and for good cause shown, the court may issue an order regarding property identified under paragraph (h) that includes any or all of the following relief:\n(1) reserving a determination of distribution of property;\n(2) holding the property in trust or escrow for any and all beneficiaries or heirs not disqualified by this section;\n(3) prohibiting the sale, disposition, removal, transfer, or destruction of the property;\n(4) permitting the sale, disposition, removal, or transfer of property jointly held by the decedent and a person disqualified under this section only to the extent necessary for reasonable and ordinary living expenses by the disqualified individual, subject to approval and on the terms the court deems just and proper; or\n(5) any other relief prescribed by the court.\nAn order may be granted without notice to other interested persons if the court finds from affidavit or other sworn testimony that the rights of decedent's heirs and beneficiaries may be irreparably harmed before a hearing can be held. If an ex parte order is granted, notice must be given to interested persons known by the court and as the court directs within 48 hours of issuing the order and the court shall hold a hearing within five days of issuing the order. In all other cases, reasonable notice of the time and place of hearing on the petition must be given to interested persons known by the court and as the court directs. An order issued under this paragraph shall be effective pending a final determination under this section unless the court specifies a shorter time period or rescinds the order.",
	"repealed": false
}