{
	"id": "5.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/5.25",
	"title": "5.25 SERVICE OF PROCESS.",
	"text": "A process, notice, or demand required or permitted by law to be served upon an entity governed by chapter 221, 302A, 303, 317A, 321, 322C, 323A, 330, 540, or 543 may be served on: (1) the registered agent, if any; (2) if no agent has been appointed then on an officer, manager, or general partner of the entity; or (3) if no agent, officer, manager, or general partner can be found at the address on file with the secretary of state, the secretary of state as provided in this section.\nWhen service of process is to be made on the secretary of state according to section 221.67 or 540.152, the procedure in this subdivision applies. Service must be made by filing the process, notice, or demand with the secretary of state along with the payment of a fee of $35. Within ten days of the filing with the secretary of state, a copy of the process, notice, or demand shall be sent to the defendant's last known address by the person who caused it to be served on the secretary of state.\nWhen service of process is to be made on the secretary of state for entities governed by chapter 302A, 317A, 321, 322C, 323, 330, or 543, the procedure in this subdivision applies. Service must be made by filing with the secretary of state one copy of the process, notice, or demand along with payment of a $35 fee.\n(a) Service of a process, notice, or demand may be made on a foreign corporation authorized to transact business in this state by delivering to and leaving with the secretary of state, or with an authorized deputy or clerk in the secretary of state's office, one copy of it and a fee of $50 in the following circumstances: (1) if the foreign corporation fails to appoint or maintain in this state a registered agent upon whom service of process may be had; (2) whenever a registered agent cannot be found at its registered office in this state, as shown by the return of the sheriff of the county in which the registered office is situated, or by an affidavit of attempted service by a person not a party; (3) whenever a corporation withdraws from the state; or (4) whenever the certificate of authority of a foreign corporation is revoked or canceled.\nHowever, after a foreign corporation withdraws from the state, according to section 303.16, service upon the corporation may be made according to this section only when based upon a liability or obligation of the corporation incurred within this state or arising out of any business done in this state by the corporation before the issuance of a certificate of withdrawal.\n(b) A foreign corporation is considered to be doing business in Minnesota if it makes a contract with a resident of Minnesota to be performed in whole or in part by either party in Minnesota, or if it commits a tort in whole or in part in Minnesota against a resident of Minnesota. These acts are considered to be equivalent to the appointment by the foreign corporation of the secretary of state of Minnesota and successors to be its true and lawful attorney upon whom may be served all lawful process in actions or proceedings against the foreign corporation arising from or growing out of the contract or tort. One copy of the process must be served on the secretary of state, together with the address to which service is to be sent and a fee of $50. The making of the contract or the committing of the tort is considered to be the agreement of the foreign corporation that any process against it which is so served upon the secretary of state has the same legal force and effect as if served personally on it within the state of Minnesota.\n(a) Process, notice, or demand may be served on a dissolved, withdrawn, or revoked business entity that was governed by chapter 302A, 303, 317A, 321, 322C, or 323A as provided in this subdivision. The court shall determine if service is proper.\n(b) If a business entity has voluntarily dissolved or has withdrawn its request for authority to transact business in this state, or a court has entered a decree of dissolution or revocation of authority to do business, service must be made according to subdivision 3 or 4, so long as claims are not barred under the provisions of the chapter that governed the business entity.\n(c) If a business entity has been involuntarily dissolved or its authority to transact business in this state has been revoked, service must be made according to subdivision 3 or 4.\nIn the case of service of process according to subdivision 3 or 4, the secretary of state shall immediately cause a copy of a service of process to be forwarded by certified mail addressed to the business entity:\n(1) in care of the agent of the business entity, at its registered office in this state as it appears in the records of the secretary of state;\n(2) at the address designated in the application for withdrawal, if the business entity has withdrawn from this state in the manner provided by law;\n(3) at the address provided by the party submitting the document for service of process if the business entity's authority to do business in this state has been revoked; or\n(4) at the address provided by the party submitting the document for service of process if the business entity has never been authorized to do business in this state.\nIf a summons is to be served upon the secretary of state according to subdivision 3 or 4, the business entity so served has 30 days from the date of mailing by the secretary of state in which to answer the complaint.\nNothing in this section limits the right of a person to serve any process, notice, or demand required or permitted by law to be served upon a business entity in another manner.",
	"repealed": false
}