{
	"id": "308C.615",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.615",
	"title": "308C.615 FORECLOSURE OF LIENS OR TO ACQUIRE OCCUPANCY RIGHTS FOLLOWING MEMBERSHIP TERMINATION IN A SENIOR HOUSING COOPERATIVE.",
	"text": "(a) A senior housing cooperative's lien shall be foreclosed by a private sale negotiated by the cooperative, or by an acceptance by the cooperative of the subject membership interest in full satisfaction of the secured indebtedness pursuant to the following:\n(1) a notice of the sale or acceptance shall be served on the member 90 days prior to the sale or acceptance;\n(2) the cooperative shall be entitled to its reasonable costs and attorney fees not exceeding the amount provided by section 582.01, subdivision 1a;\n(3) the amount of the cooperative's lien shall be deemed to be adequate consideration for the membership interest subject to sale or acceptance, notwithstanding the value of the membership interest; and\n(4) the notice of sale or acceptance shall contain the following statement in capital letters with the name of the cooperative or secured party filled in:\n\"THIS IS TO INFORM YOU THAT BY THIS NOTICE (fill in name of cooperative or secured party) HAS BEGUN PROCEEDINGS UNDER MINNESOTA STATUTES, CHAPTER 308C, TO FORECLOSE ON YOUR MEMBERSHIP INTEREST FOR THE REASON SPECIFIED IN THIS NOTICE. YOUR MEMBERSHIP INTEREST AND YOUR RIGHT TO OCCUPY THE DWELLING UNIT APPURTENANT THERETO WILL TERMINATE 90 DAYS AFTER SERVICE OF THIS NOTICE ON YOU UNLESS BEFORE THEN:\n(a) THE PERSON AUTHORIZED BY (fill in the name of cooperative or secured party) AND DESCRIBED IN THIS NOTICE TO RECEIVE PAYMENTS RECEIVES FROM YOU:\n(1) THE AMOUNT THIS NOTICE SAYS YOU OWE; PLUS\n(2) THE COSTS INCURRED TO SERVE THIS NOTICE ON YOU; PLUS\n(3) $500 TO APPLY TO ATTORNEY FEES ACTUALLY EXPENDED OR INCURRED; PLUS\n(4) ANY ADDITIONAL AMOUNTS FOR YOUR MEMBERSHIP INTEREST BECOMING DUE TO (fill in name of cooperative or secured party) AFTER THE DATE OF THIS NOTICE; OR\n(b) YOU SECURE FROM A DISTRICT COURT AN ORDER THAT THE FORECLOSURE OF YOUR RIGHTS TO YOUR MEMBERSHIP INTEREST AND YOUR RIGHT TO OCCUPY THE DWELLING UNIT APPURTENANT THERETO BE SUSPENDED UNTIL YOUR CLAIMS OR DEFENSES ARE FINALLY DISPOSED OF BY TRIAL, HEARING, OR SETTLEMENT. YOUR ACTION MUST SPECIFICALLY STATE THOSE FACTS AND GROUNDS THAT DEMONSTRATE YOUR CLAIMS OR DEFENSES. IF YOU DO NOT TAKE ACTION AS PRESCRIBED IN PARAGRAPH (A) OF THIS NOTICE WITHIN THE TIME PERIOD SPECIFIED IN THIS NOTICE, YOUR OWNERSHIP RIGHTS IN YOUR MEMBERSHIP INTEREST AND YOUR RIGHT TO OCCUPY THE DWELLING UNIT APPURTENANT THERETO WILL TERMINATE AT THE END OF THE PERIOD, YOU WILL LOSE ALL THE MONEY YOU HAVE PAID FOR YOUR MEMBERSHIP INTEREST, YOU WILL LOSE YOUR RIGHT TO POSSESSION AND OCCUPANCY OF YOUR DWELLING UNIT, YOU MAY LOSE YOUR RIGHT TO ASSERT ANY CLAIMS OR DEFENSES THAT YOU MIGHT HAVE, AND YOU WILL BE EVICTED. IF YOU HAVE ANY QUESTIONS ABOUT THIS NOTICE, CONTACT AN ATTORNEY IMMEDIATELY.\"\n(b) If the member or occupant fails to redeem before the expiration of 90 days following delivery of the notice to the member, the cooperative may bring an action for eviction against the member and any persons occupying the dwelling unit, and in that case section 504B.291 shall not apply.\n(c) A cooperative may assign its lien rights in the same manner as any other secured party.",
	"repealed": false
}