{
	"id": "471.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.88",
	"title": "471.88 EXCEPTIONS.",
	"text": "The governing body of any port authority, seaway port authority, economic development authority, watershed district, soil and water conservation district, town, school district, hospital district, county, or city, by unanimous vote, may contract for goods or services with an interested officer of the governmental unit in any of the following cases.\nIn the designation of a bank or savings association in which the officer is interested as an authorized depository for public funds and as a source of borrowing, no restriction shall apply to the deposit or borrowing of any funds or the designation of a depository by such authority or governmental unit in any bank or savings association in which a member of an authority or officer of a governmental unit shall have an interest if such deposited funds are protected in accordance with chapter 118A; provided, however, that any member or officer having such an interest shall disclose that the member is a director or employee of the bank or savings association, which disclosure shall be entered upon the minutes of the authority or governmental unit, such disclosure shall be made when such bank or savings association is first designated as a depository or as a source of borrowing, or when such member or officer is elected whichever is later, and such disclosure shall serve as notice of such interest and need not be made with each successive transaction.\nThe designation of an official newspaper, or publication of official matters therein, in which the officer is interested when it is the only newspaper complying with statutory or charter requirements relating to the designation or publication.\nA contract with a cooperative association of which the officer is a shareholder or stockholder but not an officer or manager.\nA contract for which competitive bids are not required by law.\nA contract with a volunteer fire department for the payment of compensation to its members or for the payment of retirement benefits to these members.\nA contract with a volunteer ambulance service for the payment of compensation to its members or for the payment of retirement benefits to these members.\nA contract with a municipal band for the payment of compensation to its members.\nMS 1990 [Repealed, 1992 c 380 s 8]\nWhen a port authority commissioner or economic development authority commissioner is engaged in or employed by a firm engaged in the business of importing or exporting or general trade, it shall be lawful for the authority to do business with the commissioner or the commissioner's employer provided that in the fixing of any rates affecting shippers or users of the terminal facility, said commissioner shall not vote thereon.\nWhen a seaway port authority commissioner is engaged in or employed by a firm engaged in the business of importing or exporting or general trade, it shall be lawful for the authority to do business with the commissioner or the commissioner's employer provided that in the fixing of any rates affecting shippers or users of the terminal facility, said commissioner shall not take part in the determination of, except to testify, nor vote thereon.\nWhen a commissioner of any public housing, port authority, or economic development authority is employed by a bank engaged in making loans or performing trust services involving real or personal property affected by any plan or such housing or port authority, no restriction shall apply to any such loans made or trust services performed by said bank if the commissioner shall disclose the nature of such loans or trust services of which the commissioner has personal knowledge, which disclosure shall be entered upon the minutes of such authority.\nAn officer of a government unit may contract with the unit to provide construction materials or services, or both, when the sealed bid process is used and the unit has a population of 1,000 or less according to the last federal census. The officer may not vote on the question of the contract when it comes before the governing body for consideration.\nA public officer may rent space in a public facility at a rate commensurate with that paid by other members of the public.\n(a) For the purposes of this subdivision:\n(1) \"local development organization\" means a housing and redevelopment authority, economic development authority, community action program, port authority, or private consultant; and\n(2) \"government unit\" has the meaning given in section 471.59, subdivision 1.\n(b) When a local development organization administers a loan or grant program for individual property owners within the geographical boundaries of a government unit by an agreement entered into by the government unit and the local development organization, an officer of the government unit may apply for a loan or grant from the local development organization. If an officer applies for a loan or grant, the officer must disclose as part of the official minutes of a public meeting of the governmental unit that the officer has applied for a loan or grant.\nWhen a home rule charter or statutory city and a utility enter into a franchise agreement or a contract for the provision of utility services to the city, a city council member who is an employee of the utility is not precluded from continuing to serve as a city council member during the term of the franchise agreement or contract if the council member abstains from voting on any official action relating to the franchise agreement or contract and discloses the member's reason for the abstention in the official minutes of the council meeting.\n[Renumbered 123B.195]\nThe governing body may apply for and accept a state or federal grant for housing, community, or economic development in which a public officer may benefit, if the public officer abstains from voting on measures related to the grant.\nIf a city with a population of 5,000 or less in St. Louis County administers a loan or grant program with community development block grant funds or federal economic development administration funds for property owners within the geographic boundaries of the city, the city may make a grant or loan from these funds to a public officer of the city who applies, if the public officer first discloses, as part of the official minutes of a meeting of the city, that the public officer has applied for the funds and the public officer abstains from voting on the public officer's application.\nIf a city or county housing and redevelopment authority, or an agency having the powers of a city or county housing and redevelopment authority, administers a loan or grant program with state or federal funds, the authority may make a grant or loan from these funds to a public officer of the authority who applies, if the public officer first discloses, as part of the official minutes of a meeting of the authority, that the public officer has applied for the funds and the public officer abstains from voting on the public officer's application.\nA township may enter into a contract governed by section 471.345, even if a township supervisor is an employee of the contractor as long as the supervisor had no role in preparing the contractor's bid or negotiation for the contract with the township. The supervisor is not precluded from continuing to serve as a township official during the term of the contract if the township supervisor abstains from voting on any official action relating to the contract and discloses the supervisor's reason for the abstention in the official minutes of the township meeting.\nNotwithstanding subdivision 1, a local school board may contract with a class of school district employees such as teachers or custodians where the spouse of a school board member is a member of the class of employees contracting with the school board and the employee spouse receives no special monetary or other benefit that is substantially different from the benefits that other members of the class receive under the employment contract. A school board invoking this exception must have a majority of disinterested school board members vote to approve the contract, direct the school board member spouse to abstain from voting to approve the contract, and publicly set out the essential facts of the contract at the meeting where the contract is approved.",
	"repealed": false
}