{
	"id": "148.621",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.621",
	"title": "148.621 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 148.621 to 148.633.\n\"Accredited college or university\" means a college or university accredited by the regional accrediting agencies recognized by the Council on Postsecondary Accreditation, and the United States Department of Education at the time the degree was conferred.\n\"Association\" means the American Dietetic Association.\n\"Board\" means the Board of Dietetics and Nutrition Practice.\n\"Commission\" means the Commission on Dietetic Registration that is a member of the National Commission on Health Certifying Agencies, which national commission establishes national standards of competence for individuals participating in the health care delivery system.\n\"Commissioner\" means the commissioner of health.\n\"Dietitian\" means an individual who engages in dietetics or nutrition practice and uses the title dietitian.\n\"Nutritionist\" means an individual who engages in dietetics or nutrition practice and uses the title nutritionist.\n\"Dietetics or nutrition practice\" means the integration and application of scientific principles of food, nutrition, biochemistry, physiology, food management, and behavioral and social sciences to achieve and maintain human health through the provision of nutrition care services.\n\"Nutrition care services\" means:\n(1) assessment of the nutritional needs of individuals or groups;\n(2) establishment of priorities, goals, and objectives to meet nutritional needs;\n(3) provision of nutrition counseling for both normal and therapeutic needs;\n(4) development, implementation, and management of nutrition care services; or\n(5) evaluation, adjustment, and maintenance of appropriate standards of quality in nutrition care.\n\"Nutritional assessment\" means the evaluation of the nutritional needs of individuals or groups based on appropriate biochemical, anthropometric, physical, and dietary data to determine nutrient needs and recommend appropriate nutritional intake.\n\"Nutrition counseling\" means advising and assisting individuals or groups on appropriate nutritional intake by integrating information from the nutritional assessment with information on food and other sources of nutrients and meal preparation consistent with cultural background and socioeconomic status.\n\"Person\" means an individual, corporation, partnership, or other legal entity.",
	"repealed": false
}