{
	"id": "103B.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.231",
	"title": "103B.231 WATERSHED PLANS.",
	"text": "(a) A watershed management plan is required for watersheds comprising all minor watershed units wholly or partly within the metropolitan area. For minor watershed units having more than 90 percent of their area within the metropolitan area, the watershed management plan must be prepared, adopted, and implemented in accordance with the requirements of sections 103B.205 to 103B.255.\n(b) Minor watershed units having 90 percent or less of their area within the metropolitan area shall prepare a plan or have the county prepare a watershed management plan for their area in accordance with the requirements of sections 103B.101 and 103B.205 to 103B.355, as determined by the Board of Water and Soil Resources.\nLocal government units outside of the metropolitan area, having territory that is within a watershed part of which is subject to the requirements of this section, may enter into an agreement under section 103B.211. A local government unit that enters into an agreement under this subdivision has the duties imposed and the authority granted in sections 103B.205 to 103B.255.\n(a) Where a watershed management organization exists, the plan for the watershed must be prepared and adopted by the organization.\n(b) If a watershed management organization located wholly outside of Hennepin and Ramsey counties, is terminated, or the Board of Water and Soil Resources determines a plan is not being implemented in accordance with its rules, the county or counties containing the watershed unit shall prepare, adopt, and implement the watershed plan and for this purpose the county or counties have the planning, review, permitting, and financing authority of a watershed management organization specified in sections 103B.211 to 103B.255.\n(c) If a watershed management organization within the metropolitan area and wholly or partly within Hennepin or Ramsey counties is terminated or the Board of Water and Soil Resources determines a plan is not being implemented, the county or counties shall petition for the establishment of a watershed district under chapter 103D, provided that a district established pursuant to a petition:\n(1) may not cross a primary river or a river forming the boundary between a metropolitan county and a county outside the metropolitan area; and\n(2) may not cross county boundaries to include territory whose distinguishing characteristic is multiple drainage points into a primary river.\n(d) A watershed management organization may request a county to prepare all or part of a plan.\n(e) A county may delegate the preparation of all or part of a plan to the county soil and water conservation district.\n(f) Upon request of a statutory or home rule charter city or town, a county may delegate the preparation of all or part of a plan to the city or town.\n(g) If the Board of Water and Soil Resources determines that a watershed management organization or county has not developed a draft plan, is not implementing the plan, has not delegated implementation of the plan, and has not petitioned for the creation of a watershed district:\n(1) state agencies may withhold from local government units state funding for water programs for projects within the watershed;\n(2) state agencies may withhold from local government units delegation of state water resource regulatory authority within the watershed;\n(3) state agencies may suspend issuance of water-related permits within the watershed; and\n(4) the board may request state agencies to withhold portions of state aid funding used for the installation of curb and gutter and other drainage facilities of public transportation projects within the watershed.\nThe provisions of this paragraph apply until the Board of Water and Soil Resources determines that a plan is being implemented in accordance with its rules.\n(h) Appeals from the Board of Water and Soil Resources determination are made in the same manner as appeals under section 103B.345, subdivision 5.\n(a) The Board of Water and Soil Resources in consultation with the state review agencies and the Metropolitan Council may develop a priority schedule for the revision of plans required under this chapter.\n(b) The prioritization should be based on but not be limited to status of current plan, scheduled revision dates, anticipated growth and development, existing and potential problems, and regional water quality goals and priorities.\n(c) The schedule will be used by the Board of Water and Soil Resources in consultation with the state review agencies and the Metropolitan Council to direct watershed management organizations of when they will be required to revise their plans.\n(d) In the event that a plan expires prior to notification from the Board of Water and Soil Resources under this section, the existing plan, authorities, and official controls of a watershed management organization shall remain in full force and effect until a revision is approved.\n(e) Watershed management organizations submitting plans and draft plan amendments for review prior to the board's priority review schedule, may proceed to adopt and implement the plan revisions without formal board approval if the board fails to adjust its priority review schedule for plan review, and commence its statutory review process within 45 days of submittal of the plan revision or amendment.\n(a) The watershed management plan must specify the period covered by the plan and must extend at least five years but no more than ten years from the date the board approves the plan. Plans that contain revision dates inconsistent with this section must comply with that date, provided it is not more than ten years beyond the date of board approval.\n(b) The plan must be reviewed for consistency with an adopted county groundwater plan, and revised to the degree necessary to become compliant with the groundwater plan no later than two years after adoption by the county. A one-year extension may be granted by the board. Upon the request of a watershed management organization, the county shall provide a written statement that:\n(1) identifies any substantial inconsistencies between the watershed plan and the groundwater plan and any substantial adverse effects of the watershed plan on the groundwater plan; and\n(2) evaluates, estimates the cost of, and recommends alternatives for amending the watershed plan to rectify any substantial inconsistencies and adverse effects.\n(c) The plan shall contain the elements required by subdivision 6. Each element shall be set out in the degree of detail and prescription necessary to accomplish the purposes of sections 103B.205 to 103B.255, considering the character of existing and anticipated physical and hydrogeologic conditions, land use, and development and the severity of existing and anticipated water management problems in the watershed.\n(d) Existing plans of a watershed management organization shall remain in force and effect until amended or superseded by plans adopted under sections 103B.205 to 103B.255.\n(e) Watershed management organizations shall coordinate their planning activities with contiguous watershed management organizations and counties conducting water planning and implementation under sections 103B.101 and 103B.301 to 103B.355.\n[Repealed, 1995 c 184 s 32]\n(a) The plan shall:\n(1) describe the existing physical environment, land use, and development in the area and the environment, land use, and development proposed in existing local and metropolitan comprehensive plans;\n(2) present information on the hydrologic system and its components, including drainage systems previously constructed under chapter 103E, and existing and potential problems related thereto;\n(3) state objectives and policies, including management principles, alternatives and modifications, water quality, and protection of natural characteristics;\n(4) set forth a management plan, including the hydrologic and water quality conditions that will be sought and significant opportunities for improvement;\n(5) describe the effect of the plan on existing drainage systems;\n(6) identify high priority areas for wetland preservation, enhancement, restoration, and establishment and describe any conflicts with wetlands and land use in these areas;\n(7) describe conflicts between the watershed plan and existing plans of local government units;\n(8) set forth an implementation program consistent with the management plan, which includes a capital improvement program and standards and schedules for amending the comprehensive plans and official controls of local government units in the watershed to bring about conformance with the watershed plan; and\n(9) set out procedures and timelines for amending the plan.\n(b) The board shall adopt rules to establish standards and requirements for amendments to watershed plans. The rules must include:\n(1) performance standards for the watershed plans, which may distinguish between plans for urban areas and rural areas;\n(2) minimum requirements for the content of watershed plans and plan amendments, including public participation process requirements for amendment and implementation of watershed plans;\n(3) standards for the content of capital improvement programs to implement watershed plans, including a requirement that capital improvement programs identify structural and nonstructural alternatives that would lessen capital expenditures; and\n(4) how watershed plans are to specify the nature of the official controls required to be adopted by the local units of government, including uniform erosion control, stormwater retention, and wetland protection ordinances in the metropolitan area.\n(a) Upon completion of the plan but before final adoption by the organization, the organization must submit the draft plan for a 60-day review and comment period to all counties, the Metropolitan Council, the state review agencies, the Board of Water and Soil Resources, soil and water conservation districts, towns, and statutory and home rule charter cities having territory within the watershed. A local government unit that expects that substantial amendment of its local comprehensive plan will be necessary to bring local water management into conformance with the watershed plan must describe as specifically as possible, within its comments, the amendments to the local plan that it expects will be necessary. If the county has a groundwater plan, the county must review and comment on the consistency of the watershed plan with the county groundwater plan. Differences among local governmental agencies regarding the plan must be mediated. Notwithstanding sections 103D.401, 103D.405, and 473.165, the council shall review the plan in the same manner and with the same authority and effect as provided for the council's review of the comprehensive plans of local government units under section 473.175. The council shall comment on the apparent conformity with metropolitan system plans of any anticipated amendments to local comprehensive plans. The council shall advise the Board of Water and Soil Resources on whether the plan conforms with the management objectives and target pollution loads stated in the council's water resources plan and shall recommend changes in the plan that would satisfy the council's plan.\n(b) The watershed management organization must respond in writing to any concerns expressed by the review agencies at least ten days before the public hearing.\n(c) The watershed management organization must hold a public hearing on the draft plan no sooner than 14 days after the 60-day review period of the draft plan. The board or boards of the affected counties shall approve or disapprove projects in the capital improvement program which may require the provision of county funds pursuant to section 103B.251 or 103D.901, subdivision 2. Each county has up until the date of the public hearing on the draft plan to complete its review of the capital improvement program. If the county fails to complete its review within the prescribed period, unless an extension is agreed to by the organization the program shall be deemed approved. If the watershed extends into more than one county and one or more counties disapprove of all or part of a capital improvement program while the other county or counties approve, the program shall be submitted to the Board of Water and Soil Resources for review pursuant to subdivision 9.\n[Repealed, 2010 c 218 s 4]\nAfter completion of the review under subdivision 7, the draft plan, any amendments thereto, all written comments received on the draft plan, a record of the public hearing, and a summary of changes incorporated as a result of the review process shall be submitted to the Metropolitan Council, the state review agencies, and the Board of Water and Soil Resources for final review. The board shall review the plan for conformance with the requirements of sections 103B.205 to 103B.255, and chapter 103D. The board shall not prescribe a plan, but may disapprove all or parts of a plan which it determines is not in conformance with the requirements of sections 103B.205 to 103B.255, and chapter 103D. If the capital improvement program is the subject of a dispute between counties, the Board of Water and Soil Resources shall make a final decision on the issue. The decision shall be binding on the organization and the counties involved. The board shall complete its review under this section within 90 days.\n(a) The organization shall adopt and implement its plan within 120 days after compliance with the provisions of subdivision 9 and approval of the plan by the Board of Water and Soil Resources. A watershed district may implement its approved plan and approved capital improvement program by resolution of the majority of the board of managers and without respect to the provisions of chapter 103D requiring the managers to wait upon petitions for projects, to submit projects for review by the Board of Water and Soil Resources, and to limit the cost and purposes of projects.\n(b) The Board of Water and Soil Resources shall adopt rules establishing standards and criteria for making determinations of whether watershed management organizations and counties are implementing watershed plans as required under subdivision 1.\nTo the extent and in the manner required by the adopted plan, all amendments to the adopted plan shall be submitted to the towns, cities, county, the Metropolitan Council, the state review agencies, and the Board of Water and Soil Resources for review in accordance with the provisions of subdivisions 7 and 9. Amendments necessary to revise the plan to be consistent with the county groundwater plan, as required by subdivision 4, must be submitted for review in accordance with subdivisions 7 and 9. Minor amendments to a plan shall be reviewed in accordance with standards prescribed in the watershed management plan.\n[Repealed, 1995 c 184 s 32]\nPersons aggrieved by an alleged failure to comply with the provisions of an approved plan may request review by the Board of Water and Soil Resources. The board shall establish a procedure for resolving disputes and making a determination on whether the plan is being implemented.\nThe Board of Water and Soil Resources shall adopt rules establishing:\n(1) requirements for annual watershed management organization financial reports to the board, including a report on administrative, project, and other expenditures;\n(2) standards for annual financial audits by certified public accountants, procedures for the board to follow before ordering state financial and performance audits as determined by the board, and procedures for charging the costs of financial and performance audits to the watershed management organization; and\n(3) requirements for the content of annual activity reports to the board, which must include the number and type of permits issued, complaints received, plan and ordinance violations, projects constructed, new officers installed, variances granted, status of local unit adoption and enforcement of model ordinance requirements, and financial conditions of the watershed management organization.",
	"repealed": false
}