{
	"id": "144.442",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.442",
	"title": "144.442 TESTING IN SCHOOL CLINICS.",
	"text": "In the event that the commissioner designates a school or school district under section 144.441, subdivision 2, the school or school district or community health board may administer Mantoux screening tests to some or all persons enrolled in or employed by the designated school or school district. Any Mantoux screening provided under this section shall be under the direction of a licensed physician, advanced practice registered nurse, or physician assistant.\nPrior to administering the Mantoux test to such persons, the school or school district or community health board shall inform in writing such persons and parents or guardians of minor children to whom the test may be administered, of the following:\n(1) that there has been an occurrence of active tuberculosis or evidence of a higher than expected prevalence of tuberculosis infection in that school or school district;\n(2) that screening is necessary to avoid the spread of tuberculosis;\n(3) the manner by which tuberculosis is transmitted;\n(4) the risks and possible side effects of the Mantoux test;\n(5) the risks from untreated tuberculosis to the infected person and others;\n(6) the ordinary course of further diagnosis and treatment if the Mantoux test is positive;\n(7) that screening has been scheduled; and\n(8) that no person will be required to submit to the screening if the person submits a statement of objection due to the conscientiously held beliefs of the person employed or of the parent or guardian of a minor child.\nMinors may give consent for testing as set forth in sections 144.341 to 144.347.\nPrior to administering a Mantoux test to a minor, the school or school district or community health board shall prepare a form for signature in which the parent or guardian shall consent or submit a statement of objection to the test. The parent or guardian of a minor child shall return a signed form to the school or school district or community health board which is conducting the screening indicating receipt of the notice and consent or objection to the administration of the test. In the event that the form with a signed consent or objection is not returned, the school or school district or community health board may undertake such steps as are reasonable to secure such consent or objection. If after such steps the school or school district or community health board chooses to screen the minor without consent, it shall send a notice of intent to test by certified mail, restricted delivery with return receipt, to the address given to the school or school district by the parent or guardian for emergency contact of the parent or guardian. The accuracy of the address shall be checked with the person enrolled, if possible. Placing notice as specified in this subdivision shall constitute service. Reasonable efforts shall be made to provide this notice in a language understood by the parent or guardian. If this notice cannot be delivered or a form with a signed consent or objection is not returned, the school or school district or community health board shall check the permanent medical record required by section 144.29 to determine if the parent or guardian previously withheld consent to immunizations or other medical treatment because of conscientiously held beliefs. If there is such a statement on file or if the school district otherwise has notice of such a statement, the school or school district or community health board shall not administer the Mantoux test unless the consent of the parent or guardian is obtained. If there is no such statement in the permanent medical record or known to exist otherwise, the school or school district or community health board may administer the Mantoux test at the time and place specified in the notice unless medically contraindicated. The school or school district or community health board shall document in the permanent medical record its efforts to notify the parent or guardian of the minor child, and its efforts to check the permanent medical records.\nIn the event the Mantoux test is positive, no further diagnosis of or treatment for tuberculosis in a minor child shall be undertaken without the signed consent of the parent or guardian of the minor child.",
	"repealed": false
}