{
	"id": "171.3215",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.3215",
	"title": "171.3215 CANCELING BUS ENDORSEMENT FOR CERTAIN OFFENSES.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"School bus driver\" means a person possessing a school bus driver's endorsement on a valid Minnesota driver's license or a person possessing a valid Minnesota driver's license who drives a vehicle with a seating capacity of ten or less persons used as a school bus.\n(c) \"Disqualifying offense\" includes (1) any felony offense, (2) any misdemeanor, gross misdemeanor, or felony violation of chapter 152, (3) any violation under section 609.3451, 609.746, subdivision 1, 617.23, 617.246, 617.247, or 617.293, or (4) while driving, operating, or being in physical control of a school bus or a Head Start bus, a violation of section 169A.20 or a similar statute or ordinance from another state.\n(d) \"Head Start bus driver\" means a person possessing a valid Minnesota driver's license:\n(1) with a passenger endorsement, who drives a Head Start bus;\n(2) with a school bus driver's endorsement, who drives a Head Start bus; or\n(3) who drives a vehicle with a seating capacity of ten or fewer persons used as a Head Start bus.\nWithin ten days of receiving notice under section 631.40, subdivision 1a, or otherwise receiving notice for a nonresident driver, that a school bus driver has been convicted of a disqualifying offense, the commissioner shall permanently cancel the school bus driver's endorsement on the offender's driver's license and in the case of a nonresident, the driver's privilege to operate a school bus in Minnesota. A school bus driver whose endorsement or privilege to operate a school bus in Minnesota has been permanently canceled may not apply for reinstatement. Within ten days of receiving notice under section 631.40, subdivision 1a, or otherwise receiving notice for a nonresident driver, that a school bus driver has been convicted of a violation of section 169A.20, or a similar statute or ordinance from another state, and within ten days of revoking a school bus driver's license under section 169A.52 or 171.177, the commissioner shall cancel the school bus driver's endorsement on the offender's driver's license or the nonresident's privilege to operate a school bus in Minnesota for five years. After five years, a school bus driver may apply to the commissioner for reinstatement. Even after five years, cancellation of a school bus driver's endorsement or a nonresident's privilege to operate a school bus in Minnesota for a violation under section 169A.20, sections 169A.50 to 169A.53, section 171.177, or a similar statute or ordinance from another state, shall remain in effect until the driver provides proof of successful completion of an alcohol or controlled substance treatment program. For a first offense, proof of completion is required only if treatment was ordered as part of a chemical use assessment. Within ten days of receiving notice under section 631.40, subdivision 1a, or otherwise receiving notice for a nonresident driver, that a school bus driver has been convicted of a fourth moving violation in the last three years, the commissioner shall cancel the school bus driver's endorsement on the offender's driver's license or the nonresident's privilege to operate a school bus in Minnesota until one year has elapsed since the last conviction. A school bus driver who has no new convictions after one year may apply for reinstatement. Upon canceling the offender's school bus driver's endorsement, the commissioner shall immediately notify the licensed offender of the cancellation in writing, by depositing in the United States post office a notice addressed to the licensed offender at the licensed offender's last known address, with postage prepaid thereon.\nWithin ten days of receiving notice that a Head Start bus driver has committed a crime against a minor, the commissioner shall permanently cancel the passenger endorsement on the offender's driver's license. Upon canceling the offender's passenger endorsement, the commissioner shall immediately notify the licensed offender of the cancellation in writing, by depositing in the United States post office a notice addressed to the licensed offender at the licensed offender's last known address, with postage prepaid thereon. For purposes of this subdivision, \"crime against a minor\" means an act committed against a minor victim that constitutes a violation of section 609.185, 609.19, 609.195, 609.20, 609.205, 609.2112, subdivision 1, 609.2114, subdivision 1, 609.221, 609.222, 609.223, 609.342, 609.343, 609.344, 609.345, 609.352 or Minnesota Statutes 2012, section 609.21, subdivision 1a, paragraph (a), or a felony violation of section 609.322, 609.324, or 609.377.\nBefore issuing or renewing a driver's license with a school bus driver's endorsement, the commissioner shall conduct an investigation to determine if the applicant has been convicted of committing a disqualifying offense, four moving violations in the previous three years, a violation of section 169A.20 or a similar statute or ordinance from another state, a gross misdemeanor, or if the applicant's driver's license has been revoked under section 169A.52 or 171.177. The commissioner shall not issue a new bus driver's endorsement and shall not renew an existing bus driver's endorsement if the applicant has been convicted of committing a disqualifying offense. The commissioner shall not issue a new bus driver's endorsement and shall not renew an existing bus driver's endorsement if, within the previous five years, the applicant has been convicted of committing a violation of section 169A.20, or a similar statute or ordinance from another state, a gross misdemeanor, or if the applicant's driver's license has been revoked under section 169A.52 or 171.177, or if, within the previous three years, the applicant has been convicted of four moving violations. An applicant who has been convicted of violating section 169A.20, or a similar statute or ordinance from another state, or who has had a license revocation under section 169A.52 or 171.177 within the previous ten years must show proof of successful completion of an alcohol or controlled substance treatment program in order to receive a bus driver's endorsement. For a first offense, proof of completion is required only if treatment was ordered as part of a chemical use assessment. A school district or contractor that employs a nonresident school bus driver must conduct a background check of the employee's driving record and criminal history in both Minnesota and the driver's state of residence. Convictions for disqualifying offenses, gross misdemeanors, a fourth moving violation within the previous three years, or violations of section 169A.20, or a similar statute or ordinance in another state, must be reported to the Department of Public Safety.\n(a) The commissioner of public safety or the commissioner's designee, in consultation with the Division of Driver and Vehicle Services, may waive the permanent cancellation requirement of this section for a person convicted of a misdemeanor, a gross misdemeanor, a nonfelony violation of chapter 152, or a felony that is not a violent crime under section 609.1095.\n(b) After notice to the requesting school district and contract provider of school bus transportation, the commissioner may waive the permanent cancellation requirement after ten years have elapsed since the person was convicted of a violation of section 609.582, subdivision 2, 3, or 4.",
	"repealed": false
}