{
	"id": "53.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/53.10",
	"title": "53.10 MANDATORY INSURANCE OF ACCOUNTS.",
	"text": "Not later than July 1, 1987, every industrial loan and thrift company operating under this chapter with consent or holding a certificate of authorization, which includes the right to sell and issue for investment certificates of indebtedness, savings accounts, and savings deposits, shall obtain a commitment for insurance or guarantee of the certificates, accounts, or deposits by the Federal Deposit Insurance Corporation, an agency of this state, or a federal agency established for the purpose of insuring deposits in banks or otherwise eligible to insure the savings accounts and savings deposits in industrial loan and thrift companies operating pursuant to this chapter.\nThe commissioner of commerce shall grant additional time or times to obtain the commitment for insurance or guarantee upon satisfactory evidence that the industrial loan and thrift company has made or is making a substantial effort to achieve the conditions precedent to issuance of the commitment. Additional time or times shall not extend later than July 1, 1988.\nNo industrial loan and thrift company shall hereafter be granted consent, or issued a certificate of authorization which includes the right to issue for investment certificates of indebtedness, savings accounts, and savings deposits unless the industrial loan and thrift company has obtained a commitment for insurance or guarantee of such certificates which meets the conditions of subdivision 1.\nUntil the time the requirements of subdivisions 1 and 2 are fully satisfied, any existing insurance or guarantee approved by the commissioner of commerce pursuant to Laws 1980, chapter 503, section 3, must be maintained as a condition to continued operations. Thereafter every industrial loan and thrift company shall at all times maintain in effect insurance of its accounts by the Federal Deposit Insurance Corporation, an agency of this state or a federal agency established for the purpose of insuring deposits in banks or otherwise eligible to insure the accounts of industrial loan and thrift companies operating pursuant to this chapter. If it appears to the commissioner that an industrial loan and thrift company has failed to meet the requirements of this section, the commissioner shall issue an order pursuant to sections 46.24 to 46.33 requiring compliance or the noncompliant industrial loan and thrift company to cease and desist from accepting savings or deposit accounts and submit a plan to the commissioner for the orderly and timely divestiture of all existing savings and deposit accounts.",
	"repealed": false
}