{
	"id": "97A.401",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.401",
	"title": "97A.401 SPECIAL PERMITS.",
	"text": "The commissioner may issue special permits for the activities in this section. A special permit may be issued in the form of a general permit to a governmental subdivision or to the general public to conduct one or more activities under subdivisions 2 to 9.\nSpecial permits may be issued without a fee to municipalities, incorporated natural history societies, high schools, colleges, and universities that maintain a zoological collection, to collect specimens of eggs, nests, and wild animals for scientific or exhibition purposes.\n(a) Except as provided in paragraph (b), special permits may be issued without a fee to take, possess, and transport wild animals as pets and for scientific, educational, rehabilitative, wildlife disease prevention and control, and exhibition purposes. The commissioner shall prescribe the conditions for taking, possessing, transporting, and disposing of the wild animals.\n(b) A special permit may not be issued to take or possess wild or native deer for exhibition, propagation, or as pets.\n(c) Nonresident professional wildlife rehabilitators with a federal rehabilitation permit may possess and transport wildlife affected by oil spills.\nSpecial permits may be issued, with or without a fee, to take a wild animal from game refuges, wildlife management areas, state parks, controlled hunting zones, and other areas of the state that the commissioner may open for the taking of a wild animal during a special season or subject to special restrictions. In addition, an application fee may be charged for a special permit. Local units of government may charge an administrative fee in connection with special hunts under their jurisdiction. Fees to be collected shall be based upon the estimated cost of conducting the special season or administering the special restrictions.\nSpecial permits may be issued with or without a fee to take protected wild animals or to remove or destroy their dens, nests, eggs, houses, or dams for the purpose of preventing or reducing damage or injury to people, property, agricultural crops, or other interests. The commissioner may prescribe rules for taking Canada geese and their nests and eggs, with or without a permit, consistent with federal regulations.\nSpecial permits may be issued with or without a fee to take muskrats in danger of freezing out or starving in the winter.\nThe commissioner shall prescribe conditions and may issue permits for persons to breed, propagate, and sell raptors.\nThe commissioner must prescribe conditions and may issue permits to breed, propagate, and sell snakes, lizards, and salamanders. A snake, lizard, or salamander that is obtained from a permitted breeder or that was possessed before August 1, 2021, may be possessed as a pet.\nThe commissioner must prescribe conditions for and may issue a permit to a person for taking wild animals during activities covered under a federal incidental take permit issued under section 10(a)(1)(B) of the federal Endangered Species Act, including to a landowner for taking wild animals during activities covered by a certificate of inclusion issued by the commissioner under Code of Federal Regulations, title 50, section 13.25(e).",
	"repealed": false
}