{
	"id": "79.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.62",
	"title": "79.62 DATA SERVICE ORGANIZATIONS; LICENSING, EXAMINATION.",
	"text": "No data service organization shall provide any service and no insurer shall use the services of a data service organization unless the organization is licensed by the commissioner.\nA data service organization shall apply for a license in a form and manner prescribed by the commissioner. The application of a data service organization shall include:\n(1) a copy of its constitution, articles of incorporation, bylaws, and other rules pertaining to the conduct of its business;\n(2) a plan and narrative describing how it will perform the activities required by section 79.61;\n(3) a statement showing its technical qualifications; and\n(4) any other information that the commissioner may reasonably require.\nThe commissioner may appoint two representatives of employers to serve on the board of directors of each licensed data service organization. These directors serve for a term of two years and are entitled to vote on all matters under consideration.\nThe commissioner, upon finding that the applicant organization is qualified to provide the services required and proposed, or has contracted with a licensed data service organization to purchase these services which are required by this chapter but are not provided directly by the applicant, and that all requirements of law are met, shall issue a license. Each license is subject to annual renewal effective June 30. Each new or renewal license application must be accompanied by a fee of $1,000.\nThe commissioner may, after a hearing on the record, revoke or suspend the license of a data service organization if the commissioner finds that the organization is not in compliance with the requirements of this chapter or rules issued thereunder.\nThe commissioner may examine any licensed data service organization or applicant for this license to determine whether its activities and practices comply with law. The cost of the examination shall be paid by the examined organization pursuant to section 60A.03.",
	"repealed": false
}