{
	"id": "462A.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.051",
	"title": "462A.051 WAGE THEFT PREVENTION AND USE OF RESPONSIBLE CONTRACTORS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Project sponsor\" means an individual, legal entity, or nonprofit board that exercises control, financial responsibility, and decision-making authority over a housing development.\n(c) \"Developer\" means an individual, legal entity, or nonprofit board that is responsible for the coordination of financing and building of a housing development.\n(c) \"Funding\" means all forms of financial assistance or the allocation or award of federal low-income housing tax credits.\nThis section applies to all forms of financial assistance provided by the Minnesota Housing Finance Agency, as well as the allocation and award of federal low-income housing credits, for the development, construction, rehabilitation, renovation, or retrofitting of multiunit residential housing, including loans, grants, tax credits, loan guarantees, loan insurance, and other financial assistance.\nAn applicant for funding under this chapter shall disclose in the application any conviction, court judgment, agency determination, legal settlement, ongoing criminal or civil investigation, or lawsuit involving alleged violations of sections 177.24, 177.25, 177.32, 177.41 to 177.44, 181.03, 181.101, 181.13, 181.14, 181.722, 181.723, 181A.01 to 181A.12, or 609.52, subdivision 2, paragraph (a), clause (19), or United States Code, title 29, sections 201 to 219, or title 40, sections 3141 to 3148, arising or occurring within the preceding five years on a construction project owned or managed by the developer, project sponsor, or owner of the proposed project, the intended general contractor for the proposed project, or any of their respective parent companies, subsidiaries, or other affiliated companies. An applicant for funding shall make the disclosures required by this subdivision available within 14 calendar days to any member of the public who submits a request by mail or electronic correspondence. The applicant shall designate a public information officer who will serve as a point of contact for public inquiries.\nAs a condition of receiving funding from the agency during the application process, the project sponsor shall verify that every contractor or subcontractor of any tier performing work on the proposed project meets the minimum criteria to be a responsible contractor under section 16C.285, subdivision 3. This verification must meet the criteria defined in section 16C.285, subdivision 4.\nAs a condition of receiving funding, the project applicant shall have available at the development site main office, a list of every contractor and subcontractor of any tier that performs work or is expected to perform work on the proposed project, as described in section 16C.285, subdivision 5, including the following information for each contractor and subcontractor: business name, scope of work, Department of Labor and Industry registration number, business name of the entity contracting its services, business telephone number and email address, and actual or anticipated number of workers on the project. The project sponsor shall establish the initial contractor list 30 days before the start of construction and shall update the list each month thereafter until construction is complete. The project sponsor shall post the contractor list in a conspicuous location at the project site and make the contractor list available to members of the public upon request.\nIf any contractor or subcontractor of any tier is found to have failed to pay statutorily required wages under section 609.52, subdivision 1, clause (13), on a project receiving funding from or through the agency, the contractor or subcontractor with the finding is responsible for correcting the violation.\n(a) If any contractor or subcontractor of any tier fails to pay statutorily required wages on a project receiving funding from or through the agency as determined by an enforcement entity, the project sponsor of the project must have a wage theft prevention plan to be eligible for further funding from the agency. The project sponsor's wage theft prevention plan must describe detailed measures that the project sponsor and its general contractor have taken and are committed to take to prevent wage theft on the project, including provisions in any construction contracts and subcontracts on the project. The plan must be submitted to the Department of Labor and Industry for review. The Department of Labor and Industry may require the project sponsor to amend the plan or adopt policies or protocols in the plan. Once approved by the Department of Labor and Industry, the wage theft prevention plan must be submitted by the project sponsor to the agency with any subsequent application for funding from the agency. Such wage theft prevention plans shall be made available to members of the public by the agency upon request.\n(b) A project sponsor is disqualified from receiving funding from or through the agency for three years if any of the project sponsor's contractors or subcontractors of any tier are found by an enforcement agency to have, within three years after entering into a wage theft prevention plan under paragraph (a), failed to pay statutorily required wages on a project receiving financial assistance from or through the agency for a total underpayment of $50,000 or more.\nThe agency must deny an application for funding that does not comply with this section or if the project sponsor refuses to enter into the agreements required by this section. The agency may withhold funding that has been previously approved if the agency determines that the project sponsor has engaged in unacceptable practices by failing to comply with this section until the violation is cured.",
	"repealed": false
}