{
	"id": "41A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.03",
	"title": "41A.03 LOAN GUARANTIES.",
	"text": "Subject to the provisions of sections 41A.01 to 41A.06 and upon determination that a loan will serve the public purposes and satisfy the conditions set forth in sections 41A.01 to 41A.06, the state may guarantee and commit to guarantee against loss an amount not exceeding 90 percent, exclusive of accrued interest, of a loan for the cost of an agricultural resource project or the refunding or refinancing of a loan. The loan must be secured by the best available collateral including but not limited to a mortgage on and security interest in all real and personal property comprising the project and other collateral as provided in the loan agreement.\nThe total principal amount of any guaranteed loan may not exceed 80 percent of the total cost of the related project as estimated by the state at the time the commitment to guarantee is made or, in the case of a refunding or refinancing loan, 80 percent of the aggregate amount of principal and interest refunded or refinanced. If the actual cost exceeds the estimate the state may, upon request of the borrower and the lender, consent to an increase of the loan by a principal amount not greater than 80 percent of the excess cost, and may increase the guaranteed amount by not more than 90 percent of the increase in the principal amount, and accrued interest on that amount.\nA loan guaranty or loan agreement pertaining to any loan guaranteed by the state may provide that:\n(a) Payments of principal and interest made by the borrower under the loan shall be applied by the lender to reduce the guaranteed and nonguaranteed portion of the loan on a proportionate basis, and the nonguaranteed portion shall not in any event receive preferential treatment over the guaranteed portion.\n(b) A period of grace shall be allowed of not less than 60 days from a date a principal or interest payment is due, prior to the making of demand for payment pursuant to the loan guaranty, to permit adequate time for a decision on behalf of the state regarding principal and interest assistance in accordance with subdivision 4. Payment as required by the loan guaranty shall be made within 60 days after receipt by the state of written demand complying with the terms and conditions of the guaranty.\n(c) The lender may not accelerate repayment of the loan or exercise other remedies available to the lender if the borrower defaults, unless (i) the borrower fails to pay a required payment of principal or interest, or (ii) the state consents in writing, or (iii) as otherwise permitted in the loan guaranty. In the event of a default, the lender may not make demand for payment pursuant to the guaranty unless the state agrees in writing that such default has materially affected the rights or security of the parties, and finds that the lender should be entitled to receive payment pursuant to the loan guaranty.\n(d) If a payment of principal or interest is made by the state upon default of the borrower, the state shall be subrogated to the rights of the lender with respect to the payment.\n(e) The borrower shall have promptly prepared and delivered to the state annual audited or reviewed financial statements of the project prepared by a certified public accountant according to generally accepted accounting principles.\n(f) Duly authorized representatives of the state shall have access to the project site at reasonable times during construction and operation of the project.\n(g) The borrower shall maintain adequate records and documents concerning the construction and operation of the project in order that representatives of the state may determine its technical and financial conditions and its compliance with environmental requirements. The records shall include the amounts of all sales and use taxes paid on personal property and services purchased for the construction and operation of the project, with tax receipts furnished by the sellers or other supporting documentation determined by the board to be satisfactory. The amounts of those taxes shall be reported to the board in the manner and at the times required by the board.\n(h) The borrower shall protect and preserve at all times the project assets and other collateral securing the loan and shall assist in liquidation of collateral to minimize loss in the event of default.\n(i) Orderly liquidation of assets of the project shall be provided for in the event of default, with an option on the part of the state to acquire from the lender the lender's interest in the assets pursuant to the nonguaranteed portion of the loan.\n(j) The state shall be paid at or prior to the closing of the guaranteed loan a fee or fees for the loan guaranty or the commitment to guarantee the loan. The aggregate fee may not exceed one percent of the total principal amount of the guaranteed portion of the loan.\n(k) The lender shall perfect and maintain the mortgage lien on the real estate and the security interest in personal property and collateral granted as security for the loan, and shall cause all other loan servicing functions to be performed which are normally required or performed by a reasonable and prudent lender with respect to a loan without a guaranty.\n(l) The state shall be notified in writing without delay of (i) the date and amount of and basis for each disbursement of loan proceeds; (ii) any nonpayment of principal or interest due; (iii) any failure to honor a commitment by any person of an intended source of capital for the project; and (iv) any significant adverse changes from original cash flow projections as evidenced by reports from the borrower, or any other known evidence that the borrower might be unable to meet a future scheduled payment of principal or interest.\n(m) The loan agreement shall require the borrower to establish a reserve, from the proceeds of the loan or otherwise, to be maintained with the lender or with a trustee for the holders of the borrower's obligations in cash or securities of a specified market value not less than one-half of the annual amount which would be required to amortize the entire amount of the loan over the term and at the interest rate (or at the rate of yield resulting from the interest rates) provided in the loan agreement.\n(n) The agreement shall contain other terms and conditions that the board in its sole discretion determines necessary and appropriate to carry out the purposes of this chapter.\nThe state may at any time enter into a written contract with the borrower to pay the lender, on behalf of the borrower, an amount not greater than the amount of principal and interest to become due on one or more subsequent dates, without acceleration, if the state determines that (i) the borrower is not in default in payment of principal or interest due more than 60 days prior to the date of the contract; (ii) the borrower is or may become unable to meet in full principal or interest payments, or both, which are due or to become due within a specified period; (iii) it is in the public interest to permit the borrower to continue to pursue the purposes of the project; (iv) the probable net financial loss to the state will be less than that which would result in the event of a default; (v) the borrower is obligated by the contract to reimburse the state for all principal or interest advanced, with interest on those amounts, upon terms and conditions satisfactory to the state; and (vi) funds are available for allocation to the account established for the project in the guaranty fund, and are continuously allocated to the account in accordance with the provisions of section 4, subdivision 3, in an amount equal to the amount of interest on the advances until actually reimbursed to the state by the borrower. All sums so advanced and interest on those amounts shall be secured by the mortgage lien and security interest granted by the loan agreement, but none of the advances shall thereafter be repaid to the state until and unless all principal and interest currently due on the loan has been fully paid. In the event of subsequent default by the borrower, acceleration by the lender, and payment by the state of the full amount due under the loan guaranty, the state shall be subrogated to the rights of the lender with respect to the principal paid by it under the contract. Upon payment of the loan in full, with accrued interest, the remaining amount of the advances and interest on the advances may be paid to the state.\nThe liability of the state for loan guaranties or bonds authorized under this chapter is limited to the amount of funds appropriated to the guaranty fund pursuant to section 41A.06. The legislature intends not to appropriate money from the general fund to the guaranty fund, other than the sales and use taxes from a project as provided for in section 41A.06, subdivision 4. The loan guaranties or bonds are not a general obligation or debt of the state.",
	"repealed": false
}