{
	"id": "611A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.02",
	"title": "611A.02 NOTIFICATION OF VICTIM SERVICES AND VICTIMS' RIGHTS.",
	"text": "[Repealed, 2014 c 212 art 1 s 15]\n(a) The Office of Justice Programs in the Department of Public Safety shall update the two model notices of the rights of crime victims.\n(b) The initial notice of the rights of crime victims must be distributed by a peace officer to each victim, as defined in section 611A.01, at the time of initial contact with the victim. The notice must inform a victim of:\n(1) the victim's right to apply for reparations to cover losses, not including property losses, resulting from a violent crime and the telephone number to call to request an application;\n(2) the victim's right to request that the law enforcement agency withhold public access to data revealing the victim's identity under section 13.82, subdivision 17, paragraph (d);\n(3) the additional rights of domestic abuse victims as described in section 629.341;\n(4) information on the nearest crime victim assistance program or resource;\n(5) the victim's rights, if an offender is charged, to be informed of and participate in the prosecution process, including the right to request restitution; and\n(6) in homicide cases, information on rights and procedures available under sections 524.2-803, 524.3-614, and 524.3-615.\n(c) A supplemental notice of the rights of crime victims must be distributed by the city or county attorney's office to each victim, within a reasonable time after the offender is charged or petitioned. This notice must inform a victim of all the rights of crime victims under this chapter.\n(a) The Office of Justice Programs in the Department of Public Safety shall update the notice of the rights of victims in juvenile court that explains:\n(1) the rights of victims in the juvenile court;\n(2) when a juvenile matter is public;\n(3) the procedures to be followed in juvenile court proceedings; and\n(4) other relevant matters.\n(b) The juvenile court shall distribute a copy of the notice to each victim of juvenile crime who attends a juvenile court proceeding, along with a notice of services for victims available in that judicial district.",
	"repealed": false
}