{
	"id": "268.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.085",
	"title": "268.085 ELIGIBILITY REQUIREMENTS; PAYMENTS THAT AFFECT BENEFITS.",
	"text": "An applicant may be eligible to receive unemployment benefits for any week if:\n(1) the applicant has filed a continued request for unemployment benefits for that week under section 268.0865;\n(2) the week for which unemployment benefits are requested is in the applicant's benefit year;\n(3) the applicant was unemployed as defined in section 268.035, subdivision 26;\n(4) the applicant was available for suitable employment as defined in subdivision 15. The applicant's weekly unemployment benefit amount is reduced one-fifth for each day the applicant is unavailable for suitable employment. This clause does not apply to an applicant who is in reemployment assistance training, or each day the applicant is on jury duty or serving as an election judge;\n(5) the applicant was actively seeking suitable employment as defined in subdivision 16. This clause does not apply to an applicant who is in reemployment assistance training or who was on jury duty throughout the week;\n(6) the applicant has served a nonpayable period of one week that the applicant is otherwise eligible for some amount of unemployment benefits. This clause does not apply if the applicant would have been eligible for federal disaster unemployment assistance because of a disaster in Minnesota, but for the applicant's establishment of a benefit account under section 268.07; and\n(7) the applicant has been participating in reemployment assistance services, such as development of, and adherence to, a work search plan, if the applicant has been directed to participate by the commissioner. This clause does not apply if the applicant has good cause for failing to participate. \"Good cause\" is a reason that would have prevented a reasonable person acting with due diligence from participating.\nAn applicant is ineligible for unemployment benefits for any week:\n(1) that occurs before the effective date of a benefit account;\n(2) that the applicant, at any time during the week, has an outstanding misrepresentation overpayment balance under section 268.18, subdivision 2, including any penalties and interest;\n(3) that the applicant is incarcerated or performing court-ordered community service. The applicant's weekly unemployment benefit amount is reduced by one-fifth for each day the applicant is incarcerated or performing court-ordered community service;\n(4) that the applicant fails or refuses to provide information on an issue of ineligibility required under section 268.101;\n(5) that the applicant is performing services 32 hours or more, in employment, covered employment, noncovered employment, volunteer work, or self-employment regardless of the amount of any earnings; or\n(6) with respect to which the applicant has filed an application for unemployment benefits under any federal law or the law of any other state. If the appropriate agency finally determines that the applicant is not entitled to establish a benefit account under federal law or the law of any other state, this clause does not apply.\n(a) An applicant is not eligible to receive unemployment benefits for any week the applicant is receiving, has received, or will receive vacation pay, sick pay, or personal time off pay, also known as \"PTO.\"\nThis paragraph does not apply:\n(1) upon a permanent separation from employment; or\n(2) to payments from a vacation fund administered by a union or a third party not under the control of the employer.\n(b) Payments under this subdivision are applied to the period immediately following the later of the date of separation from employment or the date the applicant first becomes aware that the employer will be making a payment. The date the payment is actually made or received, or that an applicant must agree to a release of claims, does not affect the application of this subdivision.\n(c) This subdivision applies to all the weeks of payment. The number of weeks of payment is determined as follows:\n(1) if the payments are made periodically, the total of the payments to be received is divided by the applicant's last level of regular weekly pay from the employer; or\n(2) if the payment is made in a lump sum, that sum is divided by the applicant's last level of regular weekly pay from the employer.\nThe \"last level of regular weekly pay\" includes commissions, bonuses, and overtime pay if that is part of the applicant's ongoing regular compensation.\n(d) Under this subdivision, if the payment with respect to a week is equal to or more than the applicant's weekly unemployment benefit amount, the applicant is ineligible for benefits for that week. If the payment with respect to a week is less than the applicant's weekly unemployment benefit amount, unemployment benefits are reduced by the amount of the payment.\n(a) An applicant is not eligible to receive unemployment benefits for any week in which the applicant is receiving or has received compensation for loss of wages equal to or in excess of the applicant's weekly unemployment benefit amount under:\n(1) the workers' compensation law of this state;\n(2) the workers' compensation law of any other state or similar federal law; or\n(3) any insurance or trust fund paid in whole or in part by an employer.\n(b) This subdivision does not apply to an applicant who has a claim pending for loss of wages under paragraph (a); however, before unemployment benefits may be paid when a claim is pending, the issue of the applicant being available for suitable employment, as required under subdivision 1, clause (4), must be determined under section 268.101, subdivision 2. If the applicant later receives compensation as a result of the pending claim, the applicant is subject to paragraph (a) and the unemployment benefits paid are overpaid unemployment benefits under section 268.18, subdivision 1.\n(c) If the amount of compensation described under paragraph (a) for any week is less than the applicant's weekly unemployment benefit amount, unemployment benefits requested for that week are reduced by the amount of that compensation payment.\n(a) An applicant is not eligible to receive unemployment benefits for any week the applicant is receiving, has received, or will receive separation pay, severance pay, bonus pay, or any other payments paid by an employer because of, upon, or after separation from employment. This subdivision applies if the payment is:\n(1) considered wages under section 268.035, subdivision 29; or\n(2) subject to the Federal Insurance Contributions Act (FICA) tax imposed to fund Social Security and Medicare.\n(b) Payments under this subdivision are applied to the period immediately following the later of the date of separation from employment or the date the applicant first becomes aware that the employer will be making a payment. The date the payment is actually made or received, or that an applicant must agree to a release of claims, does not affect the application of this paragraph.\n(c) This subdivision does not apply to earnings under subdivision 5, back pay under subdivision 6, or vacation pay, sick pay, or personal time off pay under subdivision 3.\n(d) This subdivision applies to all the weeks of payment. The number of weeks of payment is determined in accordance with subdivision 3, paragraph (c).\n(e) Under this subdivision, if the payment with respect to a week is equal to or more than the applicant's weekly unemployment benefit amount, the applicant is ineligible for benefits for that week. If the payment with respect to a week is less than the applicant's weekly unemployment benefit amount, unemployment benefits are reduced by the amount of the payment.\n(a) An applicant is not eligible to receive unemployment benefits for any week the applicant is receiving, has received, will receive, or has applied for pension, retirement, or annuity payments from any plan contributed to by a base period employer including the United States government. The base period employer is considered to have contributed to the plan if the contribution is excluded from the definition of wages under section 268.035, subdivision 29.\n(b) If the pension, retirement, or annuity payment is paid in a lump sum, an applicant is not considered to have received a payment if:\n(1) the applicant immediately deposits that payment in a qualified pension plan or account; or\n(2) that payment is an early distribution for which the applicant paid an early distribution penalty under the Internal Revenue Code, United States Code, title 26, section 72(t)(1).\n(c) This subdivision does not apply to Social Security benefits under subdivision 4 or 4a.\n(d) This subdivision applies to all the weeks of payment.\nIf the payment is made in a lump sum, that sum is divided by the applicant's last level of regular weekly pay from the employer to determine the weeks of payment.\nThe \"last level of regular weekly pay\" includes commissions, bonuses, and overtime pay if that is part of the applicant's ongoing regular compensation.\n(e) Under this subdivision, if the payment with respect to a week is equal to or more than the applicant's weekly unemployment benefit amount, the applicant is ineligible for benefits for that week. If the payment with respect to a week is less than the applicant's weekly unemployment benefit amount, unemployment benefits are reduced by the amount of the payment.\nMS 2021 [Repealed, 1Sp2021 c 10 art 4 s 9]\n(a) An applicant who is receiving, has received, or has filed for primary Social Security disability benefits for any week is ineligible for unemployment benefits for that week, unless:\n(1) the Social Security Administration approved the collecting of primary Social Security disability benefits each month the applicant was employed during the base period; or\n(2) the applicant provides a statement from an appropriate health care professional who is aware of the applicant's Social Security disability claim and the basis for that claim, certifying that the applicant is available for suitable employment.\n(b) If an applicant meets the requirements of paragraph (a), clause (1) or (2), there is no deduction from the applicant's weekly benefit amount for any Social Security disability benefits.\n(c) Information from the Social Security Administration is conclusive, absent specific evidence showing that the information was erroneous.\n(d) This subdivision does not apply to Social Security survivor benefits.\n(a) If the applicant has earnings, including holiday pay, with respect to any week, from employment, covered employment, noncovered employment, self-employment, or volunteer work, equal to or in excess of the applicant's weekly unemployment benefit amount, the applicant is ineligible for unemployment benefits for that week.\n(b) If the applicant has earnings, including holiday pay, with respect to any week, that is less than the applicant's weekly unemployment benefit amount, from employment, covered employment, noncovered employment, self-employment, or volunteer work, 50 percent of the earnings are deducted from the weekly unemployment benefit amount.\n(c) No deduction is made from an applicant's weekly unemployment benefit amount for earnings from service in the National Guard or a United States military reserve unit or from direct service as a volunteer firefighter or volunteer ambulance service personnel. This exception to paragraphs (a) and (b) does not apply to on-call or standby pay provided to a volunteer firefighter or volunteer ambulance service personnel. No deduction is made for jury duty pay or for pay as an election judge.\n(d) The applicant may report deductible earnings on continued requests for unemployment benefits at the next lower whole dollar amount.\n(e) Deductible earnings does not include any money that is a deductible payment under subdivision 3.\n(a) Back pay received by an applicant within 24 months of the establishment of the benefit account with respect to any week must be deducted from unemployment benefits paid for that week, and the applicant is overpaid the unemployment benefits under section 268.18, subdivision 1.\nIf the back pay is not paid with respect to a specific period, the back pay must be applied to the period immediately following the last day of employment.\n(b) If the back pay is reduced by the amount of unemployment benefits that have been paid, the amount of back pay withheld and not paid the applicant must be:\n(1) paid by the taxpaying or reimbursing employer to the trust fund within 30 calendar days and is subject to the same collection procedures that apply to past due taxes and reimbursements; and\n(2) when received by the trust fund:\n(i) an overpayment of unemployment benefits must be created which, under section 268.047, subdivision 2, clause (8), clears the employer's tax or reimbursable account of any effect; and\n(ii) the back pay must then be applied to the unemployment benefit overpayment, eliminating any effect on the applicant.\n(c) The following must result when applying paragraph (b):\n(1) an employer neither overpays nor underpays the employer's proper portion of the unemployment benefit costs; and\n(2) the applicant is placed in the same position as never having been paid the unemployment benefits.\n(d) This subdivision applies to payments labeled front pay, settlement pay, and other terms describing or dealing with wage loss.\n(a) Wage credits from employment with an educational institution or institutions may not be used for unemployment benefit purposes for any week during the period between two successive academic years or terms if:\n(1) the applicant had employment for an educational institution or institutions in the prior academic year or term; and\n(2) there is a reasonable assurance that the applicant will have employment for an educational institution or institutions in the following academic year or term.\nThis paragraph applies to the period between two regular but not successive terms if there is an agreement for that schedule between the applicant and the educational institution.\nThis paragraph does not apply if the subsequent employment is substantially less favorable than the employment of the prior academic year or term, or the employment prior to the vacation period or holiday recess.\n(b) Paragraph (a) does not apply to any week during the period between two successive academic years or terms if an applicant worked in a capacity other than instructional, research, or principal administrative capacity.\n(c) Paragraph (a) applies to a vacation period or holiday recess if the applicant was employed immediately before the vacation period or holiday recess, and there is a reasonable assurance that the applicant will be employed immediately following the vacation period or holiday recess, including applicants who worked in a capacity other than instructional, research, or principal administrative capacity.\n(d) This subdivision applies to employment with an educational service agency if the applicant performed the services at an educational institution or institutions. \"Educational service agency\" means a governmental entity established and operated for the purpose of providing services to one or more educational institutions.\n(e) This subdivision applies to employment with Minnesota, a political subdivision, or a nonprofit organization, if the services are provided to or on behalf of an educational institution or institutions.\n(f) Paragraph (a) applies beginning the Sunday of the week that there is a reasonable assurance of employment.\n(g) Employment and a reasonable assurance with multiple education institutions must be aggregated for purposes of application of this subdivision.\n(h) If all of the applicant's employment with any educational institution or institutions during the prior academic year or term consisted of on-call employment, and the applicant has a reasonable assurance of any on-call employment with any educational institution or institutions for the following academic year or term, it is not considered substantially less favorable employment.\n(i) A \"reasonable assurance\" may be written, oral, implied, or established by custom or practice.\n(j) An \"educational institution\" is a school, college, university, or other educational entity operated by Minnesota, a political subdivision or instrumentality thereof, or a nonprofit organization.\n(k) An \"instructional, research, or principal administrative capacity\" does not include an educational assistant.\nMS 2022 [Repealed, 2023 c 55 art 1 s 37]\n(a) Wage credits from an employer may not be used for unemployment benefit purposes by any applicant who:\n(1) individually, jointly, or in combination with the applicant's spouse, parent, or child owns or controls directly or indirectly 25 percent or more interest in the employer; or\n(2) is the spouse, parent, or minor child of any individual who owns or controls directly or indirectly 25 percent or more interest in the employer.\nThis subdivision is effective when the applicant has been paid five times the applicant's weekly unemployment benefit amount in the current benefit year. This subdivision does not apply if the applicant had wages paid in covered employment of $7,500 or more from the employer covered by this subdivision in each of the 16 calendar quarters prior to the effective date of the benefit account and all taxes due on those wages have been paid.\n(b) An officer of a taxpaying employer referred to in section 268.046, subdivision 1, is subject to the limitations of this subdivision.\n[Repealed, 2007 c 128 art 1 s 23]\n(a) Unemployment benefits must not be paid to an applicant on the basis of any wage credits from employment that consists of coaching or participating in sports or athletic events or training or preparing to participate for any week during the period between two successive sport seasons, or similar periods, if:\n(1) the applicant was so employed in the prior season or similar period, and\n(2) there is a reasonable assurance that the applicant will be so employed in the following season or similar period.\n(b) This subdivision applies to a coach employed by an educational institution whose only employment with the educational institution is as a coach. Subdivision 7 applies to a coach who has other employment with an educational institution in addition to coaching at the educational institution. Employment with multiple educational institutions, or employment coaching multiple sports, must be aggregated for purposes of application of this subdivision.\n(a) An alien is ineligible for unemployment benefits for any week the alien is not authorized to work in the United States under federal law. Information from the Bureau of Citizenship and Immigration Services is conclusive, absent specific evidence that the information was erroneous. Under the existing agreement between the United States and Canada, this paragraph does not apply to an applicant who is a Canadian citizen and has returned to and is living in Canada each week unemployment benefits are requested.\n(b) An alien's wage credits may not be used for unemployment benefit purposes unless the alien was:\n(1) lawfully admitted for permanent residence at the time of the employment;\n(2) lawfully present for the purposes of the employment; or\n(3) permanently residing in the United States under color of law at the time of the employment.\n(c) Information required of applicants applying for unemployment benefits to determine eligibility because of their alien status must be required of all applicants.\n(a) An applicant who has been suspended from employment without pay for 30 calendar days or less, as a result of employment misconduct or aggravated employment misconduct as defined under section 268.095, is ineligible for unemployment benefits beginning the Sunday of the week that the applicant was suspended and continuing for the duration of the suspension.\n(b) A suspension from employment without pay that is of indefinite duration or is for more than 30 calendar days is considered, at the time the suspension begins, a discharge from employment subject to section 268.095.\n(c) A suspension from employment with pay, regardless of duration, is not a separation from employment and the applicant is ineligible for unemployment benefits for the duration of the suspension with pay.\n(a) An applicant on a voluntary leave of absence is ineligible for unemployment benefits for the duration of the leave of absence. An applicant on an involuntary leave of absence is not ineligible under this subdivision.\nA leave of absence is voluntary when work that the applicant can then perform is available with the applicant's employer but the applicant chooses not to work. A medical leave of absence is not presumed to be voluntary.\n(b) A period of vacation requested by the applicant, paid or unpaid, is a voluntary leave of absence. A vacation period assigned by an employer under: (1) a uniform vacation shutdown; (2) a collective bargaining agreement; or (3) an established employer policy, is an involuntary leave of absence.\n(c) A leave of absence is a temporary stopping of work that has been approved by the employer. A leave of absence is not a quit or a discharge from employment. Section 268.095 does not apply to a leave of absence.\n(d) An applicant who is on a paid leave of absence, whether the leave of absence is voluntary or involuntary, is ineligible for unemployment benefits for the duration of the leave.\n(e) This subdivision applies to a leave of absence from a base period employer, an employer during the period between the end of the base period and the effective date of the benefit account, or an employer during the benefit year.\n(a) An applicant who has stopped working because of a labor dispute at the establishment where the applicant is employed is ineligible for unemployment benefits:\n(1) until the end of the calendar week that the labor dispute was in active progress if the applicant is participating in or directly interested in the labor dispute; or\n(2) until the end of the calendar week that the labor dispute began if the applicant is not participating in or directly interested in the labor dispute.\nParticipation includes any failure or refusal by an applicant, voluntarily or involuntarily, to accept and perform available and customary work at the establishment.\n(b) An applicant who has stopped working because of a jurisdictional controversy between two or more labor organizations at the establishment where the applicant is employed is ineligible for unemployment benefits until the end of the calendar week that the jurisdictional controversy was in progress.\n(c) An applicant is not ineligible for unemployment benefits under this subdivision if:\n(1) the applicant stops working because of an employer's intentional failure to observe the terms of the safety and health section of a union contract or failure to comply with an official citation for a violation of federal or state laws involving occupational safety and health;\n(2) the applicant stops working because of a lockout; or\n(3) the applicant is discharged before the beginning of a labor dispute.\n(d) A quit from employment by the applicant during the time that the labor dispute is in active progress at the establishment does not terminate the applicant's participation in or direct interest in the labor dispute for purposes of this subdivision.\n(e) For the purpose of this subdivision, the term \"labor dispute\" has the same definition as provided in section 179.01, subdivision 7.\n(a) An applicant is ineligible for all unemployment benefits for eight calendar weeks if the applicant, without good cause:\n(1) failed to apply for available, suitable employment of which the applicant was advised by the commissioner or an employer;\n(2) failed to accept suitable employment when offered; or\n(3) avoided an offer of suitable employment.\n(b) \"Good cause\" is a reason that would cause a reasonable individual who wants suitable employment to fail to apply for, accept, or avoid suitable employment. Good cause includes:\n(1) the applicant is employed in other suitable employment;\n(2) the applicant is in reemployment assistance training;\n(3) the applicant formerly worked for the employer and the loss of employment occurred prior to the commencement of a labor dispute, was permanent or for an indefinite period, and the applicant failed to apply for or accept the employment because a labor dispute was in progress at the establishment; or\n(4) the applicant formerly worked for the employer and quit that employment because of a good reason caused by the employer.\n(c) This subdivision only applies to offers of suitable employment with a new or a former employer and does not apply to any type of job transfers, position reassignments, or changes in job duties or responsibilities during the course of employment with an employer.\n(d) The period of ineligibility under this subdivision begins the Sunday of the week the applicant failed to apply for, failed to accept, or avoided suitable employment without good cause.\n(e) This subdivision applies to offers of suitable employment that occur before the effective date of the benefit account and that occur during the benefit year.\n(f) This subdivision only applies to offers of suitable employment that are covered employment under section 268.035, subdivision 12.\n[Repealed, 2009 c 78 art 4 s 51]\n(a) \"Available for suitable employment\" means an applicant is ready, willing, and able to accept suitable employment. The attachment to the work force must be genuine. An applicant may restrict availability to suitable employment, but there must be no other restrictions, either self-imposed or created by circumstances, temporary or permanent, that prevent accepting suitable employment.\n(b) Unless the applicant is in reemployment assistance training, to be \"available for suitable employment,\" a student who has regularly scheduled classes must be willing to discontinue classes to accept suitable employment when:\n(1) class attendance restricts the applicant from accepting suitable employment; and\n(2) the applicant is unable to change the scheduled class or make other arrangements that excuse the applicant from attending class.\n(c) An applicant who is absent from the labor market area for personal reasons, other than to search for work, is not \"available for suitable employment.\"\n(d) An applicant who has restrictions on the hours of the day or days of the week that the applicant can or will work, that are not normal for the applicant's usual occupation or other suitable employment, is not \"available for suitable employment.\" An applicant must be available for daytime employment, if suitable employment is performed during the daytime, even though the applicant previously worked the night shift.\n(a) \"Actively seeking suitable employment\" means those reasonable, diligent efforts an individual in similar circumstances would make if genuinely interested in obtaining suitable employment under the existing conditions in the labor market area. Limiting the search to positions that are not available or are above the applicant's training, experience, and qualifications is not \"actively seeking suitable employment.\"\n(b) To be \"actively seeking suitable employment\" an applicant must, when reasonable, contact those employers from whom the applicant was laid off because of lack of work and request suitable employment.\n(c) If reasonable prospects of suitable employment in the applicant's usual or customary occupation do not exist, the applicant must actively seek other suitable employment to be \"actively seeking suitable employment.\" This applies to an applicant who is seasonally unemployed.\n(d) Actively seeking a suitable job assignment or other employment with a staffing service is actively seeking suitable employment.\n(e) An applicant who is seeking employment only through a union is actively seeking suitable employment if the applicant is in an occupation where hiring in that locality is done through the union. If the applicant is a union member who is restricted to obtaining employment among signatory contractors in the construction industry, seeking employment only with those signatory contractors is actively seeking employment. The applicant must be a union member in good standing, registered with the union for employment, and in compliance with other union rules to be \"actively seeking suitable employment.\"",
	"repealed": false
}