{
	"id": "43A.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.27",
	"title": "43A.27 ELIGIBILITY FOR INDIVIDUAL PAID INSURANCE AND BENEFITS.",
	"text": "Notwithstanding any other provisions of this chapter, the persons listed in subdivisions 2 and 3, and their dependents, may elect to enroll at their own expense in the appropriate life insurance, hospital, medical and dental benefits, and optional coverages at the time, in the manner, and under conditions of eligibility the commissioner prescribes and otherwise approves. The commissioner may also provide for payroll deductions to be made in the same manner and under the same conditions as provided in section 43A.30, subdivision 2, authorizing payroll deductions for an eligible employee and the employee's dependents.\nThe following persons, if not otherwise covered by section 43A.24, may elect coverage for themselves or their dependents at their own expense:\n(1) a state employee, including persons on layoff from a civil service position as provided in collective bargaining agreements or a plan established pursuant to section 43A.18;\n(2) an employee of the Board of Regents of the University of Minnesota, including persons on layoff, as provided in collective bargaining agreements or by the Board of Regents;\n(3) an officer or employee of the State Agricultural Society, State Horticultural Society, Sibley House Association, Minnesota Humanities Center, Minnesota Area Industry Labor Management Councils, Minnesota International Center, Minnesota Academy of Science, Science Museum of Minnesota, Minnesota Safety Council, state Office of Disabled American Veterans, state Office of the American Legion and its auxiliary, state Office of Veterans of Foreign Wars and its auxiliary, or state Office of the Military Order of the Purple Heart;\n(4) a civilian employee of the adjutant general who is paid from federal funds and who is not eligible for benefits from any federal civilian employee group life insurance or health benefits program;\n(5) an officer or employee of the State Capitol Credit Union or the Highway Credit Union; and\n(6) an employee of the joint underwriting association pursuant to section 62I.121 or Minnesota FAIR plan pursuant to section 65A.35, subdivision 5, unless the commissioner determines that making these employees eligible to purchase this coverage would cause the state employee group insurance program to lose its status as a governmental plan or would cause the program to be treated as a multiemployer welfare arrangement.\n(a) A person may elect to purchase at personal expense individual and dependent hospital, medical, and dental coverages if the person is:\n(1) a retired employee of the state or an organization listed in subdivision 2 or section 43A.24, subdivision 2, who, at separation of service:\n(i) is immediately eligible to receive a retirement benefit under chapter 354B or an annuity under a retirement program sponsored by the state or such organization of the state;\n(ii) immediately meets the age and service requirements in section 352.115, subdivision 1; and\n(iii) has five years of service or meets the service requirement of the collective bargaining agreement or plan, whichever is greater; or\n(2) a retired employee of the state who is at least 50 years of age and has at least 15 years of state service.\n(b) The commissioner shall offer at least one plan which is actuarially equivalent to those made available through collective bargaining agreements or plans established under section 43A.18 to employees in positions equivalent to that from which retired.\n(c) A spouse of a person eligible under paragraph (a) may purchase the coverage listed in this subdivision if the spouse was a dependent under the retired employee's coverage at the time of the retiree's death.\n(d) Coverages must be coordinated with relevant health insurance benefits provided through the federally sponsored Medicare program. Until the retired employee reaches age 65, the retired employee and dependents must be pooled in the same group as active employees for purposes of establishing premiums and coverage for hospital, medical, and dental insurance. Coverage for retired employees and their dependents may not discriminate on the basis of evidence of insurability or preexisting conditions unless identical conditions are imposed on active employees in the group that the employee left. Appointing authorities shall provide notice to employees no later than the effective date of their retirement of the right to exercise the option provided in this subdivision. The retired employee must notify the commissioner or designee of the commissioner within 30 days after the effective date of the retirement of intent to exercise this option.\n(a) Retired judges or former legislators may elect to purchase coverage for themselves or their dependents at their own expense as provided in paragraphs (b) and (c).\n(b) A retired judge of the state supreme court, the court of appeals, a district court, a county court, a county municipal court, or a probate court may elect to purchase coverage provided persons listed in section 43A.24, subdivision 2, clause (3). The commissioner shall notify judges no later than the effective date of their retirement of their right to exercise the option provided in this subdivision. A retired judge must notify the commissioner or designee of the commissioner within 30 days after the effective date of retirement if the judge intends to exercise the option.\n(c) A former member of the legislature may elect to purchase coverage provided persons listed in section 43A.24, subdivision 2, clause (1).\nUpon request of an exclusive representative of state employees listed in section 179A.10, subdivision 2, those employees of exclusive representatives whose duties involve representing state employees for at least 75 percent of their time and their dependents may elect to enroll at their own expense in the appropriate life insurance, hospital, medical and dental benefits, and optional coverages at the time, in the manner, and under the conditions of eligibility the commissioner prescribes and otherwise approves.\n[Repealed, 1996 c 310 s 1]",
	"repealed": false
}