{
	"id": "79A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.22",
	"title": "79A.22 COMMERCIAL SELF-INSURANCE GROUP OPERATING REQUIREMENTS.",
	"text": "(a) A commercial self-insurance group shall elect a board of directors who shall have complete authority over and control of the assets of the commercial self-insurance group. The board of directors will also be responsible for all of the operations of the commercial self-insurance group.\n(b) The majority of the board of directors shall be owners, officers, directors, partners, or employees of members of the commercial self-insurance group. No third-party administrator or vendor of risk management services shall serve as a director of the commercial self-insurance group.\n(c) The directors shall approve applications for membership in the commercial self-insurance group.\nCommercial self-insurance groups shall have and maintain:\n(1) combined net worth of all of the members in an amount at least equal to ten times the group's selected retention level of the Workers' Compensation Reinsurance Association. For purposes of this clause, the amount of any retained surplus by the group is considered part of the combined net worth of all the members;\n(2) sufficient assets and liquidity in the group's common claims fund to promptly and completely meet all obligations of its members under this chapter and chapter 176.\nThe commercial self-insurance group shall file with the commissioner the name of any new employer that has been accepted in the group within five business days of the initiation date of membership along with the member's signed indemnity agreement and evidence the member has deposited sufficient premiums with the group as required by the commercial self-insurance group's bylaws or plan of operation. The security deposit of the group shall be increased quarterly to an amount equal to 50 percent of the new members' premiums for that quarter. If the total increase of new members' premiums for the first quarter is less than five percent of the total annual premium of the group, no quarterly increase is necessary until the cumulative quarterly increases for that calendar year exceed five percent of the total premium of the group. The commissioner may, at the commissioner's option, review the financial statement of any applicant whose premium equals 25 percent or more of the group's total premium.\n(a) Each commercial self-insurance group shall establish a common claims fund.\n(b) Each commercial self-insurance group shall, not less than ten days prior to the proposed effective date of the group, collect cash premiums from each member equal to not less than 20 percent of the member's annual workers' compensation premium to be paid into a common claims fund, maintained by the group in a designated depository. The remaining balance of the member's premium shall be paid to the group in a reasonable manner over the remainder of the year. Payments in subsequent years shall be made according to the business plan.\n(c) Each commercial self-insurance group shall initiate proceedings against a member when that member becomes more than 30 days delinquent in any payment of premium to the fund.\n(d) There shall be no commingling of any assets of the common claims fund with the assets of any individual member or with any other account of the service company or fiscal agent unrelated to the payment of workers' compensation liabilities incurred by the group.\nEach member of a commercial self-insurance group shall be jointly and severally liable for the obligations incurred by any member of the same group under chapter 176 for any fund year in which the member was a participant of the commercial self-insurance group.\nThe accounts and records of the common claims fund shall be audited in the manner required under section 79A.03, subdivision 10.\n(a) Any securities purchased by the common claims fund shall be in such denominations and with dates of maturity to ensure securities may be redeemable at sufficient time and in sufficient amounts to meet the fund's current and long-term liabilities.\n(b) Cash assets of the self-insurers' fund may be invested as provided in section 60A.11 for a casualty insurance company, provided that investment in real estate of or indebtedness from a member company or affiliates is prohibited. In addition, investment in the following is allowed:\n(1) savings accounts or certificates of deposit in a duly chartered commercial bank located within the state of Minnesota and insured through the Federal Deposit Insurance Corporation;\n(2) share accounts or savings certificates in a duly chartered savings association or savings bank located within the state of Minnesota and insured through the Federal Deposit Insurance Corporation;\n(3) direct obligations of the United States Treasury, such as notes, bonds, or bills;\n(4) a bond or security issued by the state of Minnesota and backed by the full faith and credit of the state;\n(5) a credit union where the employees of the self-insurer are members if the credit union is located in Minnesota and insured through the National Credit Union Administration; or\n(6) real estate, common stock, preferred stock, or corporate bonds listed on the New York, American Stock Exchange or NASDAQ Stock Market, so long as these investments are not issued by any member company or affiliate and the total in all other allowable categories make up at least 75 percent of the total required in the common claims fund.\n(a) The commercial self-insurance group shall be required to secure administrative services through a service company which maintains an office in the state of Minnesota. Services provided by the service company or its subcontractor should at a minimum include claim handling, safety and loss control, and submission of all required regulatory reports.\n(b) The service company must demonstrate it has the capability to provide, through its employees or by contract, services which are necessary to administer the self-insurance group and it must employ or have under contract a claims adjuster with at least three years of Minnesota specific workers' compensation claim handling experience.\n(c) The service company retained by a commercial self-insurance group to administer workers' compensation claims shall estimate the total accrued liability of the group for the payment of compensation for the commercial self-insurance group's annual report to the commissioner and shall make the estimate both in good faith and with the exercise of a reasonable degree of care.\nA commercial self-insurance group's applications, coverage documents, quotations, and all marketing materials must prominently display information indicating that the commercial self-insurance group is a self-insured program, that members are jointly and severally liable for the obligations of the commercial self-insurance group, and that members will be assessed on an individual and proportionate basis for any deficits created by the commercial self-insurance group.\n(a) A commercial self-insurance group shall be required to purchase specific excess coverage with the Workers' Compensation Reinsurance Association at the lower retention level for its first three years of operation. After that time it may select the higher or super retention level with prior notice given to and approval of the commissioner.\n(b) The commissioner may require a commercial self-insurance group to purchase aggregate excess coverage. Any reinsurance or excess coverage purchased other than that of the Workers' Compensation Reinsurance Association must be secured with an insurance company or reinsurer licensed to underwrite such coverage in Minnesota and maintains at least an \"A\" rating with the A.M. Best rating organization.\n(a) Except as otherwise provided in paragraphs (b) and (c), 100 percent of any surplus money for a fund year in excess of 125 percent of the amount necessary to fulfill all obligations under the Workers' Compensation Act, chapter 176, for that fund year may be declared refundable to eligible members at any time.\n(b) Except as otherwise provided in paragraph (c), for groups that have been in existence for five years or more, 100 percent of any surplus money for a fund year in excess of 110 percent of the amount necessary to fulfill all obligations under the Workers' Compensation Act, chapter 176, for that fund year may be declared refundable to eligible members at any time.\n(c) Excess surplus distributions under paragraphs (a) and (b) may not be greater than the combined surplus of the group at the time of the distribution.\n(d) When all the claims of any one fund year have been fully paid, as certified by an actuary, all surplus money from that fund year may be declared refundable.\n(e) The commercial self-insurance group shall give ten days' prior notice to the commissioner of any refund. The notice must be accompanied by a statement from the commercial self-insurer group's certified public accountant certifying that the proposed refund is in compliance with this subdivision.\nIn the event of a deficit in any fund year, such deficit shall be paid up immediately, either from surplus from a fund year other than the current fund year, or by assessment of the membership. The commissioner shall be notified within ten days of any transfer of surplus funds. The commissioner, upon finding that a deficit in a fund year has not been satisfied by a transfer of surplus from another fund year, shall order an assessment to be levied on a proportionate basis against the members of the commercial self-insurance group during that fund year sufficient to make up any deficit.\nFor commercial group self-insurers who have been in existence for five years or more, a level of funding in the common claims fund must be maintained at not less than the greater of either:\n(1) one year's claim losses paid in the most recent year; or\n(2) one-third of the security deposit posted with the Department of Commerce according to section 79A.24, subdivision 2.\nPolicies issued by commercial self-insurance groups pursuant to this chapter may also provide workers' compensation coverage required under the laws of states other than Minnesota, commonly known as \"all states coverage.\" The coverage must be provided to members of the group which are temporarily performing work in another state.",
	"repealed": false
}