{
	"id": "466A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/466A.03",
	"title": "466A.03 COMMUNITY RESOURCES PROGRAMS.",
	"text": "A city must prepare a comprehensive community resources program. The program must describe the specific community resource services and means by which the city intends to pursue and implement the program objectives outlined in subdivision 2 for each targeted neighborhood served under the program and the community initiatives program described in section 466A.04.\nA community resources program must address at least the following objectives:\n(1) increasing community safety and reducing crime;\n(2) enhancing family stability including school readiness;\n(3) providing opportunities for residents to become self-supporting; and\n(4) building the capacity of neighborhood-based organizations to create cohesiveness and stability in their communities.\nA city must adopt a process to involve the residents in targeted neighborhoods in planning, developing, and implementing the community resource program.\nThe city council of a city requesting state financial assistance under section 466A.05 shall establish an advisory council to assist the city in developing and implementing a community resource program. The advisory committee may include, but is not limited to: city council members, county commissioners, school board members, community service representatives, business community representatives, and resident representatives of targeted neighborhoods. The city may designate an existing entity as the advisory committee if the entity meets the membership requirements outlined in this subdivision.\nA city may approve or modify a community resource program only after holding a public hearing. Notice of the hearing must be provided in a newspaper of general circulation in the city and in the targeted neighborhoods not less than ten days nor more than 30 days before the date of the hearing. In addition, the notice shall be published in the most widely circulated community newspaper in the targeted neighborhoods.",
	"repealed": false
}