{
	"id": "504B.371",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.371",
	"title": "504B.371 APPEALS.",
	"text": "If the court renders judgment against the defendant and the defendant or defendant's attorney informs the court the defendant intends to appeal, the court shall issue an order staying the writ for recovery of premises and order to vacate for at least 24 hours after judgment, except as provided in subdivision 7.\nA party who feels aggrieved by the judgment may appeal within 15 days as provided for civil actions in district court.\nIf the party appealing remains in possession of the property, that party must give a bond that provides that:\n(1) all costs of the appeal will be paid;\n(2) the party will comply with the court's order; and\n(3) the regular rent due to the party excluded from possession during the pendency of the appeal will be paid as that rent accrues. The court may not require a bond including back rent, late fees, disputed charges, or any other amount in excess of the regular rent as it accrues each month.\nAfter the appeal is taken, all further proceedings in the case are stayed.\n(a) If the court issues a writ for recovery of premises and order to vacate before an appeal is taken, the appealing party may request that the court stay further proceedings and execution of the writ for possession of premises and order to vacate, and the court shall grant a stay.\n(b) If the party appealing remains in possession of the premises, that party must give a bond under subdivision 3.\n(c) When the officer who has the writ for possession of premises and order to vacate is served with the order granting the stay, the officer shall cease all further proceedings. If the writ for possession of premises and order to vacate has not been completely executed, the defendant shall remain in possession of the premises until the appeal is decided.\nIn all cases of appeal, the appellate court shall not dismiss or quash the proceedings for want of form only, provided they have been conducted substantially in accordance with the provisions of this chapter. Amendments may be allowed at any time, upon such terms as to the court may appear just, in the same cases and manner and to the same extent as in civil actions. The court may compel the trial court, by attachment, to make or amend any return which is withheld or improperly or insufficiently made.\nSubdivisions 1, 4, and 5 do not apply in an action where the plaintiff has prevailed on a claim pursuant to section 504B.171, subdivision 2, if the plaintiff gives a bond conditioned to pay all costs and damages if on the appeal the judgment of restitution is reversed and a new trial ordered. In such a case, the court shall issue a writ for recovery of premises and order to vacate notwithstanding the notice of appeal, as if no appeal had been taken, and the appellate court shall issue all needful writs and processes to carry out any judgment which may be rendered in the court.",
	"repealed": false
}