{
	"id": "477C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/477C.03",
	"title": "477C.03 CALCULATION OF POLICE STATE AID; APPEAL.",
	"text": "(a) On or before October 1, the commissioner must calculate the amount of police state aid that each municipality is to receive.\n(b) The commissioner must calculate an excess police state aid amount for each municipality under subdivision 3 and must reduce the apportionment amount for each municipality based on the calculation.\n(a) The total amount available for apportionment as police state aid is equal to 104 percent of the amount of premium taxes paid to the state on the premiums reported to the commissioner by companies or insurance companies on the Minnesota Aid to Police Premium Report, except that credits claimed under section 297I.20, subdivisions 3, 4, 5, and 6, do not affect the calculation of the total amount of police state aid available for apportionment. The total amount for apportionment for the police state aid program must not be less than two percent of the amount of premiums reported to the commissioner by companies or insurance companies on the Minnesota Aid to Police Premium Report.\n(b) The commissioner must calculate the percentage of increase or decrease reflected in the apportionment over or under the previous year's available state aid using the same premiums as a basis for comparison.\n(c) In addition to the amount for apportionment of police state aid under paragraph (a), each year $100,000 must be apportioned for police state aid. An amount sufficient to pay this increase is annually appropriated from the general fund.\n(d) The commissioner must apportion police state aid to all municipalities in proportion to the relationship that the total number of peace officers employed by that municipality for the prior calendar year and the proportional or fractional number who were employed less than a calendar year as credited under section 477C.02, subdivision 1, paragraph (c), bears to the total number of peace officers employed by all municipalities subject to any reduction under subdivision 3.\n(a) The commissioner must reduce the apportionment of police state aid under this section for eligible municipalities by the amount of any excess police state aid calculated under this subdivision.\n(b) The commissioner must calculate the amount of excess police state aid for each municipality as follows:\n(1) for municipalities in which police retirement coverage is provided wholly by the public employees police and fire fund and all peace officers are members of the plan governed by sections 353.63 to 353.657, the excess police state aid amount equals the amount of police state aid apportioned under subdivision 2 that exceeds the employer's total prior calendar year obligation as defined in paragraph (c), as certified by the executive director of the Public Employees Retirement Association;\n(2) for the Metropolitan Airports Commission, the excess police state aid amount equals the amount of apportioned police aid calculated under subdivision 2 that exceeds the commission's total prior calendar year obligation as defined in paragraph (c), as certified by the executive director of the Public Employees Retirement Association; and\n(3) for the Departments of Natural Resources and Public Safety, the excess police state aid amount equals the amount of apportioned police aid calculated under subdivision 2 that exceeds the employer's total prior calendar year obligation under section 352B.02, subdivision 1c, for plan members who are peace officers, as certified by the executive director of the Minnesota State Retirement System.\n(c) The municipality's total prior calendar year obligation with respect to the public employees police and fire plan under paragraph (b), clause (1), is the total prior calendar year obligation under section 353.65, subdivision 3, for police officers as defined in section 353.64, subdivisions 1, la, and 2, and the actual total prior calendar year obligation under section 353.65, subdivision 3, for firefighters, as defined in section 353.64, subdivisions 1, la, and 2, but not to exceed for those firefighters the applicable following employer calendar year amount:\n(d) The total amount of excess police state aid must be deposited in the excess police state aid holding account in the general fund, and administered and distributed as provided in subdivision 4.\n(a) The excess police state aid holding account is established in the general fund. The excess police state aid holding account is administered by the commissioner.\n(b) Excess police state aid determined under subdivision 3 must be deposited annually in the excess police state aid holding account.\n(c) From the balance in the excess police state aid holding account, $900,000 must be canceled annually to the general fund.\n(d) On October 1 annually, one-half of the balance of the excess police state aid holding account remaining after the deduction under paragraph (c) is appropriated for additional amortization aid under section 423A.02, subdivision 1b.\n(e) The remaining balance in the excess police state aid holding account, after the deductions under paragraphs (c) and (d), must be canceled annually to the general fund.\nA municipality may object to the amount of police state aid apportioned to it by filing a written request with the commissioner to review and adjust the apportionment of funds to the municipality. The objection of a municipality must be filed with the commissioner within 60 days of the date the amount of apportioned police state aid is paid. The decision of the commissioner is subject to appeal, review, and adjustment by the district court in the county in which the applicable municipality is located or by the Ramsey County District Court with respect to the Departments of Natural Resources or Public Safety.",
	"repealed": false
}