{
	"id": "256D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.01",
	"title": "256D.01 DECLARATION OF POLICY; CITATION.",
	"text": "The objectives of sections 256D.01 to 256D.21 are to provide a sound administrative structure for public assistance programs; to maximize the use of federal money for public assistance purposes; to provide an integrated public assistance program for eligible households in the state without adequate income or resources to maintain a subsistence reasonably compatible with decency and health; and to provide services to help employable and potentially employable persons prepare for and attain self-sufficiency and obtain permanent work.\nIt is the policy of this state that eligible households unable to provide for themselves and not otherwise provided for by law who meet the eligibility requirements of sections 256D.01 to 256D.21 are entitled to receive grants of general assistance necessary to maintain a subsistence reasonably compatible with decency and health. Providing this assistance is a matter of public concern and a necessity in promoting the public health and welfare.\n(a) A principal objective in providing general assistance is to provide for single adults, childless couples, or children as defined in section 256D.02, subdivision 2b, ineligible for federal programs who are unable to provide for themselves. The minimum standard of assistance determines the total amount of the general assistance grant without separate standards for shelter, utilities, or other needs.\n(b) The standard of assistance for an assistance unit consisting of a recipient who is childless and unmarried or living apart from children and spouse and who does not live with a parent or parents or a legal custodian, or consisting of a childless couple, is $350 per month effective October 1, 2024, and must be adjusted by a percentage equal to the change in the consumer price index as of January 1 every year, beginning October 1, 2025.\n(c) For an assistance unit consisting of a single adult who lives with a parent or parents, the general assistance standard of assistance is $350 per month effective October 1, 2024, and must be adjusted by a percentage equal to the change in the consumer price index as of January 1 every year, beginning October 1, 2025. Benefits received by a responsible relative of the assistance unit under the Supplemental Security Income program, a workers' compensation program, the Minnesota supplemental aid program, or any other program based on the responsible relative's disability, and any benefits received by a responsible relative of the assistance unit under the Social Security retirement program, may not be counted in the determination of eligibility or benefit level for the assistance unit. Except as provided below, the assistance unit is ineligible for general assistance if the available resources or the countable income of the assistance unit and the parent or parents with whom the assistance unit lives are such that a family consisting of the assistance unit's parent or parents, the parent or parents' other family members and the assistance unit as the only or additional minor child would be financially ineligible for general assistance. For the purposes of calculating the countable income of the assistance unit's parent or parents, the calculation methods must follow the provisions under section 256P.06.\nThe commissioner shall adopt rules to set standards of assistance and methods of calculating payment to conform with subdivision 1a. When a recipient is a resident of a licensed residential facility, except shelters for the homeless or shelters under section 611A.31, the recipient is not eligible for a full general assistance standard. The state standard of assistance for those recipients who have personal needs not otherwise provided for is the personal needs allowance authorized for medical assistance recipients under section 256B.35.\n[Repealed, 1989 c 282 art 5 s 133]\n[Repealed, 1988 c 411 s 9]\nThe commissioner shall adopt rules under the terms of sections 256D.01 to 256D.21 for general assistance, to require use of the emergency program under MFIP as the primary financial resource when available. The commissioner shall adopt rules for eligibility for general assistance of persons with seasonal income and may attribute seasonal income to other periods not in excess of one year from receipt by an applicant or recipient. General assistance payments may not be made for foster care, community residential settings licensed under chapter 245D, child welfare services, or other social services. Vendor payments and vouchers may be issued only as authorized in sections 256D.05, subdivision 6, and 256D.09.\nSections 256D.01 to 256D.21 may be cited as the \"General Assistance Act.\"",
	"repealed": false
}