{
	"id": "62D.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.15",
	"title": "62D.15 SUSPENSION OR REVOCATION OF CERTIFICATE OF AUTHORITY.",
	"text": "The commissioner of health may suspend or revoke any certificate of authority issued to a health maintenance organization under sections 62D.01 to 62D.30 if the commissioner finds that:\n(1) the health maintenance organization is operating significantly in contravention of its basic organizational document, its health maintenance contract, or in a manner contrary to that described in and reasonably inferred from any other information submitted under section 62D.03, unless amendments to such submissions have been filed with and approved by the commissioner of health;\n(2) the health maintenance organization issues evidences of coverage which do not comply with the requirements of section 62D.07;\n(3) the health maintenance organization is unable to fulfill its obligations to furnish comprehensive health maintenance services as required under its health maintenance contract;\n(4) the health maintenance organization is no longer financially responsible and may reasonably be expected to be unable to meet its obligations to enrollees or prospective enrollees;\n(5) the health maintenance organization has failed to implement a mechanism affording the enrollees an opportunity to participate in matters of policy and operation under section 62D.06;\n(6) the health maintenance organization has failed to implement the complaint system required by section 62D.11 in a manner designed to reasonably resolve valid complaints;\n(7) the health maintenance organization, or any person acting with its sanction, has advertised or merchandised its services in an untrue, misrepresentative, misleading, deceptive, or unfair manner;\n(8) the continued operation of the health maintenance organization would be hazardous to its enrollees; or\n(9) the health maintenance organization has otherwise failed to substantially comply with sections 62D.01 to 62D.30 or with any other statute or administrative rule applicable to health maintenance organizations, or has submitted false information in any report required hereunder.\nA certificate of authority shall be suspended or revoked only after compliance with the requirements of section 62D.16.\nWhen the certificate of authority of a health maintenance organization is suspended, the health maintenance organization shall not, during the period of such suspension, enroll any additional enrollees except newborn children or other newly acquired dependents of existing enrollees, and shall not engage in any advertising or solicitation whatsoever.\nWhen the certificate of authority of a health maintenance organization is revoked, the organization shall proceed, immediately following the effective date of the order of revocation, to wind up its affairs, and shall conduct no further business except as may be essential to the orderly conclusion of the affairs of the organization. It shall engage in no further advertising or solicitation whatsoever. The commissioner of health may, by written order, permit further operation of the organization as the commissioner may find to be in the best interest of enrollees, to the end that enrollees will be afforded the greatest practical opportunity to obtain continuing health care coverage.",
	"repealed": false
}