{
	"id": "62J.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.321",
	"title": "62J.321 DATA COLLECTION AND PROCESSING PROCEDURES.",
	"text": "(a) The commissioner shall collect data from health care providers, health plan companies, and individuals in the most cost-effective manner, which does not unduly burden them. The commissioner may require health care providers and health plan companies to collect and provide patient health records and claim files, and cooperate in other ways with the data collection process. The commissioner may also require health care providers and health plan companies to provide mailing lists of patients. Patient consent shall not be required for the release of data to the commissioner pursuant to sections 62J.301 to 62J.42 by any group purchaser, health plan company, health care provider; or agent, contractor, or association acting on behalf of a group purchaser or health care provider. Any group purchaser, health plan company, health care provider; or agent, contractor, or association acting on behalf of a group purchaser or health care provider, that releases data to the commissioner in good faith pursuant to sections 62J.301 to 62J.42 shall be immune from civil liability and criminal prosecution.\n(b) When a group purchaser, health plan company, or health care provider submits patient identifying data to the commissioner pursuant to sections 62J.301 to 62J.42, and the data is submitted to the commissioner in electronic form, or through other electronic means including, but not limited to, the electronic data interchange system, the group purchaser, health plan company, or health care provider shall submit the patient identifying data in encrypted form, using an encryption method specified by the commissioner. Submission of encrypted data as provided in this paragraph satisfies the requirements of section 144.293, subdivision 7.\n(c) The commissioner shall require all health care providers, group purchasers, and state agencies to use a standard patient identifier and a standard identifier for providers and health plan companies when reporting data under this chapter. The commissioner must encrypt patient identifiers to prevent identification of individual patients and to enable release of otherwise private data to researchers, providers, and group purchasers in a manner consistent with chapter 13 and sections 62J.55 and 144.291 to 144.298. This encryption must ensure that any data released must be in a form that makes it impossible to identify individual patients.\nThe intentional failure to provide the data requested under this chapter is grounds for disciplinary or regulatory action against a regulated provider or group purchaser. The commissioner may assess a fine against a provider or group purchaser who refuses to provide data required by the commissioner. If a provider or group purchaser refuses to provide the data required, the commissioner may obtain a court order requiring the provider or group purchaser to produce documents and allowing the commissioner to inspect the records of the provider or group purchaser for purposes of obtaining the data required.\nData collection must continue for a sufficient time to permit: adequate analysis by researchers and appropriate providers, including providers who will be impacted by the data; feedback to providers; monitoring for changes in practice patterns; and the data and research criteria of section 62J.311, subdivision 2, to be fulfilled.\n(a) The commissioner shall negotiate with private sector organizations currently collecting health care data of interest to the commissioner to obtain required data in a cost-effective manner and minimize administrative costs. The commissioner shall attempt to establish links between the health care data collected to fulfill sections 62J.301 to 62J.42 and existing private sector data and shall consider and implement methods to streamline data collection in order to reduce public and private sector administrative costs.\n(b) The commissioner shall use existing public sector data, such as those existing for medical assistance and Medicare, to the greatest extent possible. The commissioner shall establish links between existing public sector data and consider and implement methods to streamline public sector data collection in order to reduce public and private sector administrative costs.\n(a) Data collected to fulfill the data and research initiatives authorized by sections 62J.301 to 62J.42 that identify individual patients or providers are private data on individuals. Data not on individuals are nonpublic data. The commissioner shall establish procedures and safeguards to ensure that data released by the commissioner is in a form that does not identify specific patients, providers, employers, individual or group purchasers, or other specific individuals and organizations, except with the permission of the affected individual or organization, or as permitted elsewhere in this chapter.\n(b) Raw unaggregated data collected from household and employer surveys used by the commissioner to monitor the number of uninsured individuals, reasons for lack of insurance coverage, and to evaluate the effectiveness of health care reform, are subject to the same data classifications as data collected pursuant to sections 62J.301 to 62J.42.\n(c) Notwithstanding sections 13.03, subdivisions 6 to 8; 13.10, subdivisions 1 to 4; and 138.17, data received by the commissioner pursuant to sections 62J.301 to 62J.42, shall retain the classification designated under this section and shall not be disclosed other than pursuant to this section.\n(d) Summary data collected to fulfill the data and research initiatives authorized by sections 62J.301 to 62J.42 may be disseminated under section 13.05, subdivision 7. For the purposes of this section, summary data includes nonpublic data not on individuals.\n(e) Notwithstanding paragraph (a), the commissioner may publish nonpublic or private data collected pursuant to sections 62J.301 to 62J.42 on health care costs and spending, quality and outcomes, and utilization for health care institutions, individual health care professionals and groups of health care professionals, and group purchasers, with a description of the methodology used for analysis. The commissioner may not make public any patient identifying information except as specified in law. The commissioner shall not reveal the name of an institution, group of professionals, individual health care professional, or group purchaser until after the institution, group of professionals, individual health care professional, or group purchaser has had 21 days to review the data and comment. The commissioner shall include comments received in the release of the data.\n(f) A provider or group purchaser may contest whether the data meets the criteria of section 62J.311, subdivision 2, paragraph (a), clause (2), in accordance with a contested case proceeding as set forth in sections 14.57 to 14.62, subject to appeal in accordance with sections 14.63 to 14.68. To obtain a contested case hearing, the provider or group purchaser must make a written request to the commissioner before the end of the time period for review and comment. Within ten days of the assignment of an administrative law judge, the provider or group purchaser shall make a clear showing to the administrative law judge of probable success in a hearing on the issue of whether the data are accurate and valid and were collected based on the criteria of section 62J.311, subdivision 2, paragraph (a), clause (2). If the administrative law judge determines that the provider or group purchaser has made such a showing, the data shall remain private or nonpublic during the contested case proceeding and appeal. If the administrative law judge determines that the provider or group purchaser has not made such a showing, the commissioner may publish the data immediately, with comments received in the release of the data. The contested case proceeding and subsequent appeal is not an exclusive remedy and any person may seek a remedy pursuant to section 13.08, subdivisions 1 to 4, or as otherwise authorized by law.\n[Repealed, 1Sp2011 c 9 art 2 s 29]\nThe commissioner may adopt rules to implement sections 62J.301 to 62J.42.\nThe commissioner may seek federal funding, and funding from private and other nonstate sources, for data and research initiatives.\nTo carry out the duties assigned in sections 62J.301 to 62J.42, the commissioner may contract with or provide grants to private sector entities. Any contract or grant must require the private sector entity to maintain the data which it receives according to the statutory provisions applicable to the data.",
	"repealed": false
}