{
	"id": "84.775",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.775",
	"title": "84.775 OFF-HIGHWAY VEHICLE CIVIL CITATIONS.",
	"text": "(a) A conservation officer or other licensed peace officer may issue a civil citation to a person who operates:\n(1) an off-highway motorcycle in violation of sections 84.773, subdivision 1 or 2, clause (1); 84.777; or 84.788 to 84.795;\n(2) an off-road vehicle in violation of sections 84.773, subdivision 1 or 2, clause (1); 84.777; or 84.798 to 84.804;\n(3) an all-terrain vehicle in violation of sections 84.773, subdivision 1 or 2, clause (1); 84.777; or 84.922 to 84.928;\n(4) a snowmobile in violation of sections 84.777 or 84.82 to 84.872; or\n(5) an off-highway motorcycle, an off-road vehicle, an all-terrain vehicle, or a snowmobile in violation of section 84.90 or 97B.001.\n(b) A civil citation under paragraph (a) shall require restitution for public and private property damage and impose a penalty of:\n(1) $250 for the first offense;\n(2) $500 for the second offense; and\n(3) $1,000 for third and subsequent offenses.\n(c) A conservation officer or other licensed peace officer may issue a civil citation to a person who operates an off-highway motorcycle, off-road vehicle, or all-terrain vehicle in violation of section 84.773, subdivision 2, clause (2) or (3). A civil citation under this paragraph shall require restitution for damage to wetlands and impose a penalty of:\n(1) $100 for the first offense;\n(2) $500 for the second offense; and\n(3) $1,000 for third and subsequent offenses.\n(d) If the peace officer determines that there is damage to property requiring restitution, the commissioner must send a written explanation of the extent of the damage and the cost of the repair by first class mail to the address provided by the person receiving the citation within 15 days of the date of the citation.\n(e) An off-road vehicle that is equipped with a snorkel device and receives a civil citation under this section is subject to twice the penalty amounts in paragraphs (b) and (c).\nCivil citations issued under subdivision 1 may be appealed according to section 116.072, if the recipient of the citation requests a hearing by notifying the commissioner in writing within 30 days after receipt of the citation or, if applicable, within 15 days after the date of mailing the explanation of restitution. For the purposes of this section, the terms \"commissioner\" and \"agency\" as used in section 116.072 mean the commissioner of natural resources. If a hearing is not requested within the 30-day period, the citation becomes a final order not subject to further review.\nCivil citations issued under subdivision 1 may be enforced under section 116.072, subdivision 9. Penalty amounts must be remitted within 30 days of issuance of the citation.\nPenalty amounts collected from civil citations issued under this section must be paid to the treasury of the unit of government employing the officer that issued the civil citation. Penalties retained by the commissioner shall be credited as follows: to the off-highway motorcycle account under section 84.794 for citations involving off-highway motorcycles; to the off-road vehicle account under section 84.803 for citations involving off-road vehicles; to the all-terrain vehicle account under section 84.927 for citations involving all-terrain vehicles; or to the snowmobile trails and enforcement account under section 84.83 for citations involving snowmobiles. Penalty amounts credited under this subdivision are dedicated for enforcing off-highway vehicle laws or for enforcing snowmobile laws.\nA peace officer may not seek both civil and misdemeanor penalties for offenses listed in subdivision 1.",
	"repealed": false
}