{
	"id": "246B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/246B.06",
	"title": "246B.06 VOCATIONAL WORK PROGRAM.",
	"text": "(a) The executive board may establish, equip, maintain, and operate a vocational work program at any Minnesota Sex Offender Program facility under this chapter. The executive board may establish vocational activities for sex offender treatment for civilly committed sex offenders as the executive board deems necessary and suitable to the meaningful work skills training, educational training, and development of proper work habits and extended treatment services for civilly committed sex offenders consistent with the requirements in section 246B.05. The industrial and commercial activities authorized by this section are designated Minnesota State Industries and must be for the primary purpose of sustaining and ensuring Minnesota State Industries' self-sufficiency, providing educational training, meaningful employment, and the teaching of proper work habits to the individuals in the Minnesota Sex Offender Program under this chapter, and not solely as competitive business ventures.\n(b) The net profits from the vocational work program must be used for the benefit of the civilly committed sex offenders as it relates to building education and self-sufficiency skills. Prior to the establishment of any vocational activity, the executive board shall consult with stakeholders including representatives of business, industry, organized labor, the commissioner of education, the state Apprenticeship Council, the commissioner of labor and industry, the commissioner of employment and economic development, the commissioner of administration, the commissioner of human services, and other stakeholders the executive board deems qualified. The purpose of the stakeholder consultation is to determine the quantity and nature of the goods, wares, merchandise, and services to be made or provided, and the types of processes to be used in their manufacture, processing, repair, and production consistent with the greatest opportunity for the reform and educational training of the civilly committed sex offenders, and with the best interests of the state, business, industry, and labor.\n(c) The executive board shall, at all times in the conduct of any vocational activity authorized by this section, utilize civilly committed sex offender labor to the greatest extent feasible, provided that the executive board may employ all administrative, supervisory, and other skilled workers necessary to the proper instruction of the civilly committed sex offenders and the efficient operation of the vocational activities authorized by this section.\n(d) The executive board may authorize the director of any Minnesota Sex Offender Program facility under the control of the executive board to accept work projects from outside sources for processing, fabrication, or repair, provided that preference is given to the performance of work projects for state departments and agencies.\nThe vocational work program account established under section 246B.05, subdivision 2, must be used for the vocational work program authorized under this section, including but not limited to the purchase of equipment and raw materials, the payment of salaries and wages, and other necessary expenses as determined by the executive board. The purchase of services, materials, and commodities used in and held for resale are not subject to the competitive bidding procedures of section 16C.06, but are subject to all other provisions of chapters 16B and 16C. When practical, purchases must be made from small targeted group businesses designated under section 16C.16. Additionally, the expenses of client educational training and self-sufficiency skills may be financed from the vocational work program account in an amount to be determined by the executive board or designee. The proceeds and income from all vocational work program activities conducted at the Minnesota Sex Offender Program facilities must be deposited in the vocational work program account subject to disbursement under subdivision 3. The executive board may request that money in the fund be invested pursuant to section 11A.25. Proceeds from the investment not currently needed must be accounted for separately and credited to the vocational work program account.\nThe vocational work program account must be deposited in the state treasury and paid out only on proper vouchers as authorized and approved by the executive board, and in the same manner and under the same restrictions as provided by law for the disbursement of funds by the executive board. An amount deposited in the state treasury equal to six months of net operating cash as determined by the prior 12 months of revenue and cash flow statements must be restricted for use only by the vocational work program as described under subdivision 2. For purposes of this subdivision, \"net operating cash\" means net income, minus sales, plus cost of goods sold. Cost of goods sold include all direct costs of products attributable to the goods' production.\nThe executive board is authorized to borrow sums of money as the executive board deems necessary to meet current demands on the vocational work program account. The sums borrowed must not exceed, in any calendar year, six months of net operating cash as determined by the previous 12 months of the vocational program's revenue and cash flow statements. If the executive board determines that borrowing of funds is necessary, the executive board shall certify this need to the commissioner of management and budget. Funds may be borrowed from general fund appropriations to the Minnesota Sex Offender Program with the authorization of the commissioner of management and budget. Upon authorization of the commissioner of management and budget, the transfer must be made and credited to the vocational work program account. The sum transferred to the vocational work program account must be repaid by the executive board from the account to the fund from which it was transferred in a time period specified by the commissioner of management and budget, but by no later than the end of the biennium, as defined in section 16A.011, in which the loan is made. When any transfer is made to the vocational work program account, the commissioner of management and budget shall notify the executive board of the amount transferred to the account and the date the transfer is to be repaid.\nGrants received by the Direct Care and Treatment executive board from the federal government for any vocational training program or for administration by the Direct Care and Treatment executive board must (1) be credited to a federal grant fund and then (2) be transferred from the federal grant fund to the credit of the Direct Care and Treatment executive board in the appropriate account upon certification by the Direct Care and Treatment executive board that the amounts requested to be transferred have been earned or are required for the purposes of this section. Funds received by the federal grant fund need not be budgeted as such, provided transfers from the fund are budgeted for allotment purposes in the appropriate appropriation.\nNotwithstanding section 177.24 or any other law to the contrary, the Direct Care and Treatment executive board has the discretion to set the pay rate for individuals participating in the vocational work program. The executive board has the authority to retain up to 50 percent of any payments made to an individual participating in the vocational work program for the purpose of reducing state costs associated with operating the Minnesota Sex Offender Program.\nCivilly committed sex offenders participating in the vocational work program are not employees of the Minnesota Sex Offender Program, Direct Care and Treatment, or the state, and are not subject to fair labor standards under sections 177.21 to 177.35; workers compensation under sections 176.011 to 176.862; the Minnesota Human Rights Act under sections 363A.01 to 363A.41; laws governing state employees under chapter 43A; labor relations under chapter 179A; or the successors to any of these sections and any other laws pertaining to employees and employment.\nClaims and demands arising out of injury to or death of a civilly committed sex offender while that individual is participating in the vocational work program or performing a work assignment maintaining the facility must be presented to, heard by, and determined exclusively by the legislature as provided in section 3.738.",
	"repealed": false
}