{
	"id": "507.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.18",
	"title": "507.18 PROHIBITED RESTRICTIONS.",
	"text": "No written instrument hereafter made, relating to or affecting real estate, shall contain any provision against conveying, mortgaging, encumbering, or leasing any real estate to any person of a specified religious faith, creed, national origin, race, or color, nor shall any such written instrument contain any provision of any kind or character discriminating against any class of persons because of their religious faith, creed, national origin, race, or color. In every such provision any form of expression or description which is commonly understood as designating or describing a religious faith, creed, national origin, race, or color shall have the same effect as if its ordinary name were used therein.\nEvery provision referred to in subdivision 1 shall be void, regardless of the year the written instrument was executed, but the instrument shall have full force in all other respects and shall be construed as if no such provision were contained therein.\nAs used in this section the phrase \"written instruments relating to or affecting real estate,\" embraces every writing relating to or affecting any right, title, or interest in real estate, and includes, among other things, plats and wills; and the word \"provision\" embraces all clauses, stipulations, restrictions, covenants, and conditions of the kind or character referred to in subdivision 1. As used in this section, the term \"protected class\" means any class of persons identified by their race, color, creed, national origin, or religious beliefs.\nEvery person who violates subdivision 1, or aids or incites another to do so, shall be liable in a civil action to the person aggrieved in damages not exceeding $500.\nThe owner of any interest in real property may record the statutory form provided in subdivision 6 in the office of the county recorder of any county where the real property is located to discharge and release a restrictive covenant related to a protected class permanently from the title. This subdivision does not apply to real property registered under chapters 508 and 508A. The discharge of the restrictive covenant is valid and enforceable under the law of Minnesota when the statutory form provided in subdivision 6 is properly recorded, but the instrument containing such restrictive covenants shall have full force in all other respects and shall be construed as if no such restrictive covenant were contained therein. A restrictive covenant affecting a protected class is void regardless of whether a statutory form as provided for in this section has been recorded in the office of the county recorder in the county where the real property affected by the restrictive covenant is located.\n(a) The county recorder must accept the statutory form provided in this subdivision for recording when the form:\n(1) has been executed before a notary;\n(2) contains the legal description of the real property affected by the restrictive covenant related to a protected class;\n(3) contains the date of recording of the instrument containing the restrictive covenant, and the volume and page number or document number of the instrument; and\n(4) complies with all other recording requirements, and applicable recording fees have been paid.\n(b) The commissioner of commerce must provide electronic copies of the statutory form in this subdivision to the public free of cost.\n(c) The recording of this form does not alter or affect the duration or expiration of covenants, conditions, or restrictions under section 500.20 and may not be used to extend the effect of a covenant, condition, or restriction.\n(d) The statutory form that follows may be used to discharge restrictive covenants on property that limit the ownership, occupancy, use, or financing based on protected class:\nDISCHARGE OF RESTRICTIVE COVENANT AFFECTING PROTECTED CLASSES\nPursuant to Minnesota Statutes, section 507.18, any restrictive covenant affecting a protected class, including covenants which were placed on the real property with the intent of restricting the use, occupancy, ownership, or financing because of a person's race, color, creed, national origin, or religious beliefs, is discharged and released from the land described herein.\nState of Minnesota, County of ....................\nI/we, .............................................................................................., having an ownership or other interest in all or part of the real property described herein, solemnly swear that the contents of this form are true to the best of my/our knowledge, except as to those matters stated on information and belief, and that as to those matters I/we believe them to be true.\nName and Address of Owner(s) .............................................................................................\nThe real property owned by owner(s) is located in ................................. County, Minnesota, and is legally described as follows:\nOWNER(s), ...................................................................................., swears and affirms that Owner(s) is/are 18 years of age or older and is/are not under any legal incapacity and that the information provided in this form is true and correct based on the information available and based on reasonable information and belief:\n(1) a restrictive covenant which had the intent to restrict the use, occupancy, ownership, or financing of this property based on a protected class, including race, color, creed, national origin, or religion, existed at one time related to the property described in this form;\n(2) the restrictive covenant is contained in an instrument dated ........................., and recorded as Document Number ....................... (or in Book ............... of .............., Page........) in the Office of the County Recorder of .................., Minnesota;\n(3) restrictive covenants relating to or affecting protected classes are unenforceable and void pursuant to Minnesota Statutes, sections 507.18 and 363A.09, the United States Constitution, and the Minnesota Constitution;\n(4) Minnesota Statutes, section 507.18, provides for the discharge of a restrictive covenant of the nature described herein through the use of this statutory form to permanently discharge such covenants from the land described herein and release the current and future landowner(s) from any such restrictive covenant related to or affecting protected classes;\n(5) the instrument containing such restrictive covenants shall have full force in all other respects and shall be construed as if no such restrictive covenant was contained therein; and\n(6) the filing of this form does not alter or change the duration or expiration of covenants, conditions, or restrictions under Minnesota Statutes, section 500.20.\nThe affiant(s) know(s) the matters herein stated are true and make(s) this affidavit for the purpose of documenting the discharge of the illegal and unenforceable restrictive covenants affecting protected classes.",
	"repealed": false
}