{
	"id": "123A.455",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.455",
	"title": "123A.455 REALIGNING SPLIT RESIDENTIAL PARCELS.",
	"text": "\"Split residential property parcel\" means a parcel of real estate that is located within the boundaries of more than one school district and that is classified as residential property under:\n(1) section 273.13, subdivision 22, paragraph (a) or (b);\n(2) section 273.13, subdivision 25, paragraph (b), clause (1); or\n(3) section 273.13, subdivision 25, paragraph (c).\nThe owner of a split residential property parcel may petition the auditor of the county where the split parcel is located to transfer that part into the adjoining school district so the entire property will be located in the same school district. The petition must contain:\n(1) a correct description of the split parcel to be affected by the transfer including supporting data on location and title to the land;\n(2) a list of the school districts in which the split parcels currently lie;\n(3) the school district into which the petitioner desires to have the whole split parcel transferred; and\n(4) the district of attendance of any students currently residing on the property.\nWithin 60 days of receipt of the petition, the auditor of the county in which the petition was filed under subdivision 2 shall issue an order to transfer the affected parcel to the district determined by the county board. Orders issued on or before July 1 will be effective for taxes payable in the following year. The auditor must notify the affected school districts and the commissioner of the change in school district boundaries.\nThe commissioner shall modify the records of school district boundaries to conform to the order.\nUpon the effective date of the order, the whole split property parcel is transferred into a single school district. Beginning in the next subsequent taxes payable year, all taxable property in the whole split parcel is:\n(1) relieved of all school district taxes from the district in which the parcel is no longer located; and\n(2) subject to all school district taxes in the district in which the whole split parcel is now located.",
	"repealed": false
}