{
	"id": "138.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.93",
	"title": "138.93 GRANT-IN-AID ASSISTANCE; NON-STATE-OWNED HISTORICAL INTERPRETIVE CENTERS.",
	"text": "The state may pay part of the cost of construction of non-state-owned historical interpretive center projects. The state's share may not exceed 50 percent of the cost of any project. In regions 3, 4, 9, 10, and 11, expenditures from appropriations by the 1977, 1978, and 1979 legislature shall be considered part of the state share of the project cost for the purposes of this section. No more than ten percent of the state's share of future appropriations pursuant to this section may be used for professional services. Development regions are the regions designated pursuant to section 462.385. There shall not be more than one state assisted project in each region.\nEach regional planning commission, except in regions 3, 4, 9, 10 and 11, may request designation of a non-state-owned historical interpretive center. Applications shall be received by the commission for 180 days thereafter. Applications shall be in the form prescribed by the Minnesota Historical Society and include a master plan in accordance with the Minnesota Outdoor Recreation Act of 1975. The regional planning commission may establish an advisory committee of 20 members from the region to make recommendations.\nAfter receipt of the regional planning commission's recommendation and review of the master plan in accordance with subdivision 5, the Minnesota historical society shall designate the center and notify the owner applicant and the regional planning commission of the designation; however, in region 4, the Red River Valley Center at Moorhead is designated; in region 10, the Mississippi Interpretive Center at Winona is designated; in region 9, the Agricultural Interpretive Center at Waseca is designated; in region 3, the Lake Superior Museum of Transportation and Industry is designated; in region 11, the historic Washington County Courthouse at Stillwater is designated.\nThe owner shall prepare and submit to the regional planning commission a master plan for the development and management of the center, in a format and detail appropriate for the project. The regional planning commission shall choose a project and report its choice to the Minnesota Historical Society. The Minnesota Historical Society shall make the master plan available for review and comment by the public and other state agencies for at least 30 days.\nThe Minnesota Historical Society shall review the master plan to determine whether it:\n(1) provides for development of the center in a manner consistent with the purposes of this section;\n(2) recognizes historical values and resources that relate to the area involved;\n(3) provides an historical program based on sound historical research; and\n(4) meets the requirement of section 138.92.\nWithin 60 days after receipt of a master plan, the Minnesota Historical Society shall notify the owner that the plan has been reviewed, and forward its recommendations for any changes it might suggest. The owner shall review the recommendations and notify the Minnesota Historical Society of the disposition made of them. The plan may be approved by the society only after all conditions of this section have been met. The society shall forward all approved master plans to the appropriate regional planning commission and the owner. If the society rejects a project chosen by a regional planning commission the commission may again request applications in accordance with subdivision 2 in the subsequent fiscal year.\nThe Minnesota Historical Society may seek appropriations for grant-in-aid assistance pursuant to this section and sections 16A.10 and 16A.11.",
	"repealed": false
}