{
	"id": "259A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/259A.10",
	"title": "259A.10 ELIGIBILITY REQUIREMENTS.",
	"text": "(a) To be eligible for adoption assistance, a child must:\n(1) be determined to be a child with special needs, according to subdivision 2;\n(2) meet the applicable citizenship and immigration requirements in subdivision 3; and\n(3)(i) meet the criteria outlined in section 473 of the Social Security Act; or\n(ii) have had foster care payments paid on the child's behalf while in out-of-home placement through the county or tribal social service agency and be a child under the guardianship of the commissioner or a ward of tribal court.\n(b) In addition to the requirements in paragraph (a), the child's adoptive parents must meet the applicable background study requirements outlined in subdivision 4.\n(a) A child is considered a child with special needs under this section if all of the requirements in paragraphs (b) to (g) are met.\n(b) There has been a determination that the child cannot or should not be returned to the home of the child's parents as evidenced by:\n(1) court-ordered termination of parental rights;\n(2) petition to terminate parental rights;\n(3) consent of parent to adoption accepted by the court under chapter 260C;\n(4) in circumstances where tribal law permits the child to be adopted without a termination of parental rights, a judicial determination by tribal court indicating the valid reason why the child cannot or should not return home;\n(5) voluntary relinquishment under section 259.25 or 259.47 or, if relinquishment occurred in another state, the applicable laws in that state; or\n(6) death of the legal parent, or parents if the child has two legal parents.\n(c) There exists a specific factor or condition because of which it is reasonable to conclude that the child cannot be placed with adoptive parents without providing adoption assistance as evidenced by:\n(1) determination by the Social Security Administration that the child meets all medical or disability requirements of title XVI of the Social Security Act with respect to eligibility for Supplemental Security Income benefits;\n(2) documented physical, mental, emotional, or behavioral disability not covered under clause (1);\n(3) a member in a sibling group being adopted at the same time by the same parent;\n(4) adoptive placement in the home of a parent who previously adopted a sibling for whom they receive adoption assistance; or\n(5) documentation that the child is an at-risk child.\n(d) A reasonable but unsuccessful effort was made to place the child with adoptive parents without providing adoption assistance as evidenced by:\n(1) a documented search for an appropriate adoptive placement; or\n(2) determination by the commissioner that a search under clause (1) is not in the best interests of the child.\n(e) The requirement for a documented search for an appropriate adoptive placement under paragraph (d), including the registration of the child with the State Adoption Exchange and other recruitment methods under paragraph (f), must be waived if:\n(1) the child is being adopted by a relative and it is determined by the child-placing agency that adoption by the relative is in the best interests of the child;\n(2) the child is being adopted by a foster parent with whom the child has developed significant emotional ties while in their care as a foster child and it is determined by the child-placing agency that adoption by the foster parent is in the best interests of the child; or\n(3) the child is being adopted by a parent that previously adopted a sibling of the child, and it is determined by the child-placing agency that adoption by this parent is in the best interests of the child.\nWhen the Indian Child Welfare Act applies, a waiver must not be granted unless the child-placing agency has complied with the placement preferences required by the Indian Child Welfare Act according to United States Code, title 25, section 1915(a).\n(f) To meet the requirement of a documented search for an appropriate adoptive placement under paragraph (d), clause (1), the child-placing agency minimally must:\n(1) conduct a relative search as required by section 260C.221 and give consideration to placement with a relative as required by section 260C.212, subdivision 2;\n(2) comply with the adoptive placement preferences required under the Indian Child Welfare Act when the Indian Child Welfare Act, United States Code, title 25, section 1915(a), applies;\n(3) locate prospective adoptive families by registering the child on the State Adoption Exchange, as required under section 259.75; and\n(4) if registration with the State Adoption Exchange does not result in the identification of an appropriate adoptive placement, employ additional recruitment methods, as outlined in requirements and procedures prescribed by the commissioner.\n(g) Once the child-placing agency has determined that placement with an identified parent is in the child's best interest and has made full written disclosure about the child's social and medical history, the agency must ask the prospective adoptive parent if they are willing to adopt the child without adoption assistance. If the identified parent is either unwilling or unable to adopt the child without adoption assistance, the child-placing agency must provide documentation as prescribed by the commissioner to fulfill the requirement to make a reasonable effort to place the child without adoption assistance. If the identified parent desires to adopt the child without adoption assistance, the parent must provide a written statement to this effect to the child-placing agency and the statement must be maintained in the permanent adoption record of the child-placing agency. For children under guardianship of the commissioner, the child-placing agency shall submit a copy of this statement to the commissioner to be maintained in the permanent adoption record.\n(a) A child must be a citizen of the United States or otherwise eligible for federal public benefits according to the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, as amended, in order to be eligible for the title IV-E Adoption Assistance Program.\n(b) A child must be a citizen of the United States or meet the qualified alien requirements as defined in the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, as amended, in order to be eligible for state-funded adoption assistance.\nA background study under section 259.41 must be completed on each prospective adoptive parent. An adoptive parent is prohibited from receiving adoption assistance on behalf of an otherwise eligible child if the background study reveals:\n(1) a felony conviction at any time for:\n(i) child abuse or neglect;\n(ii) spousal abuse;\n(iii) a crime against children, including child pornography; or\n(iv) a crime involving violence, including rape, sexual assault, or homicide, but not including other physical assault or battery; or\n(2) a felony conviction within the past five years for:\n(i) physical assault;\n(ii) battery; or\n(iii) a drug-related offense.\nThe state will determine eligibility for:\n(1) a Minnesota child under the guardianship of the commissioner who would otherwise remain in foster care;\n(2) a child who is not under the guardianship of the commissioner who meets title IV-E eligibility defined in section 473 of the Social Security Act and no state agency has legal responsibility for placement and care of the child;\n(3) a Minnesota child under tribal jurisdiction who would otherwise remain in foster care; and\n(4) an Indian child being placed in Minnesota who meets title IV-E eligibility defined in section 473 of the Social Security Act. The agency or entity assuming responsibility for the child is responsible for the nonfederal share of the adoption assistance payment.\nThe commissioner shall not enter into an adoption assistance agreement with:\n(1) a child's biological parent or stepparent;\n(2) a child's relative, according to section 260C.007, subdivision 26b or 27, with whom the child resided immediately prior to child welfare involvement unless:\n(i) the child was in the custody of a Minnesota county or tribal agency pursuant to an order under chapter 260C or equivalent provisions of tribal code and the agency had placement and care responsibility for permanency planning for the child; and\n(ii) the child is under guardianship of the commissioner of children, youth, and families according to the requirements of section 260C.325, subdivision 1, paragraphs (a) and (b), or subdivision 3, paragraphs (a) and (b), or is a ward of a Minnesota tribal court after termination of parental rights, suspension of parental rights, or a finding by the tribal court that the child cannot safely return to the care of the parent;\n(3) a child's legal custodian or guardian who is now adopting the child;\n(4) an individual adopting a child who is the subject of a direct adoptive placement under section 259.47 or the equivalent in tribal code; or\n(5) an individual who is adopting a child who is not a citizen or resident of the United States and was either adopted in another country or brought to this country for the purposes of adoption.",
	"repealed": false
}