{
	"id": "270C.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.43",
	"title": "270C.43 REFUNDS PAYABLE IN INSTALLMENTS.",
	"text": "Where there is (1) a final judicial determination that a law administered by the commissioner is unconstitutional, is in violation of state or federal law, or that a regulation or statute has been misinterpreted by the department; and (2) the determination is not limited to prospective application, the procedures in this section relating to refunds attributable to that determination apply.\nThe commissioner shall estimate the cumulative refunds due resulting from the judicial determination.\nIf the commissioner determines that the cumulative refunds due all affected taxpayers will not exceed $50,000,000, the general provisions for refunding for the particular tax type apply.\n(a) If the commissioner determines that the cumulative refunds due all affected taxpayers will exceed $50,000,000, the refund procedures in this subdivision apply.\n(b) The refunds due shall be paid in five installments. The first installment will be paid during the calendar year following the later of the filing of the refund claim or the final judicial determination and subsequent installments will be paid at any time during each of the four succeeding calendar years.\n(c) The commissioner shall compute the annual refund installment due under this subdivision, and notify the taxpayer of the total amount of the claim for refund which has been allowed.\n(d) The installment paid each year equals 20 percent of the refund allowed unless the commissioner determines that the cumulative refunds due for a particular year under this section will exceed $150,000,000. If the refunds payable will exceed that amount, they will be reduced pro rata with any balance remaining due payable with the final refund installment.\n(e) Unless contrary to the provisions in this section, the provisions for refunds in the various tax types, including provisions related to the payment of interest, apply to the refunds subject to these provisions.\n(f) The commissioner may establish a de minimis individual refund amount below which the installment provisions do not apply. The amount established under this paragraph is not subject to the provisions of chapter 14.\n(g) If the commissioner of management and budget determines that it is in the best interest of the state, refunds payable under this section may be paid in fewer than five installments.",
	"repealed": false
}