{
	"id": "83.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/83.26",
	"title": "83.26 EXEMPTIONS.",
	"text": "Unless the method of offer or sale is adopted for the purpose of evasion of sections 83.20 to 83.42, 83.43 and 83.44, the following subdivided lands are exempted from sections 83.20 to 83.42:\n(a) any lands offered or sold by the United States, any state, any political subdivision of a state, or any other corporate instrumentality of one of the above;\n(b) leases of apartments, stores, offices, or similar space;\n(c) leases of rooms or space in hotels, motels, or similar space for a period of less than three years, including renewal options;\n(d) cemetery lots or interests therein;\n(e) mortgages or deeds of trust of real estate securing evidences of indebtedness;\n(f) subdivided lands which are registered as securities pursuant to the provisions of chapter 80A; and\n(g) other subdivided lands not within the intent of this chapter which the commissioner may by rule or order exempt.\nUnless the method of offer or sale is adopted for the purpose of evasion of sections 83.20 to 83.42, 83.43 and 83.44, the following transactions are exempt from sections 83.23, 83.24, 83.25, 83.28, 83.29, and 83.30:\n(a) the offer or sale of an interest in subdivided land by an owner, other than the subdivider, acting as principal in a single or isolated transaction;\n(b) the offer or sale of all of the subdivided lands within a subdivision in a single transaction to any person;\n(c) the offer or sale of subdivided land pursuant to an order of competent jurisdiction, other than a court of bankruptcy;\n(d) the offer or sale of subdivided land consisting of not more than ten separate lots, units, parcels, or interests in the aggregate, provided that no subdivider may make an offer or sale of subdivided land pursuant to this exemption more than once during any period of 12 consecutive months;\n(e) the offer or sale of subdivided lands which have been registered under section 83.23, subdivision 2, if there are no more than ten separate lots, units, parcels, or interests remaining to be sold and no material change has occurred in the information on file with the commissioner;\n(f) the offer and sale of subdivided land located within the corporate limits of a municipality as defined in section 462.352, subdivision 2, which municipality has adopted subdivision regulations as defined in section 462.352, except those lands described in section 83.20, subdivision 13;\n(g) the offer and sale of apartments or condominium units as defined in chapters 515 and 515A, and units in common interest communities as defined in chapter 515B;\n(h) the offer and sale of subdivided lands used primarily for agricultural purposes provided each parcel is at least ten acres in size;\n(i) the offer or sale of improved lots if:\n(1) the subdivider has filed with the commissioner, no later than ten business days prior to the date of the first sale, a written notice of its intention to offer or sell improved lots, which notice shall be accompanied by a fee of $50, together with a copy of the public offering statement accepted by the situs state and the standard purchase agreement which documents are required to be supplied by the subdivider to the purchaser; and\n(2) the subdivider deposits all downpayments in an escrow account until all obligations of the subdivider to the purchaser, which are pursuant to the terms of the purchase agreement to be performed prior to the closing, have been performed. The subdivider shall provide the purchaser with a purchase receipt for the downpayment paid, a copy of the escrow agreement and the name, address, and telephone number of the escrow agent. The escrow agent shall be a bank located in Minnesota. All downpayments shall be deposited in the escrow account within two business days after receipt; and\n(j) the offer of sale of subdivided lands by a subdivider that has been granted an exemption from registration by the federal Department of Housing and Urban Development under the multiple site subdivision exemption, if the subdivider provides a written notice of the offer of sale to the commissioner before any offers or sale commence.\nThe written notice must include the name of the subdivision, the county and state in which the subdivision is located, and the number of lots in the subdivision, and a notarized affidavit that all proposed improvements have been completed and the costs of all the improvements have been fully paid, or that the cost of any uncompleted road construction or survey expenses are covered by a bond or escrow account payable to the entities responsible for providing or completing the roads or surveys. The escrow account must be with an independent escrow agent.\nThe subdivider must also provide to the commissioner a copy of the federal Housing and Urban Development exemption order and the most recent annual confirmation letter which indicates that the order is still in effect.\nIf the closing services are provided by the subdivider or an affiliate of the subdivider, purchasers must manually initial in the Housing and Urban Development Lot Information Statement both the disclosure on all the liens, reservations, taxes, assessments, easements, and restrictions applicable to the lot purchased and the disclosure on the risks of not obtaining clear title.\nThe commissioner may, by rule or order, suspend, revoke, or further condition the exemptions contained in clauses (f), (g), (h), (i), and (j), or may require such further information as may be necessary for the protection of purchasers.\nThe burden of proving an exemption or an exception from a definition is upon the person claiming it.",
	"repealed": false
}