{
	"id": "299A.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.86",
	"title": "299A.86 GAAGIGE-MIKWENDAAGOZIWAG REWARD ACCOUNT FOR INFORMATION ON MISSING AND MURDERED INDIGENOUS RELATIVES.",
	"text": "As used in this section:\n(1) \"Gaagige-Mikwendaagoziwag\" means \"they will be remembered forever\";\n(2) \"missing and murdered Indigenous relatives\" means missing and murdered Indigenous people from or descended from a federally recognized Indian Tribe; and\n(3) \"Two-Spirit\" means cultural, spiritual, sexual, and gender identity as reflected in complex Indigenous understandings of gender roles, spirituality, and the long history of gender diversity in Indigenous cultures.\nAn account for rewards for information on missing and murdered Indigenous women, children, and Two-Spirit relatives is created in the special revenue fund. Money deposited into the account is appropriated to the commissioner of public safety to pay rewards and for the purposes provided under this section.\nThe director of the Office for Missing and Murdered Indigenous Relatives, in consultation with the Gaagige-Mikwendaagoziwag reward advisory group:\n(1) shall determine the eligibility criteria and procedures for granting rewards under this section; and\n(2) is authorized to pay a reward to any person who provides relevant information relating to a missing and murdered Indigenous woman, child, and Two-Spirit relative investigation.\n(a) The director of the Office for Missing and Murdered Indigenous Relatives, in consultation with the stakeholder groups described in section 299A.85, subdivision 5, shall appoint an advisory group to make recommendations on:\n(1) paying rewards under this section;\n(2) supporting community-based efforts through funding community-led searches and search kits, including but not limited to global position system devices and vests; community-led communications, including but not limited to flyers, staples, and duct tape; and other justice-related expenses;\n(3) funding for community-led communications and outreach, including but not limited to billboards and other media-related expenses;\n(4) funding activities and programs to gather information on missing and murdered Indigenous women, children, and Two-Spirit relatives and to partner with and support community-led efforts;\n(5) developing, implementing, and coordinating prevention and awareness programming based on best practices and data-driven research; and\n(6) any other funding activities and needs.\n(b) The advisory group shall consist of the following individuals:\n(1) a representative from the Office for Missing and Murdered Indigenous Relatives;\n(2) a representative from a Tribal, statewide, or local organization that provides legal services to Indigenous women and girls;\n(3) a representative from a Tribal, statewide, or local organization that provides advocacy or counseling for Indigenous women and girls who have been victims of violence;\n(4) a representative from a Tribal, statewide, or local organization that provides services to Indigenous women and girls;\n(5) a Tribal peace officer who works for or resides on a federally recognized American Indian reservation in Minnesota;\n(6) a representative from the Minnesota Human Trafficking Task Force; and\n(7) a survivor or family member of a missing and murdered Indigenous woman, child, or Two-Spirit relative.\n(c) Members serve a term of four years. Vacancies shall be filled by the appointing authority and members may be reappointed.\n(d) The advisory group shall meet as necessary but at a minimum twice per year to carry out its duties. The director shall provide necessary office space and administrative support to the group. Members of the group serve without compensation but shall receive expense reimbursement as provided in section 15.059.\n(e) The representative from the Office for Missing and Murdered Indigenous Relatives may fully participate in the advisory group's activities but may not vote on issues before the group.\nThe director of the Office for Missing and Murdered Indigenous Relatives, in consultation with the reward advisory group, may spend up to four percent of available funds on an advertising or public relations campaign to increase public awareness on the availability of rewards under this section.\nThe director of the Office for Missing and Murdered Indigenous Relatives, in consultation with the reward advisory group, may apply for and accept grants and donations from the public and from public and private entities to implement this section. The commissioner of public safety shall deposit any grants or donations received under this subdivision into the account established under subdivision 1.\nNotwithstanding section 15.059, subdivision 6, the advisory group does not expire.",
	"repealed": false
}