{
	"id": "325F.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.97",
	"title": "325F.97 PENALTIES AND REMEDIES.",
	"text": "A lessor who is found to have violated sections 325F.86 to 325F.88 is subject to the penalties and remedies provided in section 8.31.\nA violation of section 325F.90, 325F.91, or 325F.93 shall be treated as a violation of section 325F.69. The remedies provided by section 325F.90, 325F.91, or 325F.93 are cumulative and shall not be construed as restricting any remedy that is otherwise available.\nA lessee may not take any action to offset any amount for which a lessor is potentially liable under this section against any amount owed by the lessee, unless the amount of the liability of the lessor has been determined by a judgment of a court of competent jurisdiction in an action in which the lessor was a party. This section does not bar a lessee in default on an obligation arising from the rental-purchase agreement from asserting a violation of this chapter in an original action, or as defense or counterclaim to an action brought by the lessor to collect amounts owed by the lessee pursuant to the rental-purchase agreement.\nA lessor is not liable under this section for a violation of sections 325F.84 to 325F.96 if, within 60 days after discovering an error and before an action for damages is filed against the lessor pursuant to this section or written notice of the error is received from the lessee, the lessor notifies the lessee of the error and makes adjustments to the account of the lessee that are necessary to assure that the lessee is not required to pay an amount in excess of the amounts actually disclosed. This subdivision applies whether the error was discovered through the lessor's own procedures or by any other means.\nA lessor is not liable under this section for damages in excess of the actual damage sustained by the lessee if the lessor shows by a preponderance of the evidence that the violation of sections 325F.84 to 325F.96 resulted from a bona fide error notwithstanding the maintenance by the lessor of procedures reasonably adopted to avoid the error. As used in this subdivision, \"bona fide error\" includes, but is not limited to: clerical, calculation, computer malfunction and programming, and printing errors.",
	"repealed": false
}