{
	"id": "245A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.05",
	"title": "245A.05 DENIAL OF APPLICATION.",
	"text": "(a) The commissioner may deny a license if an applicant or controlling individual:\n(1) fails to submit a substantially complete application after receiving notice from the commissioner under section 245A.04, subdivision 1;\n(2) fails to comply with applicable laws or rules;\n(3) knowingly withholds relevant information from or gives false or misleading information to the commissioner in connection with an application for a license or during an investigation;\n(4) has a disqualification that has not been set aside under section 245C.22 and no variance has been granted;\n(5) has an individual living in the household who received a background study under section 245C.03, subdivision 1, paragraph (a), clause (2), who has a disqualification that has not been set aside under section 245C.22, and no variance has been granted;\n(6) is associated with an individual who received a background study under section 245C.03, subdivision 1, paragraph (a), clause (6), who may have unsupervised access to children or vulnerable adults, and who has a disqualification that has not been set aside under section 245C.22, and no variance has been granted;\n(7) fails to comply with section 245A.04, subdivision 1, paragraph (f) or (g);\n(8) fails to demonstrate competent knowledge as required by section 245A.04, subdivision 6;\n(9) has a history of noncompliance as a license holder or controlling individual with applicable laws or rules, including but not limited to this chapter and chapters 142E and 245C; or\n(10) is prohibited from holding a license according to section 245.095.\n(b) An applicant whose application has been denied by the commissioner must be given notice of the denial, which must state the reasons for the denial in plain language. Notice must be given by certified mail, by personal service, or through the provider licensing and reporting hub. The notice must state the reasons the application was denied and must inform the applicant of the right to a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The applicant may appeal the denial by notifying the commissioner in writing by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the appeal must be postmarked and sent to the commissioner within 20 calendar days after the applicant received the notice of denial. If an appeal request is made by personal service, it must be received by the commissioner within 20 calendar days after the applicant received the notice of denial. If the order is issued through the provider hub, the appeal must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub. Section 245A.08 applies to hearings held to appeal the commissioner's denial of an application.",
	"repealed": false
}