{
	"id": "181.032",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.032",
	"title": "181.032 REQUIRED STATEMENT OF EARNINGS BY EMPLOYER; NOTICE TO EMPLOYEE.",
	"text": "(a) At the end of each pay period, the employer shall provide each employee an earnings statement, either in writing or by electronic means, covering that pay period. An employer who chooses to provide an earnings statement by electronic means must provide employee access to an employer-owned computer during an employee's regular working hours to review and print earnings statements, and must make statements available for review or printing for a period of three years.\n(b) The earnings statement may be in any form determined by the employer but must include:\n(1) the name of the employee;\n(2) the rate or rates of pay and basis thereof, including whether the employee is paid by hour, shift, day, week, salary, piece, commission, or other method;\n(3) allowances, if any, claimed pursuant to permitted meals and lodging;\n(4) the total number of hours worked by the employee unless exempt from chapter 177;\n(5) the total amount of gross pay earned by the employee during that period;\n(6) a list of deductions made from the employee's pay;\n(7) any amount deducted by the employer under section 268B.14, subdivision 3, and the amount paid by the employer based on the employee's wages under section 268B.14, subdivision 1;\n(8) the net amount of pay after all deductions are made;\n(9) the date on which the pay period ends;\n(10) the legal name of the employer and the operating name of the employer if different from the legal name;\n(11) the physical address of the employer's main office or principal place of business, and a mailing address if different; and\n(12) the telephone number of the employer.\n(c) An employer must provide earnings statements to an employee in writing, rather than by electronic means, if the employer has received at least 24 hours notice from an employee that the employee would like to receive earnings statements in written form. Once an employer has received notice from an employee that the employee would like to receive earnings statements in written form, the employer must comply with that request on an ongoing basis.\n(d) At the start of employment, an employer shall provide each employee a written notice containing the following information:\n(1) the rate or rates of pay and basis thereof, including whether the employee is paid by the hour, shift, day, week, salary, piece, commission, or other method, and the specific application of any additional rates;\n(2) allowances, if any, claimed pursuant to permitted meals and lodging;\n(3) paid vacation, sick time, or other paid time-off accruals and terms of use;\n(4) the employee's employment status and whether the employee is exempt from minimum wage, overtime, and other provisions of chapter 177, and on what basis;\n(5) a list of deductions that may be made from the employee's pay;\n(6) the number of days in the pay period, the regularly scheduled pay day, and the pay day on which the employee will receive the first payment of wages earned;\n(7) the legal name of the employer and the operating name of the employer if different from the legal name;\n(8) the physical address of the employer's main office or principal place of business, and a mailing address if different; and\n(9) the telephone number of the employer.\n(e) The employer must keep a copy of the notice under paragraph (d) signed by each employee acknowledging receipt of the notice. The notice must be provided to each employee in English. The English version of the notice must include text provided by the commissioner that informs employees that they may request, by indicating on the form, the notice be provided in a particular language. If requested, the employer shall provide the notice in the language requested by the employee. The commissioner shall make available to employers the text to be included in the English version of the notice required by this section and assist employers with translation of the notice in the languages requested by their employees.\n(f) An employer must provide the employee any written changes to the information contained in the notice under paragraph (d) prior to the date the changes take effect.",
	"repealed": false
}