{
	"id": "515B.3-117",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-117",
	"title": "515B.3-117 OTHER LIENS.",
	"text": "(a) Except in a cooperative and except as otherwise provided in this chapter or in a security instrument, an individual unit owner may have the unit owner's unit released from a lien if the unit owner (1) pays the lienholder the portion of the amount which the lien secures that is attributable to the unit, or (2) provides in the manner set forth in section 514.10 the deposit or other security required by that section. Upon the receipt of payment or written evidence of the deposit or other security, the lienholder shall promptly deliver to the unit owner a recordable partial satisfaction and release of lien releasing the unit from the lien. The release shall be deemed to include a release of any rights in the common elements appurtenant to the unit. The portion of the amount which a lien secures that is attributable to the unit shall be equal to the total amount which the lien secures multiplied by a percentage calculated by dividing the common expense liability attributable to the unit by the common expense liability attributable to all units against which the lien has been recorded, or in the case of a lien under subsection (b), the units against which the lien is permitted or required to be recorded. At the request of a lien claimant or unit owners, the association shall provide a written statement of the percentage of common expense liability attributable to all units. After a unit owner's payment pursuant to this section, the association may not assess the unit for any common expense incurred thereafter in connection with the satisfaction or defense against the lien.\n(b) Labor performed or materials furnished for the improvement of a unit shall be the basis for the recording of a lien against that unit pursuant to the provisions of chapter 514 but shall not be the basis for the recording of a lien against the common elements. Labor performed or materials furnished for the improvement of common elements, for which a lien may be recorded under chapter 514, if duly authorized by the association, shall be deemed to be performed or furnished with the express consent of each unit owner, and shall be perfected by recording a lien against all the units in the common interest community, or in the case of a condominium or planned community on registered land, shall be perfected by recording a lien pursuant to section 508.351, subdivision 5, or 508A.351, subdivision 5. Where a lien is recorded against the units for labor performed or material furnished for the improvement of common elements, the association shall be deemed to be the authorized agent of the unit owners for purposes of receiving the notices required under sections 514.011 and 514.08, subdivision 1, clause (2).\n(c) A security interest in a cooperative whose unit owners' interests in the units are personal property shall be perfected by recording a financing statement in the UCC filing section of the central filing system operated by the Office of the Secretary of State. In any disposition by a secured party pursuant to section 336.9-610 or retention pursuant to sections 336.9-620 to 336.9-622, the rights of the parties shall be the same as those provided by law, subject to the exceptions and requirements set forth in section 515B.3-116(h)(3), and except that the unit owner has the right to reinstate the debt owing to the secured party by paying to the secured party, prior to the effective date of the disposition or retention, the amount which would be required to reinstate the debt under section 580.30 if the unit were wholly real estate.",
	"repealed": false
}