{
	"id": "475.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.53",
	"title": "475.53 LIMIT ON NET DEBT.",
	"text": "Except as otherwise provided in sections 475.51 to 475.74, no municipality, except a school district or a city of the first class, shall incur or be subject to a net debt in excess of three percent of the estimated market value of taxable property in the municipality.\nMS 1980 [Repealed, 1Sp1981 c 4 art 1 s 193]\nUnless its charter permits a greater net debt a city of the first class may not incur a net debt in excess of two percent of the estimated market value of all taxable property therein. If the charter of the city permits a net debt of the city in excess of two percent of its valuation, it may not incur a net debt in excess of 3-2/3 percent of the estimated market value of the taxable property therein.\nThe county auditor, at the time of preparing the tax list of the city, shall compile a statement setting forth the total net tax capacity and the total estimated market value of each class of taxable property in such city for such year.\nExcept as otherwise provided by law, no school district shall be subject to a net debt in excess of 15 percent of the estimated market value of all taxable property situated within its corporate limits, as computed in accordance with this subdivision. The county auditor of each county containing taxable real or personal property situated within any school district shall certify to the district upon request the estimated market value of all such property. Whenever the commissioner of revenue, in accordance with section 273.1325, subdivisions 1 to 6, has determined that the adjusted market value of taxable property in the district exceeds the estimated market value of property within the district, the commissioner of revenue shall certify to the district upon request the ratio most recently ascertained to exist between the estimated market value and the adjusted market value of property within the district, and the debt limit under this subdivision will be based on the estimated market value divided by the ratio certified by the commissioner of revenue.\nMS 2010 [Repealed, 2012 c 239 art 3 s 6]\nOnly that proportion of the principal amount of obligations issued by a school district or districts for the acquisition or betterment of a technical college equal to the percentage of the total principal amount of the obligations which is or would be currently borne by the district, shall be included in calculating the district's net debt. The commissioner of education shall certify to each district upon request the current percentage of the total principal amount of the obligations which is or would be borne by the district, which certification shall be conclusive in favor of the holders of the obligations as against the district.\nIf the amount of debt a municipality may incur is limited by special law or city charter to a stated percentage or proportion of assessed value, the limit must be calculated as a percentage or proportion of tax capacity. The percentage or proportion provided in the special law or charter provision must be multiplied by 10.2 to determine the applicable percentage or proportion of net tax capacity.\nA municipality may, by ordinance, reserve a portion of its unencumbered debt limit for the purpose of providing proof of financial responsibility for the contingency action portion of the response costs at a solid waste disposal facility, subject to the rules adopted by the Pollution Control Agency under section 116.07, subdivision 4h. Reservation of a portion of a municipality's debt limit under this subdivision may not be revoked by the municipality until the expiration of the required time period for maintaining proof of financial responsibility or the municipality adopts and adequately funds, as of the date of implementation, an alternate method of financial responsibility under the rules of the agency, whichever occurs earlier. If the municipality reserves its debt limit under this subdivision, the debt limit is computed as if the municipality had issued obligations, subject to the limit, in the amount of the reservation specified in the ordinance. Notwithstanding the amount of market value in the municipality, the reserved amount of the limit is available for issuance of bonds to pay the municipality's response costs.",
	"repealed": false
}