{
	"id": "256B.0913",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0913",
	"title": "256B.0913 ALTERNATIVE CARE PROGRAM.",
	"text": "The purpose of the alternative care program is to provide funding for home and community-based services for elderly persons, in order to limit nursing facility placements. The program is designed to support elderly persons in their desire to remain in the community as independently and as long as possible and to support informal caregivers in their efforts to provide care for elderly people. Further, the goals of the program are:\n(1) to contain medical assistance expenditures by funding care in the community; and\n(2) to maintain the moratorium on new construction of nursing home beds.\nAlternative care services are available to Minnesotans age 65 or older who would be eligible for medical assistance within 135 days of admission to a nursing facility and subject to subdivisions 4 to 13.\n[Repealed, 1Sp2001 c 9 art 4 s 34]\n(a) Funding for services under the alternative care program is available to persons who meet the following criteria:\n(1) the person is a citizen of the United States or a United States national;\n(2) the person has been determined by a community assessment under section 256B.0911 to be a person who would require the level of care provided in a nursing facility, as determined under section 256B.0911, subdivision 26, but for the provision of services under the alternative care program;\n(3) the person is age 65 or older;\n(4) the person would be eligible for medical assistance within 135 days of admission to a nursing facility;\n(5) the person is not ineligible for the payment of long-term care services by the medical assistance program due to an asset transfer penalty under section 256B.0595 or equity interest in the home exceeding $500,000 as stated in section 256B.056;\n(6) the person needs long-term care services that are not funded through other state or federal funding, or other health insurance or other third-party insurance such as long-term care insurance;\n(7) except for individuals described in clause (8), the monthly cost of the alternative care services funded by the program for this person does not exceed 75 percent of the monthly limit described under section 256S.18. This monthly limit does not prohibit the alternative care client from payment for additional services, but in no case may the cost of additional services purchased under this section exceed the difference between the client's monthly service limit defined under section 256S.04, and the alternative care program monthly service limit defined in this paragraph. If care-related supplies and equipment or environmental modifications and adaptations are or will be purchased for an alternative care services recipient, the costs may be prorated on a monthly basis for up to 12 consecutive months beginning with the month of purchase. If the monthly cost of a recipient's other alternative care services exceeds the monthly limit established in this paragraph, the annual cost of the alternative care services shall be determined. In this event, the annual cost of alternative care services shall not exceed 12 times the monthly limit described in this paragraph;\n(8) for individuals assigned a case mix classification A as described under section 256S.18, with (i) no dependencies in activities of daily living, or (ii) up to two dependencies in bathing, dressing, grooming, walking, and eating when the dependency score in eating is three or greater as determined by an assessment performed under section 256B.0911, the monthly cost of alternative care services funded by the program cannot exceed $593 per month for all new participants enrolled in the program on or after July 1, 2011. This monthly limit shall be applied to all other participants who meet this criteria at reassessment. This monthly limit shall be increased annually as described in section 256S.18. This monthly limit does not prohibit the alternative care client from payment for additional services, but in no case may the cost of additional services purchased exceed the difference between the client's monthly service limit defined in this clause and the limit described in clause (7) for case mix classification A;\n(9) the person is making timely payments of the assessed monthly fee. A person is ineligible if payment of the fee is over 60 days past due, unless the person agrees to:\n(i) the appointment of a representative payee;\n(ii) automatic payment from a financial account;\n(iii) the establishment of greater family involvement in the financial management of payments; or\n(iv) another method acceptable to the lead agency to ensure prompt fee payments; and\n(10) for a person participating in consumer-directed community supports, the person's monthly service limit must be equal to the monthly service limits in clause (7), except that a person assigned a case mix classification L must receive the monthly service limit for case mix classification A.\n(b) The lead agency may extend the client's eligibility as necessary while making arrangements to facilitate payment of past-due amounts and future premium payments. Following disenrollment due to nonpayment of a monthly fee, eligibility shall not be reinstated for a period of 30 days.\n(c) Alternative care funding under this subdivision is not available for a person who is a medical assistance recipient or who would be eligible for medical assistance without a spenddown or waiver obligation. A person whose initial application for medical assistance and the elderly waiver program is being processed may be served under the alternative care program for a period up to 60 days. If the individual is found to be eligible for medical assistance, medical assistance must be billed for services payable under the federally approved elderly waiver plan and delivered from the date the individual was found eligible for the federally approved elderly waiver plan. Notwithstanding this provision, alternative care funds may not be used to pay for any service the cost of which: (i) is payable by medical assistance; (ii) is used by a recipient to meet a waiver obligation; or (iii) is used to pay a medical assistance income spenddown for a person who is eligible to participate in the federally approved elderly waiver program under the special income standard provision.\n(d) Alternative care funding is not available for a person who resides in a licensed nursing home, certified boarding care home, hospital, or intermediate care facility, except for case management services which are provided in support of the discharge planning process for a nursing home resident or certified boarding care home resident to assist with a relocation process to a community-based setting.\n(e) Alternative care funding is not available for a person whose income is greater than the maintenance needs allowance under section 256S.05, but equal to or less than 120 percent of the federal poverty guideline effective July 1 in the fiscal year for which alternative care eligibility is determined, who would be eligible for the elderly waiver with a waiver obligation.\n(a) Alternative care funding may be used for payment of costs of:\n(1) adult day services and adult day services bath;\n(2) home care;\n(3) homemaker services;\n(4) personal care;\n(5) case management and conversion case management;\n(6) respite care;\n(7) specialized supplies and equipment;\n(8) home-delivered meals;\n(9) nonmedical transportation;\n(10) nursing services;\n(11) chore services;\n(12) companion services;\n(13) nutrition services;\n(14) family caregiver training and education;\n(15) coaching and counseling;\n(16) telehome care to provide services in their own homes in conjunction with in-home visits;\n(17) consumer-directed community supports;\n(18) environmental accessibility and adaptations;\n(19) transitional services; and\n(20) discretionary services, for which lead agencies may make payment from their alternative care program allocation for services not otherwise defined in this section or section 256B.0625, following approval by the commissioner.\n(b) Total annual payments for discretionary services for all clients served by a lead agency must not exceed 25 percent of that lead agency's annual alternative care program base allocation, except that when alternative care services receive federal financial participation under the 1115 waiver demonstration, funding shall be allocated in accordance with subdivision 17.\n[See Note.]\n(a) Unless specified in statute, the services, service definitions, and standards for alternative care services shall be the same as the services, service definitions, and standards specified in the federally approved elderly waiver plan, except alternative care does not cover assisted living services, adult foster care services, and residential care and benefits defined under section 256B.0625 that meet primary and acute health care needs.\n(b) The lead agency must ensure that the funds are not used to supplant or supplement services available through other public assistance or services programs, including supplementation of client co-pays, deductibles, premiums, or other cost-sharing arrangements for health-related benefits and services or entitlement programs and services that are available to the person, but in which they have elected not to enroll. The lead agency must ensure that the benefit department recovery system in the Medicaid Management Information System (MMIS) has the necessary information on any other health insurance or third-party insurance policy to which the client may have access. Supplies and equipment may be purchased from a vendor not certified to participate in the Medicaid program if the cost for the item is less than that of a Medicaid vendor.\n(c) Personal care services must meet the service standards defined in the federally approved elderly waiver plan, except that a lead agency may authorize services to be provided by a client's relative who meets the relative hardship waiver requirements or a relative who meets the criteria and is also the responsible party under an individual service plan that ensures the client's health and safety and supervision of the personal care services by a qualified professional as defined in section 256B.0625, subdivision 19c. Relative hardship is established by the lead agency when the client's care causes a relative caregiver to do any of the following: resign from a paying job, reduce work hours resulting in lost wages, obtain a leave of absence resulting in lost wages, incur substantial client-related expenses, provide services to address authorized, unstaffed direct care time, or meet special needs of the client unmet in the formal service plan.\n(d) Alternative care covers sign language interpreter services and spoken language interpreter services for recipients eligible for alternative care when the services are necessary to help deaf and hard-of-hearing recipients or recipients with limited English proficiency obtain covered services. Coverage for face-to-face spoken language interpreter services shall be provided only if the spoken language interpreter used by the enrolled health care provider is listed in the registry or roster established under section 144.058.\n[See Note.]\n[Repealed, 2007 c 147 art 7 s 76]\n[Repealed, 2007 c 147 art 7 s 76]\n[Repealed, 2007 c 147 art 7 s 76]\n[Repealed, 2007 c 147 art 7 s 76]\n[Repealed, 2007 c 147 art 7 s 76]\n[Repealed, 2007 c 147 art 7 s 76]\n[Repealed, 2007 c 147 art 7 s 76]\nThe state of Minnesota, county, lead agency under contract, or tribal government under contract to administer the alternative care program shall not be liable for damages, injuries, or liabilities sustained through the purchase of direct supports or goods by the person, the person's family, or the authorized representative with funds received through the cash payments under this section. Liabilities include, but are not limited to, workers' compensation, the Federal Insurance Contributions Act (FICA), or the Federal Unemployment Tax Act (FUTA).\n(a) The alternative care program is administered by the county agency. This agency is the lead agency responsible for the local administration of the alternative care program as described in this section. However, it may contract with the public health nursing service to be the lead agency. The commissioner may contract with federally recognized Indian tribes with a reservation in Minnesota to serve as the lead agency responsible for the local administration of the alternative care program as described in the contract. When the commissioner determines that an overpayment has been made by the state, the commissioner shall recover the overpayment.\n(b) Alternative care pilot projects operate according to this section and the provisions of Laws 1993, First Special Session chapter 1, article 5, section 133, under agreement with the commissioner. Each pilot project agreement period shall begin no later than the first payment cycle of the state fiscal year and continue through the last payment cycle of the state fiscal year.\n(a) The provision of case management under the alternative care program is governed by requirements in sections 256S.07 to 256S.09.\n(b) The case manager must not approve alternative care funding for a client in any setting in which the case manager cannot reasonably ensure the client's health and safety.\n(c) The case manager is responsible for the cost-effectiveness of the alternative care individual support plan and must not approve any plan in which the cost of services funded by alternative care and client contributions exceeds the limit specified in section 256S.18.\n(d) Case manager responsibilities include those in section 256S.09, subdivision 2.\n(a) The case manager shall implement the support plan for each alternative care client and ensure that a client's service needs and eligibility are reassessed at least every 12 months. The support plan must meet the requirements in section 256S.10. The plan shall include any services prescribed by the individual's attending physician, advanced practice registered nurse, or physician assistant as necessary to allow the individual to remain in a community setting. In developing the individual's care plan, the case manager should include the use of volunteers from families and neighbors, religious organizations, social clubs, and civic and service organizations to support the formal home care services. The lead agency shall be held harmless for damages or injuries sustained through the use of volunteers under this subdivision including workers' compensation liability. The case manager shall provide documentation in each individual's plan and, if requested, to the commissioner that the most cost-effective alternatives available have been offered to the individual and that the individual was free to choose among available qualified providers, both public and private, including qualified case management or service coordination providers other than those employed by any county; however, the county or tribe maintains responsibility for prior authorizing services in accordance with statutory and administrative requirements. The case manager must give the individual a ten-day written notice of any denial, termination, or reduction of alternative care services.\n(b) The county of service or tribe must provide access to and arrange for case management services, including assuring implementation of the support plan. \"County of service\" has the meaning given it in Minnesota Rules, part 9505.0015, subpart 11. The county of service must notify the county of financial responsibility of the approved care plan and the amount of encumbered funds.\n[Repealed, 2014 c 262 art 4 s 9]\n(a) By July 15 of each year, the commissioner shall allocate to county agencies the state funds available for alternative care for persons eligible under subdivision 2, except that when alternative care services receive federal financial participation under the 1115 waiver demonstration, funding shall be allocated in accordance with subdivision 17.\n(b) The adjusted base for each lead agency is the lead agency's current fiscal year base allocation plus any targeted funds approved during the current fiscal year. Calculations for paragraphs (c) and (d) are to be made as follows: for each lead agency, the determination of alternative care program expenditures shall be based on payments for services rendered from April 1 through March 31 in the base year, to the extent that claims have been submitted and paid by June 1 of that year, except that when alternative care services receive federal financial participation under the 1115 waiver demonstration, funding shall be allocated in accordance with subdivision 17.\n(c) If the alternative care program expenditures as defined in paragraph (b) are 95 percent or more of the lead agency's adjusted base allocation, the allocation for the next fiscal year is 100 percent of the adjusted base, plus inflation to the extent that inflation is included in the state budget.\n(d) If the alternative care program expenditures as defined in paragraph (b) are less than 95 percent of the lead agency's adjusted base allocation, the allocation for the next fiscal year is the adjusted base allocation less the amount of unspent funds below the 95 percent level.\n(e) If the annual legislative appropriation for the alternative care program is inadequate to fund the combined lead agency allocations for a biennium, the commissioner shall distribute to each lead agency the entire annual appropriation as that lead agency's percentage of the computed base as calculated in paragraphs (c) and (d).\n(f) On agreement between the commissioner and the lead agency, the commissioner may have discretion to reallocate alternative care base allocations distributed to lead agencies in which the base amount exceeds program expenditures.\n(a) The purpose of targeted funding is to make additional money available to lead agencies with the greatest need. Targeted funds are not intended to be distributed equitably among all lead agencies, but rather, allocated to those with long-term care strategies that meet state goals.\n(b) The funds available for targeted funding shall be the total appropriation for each fiscal year minus lead agency allocations determined under subdivision 10 as adjusted for any inflation increases provided in appropriations for the biennium, except that when alternative care services receive federal financial participation under the 1115 waiver demonstration, funding shall be allocated in accordance with subdivision 17.\n(c) The commissioner shall allocate targeted funds to lead agencies that demonstrate to the satisfaction of the commissioner that they have developed feasible plans to increase alternative care spending, except that when alternative care services receive federal financial participation under the 1115 waiver demonstration, funding shall be allocated in accordance with subdivision 17. In making targeted funding allocations, the commissioner shall use the following priorities:\n(1) lead agencies that received a lower allocation in fiscal year 1991 than in fiscal year 1990. Counties remain in this priority until they have been restored to their fiscal year 1990 level plus inflation;\n(2) lead agencies that sustain a base allocation reduction for failure to spend 95 percent of the allocation if they demonstrate that the base reduction should be restored;\n(3) lead agencies that propose projects to divert community residents from nursing home placement or convert nursing home residents to community living; and\n(4) lead agencies that can otherwise justify program growth by demonstrating the existence of waiting lists, demographically justified needs, or other unmet needs.\n(d) Lead agencies that would receive targeted funds according to paragraph (c) must demonstrate to the commissioner's satisfaction that the funds would be appropriately spent by showing how the funds would be used to further the state's alternative care goals as described in subdivision 1, and that the county has the administrative and service delivery capability to use them.\n(e) The commissioner shall make applications available for targeted funds by November 1 of each year, except that when alternative care services receive federal financial participation under the 1115 waiver demonstration, funding shall be allocated in accordance with subdivision 17. The lead agencies selected for targeted funds shall be notified of the amount of their additional funding. Targeted funds allocated to a lead agency in one year shall be treated as part of the lead agency's base allocation for that year in determining allocations for subsequent years. No reallocations between lead agencies shall be made.\n(a) A fee is required for all alternative care eligible clients to help pay for the cost of participating in the program. The amount of the fee for the alternative care client shall be determined as follows:\n(1) when the alternative care client's income less recurring and predictable medical expenses is less than 100 percent of the federal poverty guideline effective on July 1 of the state fiscal year in which the fee is being computed, and total assets are less than $10,000, the fee is zero;\n(2) when the alternative care client's income less recurring and predictable medical expenses is equal to or greater than 100 percent but less than 150 percent of the federal poverty guideline effective on July 1 of the state fiscal year in which the fee is being computed, and total assets are less than $10,000, the fee is five percent of the cost of alternative care services;\n(3) when the alternative care client's income less recurring and predictable medical expenses is equal to or greater than 150 percent but less than 200 percent of the federal poverty guidelines effective on July 1 of the state fiscal year in which the fee is being computed and assets are less than $10,000, the fee is 15 percent of the cost of alternative care services;\n(4) when the alternative care client's income less recurring and predictable medical expenses is equal to or greater than 200 percent of the federal poverty guidelines effective on July 1 of the state fiscal year in which the fee is being computed and assets are less than $10,000, the fee is 30 percent of the cost of alternative care services; and\n(5) when the alternative care client's assets are equal to or greater than $10,000, the fee is 30 percent of the cost of alternative care services.\nFor married persons, total assets are defined as the total marital assets less the estimated community spouse asset allowance, under section 256B.059, if applicable. For married persons, total income is defined as the client's income less the monthly spousal allotment, under section 256B.058.\nAll alternative care services shall be included in the estimated costs for the purpose of determining the fee.\nFees are due and payable each month alternative care services are received unless the actual cost of the services is less than the fee, in which case the fee is the lesser amount.\n(b) The fee shall be waived by the commissioner when:\n(1) a person is residing in a nursing facility;\n(2) a married couple is requesting an asset assessment under the spousal impoverishment provisions;\n(3) a person is found eligible for alternative care, but is not yet receiving alternative care services including case management services;\n(4) a person has chosen to participate in a consumer-directed service plan; or\n(5) a person is receiving temporary alternative care services.\n(c) The commissioner will bill and collect the fee from the client. Money collected must be deposited in the general fund and is appropriated to the commissioner for the alternative care program. The client must supply the lead agency with the client's Social Security number at the time of application. The lead agency shall supply the commissioner with the client's Social Security number and other information the commissioner requires to collect the fee from the client. The commissioner shall collect unpaid fees using the Revenue Recapture Act in chapter 270A and other methods available to the commissioner. The commissioner may require lead agencies to inform clients of the collection procedures that may be used by the state if a fee is not paid.\nThe lead agency biennial plan for long-term care consultation services under section 256B.0911, the alternative care program under this section, and waivers for the elderly under chapter 256S, shall be submitted by the lead agency as the home and community-based services quality assurance plan on a form provided by the commissioner.\n(a) Unless otherwise specified in statute, providers must be enrolled as Minnesota health care program providers and abide by the requirements for provider participation according to Minnesota Rules, part 9505.0195.\n(b) Payment for provided alternative care services as approved by the client's case manager shall occur through the invoice processing procedures of the department's Medicaid Management Information System (MMIS). To receive payment, the lead agency or vendor must submit invoices within 12 months following the date of service. The lead agency and its vendors shall not be reimbursed for services which exceed the county allocation. Service rates are governed by section 256S.15.\n[Repealed, 1998 c 407 art 4 s 69]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\nWhen alternative care services receive federal financial participation under the 1115 waiver demonstration, alternative care funding shall be distributed in accordance with the projected demand for services based on service and financial eligibility. Discretionary alternative care services not listed in subdivision 5 or section 256B.0625 require approval from the commissioner.",
	"repealed": false
}