{
	"id": "201.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.071",
	"title": "201.071 REGISTRATION APPLICATIONS.",
	"text": "Both paper and electronic voter registration applications must contain the same information unless otherwise provided by law. A voter registration application must contain spaces for the following required information: voter's first name, middle name, and last name; voter's previous name, if any; voter's current address; voter's previous address, if any; voter's date of birth; voter's municipality and county of residence; voter's telephone number, if provided by the voter; date of registration; current and valid Minnesota driver's license number or Minnesota state identification number, or if the voter has no current and valid Minnesota driver's license or Minnesota state identification, the last four digits of the voter's Social Security number; a box to indicate a voter's preference to join the permanent absentee voter list; and voter's signature. The paper registration application must provide a space for a voter to provide a physical description of the location of their residence, if the voter resides in an area lacking a specific physical address. The description must be sufficient for the county auditor to identify the correct precinct for the voter. The description may include the closest cross street or the nearest address to the described location that is identified on a precinct map, and directions from that cross street or address to the described location, including but not limited to the cardinal direction and approximate distance to the location. The paper registration application may include the voter's email address, if provided by the voter. The electronic voter registration application must include the voter's email address. The registration application may include the voter's interest in serving as an election judge, if indicated by the voter. The application must also contain the following certification of voter eligibility:\n\"I certify that I:\n(1) am at least 16 years old and understand that I must be at least 18 years old to be eligible to vote;\n(2) am a citizen of the United States;\n(3) will have maintained residence in Minnesota for 20 days immediately preceding election day;\n(4) maintain residence at the address or location given on the registration form;\n(5) am not under court-ordered guardianship in which the court order revokes my right to vote;\n(6) have not been found by a court to be legally incompetent to vote;\n(7) am not currently incarcerated for a conviction of a felony offense; and\n(8) have read and understand the following statement: that giving false information is a felony punishable by not more than five years imprisonment or a fine of not more than $10,000, or both.\"\nThe certification must include boxes for the voter to respond to the following questions:\n\"(1) Are you a citizen of the United States?\" and\n\"(2) Are you at least 16 years old and will you be at least 18 years old on or before the day of the election in which you intend to vote?\"\nAnd the instruction:\n\"If you checked 'no' to either of these questions, do not complete this form.\"\nThe form of the voter registration application and the certification of voter eligibility must be as provided in this subdivision and approved by the secretary of state. Voter registration forms authorized by the National Voter Registration Act must also be accepted as valid. The federal postcard application form must also be accepted as valid if it is not deficient and the voter is eligible to register in Minnesota.\nAn individual may use a voter registration application to apply to register to vote in Minnesota or to change information on an existing registration.\n(a) A registration application shall be accompanied by instructions specifying the manner and method of registration, the qualifications for voting, the penalties for false registration, and the availability of registration and voting assistance for elderly and disabled individuals and residents of health care facilities and hospitals.\n(b) The instructions must indicate that the voter must provide a valid Minnesota driver's license or identification card number, or the last four digits of the voter's Social Security number, unless the voter has not been issued one of those numbers.\n(c) If, prior to election day, a person requests the instructions in Braille, audio format, or in a version printed in 16-point bold type with 24-point leading, the county auditor shall provide them in the form requested. The secretary of state shall prepare Braille and audio copies and make them available.\nNo voter registration application is deficient if it contains the voter's name, address or location of residence, date of birth, current and valid Minnesota driver's license number or Minnesota state identification number, or if the voter has no current and valid Minnesota driver's license or Minnesota state identification number, the last four digits of the voter's Social Security number, if the voter has been issued a Social Security number, prior registration, if any, and signature. The absence of a zip code number does not cause the registration to be deficient. Failure to check a box on an application form that a voter has certified to be true does not cause the registration to be deficient. The election judges shall request an individual to correct a voter registration application if it is deficient or illegible. No eligible voter may be prevented from voting unless the voter's registration application is deficient or the voter is duly and successfully challenged in accordance with section 201.195 or 204C.12.\nA voter registration application accepted prior to August 1, 1983, is not deficient for lack of date of birth. The county or municipality may attempt to obtain the date of birth for a voter registration application accepted prior to August 1, 1983, by a request to the voter at any time except at the polling place. Failure by the voter to comply with this request does not make the registration deficient.\nA voter registration application accepted before January 1, 2004, is not deficient for lack of a valid Minnesota driver's license or state identification number or the last four digits of a Social Security number. A voter registration application submitted by a voter who does not have a Minnesota driver's license or state identification number, or a Social Security number, is not deficient for lack of any of these numbers.\nA voter registration application submitted electronically through the website of the secretary of state prior to April 30, 2014, is not invalid as a result of its electronic submission.\nA county auditor who receives a registration application indicating that an individual was previously registered in a different county in Minnesota shall update the voter's record electronically through the statewide registration system in the manner prescribed by the secretary of state. A county auditor who receives a registration application or notification requiring a change of registration records under this subdivision as a result of an election day registration shall also check the statewide registration system to determine whether the individual voted in more than one precinct in the most recent election.\n[Repealed, 1990 c 585 s 34]\n[Repealed, 1990 c 585 s 34]\n[Repealed, 1983 c 124 s 6]\nSchool districts shall assist county auditors in determining the school district in which a voter maintains residence.",
	"repealed": false
}