{
	"id": "576.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/576.35",
	"title": "576.35 NOTICES, MOTIONS, AND ORDERS.",
	"text": "Any party in interest may make an appearance in a receivership by filing a written notice of appearance, including the name, mailing address, fax number, email address, if any, and telephone number of the party in interest and its attorney, if any, and by serving a copy on the receiver and the receiver's attorney, if any. It is not necessary for a party in interest to be joined as a party to be heard in the receivership. A proof of claim does not constitute a written notice of appearance.\nFrom time to time the receiver shall file an updated master service list consisting of the names, mailing addresses, and, where available, fax numbers and email addresses of the respondent, the receiver, all persons joined as parties in the receivership, all persons known by the receiver to have asserted any ownership or lien in receivership property, all persons who have filed a notice of appearance in accordance with this section, and their attorneys, if any.\nExcept as otherwise provided in this chapter, an order shall be sought by a motion brought in compliance with the Minnesota Rules of Civil Procedure and the General Rules of Practice for the District Courts.\nExcept as otherwise provided in this chapter, a motion shall be served as provided in the Minnesota Rules of Civil Procedure, unless the court orders otherwise, on all persons on the master service list, all persons who have asserted an ownership interest or lien in receivership property that is the subject of the motion, all persons who are identified in the motion as directly affected by the relief requested, and other persons as the court may direct.\nAny request for relief against a state agency shall be served as provided in the Minnesota Rules of Civil Procedure, unless the court orders otherwise, on the specific state agency and on the Office of the Attorney General.\nWhere a provision in this chapter, an order issued in the receivership, or a court rule requires an objection or other response to a motion or application within a specific time, and no objection or other response is interposed, the court may grant the relief requested without a hearing.\nWhere a provision of this chapter permits, as to administrative matters, or where it otherwise appears that no party in interest would be materially prejudiced, the court may issue an order ex parte or based on an application without a motion, notice, or hearing.\nExcept as to persons entitled to be served pursuant to subdivision 4 and who were not served, an order of the court binds parties in interest and all persons who file notices of appearance, submit proofs of claim, receive written notice of the receivership, receive notice of any motion in the receivership, or who have actual knowledge of the receivership whether they are joined as parties or received notice of the specific motion or order.",
	"repealed": false
}