{
	"id": "626.8452",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8452",
	"title": "626.8452 DEADLY FORCE AND FIREARMS USE; POLICIES AND INSTRUCTION REQUIRED.",
	"text": "By January 1, 1992, the head of every local and state law enforcement agency shall establish and enforce a written policy governing the use of force, including deadly force, as defined in section 609.066, by peace officers and part-time peace officers employed by the agency. The policy must be consistent with the provisions of section 609.066, subdivision 2, and may not prohibit the use of deadly force under circumstances in which that force is justified under section 609.066, subdivision 2.\n(a) By September 1, 2020, the board, in consultation with interested parties, shall adopt an updated comprehensive written model policy on the use of force, including deadly force, by peace officers, and distribute this policy to the chief law enforcement officer of every law enforcement agency in the state. The model policy must recognize and respect the sanctity and value of all human life and the need to treat everyone with dignity and without prejudice. At a minimum, the policy must include:\n(1) a duty for peace officers to intercede when present and observing another peace officer using force that is clearly beyond what is objectively reasonable under the law and the particular circumstances of the case, and in a position to do so;\n(2) a duty for peace officers to report any illegal use of force by another peace officer to the officer's chief law enforcement officer; and\n(3) a duty for peace officers to only use deadly force including techniques that are restricted by section 609.06, subdivision 3, as authorized in section 609.066. However, even in those circumstances, the policy must require that less lethal measures be considered first by the officer.\n(b) The board shall incorporate all applicable standards in sections 609.06, subdivision 3, and 609.066, even if a standard has a delayed effective date. The revised model policy shall clearly identify the effective date of provisions with an effective date beyond September 1, 2020.\n(c) By December 15, 2020, the chief law enforcement officer of every state and local law enforcement agency must update the policy required under subdivision 1 so that it is identical or substantially similar to the model policy developed by the board under this subdivision. The board must assist the chief law enforcement officer of each state and local law enforcement agency in developing and implementing policies under this subdivision.\n(a) A law enforcement agency shall not discharge, discipline, threaten, retaliate, otherwise discriminate against, or penalize a peace officer regarding the officer's compensation, terms, conditions, location, or privileges of employment because the officer interceded or made a report in compliance with section 626.8475 or a policy adopted under subdivision 1a regarding another employee or peace officer who used excessive force.\n(b) A court may order the law enforcement agency to pay back wages and offer job reinstatement to any officer discharged from employment in violation of paragraph (a).\n(c) In addition to any remedies otherwise provided by law, a peace officer injured by a violation of paragraph (a) may bring a civil action for recovery of damages together with costs and disbursements, including reasonable attorney fees, and may receive injunctive and other equitable relief, including reinstatement, as determined by the court.\n(a) A peace officer or employee of a law enforcement agency may not threaten, harass, retaliate, or otherwise discriminate against a peace officer because the officer interceded or made a report in compliance with section 626.8475 or a policy adopted under subdivision 1a regarding another employee or peace officer who used excessive force.\n(b) A person who violates paragraph (a) is subject to disciplinary action as determined by the chief law enforcement officer of the agency employing the person.\n(c) A peace officer who is the victim of conduct prohibited in paragraph (a) may bring a civil action for recovery of damages together with costs and disbursements, including reasonable attorney fees, and may receive injunctive and other equitable relief as determined by the court.\nBeginning January 1, 1992, the head of every local and state law enforcement agency shall provide instruction on the use of force, deadly force, and the use of firearms to every peace officer and part-time peace officer newly appointed by or beginning employment with the agency. This instruction must occur before the agency head issues a firearm to the officer or otherwise authorizes the officer to carry a firearm in the course of employment. The instruction must be based on the agency's written policy required in subdivision 1 and on the instructional materials required by the board for peace officer and part-time peace officer licensure.\nBeginning January 1, 1992, the head of every local and state law enforcement agency shall provide the instruction described in subdivision 2 to every peace officer and part-time peace officer currently employed by the agency. This instruction must be provided at least once a year.\nThe head of every local and state law enforcement agency shall maintain written records of the agency's compliance with the requirements of subdivisions 1a, 2, and 3.\nThe board has authority to inspect state and local law enforcement agency policies to ensure compliance with this section. The board may conduct this inspection based upon a complaint it receives about a particular agency or through a random selection process. The board may impose licensing sanctions and seek injunctive relief under section 214.11 for failure to comply with the requirements of this section.",
	"repealed": false
}