{
	"id": "290.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.92",
	"title": "290.92 TAX WITHHELD AT SOURCE UPON WAGES; OTHER PAYMENTS.",
	"text": "(1) Wages. For purposes of this section, the term \"wages\" means the same as that term is defined in section 3401(a), (f), and (i) of the Internal Revenue Code.\n(2) Payroll period. For purposes of this section the term \"payroll period\" means a period for which a payment of wages is ordinarily made to the employee by the employee's employer, and the term \"miscellaneous payroll period\" means a payroll period other than a daily, weekly, biweekly, semimonthly, monthly, quarterly, semiannual, or annual payroll period.\n(3) Employee. For purposes of this section the term \"employee\" means any resident individual performing services for an employer, either within or without, or both within and without the state of Minnesota, and every nonresident individual performing services within the state of Minnesota, the performance of which services constitute, establish, and determine the relationship between the parties as that of employer and employee. As used in the preceding sentence, the term \"employee\" includes an officer of a corporation, and an officer, employee, or elected official of the United States, a state, or any political subdivision thereof, or the District of Columbia, or any agency or instrumentality of any one or more of the foregoing.\n(4) Employer. For purposes of this section the term \"employer\" means any person, including individuals, fiduciaries, estates, trusts, partnerships, limited liability companies, and corporations transacting business in or deriving any income from sources within the state of Minnesota for whom an individual performs or performed any service, of whatever nature, as the employee of such person, except that if the person for whom the individual performs or performed the services does not have control of the payment of the wages for such services, the term \"employer,\" except for purposes of paragraph (1), means the person having control of the payment of such wages. As used in the preceding sentence, the term \"employer\" includes any corporation, individual, estate, trust, or organization which is exempt from taxation under section 290.05 and further includes, but is not limited to, officers of corporations who have control, either individually or jointly with another or others, of the payment of the wages.\n(5) Number of withholding allowances claimed. For purposes of this section, the term \"number of withholding allowances claimed\" means the number of withholding allowances claimed in a withholding allowances certificate in effect under subdivision 5, except that if no such certificate is in effect, the number of withholding allowances claimed shall be considered to be zero.\n[Repealed, Ex1967 c 32 art 14 s 12]\n(1) Deductions. Every employer making payment of wages shall deduct and withhold upon such wages a tax as provided in this section.\n(2) Withholding on payroll period. The employer shall withhold the tax on the basis of each payroll period or as otherwise provided in this section.\n(3) Withholding tables. Unless the amount of tax to be withheld is determined as provided in subdivision 3, the amount of tax to be withheld for each individual shall be based upon tables to be prepared and distributed by the commissioner. The tables shall be computed for the several permissible withholding periods and shall take account of allowances allowed under this section; and the amounts computed for withholding shall be such that the amount withheld for any individual during the individual's taxable year shall approximate in the aggregate as closely as possible the tax which is levied and imposed under this chapter for that taxable year, upon the individual's salary, wages, or compensation for personal services of any kind for the employer.\n(4) Miscellaneous payroll period. If wages are paid with respect to a period which is not a payroll period, the amount to be deducted and withheld shall be that applicable in the case of a miscellaneous payroll period containing a number of days, including Sundays and holidays, equal to the number of days in the period with respect to which such wages are paid.\n(5) Miscellaneous payroll period. (a) In any case in which wages are paid by an employer without regard to any payroll period or other period, the amount to be deducted and withheld shall be that applicable in the case of a miscellaneous payroll period containing a number of days equal to the number of days, including Sundays and holidays, which have elapsed since the date of the last payment of such wages by such employer during the calendar year, or the date of commencement of employment with such employer during such year, or January 1 of such year, whichever is the later.\n(b) In any case in which the period, or the time described in clause (a), in respect of any wages is less than one week, the commissioner, under rules prescribed by the commissioner, may authorize an employer to determine the amount to be deducted and withheld under the tables applicable in the case of a weekly payroll period, in which case the aggregate of the wages paid to the employee during the calendar week shall be considered the weekly wages.\n(6) Wages computed to nearest dollar. If the wages exceed the highest bracket, in determining the amount to be deducted and withheld under this subdivision, the wages may, at the election of the employer, be computed to the nearest dollar.\n(7) Rules on withholding. The commissioner may, by rule, authorize employers:\n(a) to estimate the wages which will be paid to any employee in any quarter of the calendar year;\n(b) to determine the amount to be deducted and withheld upon each payment of wages to such employee during such quarter as if the appropriate average of the wages so estimated constituted the actual wages paid; and\n(c) to deduct and withhold upon any payment of wages to such employee during such quarter such amount as may be necessary to adjust the amount actually deducted and withheld upon wages of such employee during such quarter to the amount required to be deducted and withheld during such quarter without regard to this paragraph (7).\n(8) Additional withholding. The commissioner is authorized to provide by rule for increases or decreases in the amount of withholding otherwise required under this section in cases where the employee requests the changes. Such additional withholding shall for all purposes be considered tax required to be deducted and withheld under this section.\n(9) Tips. In the case of tips which constitute wages, this subdivision shall be applicable only to such tips as are included in a written statement furnished to the employer pursuant to section 6053 of the Internal Revenue Code and only to the extent that the tax can be deducted and withheld by the employer, at or after the time such statement is so furnished and before the close of the calendar year in which such statement is furnished, from such wages of the employee (excluding tips, but including funds turned over by the employee to the employer for the purpose of such deduction and withholding) as are under the control of the employer; and an employer who is furnished by an employee a written statement of tips (received in a calendar month) pursuant to section 6053 of the Internal Revenue Code to which subdivision 1 is applicable may deduct and withhold the tax with respect to such tips from any wages of the employee (excluding tips) under the employer's control, even though at the time such statement is furnished the total amount of the tips included in statements furnished to the employer as having been received by the employee in such calendar month in the course of employment by such employer is less than $20. Such tax shall not at any time be deducted and withheld in an amount which exceeds the aggregate of such wages and funds as are under the control of the employer minus any tax required by other provisions of state or federal law to be collected from such wages and funds.\n(10) Vehicle fringe benefits. An employer shall not deduct and withhold any tax under this section with respect to any vehicle fringe benefit provided to an employee if the employer has so elected for federal purposes and the requirement of and the definition contained in section 3402(s) of the Internal Revenue Code are complied with.\n[Expired]\nIf payment of wages is made to an employee by an employer\n(a) With respect to a payroll period or other period, any part of which is included in a payroll period or other period with respect to which wages are also paid to such employees by such employer, or\n(b) Without regard to any payroll period or other period, but on or prior to the expiration of a payroll period or other period with respect to which wages are also paid to such employee by such employer, or\n(c) With respect to a period beginning in one and ending in another calendar year, or\n(d) Through an agent, fiduciary, or other person who also has the control, receipt, custody, or disposal of or pays, the wages payable by another employer to such employee.\nThe manner of withholding and the amount to be deducted and withheld under subdivision 2a shall be determined in accordance with rules prescribed by the commissioner under which the withholding allowance allowed to the employee in any calendar year shall approximate the withholding allowance allowable with respect to an annual payroll period, except that if supplemental wages are not paid concurrent with a payroll period the employer shall withhold tax on the supplemental payment at the rate of 6.25 percent as if no allowance had been claimed.\nIf the remuneration paid by an employer to an employee for services performed during one-half or more of any payroll period of not more than 31 consecutive days constitutes wages, all the remuneration paid by such employer to such employee for such period shall be deemed to be wages; but if the remuneration paid by an employer to an employee for services performed during more than one-half of any such payroll period does not constitute wages, then none of the remuneration paid by such employer to such employee for such period shall be deemed to be wages.\n(1) \"Wages\" paid to nonresident employees. For the purposes of this section: The term \"wages\" means all remuneration taxable under this chapter including all remuneration paid to a nonresident employee for services performed in this state.\n(2) \"Employer,\" \"wages\" and \"employee\" concerning nonresidents. Notwithstanding any other provision of this section, under rules to be prescribed by the commissioner of revenue, for purposes of this section any person having control, receipt, custody, disposal or payment of compensation taxable under this chapter and earned by a nonresident for personal services, shall be deemed an employer, any compensation taxable under this chapter and earned by a nonresident for personal services shall be deemed wages, and a nonresident entitled to compensation taxable under this chapter and earned by the nonresident for personal services shall be deemed an employee.\nWhen compensation for personal services is paid to a corporation in which all or substantially all of the shareholders are individual entertainers, performers or athletes who gave an entertainment or athletic performance in this state for which the compensation was paid, the compensation shall be deemed wages of the individual entertainers, performers or athletes and shall be subject to the provisions of this section. Advance payments of compensation for personal services to be performed in Minnesota shall be deemed wages and subject to the provisions of this section.\n(3) Nonresidents, employer's duty. The employer of any employee domiciled in a state with which Minnesota has reciprocity under section 290.081 is not required to withhold under this chapter from the wages earned by such employee in this state if the employee annually submits to the employer an affidavit of residency in the form prescribed by the commissioner. The affidavit must be submitted by the later of\n(i) 30 days after the employment date or\n(ii) August 31 for calendar year 1987 and February 28 for subsequent calendar years.\n(a) A partnership shall deduct and withhold a tax as provided in paragraph (b) for nonresident individual partners based on their distributive shares of partnership income for a taxable year of the partnership.\n(b) The amount of tax withheld is determined by multiplying the partner's distributive share allocable to Minnesota under section 290.17, paid or credited during the taxable year by the highest rate used to determine the income tax liability for an individual under section 290.06, subdivision 2c, except that the amount of tax withheld may be determined by the commissioner if the partner submits a withholding allowance certificate under subdivision 5.\n(c) The commissioner may reduce or abate the tax withheld under this subdivision if the partnership had reasonable cause to believe that no tax was due under this section.\n(d) Notwithstanding paragraph (a), a partnership is not required to deduct and withhold tax for a nonresident partner if:\n(1) the partner elects to have the tax due paid as part of the partnership's composite return under section 289A.08, subdivision 7;\n(2) the partner has Minnesota assignable federal adjusted gross income from the partnership of less than $1,000; or\n(3) the partnership is liquidated or terminated, the income was generated by a transaction related to the termination or liquidation, and no cash or other property was distributed in the current or prior taxable year;\n(4) the distributive shares of partnership income are attributable to:\n(i) income required to be recognized because of discharge of indebtedness;\n(ii) income recognized because of a sale, exchange, or other disposition of real estate, depreciable property, or property described in section 179 of the Internal Revenue Code; or\n(iii) income recognized on the sale, exchange, or other disposition of any property that has been the subject of a basis reduction pursuant to section 108, 734, 743, 754, or 1017 of the Internal Revenue Code to the extent that the income does not include cash received or receivable or, if there is cash received or receivable, to the extent that the cash is required to be used to pay indebtedness by the partnership or a secured debt on partnership property;\n(5) the partnership is a publicly traded partnership, as defined in section 7704(b) of the Internal Revenue Code; or\n(6) the partnership has elected to pay the pass-through entity tax under section 289A.08, subdivision 7a.\n(e) For purposes of sections 270C.60, 289A.09, subdivision 2, 289A.20, subdivision 2, paragraph (c), 289A.50, 289A.56, 289A.60, and 289A.63, a partnership is considered an employer.\n(f) To the extent that income is exempt from withholding under paragraph (d), clause (4), the commissioner has a lien in an amount up to the amount that would be required to be withheld with respect to the income of the partner attributable to the partnership interest, but for the application of paragraph (d), clause (4). The lien arises under section 270C.63 from the date of assessment of the tax against the partner, and attaches to that partner's share of the profits and any other money due or to become due to that partner in respect of the partnership. Notice of the lien may be sent by mail to the partnership, without the necessity for recording the lien. The notice has the force and effect of a levy under section 270C.67, and is enforceable against the partnership in the manner provided by that section. Upon payment in full of the liability subsequent to the notice of lien, the partnership must be notified that the lien has been satisfied.\n(a) A corporation having a valid election in effect under section 290.9725 shall deduct and withhold a tax as provided in paragraph (b) for nonresident individual shareholders their share of the corporation's income for the taxable year.\n(b) The amount of tax withheld is determined by multiplying the amount of income allocable to Minnesota under section 290.17 by the highest rate used to determine the income tax liability of an individual under section 290.06, subdivision 2c, except that the amount of tax withheld may be determined by the commissioner if the shareholder submits a withholding allowance certificate under subdivision 5.\n(c) Notwithstanding paragraph (a), a corporation is not required to deduct and withhold tax for a nonresident shareholder, if:\n(1) the shareholder elects to have the tax due paid as part of the corporation's composite return under section 289A.08, subdivision 7;\n(2) the shareholder has Minnesota assignable federal adjusted gross income from the corporation of less than $1,000;\n(3) the corporation is liquidated or terminated, the income was generated by a transaction related to the termination or liquidation, and no cash or other property was distributed in the current or prior taxable year; or\n(4) the S corporation has elected to pay the pass-through entity tax under section 289A.08, subdivision 7a.\n(d) For purposes of sections 270C.60, 289A.09, subdivision 2, 289A.20, subdivision 2, paragraph (c), 289A.50, 289A.56, 289A.60, and 289A.63, a corporation is considered an employer.\n(1) An employee receiving wages shall on any day be entitled to claim withholding allowances in a number not to exceed the number of withholding allowances that the employee claims and that are allowable pursuant to section 3402(f)(1) of the Internal Revenue Code for federal withholding purposes, except:\n(i) the standard deduction amount for the purposes of section 3402(f)(1)(E) of the Internal Revenue Code shall be the amount calculated under section 290.0123;\n(ii) the allowance amount for the purposes of section 3402(f)(1)(A) of the Internal Revenue Code shall be the amount calculated under section 290.0121, subdivision 1;\n(iii) withholding allowances under sections 3402(f)(1)(C) and (D) of the Internal Revenue Code are not allowed;\n(iv) estimated itemized deductions allowable under section 290.0122, but only if the employee's spouse does not have in effect a withholding certificate electing this allowance; and\n(v) any additional allowances, at the discretion of the commissioner, that are in the best interests of determining the proper amount to withhold for the payment of taxes under this chapter.\n(2) Withholding allowance certificate. The provisions concerning allowance certificates contained in section 3402(f)(2) and (3) of the Internal Revenue Code shall apply.\n(3) Form of certificate. Withholding allowance certificates shall be in such form and contain such information as the commissioner may by rule prescribe.\n(a) An employer shall submit to the commissioner a copy of any withholding allowance certificate or any affidavit of residency received from an employee on which the employee claims any of the following:\n(1) a total number of withholding allowances in excess of ten or a number prescribed by the commissioner, or\n(2) a status that would exempt the employee from Minnesota withholding, including where the employee is a nonresident exempt from withholding under subdivision 4a, clause (3), except where the employer reasonably expects, at the time that the certificate is received, that the employee's wages under subdivision 1 from the employer will not then usually exceed $200 per week, or\n(3) any number of withholding allowances which the employer has reason to believe is in excess of the number to which the employee is entitled.\n(b) Copies of allowance certificates and affidavits of residency required to be submitted by paragraph (a) shall be submitted to the commissioner within 30 days after receipt by the employer unless the employer is also required by federal law to submit copies to the Internal Revenue Service, in which case the employer may elect to submit the copies to the commissioner at the same time that the employer is required to submit them to the Internal Revenue Service.\n(c) An employer who submits a copy of a withholding allowance certificate in accordance with paragraph (a) shall honor the certificate until notified by the commissioner that the certificate is invalid. The commissioner shall mail a copy of any such notice to the employee. Upon notification that a particular certificate is invalid, the employer shall not honor that certificate or any subsequent certificate unless instructed to do so by the commissioner. The employer shall allow the employee the number of allowances and compute the withholding tax as instructed by the commissioner in accordance with paragraph (d).\n(d) The commissioner may require an employee to verify entitlement to the number of allowances or to the exempt status claimed on the withholding allowance certificate or, to verify nonresidency. The employee shall be allowed at least 30 days to submit the verification, after which time the commissioner shall, on the basis of the best information available to the commissioner, determine the employee's status and allow the employee the maximum number of withholding allowances allowable under this chapter. The commissioner shall mail a notice of this determination to the employee at the address listed on the allowance certificate in question or to the last known address of the employee. Pursuant to section 270B.06, the commissioner may notify the employer of this determination and instruct the employer to withhold tax in accordance with the determination.\nHowever, where the commissioner has reasonable grounds for believing that the employee is about to leave the state or that the collection of any tax due under this chapter will be jeopardized by delay, the commissioner may immediately notify the employee and the employer, pursuant to section 270B.06, that the certificate is invalid, and the employer must not honor that certificate or any subsequent certificate unless instructed to do so by the commissioner. The employer shall allow the employee the number of allowances and compute the withholding tax as instructed by the commissioner.\n(e) The commissioner's determination under paragraph (d) shall be appealable to Tax Court in accordance with section 271.06, and shall remain in effect for withholding tax purposes pending disposition of any appeal.\n[Repealed, 1990 c 480 art 1 s 45]\n[Renumbered 270C.60]\n[Repealed, 2005 c 151 art 1 s 117]\n[Repealed, 1990 c 480 art 1 s 45]\n[Repealed, 1990 c 480 art 1 s 45]\nThe commissioner may grant permission to employers, or persons withholding tax under section 290.923, subdivision 2, who do not desire to use the withholding tax tables provided in accordance with paragraph (3) of subdivision 2a, or section 290.923, subdivision 2, to determine the amount of tax to be withheld by use of a method of withholding other than withholding tax tables, provided such method will withhold from each employee or person receiving royalty payments substantially the same amount of tax as would be withheld by use of the withholding tax tables. Employers, or persons withholding tax under section 290.923, subdivision 2, who desire to determine the amount of tax to be withheld by a method other than by use of the withholding tax tables shall obtain permission from the commissioner before the beginning of a payroll period for which the employer, or person withholding tax under section 290.923, subdivision 2, desires to withhold the tax by such other method. Applications to use such other method must be accompanied by evidence establishing the need for the use of such method.\nIn the case of remuneration paid in any medium other than cash for services performed by an individual as a retail salesperson for a person, where the service performed by such individual for such person is ordinarily performed for remuneration solely by way of cash commission an employer shall not be required to deduct or withhold any tax under this section with respect to such remuneration, provided that such employer files with the commissioner such information with respect to such remuneration as the commissioner may by rule prescribe.\n[Repealed, 1990 c 480 art 1 s 45]\n(a) The amount deducted and withheld as tax under subdivision 2a or 3 during a calendar year upon wages shall be allowed as a credit to the recipient of the income against the taxes imposed by this chapter, for a taxable year beginning in such calendar year. If more than one taxable year begins in such calendar year, such amount shall be allowed as a credit against the taxes for the last taxable year so beginning.\n(b) The amount deducted and withheld under subdivisions 4b and 4c and under section 290.923, subdivision 2, for partnership, S corporation, or royalty income must be allowed as a credit to the recipient of the income against the taxes imposed by this chapter for the tax year the income is subject to tax under this chapter.\n[Repealed, 1990 c 480 art 1 s 45]\n[Repealed, 1990 c 480 art 1 s 45]\n[Repealed, 1990 c 480 art 1 s 45]\nThe commissioner is authorized to enter into an agreement with the secretary of treasury of the United States pursuant to the provisions of United States Code, title 5, section 5517.\nThe commissioner may enter into an agreement with the commissioner or other taxing officials of another state for the interpretation and administration of the acts of their several states providing for the collection of income tax at source on wages for the purpose of promoting fair and equitable administration of such acts and to eliminate duplicate withholding. Pursuant to section 270B.12, subdivision 1, the commissioner may furnish information on a reciprocal basis to the taxing officials of another state in order to implement the purposes set forth above.\n[Repealed, 1990 c 480 art 1 s 45]\nNotwithstanding any other provision of this section, except the provisions of subdivision 5a, an employer is not required to deduct and withhold any tax under this chapter from wages paid to an employee if:\n(1) the employee furnished the employer with a withholding allowance certificate that:\n(i) certifies the employee incurred no liability for income tax imposed under this chapter for the employee's preceding taxable year;\n(ii) certifies the employee anticipates incurring no liability for income tax imposed under this chapter for the current taxable year; and\n(iii) is in a form and contains any other information prescribed by the commissioner; or\n(2)(i) the employee is not a resident of Minnesota when the wages were paid; and\n(ii) the employer reasonably expects that the employer will not pay the employee enough wages assignable to Minnesota under section 290.17, subdivision 2, paragraph (a)(1), to meet the nonresident requirement to file a Minnesota individual income tax return for the taxable year under section 289A.08, subdivision 1, paragraph (a).\n(a) For purposes of this subdivision:\n(1) \"periodic payment\" means a payment as defined under section 3405(e)(2) of the Internal Revenue Code;\n(2) \"nonperiodic distribution\" means a distribution as defined under section 3405(e)(3) of the Internal Revenue Code; and\n(3) \"sick pay\" means any amount which:\n(i) is paid to an employee pursuant to a plan to which the employer is a party; and\n(ii) constitutes remuneration or a payment in lieu of remuneration for any period during which the employee is temporarily absent from work on account of sickness or personal injuries.\n(b) For purposes of this section, any periodic payment or nonperiodic distribution to an individual shall be treated as if it were a payment of wages by an employer to an employee for a payroll period, and it is subject to withholding at a rate of 6.25 percent or any rate specified by the recipient. Any payment to an individual of sick pay which does not constitute wages, determined without regard to this subdivision, shall be treated as if it were a payment of wages by an employer to an employee for a payroll period, if, at the time the payment is made a request that such sick pay be subject to withholding under this section is in effect.\n(c) A request for withholding, the amount withheld, and sick pay paid pursuant to certain collective bargaining agreements shall conform with the provisions of section 3402(o)(3), (4), and (5) of the Internal Revenue Code.\n(d) The commissioner is authorized by rules to provide for withholding:\n(1) from remuneration for services performed by an employee for the employer which, without regard to this subdivision, does not constitute wages, and\n(2) from any other type of payment with respect to which the commissioner finds that withholding would be appropriate under the provisions of this section, if the employer and the employee, or in the case of any other type of payment the person making and the person receiving the payment, agree to such withholding. Such agreement shall be made in such form and manner as the commissioner may by rules provide. For purposes of this section remuneration or other payments with respect to which such agreement is made shall be treated as if they were wages paid by an employer to an employee to the extent that such remuneration is paid or other payments are made during the period for which the agreement is in effect.\n(e) An individual receiving a periodic payment or nonperiodic distribution under paragraph (b) may elect to have paragraph (b) not apply to the payment or distribution, and an election remains in effect until revoked by such individual.\nAt the time an individual makes a claim for unemployment benefits, the commissioner of employment and economic development must notify the individual that the individual's unemployment benefits may be subject to state income taxes depending on the individual's other income.\n[Repealed, 2005 c 151 art 1 s 117]\n[Repealed, 2005 c 151 art 1 s 117]\nAn employer, or person withholding tax under section 290.923, desiring to engage in business in Minnesota shall file with the commissioner an application for a withholding account number on or before the date the employer is required to withhold Minnesota taxes under this section. An application for an account number must be made upon a form prescribed by the commissioner. It must give the name of the employer or payor, the location of the place or places of business, the names, addresses and Social Security numbers of the owners or partners, or if the employer or payor is a corporation of the officers, or if the employer or payor is a trust of the trustees, and other information the commissioner may require. The application must be filed by the owner if the employer or payor is a natural person; by a member or partner if the employer or payor is an association or partnership; by a trustee if the employer or payor be a trust, or by a person authorized to sign the application if the employer or payor is a corporation.\nNo fee shall be charged for the application.\nThe account number is not assignable.\nThe delegation to an agent, fiduciary, or employee of an employer, or person withholding tax under section 290.923, of any duty prescribed for the employer or payor by this section shall not relieve the employer or payor of full compliance with such duty.\n(a) If, in the case of any reportable payment, (1) the payee fails to furnish the payee's Social Security account number to the payor, (2) the payee is subject to federal backup withholding on the reportable payment under section 3406 of the Internal Revenue Code, or (3) the commissioner notifies the payor that the Social Security account number furnished by the payee is incorrect, then the payor shall deduct and withhold from the payment a tax equal to the amount of the payment multiplied by the highest rate used in determining the income tax liability of an individual under section 290.06, subdivision 2c.\n(b)(1) In the case of any failure described in paragraph (a), clause (1), paragraph (a) shall apply to any reportable payment made by the payor during the period during which the Social Security account number has not been furnished.\n(2) In any case where there is a notification described in paragraph (a), clause (3), paragraph (a) shall apply to any reportable payment made by the payor (i) after the close of the 30th day after the day on which the payor received the notification, and (ii) before the payee furnishes another Social Security account number.\n(3)(i) Unless the payor elects not to have this clause apply with respect to the payee, paragraph (a), clause (1), shall also apply to any reportable payment made after the close of the period described in clause (1) or (2), as the case may be, and before the 30th day after the close of the period.\n(ii) If the payor elects the application of this clause with respect to the payee, paragraph (a) shall also apply to any reportable payment made during the 30-day period described in clause (2).\n(iii) The payor may elect a period shorter than the grace period set forth in item (i) or (ii), as the case may be.\n(c) The provisions of section 3406 of the Internal Revenue Code shall apply and shall govern when withholding shall be required and the definition of terms. The term \"reportable payment\" shall include only those payments for personal services. No tax shall be deducted or withheld under this subdivision with respect to any amount for which withholding is otherwise required under this section. For purposes of this section, payments which are subject to withholding under this subdivision shall be treated as if they were wages paid by an employer to an employee and amounts deducted and withheld under this subdivision shall be treated as if deducted and withheld under subdivision 2a.\n(d) Whenever the commissioner notifies a payor under this subdivision that the Social Security account number furnished by any payee is incorrect, the commissioner shall at the same time furnish a copy of the notice to the payor, and the payor shall promptly furnish the copy to the payee. If the commissioner notifies a payor under this subdivision that the Social Security account number furnished by any payee is incorrect and the payee subsequently furnishes another Social Security account number to the payor, the payor shall promptly notify the commissioner of the other Social Security account number furnished.\nAny holder of a class A, B, or D license issued by the Minnesota Racing Commission shall deduct and withhold an amount equal to the winnings multiplied by the highest rate used in determining the income tax liability of an individual under section 290.06, subdivision 2c, as Minnesota withholding tax. For purposes of this subdivision, the term \"winnings which are subject to withholding\" has the meaning given in section 3402(q)(3) of the Internal Revenue Code. For purposes of the provisions of this section, a payment to any person of winnings which are subject to withholding must be treated as if the payment was a wage paid by an employer to an employee. Every individual who is to receive a payment of winnings which are subject to withholding shall furnish the license holder with a statement, made under the penalties of perjury, containing the name, address, and Social Security account number of the person receiving the payment and of each person entitled to any portion of such payment. The license holder is liable for the payment of the tax required to be withheld under this subdivision and subdivision 28 but is not liable to any person for the amount of the payment.\nEffective with payments made after April 1, 1988, any holder of a license issued by the Minnesota Racing Commission who makes a payment for personal or professional services to a holder of a class C license issued by the commission, except an amount paid as a purse, shall deduct from the payment and withhold 6.25 percent of the amount as Minnesota withholding tax when the amount paid to that individual by the same person during the calendar year exceeds $600. For purposes of the provisions of this section, a payment to any person which is subject to withholding under this subdivision must be treated as if the payment was a wage paid by an employer to an employee. Every individual who is to receive a payment which is subject to withholding under this subdivision shall furnish the license holder with a statement, made under the penalties of perjury, containing the name, address, and Social Security account number of the person receiving the payment. No withholding is required if the individual presents a signed certificate from the individual's employer which states that the individual is an employee of that employer. A nonresident individual who holds a class C license must be treated as an athlete for purposes of applying the provisions of subdivision 4a and section 290.17, subdivision 2, paragraph (a), clause (2), item (ii).\n7.25 percent of the payment of Minnesota State Lottery winnings which are subject to withholding must be withheld as Minnesota withholding tax. For purposes of this subdivision, the term \"winnings which are subject to withholding\" has the meaning given in section 3402(q)(3) of the Internal Revenue Code. For purposes of the provisions of this section, a payment to any person of winnings which are subject to withholding must be treated as if the payment was a wage paid by an employer to an employee. Every individual who is to receive a payment of winnings which are subject to withholding shall furnish the State Lottery with a statement, made under the penalties of perjury, containing the name, address, and Social Security account number of the person receiving the payment. The Minnesota State Lottery is liable for the payment of the tax required to be withheld under this subdivision but is not liable to any person for the amount of the payment.\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) Notwithstanding section 290.01, \"person\" means an individual, fiduciary, partnership, corporation, limited liability company, association, or other entity organized under the laws of this state or any other jurisdiction.\n(2) \"Third-party bulk filer\" means a person who has custody or control over another employer's funds for the purpose of filing returns and depositing the withheld taxes of the other employer with the commissioner.\n(b) A person shall not act as a third-party bulk filer unless the person is registered with the commissioner under this subdivision.\n(c) A person may apply to the commissioner, on a form prescribed by the commissioner, for registration as a third-party bulk filer under this subdivision, and the commissioner shall grant the application if the application indicates that the person will comply with this subdivision.\n(d) A third-party bulk filer must:\n(1) keep client funds held for payment of federal or state withholding taxes or other client obligations in an account separate from the third-party bulk filer's own funds;\n(2) permit the commissioner to conduct scheduled or unscheduled audits of the third-party bulk filer's books and records relating to compliance with this subdivision and fully cooperate with the audits or, at the discretion of the commissioner, submit an audit conducted by a certified public accountant;\n(3) file returns electronically and make deposits electronically with the commissioner in compliance with the commissioner's requirements for electronic filing and depositing;\n(4) provide to the commissioner at least monthly, in the form requested by the commissioner, an updated client list that includes at least the name, address, tax identification number, and federal deposit frequency of each client. The address listed for the client must be the client's actual street or post office box address and not the third-party bulk filer's address;\n(5) disclose in writing to prospective clients that:\n(i) the third-party bulk filer may invest client funds prior to depositing them with the commissioner and with the Internal Revenue Service and that earnings from those investments will be the property of the third-party bulk filer;\n(ii) if the third-party bulk filer incurs losses on those investments or uses the client's funds for other purposes, the third-party bulk filer will still be liable to the client for the amounts withheld but will be able to make required tax deposits on behalf of the client only by using the third-party bulk filer's own funds or other assets to replace the funds lost through the investments or used for other purposes; and\n(iii) no state or federal agency monitors or assumes any responsibility for the financial solvency of third-party bulk filers;\n(6) timely file all returns and timely make all tax deposits required under its contracts with its clients;\n(7) upon request, provide to the commissioner, within the time specified in the request, a copy of any contract with a client; and\n(8) comply with all other requirements of this section or of rules adopted under this section.\n(e) When the commissioner sends an order of assessment issued under section 270C.33, in either paper or electronic form, to a third-party bulk filer regarding a client, the commissioner shall also send a paper copy of the order of assessment to the client.\n(f) If the commissioner determines that a required deposit appears not to have been made, the commissioner shall send a written notice of the delinquency, in electronic or paper form, to the third-party bulk filer, and a copy to the client as required under paragraph (e).\n(g) If the commissioner determines that a required deposit has not been made, and that continued operation of the third-party bulk filer would present a risk of loss to its clients, the commissioner may, upon ten business days' written notice by certified mail to the third-party bulk filer, suspend the registration of the third-party bulk filer for an indefinite period, and notify the third-party bulk filer's clients that the registration has been suspended. A registration may not be suspended if the failure to make a deposit was caused by the client's failure to deposit funds or provide the information necessary to calculate appropriate tax withholding payments. The commissioner shall, upon request, provide the third-party bulk filer with the opportunity for an administrative appeal under section 270C.35, subdivisions 1, 4, and 10, prior to suspension; the hearing, if any, on the administrative appeal must occur within the ten-day period unless the commissioner, in the commissioner's sole discretion, agrees to delay the suspension to permit a later hearing. The 60-day period specified in section 270C.35, subdivision 4, does not apply to a proceeding under this paragraph. Within 30 days after the beginning of a suspension under this paragraph, the commissioner may commence a proceeding to suspend or revoke under paragraph (h); if the commissioner fails to do so, the suspension under this paragraph terminates.\n(h) If the commissioner determines, in compliance with paragraph (i), that a third-party bulk filer has violated this section without reasonable cause or is no longer eligible for registration under this subdivision, the commissioner may suspend or revoke the third-party bulk filer's registration or may assess a civil penalty upon the third-party bulk filer, not to exceed $5,000 per violation. A suspension of registration may be for any period of less than six months and may include conditions for reinstatement. If the commissioner revokes the registration, the third-party bulk filer may not apply for reregistration for six months after the revocation. If the commissioner suspends or revokes a registration, the commissioner shall notify the former registrant's clients that the registration has been suspended or revoked. If the commissioner assesses a civil penalty, the commissioner shall not notify the third-party bulk filer's clients of the assessment.\n(i) Prior to a suspension, revocation, or assessment of a civil penalty under paragraph (h), the commissioner shall first provide 30 days' written notice to the third-party bulk filer, specifying the violations and informing the third-party bulk filer that the commissioner intends, based upon those violations, to take action against the third-party bulk filer as permitted under this paragraph and paragraph (h). The notice shall advise the third-party bulk filer of the right to contest the suspension, revocation, or assessment of a civil penalty and of the general procedures for a contested case hearing under chapter 14. The notice may be served personally or by mail in the manner prescribed for service of an order of assessment issued under section 270C.33. A suspension or revocation of registration under this paragraph is effective when the commissioner serves a notice of suspension or revocation upon the third-party bulk filer after 30 days have passed following the date of the notice of intent to suspend or revoke without the third-party bulk filer requesting a hearing. If a hearing is timely requested and held, the suspension or revocation is effective upon service by the commissioner of an order of suspension or revocation under section 14.62, subdivision 1.\n(j) A third-party bulk filer may terminate its registration by written notice to the commissioner, but the termination does not affect the commissioner's authority to begin or continue a proceeding to take action permitted under paragraph (h). The commissioner shall notify the third-party bulk filer's clients of a termination of registration under this paragraph.\n(k) The commissioner shall remind employers at least annually, through the department's regular informational publications that it sends to employers, that employers may telephone the department to determine whether a required filing or deposit has been made by a third-party bulk filer.\n[Repealed, 2012 c 295 art 2 s 13]",
	"repealed": false
}