{
	"id": "238.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.02",
	"title": "238.02 DEFINITIONS.",
	"text": "The words and phrases used in this chapter have the following meanings unless a different meaning clearly appears in the text.\n\"Access\" means entrance onto the premises of the property owner and an easement for purposes of surveying, designing, installing, inspecting, maintaining, operating, repairing, replacing, or removing equipment used in the construction and operation of a cable communications system.\n\"Affiliated company\" means a person, company, corporation, or other entity in which the utility has an affiliated interest as defined under section 216B.48, subdivision 1.\n\"Alternative providers\" means other providers of television programming or cable communications services.\n\"Association member\" means an individual owner of a cooperatively owned multiple dwelling complex.\n[Repealed, 2004 c 261 art 7 s 29]\n(a) \"Cable communications system\" means a system that (1) provides the service of receiving and amplifying (i) programs broadcast by one or more television or radio stations and (ii) other programs originated by a person operating a cable communications system or by another person, and (2) distributes those programs by wire, cable, microwave, or other means, regardless of whether the means are owned or leased, to persons who subscribe to the service.\n(b) This definition does not include:\n(1) a system that serves fewer than 50 subscribers or a system that serves more than 50 but fewer than 1,000 subscribers if the governing bodies of all political subdivisions served by the system, vote, by resolution, to remove the system from the provisions of this chapter; provided that:\n(i) no part of a system, nor any area within the municipality served by the system, may be removed from the provisions of this chapter if more than 1,000 subscribers are served by the system; and\n(ii) any system serving more than 50 but fewer than 1,000 subscribers that has been removed from the provisions of this chapter becomes subject to the provisions of this chapter if the governing bodies of 50 percent or more of the political subdivisions served by the system vote, by resolution, in favor of the return;\n(2) a master antenna television system;\n(3) a specialized closed-circuit system that does not use the public rights-of-way for the construction of its physical plant; and\n(4) a translator system that receives and rebroadcasts over-the-air signals.\n\"Cable communications system's equipment\" means aerial wires, cables, amplifiers, associated power supply equipment, and other transmission apparatus necessary for the proper operation of the cable communications system in a franchised area.\n[Repealed, 1985 c 285 s 54]\n[Renumbered subd 24]\n[Renumbered subd 25]\n[Renumbered subd 27]\n[Renumbered subd 29]\n[Renumbered subd 32]\n[Renumbered subd 33]\n[Renumbered subd 30]\n[Renumbered subd 31]\n[Renumbered subd 26]\n[Renumbered subd 21]\n[Renumbered subd 22]\n[Renumbered subd 23]\n[Repealed, 2004 c 261 art 7 s 29]\n[Repealed, 2004 c 261 art 7 s 29]\n[Repealed, 2004 c 261 art 7 s 29]\n[Renumbered subd 28]\n\"Conduit system\" means a reinforced passage or opening in, on, under, or through the ground capable of containing communications facilities and includes the following: main conduit; underground dips and short sections of conduit under roadways, driveways, parking lots, and similar conduit installations; laterals to poles and into buildings; ducts; and manholes.\n\"Core service unit\" means the municipality, or, in the case of a joint powers agreement, municipalities, in which a cable communications system first provides service under a lawful franchise and from which the cable communications system extends service into additional areas which are included in the boundaries of a cable service territory.\n\"Dwelling unit\" means a single unit providing complete, independent, living facilities for one or more persons, including permanent provisions for living, sleeping, eating, cooking, and sanitation.\n\"Extension area\" means a municipality or municipalities located outside the franchise boundaries of the core service unit.\n\"Extension permit\" means any authorization granted by an extension area in the form of a franchise, privilege, permit, license or other municipal authorization to construct, operate, maintain, or manage a cable communications system within the boundaries of the extension area.\n\"Franchise\" means any authorization granted by a municipality in the form of a franchise, privilege, permit, license or other municipal authorization to construct, operate, maintain, or manage a cable communications system in any municipality.\n[Repealed, 2004 c 261 art 7 s 29]\n\"Head end\" means the electronic control center of a cable communications system, which includes antennas, preamplifiers, frequency converters, demodulators, modulators and other related equipment which receives, amplifies, filters and converts incoming signals to cable system channels.\n\"Master antenna television system\" means any system which serves only the residents of one or more apartment dwellings under common ownership, control or management and any commercial establishment located on the premises of such apartment house and which transmits only signals broadcast over the air by stations which may be normally viewed or heard locally without objectionable interference, and which does not provide any additional service over its facilities other than closed-circuit security viewing services.\n\"Metropolitan area\" is that area defined under section 473.121, subdivision 2.\n\"Multiple dwelling complex\" means a site, lot, field, or tract of land or water, other than a common interest community or mobile home park, whether occupied or under construction, containing more than four dwelling units.\n\"Municipality\" means any organized town, city, or county with respect to the unorganized territory within its boundaries.\n\"Other providers of television programming or cable communications services\" means operators of master antenna television systems (MATV), satellite master antenna television systems (SMATV), multipoint distributions systems (MDS), and direct broadcast satellite systems (DBS).\n\"Person\" means any individual, trustee, partnership, municipality, association, corporation or other legal entity.\n\"Program\" means any broadcast-type program, signal, message, graphics, data, or communication content service.\n\"Property owner\" means any person with a recorded interest in a multiple dwelling complex, or person known to the person operating a cable communications system to be an owner, or the authorized agent of the person.\n\"Public utility company poles\" means poles owned by the public utility and poles owned by others on which the public utility has the right to permit others to attach in the communications space on the pole.\n\"Regional channel entity\" or \"entity\" means an independent, nonprofit corporation to govern the operation of the regional channel.\n\"Resident\" means a person or entity paying rent to a property owner.\n\"State\" means the state of Minnesota.\n\"State agency\" means any office, department, board, commission, bureau, division, public corporation, agency or instrumentality of the state.\n\"Utility\" means a person, corporation, or other entity that operates, maintains, or controls equipment or facilities in this state for furnishing at retail electric service to the public.",
	"repealed": false
}