{
	"id": "253B.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.041",
	"title": "253B.041 SERVICES FOR ENGAGEMENT IN TREATMENT.",
	"text": "(a) The purpose of engagement services is to avoid the need for commitment and to enable the proposed patient to voluntarily engage in needed treatment. An interested person may apply to the county where a proposed patient resides to request engagement services.\n(b) To be eligible for engagement services, the proposed patient must be at least 18 years of age, have a mental illness, and either:\n(1) be exhibiting symptoms of serious mental illness including hallucinations, mania, delusional thoughts, or be unable to obtain necessary food, clothing, shelter, medical care, or provide necessary hygiene due to the patient's mental illness; or\n(2) have a history of failing to adhere to treatment for mental illness, in that:\n(i) the proposed patient's mental illness has been a substantial factor in necessitating hospitalization, or incarceration in a state or local correctional facility, not including any period during which the person was hospitalized or incarcerated immediately preceding filing the application for engagement; or\n(ii) the proposed patient is exhibiting symptoms or behavior that may lead to hospitalization, incarceration, or court-ordered treatment.\n(a) Upon receipt of a request for engagement services, the county's prepetition screening team shall conduct an investigation to determine whether the proposed patient is eligible. In making this determination, the screening team shall seek any relevant information from an interested person.\n(b) If the screening team determines that the proposed patient is eligible, engagement services must begin and include, but are not limited to:\n(1) assertive attempts to engage the patient in voluntary treatment for mental illness for at least 90 days. Engagement services must be person-centered and continue even if the patient is an inmate in a non-state-operated correctional facility;\n(2) efforts to engage the patient's existing systems of support, including interested persons, unless the engagement provider determines that involvement is not helpful to the patient. This includes education on restricting means of harm, suicide prevention, and engagement; and\n(3) collaboration with the patient to meet immediate needs including access to housing, food, income, disability verification, medications, and treatment for medical conditions.\n(c) Engagement services regarding potential treatment options must take into account the patient's preferences for services and supports. The county may offer engagement services through the designated agency or another agency under contract. Engagement services staff must have training in person-centered care. Engagement services staff may include but are not limited to mobile crisis teams under section 245.462, certified peer specialists under section 256B.0615, community-based treatment programs, and homeless outreach workers.\n(d) If the patient voluntarily consents to receive mental health treatment, the engagement services staff must facilitate the referral to an appropriate mental health treatment provider including support obtaining health insurance if the proposed patient is currently or may become uninsured. If the proposed patient initially consents to treatment, but fails to initiate or continue treatment, the engagement services team must continue outreach efforts to the patient.\nEngagement services for a patient to seek treatment may be stopped if the proposed patient is in need of commitment and satisfies the commitment criteria under section 253B.09, subdivision 1. In such a case, the engagement services team must immediately notify the designated agency, initiate the prepetition screening process under section 253B.07, or seek an emergency hold if necessary to ensure the safety of the patient or others.\nCounties may, but are not required to, provide engagement services. The commissioner may conduct a pilot project evaluating the impact of engagement services in decreasing commitments, increasing engagement in treatment, and other measures.",
	"repealed": false
}