{
	"id": "257C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/257C.01",
	"title": "257C.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n(a) \"De facto custodian\" means an individual who has been the primary caretaker for a child who has, within the 24 months immediately preceding the filing of the petition, resided with the individual without a parent present and with a lack of demonstrated consistent participation by a parent for a period of:\n(1) six months or more, which need not be consecutive, if the child is under three years of age; or\n(2) one year or more, which need not be consecutive, if the child is three years of age or older.\n(b) For purposes of the definition in this subdivision, any period of time after a legal proceeding has been commenced and filed must not be included in determining whether the child has resided with the individual for the required minimum period.\n(c) For purposes of the definition in this subdivision, \"lack of demonstrated consistent participation\" by a parent means refusal or neglect to comply with the duties imposed upon the parent by the parent-child relationship, including, but not limited to, providing the child necessary food, clothing, shelter, health care, education, creating a nurturing and consistent relationship, and other care and control necessary for the child's physical, mental, or emotional health and development.\n(d) \"De facto custodian\" does not include an individual who has a child placed in the individual's care:\n(1) through a custody consent decree under section 257C.07;\n(2) through a court order or voluntary placement agreement under chapter 260C; or\n(3) for adoption under chapter 259.\n(e) A standby custody designation under chapter 257B is not a designation of de facto custody unless that intent is indicated within the standby custody designation.\n(a) \"Interested third party\" means an individual who is not a de facto custodian but who can prove that at least one of the factors in section 257C.03, subdivision 7, paragraph (a), is met.\n(b) \"Interested third party\" does not include an individual who has a child placed in the individual's care:\n(1) through a custody consent decree under section 257C.07;\n(2) through a court order or voluntary placement under chapter 260C; or\n(3) for adoption under chapter 259.",
	"repealed": false
}