{
	"id": "58B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/58B.05",
	"title": "58B.05 LICENSE RENEWAL.",
	"text": "Licenses are renewable on January 1 of each year.\n(a) A person whose application is properly and timely filed who has not received notice of denial of renewal is considered approved for renewal. The person may continue to act as a student loan servicer whether or not the renewed license has been received on or before January 1 of the renewal year. An application for renewal of a license is considered timely filed if the application is received by the commissioner, or mailed with proper postage and postmarked, no later than December 15 of the year immediately preceding the renewal year. An application for renewal is considered properly filed if the application is made upon forms duly executed, accompanied by fees prescribed by this chapter, and containing any information that the commissioner requires.\n(b) A person who fails to make a timely application for renewal of a license and who has not received the renewal license as of January 1 of the renewal year is unlicensed until the renewal license has been issued by the commissioner and is received by the person.\nAn application for renewal of an existing license must contain the information specified in section 58B.03, subdivision 3, except that only the requested information having changed from the most recent prior application need be submitted.\nA student loan servicer ceasing an activity or activities regulated by this chapter and desiring to no longer be licensed shall inform the commissioner in writing and, at the same time, surrender the license and all other symbols or indicia of licensure. The licensee shall include a plan for the withdrawal from student loan servicing, including a timetable for the disposition of the student loans being serviced.\nThe following fees must be paid to the commissioner for a renewal license:\n(1) a nonrefundable renewal license fee established by the commissioner; and\n(2) a nonrefundable renewal investigation fee established by the commissioner.",
	"repealed": false
}