{
	"id": "144.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.125",
	"title": "144.125 TESTS OF INFANTS FOR HERITABLE AND CONGENITAL DISORDERS.",
	"text": "(a) It is the duty of (1) the administrative officer or other person in charge of each institution caring for infants 28 days or less of age, (2) the person required in pursuance of the provisions of section 144.215, to register the birth of a child, or (3) the nurse midwife or midwife in attendance at the birth, to arrange to have administered to every infant or child in its care tests for heritable and congenital disorders according to subdivision 2 and rules prescribed by the state commissioner of health.\n(b) Testing, recording of test results, reporting of test results, and follow-up of infants with heritable congenital disorders, including hearing loss detected through the early hearing detection and intervention program in section 144.966, shall be performed at the times and in the manner prescribed by the commissioner of health.\n(c) The fee to support the newborn screening program, including tests administered under this section and section 144.966, shall be $177 per specimen. This fee amount shall be deposited in the state treasury and credited to the state government special revenue fund.\n(d) The fee to offset the cost of the support services provided under section 144.966, subdivision 3a, shall be $15 per specimen. This fee shall be deposited in the state treasury and credited to the general fund.\nThe commissioner shall periodically revise the list of tests to be administered for determining the presence of a heritable or congenital disorder. Revisions to the list shall reflect advances in medical science, new and improved testing methods, or other factors that will improve the public health. In determining whether a test must be administered, the commissioner shall take into consideration the adequacy of analytical methods to detect the heritable or congenital disorder, the ability to treat or prevent medical conditions caused by the heritable or congenital disorder, and the severity of the medical conditions caused by the heritable or congenital disorder. The list of tests to be performed may be revised if the changes are recommended by the advisory committee established under section 144.1255, approved by the commissioner, and published in the State Register. The revision is exempt from the rulemaking requirements in chapter 14, and sections 14.385 and 14.386 do not apply.\n(a) The department shall make information and forms available to childbirth education programs and health care providers who provide prenatal care describing the newborn screening program and the provisions of this section to be used in a discussion with expectant parents and parents of newborns. The department shall promote the materials describing the newborn screening program and encourage providers and education programs to thoroughly discuss the program with expectant parents and parents with newborns. The department shall make information and forms about newborn screening available to the persons with a duty to perform testing under this section and to expectant parents and parents of newborns using electronic and other means.\n(b) Prior to collecting a sample, persons with a duty to perform testing under subdivision 1 must:\n(1) provide parents or legal guardians of infants with a document that provides the following information:\n(i) the benefits of newborn screening;\n(ii) that the blood sample will be used to test for heritable and congenital disorders, as determined under subdivision 2;\n(iii) the data that will be collected as part of the testing;\n(iv) the benefits associated with the department's storage of an infant's blood sample and test results;\n(v) that the Department of Health may store the blood samples and test results unless the parents or legal guardians elect to not have them stored;\n(vi) that blood samples and test results will be used for program operations in accordance with subdivision 5, unless the parents or legal guardians elect not to have the blood samples and test results stored, in which case the blood samples and test results will be destroyed in accordance with subdivision 8, paragraph (b), and until destroyed will only be used for program operations described under subdivision 5, paragraph (a), clauses (1) to (7);\n(vii) that parents or legal guardians have a right to elect not to have newborn screening performed and a right to secure private testing;\n(viii) that parents or legal guardians have a right to elect to have the newborn screening performed, but not have the blood samples and test results stored;\n(ix) that parents or legal guardians have a right to authorize in writing that the blood samples and test results may be used for public health studies or research; and\n(x) the Department of Health's website address where more information and forms may be obtained; and\n(2) upon request, promptly provide parents or legal guardians of infants with forms necessary to request that the infant not have blood collected for testing or to request to have the newborn screening performed, but not have the blood samples and test results stored; and\n(3) record in the infant's medical record that a parent or legal guardian of the infant has received the information provided pursuant to this subdivision and has had an opportunity to ask questions.\n(c) Nothing in this section prohibits a parent or legal guardian of an infant from having newborn screening performed by a private entity.\n(a) The parent or legal guardian of an infant otherwise subject to testing under this section may elect not to have newborn screening performed, or may elect to have newborn screening tests performed, but not to have the blood samples and test results stored.\n(b) If a parent or legal guardian elects not to have newborn screening performed or elects not to allow the blood samples and test results to be stored, then the election must be recorded on a form that is signed by the parent or legal guardian. The signed form must be made part of the infant's medical record and a copy shall be provided to the Department of Health. When a parent or legal guardian elects not to have newborn screening performed, the person with the duty to perform testing under subdivision 1 must follow that election. A written election to decline testing exempts persons with a duty to perform testing and the Department of Health from the requirements of this section and section 144.128.\n(a) \"Newborn screening program operations\" means actions, testing, and procedures directly related to the operation of the newborn screening program, limited to the following:\n(1) confirmatory testing;\n(2) laboratory quality control assurance and improvement;\n(3) calibration of equipment;\n(4) evaluating and improving the accuracy of newborn screening tests for conditions approved for screening in Minnesota;\n(5) validation of equipment and screening methods;\n(6) continuity of operations to ensure testing can continue as required by Minnesota law in the event of an emergency;\n(7) follow-up services for the cases of heritable and congenital disorders identified by newborn screening; and\n(8) utilization of blood samples and test results for studies related to newborn screening, including studies used to develop new tests.\n(b) No research or public health studies other than those described in paragraph (a) shall be conducted without written consent as described under subdivision 7.\n(c) Any sale of bloodspots, test results, or other data collected in the newborn screening program is strictly prohibited.\n[Repealed, 2014 c 203 s 8]\n(a) The parent or legal guardian of an infant subject to testing under this section, or an individual who was tested as an infant if the individual is 18 years of age or older may authorize in writing that the infant's blood sample and test results be retained and used by the Department of Health for the purposes described in subdivision 9.\n(b) The Department of Health must provide a consent form, with an attached Tennessen warning pursuant to section 13.04, subdivision 2. The consent form must provide the following:\n(1) information as to the personal identification and use of samples and test results for public health studies or research not related to newborn screening;\n(2) information that explains that, upon approval by the Department of Health's Institutional Review Board, blood samples and test results may be shared with external parties for public health studies or research; and\n(3) information that explains that blood samples contain various components, including deoxyribonucleic acid (DNA).\n(a) Except as limited under paragraph (b), the Department of Health may store blood samples and test results, and may use the blood samples and test results in accordance with subdivision 5. If written informed consent of a parent, legal guardian, or individual is obtained under subdivision 7, the Department of Health may use the blood samples and test results in accordance with subdivision 9.\n(b) If a parent, legal guardian, or individual elects against storage, or revokes prior consent for storage, the blood samples must be destroyed within 30 days after receipt of the request, and test results must be destroyed within 30 days after receipt of the request, or the earliest time allowed under Clinical Laboratory Improvement Amendments (CLIA) regulations, whichever is later. Until destroyed, the blood samples and test results may be used for program operations described under subdivision 5, paragraph (a), clauses (1) to (7).\nWith the written, informed consent of a parent or legal guardian, the Department of Health may use blood samples and test results for public health studies or research not related to newborn screening, and upon approval by the Department of Health's Institutional Review Board, share samples and test results with external parties for public health studies or research.\nA parent or legal guardian, or the individual whose blood was tested as an infant if the individual is 18 years of age or older, may revoke approval for storage or use of blood samples or test results at any time by providing a signed and dated form requesting destruction of the blood samples or test results. Blood samples and test results must be destroyed as specified under subdivision 8, paragraph (b).",
	"repealed": false
}