{
	"id": "44.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/44.11",
	"title": "44.11 RULES.",
	"text": "The board shall, as soon as practicable after its appointment and from time to time thereafter, adopt rules consistent with this chapter on the subjects enumerated in subsequent subdivisions in order to carry out the purposes thereof. Copies of the rules may be published in the official newspaper or made available at the office of the city clerk in printed form for general distribution. If not so published, copies shall be posted in a conspicuous place in the city hall and in such other public places as the board shall specify, and no rules of general application with reference to employment, promotion, dismissal, or suspension shall be effective until so posted or published.\nThe board shall provide by rule for the classification of all positions in the classified service on the basis of duties and responsibilities.\nThe board shall provide by rule for public competitive examinations, after public notice, to test the relative fitness of applicants for positions.\nThe board shall provide by rule for the creation and maintenance of lists of eligibles. No name shall remain on an eligible list for more than two years.\nThe board shall provide for the rejection of candidates or eligibles who fail to comply with reasonable requirements of the board with respect to age, residence, physical condition or otherwise, or who have been guilty of criminal, infamous, or disgraceful conduct, or of any willful misrepresentation, deception, or fraud in connection with their applications.\nThe board shall provide by rule for certification of names to the appointing authority from the appropriate eligible list for appointment, promotion, or reemployment.\nThe board may provide by rule for temporary and provisional appointments.\nThe board shall provide by rule for promotion based on competitive examination, supplemented by records of efficiency, character, conduct, and seniority when a passing grade is obtained upon the examination.\nThe board shall provide by rule for the suspension by the appointing authority of any employee in the classified service for a period of not to exceed 30 days for disciplinary reasons.\nThe board shall provide by rule for the layoff, because of curtailment of work or funds, of employees in the classified service and for the conditions under which employees thus laid off shall be reinstated.\nThe board shall provide by rule for hours of work, holidays, attendance regulations, and annual, sick and special leaves of absence for positions in the classified service.\nThe board may provide by rule for the periodic check of municipal payrolls to determine if all employees being paid by the municipality have been properly paid and are entitled to such payment.\nThe board may adopt rules governing its own procedure and such other rules, not inconsistent with this chapter, as may be found necessary to carry out the purposes thereof.",
	"repealed": false
}