{
	"id": "144E.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.035",
	"title": "144E.035 EMERGENCY MEDICAL SERVICES PHYSICIAN ADVISORY COUNCIL.",
	"text": "The Emergency Medical Services Physician Advisory Council is established and consists of the following members:\n(1) eight physicians who meet the qualifications for medical directors in section 144E.265, subdivision 1, with one physician appointed by each of the regional emergency services boards of the designated regional emergency medical services systems;\n(2) one physician who meets the qualifications for medical directors in section 144E.265, subdivision 1, appointed by the Minnesota State Fire Chiefs Association;\n(3) one physician who is board-certified in pediatrics, appointed by the Minnesota Emergency Medical Services for Children program; and\n(4) the medical director member of the Emergency Medical Services Advisory Council appointed under section 144E.03, subdivision 1, clause (3).\nCompensation and reimbursement for expenses, removal of members, filling of vacancies of members, and, except for initial appointments, membership terms are governed by section 15.059. Notwithstanding section 15.059, subdivision 6, the advisory council shall not expire.\n(a) The advisory council must elect a chair and vice-chair from among its membership and may elect other officers as it deems necessary.\n(b) The advisory council must meet twice per year or upon the call of the chair.\n(c) Meetings of the advisory council are subject to chapter 13D.\nThe advisory council must:\n(1) review and make recommendations to the director and deputy director of medical services on clinical aspects of prehospital medical care. In doing so, the advisory council must incorporate information from medical literature, advances in bedside clinical practice, and advisory council member experience; and\n(2) serve as subject matter experts for the director and deputy director of medical services on evolving topics in clinical medicine, including but not limited to infectious disease, pharmaceutical and equipment shortages, and implementation of new therapeutics.",
	"repealed": false
}