{
	"id": "523.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/523.11",
	"title": "523.11 REVOCATION OF A POWER.",
	"text": "An executed power of attorney may be revoked only by a written instrument of revocation signed by the principal and, in the case of a signature on behalf of the principal by another or a signature by a mark, acknowledged before a notary public. The conservator or guardian of the principal has the same power the principal would have if the principal were not incapacitated or incompetent to revoke, suspend, or terminate all or any part of the power of attorney.\nRevocation of an executed power of attorney is not effective as to any party unless that party has actual notice of the revocation.\nAs used in this chapter, \"actual notice of revocation\" means that a written instrument of revocation has been received by the party. In real property transactions only, \"actual notice of revocation\" means that a written instrument of revocation has been received by the party, or that a written instrument of revocation containing the legal description of the real property has been recorded in the office of the county recorder or filed in the office of the registrar of titles. Recorded or filed revocation is actual notice of revocation of a power of attorney only as to any interest in real property described in the revocation and located in the county where it is recorded.\nA written instrument of revocation that purports to be signed by the principal named in the power of attorney is presumed to be valid. Any party receiving the written instrument of revocation may rely on this presumption and is not liable for later refusing to accept the authority of the attorney-in-fact.\nIn the case of a conveyance of an interest in property, an affidavit signed by an initial transferee of the interest of the principal stating that the initial transferee had not received, at the time of the conveyance, a written instrument of revocation of the power of attorney, constitutes conclusive proof as to all subsequent transferees that no written instrument of revocation was received by the initial transferee, except as to a subsequent transferee who commits an intentional fraud.",
	"repealed": false
}