{
	"id": "97B.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.055",
	"title": "97B.055 DISCHARGING FIREARMS AND BOWS AND ARROWS.",
	"text": "(a) A person may not discharge a firearm or an arrow from a bow on, over, or across an improved public highway at a big game animal. A person may not discharge a firearm or bow and arrow within the right-of-way of an improved public highway at a big game animal. The commissioner may by rule extend the application of this subdivision to the taking of migratory waterfowl in designated locations.\n(b) A person may not discharge a firearm or an arrow from a bow on, over, across, or within the right-of-way of an improved public highway at a decoy of a big game animal that has been set out by a licensed peace officer.\n(a) A person may not take a wild animal with a firearm or by archery from a motor vehicle except as permitted in this section.\n(b) A person may not shoot at a decoy of a wild animal that is placed by a licensed peace officer by:\n(1) discharging a firearm from a motor vehicle; or\n(2) discharging an arrow from a bow from a motor vehicle.\n(c) Notwithstanding section 97B.091, a person may transport a bow uncased while in a motorized watercraft and may take native rough fish and common carp while in the boat as provided in section 97C.376, subdivision 3.\n(a) The commissioner may issue a special permit, without a fee, to discharge a firearm or bow and arrow from a stationary motor vehicle to a person who obtains the required licenses and who has a permanent physical disability that is more substantial than discomfort from walking. The permit recipient must be:\n(1) unable to step from a vehicle without aid of a wheelchair, crutches, braces, or other mechanical support or prosthetic device; or\n(2) unable to walk any distance because of a permanent lung, heart, or other internal disease that requires the person to use supplemental oxygen to assist breathing.\n(b) The permanent physical disability must be established by medical evidence verified in writing by a licensed physician, chiropractor, advanced practice registered nurse, or licensed physician assistant. The commissioner may request additional information from the physician, chiropractor, advanced practice registered nurse, or physician assistant if needed to verify the applicant's eligibility for the permit. Notwithstanding section 97A.418, the commissioner may, in consultation with appropriate advocacy groups, establish reasonable minimum standards for permits to be issued under this section. In addition to providing the medical evidence of a permanent disability, the applicant must possess a valid disability parking certificate authorized by section 169.345 or license plates issued under section 168.021.\n(c) A person issued a special permit under this subdivision and hunting deer may take a deer of either sex, except in those antlerless permit areas and seasons where no antlerless permits are offered. This subdivision does not authorize another member of a party to take an antlerless deer under section 97B.301, subdivision 3.\n(d) A permit issued under this subdivision is valid for five years.\n(e) The commissioner may deny, modify, suspend, or revoke a permit issued under this section for cause, including a violation of the game and fish laws or rules.\n(f) A person who knowingly makes a false application or assists another in making a false application for a permit under this section is guilty of a misdemeanor. A licensed physician, licensed advanced practice registered nurse, licensed physician assistant, or licensed chiropractor who fraudulently certifies to the commissioner that a person is permanently disabled as described in this section is guilty of a misdemeanor.\n(g) Notwithstanding paragraph (d), the commissioner may issue a permit valid for the entire life of the applicant if the commissioner determines that there is no chance that an applicant will become ineligible for a permit under this section and the applicant requests a lifetime permit.\nThe commissioner may issue a special permit, without fee, to take animals that the state pays a bounty for, from an airplane or a snowmobile.",
	"repealed": false
}