{
	"id": "114E.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/114E.05",
	"title": "114E.05 DEFINITIONS.",
	"text": "For the purposes of this chapter, the definitions in this subdivision have the meanings given.\n\"Activity and use limitations\" means restrictions or obligations with respect to real property that are associated with an environmental response project.\n\"Common interest community\" means a common interest community as defined in chapter 515B.\n\"Environmental agency\" means the Pollution Control Agency, Agriculture Department, or another state or federal agency that determines or approves the environmental response project pursuant to which the environmental covenant is created.\n\"Environmental covenant\" means a servitude created under this chapter that imposes activity and use limitations.\n\"Environmental response project\" means a plan or work performed to clean up, eliminate, investigate, minimize, mitigate, or prevent the release or threatened release of contaminants affecting real property in order to protect public health or welfare or the environment, including:\n(1) response or corrective actions under federal or state law, including chapters 115B, 115C, 115E, and 116, and the Comprehensive Environmental Response, Compensation and Liability Act, United States Code, title 44, section 9601, et seq.;\n(2) corrective actions or response to agricultural chemical incidents under chapters 18B, 18C, 18D, and 18E; and\n(3) closure, contingency, or corrective actions required under rules or regulations applicable to waste treatment, storage, or disposal facilities or to above or below ground tanks.\n\"Holder\" means any person identified as a holder of an environmental covenant as specified in section 114E.10, paragraph (a).\n\"Person\" means an individual, corporation, business trust, estate, trust, partnership, limited liability company, association, joint venture, public corporation, political subdivision or special purpose unit of government, agency, or instrumentality of the state or federal government, or any other legal or commercial entity.\n\"Record,\" used as a noun, means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n\"Recorded\" means recorded with the county recorder or registrar of title, as applicable, in each county where the real property is located.\n\"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.",
	"repealed": false
}