{
	"id": "16C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.02",
	"title": "16C.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given them, unless the context clearly indicates otherwise.\n[Repealed by amendment, 2014 c 196 art 2 s 1]\n\"Agency\" means any state officer, employee, board, commission, authority, department, entity, or organization of the executive branch of state government.\nUnless specifically provided elsewhere in this chapter, agency does not include the Minnesota State Colleges and Universities.\n\"Award\" means a commissioner's written acceptance of a bid or proposal to provide goods, services, construction, or utilities.\n\"Best and final offer\" means an optional step in the solicitation process in which responders are requested to improve their response by methods including, but not limited to, the reduction of cost, clarification or modification of the response, or the provision of additional information.\n\"Best value\" describes a result intended in the acquisition of all goods and services. Price must be one of the evaluation criteria when acquiring goods and services. Other evaluation criteria may include, but are not limited to, environmental considerations, quality, and vendor performance. In achieving \"best value\" strategic sourcing tools, including but not limited to best and final offers, negotiations, contract consolidation, product standardization, and mandatory-use enterprise contracts shall be used at the commissioner's discretion.\n[Repealed by amendment, 2014 c 196 art 2 s 1]\n\"Commissioner\" means the commissioner of administration.\n\"Competitive proposal\" means a response to a request for proposal in which the evaluation criteria upon which an award is based consists of price and other factors such as vendor qualifications.\n\"Construction\" means building construction, alteration improvements, or repair. Construction does not mean highway construction.\n\"Contract\" means any written instrument or electronic document containing the elements of offer, acceptance, and consideration to which an agency is a party.\n\"Enterprise procurement\" means the process undertaken by the commissioner to leverage economies of scale of multiple end users to achieve cost savings and other favorable terms in contracts for goods and services.\n\"Emergency\" means a threat to public health, welfare, or safety that threatens the functioning of government, the protection of property, or the health or safety of people.\n\"Formal solicitation\" means a solicitation which requires a sealed response.\n\"General services\" means any nonprofessional or technical services. General services does not include construction.\n\"Goods\" means all types of personal property including commodities, materials, supplies, and equipment.\n\"Informal solicitation\" means a solicitation which does not require a sealed response.\n\"Lease\" means a contract conveying from one entity to another the use of real or personal property for a designated period of time in return for payment or other consideration.\n\"Organizational conflict of interest\" means that because of existing or planned activities or because of relationships with other persons:\n(1) the vendor is unable or potentially unable to render impartial assistance or advice to the state;\n(2) the vendor's objectivity in performing the contract work is or might be otherwise impaired; or\n(3) the vendor has an unfair advantage.\n\"Request for bid\" or \"RFB\" means a solicitation in which the terms, conditions, and specifications are described and responses are not subject to negotiation.\n\"Request for proposal\" or \"RFP\" means a solicitation in which it is not advantageous to set forth all the actual, detailed requirements at the time of solicitation and responses are negotiated to achieve best value for the state.\n\"Resident vendor\" means a person, firm, or corporation that:\n(1) is authorized to conduct business in the state of Minnesota on the date a solicitation for a contract is first advertised or announced. It includes a foreign corporation duly authorized to engage in business in Minnesota;\n(2) has paid unemployment taxes or income taxes in this state during the 12 calendar months immediately preceding submission of the bid or proposal for which any preference is sought;\n(3) has a business address in the state; and\n(4) has affirmatively claimed that status in the bid or proposal submission.\n\"Response\" means the offer received from a vendor in response to a solicitation. A response includes submissions commonly referred to as \"offers,\" \"bids,\" \"quotes,\" \"proposals,\" \"best and final offers,\" or \"negotiated offers.\"\n\"Sealed\" means a method determined by the commissioner to prevent the contents being revealed or known before the deadline for submission of responses.\n[Repealed by amendment, 2014 c 196 art 2 s 1]\n\"Services\" means, unless otherwise indicated, both professional or technical services and service performed under a general service contract.\n\"Single source\" means an acquisition where, after a search, only one supplier is determined to be reasonably available for the required product, service, or construction item.\n\"Solicitation\" means the process used to communicate procurement requirements and to request responses from interested vendors. A solicitation may be, but is not limited to, a request for bid and request for proposal.\n[Repealed by amendment, 2014 c 196 art 2 s 1]\n\"Vendor\" means a business, including a construction contractor or a natural person, and includes both if the natural person is engaged in a business.",
	"repealed": false
}