{
	"id": "471.982",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.982",
	"title": "471.982 REVIEW OF JOINT SELF-INSURANCE POOL.",
	"text": "Prior to the formation of a pool, there shall be submitted for approval to the commissioner of commerce a complete written proposal of the pool's operation, including, but not limited to, administration, claims adjusting, membership, capitalization, and provision for payment of claims exceeding the pool's assets. The commissioner shall review the proposal and approve or disapprove within 60 days after receipt to assure that proper insurance techniques and procedures are included in the proposal. If the commissioner does not disapprove within 60 days after receipt of the proposal, the proposal is deemed approved. Each pool shall file with the commissioner of commerce on or before March 1 of each year a written report in a form prescribed by the commissioner as to its condition. The report shall include a detailed statement of assets and liabilities, the amount and character of the business transacted, and the moneys reserved and expended during the previous year.\nThe commissioner of commerce is authorized to adopt administrative rules pursuant to chapter 14. These rules may provide standards or guidelines governing the formation, operation, administration, dissolution of self-insurance pools, and other reasonable requirements to further the purpose of this section. In developing the rules under this section, the commissioner shall consider the following:\n(a) the requirements for self-insuring pools of political subdivisions shall be no more restrictive and may be less restrictive than the requirements for self-insuring pools of private employers;\n(b) all participants in the pool are jointly and severally liable for all claims and expenses of the pool;\n(c) each pool shall contract with a service company licensed by the commissioner to provide or contract for all administrative services required by the pool. No vendor of risk management services or entity administering a self insurance plan under this section may transact such business in this state unless it is licensed to do so by the commissioner pursuant to section 60A.23, subdivision 8;\n(d) the service company has sole responsibility for the settlement of all claims against the pool or its members for which the pool may provide indemnification;\n(e) a minimum premium volume for each pool shall be established. The minimum premium volume may differ because of the kinds of coverage provided, and the limits of liability for the coverage;\n(f) all premiums or other assessments due to the pool from members shall be payable prior to the period for which coverage is being provided, or at equal intervals throughout the period;\n(g) premiums shall be neither excessive, inadequate, nor unfairly discriminatory;\n(h) the commissioner may require each pool to purchase excess insurance above certain limits and in a particular form. The limits or form of the excess insurance may differ based on the kinds of coverage offered by a pool, the limits of liability of the coverage, and the revenues available to pool members for the payment of premiums or assessments;\n(i) each pool shall be audited annually by a certified public accountant;\n(j) whether limitations on the payment of dividends to pool members are necessary to assure the solvency of the pool in view of the taxing and levying authority of political subdivisions;\n(k) no participant may withdraw from a pool for a period of at least three years after its initial entry into the pool;\n(l) the amount of any liabilities in excess of assets shall be assessed to members of the pool within 30 days after a deficiency is identified and shall be payable by the member within 90 days;\n(m) the investment policies of the pool shall be governed by the laws governing investments by cities pursuant to section 118A.04;\n(n) pools shall be subject to the standards of unfair methods of competition and unfair or deceptive acts or practices established in chapter 72A;\n(o) other requirements that are necessary to protect the solvency of the pool, the rights and privileges of claimants against the pool, and citizens of the members of the pool shall be included in the rules.\nSelf-insurance pools established and open for enrollment on a statewide basis by the Minnesota League of Cities Insurance Trust, the Minnesota School Boards Association Insurance Trust, the Minnesota Association of Townships Insurance and Bond Trust, the Minnesota Counties Intergovernmental Trust, or the Nonprofit Insurance Trust and the political subdivisions that belong to them are exempt from the requirements of this section and sections 65B.48, subdivision 3, and 60A.0811. In addition, the Minnesota Association of Townships Insurance and Bond Trust and the townships that belong to it are exempt from the requirement to hold the certificate of surety authorization issued by the commissioner of commerce as provided in section 574.15.",
	"repealed": false
}