{
	"id": "268.044",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.044",
	"title": "268.044 WAGE REPORTING.",
	"text": "(a) Each employer must submit, under the account provided for in section 268.045 or 268.046, a quarterly wage detail report by electronic transmission, in a format prescribed by the commissioner. The report must include for each employee in covered employment during the calendar quarter, the employee's name, Social Security number, the total wages paid to the employee, and total number of paid hours worked. For employees exempt from the definition of employee in section 177.23, subdivision 7, clause (6), the employer must report 40 hours worked for each week any duties were performed by a full-time employee and must report a reasonable estimate of the hours worked for each week duties were performed by a part-time employee. In addition, the wage detail report must include the number of employees employed during the payroll period that includes the 12th day of each calendar month and, if required by the commissioner, the report must be broken down by business location and, if section 268.046, subdivision 1, paragraph (b), or subdivision 2, paragraph (b), applies, by separate unit. The report is due and must be received by the commissioner on or before the last day of the month following the end of the calendar quarter. The commissioner may delay the due date on a specific calendar quarter in the event the department is unable to accept wage detail reports electronically.\n(b) The employer may report the wages paid to the next lower whole dollar amount.\n(c) An employer need not include the name of the employee or other required information on the wage detail report if disclosure is specifically exempted from being reported by federal law.\n(d) A wage detail report must be submitted for each calendar quarter even though no wages were paid, unless the employer has notified the commissioner, under section 268.042, subdivision 1, of termination of business.\nEach employer must submit the quarterly wage detail report by electronic transmission in a format prescribed by the commissioner. The commissioner has the discretion to accept wage detail reports that are submitted by any other means or the commissioner may return the report submitted by other than electronic transmission to the employer, and reports returned are considered as not submitted and the late fees under subdivision 2 may be imposed.\n(a) Any employer that fails to submit the quarterly wage detail report when due must pay a late fee of $10 per employee, computed based upon the highest of:\n(1) the number of employees reported on the last wage detail report submitted;\n(2) the number of employees reported in the corresponding quarter of the prior calendar year; or\n(3) if no wage detail report has ever been submitted, the number of employees listed at the time of employer registration.\nThe late fee is canceled if the wage detail report is received within 30 calendar days after a demand for the report is sent to the employer by mail or electronic transmission. A late fee assessed an employer may not be canceled more than twice each 12 months. The amount of the late fee assessed may not be less than $250.\n(b) If the wage detail report is not received in a manner and format prescribed by the commissioner within 30 calendar days after demand is sent under paragraph (a), the late fee assessed under paragraph (a) doubles and a renewed demand notice and notice of the increased late fee will be sent to the employer by mail or electronic transmission.\n(c) Late fees due under this subdivision may be canceled, in whole or in part, under section 268.067.\n(a) Any employer that submits the wage detail report, but fails to include all required employee information or enters erroneous information, is subject to an administrative service fee of $25 for each employee for whom the information is partially missing or erroneous.\n(b) Any employer that submits the wage detail report, but fails to include an employee, is subject to an administrative service fee equal to two percent of the total wages for each employee for whom the information is completely missing.\n(c) An administrative service fee under this subdivision must be canceled under section 268.067 if the commissioner determines that the failure or error by the employer occurred because of ignorance or inadvertence.\nThe fees provided for in subdivisions 2 and 3 are in addition to interest and other penalties imposed by this chapter and are collected in the same manner as delinquent taxes and credited to the contingent account.",
	"repealed": false
}