{
	"id": "270B.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/270B.162",
	"title": "270B.162 DISCLOSURE; MINIMUM WAGE STUDY.",
	"text": "(a) The commissioner may disclose return information to the Federal Reserve Bank of Minneapolis to be used only for the purpose of conducting and publishing economic research studies regarding the impact of minimum wage ordinances adopted by Minneapolis, St. Paul, and other Minnesota cities.\n(b) For purposes of this section, the scope of the return information disclosed is limited to return information for returns filed under chapter 290 and does not include a name, address, Social Security number, taxpayer identification number, or a federal Employer Identification Number.\n(c) The commissioner may enter into a data-sharing agreement only if the agreement includes the following:\n(1) the rationale, purpose, and legal authority for the data sharing;\n(2) a description of the data that may be shared;\n(3) procedures governing the use of the data;\n(4) procedures for transmitting the data;\n(5) procedures for ensuring the security of the data, including protecting the data from unauthorized access or use;\n(6) prohibitions on duplication and redisclosure of the data;\n(7) a requirement that access to the data be limited to persons whose work assignment requires access to the data;\n(8) a requirement that published studies must not include the identity of a taxpayer or any data where the identity of a taxpayer could be associated with any of the data derived from the taxpayer's return;\n(9) procedures for retention and destruction of data shared and created, including requirements that all data must be destroyed following the final publication of any research studies and that the Federal Reserve Bank of Minneapolis must provide the commissioner with a certificate of destruction;\n(10) a requirement that the Federal Reserve Bank of Minneapolis maintain a data audit trail that records all instances of access and all actions in which data are entered, updated, or disseminated and identify all persons with access to the data;\n(11) procedures for arranging and providing for an independent annual audit to verify the Federal Reserve Bank of Minneapolis's compliance with the data-sharing agreement, including a requirement that the results of each independent annual audit be submitted to the chairs and ranking minority members of the legislative committees with jurisdiction over civil law and data practices by June 30 each year; and\n(12) a requirement that the results of the minimum wage study be submitted to the chairs and ranking minority members of the legislative committees with jurisdiction over jobs.\n(d) The results of an audit are public to the extent the data are not otherwise classified by law.\n(e) The commissioner's authority to disclose return information under this section expires on December 31, 2033.",
	"repealed": false
}