{
	"id": "256B.0654",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0654",
	"title": "256B.0654 HOME CARE NURSING.",
	"text": "(a) \"Complex home care nursing\" means home care nursing services provided to recipients who meet the criteria for regular home care nursing and require life-sustaining interventions to reduce the risk of long-term injury or death.\n(b) \"Home care nursing\" means ongoing hourly nursing ordered by a physician, advanced practice registered nurse, or physician assistant and services performed by a registered nurse or licensed practical nurse within the scope of practice as defined by the Minnesota Nurse Practice Act under sections 148.171 to 148.285, in order to maintain or restore a person's health.\n(c) \"Home care nursing agency\" means a medical assistance enrolled provider licensed under chapter 144A to provide home care nursing services.\n(d) \"Regular home care nursing\" means home care nursing provided because:\n(1) the recipient requires more individual and continuous care than can be provided during a skilled nurse visit; or\n(2) the cares are outside of the scope of services that can be provided by a home health aide or personal care assistant.\n(e) \"Shared home care nursing\" means the provision of home care nursing services by a home care nurse to two recipients at the same time and in the same setting.\nMS 2008 [Renumbered 256B.0652, subd 5]\n(a) Home care nursing services must be used:\n(1) in the recipient's home or outside the home when normal life activities require;\n(2) when the recipient requires more individual and continuous care than can be provided during a skilled nurse visit; and\n(3) when the care required is outside of the scope of services that can be provided by a home health aide or personal care assistant.\n(b) Home care nursing services must be:\n(1) assessed by a registered nurse on a form approved by the commissioner;\n(2) ordered by a physician, advanced practice registered nurse, or physician assistant and documented in a plan of care that is reviewed by the ordering practitioner at least once every 60 days; and\n(3) authorized by the commissioner under section 256B.0652.\nHome care nursing services do not cover the following:\n(1) nursing services by a nurse who is the family foster care provider of a person who has not reached 18 years of age unless allowed under subdivision 4;\n(2) nursing services to more than two persons receiving shared home care nursing services from a home care nurse in a single setting; and\n(3) nursing services provided by a registered nurse or licensed practical nurse who is the recipient's legal guardian or related to the recipient as spouse, parent, or family foster parent whether by blood, marriage, or adoption except as specified in subdivision 4.\n(a) Medical assistance payments for shared home care nursing services by a home care nurse shall be limited according to this subdivision. Unless otherwise provided in this subdivision, all other statutory and regulatory provisions relating to home care nursing services apply to shared home care nursing services. Nothing in this subdivision shall be construed to reduce the total number of home care nursing hours authorized for an individual recipient.\n(b) Shared home care nursing is the provision of nursing services by a home care nurse to two medical assistance eligible recipients at the same time and in the same setting. This subdivision does not apply when a home care nurse is caring for multiple recipients in more than one setting.\n(c) For the purposes of this subdivision, \"setting\" means:\n(1) the home residence or foster care home of one of the individual recipients as defined in section 256B.0651;\n(2) a child care program licensed under chapter 142B or operated by a local school district or private school;\n(3) an adult day care service licensed under chapter 245A; or\n(4) outside the home residence or foster care home of one of the recipients when normal life activities take the recipients outside the home.\n(d) The home care nursing agency must offer the recipient the option of shared or one-on-one home care nursing services. The recipient may withdraw from participating in a shared service arrangement at any time.\n(e) The recipient or the recipient's legal representative, and the recipient's physician, advanced practice registered nurse, or physician assistant, in conjunction with the home care nursing agency, shall determine:\n(1) whether shared home care nursing care is an appropriate option based on the individual needs and preferences of the recipient; and\n(2) the amount of shared home care nursing services authorized as part of the overall authorization of nursing services.\n(f) The recipient or the recipient's legal representative, in conjunction with the home care nursing agency, shall approve the setting, grouping, and arrangement of shared home care nursing care based on the individual needs and preferences of the recipients. Decisions on the selection of recipients to share services must be based on the ages of the recipients, compatibility, and coordination of their care needs.\n(g) The following items must be considered by the recipient or the recipient's legal representative and the home care nursing agency, and documented in the recipient's health service record:\n(1) the additional training needed by the home care nurse to provide care to two recipients in the same setting and to ensure that the needs of the recipients are met appropriately and safely;\n(2) the setting in which the shared home care nursing care will be provided;\n(3) the ongoing monitoring and evaluation of the effectiveness and appropriateness of the service and process used to make changes in service or setting;\n(4) a contingency plan which accounts for absence of the recipient in a shared home care nursing setting due to illness or other circumstances;\n(5) staffing backup contingencies in the event of employee illness or absence; and\n(6) arrangements for additional assistance to respond to urgent or emergency care needs of the recipients.\n(h) The documentation for shared home care nursing must be on a form approved by the commissioner for each individual recipient sharing home care nursing. The documentation must be part of the recipient's health service record and include:\n(1) permission by the recipient or the recipient's legal representative for the maximum number of shared nursing hours per week chosen by the recipient and permission for shared home care nursing services provided in and outside the recipient's home residence;\n(2) revocation by the recipient or the recipient's legal representative for the shared home care nursing permission, or services provided to others in and outside the recipient's residence; and\n(3) daily documentation of the shared home care nursing services provided by each identified home care nurse, including:\n(i) the names of each recipient receiving shared home care nursing services;\n(ii) the setting for the shared services, including the starting and ending times that the recipient received shared home care nursing care; and\n(iii) notes by the home care nurse regarding changes in the recipient's condition, problems that may arise from the sharing of home care nursing services, and scheduling and care issues.\n(i) The commissioner shall provide a rate methodology for shared home care nursing. For two persons sharing nursing care, the rate paid to a provider must not exceed 1.5 times the regular home care nursing rates paid for serving a single individual by a registered nurse or licensed practical nurse. These rates apply only to situations in which both recipients are present and receive shared home care nursing care on the date for which the service is billed.\n(a) Payment is allowed for extraordinary services that require specialized nursing skills and are provided by parents of minor children, family foster parents, spouses, and legal guardians who are providing home care nursing care under the following conditions:\n(1) the provision of these services is not legally required of the parents, spouses, or legal guardians;\n(2) the services are necessary to prevent hospitalization of the recipient; and\n(3) the recipient is eligible for state plan home care or a home and community-based waiver and one of the following hardship criteria are met:\n(i) the parent, spouse, or legal guardian resigns from a part-time or full-time job to provide nursing care for the recipient;\n(ii) the parent, spouse, or legal guardian goes from a full-time to a part-time job with less compensation to provide nursing care for the recipient;\n(iii) the parent, spouse, or legal guardian takes a leave of absence without pay to provide nursing care for the recipient; or\n(iv) because of labor conditions, special language needs, or intermittent hours of care needed, the parent, spouse, or legal guardian is needed in order to provide adequate home care nursing services to meet the medical needs of the recipient.\n(b) Home care nursing may be provided by a parent, spouse, family foster parent, or legal guardian who is a nurse licensed in Minnesota. Home care nursing services provided by a parent, spouse, family foster parent, or legal guardian cannot be used in lieu of nursing services covered and available under liable third-party payors, including Medicare. The home care nursing provided by a parent, spouse, family foster parent, or legal guardian must be included in the service agreement. Authorized nursing services for a single recipient or recipients with the same residence and provided by the parent, spouse, family foster parent, or legal guardian may not exceed 50 percent of the total approved nursing hours, or eight hours per day, whichever is less, up to a maximum of 40 hours per week. A parent or parents, spouse, family foster parent, or legal guardian shall not provide more than 40 hours of services in a seven-day period. For parents, family foster parents, and legal guardians, 40 hours is the total amount allowed regardless of the number of children or adults who receive services. Nothing in this subdivision precludes the parent's, spouse's, or legal guardian's obligation of assuming the nonreimbursed family responsibilities of emergency backup caregiver and primary caregiver.\n(c) A parent, family foster parent, or a spouse may not be paid to provide home care nursing care if:\n(1) the parent or spouse fails to pass a criminal background check according to chapter 245C;\n(2) it has been determined by the home care nursing agency, the case manager, or the physician, advanced practice registered nurse, or physician assistant that the home care nursing provided by the parent, family foster parent, spouse, or legal guardian is unsafe; or\n(3) the parent, family foster parent, spouse, or legal guardian does not follow physician, advanced practice registered nurse, or physician assistant orders.\n(d) For purposes of this section, \"assessment\" means a review and evaluation of a recipient's need for home care services conducted in person. Assessments for home care nursing must be conducted by a registered nurse.\nThe commissioner shall annually adjust payments for home care nursing services to reflect the change in the federal Centers for Medicare and Medicaid Services Home Health Agency Market Basket. The commissioner shall use the indices as forecasted for the midpoint of the prior rate year to the midpoint of the current rate year.",
	"repealed": false
}