{
	"id": "256R.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.23",
	"title": "256R.23 TOTAL CARE-RELATED PAYMENT RATES.",
	"text": "Each facility's total care-related cost per day is the sum of its direct care cost per standardized day and its other care-related cost per resident day.\nEach facility's direct care cost per standardized day is the facility's direct care costs divided by the sum of the facility's standardized days. A facility's direct care cost per standardized day is the facility's cost per day for direct care services associated with a case mix index of 1.00.\nEach facility's other care-related cost per resident day is its other care-related costs, divided by the sum of the facility's resident days.\nThe commissioner must determine the median total care-related cost per day using the cost reports from nursing facilities in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington Counties.\nThe commissioner must determine each facility's total care-related payment rate limit by:\n(1) multiplying the facility's quality score, as determined under section 256R.16, subdivision 1, by 0.5625;\n(2) adding 89.375 to the amount determined in clause (1), and dividing the total by 100; and\n(3) multiplying the amount determined in clause (2) by the median total care-related cost per day.\nNo facility shall be subject in any rate year to a care-related payment rate limit reduction greater than five percent of the median determined in subdivision 4.\nA facility's direct care payment rate equals the lesser of (1) the facility's direct care costs per standardized day, or (2) the facility's direct care costs per standardized day divided by its cost to limit ratio.\nA facility's other care-related payment rate equals the lesser of (1) the facility's other care-related cost per resident day, or (2) the facility's other care-related cost per resident day divided by its cost to limit ratio.\nA facility's total care-related payment rate is the sum of its direct care payment rate as determined in subdivision 7 and its other care-related payment rate as determined in subdivision 8.",
	"repealed": false
}