{
	"id": "16B.4805",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.4805",
	"title": "16B.4805 ACCOMMODATION REIMBURSEMENT.",
	"text": "\"Reasonable accommodation\" as used in this section has the meaning given in section 363A.08. \"State agency\" as used in this section has the meaning given in section 16A.011, subdivision 12. \"Reasonable accommodations eligible for reimbursement\" means:\n(1) reasonable accommodations provided to applicants for employment;\n(2) reasonable accommodations for employees for services that will need to be provided on a periodic or ongoing basis; or\n(3) reasonable accommodations that involve onetime expenses that total more than $500 for an employee in a fiscal year.\nThe commissioner of administration shall reimburse state agencies for up to 50 percent of the cost of expenses incurred in making reasonable accommodations eligible for reimbursement for agency employees and applicants for employment to the extent that funds are available in the accommodation account established under subdivision 3 for this purpose.\nThe accommodation account is created as an account in the special revenue fund for reimbursing state agencies for expenses incurred in providing reasonable accommodation eligible for reimbursement for agency employees and applicants for agency employment.\nThe commissioner may use up to 15 percent of the biennial appropriation for administration of this section.\nBy August 1, 2015, or within 30 days of final enactment, whichever is later, and each year thereafter by June 30, the commissioner of administration must notify state agencies that reimbursement for expenses incurred to make reasonable accommodation eligible for reimbursement for agency employees and applicants for agency employment is available under this section.\nBy January 31 of each year, the commissioner of administration must report to the chairs and ranking minority members of the house of representatives and the senate committees with jurisdiction over state government finance on the use of the central accommodation account during the prior calendar year. The report must include:\n(1) the number and type of accommodations requested;\n(2) the cost of accommodations requested;\n(3) the state agencies from which the requests were made;\n(4) the number of requests made for employees and the number of requests for applicants for employment;\n(5) the number and type of accommodations that were not provided;\n(6) any remaining balance left in the account;\n(7) if the account was depleted, the date on which funds were exhausted and the number, type, and cost of accommodations that were not reimbursed to state agencies; and\n(8) a description of how the account was promoted to state agencies.",
	"repealed": false
}