{
	"id": "49.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.24",
	"title": "49.24 PROCEDURE IN LIQUIDATION.",
	"text": "Upon taking possession of the property and assets of any financial institution the commissioner shall make an inventory of the assets of such financial institution, in duplicate, one to be filed in the office of the commissioner and one in the office of the court administrator of the district court, and thereupon the district court shall assume jurisdiction for the purpose of taking such action as is provided for in sections 49.24 to 49.32.\nThe commissioner shall collect all debts due and all claims belonging to such financial institution. Whenever the commissioner is of the opinion that a debt due such financial institution is bad or doubtful the commissioner may present a verified petition to a judge of the district court setting forth the facts; and the judge if satisfied that it is for the best interests of the creditors may hear such petition without notice and make an order granting such petition and authorizing the petitioner to sell, compound, or compromise such debt. Personal property or real estate may be sold on like petition, approval, and order. If a petition for the sale of real estate is presented, the judge may require that notice of a hearing thereon be given to the creditors by publication in such manner as the judge orders. The commissioner may compromise bad or doubtful debts and sell personal property having a book value, as shown by the commissioner's inventory, of not to exceed $200 without such order.\nUpon the request of the commissioner in writing the attorney general shall employ a special attorney to act as counsel in all matters relating to the liquidation of each financial institution, which appointment shall be made according to the provisions of the statutes regulating the employment by the attorney general of special attorneys for state boards and officers, and the payment of such attorney shall be made in the manner provided in subdivision 7 for the payment of compensation and expenses in liquidation of financial institutions.\nThe commissioner shall cause notice to be given by advertisement in a legal newspaper in the city where such financial institution had its principal place of business prior to liquidation, or, if none in such city, then in the county, weekly for five consecutive weeks, calling on all persons who may have claims against such financial institution to present the same to the commissioner, and make legal proof thereof at a place and within a time not earlier than one week after the last day of publication, which time and place shall be specified in said notice. The commissioner shall mail a similar notice to all persons whose names appear as creditors upon the books of the financial institution.\nIf the commissioner doubts the justice or validity of any claim, the commissioner may reject the same in whole or in part and serve notice of such rejection upon the claimant, either by mail or personally. An affidavit of the service of such notice made according to law shall be filed with the commissioner. An action upon a claim so rejected must be brought within 60 days after such service and the filing of proof thereof. The venue of such action shall be in the county in which such financial institution had its principal place of business prior to liquidation, and such action shall be brought jointly against the financial institution and the commissioner or receiver or liquidator appointed by the commissioner as statutory liquidator thereof. Any person having a claim against such financial institution which is not presented and filed within the time fixed in the notice to creditors may thereafter present the same and the commissioner shall allow or reject the same in whole or in part and give notice of any rejection, as hereinbefore provided. Suit on any such claim not filed within the time fixed by the notice which is rejected must be brought within 30 days after the service and filing of proof of such rejection. Any claim not filed within the time fixed in the notice to creditors but later received and filed as by this section provided and duly allowed, shall participate and share in such dividends only as shall be paid from the proceeds of those assets remaining undistributed at the time of filing of such claim, and any claim not filed prior to the declaration of a final dividend shall be barred. No action shall be commenced against any such financial institution after possession of the business and property thereof has been taken by the commissioner on any claim until such claim has been filed with and rejected, in whole or in part, by the commissioner. As to any action pending at the time the commissioner takes possession of the business and property of such financial institution which has been stayed by order of the court, a claim may be filed for the subject matter of said action. If the claim be allowed, the action shall terminate and be dismissed without costs and disbursements, but, if rejected in whole or in part, the stay order shall be vacated, and the action may continue. No interest shall be allowed or paid on any deposit or other claim from and after the closing of the financial institution and the taking over of the same by the commissioner for purposes of liquidation.\nUpon the expiration of the time fixed for the presentation of claims, the commissioner shall make in duplicate a complete list of the claims presented, including and specifying such claims as have been rejected by the commissioner, one such list to be filed in the commissioner's office and one in the office of the court administrator of the district court. The inventory and list of claims shall be open at all reasonable times to inspection.\nAll expenses of supervision and liquidation and the compensation of legal counsel as fixed by the attorney general, shall be paid upon the certificate of the commissioner out of the commissioner of commerce's liquidation fund created by this section. The commissioner shall determine monthly the amount of compensation paid to each employee for services in connection with the liquidation of each financial institution and of all other expenses in connection therewith and thereupon shall pay to the commissioner of management and budget from the assets of each such financial institution the amount so determined, if such assets be sufficient to pay the amount of such compensation and expenses, which shall be deposited in such commissioner of commerce's liquidation fund.\nThe money collected by the commissioner shall be from time to time deposited in one or more state banks or trust companies, and, in case of a suspension or insolvency of the depository, such deposit shall be preferred before all of the deposits.\nAt any time after the expiration of the date fixed for the presentation of claims the commissioner may, out of the funds remaining on hand after the payment of expenses and amounts due to depositors, declare one or more dividends, and after the expiration of one year from the first publication of notice to creditors, may declare a final dividend, such dividends to be paid to such persons in such amounts as may be directed by the district court.\nIf any dividend on any claim shall be less than $1, the commissioner may hold that dividend until it with subsequent dividends amounts to the sum of $1 or more. The commissioner shall pay all dividends so withheld with the final dividend.\nObjections to any claim not rejected by the commissioner may be made by any party interested by filing a copy of such objections with the commissioner, who shall present the same to the district court at the time of the next application to declare a dividend.\n[Repealed, 1945 c 128 s 13]\nWhenever the commissioner shall have paid each and every depositor and other creditor of any financial institution in liquidation (not including stockholders) whose claim or claims as such creditor or depositor shall have been duly approved and allowed, and who can be located by the commissioner for the purpose of making payment, the full amount of such claim or claims as allowed, and shall have made proper provisions for any dividends or other moneys set apart for the payment of claims remaining unpaid, and shall have paid all the expenses of the liquidation, the commissioner shall call a meeting of the stockholders of such financial institution by giving notice thereof for ten days by publishing such notice in one or more newspapers of the county where it had its principal place of business prior to liquidation. At such meeting the stockholders shall determine whether the commissioner shall be continued as liquidator and shall wind up the affairs of such financial institution, or whether an agent or agents shall be elected for that purpose, and in so determining the said stockholders shall vote by ballot, in person or by proxy, each share of stock entitling the holder to one vote, and the majority of the stock shall be necessary to a determination. In case it is determined to continue the liquidation under the commissioner, the commissioner shall complete the liquidation of the affairs of such financial institution, and after paying the expenses thereof, if there are proceeds of liquidation as yet undistributed shall reimburse any stockholders who have paid stock assessments pursuant to any order for assessment to the extent that each has paid, and if the proceeds are insufficient to reimburse such paying stockholders in full, then in just proportion. Any proceeds remaining undistributed after such paying stockholders have been reimbursed as by this subdivision provided shall be distributed among all the stockholders in proportion to their several holdings of stock in such manner and upon such notice as may be directed by the district court. In case it is determined to appoint an agent or agents to liquidate, the stockholders shall thereupon select such agent or agents by ballot, a majority of the stock present and voting, in person or by proxy, being necessary to a choice. Such agent or agents shall execute and file with the commissioner a bond to the state of Minnesota, in such amount, with such sureties, and in such form as shall be approved by the commissioner, conditioned for the faithful performance of all the duties of trust, and thereupon the commissioner shall transfer and deliver to such agent or agents all the undivided or uncollected or other assets of such corporation then remaining in the commissioner's hands, and upon such transfer and delivery the said commissioner shall be discharged from any and all further liability to such financial institution and its creditors. Such agent or agents shall convert the assets into cash and shall account for and make distribution of the property of such financial institution as is herein provided in the case of distribution by the commissioner, except that the expenses thereof shall be subject to the direction and control of the district court. In case of the death, removal or refusal to act of any such agent, the stockholders, on the same notice as that after which they were elected, and in the same way may elect a successor who shall have the same powers and be subject to the same liabilities and duties as the agent originally elected.\nUpon the liquidation of any financial institution liquidated by the commissioner as statutory liquidator, if any dividends or other moneys set apart for the payment of claims remain unpaid, and the places of residence of the owners thereof are unknown to the commissioner, the commissioner may pay same into the state treasury as hereinafter provided. Whenever the commissioner shall be satisfied that the process of liquidation should not be further continued the commissioner may make and certify triplicate lists of any such unclaimed dividends or other moneys, specifying the name of each owner, the amount due, and the last known address. Upon one of such lists, to be retained by the commissioner shall be endorsed the commissioner's order that such unclaimed moneys be forthwith deposited in the state treasury. When so deposited, one of said lists shall be delivered to the commissioner of management and budget and the commissioner shall retain in the commissioner's office such records and proofs concerning said claims as the commissioner may have, which shall thereafter remain on file in the office. The commissioner of management and budget shall execute upon the list retained by the commissioner a receipt for such money, which shall operate as a full discharge of the commissioner on account of such claims. At any time within six years after such receipt, but not afterward, the claimant may apply to the commissioner for the amount so deposited for the claimant's benefit, and upon proof satisfactory to the governor, the attorney general and the commissioner, or to a majority of them, they shall give an order to the commissioner of management and budget to issue a payment for such amount, and such payment shall thereupon be issued. If no such claim be presented within six years, the commissioner shall so note upon the commissioner's copy of said list and certify the fact to the commissioner of management and budget who shall make like entries upon the commissioner of management and budget's corresponding lists; and all further claims to said money shall be barred. Provided, that the commissioner of management and budget shall transfer to the commissioner of commerce's liquidation fund created by this section not to exceed 50 percent of the amount so turned over by the commissioner, to be used to partially defray expenses in connection with the liquidation of closed banks and the conduct of the liquidation division, in such amounts and at such times as the commissioner shall request.\nThere is hereby appropriated to the persons entitled to such amounts, from such moneys in the state treasury not otherwise appropriated, an amount sufficient to make such payment.\nAt any time after ten years from the date of payment of the final dividend in liquidation of any financial institution the commissioner may destroy all books and records of such financial institution which came into the commissioner's care and custody at the time the commissioner took possession of the assets thereof, unless requested by some interested party to preserve any such books or records for any purpose for any period beyond such ten years.\nThere is hereby created the commissioner of commerce's liquidation fund, for the purpose of paying the expenses of liquidating financial institutions and of conducting the Liquidation Division. Such fund shall consist of the moneys transferred to it as herein provided, which are appropriated to the commissioner for the purposes of this section. Such funds shall be kept in the state treasury and shall be paid out upon authorization of the commissioner in the manner prescribed by law for moneys therein.\nThe following moneys shall be transferred to and deposited in the commissioner of commerce's liquidation fund:\n(1) All moneys paid to the commissioner of management and budget by the commissioner out of funds of any financial institution in the commissioner's hands as reimbursement for services and expenses pursuant to the provisions of subdivision 7.\n(2) All moneys in the possession of the commissioner set aside for the purpose of meeting unforeseen and contingent expenses incident to the liquidation of closed financial institutions, which funds have been or shall be hereafter established by withholding portions of final liquidating dividends in such cases.\n(3) All moneys which the commissioner shall request the commissioner of management and budget to transfer to such fund pursuant to the provisions of subdivision 13.\n(4) All moneys in the possession of the commissioner now carried on the commissioner's books in \"stamp account,\" \"suspense account,\" and \"unclaimed deposit account.\"\n(5) All moneys in the possession of the commissioner which the commissioner may be authorized by order of any district court having jurisdiction of any liquidation proceedings to transfer to such fund, or to use for any of the purposes for which the fund is established.\n(6) All moneys in the possession of the commissioner carried on the commissioner's books in the \"unclaimed bonds account.\" At any time within six years after any bond the proceeds of the sale of which constitute a portion of the moneys in this paragraph referred to came into the possession of the commissioner as liquidator of any financial institution, any claimant thereto may apply to the commissioner for the proceeds of the sale of such bond, and, upon proof satisfactory to the governor, the attorney general, and the commissioner, or a majority of them, they shall give an order to the commissioner of management and budget to issue a payment for such amount, without interest, and such payment shall thereupon be issued and the amount thereof paid out of the commissioner of commerce's liquidation fund. If no such claim be presented within such period, all further claims to the proceeds of any such bond shall be barred.\n(7) All sums which the commissioner may receive from the sale of personal property of liquidated financial institutions where the final dividend has been paid and no disposition of said property made by any order of the court, and the proceeds of sales of any personal property used by the liquidation division which have been purchased with funds of financial institutions in liquidation.\nThe commissioner of commerce's liquidation fund shall be used for the purpose of paying compensation and expenses as provided in subdivision 7, for the payment of salaries of employees, regular and special, the compensation of legal counsel, and all other expenses incurred by the commissioner in connection with the administration of the Liquidation Division.",
	"repealed": false
}