{
	"id": "142E.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.19",
	"title": "142E.19 ADMINISTRATIVE REVIEW.",
	"text": "A provider has the right to an administrative review under this section if (1) a payment was suspended under sections 142E.50 to 142E.58, or (2) the provider's authorization was denied or revoked under section 142E.17, subdivision 9, paragraph (d), clause (1) or (2).\n(a) The commissioner must send written notice to a provider within five days of suspending payment or denying or revoking the provider's authorization under subdivision 1.\n(b) The notice must:\n(1) state the provision under which the commissioner is denying, revoking, or suspending the provider's authorization or suspending payment to the provider;\n(2) set forth the general allegations leading to the denial, revocation, or suspension of the provider's authorization. The notice need not disclose any specific information concerning an ongoing investigation;\n(3) state that the denial, revocation, or suspension of the provider's authorization is for a temporary period and explain the circumstances under which the action expires; and\n(4) inform the provider of the right to submit written evidence and argument for consideration by the commissioner.\n(c) Notwithstanding Minnesota Rules, part 3400.0185, if the commissioner suspends payment to a provider under sections 142E.50 to 142E.58 or denies or revokes a provider's authorization under section 142E.17, subdivision 9, paragraph (d), clause (1) or (2), a county agency or the commissioner must send notice of service authorization closure to each affected family. The notice sent to an affected family is effective on the date the notice is created.\n[See Note.]\nIf a provider's payment is suspended under sections 142E.50 to 142E.58 or a provider's authorization is denied or revoked under section 142E.17, subdivision 9, paragraph (d), clause (1) or (2), the provider's denial, revocation, temporary suspension, or payment suspension remains in effect until:\n(1) the commissioner or a law enforcement authority determines that there is insufficient evidence warranting the action and the commissioner does not pursue an additional administrative remedy under sections 142E.50 to 142E.58 or section 256.98; or\n(2) all criminal, civil, and administrative proceedings related to the provider's alleged misconduct conclude and any appeal rights are exhausted.\n[See Note.]\nThe commissioner may find that good cause exists not to deny, revoke, or suspend a provider's authorization, or not to continue a denial, revocation, or suspension of a provider's authorization if any of the following are applicable:\n(1) a law enforcement authority specifically requested that a provider's authorization not be denied, revoked, or suspended because that action may compromise an ongoing investigation;\n(2) the commissioner determines that the denial, revocation, or suspension should be removed based on the provider's written submission; or\n(3) the commissioner determines that the denial, revocation, or suspension is not in the best interests of the program.",
	"repealed": false
}