{
	"id": "144G.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.32",
	"title": "144G.32 RECONSIDERATION OF CORRECTION ORDERS AND FINES.",
	"text": "The commissioner shall make available to assisted living facilities a correction order reconsideration process. This process may be used to challenge the correction order issued, including the level and scope described in section 144G.31, and any fine assessed. When a licensee requests reconsideration of a correction order, the correction order is not stayed while it is under reconsideration. The commissioner shall post information on its website that the licensee requested reconsideration of the correction order and that the review is pending.\nAn assisted living facility may request from the commissioner, in writing, a correction order reconsideration regarding any correction order issued to the facility. The written request for reconsideration must be received by the commissioner within 15 calendar days of the correction order receipt date. The correction order reconsideration shall not be reviewed by any surveyor, investigator, or supervisor that participated in writing or reviewing the correction order being disputed. The correction order reconsiderations may be conducted in person, by telephone, by another electronic form, or in writing, as determined by the commissioner. The commissioner shall respond in writing to the request from a facility for a correction order reconsideration within 60 days of the date the facility requests a reconsideration. The commissioner's response shall identify the commissioner's decision regarding each citation challenged by the facility.\nThe findings of a correction order reconsideration process shall be one or more of the following:\n(1) supported in full: the correction order is supported in full, with no deletion of findings to the citation;\n(2) supported in substance: the correction order is supported, but one or more findings are deleted or modified without any change in the citation;\n(3) correction order cited an incorrect licensing requirement: the correction order is amended by changing the correction order to the appropriate statute or rule;\n(4) correction order was issued under an incorrect citation: the correction order is amended to be issued under the more appropriate correction order citation;\n(5) the correction order is rescinded;\n(6) fine is amended: it is determined that the fine assigned to the correction order was applied incorrectly; or\n(7) the level or scope of the citation is modified based on the reconsideration.\nIf the correction order findings are changed by the commissioner, the commissioner shall update the correction order website.\nThis section does not apply to provisional licensees.",
	"repealed": false
}