{
	"id": "231.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/231.16",
	"title": "231.16 WAREHOUSE OPERATOR OR HOUSEHOLD GOODS WAREHOUSE OPERATOR LICENSE.",
	"text": "A warehouse operator or household goods warehouse operator must be licensed annually by the department. The department shall prescribe the form of the written application. If the department approves the license application and the applicant files with the department the necessary bond, in the case of household goods warehouse operators, or proof of warehouse operators legal liability insurance coverage in an amount of $50,000 or more, as provided for in this chapter, the department shall issue the license upon payment of the license fee required in this section. A warehouse operator or household goods warehouse operator to whom a license is issued shall pay a fee as follows:\nBuilding square footage used for public storage\nA penalty amount not to exceed ten percent of the fees due may be imposed by the commissioner for each month for which the fees are delinquent.\nFees collected under this chapter must be paid into the grain buyers and storage account established in section 232.22.\nThe license must be renewed annually on or before July 1, and always upon payment of the full license fee required in this section. No license shall be issued for any portion of a year for less than the full amount of the license fee required in this section. Each license obtained under this chapter must be publicly displayed in the main office of the place of business of the warehouse operator or household goods warehouse operator to whom it is issued. The license authorizes the warehouse operator or household goods warehouse operator to carry on the business of warehousing only in the one city or town named in the application and in the buildings therein described. The department, without requiring an additional bond and license, may issue permits from time to time to any warehouse operator already duly licensed under the provisions of this chapter to operate an additional warehouse in the same city or town for which the original license was issued during the term thereof, upon the filing an application for a permit in the form prescribed by the department.\nA license may be refused for good cause shown and revoked by the department for violation of law or of any rule adopted by the department, upon notice and after hearing.",
	"repealed": false
}