{
	"id": "60K.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.37",
	"title": "60K.37 APPLICATION FOR LICENSE.",
	"text": "A person is a resident of this state if that person resides in this state or the principal place of business of that person is maintained in this state. Application for a license claiming residency in this state constitutes an election of residency in this state. A license issued upon an application claiming residency in this state is void if the licensee, while holding a resident license in this state, obtains a resident license in, or claims to be a resident of, any other state or jurisdiction or if the licensee ceases to be a resident of this state.\nA person applying for a resident insurance producer license shall make application to the commissioner on the Uniform Application and declare under penalty of refusal, suspension, or revocation of the license that the statements made in the application are true, correct, and complete to the best of the individual's knowledge and belief. Before approving the application, the commissioner shall find that the individual:\n(1) is at least 18 years of age;\n(2) has not committed any act that is a ground for denial, suspension, or revocation set forth in section 60K.43;\n(3) has completed, where required by the commissioner, a prelicensing course of study for the lines of authority for which the person has applied;\n(4) has paid the fees set forth in section 60K.55; and\n(5) has successfully passed the examinations for the lines of authority for which the person has applied.\n(a) An individual applying for a resident insurance producer license must:\n(1) consent to a criminal history record check;\n(2) submit a fingerprint card in a form acceptable to the commissioner; and\n(3) pay the fee required to perform criminal history record checks with the Minnesota Bureau of Criminal Apprehension and the Federal Bureau of Investigation.\n(b) The commissioner may contract for the collection and transmission of fingerprints required under this chapter and may order the fee for collecting and transmitting fingerprints to be payable directly to the contractor by the applicant. The commissioner may agree to a reasonable fingerprinting fee to be charged by the contractor.\n(c) The commissioner must treat and maintain an applicant's fingerprints and any criminal history record information obtained under this chapter as confidential and must apply security measures consistent with the standards specified by the Criminal Justice Information Services Division of the Federal Bureau of Investigation for the electronic storage of fingerprints and necessary identifying information. The commissioner must limit the use of records solely to the purposes authorized in this chapter. The fingerprints and any criminal history record information must not be subject to subpoena, other than one issued in a criminal action or investigation.\n(d) The commissioner may receive criminal history record information from another government agency in lieu of the Minnesota Bureau of Criminal Apprehension.\n(a) A business entity acting as an insurance producer is required to obtain an insurance producer license. Application must be made using the Uniform Business Entity Application. Before approving the application, the commissioner shall find that:\n(1) the business entity has paid the fees set forth in section 60K.55; and\n(2) the business entity has designated an individual licensed producer responsible for the business entity's compliance with the insurance laws and rules of this state.\n(b) A business entity insurance producer license does not grant authority to any individual officer, director, partner, member, or employee to act as an insurance producer.\nApplication for a license under this chapter constitutes appointment of the commissioner as the person's agent for service of process under section 45.028.\nThe commissioner may require any documents reasonably necessary to verify the information contained in an application.\nAn insurer that sells, solicits, or negotiates any form of limited line credit insurance shall provide to each individual whose duties will include selling, soliciting, or negotiating limited line credit insurance a program of instruction that may be approved by the commissioner.\nA resident individual applying for a variable life and variable annuity license shall demonstrate that the applicant holds a current license as a life insurance producer.",
	"repealed": false
}