{
	"id": "282.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.04",
	"title": "282.04 TIMBER SALES; LAND USE, LEASE, PARTITION, EASEMENT.",
	"text": "(a) The county auditor, with terms and conditions set by the county board, may sell timber upon any tract that may be approved by the natural resources commissioner. The sale of timber shall be made for cash at not less than the appraised value determined by the county board to the highest bidder after not less than one week's published notice in an official paper within the county. Any timber offered at the public sale and not sold may thereafter be sold at private sale by the county auditor at not less than the appraised value thereof, until the time as the county board may withdraw the timber from sale. The appraised value of the timber and the forestry practices to be followed in the cutting of said timber shall be approved by the commissioner of natural resources.\n(b) Payment of the full sale price of all timber sold on tax-forfeited lands shall be made in cash at the time of the timber sale, except in the case of oral or sealed bid auction sales, the down payment shall be no less than 15 percent of the appraised value, and the balance shall be paid prior to entry. In the case of auction sales that are partitioned and sold as a single sale with predetermined cutting blocks, the down payment shall be no less than 15 percent of the appraised price of the entire timber sale which may be held until the satisfactory completion of the sale or applied in whole or in part to the final cutting block. The value of each separate block must be paid in full before any cutting may begin in that block. With the permission of the county contract administrator the purchaser may enter unpaid blocks and cut necessary timber incidental to developing logging roads as may be needed to log other blocks provided that no timber may be removed from an unpaid block until separately scaled and paid for. If payment is provided as specified in this paragraph as security under paragraph (a) and no cutting has taken place on the contract, the county auditor may credit the security provided, less any down payment required for an auction sale under this paragraph, to any other contract issued to the contract holder by the county under this chapter to which the contract holder requests in writing that it be credited, provided the request and transfer is made within the same calendar year as the security was received.\n(c) The county board may sell any timber, including biomass, as appraised or scaled. Any parcels of land from which timber is to be sold by scale of cut products shall be so designated in the published notice of sale under paragraph (a), in which case the notice shall contain a description of the parcels, a statement of the estimated quantity of each species of timber, and the appraised price of each species of timber for 1,000 feet, per cord or per piece, as the case may be. In those cases any bids offered over and above the appraised prices shall be by percentage, the percent bid to be added to the appraised price of each of the different species of timber advertised on the land. The purchaser of timber from the parcels shall pay in cash at the time of sale at the rate bid for all of the timber shown in the notice of sale as estimated to be standing on the land, and in addition shall pay at the same rate for any additional amounts which the final scale shows to have been cut or was available for cutting on the land at the time of sale under the terms of the sale. Where the final scale of cut products shows that less timber was cut or was available for cutting under terms of the sale than was originally paid for, the excess payment shall be refunded from the forfeited tax sale fund upon the claim of the purchaser, to be audited and allowed by the county board as in case of other claims against the county. No timber, except hardwood pulpwood, may be removed from the parcels of land or other designated landings until scaled by a person or persons designated by the county board and approved by the commissioner of natural resources. Landings other than the parcel of land from which timber is cut may be designated for scaling by the county board by written agreement with the purchaser of the timber. The county board may, by written agreement with the purchaser and with a consumer designated by the purchaser when the timber is sold by the county auditor, and with the approval of the commissioner of natural resources, accept the consumer's scale of cut products delivered at the consumer's landing. No timber shall be removed until fully paid for in cash. Small amounts of timber not exceeding 500 cords in appraised volume may be sold for not less than the full appraised value at private sale to individual persons without first publishing notice of sale or calling for bids, provided that in case of a sale involving a total appraised value of more than $200 the sale shall be made subject to final settlement on the basis of a scale of cut products in the manner above provided and not more than two of the sales, directly or indirectly to any individual shall be in effect at one time.\n(d) As directed by the county board, the county auditor may lease tax-forfeited land to individuals, corporations or organized subdivisions of the state at public or private sale, and at the prices and under the terms as the county board may prescribe, for use as cottage and camp sites and for agricultural purposes and for the purpose of taking and removing of hay, stumpage, sand, gravel, clay, rock, marl, and black dirt from the land, and for garden sites and other temporary uses provided that no leases shall be for a period to exceed 25 years; provided, further that any leases involving a consideration of more than $50,000 per year, except to an organized subdivision of the state shall first be offered at public sale in the manner provided herein for sale of timber. Upon the sale of any leased land, it shall remain subject to the lease for not to exceed one year from the beginning of the term of the lease. Any rent paid by the lessee for the portion of the term cut off by the cancellation shall be refunded from the forfeited tax sale fund upon the claim of the lessee, to be audited and allowed by the county board as in case of other claims against the county.\n(e) As directed by the county board, the county auditor may lease tax-forfeited land to individuals, corporations, or organized subdivisions of the state at public or private sale, at the prices and under the terms as the county board may prescribe, for the purpose of taking and removing for use for road construction and other purposes tax-forfeited stockpiled iron-bearing material. The county auditor must determine that the material is needed and suitable for use in the construction or maintenance of a road, tailings basin, settling basin, dike, dam, bank fill, or other works on public or private property, and that the use would be in the best interests of the public. No lease shall exceed ten years. The use of a stockpile for these purposes must first be approved by the commissioner of natural resources. The request shall be deemed approved unless the requesting county is notified to the contrary by the commissioner of natural resources within six months after receipt of a request for approval for use of a stockpile. Once use of a stockpile has been approved, the county may continue to lease it for these purposes until approval is withdrawn by the commissioner of natural resources.\n(f) The county auditor, with the approval of the county board is authorized to grant permits, licenses, and leases to tax-forfeited lands for the depositing of stripping, lean ores, tailings, or waste products from mines or ore milling plants, or to use for facilities needed to recover iron-bearing oxides from tailings basins or stockpiles, or for a buffer area needed for a mining operation, upon the conditions and for the consideration and for the period of time, not exceeding 25 years, as the county board may determine. The permits, licenses, or leases are subject to approval by the commissioner of natural resources.\n(g) Any person who removes any timber from tax-forfeited land before said timber has been scaled and fully paid for as provided in this subdivision is guilty of a misdemeanor.\n(h) The county auditor may, with the approval of the county board, and without first offering at public sale, grant leases, for a term not exceeding 25 years, for the removal of peat and for the production or removal of farm-grown closed-loop biomass as defined in section 216B.2424, subdivision 1, or short-rotation woody crops from tax-forfeited lands upon the terms and conditions as the county board may prescribe. Any lease for the removal of peat, farm-grown closed-loop biomass, or short-rotation woody crops from tax-forfeited lands must first be reviewed and approved by the commissioner of natural resources if the lease covers 320 or more acres. No lease for the removal of peat, farm-grown closed-loop biomass, or short-rotation woody crops shall be made by the county auditor pursuant to this section without first holding a public hearing on the auditor's intention to lease. One printed notice in a legal newspaper in the county at least ten days before the hearing, and posted notice in the courthouse at least 20 days before the hearing shall be given of the hearing.\n(i) Notwithstanding any provision of paragraph (c) to the contrary, the St. Louis County auditor may, at the discretion of the county board, sell timber to the party who bids the highest price for all the several kinds of timber, as provided for sales by the commissioner of natural resources under section 90.14. Bids offered over and above the appraised price need not be applied proportionately to the appraised price of each of the different species of timber.\n(j) In lieu of any payment or deposit required in paragraph (b), as directed by the county board and under terms set by the county board, the county auditor may accept an irrevocable bank letter of credit in the amount equal to the amount otherwise determined in paragraph (b). If an irrevocable bank letter of credit is provided under this paragraph, at the written request of the purchaser, the county may periodically allow the bank letter of credit to be reduced by an amount proportionate to the value of timber that has been harvested and for which the county has received payment. The remaining amount of the bank letter of credit after a reduction under this paragraph must not be less than 20 percent of the value of the timber purchased. If an irrevocable bank letter of credit or cash deposit is provided for the down payment required in paragraph (b), and no cutting of timber has taken place on the contract for which a letter of credit has been provided, the county may allow the transfer of the letter of credit to any other contract issued to the contract holder by the county under this chapter to which the contract holder requests in writing that it be credited.\n(k) As directed by the county board, the county auditor may lease tax-forfeited land under the terms and conditions prescribed by the county board for the purposes of investigating, analyzing, and developing conservation easements that provide ecosystem services.\nThe county auditor may within a period of two years immediately following the date of forfeiture lease tax-forfeited land on which are located structures or buildings without advertising for bids. Notwithstanding subdivision 1, the property may be leased for a period no longer than one year without bids, regardless of the consideration received for the lease. With the approval of the county board, the county auditor may under similar circumstances enter into a management contract without bids when that action is necessary for the operation, use or preservation of the property and the safety of the public.\n(a) Before the sale of a parcel of forfeited land the county auditor may, with the approval of the county board of commissioners, provide for the repair and improvement of any building or structure located upon the parcel, and may provide for maintenance of tax-forfeited lands, if it is determined by the county board that such repairs, improvements, or maintenance are necessary for the operation, use, preservation, and safety of the building or structure.\n(b) If so authorized by the county board, the county auditor may insure the building or structure against loss or damage resulting from fire or windstorm, may purchase workers' compensation insurance to insure the county against claims for injury to the persons employed in the building or structure by the county, and may insure the county, its officers and employees against claims for injuries to persons or property because of the management, use, or operation of the building or structure.\n(c) The county auditor may, with the approval of the county board, provide:\n(1) for the demolition of the building or structure, which has been determined by the county board to be especially liable to fire or so situated as to endanger life or limb or other buildings or property in the vicinity because of age, dilapidated condition, defective chimney, defective electric wiring, any gas connection, heating apparatus, or other defect; and\n(2) for the sale of salvaged materials from the building or structure.\n(d) Notwithstanding any law to the contrary, the county auditor, with the approval of the county board, may provide for the sale or disposal of personal property remaining after the certificate under section 281.23, subdivision 9, has been recorded. The county auditor must make reasonable efforts to provide at least 28 days' notice of the sale or disposal to the former owner, taxpayer, and any occupants at the time of forfeiture. A sale may be made by the sheriff using the procedures for the sale of abandoned property in section 345.15 or by the county auditor using a sale procedure approved by the county board. A county may contract with a third party to assist with removal, disposal, or sale of personal property. The net proceeds from any sale of the personal property, salvaged materials, timber or other products, or leases made under this law must be deposited in the forfeited tax sale fund and must be distributed in the same manner as if the parcel had been sold.\n(e) The county auditor, with the approval of the county board, may provide for the demolition of any structure on tax-forfeited lands, if in the opinion of the county board, the county auditor, and the land commissioner, if there is one, the sale of the land with the structure on it, or the continued existence of the structure by reason of age, dilapidated condition or excessive size as compared with nearby structures, will result in a material lessening of net tax capacities of real estate in the vicinity of the tax-forfeited lands, or if the demolition of the structure or structures will aid in disposing of the tax-forfeited property.\n(f) Before the sale of a parcel of forfeited land located in an urban area, the county auditor may with the approval of the county board provide for the grading of the land by filling or the removal of any surplus material from it. If the physical condition of forfeited lands is such that a reasonable grading of the lands is necessary for the protection and preservation of the property of any adjoining owner, the adjoining property owner or owners may apply to the county board to have the grading done. If, after considering the application, the county board believes that the grading will enhance the value of the forfeited lands commensurate with the cost involved, it may approve it, and the work must be performed under the supervision of the county or city engineer, as the case may be, and the expense paid from the forfeited tax sale fund.\nWhere an undivided portion of any parcel of land is forfeited to the state for taxes, the owner or owners of the portions of said parcel not forfeited, or the state of Minnesota, may in the manner provided by sections 558.01 to 558.32, maintain an action for the partition of said parcel making the state or other owners as their interests may appear a defendant in the action. If the state is made a defendant in the action, the summons shall be served upon the auditor of the county in which the land is located, and the county attorney shall appear for the state.\nThe county auditor, when and for such price and on such terms and for such period as the county board prescribes, may grant easements or permits on unsold tax-forfeited land for telephone and electric power lines either by underground cable or conduit or otherwise, sewer and water lines, highways, recreational trails, railroads, and pipe lines for gas, liquids, or solids in suspension. Any such easement or permit may be canceled by resolution of the county board after reasonable notice for any substantial breach of its terms or if at any time its continuance will conflict with public use of the land, or any part thereof, on which it is granted. Land affected by any such easement or permit may be sold or leased for mineral or other legal purpose, but sale or lease shall be subject to the easement or permit, and all rights granted by the easement or permit shall be excepted from the conveyance or lease of the land and be reserved, and may be canceled by the county board in the same manner and for the same reasons as it could have been canceled before sale and in that case the rights granted thereby shall vest in the state in trust as the land on which it was granted was held before sale or lease. Any easement or permit granted before passage of Laws 1951, chapter 203, may be governed thereby if the holder thereof and county board so agree. Reasonable notice as used in this subdivision, means a 90-day written notice addressed to the record owner of the easement at the last known address, and upon cancellation the county board may grant extensions of time to vacate the premises affected.\n(a) A county board may convey a road easement across unsold tax-forfeited land to an individual or a private entity requesting an easement for access to private property owned by the individual or private entity if:\n(1) there are no reasonable alternatives to obtain access to the individual's or private entity's property; and\n(2) exercising the easement will not cause significant adverse environmental or natural resource management impacts.\n(b) The county auditor shall require an individual or a private entity applying for an easement under paragraph (a) to pay the appraised value of the easement. The conveyance must provide that the easement reverts to the state in trust for the taxing district in the event of nonuse.\nThe county auditor, with prior review and consultation with the commissioner of natural resources and under the terms and conditions prescribed by the county board, including reversion in the event of nonuse, may convey conservation easements as defined in section 84C.01 on tax-forfeited land.\nNotwithstanding section 160.02, subdivision 25, a county is not a road authority under section 160.05 with respect to a road constructed, acquired, maintained, or administered by the county for the purpose of managing tax-forfeited lands that have been classified as conservation lands under this chapter.",
	"repealed": false
}