{
	"id": "297I.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.40",
	"title": "297I.40 ESTIMATED TAX.",
	"text": "On or before March 15, June 15, September 15, and December 15 of the current year, every taxpayer subject to tax under section 297I.05, subdivisions 1 to 5, and 12, paragraph (a), clauses (1) to (4), and 14, must pay to the commissioner an installment equal to one-fourth of the insurer's total estimated tax for the current year.\nThe amount of any required installment is one-fourth of the lesser of\n(1) 80 percent of the tax imposed for the current year, or\n(2) 100 percent of the tax paid for the previous year.\nNo addition to tax is imposed if the total tax for the current tax year is $500 or less.\n(a) In case of any underpayment of installments by an insurer, there is added to, and collected as part of, the tax for the taxable year an amount determined at the rate specified in section 270C.40 upon the amount of underpayment.\n(b) The amount of the underpayment is the excess of: (1) the amount of the installment; over (2) the amount, if any, of the installment paid on or before the last date prescribed for payment.\n(c) The period of the underpayment runs from the date the installment was required to be paid to the earlier of:\n(1) March 1 of the year following the close of the taxable year; or\n(2) with respect to any portion of the underpayment, the date on which that portion is paid. For purposes of this clause, a payment of estimated tax on any installment date is considered a payment of any previous underpayment only to the extent the payment exceeds the amount of the installment required to be made on that date.\nThe term \"tax\" as used in this section means the tax imposed by section 297I.05, subdivisions 1 to 5, 11, and 12, paragraphs (a), clauses (1) to (4), (b), and (d), and 14, less any offset in section 297I.20.\nWhen an insurer does not make any payments, the period of the underpayment runs from the three installment dates set forth in subdivision 1 to whichever of the periods in subdivision 4, paragraph (c), is the earlier.\nA taxpayer who claims a refund of an overpayment on an original return may elect to have all or any portion of the overpayment applied as a credit to the March 15 estimated tax payment for the year following the year of the return. The credit is considered applied on March 15. Notwithstanding section 297I.80, the amount credited does not bear interest.",
	"repealed": false
}