{
	"id": "177.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.27",
	"title": "177.27 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "The commissioner may enter during reasonable office hours or upon request and inspect the place of business or employment of any employer of employees working in the state, to examine and inspect books, registers, payrolls, and other records of any employer that in any way relate to wages, hours, and other conditions of employment of any employees. The commissioner may transcribe any or all of the books, registers, payrolls, and other records as the commissioner deems necessary or appropriate and may question the employer, employees, and other persons to ascertain compliance with any of the sections listed in subdivision 4. The commissioner may investigate wage claims or complaints by an employee against an employer if the failure to pay a wage may violate Minnesota law or an order or rule of the department.\n(a) The commissioner may require the employer of employees working in the state to submit to the commissioner photocopies, certified copies, or, if necessary, the originals of records that relate to employment or employment status which the commissioner deems necessary or appropriate. The records which may be required include full and correct statements in writing, including sworn statements by the employer, containing information relating to wages, hours, names, addresses, and any other information pertaining to the employer's employees and the conditions of their employment as the commissioner deems necessary or appropriate.\n(b) Employers and persons requested by the commissioner to produce records shall respond within the time and in the manner specified by the commissioner.\n(c) The commissioner may require the records to be submitted by certified mail delivery or, if necessary, by personal delivery by the employer or a representative of the employer, as authorized by the employer in writing.\n(d) The commissioner may fine the employer up to $10,000 for each failure to submit or deliver records as required by this section. This penalty is in addition to any penalties provided under section 177.32, subdivision 1. In determining the amount of a civil penalty under this subdivision, the appropriateness of such penalty to the size of the employer's business and the gravity of the violation shall be considered.\nIf the records maintained by the employer do not provide sufficient information to determine the exact amount of back wages due an employee, the commissioner may make a determination of wages due based on available evidence.\nThe commissioner may issue an order requiring an employer to comply with sections 177.21 to 177.435, 177.50, 179.86, 181.02, 181.03, 181.031, 181.032, 181.10, 181.101, 181.11, 181.13, 181.14, 181.145, 181.15, 181.165, 181.172, paragraph (a) or (d), 181.214 to 181.217, 181.275, subdivision 2a, 181.635, 181.64, 181.722, 181.723, 181.79, 181.85 to 181.89, 181.939 to 181.943, 181.9445 to 181.9448, 181.987, 181.991, 268B.09, subdivisions 1 to 6, and 268B.14, subdivision 3, with any rule promulgated under section 177.28, 181.213, or 181.215. The commissioner shall issue an order requiring an employer to comply with sections 177.41 to 177.435, 181.165, or 181.987 if the violation is repeated. For purposes of this subdivision only, a violation is repeated if at any time during the two years that preceded the date of violation, the commissioner issued an order to the employer for violation of sections 177.41 to 177.435, 181.165, or 181.987 and the order is final or the commissioner and the employer have entered into a settlement agreement that required the employer to pay back wages that were required by sections 177.41 to 177.435. The department shall serve the order upon the employer or the employer's authorized representative in person or by certified mail at the employer's place of business. An employer who wishes to contest the order must file written notice of objection to the order with the commissioner within 15 calendar days after being served with the order. A contested case proceeding must then be held in accordance with sections 14.57 to 14.69 or 181.165. If, within 15 calendar days after being served with the order, the employer fails to file a written notice of objection with the commissioner, the order becomes a final order of the commissioner. For the purposes of this subdivision, an employer includes a contractor that has assumed a subcontractor's liability within the meaning of section 181.165.\nThe commissioner may bring an action in the district court where an employer resides or where the commissioner maintains an office to enforce or require compliance with orders issued under subdivision 4.\n[Repealed, 1996 c 386 s 13]\nIf an employer is found by the commissioner to have violated a section identified in subdivision 4, or any rule adopted under section 177.28, 181.213, or 181.215, and the commissioner issues an order to comply, the commissioner shall order the employer to cease and desist from engaging in the violative practice and to take such affirmative steps that in the judgment of the commissioner will effectuate the purposes of the section or rule violated. In addition to remedies, damages, and penalties provided for in the violated section, the commissioner shall order the employer to pay to the aggrieved parties back pay, gratuities, and compensatory damages, less any amount actually paid to the aggrieved parties by the employer, and for an additional equal amount as liquidated damages. The commissioner may also order reinstatement and any other appropriate relief to the aggrieved parties. Any employer who is found by the commissioner to have repeatedly or willfully violated a section or sections identified in subdivision 4 shall be subject to an additional civil penalty of up to $10,000 for each violation for each employee. In determining the amount of a civil penalty under this subdivision, the appropriateness of such penalty to the size of the employer's business and the gravity of the violation shall be considered. In addition, the commissioner may order the employer to reimburse the department and the attorney general for all appropriate litigation and hearing costs expended in preparation for and in conducting the contested case proceeding, unless payment of costs would impose extreme financial hardship on the employer. If the employer is able to establish extreme financial hardship, then the commissioner may order the employer to pay a percentage of the total costs that will not cause extreme financial hardship. Costs include but are not limited to the costs of services rendered by the attorney general, private attorneys if engaged by the department, administrative law judges, court reporters, and expert witnesses as well as the cost of transcripts. Interest shall accrue on, and be added to, the unpaid balance of a commissioner's order from the date the order is signed by the commissioner until it is paid, at an annual rate provided in section 549.09, subdivision 1, paragraph (c). The commissioner may establish escrow accounts for purposes of distributing remedies and damages.\nAn employee may bring a civil action seeking redress for a violation or violations of sections 177.21 to 177.44 and 181.165 directly to district court. An employer who pays an employee less than the wages and overtime compensation to which the employee is entitled under sections 177.21 to 177.44 or a contractor that has assumed a subcontractor's liability as required by section 181.165, is liable to the employee for the full amount of the wages, gratuities, and overtime compensation, less any amount the employer or contractor is able to establish was actually paid to the employee and for an additional equal amount as liquidated damages. In addition, in an action under this subdivision the employee may seek damages and other appropriate relief provided by subdivision 7 and otherwise provided by law. An agreement between the employee and the employer to work for less than the applicable wage is not a defense to the action.\nAny action brought under subdivision 8 may be filed in the district court of the county wherein a violation or violations of sections 177.21 to 177.44 or 181.165 are alleged to have been committed, where the respondent resides or has a principal place of business, or any other court of competent jurisdiction. The action may be brought by one or more employees.\nIn any action brought pursuant to subdivision 8, the court shall order an employer who is found to have committed a violation or violations of sections 177.21 to 177.44 or 181.165 to pay to the employee or employees reasonable costs, disbursements, witness fees, and attorney fees.\n(a) The commissioner shall provide an order to comply issued to an employer under subdivision 4 and the resolution of the compliance order made through settlement or other final disposition to:\n(1) a licensing or regulatory authority of one or more state agencies or agencies of a political subdivision to which the employer is subject; and\n(2) a public contracting authority with which the employer is party to a public contract.\n(b) The commissioner shall provide the data set out in the compliance order and the resolution of the compliance order made through settlement or other final disposition to the employer's employees whose interests are affected by the order, including an explanation of how the order was resolved.\n(c) Data provided by the commissioner to a licensing agency, contracting authority, or employee to aid in the law enforcement process under this subdivision is subject to section 13.39.\n(d) For purposes of this subdivision, a licensing agency or contracting authority is subject to chapter 13 and must protect not public data received under this subdivision from unlawful disclosure.",
	"repealed": false
}