{
	"id": "268.047",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.047",
	"title": "268.047 EFFECT ON EMPLOYER OF UNEMPLOYMENT BENEFITS PAID.",
	"text": "Unemployment benefits paid to an applicant, including extended and shared work benefits, will be used in computing the future tax rate of a taxpaying base period employer or charged to the reimbursable account of a base period nonprofit or government employer that has elected to be liable for reimbursements except as provided in subdivisions 2 and 3. The amount of unemployment benefits used in computing the future tax rate of taxpaying employers or charged to the reimbursable account of a nonprofit or government employer that has elected to be liable for reimbursements is the same percentage of the total amount of unemployment benefits paid as the percentage of wage credits from the employer is of the total amount of wage credits from all the applicant's base period employers.\nUnemployment benefits paid will not be used in computing the future tax rate of a taxpaying base period employer or charged to the reimbursable account of a base period nonprofit or government employer that has elected to be liable for reimbursements when:\n(1) the applicant was discharged from the employment because of aggravated employment misconduct as determined under section 268.095. This exception applies only to unemployment benefits paid for periods after the applicant's discharge from employment;\n(2) an applicant's discharge from that employment occurred because a law required removal of the applicant from the position the applicant held;\n(3) the employer provided regularly scheduled part-time employment to the applicant during the applicant's base period and continues to provide the applicant with regularly scheduled part-time employment during the benefit year of at least 90 percent of the part-time employment provided in the base period, and is an involved employer because of the applicant's loss of other employment. This exception terminates effective the first week that the employer fails to meet the benefit year employment requirements. This exception applies to educational institutions without consideration of the period between academic years or terms;\n(4) the employer is a fire department or firefighting corporation or operator of a life-support transportation service, and continues to provide employment for the applicant as a volunteer firefighter or a volunteer ambulance service personnel during the benefit year on the same basis that employment was provided in the base period. This exception terminates effective the first week that the employer fails to meet the benefit year employment requirements;\n(5) the applicant's unemployment from this employer was a direct result of the condemnation of property by a governmental agency, a fire, flood, or act of nature, where 25 percent or more of the employees employed at the affected location, including the applicant, became unemployed as a result. This exception does not apply where the unemployment was a direct result of the intentional act of the employer or a person acting on behalf of the employer;\n(6) the unemployment benefits were paid by another state as a result of the transferring of wage credits under a combined wage arrangement provided for in section 268.131;\n(7) the applicant stopped working because of a labor dispute at the applicant's primary place of employment if the employer was not a party to the labor dispute;\n(8) the unemployment benefits were determined overpaid unemployment benefits subject to section 268.18;\n(9) the applicant was employed as a replacement worker, for a period of six months or longer, for an employee who is in the military reserve and was called for active duty during the time the applicant worked as a replacement, and the applicant was laid off because the employee returned to employment after active duty; or\n(10) the trust fund was reimbursed for the unemployment benefits by the federal government.\nUnemployment benefits paid will not be used in computing the future tax rate of a taxpaying base period employer when:\n(1) the applicant's wage credits from that employer are less than $500;\n(2) the applicant quit the employment, unless it was determined under section 268.095, to have been because of a good reason caused by the employer or because the employer notified the applicant of discharge within 30 calendar days. This exception applies to unemployment benefits paid for periods after the applicant's quitting the employment and, if the applicant is rehired by the employer, continues only until the beginning of the week the applicant is rehired; or\n(3) the employer discharged the applicant from employment because of employment misconduct as determined under section 268.095. This exception applies to unemployment benefits paid for periods after the applicant's discharge from employment and, if the applicant is rehired by the employer, continues only until the beginning of the week the applicant is rehired.\n(a) Regardless of subdivisions 2 and 3, an exception under those subdivisions will be limited according to section 268.101, subdivision 2, paragraph (b).\n(b) Regardless of subdivision 2, clause (8), an exception under that clause does not apply if the overpaid unemployment benefits resulted because the employer or any employee, officer, or agent of the employer:\n(1) failed to respond timely or adequately to a request for information under section 268.101, subdivision 1, paragraph (b); and\n(2) has established a pattern of failing to respond timely or adequately to requests for information under section 268.101, subdivision 1, paragraph (b).\nThe employer must pay the trust fund the amount of the overpaid unemployment benefits that will be used in computing the future tax rate of taxpaying employers or charged to the reimbursable account of a nonprofit or government employer under subdivision 1. The procedure for required payment is under section 268.184, subdivision 1.\nThis paragraph is enacted to conform to the requirements of Public Law 112-40, section 252. A \"pattern\" for purposes of this paragraph is a prior failure to respond to the greater of two requests for information, or two percent of all requests for information in the most recent six months.\n(a) The commissioner must notify each employer at least quarterly by mail or electronic transmission of the unemployment benefits paid each applicant that will be used in computing the future tax rate of a taxpaying employer, or that have been charged to the reimbursable account of a nonprofit or government employer that has elected to be liable for reimbursements.\n(b) A notice under this subdivision is not subject to appeal. The commissioner may at any time upon the commissioner's own motion correct any error that resulted in an incorrect notice under paragraph (a) and issue a corrected notice.",
	"repealed": false
}