{
	"id": "28A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.04",
	"title": "28A.04 LICENSE REQUIRED; CUSTOM PROCESSING PERMIT APPLICATIONS; RENEWALS.",
	"text": "(a) No person shall engage in the business of manufacturing, processing, selling, handling, or storing food without having first obtained from the commissioner a license for doing such business. Applications for such license shall be made to the commissioner in such manner and time as required and upon such forms as provided by the commissioner and shall contain the name and address of the applicant, address or description of each place of business, and the nature of the business to be conducted at each place, and such other pertinent information as the commissioner may require.\n(b) A retail or wholesale food handler license shall be issued for the period July 1 to June 30 following and shall be renewed thereafter by the licensee on or before July 1 each year, except that:\n(1) licenses for all mobile food concession units and retail mobile units must be issued for the period April 1 to March 31, and must be renewed thereafter by the licensee on or before April 1 each year; and\n(2) a license issued for a temporary food concession stand must have a license issuance and renewal date consistent with appropriate statutory provisions.\n(c) A custom exempt food handler license shall be issued for the period July 1 to June 30 following and shall be renewed thereafter by the licensee on or before July 1 each year. The custom exempt food handler license is for businesses that only conduct custom exempt operations and mark all products as \"Not For Sale.\" Food handlers that conduct retail exempt operations or other operations other than custom exempt processing or slaughter are not eligible for this license.\n(d) A license for a food broker or for a food processor or manufacturer shall be issued for the period January 1 to December 31 following and shall be renewed thereafter by the licensee on or before January 1 of each year, except that a license for a wholesale food processor or manufacturer operating only at the state fair shall be issued for the period July 1 to June 30 following and shall be renewed thereafter by the licensee on or before July 1 of each year. A penalty for a late renewal shall be assessed in accordance with section 28A.08.\n(e) A person applying for a new license up to 14 calendar days before the effective date of the new license period under paragraph (b) must be issued a license for the 14 days and the next license year as a single license and pay a single license fee as if the 14 days were part of the upcoming license period.\nIn addition to the license requirements set forth in subdivision 1, every custom processor shall obtain a custom processing permit. Application for a permit shall be made on forms provided by the commissioner. The commissioner shall cause the custom processor's place of business to be inspected and if the commissioner finds that the applicant's place of business complies with state standards relating to meat processing plants, a custom processing permit shall be issued to the applicant. No additional fee shall be charged for a custom processing permit.",
	"repealed": false
}