{
	"id": "179A.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.041",
	"title": "179A.041 PUBLIC EMPLOYMENT RELATIONS BOARD; POWER, AUTHORITY, AND DUTIES.",
	"text": "The Public Employment Relations Board is established with three members. One member shall be an officer or employee of an exclusive representative of public employees and shall be appointed by the governor; one shall be representative of public employers and shall be appointed by the governor; and one shall be representative of the public at large and shall be appointed by the other two members. Public employers and employee organizations representing public employees may submit for consideration names of persons representing their interests. The board shall select one of its members to serve as chair for a term beginning July 1 of each year.\n(a) The appointing authorities shall appoint alternate members to serve in the event of a member having a conflict of interest or being unavailable for a meeting under subdivision 9, as follows:\n(1) one alternate, appointed by the governor, who is an officer or employee of an exclusive representative of public employees, to serve as an alternate to the member appointed by the governor who is an officer or employee of an exclusive representative of public employees. This alternate must not be an officer or employee of the same exclusive representative of public employees as the member for whom the alternate serves;\n(2) one alternate, appointed by the governor, who is a representative of public employers, to serve as an alternate to the member appointed by the governor who is a representative of public employers. This alternate must not represent the same public employer as the member for whom the alternate serves; and\n(3) one alternate, appointed by the member who is an officer or employee of an exclusive representative of public employees and the member who is a representative of public employers, who is not an officer or employee of an exclusive representative of public employees, or a representative of a public employer, to serve as an alternate for the member that represents the public at large.\n(b) Each alternate member shall serve a term that is coterminous with the term of the member for whom the alternate member serves as an alternate.\nThe membership terms, compensation, removal of members, and filling of vacancies for members and alternate members shall be as provided in section 15.0575.\nThe board shall adopt rules governing its procedure and shall hold meetings as prescribed in those rules. The chair shall convene and preside at meetings of the board.\nThe board shall have the powers and authority required for the board to take the actions assigned to the board under section 179A.13.\nIn addition to the other powers and duties given it by law, the board shall hear and decide appeals from:\n(1) recommended decisions and orders relating to an unfair labor practice under section 179A.13; and\n(2) determinations of the commissioner under section 179A.12, subdivision 11.\nThe board shall adopt rules under chapter 14 governing the presentation of issues and the taking of appeals under subdivision 6. All issues and appeals presented to the board shall be determined upon the record of hearing, except that the board may request additional evidence when necessary or helpful.\nThe board may hire investigators, hearing officers, and other employees as necessary to perform its duties, or may enter into contracts to perform any of the board's duties.\nA member must disclose any conflict of interest in a case before the board and shall not take any action or vote in the case. The person designated as the recused member's alternate shall serve in place of the member who has a conflict for all actions and votes on the case, unless the alternate has a conflict of interest. If both a member and the member's alternate have a conflict of interest in a case, the appointing authority will appoint a second alternate member, who meets the same requirements as the alternate member and who has no conflict of interest, to take action and vote in the case. A board member or alternate member has a conflict of interest in a case if the member is employed by, an officer of, a member of the governing body of, or a member of, a party in the case.\nChapter 13D does not apply to a board meeting when the board is:\n(1) deliberating on the merits of an unfair labor practice charge under sections 179.11, 179.12, and 179A.13;\n(2) reviewing a hearing officer's recommended decision and order under section 179A.13; or\n(3) reviewing a commissioner decision on an unfair labor practice under section 179A.12, subdivision 11.",
	"repealed": false
}