{
	"id": "115A.96",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.96",
	"title": "115A.96 HOUSEHOLD HAZARDOUS WASTE; MANAGEMENT.",
	"text": "The following definitions apply to this section:\n(a) \"Household\" means a single detached dwelling unit or a single unit of a multiple dwelling unit and appurtenant structures.\n(b) \"Household hazardous waste\" means waste generated from household activity that exhibits the characteristics of or that is listed as hazardous waste under agency rules, but does not include waste from commercial activities that is generated, stored, or present in a household.\n(c) \"Collection site\" means a permanent or temporary designated location with scheduled hours for collection where individuals may bring household hazardous wastes.\n(d) \"Municipality\" has the meaning given it in section 466.01, subdivision 1.\nThe agency shall establish a statewide program to manage household hazardous wastes. The program must include:\n(1) the establishment and operation of collection sites; and\n(2) the provision of information, education, and technical assistance regarding proper management of household hazardous wastes.\n(a) The agency may establish or operate all or part of the management program or may provide for services by contract or other agreement with public or private entities.\n(b) The agency shall allow these programs to accept up to 100 pounds of waste per year from a hazardous waste generator that generates 220 pounds or less of hazardous waste per month.\nAny person who establishes or operates all or part of a household hazardous waste management program shall manage collected waste in compliance with standards applicable to a hazardous waste generator. If collected waste must be stored for a time exceeding those standards, the entity shall obtain the approval of the commissioner of the agency and shall manage the waste in compliance with applicable standards for the use and management of containers, but no facility permit is required. Waste accepted under subdivision 3, paragraph (b), must be managed in accordance with standards applicable to the waste.\nA person must notify the commissioner of the agency before establishing and operating any part of a household hazardous waste management program.\n(a) Each county shall include in its solid waste management plan required in section 115A.46, or its solid waste master plan required in section 473.803, a household hazardous waste management plan. The plan must at least:\n(1) include a broad based public education component;\n(2) include a strategy for reduction of household hazardous waste; and\n(3) include a strategy for separation of household hazardous waste from mixed municipal solid waste and the collection, storage, and proper management of that waste.\n(b) Each county required to submit its plan to the agency under section 115A.46 shall amend its plan to comply with this subdivision within one year after October 4, 1989.\n(c) Each county in the state shall implement its household hazardous waste management plan by June 30, 1992.\n(d) The agency shall review the plans submitted under this subdivision.\n(a) A municipality, when operating or participating in a household hazardous waste management program pursuant to a contract with the agency under this section or other law, is an employee of the state, certified to be acting within the scope of employment, for purposes of the indemnification provisions of section 3.736, subdivision 9, for claims that arise out of the transportation, management, or disposal of any waste covered by the contract:\n(1) from and after the time the waste permanently leaves the municipality's possession and comes into the possession of the agency's authorized transporter; and\n(2) during the time the waste is transported between the municipality's facilities by the agency's authorized transporter.\n(b) The state is not obligated to defend or indemnify a municipality under this subdivision to the extent of the municipality's liability insurance. The municipality's right to indemnity is not a waiver of the limitations, defenses, and immunities available to either the municipality or the state by law.",
	"repealed": false
}