{
	"id": "126C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.01",
	"title": "126C.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in section 120A.05 have the same meanings. For the purpose of this chapter, the following terms have the meanings given them.\n(a) Except as provided in paragraph (b), \"adjusted net tax capacity\" means the net tax capacity of the taxable property of the district as adjusted by the commissioner of revenue under sections 127A.48 and 273.1325. The adjusted net tax capacity for any given calendar year must be used to compute levy limitations for levies certified in the succeeding calendar year and aid for the school year beginning in the second succeeding calendar year.\n(b) For purposes of the long-term maintenance facilities equalization levy under section 123B.595, subdivision 8, \"adjusted net tax capacity\" means the value described in paragraph (a) reduced by 50 percent of the value of class 2a agricultural land determined under that paragraph before the application of the growth limit under section 127A.48, subdivision 7.\n\"Referendum market value\" means the market value of all taxable property, excluding property classified as class 2, 4c(4), or 4c(12) under section 273.13. The portion of class 2a property consisting of the house, garage, and surrounding one acre of land of an agricultural homestead is included in referendum market value. For the purposes of this subdivision, in the case of class 1a, 1b, or 2a property, \"market value\" means the value prior to the exclusion under section 273.13, subdivision 35. Any class of property, or any portion of a class of property, that is included in the definition of referendum market value and that has a classification rate of less than one percent under section 273.13 shall have a referendum market value equal to its market value times its classification rate, multiplied by 100.\n[Repealed, 1Sp2003 c 9 art 1 s 54]\nA levy \"for use in a particular school year,\" \"attributable to a particular school year,\" or \"recognized as revenue in a particular school year,\" means the levy certified in the calendar year ending in the school year preceding that particular school year, and payable in the calendar year in which that school year begins.\nThe average daily membership of a pupil enrolled on a shared time basis equals the ratio of the total minutes for which the pupil is enrolled and the minimum minutes required during the year for a regularly enrolled public school pupil.\nAid for shared time pupils must equal the formula allowance times the full-time equivalent resident pupil units for shared time pupils. Aid for shared time pupils is in addition to any other aid to which the district is otherwise entitled. Shared time average daily membership may not be used in the computation of pupil units under section 126C.05, subdivision 1, for any purpose other than the computation of shared time aid pursuant to subdivisions 6 to 8 and section 126C.19, subdivisions 1 to 3.\n\"Shared time pupils\" means those pupils who attend public school programs for part of the regular school day and who otherwise fulfill the requirements of section 120A.22 by attendance at a nonpublic school.\n[Repealed, 2015 c 21 art 1 s 110]\n[Repealed, 1Sp2001 c 6 art 1 s 55 subd 1]\n\"Net unreserved general fund balance\" means the sum of the unreserved general fund balance and encumbrances, computed as of June 30 each year.",
	"repealed": false
}