{
	"id": "214.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.103",
	"title": "214.103 HEALTH-RELATED LICENSING BOARDS; COMPLAINT, INVESTIGATION, AND HEARING.",
	"text": "For purposes of this section, \"board\" means \"health-related licensing board\" and does not include the non-health-related licensing boards. Nothing in this section supersedes section 214.10, subdivisions 2a, 3, 8, and 9, as they apply to the health-related licensing boards.\n(a) No more than 14 calendar days after receiving a complaint regarding a licensee, the board shall notify the complainant that the board has received the complaint and shall provide the complainant with the written description of the board's complaint process. The board shall periodically, but no less than every 120 days, notify the complainant of the status of the complaint consistent with section 13.41.\n(b) Except as provided in paragraph (d), no more than 60 calendar days after receiving a complaint regarding a licensee, the board must notify the licensee that the board has received a complaint and inform the licensee of:\n(1) the substance of the complaint;\n(2) the sections of the law that have allegedly been violated;\n(3) the sections of the professional rules that have allegedly been violated; and\n(4) whether an investigation is being conducted.\n(c) The board shall periodically, but no less than every 120 days, notify the licensee of the status of the complaint consistent with section 13.41.\n(d) Paragraphs (b) and (c) do not apply if the board determines that such notice would compromise the board's investigation and that such notice cannot reasonably be accomplished within this time.\n(e) No more than one year after receiving a complaint regarding a licensee, the board must resolve or dismiss the complaint unless the board determines that resolving or dismissing the complaint cannot reasonably be accomplished in this time and is not in the public interest.\n(f) Failure to make notifications or to resolve the complaint within the time established in this subdivision shall not deprive the board of jurisdiction to complete the investigation or to take corrective, disciplinary, or other action against the licensee that is authorized by law. Such a failure by the board shall not be the basis for a licensee's request for the board to dismiss a complaint, and shall not be considered by an administrative law judge, the board, or any reviewing court.\nThe boards shall receive and resolve complaints or other communications, whether oral or written, against regulated persons. Before resolving an oral complaint, the executive director or a board member designated by the board to review complaints shall require the complainant to state the complaint in writing or authorize transcribing the complaint. The executive director or the designated board member shall determine whether the complaint alleges or implies a violation of a statute or rule which the board is empowered to enforce. The executive director or the designated board member may consult with the designee of the attorney general as to a board's jurisdiction over a complaint. If the executive director or the designated board member determines that it is necessary, the executive director may seek additional information to determine whether the complaint is jurisdictional or to clarify the nature of the allegations by obtaining records or other written material, obtaining a handwriting sample from the regulated person, clarifying the alleged facts with the complainant, and requesting a written response from the subject of the complaint. The executive director may authorize a field investigation to clarify the nature of the allegations and the facts that led to the complaint.\nThe executive director shall forward to another governmental agency any complaints received by the board which do not relate to the board's jurisdiction but which relate to matters within the jurisdiction of another governmental agency. The agency shall advise the executive director of the disposition of the complaint. A complaint or other information received by another governmental agency relating to a statute or rule which a board is empowered to enforce must be forwarded to the executive director of the board to be processed in accordance with this section. Governmental agencies shall coordinate and conduct joint investigations of complaints that involve more than one governmental agency.\nThe executive director or the designated board member shall forward a complaint and any additional information to the designee of the attorney general when the executive director or the designated board member determines that a complaint is jurisdictional and:\n(1) requires investigation before the executive director or the designated board member may resolve the complaint;\n(2) that attempts at resolution for disciplinary action or the initiation of a contested case hearing is appropriate;\n(3) that an agreement for corrective action is warranted; or\n(4) that the complaint should be dismissed, consistent with subdivision 8.\n(a) If the executive director or the designated board member determines that investigation is necessary before resolving the complaint, the executive director shall forward the complaint and any additional information to the designee of the attorney general. The designee of the attorney general shall evaluate the communications forwarded and investigate as appropriate.\n(b) The designee of the attorney general may also investigate any other complaint forwarded under subdivision 3 when the designee of the attorney general determines that investigation is necessary.\n(c) In the process of evaluation and investigation, the designee shall consult with or seek the assistance of the executive director or the designated board member. The designee may also consult with or seek the assistance of other qualified persons who are not members of the board who the designee believes will materially aid in the process of evaluation or investigation.\n(d) Upon completion of the investigation, the designee shall forward the investigative report to the executive director with recommendations for further consideration or dismissal.\n(a) At any time after receipt of a complaint, the executive director or the designated board member may attempt to resolve the complaint with the regulated person. The available means for resolution include a conference or any other written or oral communication with the regulated person. A conference may be held for the purposes of investigation, negotiation, education, or conciliation. Neither the executive director nor any member of a board's staff shall be a voting member in any attempts at resolutions which may result in disciplinary or corrective action. The results of attempts at resolution with the regulated person may include a recommendation to the board for disciplinary action, an agreement between the executive director or the designated board member and the regulated person for corrective action, or the dismissal of a complaint. If attempts at resolution are not in the public interest, a contested case hearing may be initiated.\n(1) The designee of the attorney general shall represent the board in all attempts at resolution which the executive director or the designated board member anticipate may result in disciplinary action. A stipulation between the executive director or the designated board member and the regulated person shall be presented to the board for the board's consideration. An approved stipulation and resulting order shall become public data.\n(2) The designee of the attorney general shall represent the board upon the request of the executive director or the designated board member in all attempts at resolution which the executive director or the designated board member anticipate may result in corrective action. Any agreement between the executive director or the designated board member and the regulated person for corrective action shall be in writing and shall be reviewed by the designee of the attorney general prior to its execution. The agreement for corrective action shall provide for dismissal of the complaint upon successful completion by the regulated person of the corrective action.\n(b) Upon receipt of a complaint alleging sexual contact or sexual conduct with a client, the board must forward the complaint to the designee of the attorney general for an investigation. If, after it is investigated, the complaint appears to provide a basis for disciplinary action, the board shall resolve the complaint by disciplinary action or initiate a contested case hearing. Notwithstanding paragraph (a), clause (2), a board may not take corrective action or dismiss a complaint alleging sexual contact or sexual conduct with a client unless, in the opinion of the executive director, the designated board member, and the designee of the attorney general, there is insufficient evidence to justify disciplinary action.\nIf the executive director or the designated board member determines that attempts at resolution of a complaint are not in the public interest, the executive director or the designated board member, after consultation with the designee of the attorney general, and the concurrence of a second board member, may initiate a contested case hearing under chapter 14. The designated board member or any board member who was consulted during the course of an investigation may participate at the contested case hearing. A designated or consulted board member may not deliberate or vote in any proceeding before the board pertaining to the case.\n(a) A complaint may not be dismissed without the concurrence of at least two board members and, upon the request of the complainant, a review by a representative of the attorney general's office. The designee of the attorney general must review before dismissal any complaints which allege any violation of chapter 609, any conduct which would be required to be reported under section 626.557 or chapter 260E, any sexual contact or sexual conduct with a client, any violation of a federal law, any actual or potential inability to practice the regulated profession or occupation by reason of illness, use of alcohol, drugs, chemicals, or any other materials, or as a result of any mental or physical condition, any violation of state medical assistance laws, or any disciplinary action related to credentialing in another jurisdiction or country which was based on the same or related conduct specified in this subdivision.\n(b) The board may reopen a dismissed complaint if the board receives newly discovered information that was not available to the board during the initial investigation of the complaint, or if the board receives a new complaint that indicates a pattern of behavior or conduct.\nA board shall furnish to a person who made a complaint a written description of the board's complaint process, and actions of the board relating to the complaint.\nA board member who has actual bias or a current or former direct financial or professional connection with a regulated person may not vote in board actions relating to the regulated person.",
	"repealed": false
}