{
	"id": "148.706",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.706",
	"title": "148.706 PHYSICAL THERAPIST ASSISTANTS, AIDES, AND STUDENTS.",
	"text": "Every physical therapist who uses the services of a physical therapist assistant or physical therapy aide for the purpose of assisting in the practice of physical therapy is responsible for functions performed by the assistant or aide while engaged in such assistance. The physical therapist shall delegate duties to the physical therapist assistant and assign tasks to the physical therapy aide in accordance with subdivision 2. Physical therapists who instruct student physical therapists and student physical therapist assistants are responsible for the functions performed by the students and shall supervise the students as provided under section 148.65, subdivisions 5 and 6. A licensed physical therapist may supervise no more than two physical therapist assistants at any time.\nThe physical therapist may delegate patient treatment procedures only to a physical therapist assistant who has sufficient didactic and clinical preparation. The physical therapist may not delegate the following activities to the physical therapist assistant or to other supportive personnel: patient evaluation, treatment planning, initial treatment, change of treatment, and initial or final documentation.\nWhen components of a patient's treatment are delegated to a physical therapist assistant, a physical therapist must provide on-site observation of the treatment and documentation of its appropriateness at least every six treatment sessions. The physical therapist is not required to be on site, but must be easily available by telecommunications.\nThe physical therapist must observe the patient's status before and after the treatment administered by a physical therapy aide. The physical therapy aide may perform tasks related to preparation of patient and equipment for treatment, housekeeping, transportation, clerical duties, departmental maintenance, and selected treatment procedures. The tasks must be performed under the direct supervision of a physical therapist who is readily available for advice, instruction, or immediate assistance.",
	"repealed": false
}