{
	"id": "122A.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.77",
	"title": "122A.77 SPECIAL EDUCATION TEACHER PIPELINE PROGRAM.",
	"text": "The commissioner of education must administer a grant program to develop a pipeline of trained, licensed Tier 3 or Tier 4 special education teachers. A school district, charter school, Tribal contract school, or cooperative unit under section 123A.24, subdivision 2, may apply for a grant under this section. An applicant must partner with:\n(1) a Professional Educator Licensing and Standards Board-approved teacher preparation program;\n(2) a Council for the Accreditation of Educator Preparation-accredited teacher preparation program from a private, not-for-profit, institution of higher education; or\n(3) an institution that has an articulated transfer pathway with a board-approved teacher preparation program.\n(a) A grant recipient must use grant funds to support participants who are employed by the grant recipient and demonstrate a willingness to be a special education teacher after completing the program.\n(b) A grant recipient may use grant funds for:\n(1) tuition assistance or stipends for participants;\n(2) supports for participants, including mentoring, licensure test preparation, and technology support; or\n(3) participant recruitment.\n(a) Applicants must apply for a grant under this section in the form and manner specified by the commissioner.\n(b) In awarding grants, the commissioner must prioritize funding for training to allow participants holding a Tier 1 or Tier 2 special education license to obtain a Tier 3 special education license.\n(c) To the extent that there are sufficient applications, the commissioner must, to the extent practicable, award an equal number of grants between applicants in greater Minnesota and applicants in the metropolitan area.\nWithin one year of receiving grant funds, and for each year that a recipient receives grant funds, a grant recipient must report to the commissioner in the form and manner determined by the commissioner the number of participants in the program and how grant funds were used. The commissioner must publish an annual report that identifies the grant recipients and summarizes how grant funds are used.\n(a) An account is established in the special revenue fund known as the special education teacher pipeline program account.\n(b) Funds appropriated for the special education teacher pipeline program under this section must be transferred to the special educator teacher pipeline program account in the special revenue fund.\n(c) Money in the account is annually appropriated to the commissioner for the special education teacher pipeline program under this section. Any returned funds are available to be regranted. Grant recipients may apply to use grant money over a period of up to 60 months.\n(d) Up to $175,000 annually is appropriated to the commissioner for costs associated with administering and monitoring the program under this section.",
	"repealed": false
}