{
	"id": "376.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/376.58",
	"title": "376.58 SUPERVISION.",
	"text": "The county board of any county establishing a county nursing home and facility for supportive services may designate any board under the jurisdiction and control of the county board to supervise the nursing home and facility, and that board shall constitute the nursing home's administrative board for that county.\nWhenever two or more counties, through their county boards, have agreed to maintain a county nursing home and facility for supportive services under section 376.55, the county commissioners of each county shall designate a board from each of the cooperating counties as the county nursing home administrative board. Immediately after their designation as the county nursing home administrative board, the boards of the cooperating counties shall hold a joint meeting and elect a chair, vice-chair and secretary who shall be the executive committee. Each county shall have at least one representative on the executive committee, and where more than three counties participate in establishing a nursing home, the executive committee shall be expanded by one member for each additional county above three so that no county will have less than one member on the executive committee. The first joint meeting of the county boards that have been designated as the county nursing home administrative board shall be called by the chair of the county board of the county in which the county commissioners have agreed to locate the proposed home and facility. The board shall meet annually, and at other times considered necessary. Members of the county nursing home administrative board, and its executive committee, other than members of the county board, shall be paid for each day spent in transacting the business of the board or the committee. Each member, including members of the county board, may be reimbursed for necessary expenses incurred by them in connection with their official duties. Compensation and reimbursement for expenses shall be paid from the county nursing home fund in a manner and amounts agreed upon by the county boards. This subdivision does not prohibit the payment of a per diem to county commissioners under section 375.055, subdivision 1.\nThe county nursing home administrative board may establish, operate and maintain a county nursing home and facility for supportive services under sections 376.55 to 376.60. The county nursing home administrative board may delegate to the executive committee defined in subdivision 2 the authority to supervise the establishment, management and operation of the county nursing home and facility for supportive services, including the approval of expenditures and other business necessary for the efficient operation of the home within the general policies established by the county nursing home administrative board. The county nursing home administrative board may authorize payment of incidental expenses of the nursing home under section 375.16.\nThe county nursing home administrative board, or its executive committee, if delegated to do so, shall approve by a majority vote all expenditure vouchers, and the chair of the board or committee shall then transmit them to the county auditor of the county in which the home and facility are located for payment.\nPreparation of estimates of costs for the operation of the nursing home and the facility for supportive services shall be submitted as required by the administrative board of the nursing home or as called for by the county board. The fiscal year for the nursing home, and the facility for supportive services if it is appropriate, may be the reporting year designated by the commissioner of human services.\nThe county's nursing home administrative board may accept as a trust any gift, donation, or endowment from any source, whether subject to special provisions of the donor or not. The gifts, donations, or endowments shall be credited to the county nursing home fund in the treasury of the county in which the home and facility are located and the county nursing home administrative board shall disburse the principal or income as the donors may have indicated.\nThe administrator of a county nursing home shall have the care and custody of all money belonging to residents as allowed by law and shall keep accurate accounting records of all transactions concerning the money as required by the commissioner of health and the commissioner of human services.",
	"repealed": false
}