{
	"id": "43A.317",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.317",
	"title": "43A.317 MINNESOTA EMPLOYEES INSURANCE PROGRAM.",
	"text": "The legislature finds that the creation of a statewide program to provide employers with the advantages of a large pool for insurance purchasing would advance the welfare of the citizens of the state.\n(a) Scope. For the purposes of this section, the terms defined have the meaning given them.\n(b) Commissioner. \"Commissioner\" means the commissioner of management and budget.\n(c) Eligible employee. \"Eligible employee\" means an employee eligible to participate in the program under the terms described in subdivision 6.\n(d) Eligible employer. \"Eligible employer\" means an employer eligible to participate in the program under the terms described in subdivision 5.\n(e) Eligible individual. \"Eligible individual\" means a person eligible to participate in the program under the terms described in subdivision 6.\n(f) Employee. \"Employee\" means an employee of an eligible employer. \"Employee\" includes a sole proprietor, partner of a partnership, member of a limited liability company, or independent contractor.\n(g) Employer. \"Employer\" means a private person, firm, corporation, partnership, limited liability company, association, or other entity actively engaged in business or public services. \"Employer\" includes both for-profit and nonprofit entities.\n(h) Program. \"Program\" means the Minnesota employees insurance program created by this section.\nAfter consulting with the chairs of the senate Governmental Operations and Veterans Committee and the house of representatives Governmental Operations and Veterans Affairs Policy Committee, the commissioner may determine when the program provided under this section is available. When the commissioner makes the program available, the commissioner shall, consistent with the provisions of this section, administer the program and determine its coverage options, funding and premium arrangements, contractual arrangements, and all other matters necessary to administer the program. The commissioner's contracting authority for the program, including authority for competitive bidding and negotiations, is governed by section 43A.23.\n[Repealed, 2014 c 286 art 1 s 5]\n(a) Procedures. All employers are eligible for coverage through the program subject to the terms of this subdivision. The commissioner shall establish procedures for an employer to apply for coverage through the program.\n(b) Term. The initial term of an employer's coverage may be for up to two years from the effective date of the employer's application. After that, coverage will be automatically renewed for an additional term unless the employer gives notice of withdrawal from the program according to procedures established by the commissioner or the commissioner gives notice to the employer of the discontinuance of the program. The commissioner may establish conditions under which an employer may withdraw from the program prior to the expiration of a term, including by reason of an increase in health coverage premiums of 50 percent or more from one insurance year to the next. An employer that withdraws from the program may not reapply for coverage for a period of time equal to its initial term of coverage.\n(c) Minnesota work force. An employer is not eligible for coverage through the program if five percent or more of its eligible employees work primarily outside Minnesota, except that an employer may apply to the program on behalf of only those employees who work primarily in Minnesota.\n(d) Employee participation; aggregation of groups. An employer is not eligible for coverage through the program unless its application includes all eligible employees who work primarily in Minnesota, except employees who waive coverage as permitted by subdivision 6. Private entities that are eligible to file a combined tax return for purposes of state tax laws are considered a single employer, except as otherwise approved by the commissioner.\n(e) Private employer. A private employer is not eligible for coverage unless it has two or more eligible employees in the state of Minnesota. If an employer has only two eligible employees and one is the spouse, child, sibling, parent, or grandparent of the other, the employer must be a Minnesota-domiciled employer and have paid Social Security or self-employment tax on behalf of both eligible employees.\n(f) Minimum participation. The commissioner must require as a condition of employer eligibility that at least 75 percent of its eligible employees who have not waived coverage participate in the program. The participation level of eligible employees must be determined at the initial offering of coverage and at the renewal date of coverage. For purposes of this section, waiver of coverage includes only waivers due to coverage under another group health benefit plan.\n(g) Employer contribution. The commissioner must require as a condition of employer eligibility that the employer contribute at least 50 percent toward the cost of the premium of the employee and may require that the contribution toward the cost of coverage is structured in a way that promotes price competition among the coverage options available through the program.\n(h) Enrollment cap. The commissioner may limit employer enrollment in the program if necessary to avoid exceeding the program's reserve capacity.\n(a) Procedures. The commissioner shall establish procedures for eligible employees and other eligible individuals to apply for coverage through the program.\n(b) Employees. An employer shall determine when it applies to the program the criteria its employees must meet to be eligible for coverage under its plan. An employer may subsequently change the criteria annually or at other times with approval of the commissioner. The criteria must provide that new employees become eligible for coverage after a probationary period of at least 30 days, but no more than 90 days.\n(c) Other individuals. An employer may elect to cover under its plan:\n(1) the spouse, dependent children to the limiting age as defined in section 62Q.01, subdivision 2a, disabled children to the extent required in sections 62A.14 and 62A.141, and dependent grandchildren to the extent required in sections 62A.042 and 62A.302;\n(2) a retiree who is eligible to receive a pension or annuity from the employer and a covered retiree's spouse, dependent children to the limiting age as defined in section 62Q.01, subdivision 2a, disabled children to the extent required in sections 62A.14 and 62A.141, and dependent grandchildren to the extent required in sections 62A.042 and 62A.302;\n(3) the surviving spouse, dependent children to the limiting age as defined in section 62Q.01, subdivision 2a, disabled children, and dependent grandchildren of a deceased employee or retiree, if the spouse, children, or grandchildren were covered at the time of the death;\n(4) a covered employee who becomes disabled, as provided in sections 62A.147 and 62A.148; or\n(5) any other categories of individuals for whom group coverage is required by state or federal law.\nAn employer shall determine when it applies to the program the criteria individuals in these categories must meet to be eligible for coverage. An employer may subsequently change the criteria annually, or at other times with approval of the commissioner. The criteria for dependent children to the limiting age as defined in section 62Q.01, subdivision 2a, disabled children, and dependent grandchildren may be no more inclusive than the criteria under section 43A.18, subdivision 2. This paragraph shall not be interpreted as relieving the program from compliance with any federal and state continuation of coverage requirements.\n(d) Waiver and late entrance. An eligible individual may waive coverage at the time the employer joins the program or when coverage first becomes available. The commissioner may establish a preexisting condition exclusion of not more than 18 months for late entrants as defined in section 62L.02, subdivision 19.\n(e) Continuation coverage. The program shall provide all continuation coverage required by state and federal law.\nCoverage is available through the program beginning on July 1, 1993. Until an arrangement is in place to provide coverage through a transfer of risk to one or more carriers regulated under chapter 62A, 62C, or 62D, the commissioner shall solicit bids under section 43A.23, from carriers regulated under chapters 62A, 62C, and 62D, to provide coverage of eligible individuals. The commissioner shall provide coverage through contracts with carriers, unless the commissioner receives no reasonable bids from carriers.\n(a) Health coverage. Health coverage is available to all employers in the program. The commissioner shall attempt to establish health coverage options that have strong care management features to control costs and promote quality and shall attempt to make a choice of health coverage options available. Health coverage for a retiree who is eligible for the federal Medicare program must be administered as though the retiree is enrolled in Medicare parts A and B. To the extent feasible as determined by the commissioner and in the best interests of the program, the commissioner shall model coverage after the plan established in section 43A.18, subdivision 2. Health coverage must include at least the benefits required of a carrier regulated under chapter 62A, 62C, or 62D for comparable coverage. Coverage under this paragraph must not be provided as part of the health plans available to state employees.\n(b) Optional coverages. In addition to offering health coverage, the commissioner may arrange to offer dental coverage through the program. Employers with health coverage may choose to offer dental coverage according to the terms established by the commissioner.\n(c) Open enrollment. The program must meet all underwriting requirements of chapter 62L and must provide periodic open enrollments for eligible individuals for those coverages where a choice exists.\n(d) Technical assistance. The commissioner may arrange for technical assistance and referrals for eligible employers in areas such as health promotion and wellness, employee benefits structure, tax planning, and health care analysis services as described in section 62J.2930.\n(a) Payments. Employers enrolled in the program shall pay premiums according to terms established by the commissioner. If an employer fails to make the required payments, the commissioner may cancel coverage and pursue other civil remedies.\n(b) Rating method. The commissioner shall determine the premium rates and rating method for the program. The rating method for eligible small employers must meet or exceed the requirements of chapter 62L. The rating methods must recover in premiums all of the ongoing costs for state administration and for maintenance of a premium stability and claim fluctuation reserve. On June 30, 1999, after paying all necessary and reasonable expenses, the commissioner must apply up to $2,075,000 of any remaining balance in the Minnesota employees' insurance trust fund to repayment of any amounts drawn or expended for this program from the health care access fund.\n(c) Taxes and assessments. To the extent that the program operates as a self-insured group, the premiums paid to the program are not subject to the taxes imposed by chapter 297I, but the program is subject to a Minnesota Comprehensive Health Association assessment under section 62E.11.\n(a) Contents. The Minnesota employees insurance trust fund in the state treasury consists of deposits received from eligible employers and individuals, contractual settlements or rebates relating to the program, investment income or losses, and direct appropriations.\n(b) Appropriation. All money in the fund is appropriated to the commissioner to pay insurance premiums, approved claims, refunds, administrative costs, and other costs necessary to administer the program.\n(c) Reserves. For any coverages for which the program does not contract to transfer full financial responsibility, the commissioner shall establish and maintain reserves:\n(1) for claims in process, incomplete and unreported claims, premiums received but not yet earned, and all other accrued liabilities; and\n(2) to ensure premium stability and the timely payment of claims in the event of adverse claims experience. The reserve for premium stability and claim fluctuations must be established according to the standards of section 62C.09, subdivision 3, except that the reserve may exceed the upper limit under this standard until July 1, 1997.\n(d) Investments. The State Board of Investment shall invest the fund's assets according to section 11A.24. Investment income and losses attributable to the fund must be credited to the fund.\nThe Minnesota employees insurance program is a state program to provide the advantages of a large pool to small employers for purchasing health coverage, other coverages, and related services from insurance companies, health maintenance organizations, and other organizations. The program is not an insurance company. Coverage under this program shall be considered a certificate of insurance or similar evidence of coverage and is subject to all applicable requirements of chapters 60A, 62A, 62C, 62E, 62H, 62L, and 72A, and is subject to regulation by the commissioner of commerce to the extent applicable.\n[Repealed, 1996 c 310 s 1]\nNotwithstanding sections 60K.49 and 72A.07, the program may use, and pay referral fees, commissions, or other compensation to, agents licensed as insurance producers under chapter 60K or licensed under section 62C.17, regardless of whether the agents are appointed to represent the particular health carriers or community integrated service networks that provide the coverage available through the program. When acting under this subdivision, an agent is not an agent of the health carrier or community integrated service network, with respect to that transaction.",
	"repealed": false
}