{
	"id": "241.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.016",
	"title": "241.016 ANNUAL PERFORMANCE REPORT REQUIRED.",
	"text": "(a) The Department of Corrections shall submit a performance report to the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice funding by January 15 of each year. The issuance and content of the report must include the following:\n(1) department strategic mission, goals, and objectives;\n(2) the department-wide per diem, adult facility-specific per diems, and an average per diem, reported in a standard calculated method as outlined in the departmental policies and procedures;\n(3) department annual statistics as outlined in the departmental policies and procedures;\n(4) information about prison-based mental health programs, including, but not limited to, the availability of these programs, participation rates, and completion rates; and\n(5) beginning in 2023, a written aggregate of the state correctional facilities security audit group's recommendations based on each security audit and assessment of a state correctional facility and the commissioner's responses to the recommendations.\n(b) The department shall maintain recidivism rates for adult facilities on an annual basis. In addition, each year the department shall, on an alternating basis, complete a recidivism analysis of adult facilities, juvenile services, and the community services divisions and include a three-year recidivism analysis in the report described in paragraph (a). The recidivism analysis must: (1) assess education programs, vocational programs, treatment programs, including mental health programs, industry, and employment; and (2) assess statewide re-entry policies and funding, including postrelease treatment, education, training, and supervision. In addition, when reporting recidivism for the department's adult and juvenile facilities, the department shall report on the extent to which offenders it has assessed as having substance use disorder commit new offenses, with separate recidivism rates reported for persons completing and not completing the department's treatment programs.\n(c) The department shall maintain annual statistics related to the supervision of extended jurisdiction juveniles and include those statistics in the report described in paragraph (a). The statistics must include:\n(1) the total number and population demographics of individuals under supervision in adult facilities, juvenile facilities, and the community who were convicted as an extended jurisdiction juvenile;\n(2) the number of individuals convicted as an extended jurisdiction juvenile who successfully completed probation in the previous year;\n(3) the number of individuals identified in clause (2) for whom the court terminated jurisdiction before the person became 21 years of age pursuant to section 260B.193, subdivision 5;\n(4) the number of individuals convicted as an extended jurisdiction juvenile whose sentences were executed; and\n(5) the average length of time individuals convicted as an extended jurisdiction juvenile spend on probation.\n[Repealed, 2001 c 210 s 30]",
	"repealed": false
}