{
	"id": "103G.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.315",
	"title": "103G.315 DENYING AND ISSUING PERMITS.",
	"text": "The commissioner may deny issuing permits and issue permits with or without conditions.\nThe commissioner shall make findings of fact on issues necessary for determination of the applications considered. Orders made by the commissioner must be based upon findings of fact made on substantial evidence. The commissioner may have investigations made. The facts disclosed by investigation must be put in evidence at the hearing.\nIf the commissioner concludes that the plans of the applicant are reasonable, practical, and will adequately protect public safety and promote the public welfare, the commissioner shall grant the permit.\nIf they are in issue, the commissioner shall also fix the control levels of public waters accordingly.\nOtherwise the commissioner shall reject the application or may require modification of the plan as the commissioner finds proper to protect the public interest.\n(a) In permit applications, the applicant has the burden of proving that the proposed project is reasonable, practical, and will adequately protect public safety and promote the public welfare.\n(b) In granting a permit, the commissioner may include in it terms and reservations about the amount and manner of the use or appropriation or method of construction or operation of controls as appear reasonably necessary for the safety and welfare of the people of the state.\n(a) The commissioner may include in an order issuing or denying a permit a requirement for the applicant to take an action necessary to restore the public waters or their beds to the condition existing before unlawful activities, if any, were undertaken by the applicant. The restoration may include filling beds unlawfully dredged, removing fill unlawfully placed, or restoring water unlawfully appropriated.\n(b) If a hearing on the application was not held, the applicant may contest the order within 30 days of receiving it and must be given a contested case hearing as prescribed by chapter 14.\nNotice of orders made after hearing must be given by publication of the order once a week for two successive weeks in a legal newspaper in the county where the hearing was held and by mailing or electronically transmitting copies of the order to parties who entered an appearance at the hearing.\nThe commissioner shall make an order within 60 days after the completion of the hearing.\nThe commissioner must impose charges for the excavation of minerals from the beds of public waters, as provided in chapter 93.\n(a) Except as otherwise expressly provided by law, a permit issued by the commissioner under this chapter is subject to:\n(1) cancellation by the commissioner at any time if necessary to protect the public interests;\n(2) further conditions on the term of the permit or its cancellation as the commissioner may prescribe and amend and reissue the permit; and\n(3) applicable law existing before or after the issuance of the permit.\n(b) Permits issued to irrigate agricultural land are subject to this subdivision and are subject to cancellation by the commissioner upon the recommendation of the supervisors of the soil and water conservation district where the land to be irrigated is located.\nExcept for field inspection fees related to monitoring, the commissioner may not issue a permit until all fees required by section 103G.301 relating to the issuance of a permit have been paid. The time limits prescribed by section 103G.305, subdivision 1, do not apply to an application for which the appropriate fee has not been paid. Field inspection fees relating to monitoring of an activity authorized by a permit may be charged and collected as necessary at any time after the issuance of the permit.\n(a) The commissioner shall set the time period within which:\n(1) construction authorized in the permit must be completed; or\n(2) an appropriation or use of water must be made.\n(b) The time must not exceed five years from the date of the permit.\n(c) The time period may be extended by the commissioner after application and for good cause demonstrated by the permittee.\n(a) Permits granted in connection with the mining, transporting, concentration, or shipment of taconite as defined in section 93.20, subdivision 18, and permits granted in connection with the mining, production, or beneficiation of copper, copper-nickel, or nickel, are irrevocable for the term of the permits without the consent of the permittee, except for breach or nonperformance of any condition of the permit by the permittee.\n(b) The commissioner may allow and prescribe in the permit any time the commissioner considers reasonable, notwithstanding the limitations under subdivision 13, limitations of time contained in this section for beginning or completing construction or operations under the permit, or exercising the rights granted under the permit.\n(c) The commissioner may extend the time, for cause shown, upon the application of the permittee.\nThe commissioner shall adopt rules prescribing standards and criteria for issuing and denying water-use permits and public-waters-work permits. The authority to adopt the rules is exempt from the 18-month time limit under section 14.125 and does not expire.",
	"repealed": false
}