{
	"id": "343.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/343.31",
	"title": "343.31 ANIMAL FIGHTS AND POSSESSION OF FIGHTING ANIMALS.",
	"text": "(a) Whoever does any of the following is guilty of a felony:\n(1) promotes, engages in, or is employed in the activity of cockfighting, dogfighting, or violent pitting of one pet or companion animal as defined in section 346.36, subdivision 6, against another of the same or a different kind;\n(2) receives money for the admission of a person to a place used, or about to be used, for that activity;\n(3) willfully permits a person to enter or use for that activity premises of which the permitter is the owner, agent, or occupant; or\n(4) uses, trains, or possesses a dog or other animal for the purpose of participating in, engaging in, or promoting that activity.\n(b) Whoever purchases a ticket of admission or otherwise gains admission to the activity of cockfighting, dogfighting, or violent pitting of one pet or companion animal as defined in section 346.36, subdivision 6, against another of the same or a different kind is guilty of a gross misdemeanor.\n(c) Whoever possesses any device or substance with intent to use or permit the use of the device or substance to enhance an animal's ability to fight is guilty of a gross misdemeanor.\n(d) This subdivision shall not apply to the taking of a wild animal by hunting.\nThere is a rebuttable presumption that a dog has been trained or is being trained to fight if:\n(1) the dog exhibits fresh wounds, scarring, or other indications that the dog has been or will be used for fighting; and\n(2) the person possesses training apparatus, paraphernalia, or drugs known to be used to prepare dogs to be fought.\nThis presumption may be rebutted by a preponderance of the evidence.\nThere is a rebuttable presumption that a bird has been trained or is being trained to fight if:\n(1) the bird exhibits fresh wounds, scarring, or other indications that the bird has been or will be used for fighting; or\n(2) the person possesses training apparatus, paraphernalia, or drugs known to be used to prepare birds to be fought.\nThis presumption may be rebutted by a preponderance of the evidence.\nAnimals described in subdivisions 2 and 3 are dangerous weapons and constitute an immediate danger to the safety of humans. A peace officer or animal control authority may remove, shelter, and care for an animal found in the circumstances described in subdivision 2 or 3. If necessary, a peace officer or animal control authority may deliver the animal to another person to be sheltered and cared for. In all cases, the peace officer or animal control authority must immediately notify the owner, if known, as provided in subdivision 5. The peace officer, animal control authority, or other person assuming care of the animal shall have a lien on it for the actual cost of care and keeping of the animal. If the owner or custodian is unknown and cannot by reasonable effort be ascertained, or does not, within ten days after notice, redeem the animal by paying the expenses authorized by this subdivision, the animal may be disposed of as provided in subdivision 5.\n(a) An animal taken into custody under subdivision 4 may be humanely disposed of at the discretion of the jurisdiction having custody of the animal ten days after the animal is taken into custody, if the procedures in paragraph (c) are followed.\n(b) The owner of an animal taken into custody under subdivision 4 may prevent disposition of the animal by posting security in an amount sufficient to provide for the actual costs of care and keeping of the animal. The security must be posted within ten days of the seizure inclusive of the date of the seizure. If, however, a hearing is scheduled within ten days of the seizure, the security amount must be posted prior to the hearing.\n(c)(1) The authority taking custody of an animal under subdivision 4 must give notice of this section by delivering or mailing it to the owner of the animal, posting a copy of it at the place where the animal is taken into custody, or delivering it to a person residing on the property and telephoning, if possible. The notice must include:\n(i) a description of the animal seized; the authority and purpose for the seizure; the time, place, and circumstances under which the animal was seized; and the location, address, and telephone number of a contact person who knows where the animal is kept;\n(ii) a statement that the owner of the animal may post security to prevent disposition of the animal and may request a hearing concerning the seizure and impoundment and that failure to do so within ten days of the date of the notice will result in disposition of the animal; and\n(iii) a statement that all actual costs of the care, keeping, and disposal of the animal are the responsibility of the owner of the animal, except to the extent that a court or hearing officer finds that the seizure or impoundment was not substantially justified by law. The notice must also include a form that can be used by a person claiming an interest in the animal for requesting a hearing.\n(2) The owner may request a hearing within ten days of the date of the seizure. If requested, a hearing must be held within five business days of the request to determine the validity of the impoundment. The municipality taking custody of the animal or the municipality from which the animal was seized may either (i) authorize a licensed veterinarian with no financial interest in the matter or professional association with either party, or (ii) use the services of a hearing officer to conduct the hearing. An owner may appeal the hearing officer's decision to the district court within five days of the notice of the decision.\n(3) The judge or hearing officer may authorize the return of the animal if the judge or hearing officer finds that (i) the animal is physically fit, (ii) the person claiming an interest in the animal can and will provide the care required by law for the animal, and (iii) the animal has not been used for violent pitting or fighting.\n(4) The person claiming an interest in the animal is liable for all actual costs of care, keeping, and disposal of the animal, except to the extent that a court or hearing officer finds that the seizure or impoundment was not substantially justified by law. The costs must be paid in full or a mutually satisfactory arrangement for payment must be made between the municipality and the person claiming an interest in the animal before the return of the animal to the person.\n(a) Photographs of animals seized during an investigation are competent evidence if the photographs are admissible into evidence under all the rules of law governing the admissibility of photographs into evidence. A satisfactorily identified photographic record is as admissible in evidence as the animal itself.\n(b) A photograph must be accompanied by a written description of the animals seized, the name of the owner of the animals seized, the date of the photograph, and the name, address, organization, and signature of the photographer.\n(a) A report completed by a Minnesota licensed veterinarian following an examination of an animal seized during an investigation is competent evidence. A satisfactorily identified veterinary investigative report is as admissible in evidence as the animal itself.\n(b) The veterinary investigative report may contain a written description of the animal seized, the medical evaluation of the physical findings, the prognosis for recovery, and the date of the examination and must contain the name, address, veterinary clinic, and signature of the veterinarian performing the examination.",
	"repealed": false
}