{
	"id": "237.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.09",
	"title": "237.09 DISCRIMINATION PROHIBITED.",
	"text": "No telephone company, or any agent or officer thereof, shall, directly or indirectly, in any manner, knowingly or willfully, charge, demand, collect, or receive from any person, firm, or corporation, a greater or less compensation for any intrastate service rendered or to be rendered by it than it charges, demands, collects, or receives from any other firm, person, or corporation for a like and contemporaneous intrastate service under similar circumstances.\n(a) A telephone company that offers or provides a service or services, service elements, features, or functionalities on a separate, stand-alone basis to any customer shall provide that service, service element, feature, or functionality pursuant to tariff to all similarly situated persons, including all telecommunications carriers and competitors. To the extent prohibited by the Federal Communications Commission or Public Utilities Commission, a telephone company shall not give preference or discriminate in providing services, products, or facilities to an affiliate or to its own or an affiliate's retail department that sells to consumers.\n(b) For purposes of establishing an appropriate rate or price floor for a rate for a telephone service, a telephone company shall impute, on a service-by-service basis, into the rate or price for that service, the tariffed rate or price for the same services, service elements, or network functions that the company provides to others who use it to provide a service that competes with the telephone service offered by the company. A company is not required to impute a rate or price under this paragraph if it demonstrates to the commission, in an expedited proceeding under section 237.61, that:\n(1) the competitor can obtain substantially equivalent services, service elements, or network functions within the relevant market or geographic area on reasonably comparable terms and conditions through self-provision or from a provider other than the telephone company; or\n(2) application of the imputation requirement otherwise would be inconsistent with the public interest.",
	"repealed": false
}