{
	"id": "609.1056",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.1056",
	"title": "609.1056 MILITARY VETERANS; CRIMES COMMITTED BECAUSE OF CONDITIONS RESULTING FROM SERVICE; DISCHARGE AND DISMISSAL.",
	"text": "As used in this section, the following terms have the meanings given:\n(1) \"applicable condition\" means sexual trauma, traumatic brain injury, posttraumatic stress disorder, substance abuse, or a mental health condition;\n(2) \"eligible offense\" means any misdemeanor or gross misdemeanor, and any felony that is ranked at severity level 7 or lower or D7 or lower on the Sentencing Guidelines grid; and\n(3) \"veterans treatment court program\" means a program that has the following essential characteristics:\n(i) the integration of services in the processing of cases in the judicial system;\n(ii) the use of a nonadversarial approach involving prosecutors and defense attorneys to promote public safety and to protect the due process rights of program participants;\n(iii) early identification and prompt placement of eligible participants in the program;\n(iv) access to a continuum of alcohol, controlled substance, mental health, and other related treatment and rehabilitative services;\n(v) careful monitoring of treatment and services provided to program participants;\n(vi) a coordinated strategy to govern program responses to participants' compliance;\n(vii) ongoing judicial interaction with program participants;\n(viii) monitoring and evaluation of program goals and effectiveness;\n(ix) continuing interdisciplinary education to promote effective program planning, implementation, and operations;\n(x) development of partnerships with public agencies and community organizations, including the United States Department of Veterans Affairs; and\n(xi) inclusion of a participant's family members who agree to be involved in the treatment and services provided to the participant under the program.\n(a) At any time before sentencing, a defendant who was, or currently is, a member of the United States military and who is charged with an eligible offense may request that the court determine whether the defendant is eligible for deferred prosecution under this section.\n(b) Upon making a request for an eligibility assessment, the defendant shall release or authorize access to military service reports and records relating to an alleged applicable condition stemming from service in the United States military. The court must file the records as confidential, and the records must remain sealed, except as provided in this paragraph. The defendant, through existing records or licensed professional evaluation, shall establish the diagnosis of the applicable condition and the condition's connection to military service. The court, on its motion or the prosecutor's motion with notice to defense counsel, may order the defendant to furnish to the court for in-camera review or to the prosecutor copies of all medical and military service reports and records previously or subsequently made concerning the defendant's condition and its connection to service.\n(c) The defendant is eligible for deferred prosecution under this section if the court determines by clear and convincing evidence that:\n(1) the defendant suffers from an applicable condition;\n(2) the condition stems from service in the United States military; and\n(3) the offense was committed as a result of the applicable condition.\n(d) If the defendant requests an eligibility assessment before a finding of guilty after trial or entry of a guilty plea, the court may make the finding required under paragraph (c), clause (3), based on the information in a citation or complaint and any accompanying police reports.\n(e) Within 15 days of the court's findings, either party may file a challenge and demand a hearing on the defendant's eligibility for deferred prosecution.\n(a) If the court finds a defendant eligible for deferred prosecution pursuant to subdivision 1a and the defendant is found guilty, after trial or upon a plea of guilty, the court shall defer prosecution as provided in this subdivision.\n(b) Except as provided in paragraph (c), the court shall, without entering a judgment of guilty, defer further proceedings and place a defendant who is eligible for deferred prosecution on probation upon such reasonable conditions as it may require and for a period not to exceed the maximum period provided by law. A court may extend a defendant's term of probation pursuant to section 609.135, subdivision 2, paragraphs (g) and (h). Conditions ordered by the court must include treatment, services, rehabilitation, and education sufficient so that if completed, the defendant would be eligible for discharge and dismissal under subdivision 3. If the court determines that a defendant suffers from a substance use disorder, the court shall order a Rule 25 assessment under Minnesota Rules, part 9530.6615, and order the defendant to follow the recommendations contained in the assessment. If the court determines that a defendant suffers from posttraumatic stress disorder, sexual trauma, traumatic brain injury, or other mental health conditions, the court shall order a mental health assessment conducted by a licensed mental health professional and follow the recommendations contained in the examiner's report.\n(c) If the court determines that the defendant is eligible for a deferred sentence but the defendant has previously received a deferred sentence for a felony offense under this subdivision, the court may, but is not required to, impose a deferred sentence. If the court does not impose a deferred sentence, the court may sentence the defendant as otherwise provided in law, including as provided in subdivision 4.\n(d) Upon violation of a condition of probation, the court may enter an adjudication of guilt and proceed as otherwise provided in law, including as provided in subdivision 4.\n(e) As a condition of probation, the court may order the defendant to attend a local, state, federal, or private nonprofit treatment program for a period not to exceed the maximum period for which the defendant could have been incarcerated.\n(f) The court, when issuing an order under this subdivision that a defendant attend an established treatment program, shall give preference to a treatment program that has a history of successfully treating veterans who suffer from applicable conditions caused by military service, including but not limited to programs operated by the United States Department of Defense or Veterans Affairs.\n(g) The court and any assigned treatment program shall collaborate with, when available, the county veterans service officer and the United States Department of Veterans Affairs to maximize benefits and services provided to the defendant. If an appropriate treatment provider is not available in the defendant's county of residence or public funding is not available, the Minnesota Department of Veterans Affairs shall coordinate with the United States Department of Veterans Affairs to locate an appropriate treatment program and sources to fund the cost of the defendant's participation in the program.\n(h) If available in the county or judicial district having jurisdiction over the case, the defendant may be supervised by a veterans treatment court program under subdivision 5. If there is a veterans treatment court that meets the requirements of subdivision 5 in the county in which the defendant resides or works, supervision of the defendant may be transferred to that county or judicial district veterans treatment court program. Upon the defendant's successful or unsuccessful completion of the program, the veterans treatment court program shall communicate this information to the court of original jurisdiction for further action.\n(i) Sentencing pursuant to this subdivision waives any right to administrative review pursuant to section 169A.53, subdivision 1, or judicial review pursuant to section 169A.53, subdivision 2, for a license revocation or cancellation imposed pursuant to section 169A.52, and also waives any right to administrative review pursuant to section 171.177, subdivision 10, or judicial review pursuant to section 171.177, subdivision 11, for a license revocation or cancellation imposed pursuant to section 171.177, if that license revocation or cancellation is the result of the same incident for which the defendant is being sentenced.\n(a) Upon the expiration of the period of the defendant's probation, the court shall hold a hearing to discharge the defendant from probation and determine whether to dismiss the proceedings against a defendant who received a deferred sentence under subdivision 2. The hearing shall be scheduled so that the parties have adequate time to prepare and present arguments regarding the issue of dismissal. The parties may submit written arguments to the court prior to the date of the hearing and may make oral arguments before the court at the hearing. The defendant must be present at the hearing unless excused under Minnesota Rules of Criminal Procedure, rule 26.03, subdivision 1, clause (3).\n(b) The court shall provide notice to any identifiable victim of the offense at least 15 days before the hearing is held. Notice to victims of the offense under this subdivision must specifically inform the victim of the right to submit an oral or written statement to the court at the time of the hearing describing the harm suffered by the victim as a result of the crime and the victim's recommendation on whether dismissal should be granted or denied. The judge shall consider the victim's statement when making a decision. If a victim notifies the prosecutor of an objection to dismissal and is not present at the hearing, the prosecutor shall make the objections known to the court.\n(c) The court shall dismiss proceedings against a defendant if the court finds by clear and convincing evidence that the defendant:\n(1) is in compliance with the conditions of probation;\n(2) has successfully completed court-ordered treatment and services to address the applicable condition caused by military service;\n(3) does not represent a danger to the health or safety of victims or others; and\n(4) has demonstrated significant benefit from court-ordered education, treatment, or rehabilitation to clearly show that a discharge and dismissal under this subdivision is in the interests of justice.\n(d) In determining the interests of justice, the court shall consider, among other factors, all of the following:\n(1) the defendant's completion and degree of participation in education, treatment, and rehabilitation as ordered by the court;\n(2) the defendant's progress in formal education;\n(3) the defendant's development of career potential;\n(4) the defendant's leadership and personal responsibility efforts;\n(5) the defendant's contribution of service in support of the community;\n(6) the level of harm to the community from the offense;\n(7) the level of harm to the victim from the offense with the court's determination of harm guided by the factors for evaluating injury and loss contained in the applicable victim's rights provisions of chapter 611A; and\n(8) the statement of the victim, if any.\n(e) If the court finds that the defendant does not qualify for discharge and dismissal under paragraph (c), the court shall enter an adjudication of guilt and proceed as otherwise provided in law, including as provided in subdivision 4.\n(f) Discharge and dismissal under this subdivision shall be without court adjudication of guilt, but a not public record of the discharge and dismissal shall be retained by the Bureau of Criminal Apprehension for the purpose of use by the courts in determining the merits of subsequent proceedings against the defendant. The not public record may also be opened only upon court order for purposes of a criminal investigation, prosecution, or sentencing. Upon request by law enforcement, prosecution, or corrections authorities, the bureau shall notify the requesting party of the existence of the not public record and the right to seek a court order to open the not public record under this paragraph. The court shall forward a record of any discharge and dismissal under this subdivision to the bureau, which shall make and maintain the not public record of the discharge and dismissal. The discharge and dismissal shall not be deemed a conviction for purposes of disqualifications or disabilities imposed by law upon conviction of a crime or for any other purpose. For purposes of this paragraph, \"not public\" has the meaning given in section 13.02, subdivision 8a.\n(a) If the court imposes a deferred sentence under subdivision 2, paragraph (b), the court shall prepare a deferred sentence report containing the following information:\n(1) the name of the defendant;\n(2) the case number;\n(3) the underlying charge or charges;\n(4) the fact that proceedings have been deferred pursuant to this section;\n(5) the length of the term of probation ordered by the court;\n(6) the conditions of probation; and\n(7) a copy of the sentencing worksheet prepared pursuant to section 609.115, if a worksheet was prepared.\n(b) If the defendant violates a condition of probation and the court enters an adjudication of guilt as described in subdivision 2, paragraph (d), the court shall prepare a violation report containing the following information:\n(1) the name of the defendant;\n(2) the case number;\n(3) whether the violation was a technical violation as defined in section 244.195, subdivision 15, or involved allegation of a subsequent criminal act; and\n(4) the sentence announced by the court.\n(c) The deferred sentence report prepared under paragraph (a), any violation report prepared under paragraph (b), and a record of any discharge and dismissal prepared pursuant to subdivision 3 must be forwarded to the Sentencing Guidelines Commission. By January 15 of each year, the Sentencing Guidelines Commission shall provide a report to the committees and divisions with jurisdiction over public safety finance and policy and veterans and military affairs finance and policy that consists solely of summary data and includes:\n(1) the number of individuals who received a deferred sentence pursuant to subdivision 2, paragraph (b), in the previous year, disaggregated by county;\n(2) the number of individuals who received an adjudication of guilt as described in subdivision 2, paragraph (d), in the previous year, disaggregated by county;\n(3) for the individuals identified in clause (2), the number who committed a technical violation of probation and the number alleged to have committed a subsequent criminal act; and\n(4) the number of proceedings dismissed pursuant to subdivision 3 in the previous year, disaggregated by county.\n(d) The report required under paragraph (c) may be submitted as a section of any other annual report required to be submitted by the Sentencing Guidelines Commission.\n(a) This subdivision applies to defendants who plead or are found guilty of any criminal offense except one for which registration is required under section 243.166, subdivision 1b.\n(b) Prior to sentencing, a defendant described in paragraph (a) may present proof to the court that the defendant has, since the commission of the offense, engaged in rehabilitative efforts consistent with those described in this section. If the court determines that the defendant has engaged in substantial rehabilitative efforts and the defendant establishes by clear and convincing evidence that:\n(1) the defendant suffered from an applicable condition at the time of the offense;\n(2) the applicable condition was caused by service in the United States military; and\n(3) the offense was committed as a result of the applicable condition;\nthe court may determine that the defendant is particularly amenable to probation and order a mitigated durational or dispositional sentencing departure or a waiver of any statutory mandatory minimum sentence applicable to the defendant.\nA county or judicial district may supervise probation under this section through a veterans treatment court using county veterans service officers appointed under sections 197.60 to 197.606, United States Department of Veterans Affairs veterans justice outreach specialists, probation agents, and any other rehabilitative resources available to the court.\nAny county or city may establish and operate a veterans pretrial diversion program for defendants eligible under subdivision 1 without penalty under section 477A.0175. \"Pretrial diversion\" means the decision of a prosecutor to refer a defendant to a diversion program on the condition that the criminal charges against the defendant shall be dismissed after a specified period of time or the case shall not be charged, if the defendant successfully completes the program of treatment recommended by the United States Department of Veterans Affairs or a local, state, federal, or private nonprofit treatment program.\nThis section does not apply to a person charged with an offense for which registration is required under section 243.166, subdivision 1b.",
	"repealed": false
}