{
	"id": "148.6403",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6403",
	"title": "148.6403 LICENSURE; PROTECTED TITLES AND RESTRICTIONS ON USE; EXEMPT PERSONS; SANCTIONS.",
	"text": "A person must not engage in the practice of occupational therapy unless the person is licensed as an occupational therapy practitioner in accordance with sections 148.6401 to 148.6449.\nUse of the phrase \"occupational therapy\" or \"occupational therapist,\" or the initials \"OT\" alone or in combination with any other words or initials to form an occupational title, or to indicate or imply that the person is licensed by the state as an occupational therapist or occupational therapy assistant, is prohibited unless that person is licensed under sections 148.6401 to 148.6449.\nUse of the term \"Minnesota licensed\" in conjunction with titles protected under this section by any person is prohibited unless that person is licensed under sections 148.6401 to 148.6449.\nA person who is licensed in Minnesota and licensed or certified in another state may use the designation \"licensed\" or \"certified\" with a protected title only if the state of licensure or certification is clearly indicated.\nThis section does not apply to:\n(1) a person employed as an occupational therapy practitioner by the government of the United States or any agency of it. However, use of the protected titles under those circumstances is allowed only in connection with performance of official duties for the federal government;\n(2) a student participating in supervised fieldwork or supervised coursework that is necessary to meet the requirements of section 148.6408, subdivision 1, or 148.6410, subdivision 1, if the person is designated by a title which clearly indicates the person's status as a student trainee. Any use of the protected titles under these circumstances is allowed only while the person is performing the duties of the supervised fieldwork or supervised coursework; or\n(3) a person visiting and then leaving the state and performing occupational therapy services while in the state, if the services are performed no more than 30 days in a calendar year as part of a professional activity that is limited in scope and duration and is in association with an occupational therapist licensed under sections 148.6401 to 148.6449, and\n(i) the person is credentialed under the law of another state which has credentialing requirements at least as stringent as the requirements of sections 148.6401 to 148.6449; or\n(ii) the person meets the requirements for certification as an occupational therapist registered (OTR) or a certified occupational therapy assistant (COTA), established by the National Board for Certification in Occupational Therapy.\nA person who practices occupational therapy or holds out as an occupational therapy practitioner by or through the use of any title described in subdivision 2 without prior licensure according to sections 148.6401 to 148.6449 is subject to sanctions or action against continuing the activity according to section 148.6448, chapter 214, or other statutory authority.\nNothing in sections 148.6401 to 148.6449 shall prohibit the practice of any profession or occupation licensed or registered by the state by any person duly licensed or registered to practice the profession or occupation or to perform any act that falls within the scope of practice of the profession or occupation.",
	"repealed": false
}