{
	"id": "16B.2406",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.2406",
	"title": "16B.2406 CAPITOL AREA BUILDING ACCOUNT TO ADDRESS HEALTH, LIFE SAFETY, AND SECURITY NEEDS.",
	"text": "(a) A Capitol Area building account is established in the state treasury. The commissioner of management and budget shall deposit the proceeds from the lease revenue bonds or certificates of participation received under subdivision 2 to the account. Net income from investment of the proceeds, as estimated by the commissioner of management and budget, must be credited to the appropriate accounts in the Capitol Area building account.\n(b) Funds in the Capitol Area building account are appropriated to the commissioner of administration for capital expenditures that address identified critical health, life safety, and security needs of buildings located on the State Capitol complex that were constructed before 1940 and for expenditures to ensure the continued operations of affected tenants while those needs are being addressed. The funds may be used for predesign, design, construction, equipping, and hazardous materials abatement activities related to these authorized uses including but not limited to addressing necessary accessibility, infrastructure, function, and building systems changes. This appropriation may only be used for renovation or rehabilitation of existing buildings in the State Capitol complex and to expand an existing building as part of a renovation or rehabilitation project funded under this section. This appropriation may not be used to demolish an existing building in its entirety.\n(c) Amounts necessary for predesign, design, rent loss, and tenant relocation for projects authorized by this subdivision are appropriated from the general fund to the commissioner of administration. The predesign must include a needs assessment prepared by an independent contractor. To prepare the needs assessment, the contractor must consider the needs of all tenants of the building. The assessment should identify goals to be achieved by the renovation or rehabilitation project and must address needs for health, life safety, security, and function, including space and layout needs for each tenant. The commissioner must not prepare final plans and specifications until the program plan and cost estimates for all elements necessary to complete the project are approved by the affected building's primary tenant. The final plans and specifications must resolve the needs identified in the needs assessment.\n(d) The commissioner of administration may not prepare final plans and specifications for any project authorized by this subdivision until at least 60 days after the commissioner has submitted the results of the needs assessment to the Capitol Area Architectural and Planning Board. Projects authorized by this section are exempt from the design competition requirement of section 15B.10.\n(a) The commissioner of administration may enter into a long-term lease-purchase agreement for a term of up to 25 years for activities authorized by subdivision 1. The commissioner of management and budget may issue by public or private sale lease revenue bonds or certificates of participation associated with the lease-purchase agreement. The lease-purchase agreements must not be terminated except for nonappropriation of money. The lease-purchase agreements must provide the state with a unilateral right to purchase the leased equipment or premises at specified times for specified amounts. The lease-purchase agreements are exempt from section 16B.24, subdivisions 6 and 6a.\n(b) The amount needed to make lease payments with respect to a lease-purchase agreement entered into under this section is appropriated each fiscal year from the general fund to the commissioner of administration subject to repeal, unallotment under section 16A.152, or cancellation otherwise pursuant to subdivision 4. By January 1 in each odd-numbered year, the commissioner of administration must certify to the chairs and ranking minority members of the committees in the house of representatives and senate with jurisdiction over state government finance the amount of appropriations received by the commissioner under this paragraph during each fiscal year of the fiscal biennium ending June 30 of that year and specify the amount of appropriations anticipated to be received under this paragraph for each year of the fiscal biennium beginning July 1 of that year.\n(c) The commissioner of administration may enter into a ground lease for state-owned property on the State Capitol complex in conjunction with the execution of a lease-purchase agreement entered into under this section for any improvements constructed on that site. Notwithstanding the requirements of section 16A.695, subdivision 2, paragraph (b), the ground lease must be for a term equal to the term of the lease-purchase agreement and must include an option to purchase the land at its then fair market value, if the improvements are not purchased by the state at the end of the term of the lease-purchase agreement or at any earlier time that the lease-purchase agreement is terminated.\n(d) Certificates of participation or lease revenue bonds may be issued in one or more series on the terms and conditions the commissioner of management and budget determines to be in the best interests of the state, shall be dated and bear interest at a fixed or variable rate, may be includable in or excludable from the gross income of the owners for federal income tax purposes, and may be sold at any price or percentage of par value. Any bid received may be rejected.\n(e) At the time of, or in anticipation of, issuing the lease revenue bonds or certificates of participation, and at any time thereafter, so long as the bonds or certificates are outstanding, the commissioner of management and budget may enter into agreements and ancillary arrangements relating to the bonds or certificates, including but not limited to trust indentures, grant agreements, lease or use agreements, operating agreements, management agreements, liquidity facilities, remarketing or dealer agreements, letter of credit agreements, insurance policies, guaranty agreements, reimbursement agreements, indexing agreements, or interest exchange agreements. Any payments made or received according to the agreement or ancillary arrangement shall be made from or deposited as provided in the agreement or ancillary arrangement. The determination of the commissioner of management and budget included in an interest exchange agreement that the agreement relates to a certificate or bond shall be conclusive.\n(f) The commissioner of management and budget may enter into written agreements or contracts relating to the continuing disclosure of information necessary to comply with or facilitate the issuance of the lease-purchase agreement and the related lease revenue bonds or certificates of participation in accordance with federal securities laws, rules, and regulations, including Securities and Exchange Commission rules and regulations in Code of Federal Regulations, title 17, section 240.15c 2-12. An agreement may be in the form of covenants with purchasers and holders of certificates or bonds set forth in the order or resolution authorizing the issuance of the certificates or bonds or in a separate document authorized by the order or resolution.\nA lease-purchase agreement does not constitute or create a general or moral obligation or indebtedness of the state in excess of the money from time to time appropriated or otherwise available for payments or obligations under such agreement. Payments due under a lease-purchase agreement during a current lease term for which money has been appropriated is a current expense of the state. A lease-purchase agreement and the related lease revenue bonds or certificates of participation shall be payable in each fiscal year only from amounts that the legislature may appropriate for debt service for any fiscal year, provided that nothing in this section shall be construed to require the state to appropriate money sufficient to make lease payments with respect to the lease-purchase agreement in any fiscal year. The lease-purchase agreement and the related lease revenue bonds or certificates of participation shall be canceled and shall no longer be outstanding on the earlier of (1) the first day of a fiscal year for which the legislature shall not have appropriated amounts sufficient for lease payments, or (2) the date of final payment of the principal of and interest on the bonds or certificates.\nThe commissioner of administration from time to time may enter into a new lease-purchase agreement and the commissioner of management and budget may issue and sell lease revenue bonds or certificates of participation for the purpose of refunding any lease-purchase agreement and related lease revenue bonds or certificates of participation then outstanding, including the payment of any redemption premiums, any interest accrued or that is to accrue to the redemption date, and costs related to the issuance and sale of such refunding bonds or certificates. The proceeds of any refunding bonds or certificates may, in the discretion of the commissioner of management and budget, be applied to the purchase or payment at maturity of the bonds or certificates to be refunded, to the redemption of outstanding lease-purchase agreements and bonds or certificates on any redemption date, or to pay interest on the refunding lease-purchase agreements and bonds or certificates and may, pending such application, be placed in escrow to be applied to such purchase, payment, retirement, or redemption. Any escrowed proceeds, pending such use, may be invested and reinvested in obligations that are authorized investments under section 11A.24. The income earned or realized on any authorized investment may also be applied to the payment of the lease-purchase agreements and bonds or certificates to be refunded, to interest or premiums on the refunded bonds or certificates, or to pay interest on the refunding lease-purchase agreements and bonds or certificates. After the terms of the escrow have been fully satisfied, any balance of proceeds and any investment income may be returned to the general fund, or, if applicable, the Capitol Area building account, for use in a lawful manner. All refunding lease-purchase agreements and bonds or certificates issued under the provisions of this subdivision must be prepared, executed, delivered, and secured by appropriations in the same manner as the lease-purchase agreements and bonds or certificates to be refunded.\nThe waiver of immunity by the state provided for by section 3.751, subdivision 1, shall be applicable to lease revenue bonds or certificates of participation issued under this section and any ancillary contracts to which the commissioner is a party.\nNotwithstanding section 16B.24, subdivision 5, paragraph (d), the commissioner of administration shall not collect rent to recover bond interest costs or building depreciation costs for any projects funded from the Capitol Area building account.\nMoney collected as rent to fund future building repairs must be credited to a segregated account for each building in the special revenue fund and is appropriated to the commissioner to make the repairs. When the lease revenue bonds are paid in full, the account for that building must be abolished and any balance remaining in the account must be transferred to the appropriate asset preservation and replacement account created under section 16B.24, subdivision 5, paragraph (d).\n(a) Consistent with existing requirements of law related to construction and improvement of state buildings, the commissioner must take steps to ensure improvements to address identified critical needs are completed in a timely manner.\n(b) The commissioner must submit a report to the speaker of the house, the president of the senate, and the minority leaders of the house of representatives and senate no later than January 1, 2022, detailing the estimated costs and the expected timeline for design, construction, and completion of necessary work to address identified needs.\nThe authority to issue lease revenue bonds or certificates of participation under subdivision 2, paragraph (a), expires December 31, 2023.",
	"repealed": false
}