{
	"id": "103E.731",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.731",
	"title": "103E.731 ASSESSMENT; BONDS.",
	"text": "If there is not enough money in the drainage system account to make a repair, the board shall assess the costs of the repairs on all property and entities that have been assessed benefits for the drainage system.\nThe assessments may be paid in annual installments specified in the assessment order. If the assessments are not more than 50 percent of the original cost of the drainage system, the installments may not exceed ten. If the assessments are greater than 50 percent of the original cost of the drainage system, the board may order the assessments to be paid in 15 or less installments.\nIf the order provides for payment in installments, interest on unpaid assessments from the date of the order for assessments must be set by the board in the order. The interest rate may not exceed seven percent per year and must be collected with each installment.\nIf the assessment is not payable in installments, a lien does not need to be filed, and the assessment, plus interest from the date of the order to August 15 of the next calendar year, must be entered on the tax lists for the year. The assessment and interest are due and payable with and as a part of the real estate taxes for the year. If an assessment is levied and payable in installments, the auditor shall file for the record in the county recorder's office an additional tabular statement in substance as provided in section 103E.601, and all the provisions of sections 103E.605, 103E.611, and 103E.615 relating to collection and payment must apply to the assessment. Upon the filing of the tabular statement, the installment and interest are due and payable and must be entered on the tax lists and collected in the same manner as the original lien.\nIf a contract for drainage system repair has been entered into under this chapter or the repair has been ordered to be constructed by hired labor and equipment, and the board has ordered the assessments to be paid in installments, the board may issue and sell bonds, as provided by section 103E.635.\nFor the repair of a drainage system established by the state where benefits were not assessed to the property, the drainage authority shall proceed to appoint viewers to determine the benefits resulting from the repair and collect assessments for the repair as provided in this chapter.",
	"repealed": false
}