{
	"id": "116U.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/116U.24",
	"title": "116U.24 EXPLORE MINNESOTA COUNCILS.",
	"text": "(a) The director shall be advised by the Explore Minnesota Tourism Council and Explore Minnesota for Business Council, each consisting of voting members appointed by the governor for four-year terms. The director of Explore Minnesota serves as the chair or cochair of each council. The director may assign employees of the office to participate in oversight of council operations.\n(b) Each council shall act to serve the broader interests of the council's divisions by promoting activities and programs of the office that support, maintain, and expand the state's domestic and international travel and trade markets, thereby generating increased visitor expenditures, revenue, and employment.\n(c) Filling of membership vacancies is as provided in section 15.059. The terms of one-half of the members shall be coterminous with the governor, and the terms of the remaining one-half of the members shall end on the first Monday in January one year after the terms of the other members. Members may serve until their successors are appointed and qualify. Members are not compensated. A member may be reappointed.\n(d) The council shall meet at least four times per year and at other times determined by each council.\n(e) If compliance with section 13D.02 is impractical, the Explore Minnesota councils may conduct a meeting of their members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of each council participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the council can hear clearly all discussion and testimony and all votes of members of each council and, if needed, receive those services required by sections 15.44 and 15.441;\n(3) at least one member of each council is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(f) Each member of each council participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(g) If telephone or other electronic means is used to conduct a meeting, each council, to the extent practicable, shall allow a person to monitor the meeting electronically from a remote location. Each council may require the person making such a connection to pay for documented marginal costs that each council incurs as a result of the additional connection.\n(h) If telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the council shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and whether a cost will be incurred under paragraph (f). The timing and method of providing notice is governed by section 13D.04.",
	"repealed": false
}