{
	"id": "245I.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.12",
	"title": "245I.12 CLIENT RIGHTS AND PROTECTIONS.",
	"text": "A license holder must ensure that all clients have the following rights:\n(1) the rights listed in the health care bill of rights in section 144.651;\n(2) the right to be free from discrimination based on age, race, color, creed, religion, national origin, sex, gender identity, marital status, disability, sexual orientation, and status with regard to public assistance. The license holder must follow all applicable state and federal laws including the Minnesota Human Rights Act, chapter 363A; and\n(3) the right to be informed prior to a photograph or audio or video recording being made of the client. The client has the right to refuse to allow any recording or photograph of the client that is not for the purposes of identification or supervision by the license holder.\nIf the license holder restricts a client's right, the license holder must document in the client file a mental health professional's approval of the restriction and the reasons for the restriction.\nThe license holder must give a copy of the client's rights according to this section to each client on the day of the client's admission. The license holder must document that the license holder gave a copy of the client's rights to each client on the day of the client's admission according to this section. The license holder must post a copy of the client rights in an area visible or accessible to all clients. The license holder must include the client rights in Minnesota Rules, chapter 9544, for applicable clients.\n(a) The license holder must meet the requirements of section 245A.04, subdivision 13.\n(b) If the license holder is unable to obtain a client's signature acknowledging the receipt or disbursement of the client's funds or property required by section 245A.04, subdivision 13, paragraph (c), clause (1), two staff persons must sign documentation acknowledging that the staff persons witnessed the client's receipt or disbursement of the client's funds or property.\n(c) The license holder must return all of the client's funds and other property to the client except for the following items:\n(1) illicit drugs, drug paraphernalia, and drug containers that are subject to forfeiture under section 609.5316. The license holder must give illicit drugs, drug paraphernalia, and drug containers to a local law enforcement agency or destroy the items; and\n(2) weapons, explosives, and other property that may cause serious harm to the client or others. The license holder may give a client's weapons and explosives to a local law enforcement agency. The license holder must notify the client that a local law enforcement agency has the client's property and that the client has the right to reclaim the property if the client has a legal right to possess the item.\n(d) If a client leaves the license holder's program but abandons the client's funds or property, the license holder must retain and store the client's funds or property, including medications, for a minimum of 30 days after the client's discharge from the program.\n(a) The license holder must have a grievance procedure that:\n(1) describes to clients how the license holder will meet the requirements in this subdivision; and\n(2) contains the current public contact information of the Department of Human Services, Licensing Division; the Office of Ombudsman for Mental Health and Developmental Disabilities; the Department of Health, Office of Health Facilities Complaints; and all applicable health-related licensing boards.\n(b) On the day of each client's admission, the license holder must explain the grievance procedure to the client.\n(c) The license holder must:\n(1) post the grievance procedure in a place visible to clients and provide a copy of the grievance procedure upon request;\n(2) allow clients, former clients, and their authorized representatives to submit a grievance to the license holder;\n(3) within three business days of receiving a client's grievance, acknowledge in writing that the license holder received the client's grievance. If applicable, the license holder must include a notice of the client's separate appeal rights for a managed care organization's reduction, termination, or denial of a covered service;\n(4) within 15 business days of receiving a client's grievance, provide a written final response to the client's grievance containing the license holder's official response to the grievance; and\n(5) allow the client to bring a grievance to the person with the highest level of authority in the program.",
	"repealed": false
}