{
	"id": "452.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/452.25",
	"title": "452.25 JOINT VENTURES BY UTILITIES.",
	"text": "This section applies to all home rule charter and statutory cities, except as provided in Laws 2001, chapter 212, article 2, section 2.\nFor purposes of this section:\n(a) \"City\" means a statutory or home rule charter city, section 410.015 to the contrary notwithstanding.\n(b) \"Cooperative association\" means a cooperative association organized under chapter 308A.\n(c) \"Governing body\" means (1) the city council in a city that operates a municipal utility, or (2) a board, commission, or body empowered by law, city charter, or ordinance or resolution of the city council to control and operate the municipal utility.\n(d) \"Investor-owned utility\" means an entity that provides utility services to the public under chapter 216B and that is owned by private persons.\n(e) \"Municipal power agency\" means an organization created under sections 453.51 to 453.62.\n(f) \"Municipal utility\" means a utility owned, operated, or controlled by a city to provide utility services.\n(g) \"Public utility\" or \"utility\" means a provider of electric or water facilities or services or an entity engaged in other similar or related operations authorized by law or charter.\n(a) Upon the approval of its elected utilities commission or, if there be none, its city council, a municipal utility may enter into a joint venture with other municipal utilities, municipal power agencies, cooperative associations, or investor-owned utilities to provide utility services. Retail electric utility services provided by a joint venture must be within the boundaries of each utility's exclusive electric service territory as shown on the map of service territories maintained by the Department of Commerce. The terms and conditions of the joint venture are subject to ratification by the governing bodies of the respective utilities and may include the formation of a corporate or other separate legal entity with an administrative and governance structure independent of the respective utilities.\n(b) A corporate or other separate legal entity, if formed:\n(1) has the authority and legal capacity and, in the exercise of the joint venture, the powers, privileges, responsibilities, and duties authorized by this section;\n(2) is subject to the laws and rules applicable to the organization, internal governance, and activities of the entity;\n(3) in connection with its property and affairs and in connection with property within its control, may exercise any and all powers that may be exercised by a natural person or a private corporation or other private legal entity in connection with similar property and affairs;\n(4) a joint venture that does not include an investor-owned utility may elect to be deemed a municipal utility or a cooperative association for purposes of chapter 216B or other federal or state law regulating utility operations; and\n(5) for a joint venture that includes an investor-owned utility, the commission has authority over the activities, services, and rates of the joint venture, and may exercise that authority, to the same extent the commission has authority over the activities, services, and rates of the investor-owned utility itself.\n(c) Any corporation, if formed, must comply with section 465.719, subdivisions 9, 10, 11, 12, 13, and 14. The term \"political subdivision,\" as it is used in section 465.719, shall refer to the city council of a city.\nUnless the joint venture's retail electric rates, as defined in section 216B.02, subdivision 5, of a joint venture that does not include an investor-owned utility, are approved by the governing body of each municipal utility or municipal power agency and the board of directors of each cooperative association that is party to the joint venture, the retail electric customers of the joint venture, if their number be more than 25, may elect to become subject to electric rate regulation by the public utilities commission as provided in chapter 216B. The election is subject to and must be carried out according to the procedures in section 216B.026 and, for these purposes, each retail electric customer of the joint venture is deemed a member or stockholder as referred to in section 216B.026.\n(a) A joint venture under this section has the powers, privileges, responsibilities, and duties of the separate utilities entering into the joint venture as the joint venture agreement may provide, including the powers under paragraph (c), except that:\n(1) with respect to retail electric utility services, a joint venture shall not enlarge or extend the service territory served by the joint venture by virtue of the authority granted in sections 216B.44, 216B.45, and 216B.47;\n(2) a joint venture may extend service to an existing connected load of 2,000 kilowatts or more, pursuant to section 216B.42, when the load is outside of the assigned service area of the joint venture, or of the electric utilities party to the joint venture, only if the load is already being served by one of the electric utilities party to the joint venture; and\n(3) a privately owned utility, as defined in section 216B.02, may extend service to an existing connected load of 2,000 kilowatts or more, pursuant to section 216B.42, when the load is located within the assigned service territory of the joint venture, or of the electric utilities party to the joint venture, only if the load is already being served by that privately owned utility.\n(b) The limitations of paragraph (a), clauses (1) to (3), do not apply if written consent to the action is obtained from the electric utility assigned to and serving the affected service territory or connected load.\n(c) Joint venture powers include, but are not limited to, the authority to:\n(1) finance, own, acquire, construct, and operate facilities necessary to provide utility services to retail customers of the joint venture, including generation, transmission, and distribution facilities, and like facilities used in other utility services;\n(2) combine assigned service territories, in whole or in part, upon notice to, hearing by, and approval of the public utilities commission;\n(3) serve customers in the utilities' service territories or in the combined service territory;\n(4) combine, share, or employ administrative, managerial, operational, or other staff if combining or sharing will not degrade safety, reliability, or customer service standards;\n(5) provide for joint administrative functions, such as meter reading and billings;\n(6) purchase or sell utility services at wholesale for resale to customers;\n(7) provide conservation programs, other utility programs, and public interest programs, such as cold weather shutoff protection and conservation spending programs, as required by law and rule; and\n(8) participate as the parties deem necessary in providing utility services with other municipal utilities, cooperative utilities, investor-owned utilities, or other entities, public or private.\n(d) Notwithstanding any contrary provision within this section, a joint venture formed under this section may engage in wholesale utility services unless the municipal utility, municipal power agency, cooperative association, or investor-owned utility party to the joint venture is prohibited under current law from conducting that activity; but, in any case, the joint venture may provide wholesale services to a municipal utility, a cooperative association, or an investor-owned utility that is party to the joint venture.\n(e) This subdivision does not limit the authority of a joint venture to exercise powers of eminent domain for other utility purposes to the same extent as is permitted of those utilities party to the joint venture.\n(a) The powers conferred by this section are in addition to the powers conferred by other law or charter. A joint venture under this section, and a municipal utility with respect to any joint venture under this section, have the powers necessary to effect the intent and purpose of this section, including, but not limited to, the expenditure of public funds and the transfer of real or personal property in accordance with the terms and conditions of the joint venture and the joint venture agreement. This section is complete in itself with respect to the formation and operation of a joint venture under this section and with respect to a municipal utility, a cooperative association, or an investor-owned utility party to a joint venture related to their creation of and dealings with the joint venture, without regard to other laws or city charter provisions that do not specifically address or refer to this section or a joint venture created under this section.\n(b) This section must not be construed to supersede or modify:\n(1) the power of a city council conferred by charter to overrule or override any action of a governing body other than the actions of the joint venture;\n(2) chapter 216B;\n(3) any referendum requirements applicable to the creation of a new electric utility by a municipality under section 216B.46 or 216B.465; or\n(4) any powers, privileges, or authority or any duties or obligations of a municipal utility, municipal power agency, or cooperative association acting as a separate legal entity without reference to a joint venture created under this section.",
	"repealed": false
}