{
	"id": "124E.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.06",
	"title": "124E.06 FORMING A SCHOOL.",
	"text": "(a) An authorizer, after receiving an application from a charter school developer, may charter either a licensed teacher under section 122A.18, subdivision 1, or a group of individuals that includes one or more licensed teachers under section 122A.18, subdivision 1, to operate a school subject to the commissioner's approval of the authorizer's affidavit under subdivision 4.\n(b) \"Application\" under this section means the charter school business plan a charter school developer submits to an authorizer for approval to establish a charter school. This application must include:\n(1) the proposed school's:\n(i) mission and vision statements;\n(ii) purposes and goals;\n(iii) educational program design and how the program will improve student learning, success, and achievement;\n(iv) plan to address the social and emotional learning needs of students and student support services;\n(v) plan to provide special education management and services;\n(vi) plan for staffing the school with appropriately qualified and licensed personnel;\n(vii) financial plan;\n(viii) governance and management structure and plan;\n(ix) market need and demand study; and\n(x) plan for ongoing outreach and dissemination of information about the school's offerings and enrollment procedure to families that reflect the diversity of Minnesota's population and targeted groups under section 124E.17, subdivision 1, paragraph (a);\n(2) the school developer's experience and background, including criminal history and bankruptcy background checks; and\n(3) any other information the authorizer requests.\n(c) An authorizer shall not approve an application submitted by a charter school developer under paragraph (a) if the application does not comply with subdivision 3, paragraph (e), and section 124E.01, subdivision 1. The commissioner shall not approve an affidavit submitted by an authorizer under subdivision 4 if the affidavit does not comply with subdivision 3, paragraph (e), and section 124E.01, subdivision 1.\n(a) The school must be organized and operated as a nonprofit corporation under chapter 317A and the provisions of that chapter shall apply to the school except as provided in this chapter.\nThe operators authorized to organize and operate a school must incorporate as a nonprofit corporation before entering into a contract or other agreement for professional or other services, goods, or facilities.\n(b) Notwithstanding sections 465.717 and 465.719, a school district, subject to this chapter, may create a corporation for the purpose of establishing a charter school.\n(a) The primary focus of a charter school must be to provide a comprehensive program of instruction for at least one grade or age group from ages five through 18 years. A charter school may provide instruction to people older than 18 years of age.\n(b) A charter school may offer a free or fee-based preschool or prekindergarten that meets high-quality early learning instructional program standards aligned with Minnesota's early learning standards for children. The hours a student is enrolled in a fee-based prekindergarten program do not generate pupil units under section 126C.05 and must not be used to calculate general education revenue under section 126C.10.\n(c) A charter school must be nonsectarian in its programs, admission policies, employment practices, and all other operations. An authorizer may not authorize a charter school or program that is affiliated with a nonpublic sectarian school or a religious institution.\n(d) A charter school must not be used to provide education or generate revenue for home-schooled students. This paragraph does not apply to shared time aid under section 126C.19.\n(e) This chapter does not provide a means to keep open a school that a school board decides to close. However, a school board may endorse or authorize establishing a charter school to replace the school the board decided to close. Applicants seeking a charter under this circumstance must demonstrate to the authorizer that the charter sought is substantially different in purpose and program from the school the board closed and that the proposed charter satisfies the requirements of section 124E.01, subdivision 1. If the school board that closed the school authorizes the charter, it must document in its affidavit to the commissioner that the charter is substantially different in program and purpose from the school it closed.\n(f) A school authorized by a school board may be located in any district, unless the school board of the district of the proposed location disapproves the location by written resolution.\n(g) Except as provided in paragraph (b), a charter school may not charge tuition.\n(h) The authorizer may prevent an approved charter school from opening for operation if, among other grounds, the charter school violates this chapter or does not meet the ready-to-open standards that are part of (1) the authorizer's oversight and evaluation process or (2) stipulated in the charter school contract.\n(a) Before an operator may establish and operate a school, the authorizer must file an affidavit with the commissioner stating its intent to charter a school. An authorizer must file a separate affidavit for each school it intends to charter. An authorizer must file an affidavit at least 14 months before July 1 of the year the new charter school plans to serve students. The affidavit must state the terms and conditions under which the authorizer would charter a school, including a market need and demand study.\n(b) The commissioner must approve or disapprove the authorizer's affidavit within 60 business days of receiving the affidavit. If the commissioner disapproves the affidavit, the commissioner shall notify the authorizer of the deficiencies in the affidavit and the authorizer then has 20 business days to address the deficiencies. The commissioner must notify the authorizer of the commissioner's final approval or final disapproval within 15 business days after receiving the authorizer's response to the deficiencies in the affidavit. If the authorizer does not address deficiencies to the commissioner's satisfaction, the commissioner's disapproval is final. An authorizer who fails to obtain the commissioner's approval is precluded from chartering the school that is the subject of this affidavit.\n(c) The grades and number of primary enrollment sites in an approved affidavit may only be modified under subdivision 5.\n(a) A charter school may apply to the authorizer to amend the school charter to add grades or primary enrollment sites beyond those defined in the original affidavit approved by the commissioner. After approving the school's application, the authorizer shall submit a supplemental affidavit in the form and manner prescribed by the commissioner. The authorizer must file a supplemental affidavit to the commissioner by October 1 to be eligible to add grades or sites in the next school year. The supplemental affidavit must document:\n(1) for site expansion, a market need and demand study with long-range enrollment projections;\n(2) for grade expansion, the need for the additional grades with supporting long-range enrollment projections;\n(3) a longitudinal record of at least the three most recent years of student academic proficiency and growth on statewide assessments under chapter 120B or on other academic assessments that measure at least the three most recent years of longitudinal student proficiency and growth approved by the charter school's board of directors and agreed upon with the authorizer;\n(4) at least three years of sound school finances and a plan to add grades or sites that sustains the school's finances; and\n(5) board capacity to administer and manage the additional grades or sites.\n(b) The commissioner shall have 30 business days to review and comment on the supplemental affidavit. The commissioner shall notify the authorizer in writing of any deficiencies in the supplemental affidavit and the authorizer then has 20 business days to address any deficiencies in the supplemental affidavit to the commissioner's satisfaction. The commissioner must notify the authorizer of final approval or final disapproval within 15 business days after receiving the authorizer's response to the deficiencies in the affidavit. The school may not add grades or sites until the commissioner has approved the supplemental affidavit. The commissioner's approval or disapproval of a supplemental affidavit is final.\nA board of an independent or special school district may convert one or more of its existing schools to charter schools under this chapter if 60 percent of the full-time teachers at the school sign a petition seeking conversion. The conversion must occur at the beginning of an academic year.\n(a) Two or more charter schools may merge under chapter 317A. The effective date of a merger must be July 1. The merged school must continue under the identity of one of the merging schools. The authorizer and the merged school must execute a new charter contract under section 124E.10, subdivision 1, by July 1. The authorizer must submit to the commissioner a copy of the new signed charter contract within ten business days of executing the contract.\n(b) Each merging school must submit a separate year-end report for the previous fiscal year for that school only. After the final fiscal year of the premerger schools is closed out, each of those schools must transfer the fund balances and debts to the merged school.\n(c) For its first year of operation, the merged school is eligible to receive aid from programs requiring approved applications equal to the sum of the aid of all of the merging schools. For aids based on prior year data, the merged school is eligible to receive aid for its first year of operation based on the combined data of all of the merging schools.",
	"repealed": false
}