{
	"id": "82B.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.021",
	"title": "82B.021 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Analysis\" means a study of real estate or real property other than estimating value.\n\"Applicant\" means an individual who has applied to the commissioner of commerce pursuant to this chapter for a license as a real estate appraiser.\n\"Appraisal assignment\" means an engagement for which an appraiser is employed or retained to act, or would be perceived by third parties or the public as acting, as a disinterested third party in giving an unbiased analysis, opinion, or conclusion relating to the nature, quality, value, or utility of named interests in, or aspects of, identified real estate.\n\"Appraisal Foundation\" or \"foundation\" means the Appraisal Foundation established on November 30, 1987, as a nonprofit corporation under the laws of Illinois.\n\"Appraisal\" or \"real estate appraisal\" means an analysis, opinion, or conclusion relating to the nature, quality, value, or utility of named interests in, or aspects of, identified real estate for purposes of preparing an appraisal report. An appraisal may be classified by subject matter into either a valuation or an analysis.\n\"Appraisal report\" means an oral or written communication of an appraisal for compensation that is not a contingent fee as defined in section 82B.22 given or signed by a licensed real estate appraiser.\n\"Appraisal Standards Board\" means the independent board of the Appraisal Foundation responsible for promulgation of minimum appraisal standards for federally related transactions.\n\"Appraiser Qualifications Board\" means the independent board of the Appraisal Foundation responsible for promulgation of qualification criteria for licensure of real estate appraisers authorized to conduct appraisals on federally related transactions, and for issuing or endorsing a uniform state real estate appraiser qualification examination.\n[Repealed, 2014 c 286 art 5 s 5]\n\"Certified general real property appraiser\" means an individual licensed under this chapter to perform appraisals on all types of real property.\n\"Certified residential real property appraiser\" means an individual licensed under this chapter to perform appraisals on one-family to four-family residential units or agricultural property regardless of transaction value or complexity.\n\"Commissioner\" means the commissioner of commerce.\n\"Appraisal Subcommittee\" means the appraisal subcommittee of the Federal Financial Institutions Examinations Council under United States Code, title 12, section 3301 et seq.\n\"Evaluation\" means an estimate of the value of real property, made in accordance with the Interagency Appraisal and Evaluation Guidelines provided to an entity regulated by a federal financial institution's regulatory agency, for use in a real estate-related financial transaction for which an appraisal is not required by federal law.\n\"Federal financial institutions regulatory agency\" means the Board of Governors of the Federal Reserve System, Consumer Financial Protection Bureau, the Federal Deposit Insurance Corporation, the Office of the Comptroller of the Currency, or the National Credit Union Administration.\n\"Federally related transaction\" means any real estate related financial transaction that a federal financial institutions regulatory agency or the federal Resolution Trust Corporation engages in, contracts for, or regulates; and that requires the services of a licensed or certified real estate appraiser.\n\"Interagency Appraisal and Evaluation Guidelines\" means the appraisal and evaluation guidelines provided by a federal financial institution's regulatory agency, as provided by Federal Register, volume 75, page 77450 (2010), as amended.\nMS 2018 [Repealed, 1Sp2019 c 7 art 10 s 15]\n\"Licensed real property appraiser\" means an individual licensed under this chapter to perform appraisals on noncomplex one-family to four-family residential units or agricultural property having a transactional value of less than $1,000,000 and complex one-family to four-family residential units or agricultural property having a transactional value of less than $400,000.\n\"Market analysis\" or \"broker price opinion\" means a price opinion prepared by a licensed real estate salesperson, broker, or real estate appraiser in accordance with section 82.735.\n\"Person\" means a natural person, firm, institution, partnership, corporation, or association.\n\"Real estate\" means an identified parcel or tract of land, including improvements, if any.\n\"Real estate appraiser\" or \"real property appraiser\" means a person who develops and communicates appraisals on real property and holds a current, valid license issued under this chapter.\n\"Real estate related financial transaction\" means any transaction involving the sale, lease, purchase, investment in, or exchange of real property, including interests in property, or the financing thereof; the refinancing of real property or interests in real property; and the use of real property or interests in property as security for a loan or investments, including mortgage-backed securities.\n\"Real property\" means one or more defined interests, benefits, and rights inherent in the ownership of real estate.\n\"Residential real property\" or \"residential real estate\" means property occupied by, or intended to be occupied by, one to four families as their residence.\n\"Standards of professional practice\" means the version of the uniform standards of professional appraisal practice of the Appraisal Standards Board of the Appraisal Foundation in effect on the date the appraiser signs the appraisal report.\n\"Trainee real property appraiser\" means an individual licensed under this chapter to perform appraisals on residential real property or agricultural acreage which does not require a net income capitalization analysis under the uniform standards of professional appraisal practice.\n\"Transaction value\" means:\n(1) for loans or other extensions of credit, the amount of the loan or extension of credit;\n(2) for sales, leases, purchases, and investments in or exchanges of real property, the market value of the real property interest involved; and\n(3) for the pooling of loans or interests in real property for resale or purchase, the amount of the loan or market value of the real property calculated with respect to each such loan or interest in real property.\n\"USPAP\" means the Uniform Standards of Professional Appraisal Practice established by the Appraisal Foundation.\n\"Valuation\" means an estimate of value of real estate or real property.",
	"repealed": false
}