{
	"id": "518.167",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.167",
	"title": "518.167 INVESTIGATIONS AND REPORTS.",
	"text": "In contested custody proceedings, and in other custody proceedings if a parent or the child's custodian requests, the court may order an investigation and report concerning custodial arrangements for the child. If the county elects to conduct an investigation, the county may charge a fee. The investigation and report may be made by the county welfare agency or department of court services.\n(a) In preparing a report concerning a child, the investigator may consult any person who may have information about the child and the potential custodial arrangements except for persons involved in mediation efforts between the parties. Mediation personnel may disclose to investigators and evaluators information collected during mediation only if agreed to in writing by all parties. Upon order of the court, the investigator may refer the child to professional personnel for diagnosis. The investigator may consult with and obtain information from medical, psychiatric, school personnel, or other expert persons who have served the child in the past after obtaining the consent of the parents or the child's custodian or guardian.\n(b) The report submitted by the investigator must:\n(1) state the position of each party;\n(2) consider and evaluate the factors in section 518.17, subdivision 1;\n(3) include a detailed analysis of all information considered for each factor;\n(4) state the investigator's recommendation and the reason for the recommendation; and\n(5) reference established means for dispute resolution between the parties.\nThe court shall mail the investigator's report to counsel and to any party not represented by counsel at least ten days before the hearing. The investigator shall maintain and, upon request, make available to counsel and to a party not represented by counsel the investigator's file of underlying data and reports, complete texts of diagnostic reports made to the investigator pursuant to the provisions of subdivision 2, and the names and addresses of all persons whom the investigator has consulted. The investigator and any person the investigator has consulted is subject to other pretrial discovery in accordance with the requirements of the Minnesota Rules of Civil Procedure. Mediation proceedings are not subject to discovery without written consent of both parties. A party to the proceeding may call the investigator and any person whom the investigator has consulted for cross-examination at the hearing. A party may not waive the right of cross-examination before the hearing.\nThe investigator's report may be received in evidence at the hearing.\nThe court shall order all or part of the cost of the investigation and report to be paid by either or both parties, based on their ability to pay. Any part of the cost that the court finds the parties are incapable of paying must be borne by the county welfare agency or department of court services that performs the investigation. The court may not order costs under this subdivision to be paid by a party receiving public assistance or legal assistance from a qualified legal services program or by a party whose annual income falls below the poverty line under United States Code, title 42, section 9902(2).",
	"repealed": false
}