{
	"id": "135A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.30",
	"title": "135A.30 MINNESOTA ACADEMIC EXCELLENCE SCHOLARSHIP.",
	"text": "The Minnesota academic excellence scholarship program is created to reward students who have demonstrated outstanding ability, achievement, and potential in one of the following subjects: English/creative writing, fine arts, foreign language, math, science, or social science.\nTo be eligible to receive a scholarship under this section, a student must:\n(1) graduate from a Minnesota public or nonpublic high school in the academic year in which the scholarship is awarded;\n(2) successfully complete a college preparatory curriculum and demonstrate outstanding ability, achievement, and potential in one of the specified subjects;\n(3) be admitted to enroll full time in a nonsectarian, baccalaureate degree-granting program at the University of Minnesota or at a Minnesota state university, or at a Minnesota private, baccalaureate degree-granting college or university; and\n(4) pursue studies in the subject for which the award is made.\nThe governing board of an eligible institution shall determine, in consultation with its campuses, application dates and procedures, criteria to be considered, and methods of selecting students to receive scholarships. A campus, with the approval of its governing board, may award a scholarship in any field of study.\nThe amount of the scholarship may be (1) at public institutions, up to the cost of tuition and fees for full-time attendance for one academic year, or (2) at private institutions, an amount up to the lesser of the actual tuition and fees charged by the institution or the tuition and fees in comparable public institutions. Scholarships awarded under this section must not be considered in determining a student's financial need as provided in section 136A.101, subdivision 5.\nThe scholarship may be renewed yearly, for up to three additional academic years, if the student:\n(1) maintains full-time enrollment with a grade point average of at least 3.0 on a four point scale;\n(2) pursues studies and continues to demonstrate outstanding ability, achievement, and potential in the field for which the award was made; and\n(3) is achieving satisfactory progress toward a degree.\nThe number of scholarships awarded each year shall be determined by the amount of contributions received under subdivision 8 plus the money available in the scholarship account, as provided in section 168.129, subdivision 6, that is credited to a postsecondary institution or system through sales of its license plates. The number of new awards must be determined after subtracting the actual and projected amount necessary for renewals.\nPostsecondary systems with more than one campus shall allocate at least three-fourths of the revenue available from the sale of license plates to the campuses to which the revenue is attributable. The governing board annually shall determine the distribution of the remaining portion among the campuses, after consideration of special needs or circumstances.\nA postsecondary system or campus may accept contributions, beyond those raised through the sale of license plates, to supplement the campus fund for academic excellence scholarships.",
	"repealed": false
}