{
	"id": "12A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/12A.10",
	"title": "12A.10 HUMAN SERVICES.",
	"text": "As used in this section, \"commissioner\" means the commissioner of human services. Notwithstanding the limitations of section 12A.01 and the requirement in section 12A.03 that all appropriations must be used to assist with recovery, the commissioner may pay parties under contract, provider agreement, or other arrangement with the commissioner as of the date of a natural disaster, or the date when action was taken in anticipation of a possible natural disaster or other event that threatens the health and safety of individuals served by a program that receives funding from medical assistance for the costs of evacuation, transportation, medical, remedial, or personal care services provided to vulnerable residents. Costs eligible for payment under this section are those necessary to ensure the health and safety of medical assistance recipients during and up to 60 days following the disaster. Only costs that are not already paid for by another source are eligible. The commissioner may make payments for documented incremental costs incurred by a party, may determine an estimate of the costs at the sole discretion of the commissioner, or may use a combination of these two methods. If after receiving payment from the commissioner for a documented cost, the provider is able to acquire payment from another source for that cost, the provider shall reimburse the commissioner in the amount paid.\nIn a residential program, the commissioner shall make payment under this section based on an allocation of costs as determined under subdivision 1 between medical assistance recipients and all other residents. The allocation must not be done in a nursing facility. In a nursing facility the commissioner shall pay all of the costs determined under subdivision 1.\nThe commissioner shall pay costs under this section using money appropriated for medical assistance and shall seek federal cost sharing to the extent permitted under the Medicaid state plan or under waivers granted by the federal Centers for Medicare and Medicaid Services.\nIn consultation with the commissioner of human services, the commissioner of health may waive timelines specified in section 144A.071, subdivision 4b, at any time when a partial or complete evacuation occurs in response to a natural disaster, a possible natural disaster, or another event that threatens the health and safety of residents of a nursing home. For a nursing home placing beds in or removing them from layaway under this subdivision, property payment rates must not be adjusted.",
	"repealed": false
}