{
	"id": "354B.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/354B.24",
	"title": "354B.24 SABBATICAL LEAVE.",
	"text": "A person who is a participant in the individual retirement plan, and who goes on an approved sabbatical leave, must remain a participant in the plan for any period during which the person receives a salary from the board or during which the person makes an optional contribution provided for in subdivision 3.\n(a) From the salary paid to the person during the course of an approved sabbatical leave, the employing unit must deduct a member contribution as required under section 354B.23, subdivision 1.\n(b) The employing unit must make the employer contribution on behalf of the plan participant as provided in section 354B.23, subdivision 3.\n(a) In addition to contributions required by subdivision 2, a plan participant on an approved sabbatical leave shall make a member contribution based on the member contribution rate specified in section 354B.23, subdivision 1, applied to the difference between the amount of salary actually received during the sabbatical leave and the full-time salary the member would have received if not on sabbatical leave.\n(b) Any additional member contribution must be made through payroll deduction as though the member were employed full time.\n(c) When an additional member contribution is made, the employing unit must make the employer contribution at the rate specified in section 354B.23, subdivision 3, on the salary that was the basis for the additional member contribution under paragraph (a).\n(d) An employer contribution required under this section must be made no later than 60 days after the date on which the optional additional member contribution was made.\nNotwithstanding the provisions of any sabbatical leave agreements, regular and optional additional member contributions and employer contributions under this section are permissible only if the plan participant retains the right to full reinstatement to an employment position with the applicable employing unit both during and at the conclusion of the sabbatical leave.",
	"repealed": false
}