{
	"id": "609.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.87",
	"title": "609.87 COMPUTER CRIME; DEFINITIONS.",
	"text": "For purposes of sections 609.87 to 609.891 and 609.8912 to 609.8913, the terms defined in this section have the meanings given them.\n\"Access\" means to instruct, communicate with, store data in, or retrieve data from a computer, computer system, or computer network.\n(a) \"Authorization\" means:\n(1) with the permission of the owner of the computer, computer system, computer network, computer software, or other property;\n(2) access by employees of the Department of Commerce acting under the authority and powers granted to the director of the Weights and Measures Division in chapter 239 at any time the device is commercially available for use;\n(3) access by registrants in the voluntary placing in service program and registered liquefied petroleum gas (LPG) meter inspectors acting under the authority and powers granted in Minnesota Rules, chapter 7601, but only at times specified by the device owner or operator or the device owner's or operator's designated representative; or\n(4) access by other people who have the express permission of the device owner or operator or the device owner's or operator's designated representative but only at times as approved by the device owner or operator and only for purposes approved by the device owner or operator.\n(b) Authorization may be limited by the owner by:\n(1) giving the user actual notice orally or in writing;\n(2) posting a written notice in a prominent location adjacent to the computer being used; or\n(3) using a notice displayed on or announced by the computer being used.\n\"Computer\" means an electronic device which performs logical, arithmetic or memory functions by the manipulations of signals, including but not limited to electronic or magnetic impulses.\n\"Computer system\" means related, connected or unconnected, computers and peripheral equipment.\n\"Computer network\" means the interconnection of a communication system with a computer through a remote terminal, or with two or more interconnected computers or computer systems, and includes private and public telecommunications networks.\n\"Property\" includes, but is not limited to, electronically processed or produced data and information contained in a computer or computer software in either machine or human readable form.\n\"Services\" includes but is not limited to, computer time, data processing, and storage functions.\n\"Computer program\" means an instruction or statement or a series of instructions or statements, in a form acceptable to a computer, which directs the functioning of a computer system in a manner designed to provide appropriate products from the computer.\n\"Computer software\" means a computer program or procedures, or associated documentation concerned with the operation of a computer.\n\"Loss\" means the greatest of the following:\n(1) the retail market value of the property or services involved;\n(2) the reasonable repair or replacement cost, whichever is less; or\n(3) the reasonable value of the damage created by the unavailability or lack of utility of the property or services involved until repair or replacement can be effected.\n\"Computer security system\" means a software program or computer device that is intended to protect the confidentiality and secrecy of data and information stored in or accessible through the computer system.\n\"Destructive computer program\" means a computer program that performs a destructive function or produces a destructive product. A program performs a destructive function if it degrades performance of the affected computer, associated peripherals or a computer program; disables the computer, associated peripherals or a computer program; or destroys or alters computer programs or data. A program produces a destructive product if it produces unauthorized data, including data that make computer memory space unavailable; results in the unauthorized alteration of data or computer programs; or produces a destructive computer program, including a self-replicating computer program.\n\"Encryption\" means any protective or disruptive measure, including but not limited to, cryptography, enciphering, or encoding that:\n(1) causes or makes any data, information, image, program, signal, or sound unintelligible or unusable; or\n(2) prevents, impedes, delays, or disrupts access to any data, information, image, program, signal, or sound.\n\"Personal data\" means any computer property or computer program which contains records of the employment, salary, credit, or other financial or personal information relating to another person.\n\"Electronic terminal\" means an electronic device, other than a telephone operated by a consumer, through which an individual or company may initiate an electronic fund transfer. The term includes, but is not limited to, point-of-sale terminals, automated teller machines, cash dispensing machines, and gas pump dispensers.\n\"Access device\" means a card that is used by an individual or company to initiate transactions and is:\n(1) a means of access to an individual's or company's account;\n(2) issued on a prepaid basis to the individual or company in a specific amount; or\n(3) used by the individual or company to access government benefits.\n\"Electronic data\" means records or information in digital form on a computer, computer network, computer system, or in computer software that can be stored, transmitted, or processed.",
	"repealed": false
}