{
	"id": "62K.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/62K.07",
	"title": "62K.07 INFORMATION DISCLOSURES.",
	"text": "(a) A health carrier offering individual or small group health plans must submit the following information in a format determined by the commissioner of commerce:\n(1) claims payment policies and practices;\n(2) periodic financial disclosures;\n(3) data on enrollment;\n(4) data on disenrollment;\n(5) data on the number of claims that are denied;\n(6) data on rating practices;\n(7) information on cost-sharing and payments with respect to out-of-network coverage; and\n(8) other information required by the secretary of the United States Department of Health and Human Services under the Affordable Care Act.\n(b) A health carrier offering an individual or small group health plan must comply with all information disclosure requirements of all applicable state and federal law, including the Affordable Care Act.\n(c) Except for qualified health plans sold on MNsure, information reported under paragraph (a), clauses (3) and (4), is nonpublic data as defined under section 13.02, subdivision 9. Information reported under paragraph (a), clauses (1) through (8), must be reported by MNsure for qualified health plans sold through MNsure.\n(a) Each health carrier that offers a prescription drug benefit in its individual health plans or small group health plans shall include in the applicable rate filing required under section 62A.02 the following information about covered prescription drugs:\n(1) the 25 most frequently prescribed drugs in the previous plan year;\n(2) the 25 most costly prescription drugs as a portion of the individual health plan's or small group health plan's total annual expenditures in the previous plan year;\n(3) the 25 prescription drugs that have caused the greatest increase in total individual health plan or small group health plan spending in the previous plan year;\n(4) the projected impact of the cost of prescription drugs on premium rates;\n(5) if any health plan offered by the health carrier requires enrollees to pay cost-sharing on any covered prescription drugs including deductibles, co-payments, or coinsurance in an amount that is greater than the amount the enrollee's health plan would pay for the drug absent the applicable enrollee cost-sharing and after accounting for any rebate amount; and\n(6) if the health carrier prohibits third-party payments including manufacturer drug discounts or coupons that cover all or a portion of an enrollee's cost-sharing requirements including deductibles, co-payments, or coinsurance from applying toward the enrollee's cost-sharing obligations under the enrollee's health plan.\n(b) The commissioner of commerce, in consultation with the commissioner of health, shall release a summary of the information reported in paragraph (a) at the same time as the information required under section 62A.02, subdivision 2, paragraph (c).\nThe commissioner of commerce shall enforce this section.",
	"repealed": false
}