{
	"id": "62Q.679",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.679",
	"title": "62Q.679 RELIGIOUS OBJECTIONS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Closely held for-profit entity\" means an entity that is not a nonprofit entity, has more than 50 percent of the value of its ownership interest owned directly or indirectly by five or fewer owners, and has no publicly traded ownership interest. For purposes of this paragraph:\n(1) ownership interests owned by a corporation, partnership, limited liability company, estate, trust, or similar entity are considered owned by that entity's shareholders, partners, members, or beneficiaries in proportion to their interest held in the corporation, partnership, limited liability company, estate, trust, or similar entity;\n(2) ownership interests owned by a nonprofit entity are considered owned by a single owner;\n(3) ownership interests owned by all individuals in a family are considered held by a single owner. For purposes of this clause, \"family\" means brothers and sisters, including half-brothers and half-sisters, a spouse, ancestors, and lineal descendants; and\n(4) if an individual or entity holds an option, warrant, or similar right to purchase an ownership interest, the individual or entity is considered to be the owner of those ownership interests.\n(c) \"Eligible organization\" means an organization that opposes covering some or all health benefits under section 62Q.522, 62Q.524, or 62Q.585 on account of religious objections and that is:\n(1) organized as a nonprofit entity and holds itself out to be religious; or\n(2) organized and operates as a closely held for-profit entity, and the organization's owners or highest governing body has adopted, under the organization's applicable rules of governance and consistent with state law, a resolution or similar action establishing that the organization objects to covering some or all health benefits under section 62Q.522, 62Q.524, or 62Q.585 on account of the owners' sincerely held religious beliefs.\n(d) \"Exempt organization\" means an organization that is organized and operates as a nonprofit entity and meets the requirements of section 6033(a)(3)(A)(i) or (iii) of the Internal Revenue Code of 1986, as amended.\n(a) An exempt organization is not required to provide coverage under section 62Q.522, 62Q.524, or 62Q.585 if the exempt organization has religious objections to the coverage. An exempt organization that chooses to not provide coverage pursuant to this paragraph must notify employees as part of the hiring process and must notify all employees at least 30 days before:\n(1) an employee enrolls in the health plan; or\n(2) the effective date of the health plan, whichever occurs first.\n(b) If the exempt organization provides partial coverage under section 62Q.522, 62Q.524, or 62Q.585, the notice required under paragraph (a) must provide a list of the portions of such coverage which the organization refuses to cover.\n(a) A health plan established or maintained by an eligible organization complies with the coverage requirements of section 62Q.522, 62Q.524, or 62Q.585, with respect to the health benefits identified in the notice under this paragraph, if the eligible organization provides notice to any health plan company with which the eligible organization contracts that it is an eligible organization and that the eligible organization has a religious objection to coverage for all or a subset of the health benefits under section 62Q.522, 62Q.524, or 62Q.585.\n(b) The notice from an eligible organization to a health plan company under paragraph (a) must include: (1) the name of the eligible organization; (2) a statement that it objects to coverage for some or all of the health benefits under section 62Q.522, 62Q.524, or 62Q.585, including a list of the health benefits to which the eligible organization objects, if applicable; and (3) the health plan name. The notice must be executed by a person authorized to provide notice on behalf of the eligible organization.\n(c) An eligible organization must provide a copy of the notice under paragraph (a) to prospective employees as part of the hiring process and to all employees at least 30 days before:\n(1) an employee enrolls in the health plan; or\n(2) the effective date of the health plan, whichever occurs first.\n(d) A health plan company that receives a copy of the notice under paragraph (a) with respect to a health plan established or maintained by an eligible organization must, for all future enrollments in the health plan:\n(1) expressly exclude coverage for those health benefits identified in the notice under paragraph (a) from the health plan; and\n(2) provide separate payments for any health benefits required to be covered under section 62Q.522, 62Q.524, or 62Q.585 for enrollees as long as the enrollee remains enrolled in the health plan.\n(e) The health plan company must not impose any cost-sharing requirements, including co-pays, deductibles, or coinsurance, or directly or indirectly impose any premium, fee, or other charge for the health benefits under section 62Q.522 on the enrollee. The health plan company must not directly or indirectly impose any premium, fee, or other charge for the health benefits under section 62Q.522, 62Q.524, or 62Q.585 on the eligible organization or health plan.\n(f) On January 1, 2025, and every year thereafter a health plan company must notify the commissioner, in a manner determined by the commissioner, of the number of eligible organizations granted an accommodation under this subdivision.",
	"repealed": false
}