{
	"id": "216C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.05",
	"title": "216C.05 FINDINGS AND PURPOSE.",
	"text": "The legislature finds and declares that continued growth in demand for energy will cause severe social and economic dislocations, and that the state has a vital interest in providing for: increased efficiency in energy consumption, the development and use of renewable energy resources wherever possible, and the creation of an effective energy forecasting, planning, and education program.\nThe legislature further finds and declares that the protection of life, safety, and financial security for citizens during an energy crisis is of paramount importance.\nTherefore, the legislature finds that it is in the public interest to review, analyze, and encourage those energy programs that will minimize the need for annual increases in fossil fuel consumption by 1990 and the need for additional electrical generating plants, and provide for an optimum combination of energy sources and energy conservation consistent with environmental protection and the protection of citizens.\nThe legislature intends to monitor, through energy policy planning and implementation, the transition from historic growth in energy demand to a period when demand for traditional fuels becomes stable and the supply of renewable energy resources is readily available and adequately utilized.\nThe legislature further finds that for economic growth, environmental improvement, and protection of citizens, it is in the public interest to encourage those energy programs that will provide an optimum combination of energy resources, including energy savings.\nTherefore, the legislature, through its committees, must monitor and evaluate progress toward greater reliance on cost-effective energy efficiency and renewable energy and lesser dependence on fossil fuels in order to reduce the economic burden of fuel imports, diversify utility-owned and consumer-owned energy resources, reduce utility costs for businesses and residents, improve the competitiveness and profitability of Minnesota businesses, create more energy-related jobs that contribute to the Minnesota economy, and reduce pollution and emissions that cause climate change.\nIt is the energy policy of the state of Minnesota that:\n(1) annual energy savings equal to at least 1.5 percent of annual retail energy sales of electricity and natural gas be achieved through cost-effective energy efficiency;\n(2) the per capita use of fossil fuel as an energy input be reduced by 15 percent by the year 2015, through increased reliance on energy efficiency and renewable energy alternatives;\n(3) 25 percent of the total energy used in the state be derived from renewable energy resources by the year 2025; and\n(4) retail electricity rates for each customer class be at least five percent below the national average.",
	"repealed": false
}