{
	"id": "43A.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.55",
	"title": "43A.55 MANAGEMENT ANALYSIS REVOLVING FUND.",
	"text": "The management analysis revolving fund is created in the state treasury.\nMoney in the management analysis revolving fund is appropriated annually to the commissioner to provide analytical, statistical, and organizational development services to state agencies, local units of government, metropolitan and regional agencies, school districts, and other public entities in the state.\nExcept as specifically provided otherwise, each agency shall reimburse the management analysis revolving fund for the cost of all services, supplies, materials, labor, and depreciation of equipment, including reasonable overhead costs, that the commissioner is authorized and directed to furnish an agency. The commissioner shall report the rates to be charged for the revolving fund no later than July 1 of each year to the chair of the committee or division of the senate or the house of representatives with primary jurisdiction over the budget of the Department of Management and Budget.\nThe commissioner may make appropriate transfers to the revolving fund according to section 16A.126. The commissioner may make allotment and encumbrances in anticipation of these transfers. In addition, the commissioner may require an agency to make advance payments to the revolving fund sufficient to cover the office's estimated obligation for a period of at least 60 days. All reimbursements and other money received by the commissioner under this section must be deposited in the management analysis revolving fund.\nIf the management analysis revolving fund is abolished or liquidated, the total net profit from the operation of the fund must be distributed to the various funds from which purchases were made. For a given period of time, the amount of total net profit to be distributed to each fund shall reflect the same ratio of total purchases attributable to each fund divided by the total purchases from all funds.",
	"repealed": false
}