{
	"id": "15.441",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.441",
	"title": "15.441 COMMUNICATIONS SERVICES.",
	"text": "Every state agency that is directly involved in furnishing information or rendering services to the public and that serves a substantial number of non-English-speaking people shall employ enough qualified bilingual persons in public contact positions, or enough interpreters to assist those in these positions, to ensure provision of information and services in the language spoken by a substantial number of non-English-speaking people.\nThe commissioner of administration shall determine the application of this section to each state agency, in consultation with the Minnesota Council on Latino Affairs, groups representing other non-English-speaking people, and the head of the agency. In determining what constitutes a substantial number of non-English-speaking people, the commissioner shall consider:\n(1) the number of people served by the agency;\n(2) the number of non-English-speaking people served by the agency;\n(3) the frequency with which non-English-speaking people are served by the agency; and\n(4) the extent to which information or services rendered by the agency affect legal rights, privileges, or duties.\nEvery state agency that serves a substantial number of non-English-speaking people and that provides materials in English explaining services is encouraged to provide equivalent materials in any non-English language spoken by a substantial number of the people served by the agency. An agency should give highest priority to providing in a non-English language materials that notify people of legal rights, duties, or privileges they are entitled to, and the steps they must take to obtain or maintain those rights, duties, or privileges. When notice of the availability of material explaining services available is given, orally or in writing, it should be given in English and the non-English language into which any material has been translated.\nA state agency is encouraged to provide its local offices with written materials in the appropriate foreign language when:\n(1) the local office or facility serves a substantial number of non-English-speaking people;\n(2) written materials such as forms, applications, questionnaires, letters, or notices are used to ask or order a person to provide information or to give a person information; and\n(3) the information asked for or given could affect the person's rights, duties, or privileges with regard to the agency's services or benefits.\n(a) A state agency may not dismiss an employee or increase its complement to carry out the purposes of this section. A state agency need only implement this section by filling employee public contact positions made vacant by retirement or normal attrition.\n(b) This section shall be implemented to the extent permissible under federal law, civil service laws governing state agencies, and collective bargaining agreements.",
	"repealed": false
}