{
	"id": "475.561",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.561",
	"title": "475.561 TAXABLE STATUS; SPECIAL PROVISIONS.",
	"text": "(a) Obligations may be issued which provide, if interest on the obligations is determined under the terms of the obligations to be subject to federal income taxation, for an increase in the rate of interest payable on the obligations, from the date of issuance or another date, to a rate provided under the terms of the obligations.\n(b) If the municipality issues obligations it intends to be exempt from federal income taxation but bond counsel cannot provide an opinion that the interest on the obligations will be exempt from federal income taxation under pending legislation or regulations existing or proposed with retroactive effect or otherwise, the municipality may provide for the obligations to bear interest at a rate that will decrease, if the obligations are subsequently determined to be exempt from federal income taxation, to a rate and from a date to be determined under the provisions of the obligations.\n(c) For purposes of section 475.61, subdivisions 1 and 3, the increase or decrease in interest rate permitted by this subdivision need not be taken into account until the increase or decrease occurs. Upon occurrence of the increase or decrease, the levy must be modified to provide at least five percent in excess of the amount necessary to pay principal and interest at the new rate of interest on the obligations.\nA municipality may, from the proceeds of bonds, investment earnings, or any other available money of the municipality, pay to the United States or an officer, department, agency or instrumentality of the United States a rebate of excess earnings payment required by federal law to maintain the interest as tax exempt. A covenant to make a payment or payments pursuant to this subdivision is not an obligation of the municipality as defined in section 475.51, subdivision 3.\nA municipality that issues obligations it intends to be exempt from federal income taxation may agree to prepay or purchase the obligations (a) at the time and in the amount it determines necessary or desirable to maintain the obligations as exempt from federal income taxation or (b) upon a determination that the obligations are taxable. A municipality may make arrangements to have money available with which to purchase or prepay the obligations as the municipality determines necessary or desirable. If arrangements are made with a financial institution pursuant to section 475.54, subdivision 5a or this subdivision and if the municipality owes the financial institution money under the arrangement, the agreement to pay the financial institution is not an obligation of the municipality as defined in section 475.51, subdivision 3, unless and until the amount to be paid or reimbursed is determined and becomes due and payable, whereupon, the obligation is, as provided by the agreement, a general or special obligation of the municipality, and may also be paid from the proceeds of refunding bonds issued pursuant to this chapter. The agreement may not be or become a general obligation of the municipality unless the underlying, originally issued obligation was a general obligation of the municipality. For purposes of section 475.61, subdivisions 1 and 3, money necessary to make the purchase or prepayment are not amounts needed to meet when due principal and interest payments on the obligations.\nThis section is, in part, remedial in nature. Obligations issued prior to March 26, 1986 are not invalid or unenforceable for providing terms, consequences or remedies that are authorized by this section.",
	"repealed": false
}