{
	"id": "245.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.73",
	"title": "245.73 SERVICES FOR ADULTS WITH MENTAL ILLNESS; GRANTS.",
	"text": "The commissioner shall establish a statewide program to assist counties in ensuring provision of services to adult mentally ill persons. The commissioner shall make grants to county boards to provide community-based services to mentally ill persons through programs licensed under sections 245A.01 to 245A.16.\nCounty boards may submit an application and budget for use of the money in the form specified by the commissioner. The commissioner shall make grants only to counties whose applications and budgets are approved by the commissioner for residential programs for adults with mental illness to meet licensing requirements pursuant to sections 245A.01 to 245A.16. These grants shall not be used for room and board costs. For calendar year 1994 and subsequent years, the commissioner shall allocate the money appropriated under this section on a calendar year basis.\nGrants received pursuant to this section may be used to fund innovative programs in residential facilities, related to structured physical fitness programs designed as part of a mental health treatment plan.\nGrants made pursuant to this section shall finance 75 to 100 percent of the county's costs of expanding or providing services for adult mentally ill persons in residential facilities as provided in subdivision 2.\nThe commissioner shall promulgate an emergency and permanent rule to govern grant applications, approval of applications, allocation of grants, and maintenance of service and financial records by grant recipients. The commissioner shall specify requirements for reports, including quarterly fiscal reports, according to section 256.01, subdivision 2, paragraph (o). The commissioner shall require collection of data for compliance, monitoring and evaluation purposes and shall require periodic reports to demonstrate the effectiveness of the services in helping adult mentally ill persons remain and function in their own communities. As a part of the report required by section 245.461, the commissioner shall report to the legislature as to the effectiveness of this program and recommendations regarding continued funding.\nThe commissioner may transfer money from adult mental health residential program grants to community support program grants under section 256K.10 if the county requests such a transfer and if the commissioner determines the transfer will help adults with mental illness to remain and function in their own communities. The commissioner shall consider past utilization of the residential program in determining which counties to include in the transferred fund.",
	"repealed": false
}