{
	"id": "136F.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.98",
	"title": "136F.98 REVENUE BONDS, ISSUANCE; FEDERAL TAX.",
	"text": "The board or a successor may issue revenue bonds under sections 136F.90 to 136F.97 whose aggregate principal amount at any time may not exceed $405,000,000, and payable from the revenue appropriated to the fund established by section 136F.94, and use the proceeds together with other public or private money that may otherwise become available to acquire land, and to acquire, construct, complete, remodel, and equip structures or portions thereof to be used for dormitory, residence hall, student union, food service, parking purposes, or for any other similar revenue-producing building or buildings of such type and character as the board finds desirable for the good and benefit of the state colleges and universities. Before issuing the bonds or any part of them, the board shall consult with and obtain the advisory recommendations of the chairs of the house of representatives Ways and Means Committee and the senate Finance Committee about the facilities to be financed by the bonds.\nThe bonds authorized by this section may be issued without regard to whether the interest to be paid on them is includable in gross income for federal tax purposes. However, if it is intended that the interest on the bonds be exempt from federal income taxes, an officer of the board shall certify for the board on the date of issue the facts, estimates, and circumstances that lead the officer reasonably to expect that the proceeds of the bonds and the facilities financed by them will not be used to cause the interest on the bonds to be subject to federal income taxes; the board may covenant and agree with the holders of the bonds that it will comply with the provisions of the United States Internal Revenue Code now or hereafter enacted that do or may apply to the bonds and that establish conditions under which the interest to be paid on the bonds will not be subject to federal income taxes; and the officers of the board shall take the actions or refrain from taking the actions necessary to comply with the covenants. Money required to be spent to comply may be appropriated by the board from the fund established by section 136F.94.\nFor the purposes of this section, the board is the successor to the State University Board.",
	"repealed": false
}