{
	"id": "216C.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.47",
	"title": "216C.47 GEOTHERMAL PLANNING GRANTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Eligible applicant\" means a county, city, town, or the Metropolitan Council.\n(c) \"Geothermal energy system\" means a system that heats and cools one or more buildings by using the constant temperature of the earth as both a heat source and heat sink, and a heat exchanger consisting of an underground closed loop system of piping containing a liquid to absorb and relinquish heat within the earth. Geothermal energy system includes:\n(1) a bored geothermal heat exchanger, as defined in section 103I.005;\n(2) a groundwater thermal exchange device, as defined in section 103I.005; and\n(3) a submerged closed loop heat exchanger, as defined in section 103I.005.\nA geothermal planning grant program is established in the department to provide financial assistance to eligible applicants to examine the technical and economic feasibility of installing geothermal energy systems.\n(a) The geothermal planning grant account is established as a separate account in the special revenue fund in the state treasury. The commissioner must credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund, but remains in the account until June 30, 2029. The commissioner must manage the account.\n(b) Money in the account is appropriated to the commissioner to (1) award geothermal planning grants to eligible applicants, and (2) reimburse the reasonable costs incurred by the department to administer this section.\nAn applicant seeking a grant under this section must submit an application to the commissioner on a form developed by the commissioner. The commissioner must develop administrative procedures to govern the application and grant award process. The commissioner may contract with a third party to conduct some or all of the program's operations.\n(a) A grant awarded under this process may be used to pay the total cost of the activities eligible for funding under subdivision 6, up to a limit of $150,000.\n(b) The commissioner must endeavor to award grants to eligible applicants in all regions of Minnesota.\n(c) Grants may be awarded under this section only to projects whose work is completed after July 1, 2024.\nActivities that may be funded with a grant awarded under this section include:\n(1) analysis of the heating and cooling demand of the building or buildings that consume energy from the geothermal energy system;\n(2) evaluation of equipment that could be combined with a geothermal energy system to meet the building's heating and cooling requirements;\n(3) analysis of the geologic conditions of the earth in which a geothermal energy system operates, including the drilling of one or more test wells to characterize geologic materials and to measure properties of the earth and aquifers that impact the feasibility of installing and operating a geothermal energy system; and\n(4) preparation of a financial analysis of the project.\nContractors and subcontractors that perform work funded with a grant awarded under this section must have experience installing geothermal energy systems.",
	"repealed": false
}