{
	"id": "103F.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.801",
	"title": "103F.801 COUNTY LAKE IMPROVEMENT PROGRAM.",
	"text": "To preserve and protect lakes and to increase and enhance the use and enjoyment of lakes, a statewide lake improvement program is established to:\n(1) preserve the natural character of lakes and their shoreland environment as feasible and practical;\n(2) improve the quality of water in lakes;\n(3) provide for reasonable assurance of water quantity in lakes, where feasible and practicable; and\n(4) assure protection of the lakes from the detrimental effects of human activities and certain natural processes.\n(a) A county board of a county has the authority given in this section with respect to bodies of water located entirely or partially within the boundaries of the county and not situated entirely within the boundaries of a single city or lake conservation district established by law.\n(b) After approval by an affected city or lake conservation district, a county board may assume and exercise the authority given in this section with respect to bodies of water located entirely or partially within the city or lake conservation district.\n(c) Programs undertaken pursuant to the authority given in this section must be consistent with the statewide water and related land resources plan prepared under the direction of the commissioner of natural resources and with regional water and related resources plans.\n(d) A body of water may not be improved under this section unless the public has access to some portion of the shoreline of the body of water.\nThe county boards shall have power to:\n(1) acquire, in the name of the county, by gift or purchase or by condemnation under chapter 117, an existing dam or control works that may affect the level of waters;\n(2) construct and operate water control structures if approved by the commissioner of natural resources under sections 103G.245 and 103G.405;\n(3) undertake projects to change the course current or cross section of public waters if approved by the commissioner of natural resources under sections 103G.245 and 103G.405;\n(4) improve navigation and to acquire by gift or purchase land, equipment, or other facilities to improve navigation;\n(5) contract with a board of managers of a watershed district within the county or the board of supervisors of a soil and water conservation district within the county for improvements under chapters 103C and 103D;\n(6) undertake research to determine the condition and development of the body of water and the water entering it and to transmit these studies to the Pollution Control Agency and other interested authorities;\n(7) conduct a program of water improvement and conservation;\n(8) develop and implement the comprehensive plan to eliminate water pollution, provided that construction of any water, sewer, or water and sewer system shall be undertaken in the manner provided by section 444.075 or other applicable laws and not under this section;\n(9) receive financial assistance from and join in projects or enter into contracts with federal and state agencies for the study and treatment of related pollution problems and demonstration programs;\n(10) maintain public beaches, public docks, and other public facilities for access to a body of water;\n(11) make cooperative agreements with the United States or state government or another county or city to implement the provisions of this section; and\n(12) require projects to change the course, current, or cross section of public waters within unincorporated areas to be approved by the county board before submitting an application for a permit to the commissioner as required by sections 103G.245 and 103G.405.\n(a) The county board may appropriate money from the general revenue fund of the county to implement this section and sections 103B.505 to 103B.581.\n(b) The county board may apply for, receive, and disburse federal funds made available to the county by federal law or rules for any purpose related to the powers and duties of the county board. The county board shall comply with requirements of federal law to apply for, receive, and disburse the funds.\n(c) The county board may accept any donations or grants from any public or private concern. The funds received by the county board must be deposited in the county treasury and appropriated for the purpose for which it was received.\nThe county board may levy taxes to implement authority for water surface use regulation, lake improvement programs, and lake improvement districts on all taxable property within the county, which may be in addition to any amounts levied within a lake improvement district.",
	"repealed": false
}