{
	"id": "475A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/475A.05",
	"title": "475A.05 MUNICIPAL BOND GUARANTY FUND.",
	"text": "For the purpose of providing money to be loaned to municipalities to acquire and to better public lands and buildings and other public improvements of a capital nature, when needed to pay the principal of or interest on bonds issued for this purpose, or bonds issued to refund such guaranteed bonds, the municipal bond guaranty loan fund is created as a separate bookkeeping account in the general books of account of the state. All proceeds of state bonds credited to this fund, all amounts transferred from the general fund, all guaranty fees received, and all repayments of principal and interest on loans made from the fund are appropriated for construction and other permanent improvement and shall be available until the purposes for which the appropriation was made have been accomplished, except that at any time when the balance on hand in the state municipal bond guaranty fund exceeds ten percent of the principal amount of all then outstanding bonds secured by the fund, the state may reappropriate to the general fund the balance in excess of this amount.\nIn order to eliminate the need to sell Minnesota state municipal aid bonds, there is annually appropriated from the general fund to the commissioner of management and budget for transfer to the municipal bond guaranty loan fund the amounts needed to meet the state's obligations under sections 475A.01 to 475A.06, not to exceed a total of $4,330,000. This subdivision does not prevent the sale of state municipal aid bonds to the extent that the amount available for transfer from the general fund is not sufficient to meet all the state's obligations under sections 475A.01 to 475A.06.\nAll money deposited to the credit of the municipal bond guaranty fund shall be available for the making of loans under section 475A.04, except that on November 1 in each year the commissioner of management and budget shall certify the balance then on hand in the fund which the commissioner believes will not be required for loans to be made in the following year, and there shall then be transferred and credited to the state municipal aid bond account in the state bond fund the entire balance or so much thereof as, with the balance then in the bond account, will equal the total amount of principal and interest due and to become due on state municipal aid bonds to and including July 1 in the second ensuing year. Amounts so transferred and credited are appropriated for the purpose of reducing the amount of tax otherwise required to be levied for the state bond fund by article XI, section 7 of the constitution.",
	"repealed": false
}