{
	"id": "477A.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.013",
	"title": "477A.013 MUNICIPAL GOVERNMENT DISTRIBUTIONS.",
	"text": "(a) In 2014 and thereafter, each town is eligible for a distribution under this subdivision equal to the product of (i) its agricultural property factor, (ii) its town area factor, (iii) its population factor, and (iv) 0.0045. As used in this subdivision, the following terms have the meanings given them:\n(1) \"agricultural property factor\" means the ratio of the adjusted net tax capacity of agricultural property located in a town, to the adjusted net tax capacity of all other property located in the town. The agricultural property factor cannot exceed eight;\n(2) \"agricultural property\" means property classified under section 273.13, as homestead and nonhomestead agricultural property, rural vacant land, and noncommercial seasonal recreational property;\n(3) \"town area factor\" means the most recent estimate of total acreage, not to exceed 50,000 acres, located in the township available as of July 1 in the aid calculation year, estimated or established by:\n(i) the United States Bureau of the Census;\n(ii) the State Land Management Information Center; or\n(iii) the secretary of state; and\n(4) \"population factor\" means the square root of the town's population.\n(b) If the sum of the aids payable to all towns under this subdivision exceeds the limit under section 477A.03, subdivision 2c, the distribution to each town must be reduced proportionately so that the total amount of aids distributed under this subdivision does not exceed the limit in section 477A.03, subdivision 2c.\n(c) Data used in calculating aids to towns under this subdivision, other than acreage, shall be the most recently available data as of January 1 in the year in which the aid is calculated.\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1988 [Repealed, 1Sp1989 c 1 art 4 s 15]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1994 [Repealed, 1996 c 310 s 1]\nMS 1990 [Repealed, 1991 c 291 art 3 s 15]\n(a) For aids payable in 2024 and thereafter, the formula aid for a city is equal to the product of (1) the difference between its unmet need and its certified aid in the previous year, and (2) the aid gap percentage.\n(b) The applicable aid gap percentage must be calculated by the Department of Revenue so that the total of the aid under subdivision 9 equals the total amount available for aid under section 477A.03. The aid gap percentage must be the same for all cities subject to paragraph (a). Data used in calculating aids to cities under sections 477A.011 to 477A.013 shall be the most recently available data as of January 1 in the year in which the aid is calculated.\n(a) In calendar year 2024 and thereafter, if a city's certified aid for the previous year is less than its current unmet need, the city shall receive an aid distribution equal to the sum of (1) its certified aid in the previous year, and (2) the city formula aid under subdivision 8.\n(b) For aids payable in 2024 and thereafter, if a city's certified aid for the previous year is equal to or greater than its current unmet need, the total aid for a city is equal to the greater of (1) its unmet need, or (2) the amount it was certified to receive in the previous year minus the lesser of (i) $10 multiplied by its population, or (ii) five percent of its net levy in the year prior to the aid distribution. No city may have a total aid amount less than $0.\nNotwithstanding any local ordinance or charter provision, a city whose certified aid under subdivision 9 is less than the amount it received in the previous year under the same subdivision may increase its levy payable in the same year as the certified aid is paid by an amount equal to the aid decrease for that year.\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2022 [Repealed, 2023 c 64 art 4 s 33]\nPrior to receiving aid pursuant to this section, a city must register an official electronic mail address with the commissioner, which the commissioner may use as an exclusive means to communicate with the city.",
	"repealed": false
}