{
	"id": "93.516",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.516",
	"title": "93.516 GAS AND OIL LEASING.",
	"text": "(a) With the approval of the Executive Council, the commissioner of natural resources may enter into leases for gas or oil exploration and production from lands belonging to the state or in which the state has an interest.\n(b) For purposes of this section, \"gas or oil exploration and production\" includes the exploration and production of both hydrocarbon and nonhydrocarbon gases, including noble gases. \"Noble gases\" means a group of gases that includes helium, neon, argon, krypton, xenon, radon, and oganesson. \"Production\" includes extraction and beneficiation of gas or oil from consolidated or unconsolidated formations in the state.\nAn application for a lease under this section must be submitted to the commissioner of natural resources. The commissioner must prescribe the information to be included in the application. The applicant must submit with the application a certified check, cashier's check, or bank money order payable to the Department of Natural Resources in the sum of $100 as a fee for filing the application. The application fee must not be refunded under any circumstances. The right is reserved to the state to reject any or all applications for an oil or gas lease.\nThe commissioner must negotiate the terms of each lease entered into under this section on a case-by-case basis, taking into account the unique geological and environmental aspects of each proposal, control of adjacent lands, and the best interests of the state. A lease entered into under this section must be consistent with the following:\n(1) the primary term of the lease may not exceed five years plus the unexpired portion of the calendar year in which the lease is issued. The commissioner and applicant may negotiate the conditions by which the lease may be extended beyond the primary term, in whole or in part;\n(2) a bonus consideration of not less than $15 per acre must be paid by the applicant to the Department of Natural Resources before the lease is executed;\n(3) the commissioner of natural resources may require an applicant to provide financial assurance to ensure payment of any damages resulting from the production of gas or oil;\n(4) the rental rates must not be less than $5 per acre per year for the unexpired portion of the calendar year in which the lease is issued and in years thereafter; and\n(5) on gas and oil produced and sold by the lessee from the lease area, the lessee must pay a production royalty to the Department of Natural Resources of not less than 18.75 percent of the gross sales price of the product sold free on board at the delivery point, and the royalty must be credited as provided in section 93.22. For purposes of this section, \"gross sales price\" means the total consideration paid by the first purchaser that is not an affiliate of the lessee for gas or oil produced from the leased premises.",
	"repealed": false
}