{
	"id": "500.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.17",
	"title": "500.17 FUTURE ESTATES; RENTS AND PROFITS.",
	"text": "Dispositions of the rents and profits of lands, to accrue and be received at any time subsequent to the execution of the instrument creating such disposition, shall be governed by the rules established in this chapter in relation to future estates in lands.\nWhere the controlling will or other written instrument permits accumulation, either expressly or by necessary implication, income from personal property and rents and profits from real estate may be accumulated for the period during which the power of alienation may be suspended by future interests in real or personal property not held in trust under section 501C.1202, subdivision 3. Where any will or other instrument authorizes accumulation beyond the period permissible under this section, such authorization shall be void only as to the excess period.\nReasonable sums set aside for depreciation and depletion shall not be deemed an accumulation within the meaning of this section.\nMS 1961 [Repealed, 1965 c 682 s 2]\nWhen such rents and profits are directed to be accumulated for the benefit of infants entitled to the expectant estate, and such infants are destitute of other sufficient means of support and education, the district court, upon the application of their guardian, may direct a suitable sum, out of such rents and profits, to be applied to their maintenance and education.\nWhen, in consequence of a valid limitation of an expectant estate, there is a suspension of the power of alienation, or of ownership, during the continuance of which the rents and profits are undisposed of, and no valid direction for their accumulation is given, such rents and profits shall belong to the person presumptively entitled to the next eventual estate.\nThe provisions of this section shall not apply to the accumulations of rents and profits of real estate held or owned by a trustee or trustees of a trust forming a part of a stock bonus, pension, retirement or profit-sharing plan or fund exempt from tax under the provisions of the Internal Revenue Code of the United States, and rents and profits of real estate held or owned by any such trustee or trustees may be accumulated without restriction as to time.",
	"repealed": false
}