{
	"id": "37.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/37.04",
	"title": "37.04 BOARD OF MANAGERS.",
	"text": "A board of managers shall manage and control the State Agricultural Society. The board consists of a president and nine other members, two of whom are vice-presidents. Each member represents one of nine regional districts. Six members constitute a quorum for the purposes of any board meeting.\nFor purposes of electing members of the board of managers of the State Agricultural Society, the regional districts are identical with the nine congressional districts as established by Laws 1933, chapter 185, and are numbered accordingly.\nThe annual meeting of the society must be held at the State Fairgrounds or at any other place in Minnesota selected by the board of managers. The meeting must be held during a three-day period selected by the board of managers commencing no earlier than January 2 and no later than January 31. At least 30 days' written notice of the time and place of the annual meeting must be given to all members of the society.\nAt the annual meeting, the members of the society shall elect a president from among the members of the board of managers for a term of one year. The president may not be a resident of the fourth or the fifth regional districts. The members shall also elect seven managers as follows:\n(1) at the annual meeting on each third year after 1963, one manager from each of the first, third, and sixth regional districts;\n(2) at the annual meeting on each third year after 1964, one manager from each of the seventh and ninth regional districts;\n(3) at the annual meeting on each third year after 1965, one manager from each of the second and eighth regional districts.\nAt the annual meeting in each even-numbered year a vice-president must be elected from the fifth regional district, and in each odd-numbered year a vice-president must be elected from the fourth regional district.\nOnly one member of the board of managers, exclusive of the president, may be a resident of any one regional district. On the day before the last day of the annual meeting, the accredited delegates to the meeting from each regional district whose manager's term expires in that year shall meet together at the place of the annual meeting and nominate and certify to the annual meeting the choice of that district for manager. At the time fixed for the election of the president of the society and after the nominations have been certified, presented, and read to the annual meeting, the annual meeting shall proceed to elect managers to fill all expiring terms.\nA vacancy which occurs before the expiration of any term of office of a member of the board of managers may be filled by the remaining members of the board. Any person appointed to fill a vacancy holds office only until the next annual meeting of the society, at which a successor must be elected in the manner provided to serve the balance of the unexpired term.",
	"repealed": false
}