{
	"id": "256.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.90",
	"title": "256.90 SOCIAL WELFARE FUND; USE; DISPOSITION; DEPOSITORIES.",
	"text": "The commissioner of human services, in consultation with the Direct Care and Treatment executive board, at least 30 days before the first day of January and the first day of July in each year shall file with the commissioner of management and budget an estimate of the amount of the social welfare fund to be held in the treasury during the succeeding six-month period, subject to current disbursement. Such portion of the remainder thereof as may be at any time designated by the request of the commissioner of human services may be invested by the commissioner of management and budget in bonds in which the permanent trust funds of the state of Minnesota may be invested, upon approval by the State Board of Investment. The portion of such remainder not so invested shall be placed by the commissioner of management and budget at interest for the period of six months, or when directed by the commissioner of human services, for the period of 12 months thereafter at the highest rate of interest obtainable in a bank, or banks, designated by the board of deposit as a suitable depository therefor. All the provisions of law relative to the designation and qualification of depositories of other state funds shall be applicable to sections 256.88 to 256.92, except as herein otherwise provided. Any bond given, or collateral assigned or both, to secure a deposit hereunder may be continuous in character to provide for the repayment of any moneys belonging to the fund theretofore or thereafter at any time deposited in such bank until its designation as such depository is revoked and the security thereof shall be not impaired by any subsequent agreement or understanding as to the rate of interest to be paid upon such deposit, or as to time for its repayment. The amount of money belonging to the fund deposited in any bank, including other state deposits, shall not at any time exceed the amount of the capital stock thereof. In the event of the closing of the bank any sum deposited therein shall immediately become due and payable.",
	"repealed": false
}