{
	"id": "204D.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.19",
	"title": "204D.19 SPECIAL ELECTIONS; WHEN HELD.",
	"text": "When a vacancy occurs more than 150 days before the next state general election, and the legislature will not be in session before the final canvass of the state general election returns, the vacancy shall be filled at the next state general election.\nExcept for vacancies in the legislature which occur at any time between the last day of session in an odd-numbered year and the 40th day prior to the opening day of session in the succeeding even-numbered year, when a vacancy occurs and the legislature will be in session so that the individual elected as provided by this section could take office and exercise the duties of the office immediately upon election, the governor shall issue within five days after the vacancy occurs a writ calling for a special election. The special election shall be held as soon as possible, consistent with the notice requirements of section 204D.22, subdivision 3, but in no event more than 35 days after the issuance of the writ. A special election must not be held during the four days before or the four days after a holiday as defined in section 645.44, subdivision 5.\nWhen a vacancy occurs at a time other than those described in subdivisions 1 and 2 the governor shall issue a writ, calling for a special election to be held so that the individual elected may take office at the opening of the next session of the legislature, or at the reconvening of a session of the legislature.\nIf a vacancy results from a successful election contest, the governor shall issue 22 days after the first day of the legislative session a writ calling for a special election unless the house in which the contest may be tried has passed a resolution which states that it will or will not review the court's determination of the contest. If the resolution states that the house will not review the court's determination, the writ shall be issued within five days of the passage of the resolution.\n[Repealed, 1999 c 132 s 46]\nIf a vacancy in office is due to a vacancy in nomination under section 204B.13, the governor shall issue a writ in the manner provided in that section.",
	"repealed": false
}