{
	"id": "347.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.52",
	"title": "347.52 DANGEROUS DOGS; REQUIREMENTS.",
	"text": "(a) An owner of a dangerous dog shall keep the dog, while on the owner's property, in a proper enclosure. If the dog is outside the proper enclosure, the dog must be muzzled and restrained by a substantial chain or leash and under the physical restraint of a responsible person. The muzzle must be made in a manner that will prevent the dog from biting any person or animal but that will not cause injury to the dog or interfere with its vision or respiration.\n(b) An owner of a dangerous dog must renew the registration of the dog annually until the dog is deceased. If the dog is removed from the jurisdiction, it must be registered as a dangerous dog in its new jurisdiction.\n(c) An owner of a dangerous dog must notify the animal control authority in writing of the death of the dog or its transfer to a new location where the dog will reside within 30 days of the death or transfer, and must, if requested by the animal control authority, execute an affidavit under oath setting forth either the circumstances of the dog's death and disposition or the complete name, address, and telephone number of the person to whom the dog has been transferred or the address where the dog has been relocated.\n(d) An animal control authority shall require a dangerous dog to be sterilized at the owner's expense. If the owner does not have the animal sterilized within 30 days, the animal control authority shall seize the dog and have it sterilized at the owner's expense.\n(e) A person who owns a dangerous dog and who rents property from another where the dog will reside must disclose to the property owner prior to entering the lease agreement and at the time of any lease renewal that the person owns a dangerous dog that will reside at the property.\n(f) A person who transfers ownership of a dangerous dog must notify the new owner that the animal control authority has identified the dog as dangerous. The current owner must also notify the animal control authority in writing of the transfer of ownership and provide the animal control authority with the new owner's name, address, and telephone number.",
	"repealed": false
}