{
	"id": "480.0591",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.0591",
	"title": "480.0591 RULES OF EVIDENCE.",
	"text": "The supreme court may promulgate rules of evidence regulating all evidentiary matters in civil and criminal actions in all courts of the state. Such rules shall not abridge, enlarge or modify the substantive rights of any person.\nBefore any such rules are adopted the supreme court shall appoint an advisory committee consisting of eight lawyers licensed to practice law in the state and at least two judges of the district court to assist the court in considering and preparing such rules.\n[Repealed, 1993 c 13 art 1 s 44]\nBefore any such rule is adopted, the supreme court shall distribute copies of the proposed rule to the judiciary and attorneys of the state for their consideration and suggestions and give due consideration to such suggestions as they may submit to the court. The Minnesota State Bar Association, or a professional judicial organization may file with the court a petition specifying their suggestions concerning any existing or proposed rule and requesting a hearing thereon. The court shall thereupon grant a hearing thereon within six months after the filing of the petition.\n(a) All rules promulgated under this section shall be effective at a time fixed by the court and shall be published in the appendix to the official reports of the supreme court and shall be bound therewith.\n(b) The commissioner of administration shall print, publish and distribute copies thereof to the judiciary and attorneys as required by law. The commissioner shall make 500 copies available, without cost, to the superintendent of the Bureau of Criminal Apprehension for distribution by the superintendent to local law enforcement agencies of the state.\nPresent statutes relating to evidence shall be effective until modified or superseded by court rule. If a rule of evidence is promulgated which is in conflict with a statute, the statute shall thereafter be of no force and effect. The supreme court, however, shall not have the power to promulgate rules of evidence which conflict, modify, or supersede the following statutes:\n(1) statutes which relate to the competency of witnesses to testify, found in sections 595.02 to 595.025;\n(2) statutes which establish the prima facie evidence as proof of a fact;\n(3) statutes which establish a presumption or a burden of proof;\n(4) statutes which relate to the admissibility of statistical probability evidence based on genetic or blood test results, found in sections 634.25 to 634.30;\n(5) statutes which relate to the privacy of communications; and\n(6) statutes which relate to the admissibility of certain documents.\nThe legislature may enact, modify, or repeal any statute or modify or repeal any rule of evidence promulgated under this section.",
	"repealed": false
}