{
	"id": "256L.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.05",
	"title": "256L.05 APPLICATION PROCEDURES.",
	"text": "(a) Applicants may submit applications online, in person, by mail, or by phone in accordance with the Affordable Care Act, and by any other means by which medical assistance applications may be submitted. Applicants may submit applications through MNsure or through the MinnesotaCare program. Applications and application assistance must be made available at provider offices, local human services agencies, school districts, public and private elementary schools in which 25 percent or more of the students receive free or reduced-price meals, community health offices, Women, Infants and Children (WIC) program sites, Head Start program sites, public housing councils, crisis nurseries, child care centers, early childhood education and preschool program sites, legal aid offices, and libraries, and at any other locations at which medical assistance applications must be made available. These sites may accept applications and forward the forms to the commissioner or local county human services agencies that choose to participate as an enrollment site. Otherwise, applicants may apply directly to the commissioner or to participating local county human services agencies.\n(b) Application assistance must be available for applicants choosing to file an online application through MNsure.\nBeginning January 1, 1999, a family member who is age 18 or over or who is an authorized representative, as defined in the medical assistance program, may apply on an applicant's behalf.\n[Repealed, 2015 c 71 art 11 s 65]\n[Repealed, 2015 c 71 art 11 s 65]\nThe commissioner or county agency shall use electronic verification through MNsure as the primary method of income verification. If there is a discrepancy between reported income and electronically verified income, an individual may be required to submit additional verification to the extent permitted under the Affordable Care Act. In addition, the commissioner shall perform random audits to verify reported income and eligibility. The commissioner may execute data sharing arrangements with the Department of Revenue and any other governmental agency in order to perform income verification related to eligibility and premium payment under the MinnesotaCare program.\nFor purposes of this chapter, an individual is eligible for MinnesotaCare following a determination by the commissioner that the individual meets the eligibility criteria for the applicable period of eligibility. For an individual required to pay a premium, coverage is only available in each month of the applicable period of eligibility for which a premium is paid.\n(a) The effective date of coverage is the first day of the month following the month in which eligibility is approved and the first premium payment has been received. The effective date of coverage for new members added to the family is the first day of the month following the month in which the change is reported. All eligibility criteria must be met by the family at the time the new family member is added. The income of the new family member is included with the family's modified adjusted gross income and the adjusted premium begins in the month the new family member is added.\n(b) The initial premium must be received by the last working day of the month for coverage to begin the first day of the following month.\n(c) Notwithstanding any other law to the contrary, benefits under sections 256L.01 to 256L.18 are secondary to a plan of insurance or benefit program under which an eligible person may have coverage and the commissioner shall use cost avoidance techniques to ensure coordination of any other health coverage for eligible persons. The commissioner shall identify eligible persons who may have coverage or benefits under other plans of insurance or who become eligible for medical assistance.\n(d) The effective date of coverage for individuals or families who are exempt from paying premiums under section 256L.15, subdivision 1, paragraph (c), is the first day of the month following the month in which eligibility is approved.\n(a) An enrollee's eligibility must be redetermined on an annual basis. The period of eligibility is the entire calendar year following the year in which eligibility is redetermined. Eligibility redeterminations shall occur during the open enrollment period for qualified health plans as specified in Code of Federal Regulations, title 45, section 155.410(e)(3).\n(b) Each new period of eligibility must take into account any changes in circumstances that impact eligibility and premium amount. Coverage begins as provided in section 256L.06.\n[Repealed, 2013 c 108 art 1 s 68]\n[Repealed, 2015 c 71 art 11 s 65]\nThe commissioner of human services shall determine an applicant's eligibility for MinnesotaCare no more than 45 days from the date that the application is received by the Department of Human Services as set forth in Code of Federal Regulations, title 42, section 435.912.\n[Repealed, 2015 c 71 art 11 s 65]\nThe commissioner shall ensure that all applicants for MinnesotaCare who identify themselves as veterans are referred to a county veterans service officer for assistance in applying to the United States Department of Veterans Affairs for any veterans benefits for which they may be eligible.",
	"repealed": false
}