{
	"id": "240.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.24",
	"title": "240.24 MEDICATION.",
	"text": "The commission shall make and enforce rules governing medication and medical testing for horses running at licensed racetracks. The rules must provide that no medication, as the commission defines that term by rule, may be administered to a horse within 48 hours of a race it runs at a licensed racetrack. The rules must also provide that no horse participating in a race shall carry in its body any substance foreign to the natural horse. The commission shall by rule establish the qualifications for laboratories used by it as testing laboratories to enforce its rules under this section.\nNotwithstanding subdivision 1, the commission by rule shall allow the use of: (1) topical external applications that do not contain anesthetics or steroids; (2) food additives; (3) Furosemide or other pulmonary hemostatic agents if the agents are administered under the visual supervision of the veterinarian or a designee of the veterinarian employed by the commission; (4) nonsteroidal anti-inflammatory drugs, provided that the test sample does not contain more than the regulatory threshold concentrations set by rule by the commission; and (5) medications and their metabolites, provided their use thereof does not exceed regulatory threshold concentrations set by rule by the commission. For purposes of this clause, \"test sample\" means any bodily substance including blood, urine, saliva, or other substance as directed by the commission, taken from a horse under the supervision of the commission veterinarian and in such manner as prescribed by the commission for the purpose of analysis.\nIncreased expenses related to the use of upgraded drug testing technologies and procedures are deemed to be necessary costs within the meaning of section 240.155 and the commission may be reimbursed for these expenses from receipts from card playing activities regulated by the commission.\nThe commission shall establish by rule a fee or schedule of fees that may be used to recover the costs of medical testing of horses running at racetracks licensed by the commission. Fees charged for the testing of horses shall cover the cost of the medical testing laboratory. Fee receipts shall be deposited in the state treasury and credited to the racing reimbursement account.",
	"repealed": false
}