{
	"id": "11A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.08",
	"title": "11A.08 INVESTMENT ADVISORY COUNCIL.",
	"text": "There is created an Investment Advisory Council consisting of 17 members. Ten of these members must be experienced in general investment matters. The state board must appoint the ten members. The other seven members are: the commissioner of management and budget; the executive director of the Minnesota State Retirement System; the executive director of the Public Employees Retirement Association; the executive director of the Teachers Retirement Association; a retiree currently receiving benefits from a statewide retirement plan; and two public employees who are active members of funds whose assets are invested by the state board. The governor must appoint the retiree and the public employees for four-year terms.\nThe council shall:\n(1) advise the state board and the director on general policy matters relating to investments;\n(2) advise the state board and the director on methods to improve the rate of return on invested money while insuring adequate security for that money;\n(3) advise the state board and the director on the form and content of the report required by section 11A.07, subdivision 4, clause (7), so that the report clearly and objectively discloses the investment activities of the state board and the director;\n(4) perform other tasks of an advisory nature as requested by the state board.\nThe council shall annually elect a chair and vice-chair from among its members, and may elect other officers as necessary. The council shall meet upon the call of the chair of the council or the chair of the state board.\nThe membership terms, compensation, removal of members appointed by the state board, and filling of vacancies of members shall be as provided in section 15.059 except that council members shall not receive a per diem. The council is not subject to the expiration date provisions of section 15.059.\nA member of the council shall be indemnified and held harmless by the state for any reasonable costs or expenses incurred as a result of any actual or threatened litigation or administrative proceedings arising out of the performance of the member's duties, except an action brought by the state or agency thereof arising from the failure of a council member to perform duties in the manner prescribed in section 11A.09.\nNo member of the council may participate in deliberations or vote on any matter before the council which will or is likely to result in direct, measurable economic gain to the member. Additionally, no member of the council appointed by the state board may participate in deliberations or vote on any matter before the council which will or is likely to result in direct, measurable economic gain to that member's employer. Members of the council shall file with the Campaign Finance and Public Disclosure Board an economic interest statement in a manner as prescribed by section 10A.09, subdivisions 5 and 6.",
	"repealed": false
}