{
	"id": "206.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.86",
	"title": "206.86 COUNTING ELECTRONIC VOTING SYSTEM RESULTS.",
	"text": "In precincts where an electronic voting system is used, as soon as the polls are closed the election judges shall secure the voting systems against further voting. They shall then open the ballot box and count the number of ballot cards or envelopes containing ballot cards that have been cast to determine that the number of ballot cards does not exceed the number of voters shown on the election register or registration file. If there is an excess, the judges shall seal the ballots in a ballot container and transport the container to the county auditor or municipal clerk who shall process the ballots in the same manner as paper ballots are processed in section 204C.20, subdivision 2, then enter the ballots into the ballot counter. The total number of voters must be entered on the forms provided. The judges shall next count the write-in votes and enter the number of those votes on forms provided for the purpose.\nThe judges shall place all voted ballot cards, defective ballots, and damaged ballots in the container provided for transporting them to the counting center. The container must be sealed and delivered immediately to the counting center by two judges who are not of the same major political party. The judges shall also deliver to the counting center in a suitable container the unused ballot cards, the spoiled ballot envelope, and the ballot envelopes issued to the voters and deposited during the day in the ballot box.\nProceedings at the counting center are open to the public. They are under the direction of the official in charge of elections in each municipality where an electronic voting system is used and must be under the observation of at least two election judges who are not of the same major political party. Only persons employed and authorized for the purpose may touch any ballot card, ballot container, or statement of absentee ballot results.\nWhen the ballot cards arrive at a counting center where votes are counted by a multiple use computer, they must be given to the counting center election judges. For purposes of this subdivision a multiple use computer is automatic tabulating equipment which can perform functions other than counting votes. If the election judges at the precinct have determined that any ballot cards are not defective by reason of improper write-in votes, those ballot cards may be counted by the automatic tabulating equipment before inspection by the counting center election judges. The results of this preliminary tabulation may be made available to the public if the tabulation is clearly identified as unofficial.\nAfter any preliminary tabulation has been made, the ballot cards must be returned to the counting center election judges who shall examine them for physical defects and prepare replacements, if necessary, as provided in subdivision 5.\nIf a ballot card is damaged or defective so that it cannot be counted properly by the automatic tabulating equipment, a true duplicate copy must be made of the damaged ballot card in the presence of two judges not of the same major political party and must be substituted for the damaged ballot card. Likewise, a duplicate ballot card must be made of a defective ballot card which may not include the votes for the offices for which it is defective. Duplicate ballot cards must be clearly labeled \"duplicate,\" indicate the precinct in which the corresponding damaged or defective ballot was cast, bear a serial number which must be recorded on the damaged or defective ballot card, and be counted in lieu of the damaged or defective ballot card. If a ballot card is damaged or defective so that it cannot be counted properly by the automatic tabulating equipment, the ballot card must be tallied at the counting center by two judges not of the same major political party and the totals for all these ballot cards must be added to the totals for the respective precincts.\nIn the event the results of a precinct are subject to a recount under section 204C.35 or 204C.36, or are subject to a postelection review under section 206.89, and a ballot format as provided in section 206.80, paragraph (b), clause (2), item (ii), was used by ten or fewer voters in the precinct, the election judges from that precinct are not eligible to participate in conducting a recount or postelection review in that precinct.\nA final tabulation of ballots must be obtained from the automatic tabulating equipment after all damaged or defective cards have been replaced. The final tabulation, together with the returns of write-in and absentee votes and the precinct summary statements prepared in accordance with section 204C.24, constitute the official return of each precinct. Upon completion of the count the returns are open to the public. The automatic tabulating equipment must be programmed to provide a complete recapitulation of all ballots processed. It may be programmed to provide information in addition to that required in the official return of each precinct, if the officials in charge of elections deem that advisable in order to provide election statistics to evaluate the performance of the electronic voting system or other aspects of the election.",
	"repealed": false
}