{
	"id": "16C.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.16",
	"title": "16C.16 DESIGNATION OF PROCUREMENTS FROM SMALL BUSINESSES.",
	"text": "(a) The commissioner shall for each fiscal year ensure that small businesses receive at least 25 percent of the value of anticipated total state procurement of goods and services, including printing and construction. The commissioner shall divide the procurements so designated into contract award units of economically feasible production runs in order to facilitate offers or bids from small businesses.\n(b) The commissioner must solicit and encourage Minnesota small businesses to submit responses or bids when the commissioner is entering into master contracts. If cost-effective, when entering into a master contract, the commissioner must attempt to negotiate contract terms that allow agencies the option of purchasing from small businesses, particularly small businesses that are geographically proximate to the entity making the purchase.\n(c) In making the annual designation of such procurements the commissioner shall attempt (1) to vary the included procurements so that a variety of goods and services produced by different small businesses are obtained each year, and (2) to designate small business procurements in a manner that will encourage proportional distribution of such awards among the geographical regions of the state. To promote the geographical distribution of awards, the commissioner may designate a portion of the small business procurement for award to bidders from a specified congressional district or other geographical region specified by the commissioner. The failure of the commissioner to designate particular procurements shall not be deemed to prohibit or discourage small businesses from seeking the procurement award through the normal process.\nThe commissioner shall adopt the size standards for \"small business\" found in Code of Federal Regulations, title 49, section 26.65, for purposes of sections 16C.16 to 16C.21, 137.31, 137.35, 161.321, and 473.142, provided that the business has its principal place of business in Minnesota.\nEvery state agency must for each fiscal year designate for awarding to small businesses at least 25 percent of the value of anticipated procurements of that agency for professional or technical services. The set-aside under this subdivision is in addition to that provided by subdivision 1, but must otherwise comply with section 16C.08.\nThe commissioner shall establish a program for purchasing goods and services from targeted group businesses, as designated in subdivision 5. The purpose of the program is to remedy the effects of past discrimination against members of targeted groups. In furtherance of this purpose, the commissioner shall attempt to ensure that purchases from targeted group businesses reflect a fair and equitable representation of all the state's purchasing.\n(a) The commissioner of administration shall periodically designate businesses that are majority owned and operated by women, persons with a substantial physical disability, or specific minorities as targeted group businesses within purchasing categories as determined by the commissioner. A group may be targeted within a purchasing category if the commissioner determines there is a statistical disparity between the percentage of purchasing from businesses owned by group members and the representation of businesses owned by group members among all businesses in the state in the purchasing category.\n(b) In addition to designations under paragraph (a), an individual business may be included as a targeted group business if the commissioner determines that inclusion is necessary to remedy discrimination against the owner based on race, gender, or disability in attempting to operate a business that would provide goods or services to public agencies.\n(c) The designations of purchasing categories and businesses under paragraphs (a) and (b) are not rules for purposes of chapter 14, and are not subject to rulemaking procedures of that chapter.\n(a) The commissioner may award up to a 12 percent preference for specified goods or services to small targeted group businesses.\n(b) The commissioner may award a contract for goods, services, or construction directly to a small business or small targeted group business without going through a competitive solicitation process up to a total contract award value, including extension options, of $100,000.\n(c) The commissioner may designate a purchase of goods or services for award only to small businesses or small targeted group businesses if the commissioner determines that at least three small businesses or small targeted group businesses are likely to respond to a solicitation.\n(d) The commissioner, as a condition of awarding a construction contract or approving a contract for professional or technical services, may set goals that require the prime contractor to subcontract a portion of the contract to small businesses or small targeted group businesses. The commissioner must establish a procedure for granting waivers from the subcontracting requirement when qualified small businesses or small targeted group businesses are not reasonably available. The commissioner may establish financial incentives for prime contractors who exceed the goals for use of small business or small targeted group business subcontractors and financial penalties for prime contractors who fail to meet goals under this paragraph. The subcontracting requirements of this paragraph do not apply to prime contractors who are small businesses or small targeted group businesses.\n(a) Except when mandated by the federal government as a condition of receiving federal funds, the commissioner shall award up to a 12 percent preference, but no less than the percentage awarded to any other group under this section, on state procurement to certified small businesses that are majority-owned and operated by veterans.\n(b) The commissioner may award a contract for goods, services, or construction directly to a veteran-owned small business without going through a competitive solicitation process up to a total contract award value, including extension options, of $100,000.\n(c) The commissioner may designate a purchase of goods or services for award only to a veteran-owned small business if the commissioner determines that at least three veteran-owned small businesses are likely to respond to a solicitation.\n(d) The commissioner, as a condition of awarding a construction contract or approving a contract for professional or technical services, may set goals that require the prime contractor to subcontract a portion of the contract to a veteran-owned small business. The commissioner must establish a procedure for granting waivers from the subcontracting requirement when qualified veteran-owned small businesses are not reasonably available. The commissioner may establish financial incentives for prime contractors who exceed the goals for use of veteran-owned small business subcontractors and financial penalties for prime contractors who fail to meet goals under this paragraph. The subcontracting requirements of this paragraph do not apply to prime contractors who are veteran-owned small businesses.\n(e) The purpose of this designation is to facilitate the transition of veterans from military to civilian life, and to help compensate veterans for their sacrifices, including but not limited to their sacrifice of health and time, to the state and nation during their military service, as well as to enhance economic development within Minnesota.\n(f) Before the commissioner certifies that a small business is majority-owned and operated by a veteran, the commissioner of veterans affairs must verify that the owner of the small business is a veteran, as defined in section 197.447.\n(a) The commissioner may award up to a 12 percent preference on state procurement to small businesses located in an economically disadvantaged area.\n(b) The commissioner may award a contract for goods, services, or construction directly to a small business located in an economically disadvantaged area without going through a competitive solicitation process up to a total contract award value, including extension options, of $100,000.\n(c) The commissioner may designate a purchase of goods or services for award only to a small business located in an economically disadvantaged area if the commissioner determines that at least three small businesses located in an economically disadvantaged area are likely to respond to a solicitation.\n(d) The commissioner, as a condition of awarding a construction contract or approving a contract for professional or technical services, may set goals that require the prime contractor to subcontract a portion of the contract to a small business located in an economically disadvantaged area. The commissioner must establish a procedure for granting waivers from the subcontracting requirement when qualified small businesses located in an economically disadvantaged area are not reasonably available. The commissioner may establish financial incentives for prime contractors who exceed the goals for use of subcontractors that are small businesses located in an economically disadvantaged area and financial penalties for prime contractors who fail to meet goals under this paragraph. The subcontracting requirements of this paragraph do not apply to prime contractors who are small businesses located in an economically disadvantaged area.\n(e) A business is located in an economically disadvantaged area if:\n(1) the owner resides in or the business is located in a county in which the median income for married couples is less than 70 percent of the state median income for married couples;\n(2) the owner resides in or the business is located in an area designated a labor surplus area by the United States Department of Labor; or\n(3) the business is a certified rehabilitation facility or extended employment provider as described in chapter 268A.\n(f) The commissioner may designate one or more areas designated as targeted neighborhoods under section 469.202 or as border city enterprise zones under section 469.166 as economically disadvantaged areas for purposes of this subdivision if the commissioner determines that this designation would further the purposes of this section. If the owner of a small business resides or is employed in a designated area, the small business is eligible for any preference provided under this subdivision.\n(g) The Department of Revenue shall gather data necessary to make the determinations required by paragraph (e), clause (1), and shall annually certify counties that qualify under paragraph (e), clause (1). An area designated a labor surplus area retains that status for 120 days after certified small businesses in the area are notified of the termination of the designation by the United States Department of Labor.\n(a) When designating purchases directly to a business in accordance with this section, the commissioner may also designate a purchase of goods or services directly to any combination of small businesses, small targeted group businesses, veteran-owned small businesses or small businesses located in an economically disadvantaged area if the commissioner determines that at least three businesses in two or more of the disadvantaged business categories are likely to respond.\n(b) When establishing subcontractor goals under this section, the commissioner may set goals that require the prime contractor to subcontract a portion of the contract to any combination of a small business, small targeted group business, veteran-owned small business, or small business located in an economically disadvantaged area.\nSurety bonds guaranteed by the federal Small Business Administration and second party bonds are acceptable security for a construction award under this section. \"Second party bond\" means a bond that designates as principal, guarantor, or both, a person or persons in addition to the person to whom the contract is proposed for award.\n[Repealed, 2014 c 196 art 2 s 16]\nAt least 75 percent of the value of the subcontracts awarded to small businesses or small targeted group businesses under subdivision 6, paragraph (c), must be performed by the business to which the subcontract is awarded or by another small business or small targeted group business.\nAll laws and rules pertaining to solicitations, bid evaluations, contract awards, and other procurement matters apply equally to procurements involving any small business, small targeted group business, veteran-owned business, or small business located in an economically disadvantaged area.\nThis section does not apply to construction contracts or contracts for professional or technical services under section 16C.08 that are financed in whole or in part with federal funds and that are subject to federal disadvantaged business enterprise regulations.\n(a) Notwithstanding section 16C.001, this subdivision applies to contracts for state-funded capital improvement projects in excess of $100,000 that are issued by organizations not subject to the small business requirements of this section, including municipalities as defined in section 466.01, subdivision 1.\n(b) Organizations administering contracts described in paragraph (a) shall promote the use of targeted group businesses designated under this section and take steps to remove barriers to equitable participation of targeted group businesses.\n(c) Organizations shall cooperate with the commissioner's efforts to monitor and measure compliance with this subdivision in the performance of state-funded contracts.",
	"repealed": false
}