{
	"id": "142G.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.54",
	"title": "142G.54 EMPLOYMENT AND TRAINING; COUNTY DUTIES.",
	"text": "(a) Each county must develop and provide an employment and training services component which is designed to put participants on the most direct path to unsubsidized employment. Participation in these services is mandatory for all MFIP caregivers.\n(b) A county must provide employment and training services under sections 142G.25, 142G.26, 142G.37, 142G.51 to 142G.53, 142G.55 to 142G.64, 142G.71, and 142G.75 to 142G.77 within 30 days after the caregiver is determined eligible for MFIP.\n[See Note.]\nUnless the provisions of subdivision 4 apply, a county must select at least two employment and training service providers. A county may opt to provide services on its own as one of these providers.\nThe county must:\n(1) explain to applicants and recipients and provide explanatory materials regarding the relationship between the 60-month time limit on assistance funded with TANF dollars and the receipt of various benefits, including cash assistance, Supplemental Nutrition Assistance Program (SNAP) benefits, medical assistance, and child care assistance; and\n(2) provide assistance to applicants and recipients to enable them to minimize the use of their 60 allowable months of TANF-funded assistance.\nEach county, or group of counties working cooperatively, shall make available to participants the choice of at least two employment and training service providers as defined under section 142G.50, subdivision 3, except in counties utilizing workforce centers that use multiple employment and training services, offer multiple services options under a collaborative effort and can document that participants have choice among employment and training services designed to meet specialized needs.\nNotwithstanding subdivision 4, a county that explains in the service agreement required under section 142G.76, subdivision 4, that the provision of alternative employment and training service providers would result in financial hardship for the county is not required to make available more than one employment and training provider.\n(a) County agencies and their contractors must provide universal notification to all applicants and recipients of MFIP that:\n(1) referrals to counseling and supportive services are available for victims of family violence;\n(2) nonpermanent resident battered individuals married to United States citizens or permanent residents may be eligible to petition for permanent residency under the federal Violence Against Women Act, and that referrals to appropriate legal services are available;\n(3) victims of family violence are exempt from the 60-month limit on assistance if they are complying with an employment plan under section 142G.56, subdivision 3; and\n(4) victims of family violence may choose to have regular work requirements waived while the individual is complying with an employment plan under section 142G.56, subdivision 3.\n(b) If an employment plan under section 142G.56, subdivision 3, is denied, the county or a job counselor must provide reasons why the plan is not approved and document how the denial of the plan does not interfere with the safety of the participant or children.\nNotification must be in writing and orally at the time of application and recertification, when the individual is referred to the title IV-D child support agency, and at the beginning of any job training or work placement assistance program.\nThe county agency and the county agency's employment and training providers must consult and coordinate with other providers of employment and training services to identify existing resources, in order to prevent duplication of services, to assure that other programs' services are available to enable participants to achieve self-sufficiency, and to assure that costs for these other services for which participants are eligible are not incurred by MFIP. At a minimum, the county agency and its providers must coordinate with Jobs Training and Partnership Act providers and with any other relevant employment, training, and education programs in the county.\nIn a county where there is no staff person who is trained in domestic violence, as that term is defined in section 142G.02, subdivision 75, the county must work with the nearest organization that is designated as providing services to victims of domestic violence to develop a process, which ensures that domestic violence victims have access to a person trained in domestic violence.",
	"repealed": false
}