{
	"id": "86B.701",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.701",
	"title": "86B.701 FUNDING COUNTY WATER SAFETY.",
	"text": "(a) On or before September 1 of each even-numbered year, the county board of each county shall submit to the commissioner its proposed budget to carry out the provisions of this chapter, during the biennium beginning on the following July 1.\n(b) The commissioner shall require a county to submit a budget containing proposed activities that would adequately carry out this chapter.\n(c) The commissioner shall review the proposed budgets and incorporate into the budget for the Department of Natural Resources the parts that the commissioner determines necessary and equitable for each county. The amount allocated for each county shall be paid to the county and a separate accounting maintained.\n(d) The commissioner may require each county to make reports as to the expenditure of the funds.\n(e) The commissioner shall publish a report annually showing the expenditures and distribute copies to all participating counties.\n(a) If the county fails to submit a budget or fails to carry out the proposed activities after submitting a budget, the commissioner may allocate all or a portion of the county's share back to the Department of Natural Resources or to political subdivisions within the county, including lake conservation districts in part or in whole within the county, that the commissioner determines will provide watercraft safety enforcement, supervision, marking, regulation, search and rescue, and information on waters wholly or partially within their boundaries.\n(b) The commissioner may require budgets or reports on the expenditure of the funds.\n(c) If the county sheriff determines that additional outside assistance is necessary on a temporary, nonrecurring basis for the purposes of boat and water safety, the sheriff may request the assistance from the commissioner. The commissioner may allocate emergency funding to the county, provide materials or equipment on a temporary loan basis, or hire temporary personnel.\n(a) Notwithstanding section 16A.41, expenditures directly related to each appropriation's purpose made on or after January 1 of the fiscal year in which the grant is made or the date of work plan approval, whichever is later, are eligible for reimbursement unless otherwise provided.\n(b) The amount of funds to be allocated under subdivisions 1 and 2 and shall be determined by the commissioner on the basis of the following criteria:\n(1) the number of watercraft using the waters wholly or partially within the county;\n(2) the number of watercraft using particular bodies of water, wholly or partially within the county, in relation to the size of the body of water and the type, speed, and size of the watercraft utilizing the water body;\n(3) the amount of water acreage wholly or partially within the county;\n(4) the overall performance of the county in the area of boat and water safety;\n(5) special considerations, such as volume of transient or nonresident watercraft use, number of rental watercraft, extremely large bodies of water wholly or partially in the county; or\n(6) any other factor as determined by the commissioner.\n(c) The commissioner may require reports from the counties, make appropriate surveys or studies, or utilize local surveys or studies to determine the criteria required in allocation funds.",
	"repealed": false
}