{
	"id": "508.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.63",
	"title": "508.63 REGISTRATION OF INSTRUMENTS CREATING LIENS; JUDGMENTS.",
	"text": "No judgment requiring the payment of money shall be a lien upon registered land, except as herein provided. Any person claiming such lien shall file with the registrar a certified copy of the judgment, together with a written statement containing a description of each parcel of land in which the judgment debtor has a registered interest and upon which the lien is claimed, and a proper reference to the certificate or certificates of title to such land. Upon filing such copy and statement, the registrar shall enter a memorial of such judgment upon each certificate designated in such statement, and the judgment shall thereupon be and become a lien upon the judgment debtor's interest in the land described in such certificate or certificates. At any time after filing the certified copy of such judgment, any person claiming the lien may, by filing a written statement, as herein provided, cause a memorial of such judgment to be entered upon any certificate of title to land in which the judgment debtor has a registered interest and not described in any previous statement and the judgment shall thereupon be and become a lien upon the judgment debtor's interest in such land. The public authority for child support enforcement may present for filing a notice of judgment lien under section 548.091 with identifying information for a parcel of real property. Upon receipt of the notice of judgment lien, the registrar shall enter a memorial of it upon each certificate which can reasonably be identified as owned by the judgment debtor on the basis of the information provided. The judgment shall survive and the lien thereof shall continue for a period of ten years from the date of the judgment and no longer, and the registrar of titles shall not carry forward to a new certificate of title the memorial of the judgment after that period. In every case where an instrument of any description, or a copy of any writ, order, or decree, is required by law to be filed or recorded in order to create or preserve any lien, writ, or attachment upon unregistered land, such instrument or copy, if intended to affect registered land, shall, in lieu of recording, be filed and registered with the registrar. In addition to any facts required by law to be stated in such instruments to entitle them to be filed or recorded, they shall also contain a reference to the number of the certificate of title of the land to be affected, and, if the attachment, charge, or lien is not claimed on all the land described in any certificate of title, such instrument shall contain a description sufficient to identify the land.",
	"repealed": false
}