{
	"id": "103E.729",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.729",
	"title": "103E.729 APPORTIONING REPAIR COSTS; ALTERNATIVE OPTION.",
	"text": "Notwithstanding any conflicting provision of this chapter, a drainage authority may use the option under this section to apportion repair costs on all property contributing runoff to the drainage system according to the relative runoff and relative sediment delivery determined in an approved report to apportion repair costs prepared according to subdivision 2. Repair costs apportioned using the method in this section are charges for property contributing runoff to the drainage system that must be considered repair cost assessments under this chapter.\n(a) When the drainage authority determines that a drainage system repair is necessary, the drainage authority may apportion costs for repairing a drainage system based on relative runoff and relative sediment delivery from any property, public road, street, railway, or other utility contributing runoff to the drainage system as provided in this section. If the method under this section is used, costs must be determined before ordering the repair of all or any part of a drainage system as provided in section 103E.705, subdivision 3, or 103E.715, subdivision 4, or before levying an assessment for a repair fund as provided in section 103E.735, subdivision 1.\n(b) The drainage authority must appoint one or more persons qualified to use geographic information system technology and applicable digital information, including but not limited to conditioned topographic data, soils and land use data, and property, road, and utility corridor identification data, together with appropriate on-site verification, to equitably apportion repair costs.\n(c) The person or persons conducting the cost apportionment must file a report to apportion repair costs with the drainage authority explaining in nontechnical language the method, data, and interpretations used and the results of the cost apportionment. The report must present data and results in a format so that individual property owners, political subdivisions, and utilities can clearly examine the information applicable to their property, public road, street, railway, or other utility, including for each parcel having a separate property identification number.\n(a) When a report to apportion repair costs is filed, the drainage authority, in consultation with the auditor or secretary, must set a time, by order, for a hearing on the report not more than 30 days after the date of the order. At least 20 days before the hearing, the auditor or secretary must give notice by mail of the time and location of the hearing to the owners of property, political subdivisions, and utilities proposed to be assessed in the report. The notice of hearing must include a copy of the portion of the report explaining in nontechnical language the method, data, and interpretations used; the results of the cost apportionment applicable to the property owner, political subdivision, or utility receiving notice; and a statement of the location where the entire report to apportion repair costs has been filed for public inspection.\n(b) At the hearing, the drainage authority must hear and consider the testimony presented by all interested parties. At least one person responsible for preparing the report to apportion repair costs must be present at the initial hearing.\n(c) If the drainage authority determines that the apportionment of costs is inequitable, the drainage authority may amend the report to apportion repair costs and must make necessary and proper findings and an order in relation to the report, or resubmit matters to the report preparer for further consideration. If matters are resubmitted, the hearing may be continued as necessary to make and hear an amended report. The report preparer must proceed promptly to reconsider resubmitted matters and must make and file an amended report. The drainage authority may replace the original report with the amended report to apportion repair costs and make necessary and proper findings and an order to approve the amended report. The jurisdiction of the drainage authority continues in the property given proper notice, and new or additional notice is not required for that property.\nAfter considering the report to apportion repair costs, any amended report, and all evidence presented, the drainage authority must make findings, approve the report, and apportion repair costs consistent with the values in the report to apportion repair costs if the drainage authority finds that the cost apportionment is equitable because:\n(1) the weighting of relative runoff and relative sediment delivery is appropriate for the type of repair;\n(2) the data inputs are reliable; and\n(3) the computation method is reliable.\nThe drainage authority may continue to apportion repair costs consistent with the values in the report to apportion repair costs of record. After a report to apportion repair costs has been approved under this subdivision, an owner of property, a political subdivision, or a utility assessed in the report of record may request in writing that the drainage authority update the report based on changed land use. The request must be filed with the auditor of the county where the property is located or the secretary. Before the drainage authority approves a repair cost assessment for the drainage system, the drainage authority must determine if the report to apportion repair costs of record reasonably reflects current land use, relative runoff, and relative sediment delivery. If it does not so reflect, the drainage authority must make findings and must appoint one or more persons to prepare and file an updated report to apportion repair costs for the drainage system in accordance with subdivision 2.\nProper consideration must be given to property that is used for conservation that prohibits development or land use change by ownership, deed restriction, or conservation easement, or is enrolled in a program that prohibits agricultural crop production.\nThe owner of any property subject to cost apportionment listed in the adopted report to apportion repair costs may appeal the findings of the drainage authority under subdivision 4 as provided in section 103E.095.\nFor purposes of this section:\n(1) \"relative runoff\" means the surface and subsurface runoff potential from a specific property compared on an equitable basis to all other properties contributing runoff to the drainage system; and\n(2) \"relative sediment delivery\" means the sediment delivery potential from a specific property compared on an equitable basis to all other properties contributing runoff to the drainage system.\nThis section expires on July 31, 2029.",
	"repealed": false
}