{
	"id": "352.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.92",
	"title": "352.92 CORRECTIONAL EMPLOYEE CONTRIBUTIONS.",
	"text": "(a) Employee contributions of covered correctional employees must be in an amount equal to the following percent of salary:\n(b) These contributions must be made by deduction from salary as provided in section 352.04, subdivision 4.\n(c) Contribution increases under paragraph (a) must be paid starting the first day of the first full pay period after the effective date of the increase.\n(a) The employer shall contribute for covered correctional employees an amount equal to the following percent of salary:\n(b) Contribution increases under paragraph (a) must be paid starting the first day of the first full pay period after the effective date of the increase.\n(a) Effective July 1, 2019, the employer shall pay a supplemental contribution. The supplemental contribution is 1.45 percent of salary for covered correctional employees from July 1, 2019, through June 30, 2020; 2.95 percent of salary for covered correctional employees from July 1, 2020, through June 30, 2021; and 4.45 percent of salary for covered correctional employees thereafter. The supplemental contribution rate of 4.45 percent remains in effect until, for three consecutive years, the market value of the assets of the correctional state employees retirement plan of the Minnesota State Retirement System equals or exceeds the actuarial accrued liability of the plan as determined by the actuary retained under section 356.214. The expiration of the supplemental employer contribution is effective the first day of the first full pay period of the fiscal year immediately following the issuance of the third actuarial valuation upon which the expiration is based.\n(b) The supplemental contribution under paragraph (a) must be paid starting the first day of the first full pay period after June 30, 2018.\nThe Minnesota State Retirement System shall administer the correctional employees retirement plan established by sections 352.90 to 352.951 in accordance with this chapter and chapters 356 and 356A.",
	"repealed": false
}