{
	"id": "244.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.101",
	"title": "244.101 SENTENCING OF FELONY OFFENDERS WHO COMMIT OFFENSES ON AND AFTER AUGUST 1, 1993.",
	"text": "Except as provided in section 244.05, subdivision 4a, when a felony offender is sentenced to a fixed executed sentence for an offense committed on or after August 1, 1993, the executed sentence consists of two parts: (1) a specified minimum term of imprisonment that is equal to two-thirds of the executed sentence; and (2) a specified maximum supervised release term that is equal to one-third of the executed sentence. The amount of time the inmate actually serves in prison and on supervised release is subject to the provisions of section 244.05, subdivision 1b.\nWhen a court pronounces an executed sentence under this section, it shall explain: (1) the total length of the executed sentence; (2) the amount of time the defendant will serve in prison; and (3) the amount of time the defendant will serve on supervised release, assuming the defendant commits no disciplinary offense in prison that results in the imposition of a disciplinary confinement period. The court shall also explain that the amount of time the defendant actually serves in prison may be extended by the commissioner if the defendant commits any disciplinary offenses in prison and that this extension could result in the defendant's serving the entire executed sentence in prison. The court's explanation shall be included in a written summary of the sentence.\nNotwithstanding the court's explanation of the potential length of a defendant's supervised release term, the court's explanation creates no right of a defendant to any specific, minimum length of a supervised release term.\nIf the defendant is convicted of any offense for which a statute imposes a mandatory minimum sentence of imprisonment, the statutory mandatory minimum sentence governs the length of the entire executed sentence pronounced by the court under this section.",
	"repealed": false
}