{
	"id": "49.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.05",
	"title": "49.05 POWERS AND DUTIES OF COMMISSIONER ON LIQUIDATION.",
	"text": "In all cases where the commissioner has taken possession of the property and business of any financial institution, or any such financial institution is in the process of liquidation by the commissioner, the commissioner may, in the name of the financial institution or of the commissioner acting as such, for its use, bring and carry to an end all necessary actions in the proper courts to reduce its assets to money and to protect its property and rights, and to that end may, in the name of the financial institution or of the commissioner acting as such, execute all bonds and other papers necessary to carry on any such actions, and may, in its name, satisfy, discharge, and assign, by written instrument, any and all real estate and chattel mortgages and all other liens held by it, and may foreclose in the manner provided by law any real estate mortgage held by it, and execute, in its name, to the attorney employed to foreclose any such mortgage, any power of attorney required by law.\nPrior to any sale under any foreclosure proceedings, the commissioner shall record in the office of the county recorder of the county where any land affected by any such foreclosure sale is situated, a certificate under the commissioner's hand, as such commissioner, stating therein the corporate name of the financial institution affected; its principal place of business; that possession of its property and business has been taken by the commissioner under the laws of the state, and the date of taking possession thereof; and that it is in process of liquidation by the commissioner, pursuant to the laws of this state, if such be the fact. A like certificate shall be recorded by the commissioner in the office where any such mortgage or lien is recorded. This certificate, or a duly certified copy thereof, shall be prima facie evidence of the facts therein set forth. Only one such certificate need be recorded as hereinbefore provided in this section, for each financial institution in liquidation. All foreclosure proceedings heretofore conducted, whether the certificate was recorded as to each such foreclosure or not, are hereby validated if one such certificate has been recorded as to each financial institution in liquidation, or if the commissioner shall after any foreclosure sale record a certificate reciting the facts required to be set out in an original certificate, as they existed prior to the foreclosure sale.\nA like certificate shall be filed by the commissioner in the office of the court administrator of the district court in any county where any action or proceeding affecting any such financial institution or its property shall be brought, in the name of such financial institution, or in the name of the commissioner for its use, prior to the entry of judgment or the making of any final order therein, and this certificate, or a duly certified copy thereof, shall be prima facie evidence of the facts therein set forth.\nWhere the commissioner has heretofore taken possession of the property and business of any financial institution, or any financial institution has been liquidated, or the same is in process of liquidation by the commissioner, and actions or proceedings have been heretofore brought in the name of any such financial institution, or in the name of the commissioner for its use, in any court of the state, all such actions, and all orders and judgments that have heretofore been, or may hereafter be, made or entered therein, are hereby in all things validated, on the filing of a certificate reciting the facts required to be set out as provided for in subdivision 3, in the court wherein any such action or proceeding is or has been pending.\nThe Federal Deposit Insurance Corporation created by section 12B of the Federal Reserve Act, as amended, upon appointment by the commissioner, may act without bond as receiver or liquidator of a financial institution, the deposits in which are to any extent insured by this corporation, and that has been closed pursuant to section 49.04, subdivision 1.\nNotwithstanding any other provision of law the appropriate state authority having the right to appoint a receiver or liquidator of a financial institution may, in the event of the closing, tender to the corporation the appointment as receiver or liquidator of the financial institution; and, if the corporation accepts the appointment, the corporation shall have and possess all the powers and privileges provided by the laws of this state with respect to a receiver or liquidator, respectively, of a financial institution, its depositors, and other creditors.\nWhen a financial institution has been closed, and the Federal Deposit Insurance Corporation has paid or made available for payment the insured deposit liabilities of the closed institution, the corporation, whether or not it has or shall thereafter become a liquidating agent of the closed institution is subrogated, by operation of law with like force and effect as if the closed institution were a national bank, to all rights of the owners of these deposits against the closed financial institution in the same manner and to the same extent as now or hereafter necessary to enable the Federal Deposit Insurance Corporation under federal law to make insurance payments available to depositors of closed insured financial institutions; provided, that the rights of depositors and other creditors of the closed institution shall be determined in accordance with the laws of this state. The commissioner may, in the event of the closing of any financial institution pursuant to section 49.04, subdivision 1, the deposits of which financial institution are to any extent insured by the corporation, tender to the corporation the appointment as liquidating agent of this financial institution and, if the corporation accepts the appointment, it shall have and possess all the powers and privileges provided by the laws of this state with respect to a special deputy examiner of the Department of Commerce in the management and liquidation of this institution, and be subject to all of the duties of the special deputy examiner; provided, that nothing contained in this subdivision shall be construed as a surrender of the right of the commissioner to liquidate financial institutions under the commissioner's supervision pursuant to the statute in such case made and provided; and the commissioner may waive the filing of a bond by the corporation as the special deputy examiner.\nWith respect to a banking institution which is or may be closed on account of inability to meet the demands of its depositors or by action of the commissioner or of a court or by action of its directors, or, in the event of its insolvency or suspension, the commissioner may borrow from the Federal Deposit Insurance Corporation and furnish any part or all of the assets of the institution to the corporation as security for a loan from same. The order of a court of record of competent jurisdiction shall be first obtained approving this loan. The commissioner or receiver or liquidator appointed by the commissioner upon the order of a court of record of competent jurisdiction may sell to the corporation any part or all of the assets of the institution.\nThe provisions of this subdivision shall not be construed to limit the power of any banking institution, or the commissioner, to pledge or sell assets in accordance with any other law of this state.",
	"repealed": false
}