{
	"id": "323A.1003",
	"url": "https://www.revisor.mn.gov/statutes/cite/323A.1003",
	"title": "323A.1003 ANNUAL RENEWAL.",
	"text": "(a) Each calendar year beginning in the calendar year following the calendar year in which a partnership files a statement of qualification or in which a foreign partnership becomes authorized to transact business in this state, the secretary of state may send annually to the partnership or foreign partnership, using the information provided by the limited liability partnership pursuant to section 5.002 or 5.34 or the limited liability partnership statement of qualification, a notice. The notice will announce the need to file the annual renewal and will inform the partnership or foreign partnership that the annual renewal may be filed online and that paper filings may also be made and that failure to file the notice by December 31 will result in the revocation of the statement of qualification of this limited liability partnership.\n(b) A limited liability partnership, and a foreign limited liability partnership authorized to transact business in this state, shall file an annual renewal in the office of the secretary of state which contains the information required by section 5.34.\n(c) An annual renewal must be filed once each calendar year beginning in the year following the calendar year in which a partnership files a statement of qualification or a foreign partnership becomes authorized to transact business in this state.\n(d) The secretary of state must revoke the statement of qualification of a partnership that fails to file an annual renewal when due or pay the required filing fee. The secretary of state must issue a certificate of revocation which must be filed in the office of the secretary of state. The secretary of state must also make available in an electronic format the names of the revoked limited liability companies.\n(e) A revocation under subsection (d) only affects a partnership's status as a limited liability partnership and is not an event of dissolution of the partnership.\n(f) A partnership whose statement of qualification has been revoked may apply to the secretary of state for reinstatement. A partnership must file an annual renewal to apply for reinstatement and pay a reinstatement fee of $160.\n(g) A reinstatement under subsection (f) relates back to and takes effect as of the effective date of the revocation, and the partnership's status as a limited liability partnership continues as if the revocation had never occurred.",
	"repealed": false
}