{
	"id": "354A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.37",
	"title": "354A.37 REFUNDS; DEFERRED ANNUITY.",
	"text": "Any coordinated member who ceases to render teaching service for the school district in which the teachers retirement fund association is located shall be entitled to a refund in lieu of any other annuity or benefit from the teachers retirement fund association. The amount of the refund must be calculated under subdivision 3. The application for the refund must not be made prior to 30 days after the cessation of teaching services if the coordinated member has not resumed active teaching services for the district. Payment of the refund must be made within 90 days after receipt of the refund application by the board.\n(a) Any coordinated member who ceases to render teaching services for the school district in which the teachers retirement fund association is located, with sufficient allowable service credit to meet the minimum service requirements specified in section 354A.31, subdivision 1, shall be entitled to a deferred annuity in lieu of a refund under subdivision 1.\n(b) The deferred annuity must be augmented from the first day of the month following the termination of active service to the effective date of retirement. There is no augmentation if this period is less than three months.\n(c) The deferred annuity commences upon application after the person on deferred status attains at least the minimum age specified in section 354A.31, subdivision 1.\n(d) For a person who became a covered employee before July 1, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) three percent until January 1 of the year following the year in which the former member attains age 55 or June 30, 2012, whichever is earlier;\n(2) five percent from the January 1 next following the attainment of age 55 or until June 30, 2012;\n(3) two percent from July 1, 2012, until June 30, 2019; and\n(4) after June 30, 2019, the deferred annuity must not be augmented.\n(e) For a person who became a covered employee after June 30, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) 2.5 percent until June 30, 2012;\n(2) two percent from July 1, 2012, until June 30, 2019; and\n(3) after June 30, 2019, the deferred annuity must not be augmented.\n(f) The augmentation provided by this subdivision applies to the benefit provided in section 354A.35, subdivision 2. The augmentation provided by this subdivision does not apply to any period in which a person is on an approved leave of absence from an employer unit.\nA former coordinated member who qualifies for a refund under subdivision 1 is entitled to receive a refund equal to the amount of the former coordinated member's accumulated employee contributions with interest at the following rates for the applicable period:\n(1) six percent per annum compounded annually to July 1, 2011;\n(2) four percent per annum compounded annually to July 1, 2018; and\n(3) three percent per annum compounded annually thereafter.\nAny coordinated member who has attained the normal retirement age with less than ten years of allowable service credit and has terminated active teaching service is entitled to a refund in lieu of a proportionate annuity under section 356.32. The refund must be equal to the coordinated member's accumulated employee contributions plus interest at the rate of six percent compounded annually to July 1, 2011, if the person is a former member of the St. Paul Teachers Retirement Fund Association, and four percent per annum compounded annually thereafter.\nIf a coordinated member ceases to render teaching services for the school district in which the teachers retirement fund association is located but does not apply for a refund under subdivision 1 within five years after the end of the plan year next following the cessation of teaching services and if the amount of the refund that the former coordinated member would have been entitled to under subdivision 3 is $500 or less, then the amount of the refund and any accumulated interest must be credited to and become a part of the retirement fund. If the former coordinated member subsequently renders teaching services for the school district in which the teachers retirement fund association is located and the amount of the refund that the former coordinated member would have previously been entitled to under subdivision 3 is at least $5, then the amount of the refund and any accumulated interest must be restored to the member's individual account. If the amount of the refund that the former coordinated member would have previously been entitled to under subdivision 3 is at least $5 and the former coordinated member applies for a refund under subdivision 1 or for an annuity under sections 354A.31 and 354A.32 or section 356.30, the amount of the refund and any accumulated interest must be restored to the member's individual account.",
	"repealed": false
}