{
	"id": "268.053",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.053",
	"title": "268.053 PAYMENT TO TRUST FUND BY NONPROFIT ORGANIZATIONS.",
	"text": "(a) Any nonprofit organization that has employees in covered employment must pay taxes on a quarterly basis in accordance with section 268.051 unless it elects to make reimbursements to the trust fund the amount of unemployment benefits charged to its reimbursable account under section 268.047.\nThe organization may elect to make reimbursements for a period of not less than 24 calendar months beginning with the date that the organization was determined to be an employer with covered employment by filing a notice of election not later than 30 calendar days after the date of the determination.\n(b) Any nonprofit organization that makes an election will continue to be liable for reimbursements until it files a notice terminating its election before the beginning of the calendar quarter the termination is to be effective.\nA nonprofit organization that has been making reimbursements that files a notice of termination of election must be assigned the new employer tax rate under section 268.051, subdivision 5, until it qualifies for an experience rating under section 268.051, subdivision 3.\n(c) Any nonprofit organization that has been paying taxes may elect to make reimbursements by filing a notice of election. The election is effective at the beginning of the next calendar quarter. The election is not terminable by the organization for 24 calendar months.\n(d) The commissioner may for good cause extend the period that a notice of election, or a notice of termination, must be filed and may permit an election to be retroactive.\n(e) A notice of election or notice terminating election must be filed by electronic transmission in a format prescribed by the commissioner.\nThe commissioner must notify each nonprofit organization by mail or electronic transmission of any determination of its status as an employer with covered employment and of the effective date of any election or termination of election. The determination is final unless an appeal is filed within 45 calendar days of sending the determination. Proceedings on the appeal are conducted in accordance with section 268.105.\n(a) Reimbursements, in the amount of unemployment benefits charged to the reimbursable account, during a calendar quarter, must be received by the department on or before the last day of the month following the month that the notice of unemployment benefits paid is sent under section 268.047, subdivision 5.\n(b) Past due reimbursements are subject to the same interest charges and collection procedures that apply to past due taxes.\n(c) If any nonprofit organization is delinquent in making reimbursements, the commissioner may terminate the organization's election to make reimbursements as of the beginning of the next calendar year, and the termination is effective for that and the following calendar year. A nonprofit organization that has its election terminated under this paragraph must be assigned the new employer tax rate under section 268.051, subdivision 5, until the organization qualifies for an experience rating under section 268.051, subdivision 3.\nFor purposes of this section, a nonprofit organization is an organization, or group of organizations, described in United States Code, title 26, section 501(c)(3) of the Internal Revenue Code that is exempt from income tax under section 501(a).\nThe compromise authority set out in section 268.067 applies to this section.",
	"repealed": false
}