{
	"id": "383B.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.255",
	"title": "383B.255 PUBLIC SAFETY COMMUNICATIONS.",
	"text": "Hennepin County may establish and rent, lease, construct, equip, and maintain a radio broadcasting station or stations, with land-fixed repeater stations and other necessary communication equipment, to be used for public safety communications. It may acquire land by gift, purchase, lease, or condemnation for use as a site for public safety communications equipment. Public safety communications sites may be acquired by lease for a period of up to 25 years in duration. Public safety communications may include police, fire, highway maintenance, emergency medical service, local government, forestry conservation, and other communications as determined by the county board.\nUse of county-owned radio towers, building rooftops, lands, rights-of-way, and easements may be made available to commercial wireless service providers for the purpose of installing antennas and equipment necessary for construction of the national wireless telecommunications infrastructure. Hennepin county may acquire site use fees, or by gift or other means, improvements to public safety communications facilities, or other personal property, as compensation for antenna site use. Antenna site use agreements may be entered into by any means available and in the manner determined by the county board, with or without advertisement for bids.\nThe public safety communications system shall be under the direction of the sheriff. Public safety communications policies may be established by the board of county commissioners.\nPublic safety communications services may be extended to any statutory or home rule charter city within the county, and to any adjoining county or statutory or home rule charter city in an adjoining county, upon the written request of its governing body to the Hennepin County board. All the communications equipment used in connection with the extended service shall, unless otherwise provided by the Hennepin County board, be owned, maintained, and serviced by Hennepin County. The board with the advice of the sheriff may establish a charge for extended public safety communications services pursuant to section 383B.118.\nThe sheriff shall broadcast all public safety dispatches and reports which, in the sheriff's opinion, relate to public safety communications.",
	"repealed": false
}