{
	"id": "157.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/157.15",
	"title": "157.15 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 157.011 and 157.15 to 157.22.\n[Repealed, 1996 c 451 art 4 s 71]\n\"Commissioner\" means the commissioner of health.\n\"Boarding establishment\" means a food and beverage service establishment where food or beverages, or both, are furnished to five or more regular boarders, whether with or without sleeping accommodations, for periods of one week or more.\n\"Food and beverage service establishment\" means a building, structure, enclosure, or any part of a building, structure, or enclosure used as, maintained as, advertised as, or held out to be an operation that prepares, serves, or otherwise provides food or beverages, or both, for human consumption.\n\"Food cart\" means a food and beverage service establishment that is a nonmotorized vehicle self-propelled by the operator.\n\"Hotel or motel\" means a building, structure, enclosure, or any part thereof used as, maintained as, advertised as, or held out to be a place where sleeping accommodations are furnished to the public and furnishing accommodations for periods of less than one week.\n\"Limited food establishment\" means a food and beverage service establishment that primarily provides beverages that consist of combining dry mixes and water or ice for immediate service to the consumer. Limited food establishments must use equipment and utensils that are nontoxic, durable, and retain their characteristic qualities under normal use conditions and may request a variance for plumbing requirements from the commissioner.\n\"Lodging establishment\" means: (1) a building, structure, enclosure, or any part thereof used as, maintained as, advertised as, or held out to be a place where sleeping accommodations are furnished to the public as regular roomers, for periods of one week or more, and having five or more beds to let to the public; or (2) a building, structure, or enclosure or any part thereof located within ten miles distance from a hospital or medical center and maintained as, advertised as, or held out to be a place where sleeping accommodations are furnished exclusively to patients, their families, and caregivers while the patient is receiving or waiting to receive health care treatments or procedures for periods of one week or more, and where no supportive services, as defined under section 157.17, subdivision 1, paragraph (a), or health supervision services, as defined under section 157.17, subdivision 1, paragraph (b), or home care services, as defined under section 144A.471, subdivisions 6 and 7, are provided.\n\"Mobile food unit\" means a food and beverage service establishment that is a vehicle mounted unit, either:\n(1) motorized or trailered, operating no more than 21 days annually at any one place, or operating more than 21 days annually at any one place with the approval of the regulatory authority as defined in Minnesota Rules, part 4626.0020, subpart 70; or\n(2) operated in conjunction with a permanent business licensed under this chapter or chapter 28A at the site of the permanent business by the same individual or company, and readily movable, without disassembling, for transport to another location.\n\"Person\" has the meaning given in section 103I.005, subdivision 16.\n\"Resort\" means a building, structure, enclosure, or any part thereof located on, or on property neighboring, any lake, stream, skiing or hunting area, or any recreational area for purposes of providing convenient access thereto, kept, used, maintained, or advertised as, or held out to the public to be a place where sleeping accommodations are furnished to the public, and primarily to those seeking recreation for periods of one day, one week, or longer, and having for rent five or more cottages, rooms, or enclosures.\n\"Restaurant\" means a food and beverage service establishment, whether the establishment serves alcoholic or nonalcoholic beverages, which operates from a location for more than 21 days annually. Restaurant does not include a food cart or a mobile food unit.\n\"Seasonal permanent food stand\" means a food and beverage service establishment which is a permanent food service stand or building, but which operates no more than 21 days annually.\n\"School concession stand\" means a food and beverage service establishment located in a school, on school grounds, or within a school-owned athletic complex, that is operated in conjunction with school-sponsored events. A school kitchen or school cafeteria is not a school concession stand.\n(a) \"Seasonal temporary food stand\" means a food and beverage service establishment that is a food stand which is disassembled and moved from location to location, but which operates for no more than 21 days annually at any one location, except as provided in paragraph (b).\n(b) A seasonal temporary food stand may operate for more than 21 days annually at any one place with the approval of the regulatory authority, as defined in Minnesota Rules, part 4626.0020, subpart 70, that has jurisdiction over the seasonal temporary food stand.\n\"Special event food stand\" means a food and beverage service establishment which is used in conjunction with celebrations and special events, and which operates for no more than ten total days within the applicable license period.\n[Repealed, 1998 c 407 art 2 s 109]\n\"Critical control point\" means a point or procedure in a specific food system where loss of control may result in an unacceptable health risk.\n\"Hazard analysis critical control point (HACCP) plan\" means a written document that delineates the formal procedures for following the HACCP principles developed by the National Advisory Committee on Microbiological Criteria for Foods.\n\"Hazard\" means any biological, chemical, or physical property that may cause an unacceptable consumer health risk.\n\"Statewide hospitality fee\" means a fee to fund statewide food, beverage, and lodging program development activities, including training for inspection staff, technical assistance, maintenance of a statewide integrated food safety and security information system, and other related statewide activities that support the food, beverage, and lodging program activities.\n\"Youth camp\" has the meaning given in section 144.71, subdivision 2.",
	"repealed": false
}