{
	"id": "609.133",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.133",
	"title": "609.133 SENTENCE ADJUSTMENT.",
	"text": "As used in this section:\n(1) \"prosecutor\" means the attorney general, county attorney, or city attorney responsible for the prosecution of individuals charged with a crime; and\n(2) \"victim\" has the meaning given in section 611A.01.\nThe prosecutor for the jurisdiction responsible for the prosecution of an individual convicted of a crime may commence a proceeding to adjust the sentence of that individual at any time after the initial sentencing provided the prosecutor does not seek to increase the period of confinement or, if the individual is serving a stayed sentence, increase the period of supervision.\n(a) A prosecutor may review individual cases at the prosecutor's discretion.\n(b) Prior to filing a petition under this section, a prosecutor shall make a reasonable and good faith effort to seek input from any identifiable victim and shall consider the impact an adjusted sentence would have on the victim.\n(c) The commissioner of corrections, a supervising agent, or an offender may request that a prosecutor review an individual case. A prosecutor is not required to respond to a request. Inaction by a prosecutor shall not be considered by any court as grounds for an offender, a supervising agent, or the commissioner of corrections to petition for a sentence adjustment under this section or for a court to adjust a sentence without a petition.\n(a) A prosecutor's petition for sentence adjustment shall be filed in the district court where the individual was convicted and include the following:\n(1) the full name of the individual on whose behalf the petition is being brought and, to the extent possible, all other legal names or aliases by which the individual has been known at any time;\n(2) the individual's date of birth;\n(3) the individual's address;\n(4) a brief statement of the reason the prosecutor is seeking a sentence adjustment for the individual;\n(5) the details of the offense for which an adjustment is sought, including:\n(i) the date and jurisdiction of the occurrence;\n(ii) either the names of any victims or that there were no identifiable victims;\n(iii) whether there is a current order for protection, restraining order, or other no contact order prohibiting the individual from contacting the victims or whether there has ever been a prior order for protection or restraining order prohibiting the individual from contacting the victims;\n(iv) the court file number; and\n(v) the date of conviction;\n(6) what steps the individual has taken since the time of the offense toward personal rehabilitation, including treatment, work, good conduct within correctional facilities, or other personal history that demonstrates rehabilitation;\n(7) the individual's criminal conviction record indicating all convictions for misdemeanors, gross misdemeanors, or felonies in this state, and for all comparable convictions in any other state, federal court, or foreign country, whether the convictions occurred before or after the conviction for which an adjustment is sought;\n(8) the individual's criminal charges record indicating all prior and pending criminal charges against the individual in this state or another jurisdiction, including all criminal charges that have been continued for dismissal, stayed for adjudication, or were the subject of pretrial diversion; and\n(9) to the extent known, all prior requests by the individual, whether for the present offense or for any other offenses in this state or any other state or federal court, for pardon, return of arrest records, or expungement or sealing of a criminal record, whether granted or not, and all stays of adjudication or imposition of sentence involving the petitioner.\n(b) The filing fee for a petition brought under this section shall be waived.\n(c) Notwithstanding chapter 13 or any other statute related to the classification of government data, a supervising agent or the commissioner of corrections may provide private or confidential data to a prosecutor for purposes of a petition for sentence adjustment.\n(a) The prosecutor shall serve the petition for sentence adjustment on the individual on whose behalf the petition is being brought.\n(b) The prosecutor shall make a good faith and reasonable effort to notify any person determined to be a victim of the offense for which adjustment is sought of the existence of a petition. Notification under this paragraph does not constitute a violation of an existing order for protection, restraining order, or other no contact order.\n(c) Notice to victims of the offense under this subdivision must:\n(1) specifically inform the victim of the right to object, orally or in writing, to the proposed adjustment of sentence; and\n(2) inform the victims of the right to be present and to submit an oral or written statement at the hearing described in subdivision 6.\n(d) If a victim notifies the prosecutor of an objection to the proposed adjustment of sentence and is not present when the court considers the sentence adjustment, the prosecutor shall make these objections known to the court.\n(a) The court shall hold a hearing on the petition no sooner than 60 days after service of the petition. The hearing shall be scheduled so that the parties have adequate time to prepare and present arguments regarding the issue of sentence adjustment. The parties may submit written arguments to the court prior to the date of the hearing and may make oral arguments before the court at the hearing. The individual on whose behalf the petition has been brought must be present at the hearing, unless excused under Minnesota Rules of Criminal Procedure, rule 26.03, subdivision 1, clause (3).\n(b) A victim of the offense for which sentence adjustment is sought has a right to submit an oral or written statement to the court at the time of the hearing describing the harm suffered by the victim as a result of the crime and the victim's recommendation on whether adjustment should be granted or denied. The judge shall consider the victim's statement when making a decision.\n(c) Representatives of the Department of Corrections, supervising agents, community treatment providers, and any other individual with relevant information may submit an oral or written statement to the court at the time of the hearing.\n(a) The court shall determine whether there are substantial and compelling reasons to adjust the individual's sentence. In making this determination, the court shall consider what impact, if any, a sentence adjustment would have on public safety, including whether an adjustment would promote the rehabilitation of the individual, properly reflect the severity of the underlying offense, or reduce sentencing disparities. In making this determination, the court may consider factors relating to both the offender and the offense, including but not limited to:\n(1) the presentence investigation report used at sentencing, if available;\n(2) the individual's performance on probation or supervision;\n(3) the individual's disciplinary record during any period of incarceration;\n(4) records of any rehabilitation efforts made by the individual since the date of offense and any plan to continue those efforts in the community;\n(5) evidence that remorse, age, diminished physical condition, or any other factor has significantly reduced the likelihood that the individual will commit a future offense;\n(6) the amount of time the individual has served in custody or under supervision; and\n(7) significant changes in law or sentencing practice since the date of offense.\n(b) Notwithstanding any law to the contrary, if the court determines by a preponderance of the evidence that there are substantial and compelling reasons to adjust the individual's sentence, the court may modify the sentence in any way provided the adjustment does not:\n(1) increase the period of confinement or, if the individual is serving a stayed sentence, increase the period of supervision;\n(2) reduce or eliminate the amount of court-ordered restitution; or\n(3) reduce or eliminate a term of conditional release required by law when a court commits an offender to the custody of the commissioner of corrections.\nThe court may stay imposition or execution of sentence pursuant to section 609.135.\n(c) A sentence adjustment is not a valid basis to vacate the judgment of conviction, enter a judgment of conviction for a different offense, or impose sentence for any other offense.\n(d) The court shall state in writing or on the record the reasons for its decision on the petition. If the court grants a sentence adjustment, the court shall provide the information in section 244.09, subdivision 15, to the Sentencing Guidelines Commission.\nAn order issued under this section shall not be considered a final judgment, but shall be treated as an order imposing or staying a sentence.",
	"repealed": false
}