{
	"id": "245I.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.02",
	"title": "245I.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms in this section have the meanings given.\n\"Approval\" means the documented review of, opportunity to request changes to, and agreement with a treatment document. An individual may demonstrate approval with a written signature, secure electronic signature, or documented oral approval.\n\"Behavioral sciences or related fields\" means an education from an accredited college or university in social work, psychology, sociology, community counseling, family social science, child development, child psychology, community mental health, addiction counseling, counseling and guidance, special education, nursing, and other similar fields approved by the commissioner.\n\"Business day\" means a weekday on which government offices are open for business. Business day does not include state or federal holidays, Saturdays, or Sundays.\n\"Case manager\" means a client's case manager according to section 256B.0621; 256B.0625, subdivision 20; 256B.092, subdivision 1a; 256B.0924; 256B.093, subdivision 3a; 256B.094; or 256B.49.\n\"Certified rehabilitation specialist\" means a staff person who meets the qualifications of section 245I.04, subdivision 8.\n\"Child\" means a client under the age of 18.\n\"Client\" means a person who is seeking or receiving services regulated by this chapter. For the purpose of a client's consent to services, client includes a parent, guardian, or other individual legally authorized to consent on behalf of a client to services.\n\"Clinical trainee\" means a staff person who is qualified according to section 245I.04, subdivision 6.\n\"Commissioner\" means the commissioner of human services or the commissioner's designee.\n\"Co-occurring substance use disorder treatment\" means the treatment of a person who has a co-occurring mental illness and substance use disorder. Co-occurring substance use disorder treatment is characterized by stage-wise comprehensive treatment, treatment goal setting, and flexibility for clients at each stage of treatment. Co-occurring substance use disorder treatment includes assessing and tracking each client's stage of change readiness and treatment using a treatment approach based on a client's stage of change, such as motivational interviewing when working with a client at an earlier stage of change readiness and a cognitive behavioral approach and relapse prevention to work with a client at a later stage of change; and facilitating a client's access to community supports.\n\"Crisis plan\" means a plan to prevent and de-escalate a client's future crisis situation, with the goal of preventing future crises for the client and the client's family and other natural supports. Crisis plan includes a crisis plan developed according to section 245.4871, subdivision 9a.\n\"Critical incident\" means an occurrence involving a client that requires a license holder to respond in a manner that is not part of the license holder's ordinary daily routine. Critical incident includes a client's suicide, attempted suicide, or homicide; a client's death; an injury to a client or other person that is life-threatening or requires medical treatment; a fire that requires a fire department's response; alleged maltreatment of a client; an assault of a client; an assault by a client; or other situation that requires a response by law enforcement, the fire department, an ambulance, or another emergency response provider.\n\"Diagnostic assessment\" means the evaluation and report of a client's potential diagnoses that a mental health professional or clinical trainee completes under section 245I.10, subdivisions 4 to 6.\n\"Direct contact\" has the meaning given in section 245C.02, subdivision 11.\n\"Family and other natural supports\" means the people whom a client identifies as having a high degree of importance to the client. Family and other natural supports also means people that the client identifies as being important to the client's mental health treatment, regardless of whether the person is related to the client or lives in the same household as the client.\n\"Functional assessment\" means the assessment of a client's current level of functioning relative to functioning that is appropriate for someone the client's age.\n\"Individual abuse prevention plan\" means a plan according to section 245A.65, subdivision 2, paragraph (b), and section 626.557, subdivision 14.\n\"Level of care assessment\" means the level of care decision support tool appropriate to the client's age.\n\"License\" has the meaning given in section 245A.02, subdivision 8.\n\"License holder\" has the meaning given in section 245A.02, subdivision 9.\n\"Licensed prescriber\" means an individual who is authorized to prescribe legend drugs under section 151.37.\n\"Mental health behavioral aide\" means a staff person who is qualified under section 245I.04, subdivision 16.\n\"Mental health certified family peer specialist\" means a staff person who is qualified under section 245I.04, subdivision 12.\n\"Mental health certified peer specialist\" means a staff person who is qualified under section 245I.04, subdivision 10.\n\"Mental health practitioner\" means a staff person who is qualified under section 245I.04, subdivision 4.\n\"Mental health professional\" means a staff person who is qualified under section 245I.04, subdivision 2.\n\"Mental health rehabilitation worker\" means a staff person who is qualified under section 245I.04, subdivision 14.\n\"Mental illness\" means any of the conditions included in the most recent editions of the DC: 0-5 Diagnostic Classification of Mental Health and Development Disorders of Infancy and Early Childhood published by Zero to Three or the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association.\n\"Organization\" has the meaning given in section 245A.02, subdivision 10c.\n\"Personnel file\" means a set of records under section 245I.07, paragraph (a). Personnel files excludes information related to a person's employment that is not included in section 245I.07.\n\"Registered nurse\" means a staff person who is qualified under section 148.171, subdivision 20.\n\"Rehabilitative mental health services\" means mental health services provided to an adult client that enable the client to develop and achieve psychiatric stability, social competencies, personal and emotional adjustment, independent living skills, family roles, and community skills when symptoms of mental illness has impaired any of the client's abilities in these areas.\n\"Residential program\" has the meaning given in section 245A.02, subdivision 14.\n\"Signature\" means a written signature or an electronic signature defined in section 325L.02, paragraph (h).\n\"Staff person\" means an individual who works under a license holder's direction or under a contract with a license holder. Staff person includes an intern, consultant, contractor, individual who works part-time, and an individual who does not provide direct contact services to clients but does have physical access to clients. Staff person includes a volunteer who provides treatment services to a client or a volunteer whom the license holder regards as a staff person for the purpose of meeting staffing or service delivery requirements. A staff person must be 18 years of age or older.\n\"Strengths\" means a person's inner characteristics, virtues, external relationships, activities, and connections to resources that contribute to a client's resilience and core competencies. A person can build on strengths to support recovery.\n\"Trauma\" means an event, series of events, or set of circumstances that is experienced by an individual as physically or emotionally harmful or life-threatening that has lasting adverse effects on the individual's functioning and mental, physical, social, emotional, or spiritual well-being. Trauma includes group traumatic experiences. Group traumatic experiences are emotional or psychological harm that a group experiences. Group traumatic experiences can be transmitted across generations within a community and are often associated with racial and ethnic population groups who suffer major intergenerational losses.\n\"Treatment plan\" means services that a license holder formulates to respond to a client's needs and goals. A treatment plan includes individual treatment plans under section 245I.10, subdivisions 7 and 8; initial treatment plans under section 245I.23, subdivision 7; and crisis treatment plans under sections 245I.23, subdivision 8, and 256B.0624, subdivision 11.\n\"Treatment supervision\" means a mental health professional's or certified rehabilitation specialist's oversight, direction, and evaluation of a staff person providing services to a client according to section 245I.06.\n\"Volunteer\" means an individual who, under the direction of the license holder, provides services to or facilitates an activity for a client without compensation.",
	"repealed": false
}