{
	"id": "424A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.01",
	"title": "424A.01 MEMBERSHIP IN A FIREFIGHTERS RELIEF ASSOCIATION.",
	"text": "(a) A firefighter or any volunteer emergency medical personnel is eligible for membership in a firefighters relief association if the firefighter or volunteer emergency medical personnel satisfies the requirements of paragraph (b) or (c), as applicable, and is not otherwise prohibited from membership under this chapter.\n(b) To be eligible for membership in a relief association, a firefighter must be a member of the fire department and:\n(1) provide services as a volunteer firefighter or as a paid on-call firefighter, although the firefighter need not exclusively provide services as either a volunteer firefighter or a paid on-call firefighter;\n(2) be engaged in providing emergency response services or delivering fire education or prevention services as a member of a fire department;\n(3) be trained in or qualified to provide fire suppression duties or to provide fire prevention duties; and\n(4) meet any other minimum firefighter and service standards established by the fire department or specified in the articles of incorporation or bylaws of the firefighters relief association.\n(c) A volunteer emergency medical personnel is eligible to be a member of the firefighters relief association and to qualify for a service pension or other benefit coverage of the relief association on the same basis as fire department personnel who perform or supervise fire suppression or fire prevention duties if:\n(1) the fire department employs or otherwise uses the services of the person solely as volunteer emergency medical personnel to perform emergency medical response duties or supervise emergency medical response activities;\n(2) the bylaws of the firefighters relief association authorize the volunteer emergency medical personnel's eligibility; and\n(3) the volunteer emergency medical personnel's eligibility is approved by:\n(i) the municipality, if the fire department is a municipal department;\n(ii) the joint powers board, if the fire department is a joint powers entity; or\n(iii) the contracting municipality or municipalities, if the fire department is an independent nonprofit firefighting corporation.\n(d) Minors are prohibited from membership in a firefighters relief association.\nNo person who is serving as a substitute firefighter may be considered to be a firefighter for purposes of chapter 477B or this chapter and no substitute firefighter is authorized to be a member of any firefighters relief association governed by chapter 477B or this chapter.\nNo person who is serving as a firefighter in a fire department but who is not a member of the applicable firefighters relief association is entitled to any service pension or ancillary benefits from the relief association.\n[Repealed, 1989 c 319 art 10 s 8]\nThe board of trustees of every relief association may exclude from membership in the relief association all applicants who, due to some medically determinable physical or mental impairment or condition, is determined to constitute a predictable and unwarranted risk of imposing liability for an ancillary benefit at any age earlier than the minimum age specified for receipt of a service pension. Notwithstanding any provision of section 363A.25, it is a good and valid defense to a complaint or action brought under chapter 363A that the board of trustees of the relief association made a good faith determination that the applicant suffers from an impairment or condition constituting a predictable and unwarranted risk for the relief association if the determination was made following consideration of: (1) the person's medical history; and (2) the report of the physician completing a physical examination of the applicant undertaken at the expense of the relief association.\nNo firefighter may be credited with service credit in a firefighters relief association for the same hours of service for which coverage is already provided in a fund operated pursuant to chapter 353.\n(a) If the applicable municipality or municipalities approve, the fire department may employ or otherwise utilize the services of persons as firefighters to perform fire prevention duties and to supervise fire prevention activities.\n(b) Volunteer firefighters and paid on-call firefighters serving in fire prevention positions are eligible to be members of the applicable firefighters relief association and to qualify for service pension or other benefit coverage of the relief association on the same basis as fire department personnel who perform fire suppression duties.\n(c) Volunteer firefighters and paid on-call firefighters serving in fire prevention positions also are eligible to receive any other benefits under the applicable law or practice for services on the same basis as personnel who are employed to perform fire suppression duties.\nMS 2022 [Repealed, 2024 c 102 art 2 s 32]\n[See Note.]\n(a) This subdivision governs the service pension calculation requirements of a firefighter who returns to active service after a break in service and applies to all breaks in service, except that the resumption service requirements of this subdivision do not apply to leaves of absence made available by federal statute, such as the Family Medical Leave Act, United States Code, title 29, section 2691, and the Uniformed Services Employment and Reemployment Rights Act, United States Code, title 38, section 4301, and do not apply to leaves of absence made available by state statute, such as the Parental Leave Act, section 181.941; the Leave for Organ Donation Act, section 181.9456; the Leave for Civil Air Patrol Service Act, section 181.946; the Leave for Immediate Family Members of Military Personnel Injured or Killed in Active Service Act, section 181.947; or the Protection of Jurors' Employment Act, section 593.50.\n(b)(1) If a firefighter who has a break in service of any duration resumes performing active firefighting with the fire department associated with the relief association, and if the bylaws of the relief association so permit, the firefighter may again become an active member of the relief association, subject to the requirements of this paragraph and the service pension calculation requirements under this section.\n(2) A firefighter who has been paid a service pension or disability benefit must wait at least 60 days following receipt of the pension or benefit before resuming active firefighting with the fire department and active membership in the relief association.\n(3) A firefighter who has been granted an approved leave of absence not exceeding one year by the fire department or by the relief association is exempt from the minimum period of resumption service requirement of this section.\n(4) A person who has a break in service not exceeding one year but has not been granted an approved leave of absence may be made exempt from the minimum period of resumption service requirement of this section by the relief association bylaws.\n(5) If the bylaws so provide, a firefighter who returns to active relief association membership after a break in service of any duration may continue to collect a monthly service pension from the relief association, notwithstanding the requirement under section 424A.02, subdivision 1, that the firefighter has separated from active service.\n(c) If a former firefighter who has been paid a service pension or disability benefit returns to active relief association membership under paragraph (b), the firefighter may qualify for the receipt of a service pension from the relief association for the resumption service period if the firefighter meets the service requirements of section 424A.016, subdivision 3, or 424A.02, subdivision 2, as applicable, or meets the resumption minimum service requirements specified in the relief association's bylaws. No firefighter may be paid a service pension more than once for the same period of service.\n(d) If a former firefighter who has not been paid a service pension or disability benefit returns to active relief association membership under paragraph (b), the firefighter may qualify for the receipt of a service pension from the relief association for the original and resumption service periods if the firefighter meets the service requirements of section 424A.016, subdivision 3, or 424A.02, subdivision 2, based on the original and resumption years of service credit.\n(e) A firefighter who returns to active lump-sum relief association membership under paragraph (b) and who qualifies for a service pension under paragraph (c) must have, upon a subsequent cessation of duties, any service pension for the resumption service period calculated as a separate benefit. If a lump-sum service pension had been paid to the firefighter upon the firefighter's previous cessation of duties, a second lump-sum service pension for the resumption service period must be calculated by applying the service pension amount in effect on the date of the firefighter's termination of the resumption service for all years of the resumption service.\n(f) A firefighter who had not been paid a lump-sum service pension returns to active relief association membership under paragraph (b), who did not meet the minimum period of resumption service requirement specified in the relief association's bylaws, but who does meet the minimum service requirement of section 424A.02, subdivision 2, based on the firefighter's original and resumption years of active service, must have, upon a subsequent cessation of duties, a service pension for the original and resumption service periods calculated by applying the service pension amount in effect on the date of the firefighter's termination of the resumption service, or, if the bylaws so provide, based on the service pension amount in effect on the date of the firefighter's previous cessation of duties. The service pension for a firefighter who returns to active lump-sum relief association membership under this paragraph, but who had met the minimum period of resumption service requirement specified in the relief association's bylaws, must be calculated by applying the service pension amount in effect on the date of the firefighter's termination of the resumption service.\n(g) If a firefighter receiving a monthly benefit service pension returns to active monthly benefit relief association membership under paragraph (b), and if the relief association bylaws do not allow for the firefighter to continue collecting a monthly service pension, any monthly benefit service pension payable to the firefighter is suspended as of the first day of the month next following the date on which the firefighter returns to active membership. If the firefighter was receiving a monthly benefit service pension, and qualifies for a service pension under paragraph (c), the firefighter is entitled to an additional monthly benefit service pension upon a subsequent cessation of duties calculated based on the resumption service credit and the service pension accrual amount in effect on the date of the termination of the resumption service. A suspended initial service pension resumes as of the first of the month next following the termination of the resumption service. If the firefighter was not receiving a monthly benefit service pension and meets the minimum service requirement of section 424A.02, subdivision 2, a service pension must be calculated by applying the service pension amount in effect on the date of the firefighter's termination of the resumption service for all years of service credit.\n(h) A firefighter who was not receiving a monthly benefit service pension returns to active relief association membership under paragraph (b), who did not meet the minimum period of resumption service requirement specified in the relief association's bylaws, but who does meet the minimum service requirement of section 424A.02, subdivision 2, based on the firefighter's original and resumption years of active service, must have, upon a subsequent cessation of duties, a service pension for the original and resumption service periods calculated by applying the service pension amount in effect on the date of the firefighter's termination of the resumption service, or, if the bylaws so provide, based on the service pension amount in effect on the date of the firefighter's previous cessation of duties. The service pension for a firefighter who returns to active relief association membership under this paragraph, but who had met the minimum period of resumption service requirement specified in the relief association's bylaws, must be calculated by applying the service pension amount in effect on the date of the firefighter's termination of the resumption service.\n(i) For defined contribution plans, a firefighter who returns to active relief association membership under paragraph (b) and who qualifies for a service pension under paragraph (c) or (d) must have, upon a subsequent cessation of duties, any service pension for the resumption service period calculated as a separate benefit. If a service pension had been paid to the firefighter upon the firefighter's previous cessation of duties, and if the firefighter meets the minimum service requirement of section 424A.016, subdivision 3, or meets the resumption minimum service requirements specified in the relief association's bylaws, as applicable, based on the resumption years of service, a second service pension for the resumption service period must be calculated to include allocations credited to the firefighter's individual account during the resumption period of service and deductions for administrative expenses, if applicable.\n(j) For defined contribution plans, if a firefighter who had not been paid a service pension returns to active relief association membership under paragraph (b), and who meets the minimum service requirement of section 424A.016, subdivision 3, based on the firefighter's original and resumption years of service, must have, upon a subsequent cessation of duties, a service pension for the original and resumption service periods calculated to include allocations credited to the firefighter's individual account during the original and resumption periods of service and deductions for administrative expenses, if applicable, less any amounts previously forfeited under section 424A.016, subdivision 4.",
	"repealed": false
}