{
	"id": "169.824",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.824",
	"title": "169.824 GROSS WEIGHT SCHEDULE.",
	"text": "(a) No vehicle or combination of vehicles equipped with pneumatic tires shall be operated upon the highways of this state where the total gross weight on any group of two or more consecutive axles of any vehicle or combination of vehicles exceeds that given in the following axle weight limits table for the distance between the centers of the first and last axles of any group of two or more consecutive axles under consideration. Unless otherwise noted, the distance between axles must be measured longitudinally to the nearest even foot, and when the measurement is a fraction of exactly one-half foot the next largest whole number in feet shall be used, except that when the distance between axles is more than three feet four inches and less than three feet six inches the distance of four feet shall be used.\n(b) The maximum gross weight on a group of three consecutive axles, where the distance between centers of foremost and rearmost axles of any axle group is seven feet or eight feet, is 34,000 pounds, except for vehicles manufactured before August 1, 1991. Notwithstanding any lesser weight shown in the axle weight limits table, for vehicles manufactured before August 1, 1991:\n(1) the maximum gross weight on a group of three consecutive axles, where the distance between centers of foremost and rearmost axles of any axle group is seven feet, is 37,000 pounds; and\n(2) the maximum gross weight on a group of three consecutive axles, where the distance between centers of foremost and rearmost axles of any axle group is eight feet, is 38,500 pounds.\n(c) \"8 plus\" refers to any distance greater than eight feet but less than nine feet.\n(d) The gross weights shown without parentheses in the axle weight limits table are allowed on unpaved streets and highways, unless posted to a lesser weight under section 169.87, subdivision 1. The gross weights shown in this table, whether within or without parentheses, are allowed on paved streets and highways, unless posted to a lesser weight under section 169.87, subdivision 1. Gross weights in excess of 80,000 pounds require an overweight permit under this chapter, unless otherwise allowed under section 169.826.\n(e) Notwithstanding any lesser weight shown in the axle weight limits table, but subject to the restrictions on gross vehicle weights in subdivision 2, clauses (1) and (2), two consecutive sets of tandem axles may carry a gross load of 34,000 pounds each and a combined gross load of 68,000 pounds provided the overall distance between the first and last axles of the consecutive sets of tandem axles is 36 feet or more.\nThe gross vehicle weight of all axles of a vehicle or combination of vehicles must not exceed:\n(1) 80,000 pounds for any vehicle or combination of vehicles on all streets and highways, unless posted at a lower axle weight under section 169.87, subdivision 1; and\n(2) 88,000 pounds for any vehicle or combination of vehicles with six or more axles while exclusively engaged in hauling livestock on all state trunk highways other than interstate highways, if the vehicle has a permit under section 169.86, subdivision 5, paragraph (j).\n(a) Notwithstanding the maximum weight provisions of this section, the maximum gross vehicle weight limits and the axle weight limits for any motor vehicle subject to sections 169.80 to 169.88 that is equipped with idle-reduction technology or emissions-reduction technology are increased by the amount of weight necessary to compensate for the weight of the idle-reduction technology or emissions-reduction technology, not to exceed 550 pounds.\n(b) Notwithstanding the maximum weight provisions of this section, the maximum gross vehicle weight limits and the axle weight limits for any motor vehicle that is a natural gas vehicle and subject to sections 169.80 to 169.88 are increased by the amount of weight calculated as provided under United States Code, title 23, section 127(s), not to exceed 2,000 pounds.\n(c) The weight limit increases under paragraphs (a) and (b) are cumulative.\n(d) At the request of an authorized representative of the Department of Transportation or the Department of Public Safety, the vehicle operator must provide proof through documentation or demonstration that the vehicle meets the requirements of this subdivision.",
	"repealed": false
}