{
	"id": "62E.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.10",
	"title": "62E.10 COMPREHENSIVE HEALTH ASSOCIATION.",
	"text": "There is established a Comprehensive Health Association to promote the public health and welfare of the state of Minnesota with membership consisting of all insurers; self-insurers; fraternals; joint self-insurance plans regulated under chapter 62H; the Minnesota employees insurance program established in section 43A.317, effective July 1, 1993; health maintenance organizations; and community integrated service networks licensed or authorized to do business in this state. The Comprehensive Health Association is exempt from the taxes imposed under chapter 297I and any other laws of this state and all property owned by the association is exempt from taxation.\nThe board of directors of the association shall be made up of 13 members as follows: six directors selected by contributing members, subject to approval by the commissioner, one of which must be a health actuary; two directors selected by the commissioner of human services, one of whom must represent hospitals and one of whom must represent health care providers; five public directors selected by the commissioner, at least two of whom must be enrollees in the individual market and one of whom must be a licensed insurance agent. At least two of the public directors must reside outside of the seven-county metropolitan area. In determining voting rights at members' meetings, each member shall be entitled to vote in person or proxy. In approving directors of the board, the commissioner shall consider, among other things, whether all types of members are fairly represented. Directors selected by contributing members may be reimbursed from the money of the association for expenses incurred by them as directors, but shall not otherwise be compensated by the association for their services.\nA person may appeal to the commissioner within 30 days after notice of an action, ruling, or decision by the board.\nA final action or order of the commissioner under this subdivision is subject to judicial review in the manner provided by chapter 14.\nIn lieu of the appeal to the commissioner, a person may seek judicial review of the board's action.\nAll members shall maintain their membership in the association as a condition of doing accident and health insurance, self-insurance, health maintenance organization, or community integrated service network business in this state. The association shall submit its articles, bylaws and operating rules to the commissioner for approval; provided that the adoption and amendment of articles, bylaws and operating rules by the association and the approval by the commissioner thereof shall be exempt from the provisions of sections 14.001 to 14.69.\nAll meetings of the association, its board, and any committees of the association shall comply with the provisions of chapter 13D, except that during any portion of a meeting during which an enrollee's appeal of an action of the writing carrier is being heard, that portion of the meeting must be closed at the enrollee's request.\n[Repealed, 1979 c 272 s 11]\nIn the performance of their duties as members of the association, the members shall be exempt from the provisions of sections 325D.49 to 325D.66.\nThe association may:\n(a) Exercise the powers granted to insurers under the laws of this state;\n(b) Sue or be sued;\n(c) Enter into contracts with insurers, similar associations in other states or with other persons for the performance of administrative functions including the functions provided for in clauses (e) and (f);\n(d) Establish administrative and accounting procedures for the operation of the association;\n(e) Provide for the reinsuring of risks incurred as a result of issuing the coverages required by section 62E.04 by members of the association. Each member which elects to reinsure its required risks shall determine the categories of coverage it elects to reinsure in the association. The categories of coverage are:\n(1) individual qualified plans, excluding group conversions;\n(2) group conversions;\n(3) group qualified plans with fewer than 50 employees or members; and\n(4) major medical coverage.\nA separate election may be made for each category of coverage. If a member elects to reinsure the risks of a category of coverage, it must reinsure the risk of the coverage of every life covered under every policy issued in that category. A member electing to reinsure risks of a category of coverage shall enter into a contract with the association establishing a reinsurance plan for the risks. This contract may include provision for the pooling of members' risks reinsured through the association and it may provide for assessment of each member reinsuring risks for losses and operating and administrative expenses incurred, or estimated to be incurred in the operation of the reinsurance plan. This reinsurance plan shall be approved by the commissioner before it is effective. Members electing to administer the risks which are reinsured in the association shall comply with the benefit determination guidelines and accounting procedures established by the association. The fee charged by the association for the reinsurance of risks shall not be less than 110 percent of the total anticipated expenses incurred by the association for the reinsurance; and\n(f) Provide for the administration by the association of policies which are reinsured pursuant to clause (e). Each member electing to reinsure one or more categories of coverage in the association may elect to have the association administer the categories of coverage on the member's behalf. If a member elects to have the association administer the categories of coverage, it must do so for every life covered under every policy issued in that category. The fee for the administration shall not be less than 110 percent of the total anticipated expenses incurred by the association for the administration.\nThe association is exempt from the Administrative Procedure Act but, to the extent authorized by law to adopt rules, the association may use the provisions of section 14.386, paragraph (a), clauses (1) and (3). Section 14.386, paragraph (b), does not apply to these rules.\nThe association may petition the commissioner of commerce for a waiver to allow the experimental use of alternative means of health care delivery. The commissioner may approve the use of the alternative means the commissioner considers appropriate. The commissioner may waive any of the requirements of this chapter and chapters 60A, 62A, and 62D in granting the waiver. The commissioner may also grant to the association any additional powers as are necessary to facilitate the specific waiver, including the power to implement a provider payment schedule.\n(a) By July 1, 2001, the association shall investigate managed care delivery systems, and if cost effective, enter into contracts with third-party entities as provided in section 62E.101.\n(b) By July 1, 2001, the association shall establish a system to annually identify individuals insured by the Minnesota Comprehensive Health Association who may be eligible for private health care coverage, medical assistance, state drug programs, or other state or federal programs and notify them about their eligibility for these programs.\n(c) The association shall endeavor to reduce health care costs using additional methods consistent with effective patient care. At a minimum, by July 1, 2001, the association shall:\n(1) develop a focused chronic disease management and case management program;\n(2) develop a comprehensive program of preventive care; and\n(3) implement a total drug formulary program.\nThe association may establish an enrollee incentive based on enrollee participation in the chronic disease management and case management program developed under this section.",
	"repealed": false
}