{
	"id": "116J.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.79",
	"title": "116J.79 PREAPPLICATION CONFERENCES.",
	"text": "The bureau, at the request of any person, proceeding in accordance with this section, may conduct a preapplication conference, pending the formal submission of application forms, in which affected agencies shall participate to the extent practicable in order to clarify the nature and scope of their interest, to provide guidance regarding license application and review procedures, and to coordinate agency actions and data collection or submission regarding license application.\nIf, in the course of a preapplication conference, it becomes clear in the opinion of the director that a proposed business undertaking: (a) may require multiple licenses from the same or different state departments; (b) will take place in phases over an extended period of time; (c) will involve substantial expense for preparation of detailed plans, specifications and license applications; or (d) is of a new or unique nature, then each affected agency shall, at the request of the director to the extent practicable, provide the applicant with a written review and opinion as to all licenses which the agency would require for the proposed undertaking, the standards and conditions which would have to be met in order to obtain the licenses, timetables involved, and any properly related circumstances or findings.\nEach agency participating in the review and opinion process shall render the written opinion within a period not exceeding 60 days from the date fixed by the director. This period may be extended by the director at the request of an interested agency for the further consideration of information provided in accordance with this section. The director shall advise the person having requested the review and opinion of the extension, the reasons for it, and the revised period fixed by the director for rendering the written opinion. The person shall be entitled to confer with the bureau and with any agency having been granted an extension of time to ascertain what further information, if any, is required to facilitate the rendering of the review and opinion.\nA preapplication review and opinion shall not relieve the person from the responsibility of obtaining any required licenses and shall be contingent upon the submission of all detailed plans, specifications, and information required for license applications. An agency's written opinion as to required licenses shall remain in effect indefinitely for the proposed business undertaking, project, or activity as described in the applicant's submission. However, if new license requirements or related standards over which an agency has no control or discretion in establishing subsequently become effective, the new license requirements or standards shall not be considered to have been part of the preapplication review and opinion. The opinion of the agency may be modified or amended by the agency at any time and shall not prohibit the agency from requiring additional licenses as deemed necessary for the applicant.\nThe bureau shall promulgate rules for the procedures to be followed in the conduct of preapplication reviews and opinions.",
	"repealed": false
}