{
	"id": "240.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.02",
	"title": "240.02 RACING COMMISSION.",
	"text": "A Minnesota Racing Commission is established with the powers and duties specified in this section. The commission consists of nine members appointed by the governor with the advice and consent of the senate. Not more than five of the members may belong to the same political party. The governor shall designate the chair of the commission. Appointments by the governor are for terms of six years. An appointment to fill a vacancy in an unexpired term is for the remainder of the term and is with the advice and consent of the senate.\nA member of the commission must have been a resident of Minnesota for at least five years before appointment, and must have a background and experience as would qualify for membership on the commission. No commissioner, nor any member of the commissioner's immediate family residing in the same household, may hold a license issued by the commission or have a direct or indirect financial interest in a corporation, partnership, or association which holds a license issued by the commission.\nThe compensation of commission members for each day spent on commission activities, when authorized by the commission, shall be the same as compensation provided for other members of boards and commissions under section 15.0575, subdivision 3, plus expenses in the same manner and amount as provided in the commissioner's plan adopted according to section 43A.18, subdivision 2.\nThe removal of commission members is as provided in section 15.0575.\nThe commission may sue and be sued in its own name but no action may be brought against the commission or any of its members for actions taken in good faith in the performance of their duties. Suits and actions may be commenced against the commission or any of its members in any court of competent jurisdiction in this state by service, in the manner provided in Minnesota rules of court, of any summons, process, or pleadings authorized by the laws of this state. The attorney general is the legal counsel for the commission.\nThe commission shall on February 15 of each odd-numbered year submit a report to the governor and legislature on its activities, organizational structure, receipts and disbursements, including specific detail on the use of amounts statutorily appropriated to the commission under this chapter, and recommendations for changes in the laws relating to racing and pari-mutuel betting.\nThe legislative auditor shall audit or the commission may contract for an audit of the books and accounts of the commission annually or as often as the legislative auditor's funds and personnel permit. The commission shall pay the total cost of the audit. All collections received for the audits must be deposited in the general fund.",
	"repealed": false
}