{
	"id": "356.551",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.551",
	"title": "356.551 POST-JULY 1, 2004, PRIOR SERVICE CREDIT PURCHASE PAYMENT AMOUNT DETERMINATION PROCEDURE.",
	"text": "(a) Unless the prior service credit purchase authorization special law or general statute provision explicitly specifies a different purchase payment amount determination procedure, this section governs the determination of the prior service credit purchase payment amount of any prior service credit purchase.\n(b) The purchase payment amount determination procedure must recognize any service credit accrued to the purchaser in a pension plan enumerated in section 356.30, subdivision 3.\n(c) Any service credit in a Minnesota defined benefit public employee pension plan available to be reinstated by the purchaser through the repayment of a refund of member or employee contributions previously received must be repaid in full before any purchase of prior service credit payment is made under this section.\n(a) Unless the minimum purchase amount set forth in paragraph (c) applies, the prior service credit purchase amount is an amount equal to the actuarial present value, on the date of payment, as calculated by the chief administrative officer of the pension plan and reviewed by the actuary retained under section 356.214, of the amount of the additional retirement annuity obtained by the acquisition of the additional service credit in this section.\n(b) Calculation of this amount must be made using the investment return assumption applicable to the public pension plan specified in section 356.215, subdivision 8, and the mortality table adopted for the public pension plan.\n(1) Unless clause (2) applies, the calculation must assume continuous future service in the public pension plan until, and retirement at, the age at which the minimum requirements of the fund for normal retirement or retirement with an annuity unreduced for retirement at an early age, including section 356.30, are met with the additional service credit purchased. The calculation must also assume a full-time equivalent salary, or actual salary, whichever is greater, and a future salary history that includes annual salary increases at the applicable salary increase rate for the plan specified in section 356.215, subdivision 8.\n(2) This clause applies when the calculation is being done for purposes of section 352.272; 352B.087; 353.0141, subdivision 3; 354.544; 354A.0961; or 490.1211, subdivision 2. The calculation must include continuous future service in the public pension plan until, and retirement at, any age at or after which the minimum requirements of the fund for early retirement or retirement with an annuity unreduced for retirement at an early age, including section 356.30, are met with the additional service credit purchased. The calculation must be determined using the retirement age that provides the most valuable benefit to the member. The calculation must also assume a full-time equivalent salary, or actual salary, whichever is greater, and a future salary history that includes annual salary increases at the applicable salary increase rate for the plan specified in section 356.215, subdivision 8.\n(c) The prior service credit purchase amount may not be less than the amount determined by applying, for each year or fraction of a year being purchased, the sum of the employee contribution rate, the employer contribution rate, and the additional employer contribution rate, if any, applicable during that period, to the person's annual salary during that period, or fractional portion of a year's salary, if applicable, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, 3, 4, or 5, whichever applies, compounded annually, from the end of the year in which contributions would otherwise have been made to the date on which the payment is received.\n(d) Unless otherwise provided by statutes governing a specific plan, payment must be made in one lump sum within one year of the prior service credit authorization or prior to the member's effective date of retirement, whichever is earlier. Payment of the amount calculated under this section must be made by the applicable eligible person.\n(e) However, the current employer or the prior employer may, at its discretion, pay all or any portion of the payment amount that exceeds an amount equal to the employee contribution rates in effect during the period or periods of prior service applied to the actual salary rates in effect during the period or periods of prior service, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, 3, 4, or 5, whichever applies, compounded annually, from the date on which the contributions would otherwise have been made to the date on which the payment is made. If the employer agrees to payments under this subdivision, the purchaser must make the employee payments required under this subdivision within 90 days of the prior service credit authorization. If that employee payment is made, the employer payment under this subdivision must be remitted to the chief administrative officer of the public pension plan within 60 days of receipt by the chief administrative officer of the employee payments specified under this subdivision.\nThe prospective prior service credit purchaser must provide any relevant documentation required by the chief administrative officer of the applicable public pension plan to determine eligibility for the prior service credit under this section.\nService credit for the purchase period must be granted by the public pension plan to the purchaser upon receipt of the full purchase payment amount specified in subdivision 2.",
	"repealed": false
}