{
	"id": "611A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.06",
	"title": "611A.06 RIGHT TO NOTICES; RELEASE; END OF CONFINEMENT REVIEW PROCESS; EXPUNGEMENT; ESCAPE.",
	"text": "(a) The commissioner of corrections or other custodial authority shall make a good faith effort to notify the victim that the offender is to be released from imprisonment or incarceration, including release on extended furlough and for work release and release from a juvenile correctional facility, or if the offender's custody status is reduced. These notices shall only be provided to victims who have submitted a written request for notification to the head of the county correctional facility in which the offender is confined, or if committed to the Department of Corrections, submitted a written request for this notice to the commissioner of corrections or electronic request through the Department of Corrections electronic victim notification system. The good faith effort to notify the victim must occur prior to the offender's release or when the offender's custody status is reduced. For a victim of a felony crime against the person for which the offender was sentenced to imprisonment for more than 18 months, the good faith effort to notify the victim must occur 60 days before the offender's release.\n(b) The Direct Care and Treatment executive board shall make a good faith effort to notify the victim in writing that the offender is to be released from confinement in a facility due to incompetency, mental illness, or mental deficiency, or commitment under section 253B.18 or chapter 253D if the victim has submitted a written request for notification to the executive director of the facility in which the individual is confined.\nThe prosecuting authority with jurisdiction over an offense for which expungement is being sought shall make a good faith effort to notify a victim that the expungement is being sought if: (1) the victim has mailed to the prosecuting authority with jurisdiction over an offense for which expungement is being sought a written request for this notice, or (2) the victim has indicated on a request for notice of expungement submitted under subdivision 1 a desire to be notified in the event the offender seeks an expungement for the offense.\nA copy of any written request for a notice of expungement request received by the commissioner of corrections or other custodial authority shall be forwarded to the prosecutorial authority with jurisdiction over the offense to which the notice relates. The prosecutorial authority complies with this section upon mailing a copy of an expungement petition relating to the notice to the address which the victim has most recently provided in writing.\nThe notice given to a victim of a crime against a person must include the conditions governing the offender's release, and either the identity of the corrections agent who will be supervising the offender's release or a means to identify the court services agency that will be supervising the offender's release. The commissioner or other custodial authority complies with this section upon mailing the notice of impending release to the victim at the address which the victim has most recently provided to the commissioner or authority in writing, or by providing electronic notice to the victim who requested this notice through the Department of Corrections electronic victim notification system.\nIf an individual scheduled to be released from imprisonment is subject to an end-of-confinement review under section 244.052, the commissioner of corrections shall make a good faith effort to notify the victim of the end-of-confinement review process and that the victim has a right to submit written input for consideration at the end-of-confinement review hearing. The victim has a continuing right to submit input if the end-of-confinement review committee receives a request to reassess the individual's assigned risk level. These notices shall only be provided to victims who have submitted a written request for this notice to the commissioner of corrections or an electronic request through the Department of Corrections electronic victim notification system. The good faith effort to notify the victim must occur before the offender's end-of-confinement review hearing and provide sufficient time for the input to be considered in the end-of-confinement determination.\nIf an offender escapes from imprisonment or incarceration, including from release on extended furlough or work release, or from any facility described in subdivision 1, the commissioner or other custodial authority shall make all reasonable efforts to notify a victim who has requested notice of the offender's release under subdivision 1 within six hours after discovering the escape and shall also make reasonable efforts to notify the victim within 24 hours after the offender is apprehended.\nThe commissioner of corrections or the commissioner's designee may disclose to the victim of an offender notification of the city and five-digit zip code of the offender's residency upon release from a Department of Corrections facility, unless the commissioner or the commissioner's designee reasonably believes that disclosure of the city or zip code of the offender's residency creates a risk to the victim, offender, or public safety.\nAll identifying information regarding the victim, including the victim's request and the notice provided by the commissioner or custodial authority, is classified as private data on individuals as defined in section 13.02, subdivision 12, and is accessible only to the victim.\nAs used in this section, \"crime against the person\" means a crime listed in section 611A.031.",
	"repealed": false
}