{
	"id": "149A.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.80",
	"title": "149A.80 DEATH; RIGHT TO CONTROL AND DUTY OF DISPOSITION.",
	"text": "A person may direct the preparation for, type, or place of that person's final disposition, as well as the type of conveyance to be used to transport the body to the place of final disposition by written instructions. Arrangements made in advance of need must be in writing and dated, signed, and witnessed. The person or persons otherwise entitled to control the final disposition under this chapter shall faithfully carry out the reasonable and otherwise lawful directions of the decedent to the extent that the decedent has provided resources for the purpose of carrying out the directions. If the instructions are contained in a will, they shall be immediately carried out, regardless of the validity of the will in other respects or of the fact that the will may not be offered for or admitted to probate until a later date, subject to other provisions of this chapter or any other law of this state. This subdivision shall be administered and construed so that the reasonable and lawful instructions of the decedent or the person entitled to control the final disposition shall be faithfully and promptly performed.\nThe right to control the dead human body, including the location and conditions of final disposition, unless other directions have been given by the decedent pursuant to subdivision 1, vests in, and the duty of final disposition of the body devolves upon, the following in the order of priority listed:\n(1) the person or persons appointed in a dated written instrument signed by the decedent. Written instrument includes, but is not limited to, a health care directive executed under chapter 145C. If there is a dispute involving more than one written instrument, a written instrument that is witnessed or notarized prevails over a written instrument that is not witnessed or notarized. Written instrument does not include a durable or nondurable power of attorney which terminates on the death of the principal pursuant to sections 523.08 and 523.09;\n(2) the spouse of the decedent;\n(3) the adult child or the majority of the adult children of the decedent, provided that, in the absence of actual knowledge to the contrary, a funeral director or mortician may rely on instructions given by the child or children who represent that they are the sole surviving child, or that they constitute a majority of the surviving children;\n(4) the surviving parent or parents of the decedent, each having equal authority;\n(5) the adult sibling or the majority of the adult siblings of the decedent, provided that, in the absence of actual knowledge to the contrary, a funeral director or mortician may rely on instructions given by the sibling or siblings who represent that they are the sole surviving sibling, or that they constitute a majority of the surviving siblings;\n(6) the adult grandchild or the majority of the adult grandchildren of the decedent, provided that, in the absence of actual knowledge to the contrary, a funeral director or mortician may rely on instructions given by a grandchild or grandchildren who represent that they are the only grandchild or grandchildren reasonably available to control final disposition of the decedent's remains or represent a majority of grandchildren reasonably available to control final disposition of the decedent's remains;\n(7) the grandparent or the grandparents of the decedent, each having equal authority;\n(8) the adult nieces and nephews of the decedent, or a majority of them, provided that, in the absence of actual knowledge to the contrary, a funeral director or mortician may rely on instructions given by a niece, nephew, or nieces or nephews who represent that they are the only niece, nephew, or nieces or nephews reasonably available to control final disposition of the decedent's remains or represent a majority of nieces and nephews reasonably available to control final disposition of the decedent's remains;\n(9) the person or persons who were acting as the guardians of the person of the decedent with authority to make health care decisions for the decedent at the time of death;\n(10) an adult who exhibited special care and concern for the decedent;\n(11) the person or persons respectively in the next degree of kinship in the order named by law to inherit the estate of the decedent; and\n(12) the appropriate public or court authority, as required by law.\nFor purposes of this subdivision, the appropriate public or court authority includes the county board of the county in which the death occurred if the person dies without apparent financial means to provide for final disposition or the district court in the county in which the death occurred.\nWhere there is only one person in a degree of relationship to the decedent described in subdivision 2, clauses (1) to (6), and a district court pursuant to subdivision 5, determines that the person and the decedent were estranged at the time of death, the right to control and the duty of disposition shall devolve to the person or persons in the next degree of relationship pursuant to subdivision 2, clauses (1) to (6). For purposes of this subdivision, \"estranged\" means having a relationship characterized by mutual enmity, hostility, or indifference.\nIf a person or persons to whom the right to control and duty of disposition devolve pursuant to subdivision 2, clauses (1) to (6), refuses to accept or declines to act upon the right or duty, that right and duty shall pass as follows:\n(1) to another person or persons with the same degree of relationship to the decedent as the person or persons refusing to accept or declining to act; or\n(2) to the person or persons in the next degree of relationship to the decedent pursuant to subdivision 2, clauses (1) to (6).\nWhen a dispute exists regarding the right to control or duty of disposition, the parties in dispute or the mortician or funeral director may file a petition in the district court in the county of residence of the decedent requesting that the court make a determination in the matter. Should the right to control and duty of disposition devolve to more than one person with the same degree of relationship to the decedent and those persons cannot, by majority vote, make a decision regarding arrangements and final disposition and a district court has been petitioned to make a determination, the court shall consider the following factors in making its determination:\n(1) the reasonableness, practicality, and resources available for payment of the proposed arrangements and final disposition;\n(2) the degree of the personal relationship between the decedent and each of the persons in the same degree of relationship to the decedent;\n(3) the expressed wishes and directions of the decedent and the extent to which the decedent has provided resources for the purpose of carrying out the wishes or directions; and\n(4) the degree to which the arrangements and final disposition will allow for participation by all who wish to pay respect to the decedent.\nA funeral director or mortician shall have complete authority to control the final disposition and to proceed under this chapter to recover reasonable charges for the final disposition when both of the following apply:\n(1) the funeral director or mortician has actual knowledge that none of the persons described in subdivision 2, clauses (1) to (6), exist or that none of the persons so described can be found after reasonable inquiry or contacted by reasonable means; and\n(2) the appropriate public or court authority fails to assume responsibility for disposition of the remains within 36 hours after having been given written notice of the facts. Written notice may be delivered by hand, United States mail, facsimile transmission, or telegraph.\nA funeral director or mortician shall not be subject to criminal prosecution or civil liability for carrying out the otherwise lawful instructions of the decedent or the person or persons whom the funeral director or mortician reasonably believes is entitled to control the final disposition.\nIn addition to separate contractual obligations, the liability for the reasonable cost of final disposition devolves upon the estate of the decedent, regardless of whether testate or intestate, and the distributees of the estate pursuant to chapter 524, the Uniform Probate Code. In the case of persons who die without apparent financial means to provide for final disposition, control of final disposition and liability devolves to the county board of the county in which the death occurred, pursuant to section 261.035. In the case of unclaimed bodies delivered for dissection by the medical examiner and anatomical gifts of the entire body made pursuant to section 149A.81, subdivision 2, subject to the terms of the gift, liability for transportation and final disposition shall be borne by the institution receiving the body.\nAny person that arrests, attaches, detains, or claims to detain any human remains for any debt or demand, or upon any pretended lien or charge, or who, without authority of law, obstructs or detains a person charged with the duty or engaged in the final disposition of a dead human body, or fails to release any dead human body upon the receipt of authorization for the release signed by a person or persons entitled to custody of the body is guilty of a misdemeanor. Criminal prosecution shall not preclude the commissioner from taking any other lawful disciplinary action.",
	"repealed": false
}