{
	"id": "142C.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/142C.11",
	"title": "142C.11 HEALTH AND SAFETY REQUIREMENTS.",
	"text": "(a) A certified center must supervise and isolate a child from other children in the program when a child becomes sick and immediately notify the sick child's parent or legal guardian.\n(b) A certified center must post or give notice to the parent or legal guardian of an exposed child the same day the program is notified of a child's contagious reportable disease specified in Minnesota Rules, part 4605.7040, or scabies, impetigo, ringworm, or chicken pox.\nBy a child's date of attendance, the certified center must maintain or have access to a record detailing the child's current immunizations or applicable exemption.\n(a) A certified center that chooses to administer medicine must meet the requirements in this subdivision.\n(b) The certified center must obtain written permission from the child's parent or legal guardian before administering prescription medicine, nonprescription medicine, diapering product, sunscreen lotion, and insect repellent.\n(c) The certified center must administer nonprescription medicine, diapering product, sunscreen lotion, and insect repellent according to the manufacturer's instructions unless provided written instructions by a licensed health professional to use a product differently.\n(d) The certified center must obtain and follow written instructions from the prescribing health professional before administering prescription medicine. Medicine with the child's first and last name and current prescription information on the label is considered written instructions.\n(e) The certified center must ensure all prescription and nonprescription medicine is:\n(1) kept in the medicine's original container with a legible label stating the child's first and last name;\n(2) given only to the child whose name is on the label;\n(3) not given after an expiration date on the label; and\n(4) returned to the child's parent or legal guardian or destroyed, if unused.\n(f) The certified center must document in the child's record the administration of prescription and nonprescription medication, including the child's first and last name; the name of the medication or prescription number; the date, time, and dosage; and the name and signature of the person who administered the medicine. This documentation must be available to the child's parent or legal guardian.\n(g) The certified center must store prescription and nonprescription medicines, insect repellents, and diapering products according to directions on the original container.\n(a) Before admitting a child for care, the certified center must obtain documentation of any known allergies from the child's parent or legal guardian. The certified center must maintain current allergy information in each child's record. The allergy information must include:\n(1) a description of the allergy, specific triggers, avoidance techniques, and symptoms of an allergic reaction; and\n(2) procedures for responding to an allergic reaction, including medication, dosages, and a doctor's contact information.\n(b) The certified center must inform staff of each child's current allergy information. At least annually and when a change is made to allergy-related information in a child's record, the certified center must inform staff of any change. Documentation that staff were informed of the child's current allergy information must be kept on site.\n(c) A child's allergy information must be available at all times including on site, when on field trips, or during transportation. Food allergy information must be readily available to staff in the area where food is prepared and served to the child.\n(a) To be accepted for certification, the applicant must demonstrate compliance with the State Fire Code, section 299F.011, by either:\n(1) providing documentation of a fire marshal inspection completed within the previous three years by a state fire marshal or a local fire code inspector trained by the state fire marshal; or\n(2) complying with the fire marshal inspection requirements according to section 142B.44.\n(b) The certified center must designate a primary indoor and outdoor space used for child care on a facility site floor plan.\n(c) The certified center must ensure the areas used by a child are clean and in good repair, with structurally sound and functional furniture and equipment that is appropriate to the age and size of a child who uses the area.\n(d) The certified center must ensure hazardous items including but not limited to sharp objects, medicines, cleaning supplies, poisonous plants, and chemicals are out of reach of a child.\n(e) The certified center must safely handle and dispose of bodily fluids and other potentially infectious fluids by using gloves, disinfecting surfaces that come in contact with potentially infectious bodily fluids, and disposing of bodily fluid in a securely sealed plastic bag.\n(a) If a certified center chooses to transport a child, the certified center must ensure that the driver of the vehicle holds a valid driver's license, appropriate to the vehicle driven.\n(b) If a certified center chooses to transport a child, the center must comply with all seat belt and child passenger restraint system requirements under sections 169.685 and 169.686.\n(a) The certified center must develop a risk reduction plan that identifies risks to children served by the child care center. The assessment of risk must include risks presented by (1) the physical plant where the certified services are provided, including electrical hazards; and (2) the environment, including the proximity to busy roads and bodies of water.\n(b) The certification holder must establish policies and procedures to minimize identified risks. After any change to the risk reduction plan, the certification holder must inform staff of the change in the risk reduction plan and document that staff were informed of the change.\n(c) If middle-school-age children are enrolled in the center and combined with elementary children, the certification holder must establish policies and procedures to ensure adequate supervision as defined in subdivision 10 when children are grouped together.\nA certified center must have written policies for health and safety items in subdivisions 1 to 6.\nThe certified center must ensure that staff and volunteers use positive behavior guidance and do not subject children to:\n(1) corporal punishment, including but not limited to rough handling, shoving, hair pulling, ear pulling, shaking, slapping, kicking, biting, pinching, hitting, and spanking;\n(2) humiliation;\n(3) abusive language;\n(4) the use of mechanical restraints, including tying;\n(5) the use of physical restraints other than to physically hold a child when containment is necessary to protect a child or others from harm;\n(6) prone restraints, as prohibited by section 245A.211; or\n(7) the withholding or forcing of food and other basic needs.\nStaff must supervise each child at all times. Staff are responsible for the ongoing activity of each child, appropriate visual or auditory awareness, physical proximity, and knowledge of activity requirements and each child's needs. Staff must intervene when necessary to ensure a child's safety. In determining the appropriate level of supervision of a child, staff must consider: (1) the age of a child; (2) individual differences and abilities; (3) indoor and outdoor layout of the child care program; and (4) environmental circumstances, hazards, and risks.",
	"repealed": false
}