{
	"id": "504B.206",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.206",
	"title": "504B.206 RIGHT OF VICTIMS OF VIOLENCE TO TERMINATE LEASE.",
	"text": "(a) A tenant to a residential lease may terminate a lease agreement in the manner provided in this section without penalty or liability, if the tenant or another authorized occupant fears imminent violence after being subjected to:\n(1) domestic abuse, as that term is defined under section 518B.01, subdivision 2;\n(2) criminal sexual conduct under sections 609.342 to 609.3451;\n(3) sexual extortion under section 609.3458; or\n(4) harassment under section 609.749.\n(b) The tenant must provide signed and dated advance written notice to the landlord:\n(1) stating the tenant fears imminent violence from a person as indicated in a qualifying document against the tenant or an authorized occupant if the tenant or authorized occupant remains in the leased premises;\n(2) stating that the tenant needs to terminate the tenancy;\n(3) providing the date on which the lease will terminate; and\n(4) providing written instructions for the disposition of any remaining personal property in accordance with section 504B.271.\n(c) The written notice must be delivered before the termination of the tenancy by mail, in person, or by a form of written communication the plaintiff regularly uses to communicate with the landlord, and be accompanied by a qualifying document. The tenancy terminates for the tenant who exercises the right granted under this subdivision, including the right of possession of the premises, on the date provided in the notice required under paragraph (b). Vacation of the premises under this section by the tenant prior to the date provided in the notice does not constitute termination of the tenancy for the purposes of this section.\n(d) The landlord may request that the tenant disclose the name of the perpetrator and, if a request is made, inform the tenant that the landlord seeks disclosure to protect other tenants in the building. The tenant may decline to provide the name of the perpetrator for safety reasons. Disclosure shall not be a precondition of terminating the lease.\n(a) A landlord must not disclose:\n(1) any information provided to the landlord by a tenant in the written notice required under subdivision 1, paragraph (b);\n(2) any information contained in the qualifying document;\n(3) the address or location to which the tenant has relocated; or\n(4) the status of the tenant as a victim of violence.\n(b) The information referenced in paragraph (a) must not be entered into any shared database or provided to any person or entity but may be used when required as evidence in an eviction proceeding, action for unpaid rent or damages arising out of the tenancy, claims under section 504B.178, with the consent of the tenant, or as otherwise required by law.\n(c) A landlord who violates this section is liable to the tenant for statutory damages of $2,000, plus reasonable attorney fees and costs.\n(a) A tenant who is a sole tenant and is terminating a lease under subdivision 1 is responsible for the rent payment for the full month in which the tenancy terminates. The tenant relinquishes all claims for the return of the security deposit under section 504B.178 and is relieved of any other contractual obligation for payment of rent or any other charges for the remaining term of the lease, except as provided in this section. In a sole tenancy, the tenancy terminates on the date specified in the notice provided to the landlord as required under subdivision 1.\n(b) In a tenancy with multiple tenants, one of whom is terminating the lease under subdivision 1, any lease governing all remaining tenants is terminated at the later of the end of the month or the end of the rent interval in which one tenant terminates the lease under subdivision 1. All tenants are responsible for the rent payment for the full month in which the tenancy terminates. Upon termination, all tenants relinquish all claims for the return of the security deposit under section 504B.178 and are relieved of any other contractual obligation for payment of rent or any other charges for the remaining term of the lease, except as provided in this section. Any tenant whose tenancy was terminated under this paragraph may reapply to enter into a new lease with the landlord.\n(c) This section does not affect a tenant's liability for delinquent, unpaid rent or other amounts owed to the landlord before the lease was terminated by the tenant under this section.\n(d) Except as provided in section 504B.285, subdivision 1, paragraph (b), a landlord may not commence an eviction action against a tenant who has terminated a lease as provided in this section.\nMS 2012 [Repealed by amendment, 2014 c 188 s 2]\nA residential tenant may not waive, and a landlord may not require the residential tenant to waive, the tenant's rights under this section.\nFor purposes of this section, the following terms have the meanings given:\n(1) \"court official\" means a judge, referee, court administrator, prosecutor, probation officer, or victim's advocate, whether employed by or under contract with the court, who is authorized to act on behalf of the court;\n(2) \"qualified third party\" means a person, acting in an official capacity, who has provided professional services to the tenant and is:\n(i) a licensed health care professional operating within the scope of the license;\n(ii) a domestic abuse advocate, as that term is defined in section 595.02, subdivision 1, paragraph (l); or\n(iii) a sexual assault counselor, as that term is defined in section 595.02, subdivision 1, paragraph (k);\n(3) \"qualifying document\" means:\n(i) a valid order for protection issued under chapter 518B;\n(ii) a no contact order currently in effect, issued under section 629.75 or chapter 609;\n(iii) a writing produced and signed by a court official, acting in an official capacity, documenting that the tenant or authorized occupant is a victim of domestic abuse, as that term is defined under section 518B.01, subdivision 2, criminal sexual conduct under sections 609.342 to 609.3451, sexual extortion under section 609.3458, or harassment under section 609.749, and naming the perpetrator, if known;\n(iv) a writing produced and signed by a city, county, state, or tribal law enforcement official, acting in an official capacity, documenting that the tenant or authorized occupant is a victim of domestic abuse, as that term is defined under section 518B.01, subdivision 2, criminal sexual conduct under sections 609.342 to 609.3451, sexual extortion under section 609.3458, or harassment under section 609.749, and naming the perpetrator, if known; or\n(v) a statement by a qualified third party, in the following form:\nSTATEMENT BY QUALIFIED THIRD PARTY\nI, .................... (name of qualified third party), do hereby verify as follows:\n1. I am a licensed health care professional, domestic abuse advocate, as that term is defined in section 595.02, subdivision 1, paragraph (l), or sexual assault counselor, as that term is defined in section 595.02, subdivision 1, paragraph (k), who has provided professional services to .................... (name of victim(s)).\n2. I have a reasonable basis to believe .................... (name of victim(s)) is a victim/are victims of domestic abuse, criminal sexual conduct, sexual extortion, or harassment and fear(s) imminent violence against the individual or authorized occupant if the individual remains (the individuals remain) in the leased premises.\n3. I understand that the person(s) listed above may use this document as a basis for gaining a release from the lease.\nI attest that the foregoing is true and correct.\n(Printed name of qualified third party)\n(Signature of qualified third party)\n(Business address and business telephone)\n(Date)\nIf a federal statute, regulation, or handbook permitting termination of a residential tenancy subsidized under a federal program conflicts with any provision of this section, then the landlord must comply with the federal statute, regulation, or handbook.",
	"repealed": false
}