{
	"id": "144.9502",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9502",
	"title": "144.9502 STATEWIDE LEAD SURVEILLANCE SYSTEM.",
	"text": "The commissioner of health shall establish a statewide lead surveillance system. The purpose of this system is to:\n(1) monitor blood lead levels in children and adults to identify trends and populations at high risk for elevated blood lead levels;\n(2) ensure that screening services are provided to populations at high risk for elevated blood lead levels;\n(3) ensure that medical and environmental follow-up services for children with elevated blood lead levels are provided; and\n(4) provide accurate and complete data for planning and implementing primary prevention programs that focus on the populations at high risk for elevated blood lead levels.\nThe commissioner of health shall collect blood lead level and exposure information, analyze the information, and conduct studies designed to determine the potential for high risk for elevated blood lead levels among children and adults.\n(a) Every hospital, medical clinic, medical laboratory, other facility, or individual performing blood lead analysis shall report the results after the analysis of each specimen analyzed, for both capillary and venous specimens, and epidemiologic information required in this section to the commissioner of health, within the time frames set forth in clauses (1) and (2):\n(1) within two working days by telephone, fax, or electronic transmission as prescribed by the commissioner, with written or electronic confirmation within one month as prescribed by the commissioner, for a venous blood lead level equal to or greater than 15 micrograms of lead per deciliter of whole blood; or\n(2) within one month in writing or by electronic transmission as prescribed by the commissioner, for any capillary result or for a venous blood lead level less than 15 micrograms of lead per deciliter of whole blood.\n(b) If a blood lead analysis is performed outside of Minnesota and the facility performing the analysis does not report the blood lead analysis results and epidemiological information required in this section to the commissioner, the provider who collected the blood specimen must satisfy the reporting requirements of this section. For purposes of this section, \"provider\" has the meaning given in section 62D.02, subdivision 9.\n(c) The commissioner shall coordinate with hospitals, medical clinics, medical laboratories, and other facilities performing blood lead analysis to develop a universal reporting form and mechanism.\nThe blood lead analysis reports required in this section must specify:\n(1) whether the specimen was collected as a capillary or venous sample;\n(2) the date the sample was collected;\n(3) the results of the blood lead analysis;\n(4) the date the sample was analyzed;\n(5) the method of analysis used;\n(6) the full name, address, and phone number of the laboratory performing the analysis;\n(7) the full name, address, and phone number of the physician, advanced practice registered nurse, physician assistant, or facility requesting the analysis;\n(8) the full name, address, and phone number of the person with the blood lead level, and the person's birthdate, gender, and race.\nThe follow-up epidemiologic information required in this section must specify:\n(1) the name, address, and phone number of the agency or individual contacted to investigate the environment of the person with the elevated blood lead level to determine the sources of lead exposure; and\n(2) the name, address, and phone number of all agencies or individuals to whom the person or the person's guardian was referred for education about the sources, effects, and prevention of lead exposure.\n[Repealed, 2001 c 205 art 1 s 43]\nThe furnishing of the information required under this section shall not subject the person, laboratory, or other facility furnishing the information to any action for damages or relief.\n(a) A laboratory performing blood lead analysis shall use methods that:\n(1) meet or exceed the proficiency standards established in the federal Clinical Laboratory Improvement Regulations, Code of Federal Regulations, title 42, section 493, promulgated in accordance with the Clinical Laboratory Improvement Act amendments of 1988, Public Law 100-578; or\n(2) meet or exceed the Occupational Safety and Health Standards for Lead in General Industries, Code of Federal Regulations, section 1910.1025, and Occupational Safety and Health Standards for Lead in Construction, Code of Federal Regulations, section 1926.62.\n(b) A laboratory performing lead analysis of paint, soil, or dust must be a laboratory recognized by the United States Environmental Protection Agency under the Toxic Substances Control Act, United States Code, title 15, section 2685, paragraph (b). Analysis of samples of drinking water must be performed by a laboratory certified by the commissioner to analyze lead in water.\nNotwithstanding any law to the contrary, including section 13.05, subdivision 9, data collected by the commissioner of health about persons with blood lead levels, including analytic results from samples of paint, soil, dust, and drinking water taken from the individual's home and immediate property, shall be private and may only be used by the commissioner of health, the commissioner of labor and industry, authorized agents of Indian tribes, and authorized employees of community health boards for the purposes set forth in this section.",
	"repealed": false
}