{
	"id": "574.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/574.31",
	"title": "574.31 LIMIT OF TIME TO BRING ACTION.",
	"text": "In the event of a claim by the public body on a performance bond, no action shall be maintained later than permitted under the statute of limitations applicable to the claim. Nothing in this subdivision may be construed to otherwise affect the common law or equitable rights of performance bond sureties, principals, or public bodies that are obligees.\n(a) In the event of a claim on a payment bond by a person furnishing labor and materials, no action shall be maintained on the payment bond unless, within 120 days after completion, delivery, or provision by the person of its last item of labor and materials, for the public work, the person serves written notice of claim under the payment bond personally or by certified mail upon the surety that issued the bond and the contractor on whose behalf the bond was issued at their addresses as stated in the bond specifying the nature and amount of the claim and the date the claimant furnished its last item of labor and materials for the public work. The addresses of the contractor and the surety listed on the bond must be addresses at which the companies are authorized to accept service of the notice of the claim. If an agent or attorney-in-fact is authorized to accept service of notice of the claim for the contractor or surety, that fact must be expressly stated in the bond along with the address of the agent or attorney-in-fact at which service of the notice of the claim can be made. For the purpose of this section, notice is sufficient if served personally or via certified mail to the addresses of the contractor and surety listed on the bond. The form of notice is sufficient if it is substantially as follows:\nNOTICE OF CLAIM ON PAYMENT BOND FOR PUBLIC WORK\n(b) If the contractor providing the payment bond fails to comply with the filing requirements of section 574.28 by failing to state both its address and the address of the surety providing the bond, then a claimant under the bond need not provide either the surety or the contractor written notice of its claim under paragraph (a).\n(c) An action to enforce a claim against the surety under the bond must be commenced within one year from the date of completion, delivery, or provision by the claimant of its last item of labor and materials for the public work stated in its notice of claim. If no notice of claim was required because the contractor providing the bond failed to comply with the requirements of section 574.28, then any action under the bond must be commenced within one year from the actual date of completion, delivery, or provision by the claimant of its last item of labor and materials for the public work. Any other person having a cause of action on a payment bond may be admitted, on motion, as a party to the action, and the court shall determine the rights of all parties. If the amount realized on the bond is insufficient to discharge all the claims in full, the amount must be prorated among the parties.\n(d) The claimant can extend the time within which to bring an action to enforce a claim under the bond to beyond that specified in paragraph (c) either by: (1) written stipulation between the claimant and surety stating the extended deadline and executed by both parties before the expiration of one year from the actual date of completion, delivery, or provision by the claimant of its last item of labor and materials for the public work; or (2) written notice extending by one year the deadline specified in paragraph (c) sent by the claimant to the surety via certified mail 90 days before the expiration of the deadline specified in paragraph (c), which notice is not objected to in a return written notice sent by the surety to the claimant via certified mail within 30 days after the surety's receipt of claimant's notice. If a claimant's payment is not yet contractually due within one year from the actual date of completion, delivery, or provision by the claimant of its last item of labor and materials, the court shall continue and not dismiss the action until the payment is due.",
	"repealed": false
}