{
	"id": "60A.764",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.764",
	"title": "60A.764 PREMIUM RESERVES.",
	"text": "(a) Unearned premium reserves are required for all contracts with respect to the period of coverage for which premiums, other than premiums paid in advance, have been paid beyond the date of valuation.\n(b) If premiums due and unpaid are carried as an asset, the premiums must be treated as premiums in force, subject to unearned premium reserve determination. The value of unpaid commissions, premium taxes, and the cost of collection associated with due and unpaid premiums must be carried as an offsetting liability.\n(c) The gross premiums paid in advance for a period of coverage beginning after the next premium due date which follows the date of valuation may be appropriately discounted to the valuation date and must be held either as a separate liability or as an addition to the unearned premium reserve which would otherwise be required as a minimum.\n(a) The minimum unearned premium reserve with respect to a contract is the pro rata unearned modal premium that applies to the premium period beyond the valuation date, with the premium determined on the basis of:\n(1) the valuation net modal premium on the contract reserve basis applying to the contract; or\n(2) the gross modal premium for the contract if no contract reserve applies.\n(b) However, in no event may the sum of the unearned premium and contract reserves for all contracts of the insurer subject to contract reserve requirements be less than the gross modal unearned premium reserve on all such contracts, as of the date of valuation. The reserve must never be less than the expected claims for the period beyond the valuation date represented by the unearned premium reserve, to the extent not provided for elsewhere.\nThe insurer may employ suitable approximations and estimates, including, but not limited to, groupings, averages, and aggregate estimation, in computing premium reserves. Approximations or estimates should be tested periodically to determine the continuing adequacy and reliability.",
	"repealed": false
}