{
	"id": "611.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.45",
	"title": "611.45 COMPETENCY FINDINGS.",
	"text": "(a) The court must rule on the defendant's competency to stand trial no more than 14 days after the examiner's report is submitted to the court. If there is a contested hearing, the court must rule no more than 30 days after the date of the hearing.\n(b) If the court finds the defendant competent, the court shall enter an order and the criminal proceedings shall resume.\n(c) If the court finds the defendant incompetent, the court shall enter a written order and suspend the criminal proceedings. The matter shall proceed under section 611.46.\nAppeals under this chapter are governed by Minnesota Rules of Criminal Procedure, rule 28. A verbatim record shall be made in all competency proceedings.\n(a) If the court finds the defendant incompetent, and the charge is a misdemeanor other than a targeted misdemeanor, the charge must be dismissed.\n(b) In targeted misdemeanor and gross misdemeanor cases, the charges must be dismissed 30 days after the date of the finding of incompetence, unless the prosecutor, before the expiration of the 30-day period, files a written notice of intent to prosecute when the defendant attains competency. If a notice has been filed and the charge is a targeted misdemeanor, charges must be dismissed within one year after the finding of incompetency. If a notice has been filed and the charge is a gross misdemeanor, charges must be dismissed within two years after the finding of incompetency.\n(c) In felony cases, except as provided in paragraph (d), the charges must be dismissed three years after the date of the finding of incompetency, unless the prosecutor, before the expiration of the three-year period, files a written notice of intent to prosecute when the defendant attains competency. If a notice has been filed, charges must be dismissed within five years after the finding of incompetency or ten years if the maximum sentence for the crime with which the defendant is charged is ten years or more.\n(d) The requirement that felony charges be dismissed under paragraph (c) does not apply if:\n(1) the court orders continuing supervision pursuant to section 611.49; or\n(2) the defendant is charged with a violation of sections 609.2112 (criminal vehicular homicide); 609.2114, subdivision 1 (criminal vehicular operation, death to an unborn child); 609.2661 (murder of an unborn child in the first degree); 609.2662 (murder of an unborn child in the second degree); 609.2663 (murder of an unborn child in the third degree); 609.2664 (manslaughter of an unborn child in the first degree); or 609.2665 (manslaughter of an unborn child in the second degree); or a crime of violence as defined in section 624.712, subdivision 5, except for a violation of chapter 152.\n(e) Nothing in this subdivision requires dismissal of any charge if the court finds the defendant competent and enters an order directing that the criminal proceedings shall resume.",
	"repealed": false
}