{
	"id": "245A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.03",
	"title": "245A.03 WHO MUST BE LICENSED.",
	"text": "Unless licensed by the commissioner under this chapter, an individual, organization, or government entity must not:\n(1) operate a residential or a nonresidential program;\n(2) receive a child or adult for care, supervision, or placement in foster care; or\n(3) advertise a residential or nonresidential program.\n(a) This chapter does not apply to:\n(1) residential or nonresidential programs that are provided to a person by an individual who is related;\n(2) nonresidential programs that are provided by an unrelated individual to persons from a single related family;\n(3) residential or nonresidential programs that are provided to adults who do not misuse substances or have a substance use disorder, a mental illness, a developmental disability, a functional impairment, or a physical disability;\n(4) sheltered workshops or work activity programs that are certified by the commissioner of employment and economic development;\n(5) programs operated by a public school for children 33 months or older;\n(6) nonresidential programs primarily for children that provide care or supervision for periods of less than three hours a day while the child's parent or legal guardian is in the same building as the nonresidential program or present within another building that is directly contiguous to the building in which the nonresidential program is located;\n(7) nursing homes or hospitals licensed by the commissioner of health except as specified under section 245A.02;\n(8) board and lodge facilities licensed by the commissioner of health that do not provide children's residential services under Minnesota Rules, chapter 2960, mental health or substance use disorder treatment;\n(9) programs licensed by the commissioner of corrections;\n(10) recreation programs for children or adults that are operated or approved by a park and recreation board whose primary purpose is to provide social and recreational activities;\n(11) noncertified boarding care homes unless they provide services for five or more persons whose primary diagnosis is mental illness or a developmental disability;\n(12) programs for children such as scouting, boys clubs, girls clubs, and sports and art programs, and nonresidential programs for children provided for a cumulative total of less than 30 days in any 12-month period;\n(13) residential programs for persons with mental illness, that are located in hospitals;\n(14) camps licensed by the commissioner of health under Minnesota Rules, chapter 4630;\n(15) mental health outpatient services for adults with mental illness or children with emotional disturbance;\n(16) residential programs serving school-age children whose sole purpose is cultural or educational exchange, until the commissioner adopts appropriate rules;\n(17) community support services programs as defined in section 245.462, subdivision 6, and family community support services as defined in section 245.4871, subdivision 17;\n(18) assisted living facilities licensed by the commissioner of health under chapter 144G;\n(19) substance use disorder treatment activities of licensed professionals in private practice as defined in section 245G.01, subdivision 17;\n(20) consumer-directed community support service funded under the Medicaid waiver for persons with developmental disabilities when the individual who provided the service is:\n(i) the same individual who is the direct payee of these specific waiver funds or paid by a fiscal agent, fiscal intermediary, or employer of record; and\n(ii) not otherwise under the control of a residential or nonresidential program that is required to be licensed under this chapter when providing the service;\n(21) a county that is an eligible vendor under section 254B.05 to provide care coordination and comprehensive assessment services;\n(22) a recovery community organization that is an eligible vendor under section 254B.05 to provide peer recovery support services; or\n(23) programs licensed by the commissioner of children, youth, and families in chapter 142B.\n(b) For purposes of paragraph (a), clause (6), a building is directly contiguous to a building in which a nonresidential program is located if it shares a common wall with the building in which the nonresidential program is located or is attached to that building by skyway, tunnel, atrium, or common roof.\n(c) Except for the home and community-based services identified in section 245D.03, subdivision 1, nothing in this chapter shall be construed to require licensure for any services provided and funded according to an approved federal waiver plan where licensure is specifically identified as not being a condition for the services and funding.\n[Renumbered 142B.05, subd 3]\n[Renumbered 142B.05, subd 4]\n[Repealed, 2015 c 37 s 3]\n(a) It is a misdemeanor for an individual, organization, or government entity to provide a residential or nonresidential program without a license issued under this chapter and in willful disregard of this chapter unless the program is excluded from licensure under subdivision 2.\n(b) The commissioner may ask the appropriate county attorney or the attorney general to begin proceedings to secure a court order against the continued operation of the program, if an individual, organization, or government entity has:\n(1) failed to apply for a license under this chapter after receiving notice that a license is required or continues to operate without a license after receiving notice that a license is required;\n(2) continued to operate without a license after a license issued under this chapter has been revoked or suspended under this chapter, and the commissioner has issued a final order affirming the revocation or suspension, or the license holder did not timely appeal the sanction; or\n(3) continued to operate without a license after a temporary immediate suspension of a license has been issued under this chapter.\n(c) The county attorney and the attorney general have a duty to cooperate with the commissioner.\n[Renumbered 142B.05, subd 6]\n[Renumbered 142B.05, subd 7]\nMS 2020 [Repealed, 2022 c 98 art 7 s 32]\nNothing in this section shall prohibit a residential program licensed by the commissioner of corrections to serve children, that is excluded from licensure under subdivision 2, paragraph (a), clause (10), from seeking certification from the commissioner of human services under this chapter for program services for which certification standards have been adopted.\n(a) The commissioner of human services shall issue a mental health certification for adult foster care homes licensed under this chapter and Minnesota Rules, parts 9555.5105 to 9555.6265, or community residential settings licensed under chapter 245D, that serve people with a primary diagnosis of mental illness where the home is not the primary residence of the license holder when a provider is determined to have met the requirements under paragraph (b). This certification is voluntary for license holders. The certification shall be printed on the license, and identified on the commissioner's public website.\n(b) The requirements for certification are:\n(1) all staff working in the adult foster care home or community residential setting have received at least seven hours of annual training under paragraph (c) covering all of the following topics:\n(i) mental health diagnoses;\n(ii) mental health crisis response and de-escalation techniques;\n(iii) recovery from mental illness;\n(iv) treatment options including evidence-based practices;\n(v) medications and their side effects;\n(vi) suicide intervention, identifying suicide warning signs, and appropriate responses;\n(vii) co-occurring substance abuse and health conditions; and\n(viii) community resources;\n(2) a mental health professional, as defined in section 245.462, subdivision 18, or a mental health practitioner as defined in section 245.462, subdivision 17, are available for consultation and assistance;\n(3) there is a protocol in place to address a mental health crisis; and\n(4) there is a crisis plan for each individual that identifies who is providing clinical services and their contact information, and includes an individual crisis prevention and management plan developed with the individual.\n(c) The training curriculum must be approved by the commissioner of human services and must include a testing component after training is completed. Training must be provided by a mental health professional or a mental health practitioner. Training may also be provided by an individual living with a mental illness or a family member of such an individual, who is from a nonprofit organization with a history of providing educational classes on mental illnesses approved by the Department of Human Services to deliver mental health training. Staff must receive three hours of training in the areas specified in paragraph (b), clause (1), items (i) and (ii), prior to working alone with residents. The remaining hours of mandatory training, including a review of the information in paragraph (b), clause (1), item (ii), must be completed within six months of the hire date. For programs licensed under chapter 245D, training under this section may be incorporated into the 30 hours of staff orientation required under section 245D.09, subdivision 4.\n(d) License holders seeking certification under this subdivision must request this certification on forms provided by the commissioner and must submit the request to the county licensing agency in which the home or community residential setting is located. The county licensing agency must forward the request to the commissioner with a county recommendation regarding whether the commissioner should issue the certification.\n(e) Ongoing compliance with the certification requirements under paragraph (b) shall be reviewed by the county licensing agency at each licensing review. When a county licensing agency determines that the requirements of paragraph (b) are not met, the county shall inform the commissioner, and the commissioner will remove the certification.\n(f) A denial of the certification or the removal of the certification based on a determination that the requirements under paragraph (b) have not been met by the adult foster care or community residential setting license holder are not subject to appeal. A license holder that has been denied a certification or that has had a certification removed may again request certification when the license holder is in compliance with the requirements of paragraph (b).\n(a) The commissioner shall not issue an initial license for child foster care licensed under Minnesota Rules, parts 2960.3000 to 2960.3340, which does not include child foster residence settings with residential program certifications for compliance with the Family First Prevention Services Act under section 245A.25, subdivision 1, paragraph (a), or adult foster care licensed under Minnesota Rules, parts 9555.5105 to 9555.6265, under this chapter for a physical location that will not be the primary residence of the license holder for the entire period of licensure. If a child foster residence setting that was previously exempt from the licensing moratorium under this paragraph has its Family First Prevention Services Act certification rescinded under section 245A.25, subdivision 9, or if a family adult foster care home license is issued during this moratorium, and the license holder changes the license holder's primary residence away from the physical location of the foster care license, the commissioner shall revoke the license according to section 245A.07. The commissioner shall not issue an initial license for a community residential setting licensed under chapter 245D. When approving an exception under this paragraph, the commissioner shall consider the resource need determination process in paragraph (h), the availability of foster care licensed beds in the geographic area in which the licensee seeks to operate, the results of a person's choices during their annual assessment and service plan review, and the recommendation of the local county board. The determination by the commissioner is final and not subject to appeal. Exceptions to the moratorium include:\n(1) a license for a person in a foster care setting that is not the primary residence of the license holder and where at least 80 percent of the residents are 55 years of age or older;\n(2) foster care licenses replacing foster care licenses in existence on May 15, 2009, or community residential setting licenses replacing adult foster care licenses in existence on December 31, 2013, and determined to be needed by the commissioner under paragraph (b);\n(3) new foster care licenses or community residential setting licenses determined to be needed by the commissioner under paragraph (b) for the closure of a nursing facility, ICF/DD, or regional treatment center; restructuring of state-operated services that limits the capacity of state-operated facilities; or allowing movement to the community for people who no longer require the level of care provided in state-operated facilities as provided under section 256B.092, subdivision 13, or 256B.49, subdivision 24;\n(4) new foster care licenses or community residential setting licenses determined to be needed by the commissioner under paragraph (b) for persons requiring hospital-level care; or\n(5) new community residential setting licenses determined necessary by the commissioner for people affected by the closure of homes with a capacity of five or six beds currently licensed as supervised living facilities licensed under Minnesota Rules, chapter 4665, but not designated as intermediate care facilities. This exception is available until June 30, 2025.\n(b) The commissioner shall determine the need for newly licensed foster care homes or community residential settings as defined under this subdivision. As part of the determination, the commissioner shall consider the availability of foster care capacity in the area in which the licensee seeks to operate, and the recommendation of the local county board. The determination by the commissioner must be final. A determination of need is not required for a change in ownership at the same address.\n(c) When an adult resident served by the program moves out of a foster home that is not the primary residence of the license holder according to section 256B.49, subdivision 15, paragraph (f), or the adult community residential setting, the county shall immediately inform the Department of Human Services Licensing Division. The department may decrease the statewide licensed capacity for adult foster care settings.\n(d) Residential settings that would otherwise be subject to the decreased license capacity established in paragraph (c) must be exempt if the license holder's beds are occupied by residents whose primary diagnosis is mental illness and the license holder is certified under the requirements in subdivision 6a or section 245D.33.\n(e) A resource need determination process, managed at the state level, using the available data required by section 144A.351, and other data and information must be used to determine where the reduced capacity determined under section 256B.493 will be implemented. The commissioner shall consult with the stakeholders described in section 144A.351, and employ a variety of methods to improve the state's capacity to meet the informed decisions of those people who want to move out of corporate foster care or community residential settings, long-term service needs within budgetary limits, including seeking proposals from service providers or lead agencies to change service type, capacity, or location to improve services, increase the independence of residents, and better meet needs identified by the long-term services and supports reports and statewide data and information.\n(f) At the time of application and reapplication for licensure, the applicant and the license holder that are subject to the moratorium or an exclusion established in paragraph (a) are required to inform the commissioner whether the physical location where the foster care will be provided is or will be the primary residence of the license holder for the entire period of licensure. If the primary residence of the applicant or license holder changes, the applicant or license holder must notify the commissioner immediately. The commissioner shall print on the foster care license certificate whether or not the physical location is the primary residence of the license holder.\n(g) License holders of foster care homes identified under paragraph (f) that are not the primary residence of the license holder and that also provide services in the foster care home that are covered by a federally approved home and community-based services waiver, as authorized under chapter 256S or section 256B.092 or 256B.49, must inform the human services licensing division that the license holder provides or intends to provide these waiver-funded services.\n(h) The commissioner may adjust capacity to address needs identified in section 144A.351. Under this authority, the commissioner may approve new licensed settings or delicense existing settings. Delicensing of settings will be accomplished through a process identified in section 256B.493.\n(i) The commissioner must notify a license holder when its corporate foster care or community residential setting licensed beds are reduced under this section. The notice of reduction of licensed beds must be in writing and delivered to the license holder by certified mail or personal service. The notice must state why the licensed beds are reduced and must inform the license holder of its right to request reconsideration by the commissioner. The license holder's request for reconsideration must be in writing. If mailed, the request for reconsideration must be postmarked and sent to the commissioner within 20 calendar days after the license holder's receipt of the notice of reduction of licensed beds. If a request for reconsideration is made by personal service, it must be received by the commissioner within 20 calendar days after the license holder's receipt of the notice of reduction of licensed beds.\n(j) The commissioner shall not issue an initial license for children's residential treatment services licensed under Minnesota Rules, parts 2960.0580 to 2960.0700, under this chapter for a program that Centers for Medicare and Medicaid Services would consider an institution for mental diseases. Facilities that serve only private pay clients are exempt from the moratorium described in this paragraph. The commissioner has the authority to manage existing statewide capacity for children's residential treatment services subject to the moratorium under this paragraph and may issue an initial license for such facilities if the initial license would not increase the statewide capacity for children's residential treatment services subject to the moratorium under this paragraph.\n[Renumbered 142B.05, subd 8]\nNotwithstanding subdivision 2, paragraph (a), clause (1), and subdivision 7, an individual who is related to a person receiving supported living services may provide licensed services to that person if:\n(1) the person who receives supported living services received these services in a residential site on July 1, 2005;\n(2) the services under clause (1) were provided in a corporate foster care setting for adults and were funded by the developmental disabilities home and community-based services waiver defined in section 256B.092;\n(3) the individual who is related obtains and maintains both a license under chapter 245D or successor licensing requirements for the provision of supported living services and an adult foster care license under Minnesota Rules, parts 9555.5105 to 9555.6265; and\n(4) the individual who is related is not the guardian of the person receiving supported living services.",
	"repealed": false
}