{
	"id": "61A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.28",
	"title": "61A.28 DOMESTIC COMPANIES, INVESTMENTS.",
	"text": "Each domestic life insurance company must comply with section 60A.112.\nNo investment or loan, except policy loans, shall be made by a domestic life insurance company unless authorized or approved by the board of directors or by a committee of directors, officers, or employees of the company designated by the board and charged with the duty of supervising the investment or loan. Accurate records of all authorizations and approvals must be maintained.\nThe capital, surplus and other funds of every domestic life insurance company, whether incorporated by special act or under the general law (in addition to investments in real estate as otherwise permitted by law) may be invested only in one or more of the following kinds of securities or property. An investment may not be made under this section if the required interest obligation is in default.\nInvestments must be valued in accordance with the valuation procedures established by the National Association of Insurance Commissioners, unless the commissioner requires or finds another method of valuation reasonable under the circumstances. Other invested assets must be valued according to the procedures promulgated by the National Association of Insurance Commissioners, if not addressed in another section, unless the commissioner requires or finds another method of valuation reasonable under the circumstances.\nBonds or other obligations of, or bonds or other obligations insured or guaranteed by: (a) the United States or any state thereof; (b) the Dominion of Canada or any province thereof; (c) any county, city, town, statutory city formerly a village, organized school district, municipality, or other civil or political subdivision of this state, or of any state of the United States or of any province of the Dominion of Canada; (d) any agency or instrumentality of the foregoing, including but not limited to, debentures issued by the federal housing administrator, obligations of the Federal Home Loan Mortgage Corporation, the Federal National Mortgage Association, the Government National Mortgage Association; and (e) obligations payable in United States dollars issued or fully guaranteed by the International Bank for Reconstruction and Development, the Inter-American Development Bank, the Asian Development Bank, the African Development Bank, the Export-Import Bank, or any other United States government sponsored organization of which the United States is a member. The life insurance company may not invest in the obligations of these banks or organizations if the investment causes the company's aggregate investments in the obligations of any one of these banks or organizations to exceed five percent of its admitted assets or if the investment causes the company's aggregate investments in the obligations of all banks or organizations described in clause (e) to exceed 15 percent of its admitted assets.\nLoans or obligations (hereinafter loans) secured by a first mortgage, or deed of trust (hereinafter mortgage), on improved real estate in the United States, if the amount of the loan secured thereby is not in excess of 66-2/3 percent of the market value of the real estate at the time of the loan, or, when the loan is to be fully amortized by installment payments of principal, which may begin up to five years from the date of the loan if the real estate is to be used for commercial purposes, and interest at least annually over a period of not to exceed 40 years, the amount of the loan does not exceed (a) 80 percent of the market value of the real estate at the time of the loan; (b) 90 percent of the market value of the real estate at the time of the loan if the loan is secured by a purchase money mortgage made in connection with the disposition of real estate acquired pursuant to section 61A.31, subdivision 1, or, if (1) the real estate is used for commercial purposes, and (2) the loan is additionally secured by an assignment of lease or leases, and (3) the lessee or lessees under the lease or leases, or a guarantor or guarantors of the lessee's obligations, is a corporation whose obligations would qualify as an investment under subdivision 6, paragraph (e), and (4) the rents payable during the primary term of the lease or leases are sufficient to amortize at least 60 percent of the loan. In calculating the ratio of the amount of the loan to the value of the property, no part of the amount of any loan is to be included which the United States or any agency or instrumentality thereof or other mortgage insurer as may be approved by the commissioner has insured or guaranteed or made a commitment to insure or guarantee; provided, in no event may the loan exceed the market value of the property. No improvement may be included in estimating the market value of the real estate unless it is insured against fire by policies payable to the security holder or a trustee for its benefit. This requirement may be met by a program of self-insurance established and maintained by a corporation whose debt obligations would qualify for purchase under subdivision 6, paragraph (g), clause (4). Also loans secured by mortgage, upon leasehold estates in improved real property where at the date of investment the lease has an unexpired term of at least five years longer than the term of the loan secured thereby, and where the leasehold estate is unencumbered except by the lien reserved in the lease for the payment of rentals and the observance of the other covenants, terms and conditions of the lease and where the mortgagee, upon default, is entitled to be subrogated to, or to exercise, all the rights and to perform all the covenants of the lessee, provided that no loan on the leasehold estate may exceed (a) 66-2/3 percent of the market value thereof at the time of the loan, or (b) 80 percent of the market value thereof at the time of the loan if the loan is to be fully amortized by installment payments of principal which begin within five years from the date of the loan if the leasehold estate is to be used for commercial purposes, interest is payable at least annually over the period of the loan which may not exceed 40 years and the market value of the leasehold estate is shown by the sworn certificate of a competent appraiser, or (c) 90 percent of the market value of the leasehold estate at the time of the loan if the loan is secured by a purchase money mortgage made in connection with the disposition of real estate acquired pursuant to section 61A.31, subdivision 1. In calculating the ratio of the amount of the loan to the value of the leasehold estate, no part of the amount of any loan is to be included which the United States or any agency or instrumentality thereof or other mortgage insurer approved by the commissioner has insured or guaranteed or made a commitment to insure or guarantee; provided, in no event may the loan exceed the market value of the leasehold estate. Also loans secured by mortgage, which the United States or any agency or instrumentality thereof or other mortgage insurer approved by the commissioner has insured or guaranteed or made a commitment to insure or guarantee. Also loans secured by mortgage, on improved real estate in the Dominion of Canada if the amount of the loan is not in excess of 66-2/3 percent of the market value of the real estate at the time of the loan, or, when the loan is to be fully amortized by installment payments of principal, which may begin up to five years from the date of the loan if the real estate is used for commercial purposes, and interest at least annually over a period of not to exceed 40 years, the amount of the loan does not exceed (a) 80 percent of the market value of the real estate at the time of the loan, or (b) 90 percent of the market value of the real estate at the time of the loan if the loan is secured by a purchase money mortgage made in connection with the disposition of real estate acquired pursuant to section 61A.31, subdivision 1. In calculating the ratio of the amount of the loan to the value of the property, no part of the amount of any loan is to be included which the Dominion of Canada or any agency or instrumentality thereof has insured or guaranteed or made a commitment to insure or guarantee; provided in no event may the loan exceed the market value of the property. Also loans secured by mortgage, on real estate in the United States which may be unimproved provided there exists a definite plan for commencement of development for commercial purposes within not more than five years where the amount of the loan does not exceed 80 percent of the market value of the unimproved real estate at the time of the loan and the loan is to be fully amortized by installment payments of principal, which may begin up to five years from the date of the loan, and interest at least annually over a period of not to exceed 40 years. Also loans secured by second mortgage on improved or unimproved real estate used, or to be used, for commercial purposes; provided, that if unimproved real estate there exists a definite plan for commencement of development within not more than five years, in the United States or the Dominion of Canada under the following conditions: (a) the amount of the loan secured by the second mortgage is equal to the sum of the amount disbursed by the company and the then outstanding indebtedness under the first mortgage loan; and (b) the company has control over the payments under the first mortgage indebtedness; and (c) the total amount of the loan does not exceed 66-2/3 percent of the market value of the real estate at the date of the loan or, when the note or bond is to be fully amortized by installment payments of principal, beginning not more than five years from the date of the loan, and interest at least annually over a period of not to exceed 40 years, the amount of the loan does not exceed 80 percent of the market value of the real estate at the date of the loan.\nA company may not invest in a mortgage loan authorized under this subdivision, if the investment causes the company's aggregate investments in mortgages secured by a single property to exceed one percent of its admitted assets.\nFor purposes of this subdivision, improved real estate includes real estate improved with permanent buildings, used for agriculture or pasture, or income producing real estate, including but not limited to, parking lots and leases, royalty or other mineral interests in properties producing oil, gas, or other minerals and interests in properties for the harvesting of forest products.\nA loan or obligation otherwise permitted under this subdivision must be permitted notwithstanding the fact that it provides for a payment of the principal balance prior to the end of the period of amortization of the loan.\nThe vendor's equity in a contract for deed qualifies as a loan secured by mortgage for the purposes of this subdivision.\n[Repealed, 1991 c 325 art 9 s 13]\n[Repealed, 1991 c 325 art 9 s 13]\n(a) Common stocks, common stock equivalents, or securities convertible into common stock or common stock equivalents of a business entity organized under the laws of the United States or any state thereof, or the Dominion of Canada or any province thereof.\n(b) Preferred stock of, or common or preferred stock guaranteed as to dividends by a business entity organized under the laws of the United States or any state thereof, or the Dominion of Canada or any province thereof, under the following conditions: (1) no investment may be made under this paragraph in a stock upon which any dividend, current or cumulative, is in arrears; (2) the company may not invest in stocks under this paragraph and in common stocks under paragraph (a) if the investment causes the company's aggregate investments in the common or preferred stocks to exceed 25 percent of the company's total admitted assets, provided that no more than 20 percent of the company's admitted assets may be invested in common stocks under paragraph (a); and (3) the company may not invest in any preferred stock or common stock guaranteed as to dividends, which is rated in the four lowest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners, if the investment causes the company's aggregate investment in the lower rated preferred or common stock guaranteed as to dividends to exceed five percent of its total admitted assets.\n(c) Warrants, options, and rights to purchase stock if the stock, at the time of the acquisition of the warrant, option, or right to purchase, would qualify as an investment under paragraph (a) or (b), whichever is applicable. A company shall not invest in a warrant, option, or right to purchase stock if, upon purchase and immediate exercise thereof, the acquisition of the stock violates any of the concentration limitations contained in paragraphs (a) and (b).\n(d) In addition to amounts that may be invested under subdivision 8 and without regard to the percentage limitation applicable to stocks, warrants, options, and rights to purchase, the securities of any face amount certificate company, unit investment trust, or management type investment company, registered or in the process of registration under the Investment Company Act of 1940 as from time to time amended. In addition, the company may transfer assets into one or more of its separate accounts for the purpose of establishing, or supporting its contractual obligations under, the accounts in accordance with the provisions of sections 61A.13 to 61A.21. A company may not invest in a security authorized under this paragraph if the investment causes the company's aggregate investments in the securities to exceed ten percent of its total admitted assets, except that for a health service plan corporation operating under chapter 62C, and for a health maintenance organization operating under chapter 62D, the company's aggregate investments may not exceed 20 percent of its total admitted assets. No more than five percent of the allowed investment by health service plan corporations or health maintenance organizations may be invested in funds that invest in assets not backed by the federal government. When investing in money market mutual funds, nonprofit health service plans regulated under chapter 62C, and health maintenance organizations regulated under chapter 62D, shall establish a trustee custodial account for the transfer of cash into the money market mutual fund.\n(e) Investment grade obligations that are:\n(1) bonds, obligations, notes, debentures, repurchase agreements, or other evidences of indebtedness of a business entity, organized under the laws of the United States or any state thereof, or the Dominion of Canada or any province thereof; and\n(2) rated in one of the four highest rating categories by at least one nationally recognized statistical rating organization, or are rated in one of the two highest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners.\n(f) Noninvestment grade obligations: A company may acquire noninvestment grade obligations as defined in item (i) (hereinafter noninvestment grade obligations) which meet the earnings test set forth in item (ii). A company may not acquire a noninvestment grade obligation if the acquisition will cause the company to exceed the limitations set forth in item (iii).\n(i) A noninvestment grade obligation is an obligation of a business entity, organized under the laws of the United States or any state thereof, or the Dominion of Canada or any province thereof, that is not rated in one of the four highest rating categories by at least one nationally recognized statistical rating organization, or is not rated in one of the two highest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners.\n(ii) Noninvestment grade obligations authorized by this subdivision may be acquired by a company if the business entity issuing or assuming the obligation, or the business entity securing or guaranteeing the obligation, has had net earnings after the elimination of extraordinary nonrecurring items of income and expense and before income taxes and fixed charges over the five immediately preceding completed fiscal years, or its period of existence of less than five years, has averaged not less than 1-1/4 times its average annual fixed charges applicable to the period; provided, however, that if a business entity issuing or assuming the obligation, or the business entity securing or guaranteeing the obligation, has undergone an acquisition, recapitalization, or reorganization within the immediately preceding 12 months, or will use the proceeds of the obligation for an acquisition, recapitalization, or reorganization, then such business entity shall also have, on a pro forma basis, for the next succeeding 12 months, net earnings averaging 1-1/4 times its average annual fixed charges applicable to such period after elimination of extraordinary nonrecurring items of income and expense and before taxes and fixed charges; no investment may be made under this section upon which any interest obligation is in default.\n(iii) Limitation on aggregate interest in noninvestment grade obligations. A company may not invest in a noninvestment grade obligation if the investment will cause the company's aggregate investments in noninvestment grade obligations to exceed the applicable percentage of admitted assets set forth in the following table:\nNothing in this paragraph limits the ability of a company to invest in noninvestment grade obligations as provided under subdivision 12.\n(g) Obligations for the payment of money under the following conditions: (1) The obligation must be secured, either solely or in conjunction with other security, by an assignment of a lease or leases on property, real or personal; (2) the lease or leases must be nonterminable by the lessee or lessees upon foreclosure of any lien upon the leased property; (3) the rents payable under the lease or leases must be sufficient to amortize at least 90 percent of the obligation during the primary term of the lease; and (4) the lessee or lessees under the lease or leases, or a governmental entity or business entity, organized under the laws of the United States or any state thereof, or the Dominion of Canada, or any province thereof, that has assumed or guaranteed any lessee's performance thereunder, must be a governmental entity or business entity whose obligations would qualify as an investment under subdivision 2 or paragraph (e) or (f). A company may acquire leases assumed or guaranteed by a noninvestment grade lessee unless the value of the lease, when added to the other noninvestment grade obligations owned by the company, exceeds 15 percent of the company's admitted assets.\n(h) A company may sell call options against stocks or other securities owned by the company and may purchase call options in a closing transaction against a call option previously written by the company. In addition to the authority granted by paragraph (c), to the extent and on the terms and conditions the commissioner determines to be consistent with the purposes of this chapter, a company may purchase or sell other exchange-traded call options, and may sell or purchase exchange-traded put options.\n(i) A company may not invest in a security or other obligation authorized under this subdivision if the investment, valued at cost at the date of purchase, causes the company's aggregate investment in any one business entity to exceed two percent of the company's admitted assets.\n(j) For nonprofit health service plan corporations regulated under chapter 62C, and for health maintenance organizations regulated under chapter 62D, a company may invest in commercial paper rated in one of the two highest rating categories by at least one nationally recognized statistical rating organization, or rated in one of the two highest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners, if the investment, valued at cost at the date of purchase, does not cause the company's aggregate investment in any one business entity to exceed six percent of the company's admitted assets.\nEquipment trust obligations or certificates which are adequately secured or other adequately secured instruments evidencing an interest in transportation equipment purchased, leased, or under contract for purchase or lease by a corporation incorporated in the United States or in Canada or by a receiver or trustee of such corporation and a right to receive determined portions of rental, purchase or other fixed obligatory payments for the use or purchase of such transportation equipment.\nInvestments in asset backed arrangements that meet the definitions and credit criteria provided in this subdivision. For purposes of this subdivision, \"asset backed arrangement\" means a loan participation or loan to or equity investment in a business entity that has as its primary business activity the acquisition and holding of financial assets for the benefit of its debt and equity holders.\nIn order to qualify for investment under this subdivision:\n(a) the investment in the asset backed arrangement must be secured by or represent an undivided interest in a single financial asset or a pool of financial assets; and\n(b) either (1) at least 90 percent of the dollar value of the financial assets held under the asset backed arrangement qualifies for direct investment under this section; (2) the investment in the asset backed arrangement is rated in one of the four highest rating categories by at least one nationally recognized statistical rating organization; or (3) the investment in the asset backed arrangement is rated in one of the two highest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners.\nExamples of asset backed arrangements authorized by this subdivision include, but are not limited to: general and limited partnership interests; participations under unit investment trusts such as collateralized mortgage obligations and collateralized bond obligations; shares in, or obligations of, corporations formed for holding investment assets, and contractual participation interests in a loan or group of loans.\nA company may not invest in an asset backed arrangement if the investment causes the company's aggregate investment in the financial assets held under the asset backed arrangement to exceed any of the concentration limits contained in this section.\nCertificates, notes, or other obligations issued by trustees or receivers of any institution created or existing under the laws of the United States or of any state, district, or territory thereof, which, or the assets of which, are being administered under the direction of any court having jurisdiction if such obligation is adequately secured as to principal and interest; the amount invested in the securities mentioned in this subdivision shall not, at any time, exceed 25 percent of the unassigned surplus and capital of the company.\nA domestic life insurance company may enter into financial transactions solely for the purpose of reducing the risk associated with assets and liabilities that the company has acquired or incurred or has legally contracted to acquire or incur, and not for speculative or other purposes. For purposes of this subdivision, \"financial transactions\" include, but are not limited to, futures, options to buy or sell fixed income securities, repurchase and reverse repurchase agreements, and interest rate swaps, caps, and floors. This authority is in addition to any other authority of the insurer.\nReal estate sales contracts to which the company is not an original party, involving unencumbered real property situated in the United States, having a value of at least 50 percent more than the amount of the unpaid balance of the contract, same to be assigned or otherwise transferred to the company or to a trustee or nominee of its choosing. No improvement shall be included in estimating the value unless the same shall be insured against fire by policies payable to and held by the company or a trustee or nominee for its benefit. The foregoing provisions of this subdivision shall not apply to real estate sales contracts to which the company is an original party and shall not prohibit the company from holding such contracts as an investment.\nLoans on the security of insurance policies issued by itself to an amount not exceeding the loan value thereof; and loans on the pledge of any of the securities eligible for investment under the provisions of subdivisions 2 to 10, with the exception of noninvestment grade obligations as defined in subdivision 6, paragraph (f), but not exceeding 95 percent of the value of securities enumerated in subdivisions 2, 3, and 4 and 80 percent of the value of stocks and other securities; in case of securities enumerated in subdivisions 3, 5, and 10 \"value\" means principal amount unpaid thereon and in case of other securities market value thereof; in case of securities enumerated in subdivisions 3 and 10 the pledge agreement shall require principal payments by the pledgor at least equal to and concurrent with principal payments on the pledged security; in loans authorized by this subdivision, except as otherwise provided by law in regard to policy loans, the company shall reserve the right at any time to declare the indebtedness due and payable when in excess of such proportions of value or, in case of pledge of securities other than those enumerated in subdivisions 3 and 10, upon depreciation of security. In the case of securities enumerated in subdivision 8, the provision of this subdivision must be applied in accordance with the type of security subject to the asset backed arrangement.\nInvestments of any kind, without regard to the categories, conditions, standards, or other limitations set forth in the foregoing subdivisions and section 61A.31, subdivision 3, except that the prohibitions in clause (d) of subdivision 3 remains applicable, may be made by a domestic life insurance company in an amount not to exceed the lesser of the following:\n(1) five percent of the company's total admitted assets as of the end of the preceding calendar year; or\n(2) fifty percent of the amount by which its capital and surplus as of the end of the preceding calendar year exceeds $675,000. Except as provided in section 61A.281, a company's total investment under this section in the common stock of any corporation, other than the stock of the types of corporations specified in section 61A.284, may not exceed ten percent of the common stock of the corporation. No investment may be made under the authority of this clause or clause (1) by a company that has not completed five years of actual operation since the date of its first certificate of authority.\nIf, subsequent to being made under the provisions of this subdivision, an investment is determined to have become qualified or eligible under any of the other provisions of this chapter, the company may consider the investment as being held under the other provision and the investment need no longer be considered as having been made under the provisions of this subdivision.\nIn addition to the investments authorized by this subdivision, with the written order of the commissioner, a domestic life insurance company may make qualified investments in any other type of investment or exceed any limitations of quality, quantity, or percentage of admitted assets contained in this section, section 61A.29 or 61A.31, or other provision governing the investments of a domestic life insurance company. This approval is at the discretion of the commissioner, provided that the additional investments allowed by the commissioner's written order may not exceed five percent of the company's admitted assets.\nUnder the standards and procedures in sections 60G.20 to 60G.22 for individual insurers, the commissioner may impose additional limitations on all insurers on the types and percentages of investments as the commissioner determines necessary to protect and ensure the safety of the general public.\nAn insurer engaging in replication transactions shall include all replicated investment positions in calculating compliance with the limitations on investments applicable to the insurer. Replication transactions are permitted only under the authority of subdivision 12. For these purposes, \"replication transaction\" means a derivative transaction that is intended to replicate the performance of one or more assets that an insurer is authorized to acquire under applicable law. A derivative transaction that either is authorized by subdivision 6, 8, or 9a or section 61A.29, subdivision 2, paragraph (d), or is entered into as a hedging transaction shall not be considered a replication transaction. \"Replicated investment position\" means the statement value of the position reported under the heading \"Replicated (Synthetic) Asset\" on Schedule DB, Part F, of the annual statement of the insurer, or any successor provision.",
	"repealed": false
}