{
	"id": "256B.0757",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0757",
	"title": "256B.0757 COORDINATED CARE THROUGH A HEALTH HOME.",
	"text": "(a) The commissioner shall provide medical assistance coverage of health home services for eligible individuals with chronic conditions who select a designated provider as the individual's health home.\n(b) The commissioner shall implement this section in compliance with the requirements of the state option to provide health homes for enrollees with chronic conditions, as provided under the Patient Protection and Affordable Care Act, Public Law 111-148, sections 2703 and 3502. Terms used in this section have the meaning provided in that act.\n(c) The commissioner shall establish health homes to serve populations with serious mental illness who meet the eligibility requirements described under subdivision 2. The health home services provided by health homes shall focus on both the behavioral and the physical health of these populations.\n(a) The commissioner may elect to develop health home models in accordance with United States Code, title 42, section 1396w-4.\n(b) An individual is eligible for health home services under this section if the individual is eligible for medical assistance under this chapter and has a condition that meets the definition of mental illness as described in section 245.462, subdivision 20, paragraph (a), or emotional disturbance as defined in section 245.4871, subdivision 15, clause (2). The commissioner shall establish criteria for determining continued eligibility.\n(a) An individual may be discharged from behavioral health home services if:\n(1) the behavioral health home services provider is unable to locate, contact, and engage the individual for a period of greater than three months after persistent efforts by the behavioral health home services provider; or\n(2) the individual is unwilling to participate in behavioral health home services as demonstrated by the individual's refusal to meet with the behavioral health home services provider, or refusal to identify the individual's health and wellness goals or the activities or support necessary to achieve these goals.\n(b) Before discharge from behavioral health home services, the behavioral health home services provider must offer a face-to-face meeting with the individual, the individual's identified supports, and the behavioral health home services provider to discuss options available to the individual, including maintaining behavioral health home services.\n(a) Health home services means comprehensive and timely high-quality services that are provided by a health home. These services include:\n(1) comprehensive care management;\n(2) care coordination and health promotion;\n(3) comprehensive transitional care, including appropriate follow-up, from inpatient to other settings;\n(4) patient and family support, including authorized representatives;\n(5) referral to community and social support services, if relevant; and\n(6) use of health information technology to link services, as feasible and appropriate.\n(b) The commissioner shall maximize the number and type of services included in this subdivision to the extent permissible under federal law, including physician, outpatient, mental health treatment, and rehabilitation services necessary for comprehensive transitional care following hospitalization.\nHealth home services are voluntary and an eligible individual may choose any designated provider. The commissioner shall establish designated providers to serve as health homes and provide the services described in subdivision 3 to individuals eligible under subdivision 2. The commissioner shall apply for grants as provided under section 3502 of the Patient Protection and Affordable Care Act to establish health homes and provide capitated payments to designated providers. For purposes of this section, \"designated provider\" means a provider, clinical practice or clinical group practice, rural clinic, community health center, community mental health center, or any other entity that is determined by the commissioner to be qualified to be a health home for eligible individuals. This determination must be based on documentation evidencing that the designated provider has the systems and infrastructure in place to provide health home services and satisfies the qualification standards established by the commissioner in consultation with stakeholders and approved by the Centers for Medicare and Medicaid Services.\nA behavioral health home services provider must:\n(1) be an enrolled Minnesota Health Care Programs provider;\n(2) provide a medical assistance covered primary care or behavioral health service;\n(3) utilize an electronic health record;\n(4) utilize an electronic patient registry that contains data elements required by the commissioner;\n(5) demonstrate the organization's capacity to administer screenings approved by the commissioner for substance use disorder or alcohol and tobacco use;\n(6) demonstrate the organization's capacity to refer an individual to resources appropriate to the individual's screening results;\n(7) have policies and procedures to track referrals to ensure that the referral met the individual's needs;\n(8) conduct a brief needs assessment when an individual begins receiving behavioral health home services. The brief needs assessment must be completed with input from the individual and the individual's identified supports. The brief needs assessment must address the individual's immediate safety and transportation needs and potential barriers to participating in behavioral health home services;\n(9) conduct a health wellness assessment within 60 days after intake that contains all required elements identified by the commissioner;\n(10) conduct a health action plan that contains all required elements identified by the commissioner. The plan must be completed within 90 days after intake and must be updated at least once every six months, or more frequently if significant changes to an individual's needs or goals occur;\n(11) agree to cooperate with and participate in the state's monitoring and evaluation of behavioral health home services; and\n(12) obtain the individual's consent to begin receiving behavioral health home services using a form approved by the commissioner.\n(a) The behavioral health home services provider must ensure that all staff delivering behavioral health home services receive adequate preservice and ongoing training, including:\n(1) training approved by the commissioner that describes the goals and principles of behavioral health home services; and\n(2) training on evidence-based practices to promote an individual's ability to successfully engage with medical, behavioral health, and social services to achieve the individual's health and wellness goals.\n(b) The behavioral health home services provider must ensure that staff are capable of implementing culturally responsive services, as determined by the individual's culture, beliefs, values, and language as identified in the individual's health wellness assessment.\n(c) The behavioral health home services provider must participate in the department's practice transformation activities to support continued skill and competency development in the provision of integrated medical, behavioral health, and social services.\n(a) A behavioral health home services provider must maintain staff with required professional qualifications appropriate to the setting.\n(b) If behavioral health home services are offered in a mental health setting, the integration specialist must be a licensed nurse, as defined in section 148.171, subdivision 9.\n(c) If behavioral health home services are offered in a primary care setting, the integration specialist must be a mental health professional who is qualified according to section 245I.04, subdivision 2.\n(d) If behavioral health home services are offered in either a primary care setting or mental health setting, the systems navigator must be a mental health practitioner who is qualified according to section 245I.04, subdivision 4, or a community health worker as defined in section 256B.0625, subdivision 49.\n(e) If behavioral health home services are offered in either a primary care setting or mental health setting, the qualified health home specialist must be one of the following:\n(1) a mental health certified peer specialist who is qualified according to section 245I.04, subdivision 10;\n(2) a mental health certified family peer specialist who is qualified according to section 245I.04, subdivision 12;\n(3) a case management associate as defined in section 245.462, subdivision 4, paragraph (g), or 245.4871, subdivision 4, paragraph (j);\n(4) a mental health rehabilitation worker who is qualified according to section 245I.04, subdivision 14;\n(5) a community paramedic as defined in section 144E.28, subdivision 9;\n(6) a peer recovery specialist as defined in section 245G.07, subdivision 1, clause (5); or\n(7) a community health worker as defined in section 256B.0625, subdivision 49.\n(a) A behavioral health home services provider must meet the following service delivery standards:\n(1) establish and maintain processes to support the coordination of an individual's primary care, behavioral health, and dental care;\n(2) maintain a team-based model of care, including regular coordination and communication between behavioral health home services team members;\n(3) use evidence-based practices that recognize and are tailored to the medical, social, economic, behavioral health, functional impairment, cultural, and environmental factors affecting the individual's health and health care choices;\n(4) use person-centered planning practices to ensure the individual's health action plan accurately reflects the individual's preferences, goals, resources, and optimal outcomes for the individual and the individual's identified supports;\n(5) use the patient registry to identify individuals and population subgroups requiring specific levels or types of care and provide or refer the individual to needed treatment, intervention, or services;\n(6) identify past and current treatment or services and identify potential gaps in care using a tool approved by the commissioner;\n(7) deliver services consistent with the standards for frequency and face-to-face contact required by the commissioner;\n(8) ensure that a diagnostic assessment is completed for each individual receiving behavioral health home services within six months of the start of behavioral health home services;\n(9) deliver services in locations and settings that meet the needs of the individual;\n(10) provide a central point of contact to ensure that individuals and the individual's identified supports can successfully navigate the array of services that impact the individual's health and well-being;\n(11) have capacity to assess an individual's readiness for change and the individual's capacity to integrate new health care or community supports into the individual's life;\n(12) offer or facilitate the provision of wellness and prevention education on evidenced-based curriculums specific to the prevention and management of common chronic conditions;\n(13) help an individual set up and prepare for medical, behavioral health, social service, or community support appointments, including accompanying the individual to appointments as appropriate, and providing follow-up with the individual after these appointments;\n(14) offer or facilitate the provision of health coaching related to chronic disease management and how to navigate complex systems of care to the individual, the individual's family, and identified supports;\n(15) connect an individual, the individual's family, and identified supports to appropriate support services that help the individual overcome access or service barriers, increase self-sufficiency skills, and improve overall health;\n(16) provide effective referrals and timely access to services; and\n(17) establish a continuous quality improvement process for providing behavioral health home services.\n(b) The behavioral health home services provider must also create a plan, in partnership with the individual and the individual's identified supports, to support the individual after discharge from a hospital, residential treatment program, or other setting. The plan must include protocols for:\n(1) maintaining contact between the behavioral health home services team member, the individual, and the individual's identified supports during and after discharge;\n(2) linking the individual to new resources as needed;\n(3) reestablishing the individual's existing services and community and social supports; and\n(4) following up with appropriate entities to transfer or obtain the individual's service records as necessary for continued care.\n(c) If the individual is enrolled in a managed care plan, a behavioral health home services provider must:\n(1) notify the behavioral health home services contact designated by the managed care plan within 30 days of when the individual begins behavioral health home services; and\n(2) adhere to the managed care plan communication and coordination requirements described in the behavioral health home services manual.\n(d) Before terminating behavioral health home services, the behavioral health home services provider must:\n(1) provide a 60-day notice of termination of behavioral health home services to all individuals receiving behavioral health home services, the commissioner, and managed care plans, if applicable; and\n(2) refer individuals receiving behavioral health home services to a new behavioral health home services provider.\n(a) The commissioner may grant a variance to specific requirements under subdivision 4a, 4b, 4c, or 4d for a behavioral health home services provider according to this subdivision.\n(b) The commissioner may grant a variance if the commissioner finds that:\n(1) failure to grant the variance would result in hardship or injustice to the applicant;\n(2) the variance would be consistent with the public interest; and\n(3) the variance would not reduce the level of services provided to individuals served by the organization.\n(c) The commissioner may grant a variance from one or more requirements to permit an applicant to offer behavioral health home services of a type or in a manner that is innovative, if the commissioner finds that the variance does not impede the achievement of the criteria in subdivision 4a, 4b, 4c, or 4d and may improve the behavioral health home services provided by the applicant.\n(d) The commissioner's decision to grant or deny a variance request is final and not subject to appeal.\nThe commissioner shall make payments to each designated provider for the provision of health home services described in subdivision 3 to each eligible individual under subdivision 2 that selects the health home as a provider.\nThe commissioner, to the extent feasible, shall ensure that the requirements and payment methods for designated providers developed under this section are consistent with the requirements and payment methods for health care homes established under sections 62U.03 and 256B.0753. The commissioner may modify requirements and payment methods under sections 62U.03 and 256B.0753 in order to be consistent with federal health home requirements and payment methods.\n[Repealed, 2014 c 262 art 2 s 18]\n(a) For continued certification under this section, health homes must meet process, outcome, and quality standards developed and specified by the commissioner. The commissioner shall collect data from health homes as necessary to monitor compliance with certification standards.\n(b) The commissioner may contract with a private entity to evaluate patient and family experiences, health care utilization, and costs.\n(c) The commissioner shall utilize findings from the implementation of behavioral health homes to determine populations to serve under subsequent health home models for individuals with chronic conditions.",
	"repealed": false
}