{
	"id": "336.9-628",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-628",
	"title": "336.9-628 NONLIABILITY AND LIMITATION ON LIABILITY OF SECURED PARTY; LIABILITY OF SECONDARY OBLIGOR.",
	"text": "(a) Limitation of liability of secured party for noncompliance with article. Subject to subsection (f), unless a secured party knows that a person is a debtor or obligor, knows the identity of the person, and knows how to communicate with the person:\n(1) the secured party is not liable to the person, or to a secured party or lienholder that has filed a financing statement against the person, for failure to comply with this article; and\n(2) the secured party's failure to comply with this article does not affect the liability of the person for a deficiency.\n(b) Limitation of liability based on status as secured party. Subject to subsection (f), a secured party is not liable because of its status as secured party:\n(1) to a person that is a debtor or obligor, unless the secured party knows:\n(A) that the person is a debtor or obligor;\n(B) the identity of the person; and\n(C) how to communicate with the person; or\n(2) to a secured party or lienholder that has filed a financing statement against a person, unless the secured party knows:\n(A) that the person is a debtor; and\n(B) the identity of the person.\n(c) Limitation of liability if good faith belief that transaction is not a consumer goods transaction or consumer transaction. A secured party is not liable to any person, and a persons liability for a deficiency is not affected, because of any act or omission arising out of the secured party's reasonable belief that a transaction is not a consumer goods transaction or a consumer transaction or that goods are not consumer goods, if the secured party's belief is based on its reasonable reliance on:\n(1) a debtor's representation concerning the purpose for which collateral was to be used, acquired, or held; or\n(2) an obligor's representation concerning the purpose for which a secured obligation was incurred.\n(d) Limitation of liability for statutory damages. A secured party is not liable to any person under section 336.9-625(c)(2) for its failure to comply with section 336.9-616.\n(e) Limitation of multiple liability for statutory damages. A secured party is not liable under section 336.9-625(c)(2) more than once with respect to any one secured obligation.\n(f) Exception: Limitation of liability under subsections (a) and (b) does not apply. Subsections (a) and (b) do not apply to limit the liability of a secured party to a person if, at the time the secured party obtains control of collateral that is a controllable account, controllable electronic record, or controllable payment intangible or at the time the security interest attaches to the collateral, whichever is later:\n(1) the person is a debtor or obligor; and\n(2) the secured party knows that the information in subsection (b)(1)(A), (B), or (C), relating to the person is not provided by the collateral, a record attached to or logically associated with the collateral, or the system in which the collateral is recorded.",
	"repealed": false
}