{
	"id": "256B.0653",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0653",
	"title": "256B.0653 HOME HEALTH AGENCY SERVICES.",
	"text": "This section applies to home health agency services including home health aide, skilled nursing visits, physical therapy, occupational therapy, respiratory therapy, and speech-language pathology therapy.\nFor the purposes of this section, the following terms have the meanings given.\n(a) \"Assessment\" means an evaluation of the recipient's medical need for home health agency services by a registered nurse or appropriate therapist that is conducted within 30 days of a request.\n(b) \"Home care therapies\" means occupational, physical, and respiratory therapy and speech-language pathology services provided in the home by a Medicare certified home health agency.\n(c) \"Home health agency services\" means services delivered by a home health agency to a recipient with medical needs due to illness, disability, or physical conditions in settings permitted under section 256B.0625, subdivision 6a.\n(d) \"Home health aide\" means an employee of a home health agency who completes medically oriented tasks written in the plan of care for a recipient.\n(e) \"Home health agency\" means a home care provider agency that is Medicare-certified.\n(f) \"Occupational therapy services\" mean the services defined in Minnesota Rules, part 9505.0390.\n(g) \"Physical therapy services\" mean the services defined in Minnesota Rules, part 9505.0390.\n(h) \"Respiratory therapy services\" mean the services defined in chapter 147C.\n(i) \"Speech-language pathology services\" mean the services defined in Minnesota Rules, part 9505.0390.\n(j) \"Skilled nurse visit\" means a professional nursing visit to complete nursing tasks required due to a recipient's medical condition that can only be safely provided by a professional nurse to restore and maintain optimal health.\n(k) \"Store-and-forward technology\" means telehomecare services that do not occur in real time via synchronous transmissions such as diabetic and vital sign monitoring.\n(l) \"Telehomecare\" means the use of telecommunications technology via live, two-way interactive audiovisual technology which may be augmented by store-and-forward technology.\n(m) \"Telehomecare skilled nurse visit\" means a visit by a professional nurse to deliver a skilled nurse visit to a recipient located at a site other than the site where the nurse is located and is used in combination with face-to-face skilled nurse visits to adequately meet the recipient's needs.\n(a) Home health aide visits must be provided by a certified home health aide using a written plan of care that is updated in compliance with Medicare regulations. A home health aide shall provide hands-on personal care, perform simple procedures as an extension of therapy or nursing services, and assist in instrumental activities of daily living as defined in section 256B.0659, including assuring that the person gets to medical appointments if identified in the written plan of care. Home health aide visits may be provided in the recipient's home or in the community where normal life activities take the recipient.\n(b) All home health aide visits must have authorization under section 256B.0652. The commissioner shall limit home health aide visits to no more than one visit per day per recipient.\n(c) Home health aides must be supervised by a registered nurse or an appropriate therapist when providing services that are an extension of therapy.\n(a) Skilled nurse visit services must be provided by a registered nurse or a licensed practical nurse under the supervision of a registered nurse, according to the written plan of care and accepted standards of medical and nursing practice according to chapter 148. Skilled nurse visit services must be ordered by a physician, advanced practice registered nurse, or physician assistant and documented in a plan of care that is reviewed and approved by the ordering practitioner at least once every 60 days. All skilled nurse visits must be medically necessary and provided in the recipient's home residence or in the community where normal life activities take the recipient, except as allowed under section 256B.0625, subdivision 6a.\n(b) Skilled nurse visits include face-to-face and telehomecare visits with a limit of up to two visits per day per recipient. All visits must be based on assessed needs.\n(c) Telehomecare skilled nurse visits are allowed when the recipient's health status can be accurately measured and assessed without a need for a face-to-face, hands-on encounter. All telehomecare skilled nurse visits must have authorization and are paid at the same allowable rates as face-to-face skilled nurse visits.\n(d) The provision of telehomecare must be made via live, two-way interactive audiovisual technology and may be augmented by utilizing store-and-forward technologies. Individually identifiable patient data obtained through real-time or store-and-forward technology must be maintained as health records according to sections 144.291 to 144.298. If the video is used for research, training, or other purposes unrelated to the care of the patient, the identity of the patient must be concealed.\n(e) Authorization for skilled nurse visits must be completed under section 256B.0652. A total of nine face-to-face skilled nurse visits per calendar year do not require authorization. All telehomecare skilled nurse visits require authorization.\n(a) Home care therapies include the following: physical therapy, occupational therapy, respiratory therapy, and speech and language pathology therapy services.\n(b) Home care therapies must be:\n(1) provided in the recipient's residence or in the community where normal life activities take the recipient after it has been determined the recipient is unable to access outpatient therapy;\n(2) prescribed, ordered, or referred by a physician, advanced practice registered nurse, or physician assistant, and documented in a plan of care and reviewed, according to Minnesota Rules, part 9505.0390;\n(3) assessed by an appropriate therapist; and\n(4) provided by a Medicare-certified home health agency enrolled as a Medicaid provider agency.\n(c) Restorative and specialized maintenance therapies must be provided according to Minnesota Rules, part 9505.0390. Physical and occupational therapy assistants may be used as allowed under Minnesota Rules, part 9505.0390, subpart 1, item B.\n(d) For both physical and occupational therapies, the therapist and the therapist's assistant may not both bill for services provided to a recipient on the same day.\nThe following are not eligible for payment under medical assistance as a home health agency service:\n(1) telehomecare skilled nurses services that is communication between the home care nurse and recipient that consists solely of a telephone conversation, facsimile, electronic mail, or a consultation between two health care practitioners;\n(2) the following skilled nurse visits:\n(i) for the purpose of monitoring medication compliance with an established medication program for a recipient;\n(ii) administering or assisting with medication administration, including injections, prefilling syringes for injections, or oral medication setup of an adult recipient, when, as determined and documented by the registered nurse, the need can be met by an available pharmacy or the recipient or a family member is physically and mentally able to self-administer or prefill a medication;\n(iii) services done for the sole purpose of supervision of the home health aide or personal care assistant;\n(iv) services done for the sole purpose to train other home health agency workers;\n(v) services done for the sole purpose of blood samples or lab draw when the recipient is able to access these services outside the home; and\n(vi) Medicare evaluation or administrative nursing visits required by Medicare;\n(3) home health aide visits when the following activities are the sole purpose for the visit: companionship, socialization, household tasks, transportation, and education;\n(4) home care therapies provided in other settings such as a clinic or as an inpatient or when the recipient can access therapy outside of the recipient's residence; and\n(5) home health agency services without qualifying documentation of a face-to-face encounter as specified in subdivision 7.\n(a) A face-to-face encounter by a qualifying provider must be completed for all home health services regardless of the need for prior authorization, except when providing a onetime perinatal visit by skilled nursing. The face-to-face encounter may occur through telehealth as defined in section 256B.0625, subdivision 3b. The encounter must be related to the primary reason the recipient requires home health services and must occur within the 90 days before or the 30 days after the start of services. The face-to-face encounter may be conducted by one of the following practitioners, licensed in Minnesota:\n(1) a physician;\n(2) an advanced practice registered nurse; or\n(3) a physician assistant.\n(b) The allowed practitioner, as described in this subdivision, performing the face-to-face encounter but who is not the ordering practitioner must communicate the clinical findings of that face-to-face encounter to the ordering practitioner. The clinical findings of that face-to-face encounter must be incorporated into a written or electronic document included in the recipient's medical record. To assure clinical correlation between the face-to-face encounter and the associated home health services, the practitioner responsible for ordering the services must:\n(1) document that the face-to-face encounter, which is related to the primary reason the recipient requires home health services, occurred within the required time period; and\n(2) indicate the practitioner who conducted the encounter and the date of the encounter.\n(c) For home health services requiring authorization, including prior authorization, home health agencies must retain the qualifying documentation of a face-to-face encounter as part of the recipient health service record, and submit the qualifying documentation to the commissioner or the commissioner's designee upon request.\nThe commissioner shall annually adjust payments for home health agency services to reflect the change in the federal Centers for Medicare and Medicaid Services Home Health Agency Market Basket. The commissioner shall use the indices as forecasted for the midpoint of the prior rate year to the midpoint of the current rate year.",
	"repealed": false
}