{
	"id": "609.6055",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.6055",
	"title": "609.6055 TRESPASS ON CRITICAL PUBLIC SERVICE FACILITY; UTILITY; OR PIPELINE.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Critical public service facility\" includes buildings and other physical structures, and fenced in or otherwise enclosed property, of railroad yards and stations, bus stations, airports, and other mass transit facilities; oil refineries; and storage areas or facilities for hazardous materials, hazardous substances, or hazardous wastes. The term also includes nonpublic portions of bridges. The term does not include railroad tracks extending beyond a critical public service facility.\n(c) \"Pipeline\" includes an aboveground pipeline, a belowground pipeline housed in an underground structure, and any equipment, facility, or building located in this state that is used to transport natural or synthetic gas, crude petroleum or petroleum fuels or oil or their derivatives, or hazardous liquids, to or within a distribution, refining, manufacturing, or storage facility that is located inside or outside of this state. Pipeline does not include service lines.\n(d) \"Utility\" includes:\n(1) any organization defined as a utility in section 216C.06, subdivision 18;\n(2) any telecommunications carrier or telephone company regulated under chapter 237; and\n(3) any local utility or enterprise formed for the purpose of providing electrical or gas heating and power, telephone, water, sewage, wastewater, or other related utility service, which is owned, controlled, or regulated by a town, a statutory or home rule charter city, a county, a port development authority, the Metropolitan Council, a district heating authority, a regional commission or other regional government unit, or a combination of these governmental units.\nThe term does not include property located above buried power or telecommunications lines or property located below suspended power or telecommunications lines, unless the property is fenced in or otherwise enclosed.\n(e) \"Utility line\" includes power, telecommunications, and transmissions lines as well as related equipment owned or controlled by a utility.\n(a) Whoever enters or is found upon property containing a critical public service facility, utility, or pipeline, without claim of right or consent of one who has the right to give consent to be on the property, is guilty of a gross misdemeanor, if:\n(1) the person refuses to depart from the property on the demand of one who has the right to give consent;\n(2) within the past six months, the person had been told by one who had the right to give consent to leave the property and not to return, unless a person with the right to give consent has given the person permission to return; or\n(3) the property is posted.\n(b) Whoever enters an underground structure that (1) contains a utility line or pipeline and (2) is not open to the public for pedestrian use, without claim of right or consent of one who has the right to give consent to be in the underground structure, is guilty of a gross misdemeanor. The underground structure does not need to be posted for this paragraph to apply.\nFor purposes of this section, a critical public service facility, utility, or pipeline is posted if there are signs that:\n(1) state \"no trespassing\" or similar terms;\n(2) display letters at least two inches high;\n(3) state that Minnesota law prohibits trespassing on the property; and\n(4) are posted in a conspicuous place and at intervals of 500 feet or less.\nAn employee or other person designated by a critical public service facility, utility, or pipeline to ensure the provision of services by the critical public service facility or the safe operation of the equipment or facility of the utility or pipeline who has reasonable cause to believe that a person is violating this section may detain the person as provided in this subdivision. The person detained must be promptly informed of the purpose of the detention and may not be subjected to unnecessary or unreasonable force or interrogation. The employee or other designated person must notify a peace officer promptly of the detention and may only detain the person for a reasonable period of time. No employee or other designated person is criminally or civilly liable for any detention that the employee or person reasonably believed was authorized by and conducted in conformity with this subdivision.\nA peace officer may arrest a person without a warrant if the officer has probable cause to believe the person violated this section within the preceding four hours. The arrest may be made even though the violation did not occur in the presence of the peace officer.",
	"repealed": false
}