{
	"id": "469.1735",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1735",
	"title": "469.1735 LIMIT ON TAX REDUCTIONS; APPLICATIONS REQUIRED.",
	"text": "To claim a tax credit under section 469.1734, subdivision 5, or an exemption from sales tax under section 469.1734, subdivision 6, a business must apply to the city for a tax credit certificate. As a condition of its application, the business must agree to furnish information to the city that is sufficient to verify the eligibility for any credits or other tax reductions claimed. The total amount of the state tax reductions allowed for the specified period may not exceed the amount of the tax credit certificates provided by the city to the business. The city must verify the amount of tax reduction or credits for which each business is eligible.\n(a) Each city may provide tax credit certificates to businesses that apply and meet the requirements for the tax credit and exemption. The certificates that each city may provide for the period covered by this section is limited to the amount specified in this subdivision.\n(b) The maximum amount of tax credit certificates each city may issue over the duration of the program equals the amount of the allocation to the city under section 469.169, subdivision 12.\n(a) A city may elect to use all or part of its allocation under subdivision 2 to reimburse the city or county or both for property tax reductions under section 272.0212. To elect this option, the city must notify the commissioner of revenue by October 1 of each calendar year of the amount of the property tax reductions for which it seeks reimbursements for taxes payable during the current year and the governmental units to which the amounts will be paid. The commissioner may require the city to provide information substantiating the amount of the reductions granted or any other information necessary to administer this provision. The commissioner shall pay the reimbursements by December 26 of the taxes payable year. Any amount transferred under this authority reduces the amount of tax credit certificates available under subdivisions 1 and 2.\n(b) The amount elected by the city under paragraph (a) is appropriated to the commissioner of revenue from the general fund to reimburse the city or county for tax reductions under section 272.0212. The amount appropriated may not exceed the maximum amounts allocated to a city under subdivision 2, paragraph (b), less the amount of certificates issued by the city under subdivision 1, and is available until expended.\nAn amount sufficient to fund any tax reductions under a waiver made by the commissioner under section 469.169, subdivision 12, paragraph (b), is appropriated to the commissioner of revenue from the general fund. This appropriation may not be deducted from the dollar limits under this section or section 469.169 or 469.1734.",
	"repealed": false
}