{
	"id": "473.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.175",
	"title": "473.175 REVIEW OF COMPREHENSIVE PLANS.",
	"text": "The council shall review the comprehensive plans of local governmental units, prepared and submitted pursuant to sections 473.851 to 473.871, to determine their compatibility with each other and conformity with metropolitan system plans. The council shall review and comment on the apparent consistency of the comprehensive plans with adopted plans of the council. The council may require a local governmental unit to modify any comprehensive plan or part thereof if, upon the adoption of findings and a resolution, the council concludes that the plan is more likely than not to have a substantial impact on or contain a substantial departure from metropolitan system plans. A local unit of government may challenge a council action under this subdivision by following the procedures set forth in section 473.866.\nWithin 120 days following receipt of a comprehensive plan of a local governmental unit, unless a time extension is mutually agreed to, the council shall return to the local governmental unit a statement containing its comments and, by resolution, its decision, if any, to require modifications to assure conformance with the metropolitan system plans.\nNo action shall be taken by any local governmental unit to place any such comprehensive plan or part thereof into effect until the council has returned the statement to the unit and until the local governmental unit has incorporated any modifications in the plan required by a final decision, order, or judgment made pursuant to section 473.866. If within 120 days, unless a time extension is mutually agreed to, the council fails to complete its written statement the plans shall be deemed approved and may be placed into effect. Any amendment to a plan subsequent to the council's review shall be submitted to and acted upon by the council in the same manner as the original plan. The written statement of the council shall be filed with the plan of the local government unit at all places where the plan is required by law to be kept on file.\nIf a local governmental unit fails to adopt a comprehensive plan in accordance with sections 473.851 to 473.871 or if the council after a public hearing by resolution finds that a plan substantially departs from metropolitan system plans and that the local governmental unit has not adopted a plan with modifications required pursuant to section 473.866 within nine months following a final decision, order, or judgment made pursuant to section 473.866, the council may commence civil proceedings to enforce the provisions of sections 473.851 to 473.871 by appropriate legal action in the district court where the local governmental unit is located.",
	"repealed": false
}