{
	"id": "508A.351",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.351",
	"title": "508A.351 COMMON INTEREST COMMUNITY CERTIFICATE.",
	"text": "MS 2000 [Repealed, 2001 c 50 s 37]\nPrior to recording with the registrar of titles of a declaration or bylaws for a condominium, or an amendment to the declaration or bylaws, or a supplemental declaration pursuant to section 515B.2-111, a determination must be made by an order of court in a proceeding subsequent to initial registration or by a written directive of the examiner of titles that the documents comply with the requirements of the applicable condominium statute.\nThe registrar of titles shall carry forward the memorial set forth in subdivision 1 until directed to remove it by a court order as provided for in section 508A.71.\nUpon the recording of a declaration creating a condominium or a planned community pursuant to chapter 515B, the registrar shall issue a certificate of title, designated as a \"common interest community certificate of title,\" (\"CICCT\"). It must be in substantially the following form:\nCOMMON INTEREST COMMUNITY CERTIFICATE OF TITLE (CICCT)\nThis is the Common Interest Community Certificate of Title for CIC No. ...........\nThis is to certify that the units and common elements in CIC No........ are subject to the encumbrances, liens, and interests noted by the memorials set forth as follows:\nIn witness whereof, I have hereunto subscribed my name and affixed the seal of my office, this ....... day of ......., .....\nCICCTs must be maintained in the same manner as provided for certificates of title under chapter 508 and must be indexed in the tract index as provided in section 508.37, subdivision 1a. The names of the owners in the tract index must be \"owners.\" The description of the registered land in the tract index must be \"common interests\" or \"CICCT.\"\nCPTs issued for the units described in the declaration and for common elements described in the declaration for a planned community, must contain a statement in substantially the following form: \"subject to encumbrances, liens, and interests noted on CICCT No. .......\"\nThe condominium or planned community declaration, bylaws, any amendment to the declaration or bylaws; any supplemental declaration pursuant to section 515B.2-111; any lien against the common elements in a condominium pursuant to chapter 514; any fixture filings pursuant to section 336.9-314 where the financing statement describes the common elements in a condominium; any easement on the common elements in a condominium pursuant to section 515B.3-102, subsection (a)(9); any instrument evidencing the transfer of a special declarant right pursuant to section 515B.3-104; and any conveyance or encumbrance of the common elements in a condominium pursuant to section 515B.3-112 must be entered as memorials on the CICCT only. The entry of a memorial on the CICCT shall have the same effect as if the memorial were entered on the certificates of title for the units in the common interest community and on the certificates of title for the common elements in a planned community.\n(a) Except as provided in paragraph (b), in the case of a condominium existing prior to August 1, 2009, on registered land, for which no CICCT has been issued, upon the recording of a document of the kind specified in subdivision 5, the registrar shall issue a CICCT, but documents filed prior to the issuance of the CICCT need not be entered as memorials on the CICCT. The registrar for no additional fee shall enter on the certificate of title for each of the units in the condominium the statement specified in subdivision 4.\n(b) In the case of a condominium for which a CECT has been issued pursuant to Laws 2001, chapter 50, section 4, upon the recording of a document specified in subdivision 5, the registrar shall cancel the CECT and issue a CICCT in lieu thereof. The statement on the certificate of title for each of the units in the condominium regarding the CECT shall be amended by the registrar for no additional fee to refer to the CICCT.\nIn the case of a planned community, as defined in chapter 515B, existing prior to August 1, 2009, on registered land, for which no CICCT has been issued, upon the recording of any amendment to the declaration of the planned community, or any supplemental declaration pursuant to section 515B.2-111, which identifies the common interest community number of the planned community, the registrar shall issue a CICCT, but documents filed prior to the issuance of the CICCT need not be entered as memorials on the CICCT. The registrar for no additional fee shall enter on the certificate of title for each of the units and for the common elements in the planned community the statement specified in subdivision 4.",
	"repealed": false
}