{
	"id": "176.239",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.239",
	"title": "176.239 ADMINISTRATIVE DECISION CONCERNING DISCONTINUANCE OF COMPENSATION.",
	"text": "The purpose of this section is to provide a procedure for parties to obtain an expedited interim administrative decision in disputes over discontinuance of temporary total, temporary partial, or permanent total compensation.\nIf the employee disagrees with the notice of discontinuance, the employee may request that the office schedule an administrative conference to be conducted pursuant to this section.\nIf temporary total, temporary partial, or permanent total compensation has been discontinued because the employee has returned to work, and the employee believes benefits should be reinstated due to occurrences during the initial 14 calendar days of the employee's return to work, the employee's request must be received by the office within 30 calendar days after the employee has returned to work. If the employer has failed to properly serve and file the notice as provided in section 176.238, the employee's time period to request an administrative conference is extended up to and including the 40th calendar day subsequent to the return to work.\nIf temporary total, temporary partial, or permanent total compensation has been discontinued for a reason other than a return to work, the employee's request must be received by the office within 12 calendar days after the notice of discontinuance is received by the commissioner. If the employer discontinues compensation without giving notice as required by section 176.238, the employee's time period for requesting an administrative conference is extended up to and including the 40th calendar day after which the notice should have been served and filed.\nThe office may determine that an administrative conference is not necessary under this section for reasons prescribed by rule and permit the employer to discontinue compensation, subject to the employee's right to file an objection to discontinuance under section 176.238, subdivision 4.\nIn lieu of making a written request for an administrative conference with the office, an employee may make an in-person or telephone request for the administrative conference.\n(a) If a notice of discontinuance has been served and filed due to the employee's return to work, and the employee requests a conference, the employer is not obligated to reinstate or otherwise pay temporary total, temporary partial, or permanent total compensation unless so ordered by the compensation judge.\n(b) When an administrative conference is conducted under circumstances in which the employee has not returned to work, compensation shall be paid through the date of the administrative conference unless:\n(1) the employee has returned to work since the notice was filed;\n(2) the employee fails to appear at the scheduled administrative conference; or\n(3) due to unusual circumstances or pursuant to the rules of the division, the compensation judge orders otherwise.\nIf the employee timely requests an administrative conference under this section, the office shall schedule a conference within ten calendar days after receiving the request.\nAn employee or employer may request a continuance of a scheduled administrative conference. If the compensation judge determines there is good cause for a continuance, the compensation judge may grant the continuance for not more than 14 calendar days unless the parties agree to a longer continuance. If compensation is payable through the day of the administrative conference pursuant to subdivision 3, and the employee is granted a continuance, compensation need not be paid during the period of continuance unless the compensation judge orders otherwise. If the employer is granted a continuance and compensation is payable through the day of the administrative conference pursuant to subdivision 3, then compensation shall continue to be paid during the continuance. The compensation judge may grant an unlimited number of continuances provided that payment of compensation during any continuance is subject to this subdivision.\nIf benefits have been discontinued due to the employee's return to work, the compensation judge shall determine whether, as a result of occurrences arising during the initial 14 calendar days after the return to work, the employee is entitled to additional payment of temporary total, temporary partial, or permanent total compensation.\nIf periodic payment of temporary total, temporary partial, or permanent total compensation has been discontinued for reasons other than a return to work, the compensation judge shall determine whether the employer has reasonable grounds to support the discontinuance. Only reasons specified on the notice of discontinuance shall provide a basis for a discontinuance, unless the parties agree otherwise.\nAfter considering the information provided by the parties at the administrative conference and exhibits filed by the parties with the office, the compensation judge shall issue to all interested parties a written decision on payment of compensation. Administrative decisions under this section shall be issued within five working days from the close of the conference. Disputed issues of fact shall be determined by a preponderance of the evidence.\nAn employee who disagrees with the interim administrative decision under this section may file an objection to discontinuance under section 176.238, subdivision 4. An employer who disagrees with the interim administrative decision under this section may file a petition to discontinue under section 176.238, subdivision 5.\nThe interim administrative decision under this section is binding upon the parties and the rights and obligations of the parties are governed by the decision.\nIf an objection or a petition is filed under subdivision 8, the interim administrative decision remains in effect and the parties' obligations or rights to pay or receive compensation are governed by the interim administrative decision, pending a determination by a compensation judge pursuant to section 176.238, subdivision 6.\nIf the discontinuance has been denied, the employer shall continue paying compensation until an order is issued by a compensation judge, the court of appeals, or the supreme court, allowing compensation to be discontinued, or unless, during the interim, occurrences arise justifying the filing of a notice under section 176.238, subdivision 1 or 2, and the discontinuance is permitted by the compensation judge or no conference is requested. If a compensation judge after a de novo hearing, the court of appeals, or the supreme court later rules that the discontinuance was proper or that benefits were otherwise not owing the employee, payments made under the interim administrative decision and order shall be treated as an overpayment which the insurer may recover from the employee subject to section 176.179.\nIf the compensation judge has permitted a discontinuance or otherwise not ordered commencement of benefits, the service and filing of the administrative decision relieves the employer from further liability for compensation subject to the right of review afforded by this chapter.\nThis section is applicable to all cases in which the employee's request for an administrative conference is received by the office after July 1, 1987, even if the injury occurred prior to July 1, 1987. This section shall not apply to those employees who have been adjudicated permanently totally disabled, or to those employees who have been administratively determined pursuant to division rules to be permanently totally disabled.",
	"repealed": false
}