{
	"id": "122A.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.48",
	"title": "122A.48 TEACHER EARLY RETIREMENT INCENTIVE PROGRAM.",
	"text": "For purposes of this section, \"teacher\" means a teacher as defined in section 122A.15, subdivision 1, who:\n(a) is employed in a public elementary or secondary school in the state and\n(b) either\n(1)(i) has at least 15 total years of full-time teaching service in elementary, secondary, and technical colleges, or at least 15 years of allowable service as defined in sections 354.05, subdivision 13; 354.092; 354.093; 354.094; 354.53; 354.66; 354A.011, subdivision 4; 354A.091; 354A.092; 354A.093; 354A.094; or Laws 1982, chapter 578, article II, section 1 and\n(ii) has or will have attained the age of 55 years but less than 65 years as of the June 30 in the school year during which an application for an early retirement incentive is made, or\n(2) has at least 30 total years of full-time teaching service in elementary, secondary, and technical colleges, or at least 30 years of allowable service as defined in sections 354.05, subdivision 13; 354.092; 354.093; 354.094; 354.53; 354.66; 354A.011, subdivision 4; 354A.091; 354A.092; 354A.093; 354A.094; or Laws 1982, chapter 578, article II, section 1.\nFor purposes of this section, \"retirement\" means termination of services in the employing district and withdrawal from active teaching service.\nNotwithstanding the provisions of subdivision 2, a teacher who has entered into an agreement for termination of services and withdrawal from active teaching service with an early retirement incentive may be employed as a substitute teacher, behind-the-wheel instructor, or coach after retirement.\nAny amount of unemployment benefits that the teacher receives and for which the district is required to pay into the unemployment insurance program trust fund pursuant to section 268.052, subdivision 1, may be deducted by the district from the amount of the teacher's early retirement incentive or recovered by the district from the teacher up to the amount of the early retirement incentive.\nA teacher meeting the requirements of subdivision 1 may apply to the school board of the employing district for a contract for termination of services, withdrawal from active teaching service, and payment of an early retirement incentive. This application must be submitted on or before February 1 of the school year at the end of which the teacher wishes to retire. A school board must approve or deny the application within 30 days after it is received by the board. The amount of the early retirement incentive shall be agreed upon between the teacher and the school board. The early retirement incentive shall be paid by the employing district at the time and in the manner mutually agreed upon by a teacher and the board.",
	"repealed": false
}