{
	"id": "611.216",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.216",
	"title": "611.216 CRIMINAL AND JUVENILE DEFENSE GRANTS.",
	"text": "The Board of Public Defense shall establish procedures for public defense corporations based in this state to apply for funding by the legislature. The applications must be submitted to the board. The board must review and prioritize them and include a recommended funding level for each corporation in the budget request the board submits to the legislature. Money appropriated to provide criminal and juvenile defense to indigent individuals must be distributed by the Board of Public Defense to the nonprofit criminal and juvenile defense corporations included in the board's budget request or otherwise designated by law. Money may not be disbursed to a corporation in the Leech Lake Reservation area or the White Earth Reservation area without prior approval by the respective reservation tribal council. A corporation may accept cases involving felony, gross misdemeanor, and misdemeanor charges, and juvenile cases if financial eligibility standards are met, unless there is a legal or ethical reason for rejecting a case. A corporation may accept cases arising outside its geographic area of responsibility, as appropriate. Each corporation, in order to ensure broad support, shall provide matching money received from nonstate sources, which may include money or in-kind contribution from federal agencies, local governments, private agencies, and community groups, equal to ten percent of its state appropriation. The Board of Public Defense shall give notice 30 days in advance and conduct a hearing if it has reasonable grounds to believe money appropriated for this purpose is being improperly used, or if it has reasonable cause to believe criminal and juvenile defense of proper quality is not being supplied. Payment must cease from the date of notice until either the Board of Public Defense determines that the money appropriated will be properly handled, or the Board of Public Defense determines that criminal and juvenile defense of proper quality will be provided. A participating corporation may give notice at any time of its withdrawal from this program of financial assistance.\n[Repealed, 1998 c 367 art 8 s 26]\nAn employee, administrator, officer, contractor, or agent of a recipient of the money provided by this section who discriminates on the basis of sex, race, color, national origin, religion, or creed is guilty of a gross misdemeanor.\nEach corporation shall submit reports showing, at a minimum, the number of clients served, the number of charges brought, the number of cases of each kind, such as felonies, gross misdemeanors, misdemeanors, and juvenile delinquencies, the number of dispositions of each kind, such as jury trials, court trials, guilty pleas, and dismissals, the number of court appearances, and financial data.\nThe legislative auditor may conduct periodic postaward audits of these grants as may be requested by the Board of Public Defense and approved by the Legislative Audit Commission.",
	"repealed": false
}