{
	"id": "142F.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.12",
	"title": "142F.12 SUPPLEMENTAL NUTRITION ASSISTANCE OUTREACH PROGRAM.",
	"text": "The commissioner of children, youth, and families shall implement a Supplemental Nutrition Assistance Program (SNAP) outreach program to inform low-income households about the availability, eligibility requirements, application procedures, and benefits of SNAP that meets the requirements of the United States Department of Agriculture.\nIn addition to any other duties imposed by federal law, the commissioner shall:\n(1) supervise the administration of the SNAP outreach program according to guidance provided by the United States Department of Agriculture;\n(2) submit the SNAP outreach plan and budget to the United States Department of Agriculture;\n(3) accept any funds provided by the federal government or other sources for SNAP outreach;\n(4) administer the request-for-proposals process and establish contracts with grantees to ensure SNAP outreach services are available to inform low-income households statewide;\n(5) approve budgets from grantees to ensure that activities are eligible for federal reimbursement;\n(6) monitor grantees, review invoices, and reimburse grantees for allowable costs that are eligible for federal reimbursement;\n(7) provide technical assistance to grantees to ensure that projects support SNAP outreach goals and project costs are eligible for federal reimbursement;\n(8) work in partnership with counties, Tribal Nations, and community organizations to enhance the reach and services of a statewide SNAP outreach program; and\n(9) identify and leverage eligible nonfederal funds to earn federal reimbursement for SNAP outreach.\n(a) Grantees must submit allowable costs for approved SNAP outreach activities to the commissioner in order to receive federal reimbursement.\n(b) The commissioner shall disburse federal reimbursement funds for allowable costs for approved SNAP outreach activities to the state agency or grantee that incurred the costs being reimbursed.",
	"repealed": false
}