{
	"id": "349.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.165",
	"title": "349.165 PREMISES PERMITS.",
	"text": "A licensed organization may not conduct lawful gambling at any site unless it has first obtained from the board a premises permit for the site. The board shall prescribe a form for permit applications, and each application for a permit must be submitted on a separate form. The premises permit issued by the board runs concurrently on a perpetual basis with the license of the organization unless the premises permit is suspended or revoked by the board, or voluntarily terminated by the organization. The board may by rule limit the number of premises permits that may be issued to an organization.\nAn application for a premises permit must contain:\n(1) the name and address of the applying organization;\n(2) a description of the site for which the permit is sought, including its address and, where applicable, its placement within another premises or establishment;\n(3) if the site is leased, the name and address of the lessor and information about the lease the board requires, including all rents and other charges for the use of the site. The lease term is concurrent with the term of the premises permit. The lease must contain a termination clause. No lease is required for the conduct of a raffle; and\n(4) other information the board deems necessary to carry out its purposes.\nAn organization holding a premises permit must notify the board in writing within ten days whenever any material change is made in the above information.\nThe board may issue premises permits to organizations licensed under section 349.16, subdivision 6. The annual fee for each premises permit is $150.\nNo organization may seek or accept assistance from a manufacturer or distributor, or a representative, agent, affiliate, or employee of a manufacturer or distributor, in identifying potential locations for gambling conducted by the organization.\n(a) A licensed organization may conduct lawful gambling on a premises other than the organization's permitted premises if it has first submitted to the board an application and a lease on forms provided by the board, obtained authorization required under section 349.213, and received a permit from the board for each event up to 12 events in a calendar year, not to exceed three days per event.\n(b) No lease is required for the conduct of a raffle.\n(c) No fee may be assessed for an off-site permit by the board or by local authority under section 349.213.",
	"repealed": false
}