{
	"id": "256L.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.01",
	"title": "256L.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms shall have the meanings given them.\n\"Child\" means an individual under 21 years of age.\n\"Affordable Care Act\" means the federal Patient Protection and Affordable Care Act, Public Law 111-148, as amended, including the federal Health Care and Education Reconciliation Act of 2010, Public Law 111-152, and any amendments to, and any federal guidance or regulations issued under, these acts.\n\"Commissioner\" means the commissioner of human services.\n\"Eligible providers\" means those health care providers who provide covered health services to medical assistance recipients under rules established by the commissioner for that program.\n(a) Except as provided in paragraphs (c) and (d), \"family\" has the meaning given for family and family size as defined in Code of Federal Regulations, title 26, section 1.36B-1.\n(b) The term includes children who are temporarily absent from the household in settings such as schools, camps, or parenting time with noncustodial parents.\n(c) For an individual who does not expect to file a federal tax return and does not expect to be claimed as a dependent for the applicable tax year, \"family\" has the meaning given in Code of Federal Regulations, title 42, section 435.603(f)(3).\n(d) For a married couple, \"family\" has the meaning given in Code of Federal Regulations, title 42, section 435.603(f)(4).\n[Repealed, 2009 c 173 art 3 s 26]\n[Repealed, 2013 c 108 art 1 s 68]\n\"Income\" has the meaning given for modified adjusted gross income, as defined in Code of Federal Regulations, title 26, section 1.36B-1, and means a household's projected annual income for the applicable tax year.\n\"MNsure\" means the state health benefit exchange as defined in section 62V.02.\n\"Participating entity\" means a health carrier as defined in section 62A.01, subdivision 2; a county-based purchasing plan established under section 256B.692; an accountable care organization or other entity operating a health care delivery systems demonstration project authorized under section 256B.0755; an entity operating a county integrated health care delivery network pilot project authorized under section 256B.0756; or a network of health care providers established to offer services under MinnesotaCare.",
	"repealed": false
}