{
	"id": "18.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.77",
	"title": "18.77 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 18.76 to 18.91.\n[Repealed, 1996 c 310 s 1]\n\"Certified noxious weed free\" means that the material being certified has been inspected, tested, or processed to devitalize or remove the noxious weed propagating parts in order to verify that viable noxious weed propagating parts are not present in the material.\n\"Commissioner\" means the commissioner of agriculture.\n\"Control\" means to manage or prevent the maturation and spread of propagating parts of noxious weeds from one area to another by a lawful method that does not cause unreasonable adverse effects on the environment as defined in section 18B.01, subdivision 31.\n\"County-designated employee\" means a person designated by a county board to oversee the responsibilities in section 18.81, subdivision 1a.\n\"Eradicate\" means to destroy the aboveground and belowground plant parts of noxious weeds by a lawful method, which prevents the maturation and spread of noxious weed propagating parts from one area to another.\n\"Growing crop\" means an agricultural, horticultural, or forest crop that has been planted or regularly maintained and intended for harvest. It does not mean a permanent pasture, hay meadow, woodlot, or other noncrop area that contains native or seeded perennial plants used for grazing or hay purposes, and that is not harvested on a regular basis.\n\"Inspector\" means the commissioner, agent of the commissioner, county agricultural inspector, local weed inspector, or assistant weed inspector.\n\"Land\" means a parcel or tract of real estate including wetlands and public waters but not including buildings unless they are a place of business and open to the general public.\n\"Municipality\" means a home rule charter or statutory city or a township.\n\"Noxious weed\" means an annual, biennial, or perennial plant that the commissioner designates to be injurious to public health, the environment, public roads, crops, livestock, or other property.\n\"Noxious weed management plan\" means controlling or eradicating noxious weeds in the manner designated in a management plan developed for the location where the infestations are found using specific strategies or methods that are to be used singly or in combination to achieve control or eradication.\n\"Occupant\" means a person who uses land as a principal residence or who leases land or both.\n\"Permanent pasture, hay meadow, woodlot, or other noncrop area\" means an area of predominantly native or seeded perennial plants that can be used for grazing or hay purposes but is not harvested on a regular basis and is not considered to be a growing crop.\n\"Person\" means an individual, partnership, corporation, society, association, firm, public agency, or an agent for one of those entities.\n\"Propagating parts\" means all plant parts, including seeds, that are capable of producing new plants.\n\"Noxious weed management site\" means a designated area where special or unique noxious weed control or eradication strategies or methods are used according to a specific management plan developed for each management area established.\n\"Cooperative weed management areas\" or \"CWMAs\" means partnership organizations formed with the goal of managing invasive plants across jurisdictional and land ownership boundaries through collective planning and sharing of knowledge and resources.\n\"Biological control of plants\" means the reduction of noxious weed or invasive plant populations through the use of natural enemies such as parasitoids, predators, pathogens, antagonists, or competitors to suppress noxious weed or invasive plant populations.\n\"Appropriate disposal site\" means a facility that lawfully destroys noxious weeds and noxious weed propagating parts.\n\"Invasive plant\" means a nonnative species whose introduction and establishment causes, or may cause, economic or environmental harm or harm to human health.",
	"repealed": false
}