{
	"id": "256B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.03",
	"title": "256B.03 PAYMENTS TO VENDORS.",
	"text": "All payments for medical assistance hereunder must be made to the vendor. The maximum payment for new vendors enrolled in the medical assistance program after the base year shall be determined from the average usual and customary charge of the same vendor type enrolled in the base year.\n[Repealed, 2000 c 449 s 15]\n(a) Notwithstanding subdivision 1 and section 256B.0625, the commissioner may make payments to federally recognized Indian tribes with a reservation in the state to provide medical assistance to Indians, as defined under federal law, who reside on or near the reservation. The payments may be made in the form of a block grant or other payment mechanism determined in consultation with the tribe. Any alternative payment mechanism agreed upon by the tribes and the commissioner under this subdivision is not dependent upon county or health plan agreement but is intended to create a direct payment mechanism between the state and the tribe for the administration of the medical assistance program, and for covered services.\n(b) A tribe that implements a purchasing model under this subdivision shall report to the commissioner at least annually on the operation of the model. The commissioner and the tribe shall cooperatively determine the data elements, format, and timetable for the report.\n(c) For purposes of this subdivision, \"Indian tribe\" means a tribe, band, or nation, or other organized group or community of Indians that is recognized as eligible for the special programs and services provided by the United States to Indians because of their status as Indians and for which a reservation exists as is consistent with Public Law 100-485, as amended.\n(d) Payments under this subdivision may not result in an increase in expenditures that would not otherwise occur in the medical assistance program under this chapter.\n[See Note.]\nPayments for medical assistance must not be made:\n(1) for services delivered or items supplied outside of the United States; or\n(2) to a provider, financial institution, or entity located outside of the United States.\nClaims for payments for supplies or services that are based on an order or referral of a provider must include the ordering or referring provider's national provider identifier (NPI). Claims for supplies or services ordered or referred by a vendor who is not enrolled in medical assistance are not covered.",
	"repealed": false
}