{
	"id": "197.608",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.608",
	"title": "197.608 VETERANS SERVICE OFFICE GRANT PROGRAM.",
	"text": "A veterans service office grant program is established to be administered by the commissioner of veterans affairs consisting of grants to counties to enable them to enhance the effectiveness of their veterans service offices. \"Commissioner\" as used in this section means the commissioner of veterans affairs.\nThe commissioner shall consult with the Minnesota Association of County Veterans Service Officers in formulating rules to implement the grant program.\n[Repealed, 2013 c 142 art 4 s 12]\n(a) To be eligible for a grant under subdivision 6, a county must employ a county veterans service officer as authorized by sections 197.60 and 197.606, who is certified to serve in this position by the commissioner.\n(b) A county that employs a newly hired county veterans service officer who is serving an initial probationary period and who has not been certified by the commissioner is eligible to receive a grant under subdivision 6 for one year from the date the county veterans service officer is appointed.\n(c) A county whose county veterans service officer does not receive certification by the end of the first year of the county veterans service officer's appointment is ineligible for the grant under subdivision 6 until the county veterans service officer receives certification.\n(a) The commissioner shall determine the process for awarding grants. A grant may be used only for the purpose of enhancing the operations of the County Veterans Service Office.\n(b) The commissioner shall provide a list of qualifying uses for grant expenditures as developed in subdivision 5 and shall approve a grant under subdivision 6 only for a qualifying use and if there are sufficient funds remaining in the grant program to cover the full amount of the grant.\n(c) The commissioner is authorized to use any unexpended funding for this program for the following purposes:\n(1) to provide training and education for county veterans service officers; and\n(2) to provide additional grants on a competitive basis to any county that proposes to provide programs and services that the commissioner determines to be new and innovative in serving veterans and their families.\nThe commissioner shall consult with the Minnesota Association of County Veterans Service Officers in developing a list of qualifying uses for grants awarded under subdivision 6.\n(a) Each county is eligible to receive an annual grant of $7,500 for the following purposes:\n(1) to provide outreach to the county's veterans;\n(2) to assist in the reintegration of combat veterans into society;\n(3) to collaborate with other social service agencies, educational institutions, and other community organizations for the purposes of enhancing services offered to veterans;\n(4) to reduce homelessness among veterans; and\n(5) to enhance the operations of the county veterans service office.\n(b) In addition to the grant amount in paragraph (a), each county is eligible to receive an additional annual grant under this paragraph. The amount of each additional annual grant must be determined by the commissioner and may not exceed:\n(1) $0, if the county's veteran population is less than 1,000;\n(2) $2,500, if the county's veteran population is 1,000 or more but less than 3,000;\n(3) $5,000, if the county's veteran population is 3,000 or more but less than 5,000;\n(4) $7,500, if the county's veteran population is 5,000 or more but less than 10,000;\n(5) $10,000, if the county's veteran population is 10,000 or more but less than 20,000;\n(6) $15,000, if the county's veteran population is 20,000 or more but less than 30,000; or\n(7) $20,000, if the county's veteran population is 30,000 or more.\n(c) The Minnesota Association of County Veterans Service Officers is eligible to receive an annual grant of $100,000. The grant shall be used for administrative costs of the association, certification of mandated county veterans service officer training and accreditation, and costs associated with reintegration services.\nThe veteran population of each county shall be determined by the figure supplied by the United States Department of Veterans Affairs, as adopted by the commissioner.\nIf a county fails to use the grant for the qualified use approved by the commissioner, the commissioner shall seek recovery of the grant from the county and the county must repay the grant amount.",
	"repealed": false
}