{
	"id": "17.4988",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4988",
	"title": "17.4988 LICENSE AND INSPECTION FEES.",
	"text": "A permit or license must be issued by the commissioner if the requirements of law are met and the license and permit fees specified in this section are paid.\n(a) The annual fee for an aquatic farming license is $210 for the base license. The commissioner must establish an additional fee based on the acreage of the operation.\n(b) The aquatic farming license may contain endorsements for the rights and privileges of the following licenses under the game and fish laws. The endorsement must be made upon payment of the license fee prescribed in section 97A.475 for the following licenses:\n(1) minnow dealer license;\n(2) minnow retailer license for sale of minnows as bait;\n(3) minnow exporting license;\n(4) aquatic farm vehicle endorsement, which includes a minnow dealer vehicle license, a minnow retailer vehicle license, an exporting minnow vehicle license, and a fish vendor license;\n(5) sucker egg taking license; and\n(6) game fish packers license.\nNotwithstanding section 16A.1283, the commissioner may, by written order published in the State Register, establish fees for the services listed in clauses (1) to (3) and the additional fee required under subdivision 2, paragraph (a). The fees must be set in an amount that does not recover significantly more or less than the cost of providing the service. The fees are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The services covered under this provision include:\n(1) initial inspection of each water to be licensed;\n(2) fish health inspection and certification, including initial tissue sample collection, basic fish health assessment, viral pathogen testing, and bacteriological testing; and\n(3) initial inspection for containment and quarantine facility inspections.\n(a) A person operating a commercial aquarium facility must have a commercial aquarium facility license issued by the commissioner if the facility contains species of aquatic life that are for sale and that are present in waters of the state. The commissioner may require an aquarium facility license for aquarium facilities importing or holding species of aquatic life that are for sale and that are not present in Minnesota if those species can survive in waters of the state. The fee for an aquarium facility license is $90.\n(b) Game fish and native rough fish transferred by an aquarium facility must be accompanied by a receipt containing the information required on a shipping document by section 17.4985, subdivision 3, paragraph (b).",
	"repealed": false
}