{
	"id": "86B.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.301",
	"title": "86B.301 WATERCRAFT LICENSES REQUIRED.",
	"text": "Except as provided in subdivisions 2 and 3, a person may not operate or give permission for the operation of a watercraft that requires a watercraft license on the waters of this state unless:\n(1) a watercraft license for the watercraft has been issued and is valid during the period of operation;\n(2) the license number is affixed to the watercraft as prescribed by the commissioner; and\n(3) a valid registration sticker is affixed to the watercraft as prescribed by the commissioner.\nA watercraft license is not required for:\n(1) a watercraft that is covered by a license or number in full force and effect under federal law or a federally approved licensing or numbering system of another state, or a watercraft that is owned by a person from another state and that state does not require licensing that type of watercraft, and the watercraft has not been within this state for more than 90 consecutive days, which does not include days that a watercraft is laid up at dock over winter or for repairs at a Lake Superior port or another port in the state;\n(2) a watercraft from a country other than the United States that has not been within this state for more than 90 consecutive days, which does not include days that a watercraft is laid up at dock over winter or for repairs at a Lake Superior port or another port in the state;\n(3) a watercraft owned by the United States, an Indian tribal government, a state, or a political subdivision of a state, except watercraft used for recreational purposes;\n(4) a ship's lifeboat;\n(5) a watercraft that has been issued a valid marine document by the United States government;\n(6) a waterfowl boat during waterfowl-hunting season;\n(7) a rice boat during the harvest season;\n(8) a seaplane;\n(9) a nonmotorized watercraft ten feet in length or less; and\n(10) a watercraft that is covered by a valid license or number issued by a federally recognized Indian tribe in the state under a federally approved licensing or numbering system and that is owned by a member of that tribe.\nA person may operate a watercraft and allow another person to operate a watercraft for which a temporary license certificate has been issued during the period the certificate is valid.",
	"repealed": false
}