{
	"id": "289A.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.38",
	"title": "289A.38 LIMITATIONS ON TIME FOR ASSESSMENT OF TAX.",
	"text": "Except as otherwise provided in this section, the amount of taxes assessable must be assessed within 3-1/2 years after the date the return is filed.\nFor purposes of this section, a tax return filed before the last day prescribed by law for filing is considered to be filed on the last day.\n[Repealed, 2011 c 112 art 2 s 5]\nFor purposes of computing the limitation under this section, the due date of the property tax refund return as provided for in chapter 290A is the due date for an income tax return covering the year preceding the year in which the property taxes are payable.\nNotwithstanding the limitations under subdivision 1, the tax may be assessed at any time if a false or fraudulent return is filed or when a taxpayer fails to file a return.\nAdditional taxes may be assessed within 6-1/2 years after the due date of the return or the date the return was filed, whichever is later, if:\n(1) the taxpayer omits from gross income an amount properly includable in it that is in excess of 25 percent of the amount of gross income stated in the return;\n(2) the taxpayer omits from a sales, use, or withholding tax return, or a return for a tax imposed under section 295.52, an amount of taxes in excess of 25 percent of the taxes reported in the return; or\n(3) the taxpayer omits from the gross estate assets in excess of 25 percent of the gross estate reported in the return.\n(a) If the amount of income, items of tax preference, deductions, or credits for any year of a taxpayer, or the wages paid by a taxpayer for any period, as reported to the Internal Revenue Service is changed or corrected by the commissioner of Internal Revenue or other officer of the United States or other competent authority, or where a renegotiation of a contract or subcontract with the United States results in a change in income, items of tax preference, deductions, credits, or withholding tax, or, in the case of estate tax, where there are adjustments to the taxable estate, the taxpayer shall report the federal adjustments in writing to the commissioner. The federal adjustments report must be submitted within 180 days after the final determination date and must be in the form of either an amended Minnesota estate, withholding tax, corporate franchise tax, or income tax return conceding the accuracy of the federal adjustment or a letter detailing how the federal adjustment is incorrect or does not change the Minnesota tax. An amended Minnesota income tax return must be accompanied by an amended property tax refund return, if necessary. A taxpayer filing an amended federal tax return must also file a copy of the amended return with the commissioner of revenue within 180 days after filing the amended return.\n(b) In the case of a final federal adjustment arising from a partnership-level audit or an administrative adjustment request filed by a partnership under section 6227 of the Internal Revenue Code, a taxpayer must report adjustments as provided for under section 289A.382, and not this section.\nIf a taxpayer fails to make a federal adjustments report as required by subdivision 7 or section 289A.382, the commissioner may recompute the tax, including a refund, based on information available to the commissioner. The tax may be recomputed within six years after the federal adjustments report should have been filed, notwithstanding any period of limitations to the contrary.\nIf a taxpayer is required to make a federal adjustments report under subdivision 7 or section 289A.382, and does report the change or files a copy of the amended return, the commissioner may recompute and reassess the tax due, including a refund (1) within one year after the federal adjustments report or amended return is filed with the commissioner, notwithstanding any period of limitations to the contrary, or (2) within any other applicable period stated in this section, whichever period is longer. The period provided for the carryback of any amount of loss or credit is also extended as provided in this subdivision, notwithstanding any law to the contrary. If the commissioner has completed a field audit of the taxpayer, and, but for this subdivision, the commissioner's time period to adjust the tax has expired, the additional tax due or refund is limited to only those changes that are required to be made to the return which relate to the changes made on the federal return. This subdivision does not apply to sales and use tax.\nFor purposes of this subdivision and section 289A.42, subdivision 2, a \"field audit\" is the physical presence of examiners in the taxpayer's or taxpayer's representative's office conducting an examination of the taxpayer with the intention of issuing an assessment or notice of change in tax or which results in the issuing of an assessment or notice of change in tax. The examination may include inspecting a taxpayer's place of business, tangible personal property, equipment, computer systems and facilities, pertinent books, records, papers, vouchers, computer printouts, accounts, and documents.\nA taxpayer may make estimated payments to the commissioner of the tax expected to result from a pending audit by the Internal Revenue Service. The taxpayer may make estimated payments prior to the due date of the federal adjustments report without the taxpayer having to file the report with the commissioner. The commissioner must credit the estimated tax payments against any tax liability of the taxpayer ultimately found to be due to the commissioner. The estimated payments limit the accrual of further statutory interest on that amount. If the estimated tax payments exceed the final tax liability plus statutory interest ultimately determined to be due, the taxpayer is entitled to a refund or credit for the excess, provided the taxpayer files a federal adjustments report, or claim for refund or credit of tax, no later than one year following the final determination date.\nNotwithstanding any other provision of this chapter, if a taxpayer whose net income is determined under section 290.01, subdivision 19, omits from income an amount that will under the Internal Revenue Code extend the statute of limitations for the assessment of federal income taxes, or otherwise incorrectly determines the taxpayer's federal adjusted gross income resulting in adjustments by the Internal Revenue Service, then the period of assessment and determination of tax will be that under the Internal Revenue Code. When a change is made to federal income during the extended time provided under this subdivision, the provisions under subdivisions 7 to 9 and section 289A.382 regarding additional extensions apply.\nIf a deficiency of tax is attributable to a net operating loss carryback that has been disallowed in whole or in part, the deficiency may be assessed at any time that a deficiency for the taxable year of the loss may be assessed.\n(a) Tax must be assessed within 18 months after written request for an assessment has been made in the case of income received (1) during the lifetime of a decedent, (2) by the decedent's estate during the period of administration, (3) by a trustee of a terminating trust or other fiduciary who, because of custody of assets, would be liable for the payment of tax under section 270C.58, subdivision 2, or (4) by a mining company or a corporation. A proceeding in court for the collection of the tax must begin within two years after written request for the assessment (filed after the return is made and in the form the commissioner prescribes) by the personal representative or other fiduciary representing the estate of the decedent, or by the trustee of a terminating trust or other fiduciary who, because of custody of assets, would be liable for the payment of tax under section 270C.58, subdivision 2, or by the corporation. Except as provided in section 289A.42, subdivision 1, an assessment must not be made after the expiration of 3-1/2 years after the return was filed, and an action must not be brought after the expiration of four years after the return was filed.\n(b) Paragraph (a) only applies in the case of a mining company or a corporation if:\n(1) the written request notifies the commissioner that the corporation contemplates dissolution at or before the expiration of the 18-month period;\n(2) the dissolution is begun in good faith before the expiration of the 18-month period; and\n(3) the dissolution is completed within the 18-month period.\n[Repealed, 2005 c 151 art 1 s 117]\nIf an employer fails to timely file the reconciliation required by section 289A.09, subdivision 2, paragraph (d), withholding taxes may be assessed within the period prescribed in subdivision 1, or within one year from the date the reconciliation is filed with the commissioner, whichever is later.\nIf a purchaser refund claim is filed under section 289A.50, subdivision 2a, and the basis for the claim is that the purchaser was improperly charged tax on an improvement to real property or on the purchase of nontaxable services, sales or use tax may be assessed for the cost of materials used to make the real property improvement or to perform the nontaxable service. The assessment may be made against the person making the improvement to real property or the sale of nontaxable services, within the period prescribed in subdivision 1, or within one year after the date of the refund order, whichever is later.\n(a) If a taxpayer fails to include on any return or statement for any taxable year any information with respect to a reportable transaction, as required by federal law and under section 289A.121, the commissioner may recompute the tax, including a refund, within the later of:\n(1) six years after the return is filed with respect to the taxable year in which the taxpayer participated in the reportable transaction; or\n(2) for a listed transaction, as defined in section 289A.121, for which the taxpayer fails to include on any return or statement for any taxable year any information that is required under section 289A.121, one year after the earlier of:\n(i) the date the taxpayer furnishes the required information to the commissioner; or\n(ii) the date that a material advisor, as defined in section 289A.121, meets the requirements of section 289A.121, relating to the transaction with respect to the taxpayer.\n(b) If tax is assessable solely because of this section, the assessable deficiency is limited to the items that were not disclosed as required under section 289A.121.",
	"repealed": false
}