{
	"id": "116A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.15",
	"title": "116A.15 CONTRACT AND BOND.",
	"text": "The contract and bond to be executed and furnished by the contractor shall be attached. The contract shall contain the specific description of the work to be done, either expressly or by reference to the plans and specifications, and shall provide that the work shall be done and completed as provided in the plans and specifications and subject to the inspection and approval of the engineer. The county attorney, the engineer, and the attorney for the petitioners shall prepare the contract and bond. The contractor shall make and file with the auditor or court administrator a bond, with good and sufficient surety, to be approved by the auditor or court administrator, in a sum not less than 100 percent of the contract price of the work. Every such contract and bond shall embrace all the provisions required by sections 116A.01 to 116A.26 and provided by law for bonds given by contractors for public works, and shall be conditioned as provided by statute in case of public contractors for the better security of the contracting county or counties and of parties performing labor and furnishing material in and about the performance of the contract. The bond shall provide that the bonding agents shall be liable for all damages resulting from any such failure, whether the work be resold or not, and that any person or corporation, public or private, showing itself injured by such failure, may maintain an action upon such bond in its own name, and actions may be successive in favor of all persons so injured; provided, however, that the aggregate liability of the surety for all such damages shall in no event exceed the amount of said bond. Such contractor shall be considered a public officer, and such bond an official bond within the meaning of the statutory provisions construing the official bonds of public officers as security to all persons, and providing for actions on such bonds by any injured party.\nThe contract shall give the engineer the right, with the consent of the board or court, to modify the reports, plans and specifications as the work proceeds and as circumstances may require. It shall provide that the increased cost resulting from such changes will be paid by the county to the contractor at not to exceed the price for like work in the contract. No change shall be made that will substantially impair the usefulness of any part of the water or sewer system or substantially alter its original character, or will increase its total cost by more than ten percent of the total original contract price, unless determined by the board or court to be necessary to complete the system described in the original plans and specifications in such manner as to make it usable for the purpose contemplated.",
	"repealed": false
}