{
	"id": "571.922",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.922",
	"title": "571.922 LIMITATION ON WAGE GARNISHMENT.",
	"text": "(a) Unless the judgment is for child support, the maximum part of the aggregate disposable earnings of an individual for any pay period subjected to garnishment may not exceed the lesser of:\n(1) 25 percent of the debtor's disposable earnings, if the debtor's weekly income exceeds 80 times the greater of the hourly wage described in paragraph (b);\n(2) 15 percent of the debtor's disposable earnings, if the debtor's weekly income exceeds 60 times, but is less than or equal to 80 times, the greater of the hourly wages described in paragraph (b); or\n(3) ten percent of the debtor's disposable earnings, if the debtor's weekly income exceeds 40 times, but is less than or equal to 60 times, the greater of the hourly wages described in paragraph (b).\n(b) The amount by which the debtor's disposable earnings exceed the greater of:\n(i) 40 times the hourly wage described in section 177.24, subdivision 1, paragraph (a), clause (3); or\n(ii) 40 times the federal minimum hourly wages prescribed by section 6(a)(1) of the Fair Labor Standards Act of 1938, United States Code, title 29, section 206(a)(1). The calculation of the amount that is subject to garnishment must be based on the hourly wage in effect at the time the earnings are payable, times the number of work weeks in the pay period. When a pay period consists of other than a whole number of work weeks, each day of that pay period in excess of the number of completed work weeks shall be counted as a fraction of a work week equal to the number of excess workdays divided by the number of days in the normal work week.\n(c) If the judgment is for child support, the garnishment may not exceed:\n(1) 50 percent of the judgment debtor's disposable income, if the judgment debtor is supporting a spouse or dependent child and the judgment is 12 weeks old or less (12 weeks to be calculated to the beginning of the work week in which the execution levy is received);\n(2) 55 percent of the judgment debtor's disposable income, if the judgment debtor is supporting a spouse or dependent child, and the judgment is over 12 weeks old (12 weeks to be calculated to the beginning of the work week in which the garnishment summons is received);\n(3) 60 percent of the judgment debtor's disposable income, if the judgment debtor is not supporting a spouse or dependent child and the judgment is 12 weeks old or less (12 weeks to be calculated to the beginning of the work week in which the execution levy is received); or\n(4) 65 percent of the judgment debtor's disposable income, if the judgment debtor is not supporting a spouse or dependent child, and the judgment is over 12 weeks old (12 weeks to be calculated to the beginning of the work week in which the garnishment summons is received).\nWage garnishments on judgments for child support are effective until the judgments are satisfied if the judgment creditor is a county and the employer is notified by the county when the judgment is satisfied.\n(d) No court may make, execute, or enforce an order or any process in violation of this section.",
	"repealed": false
}