{
	"id": "204B.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.135",
	"title": "204B.135 REDISTRICTING OF ELECTION DISTRICTS.",
	"text": "Except as provided in this subdivision, a city that elects its council members by wards may not redistrict those wards before the legislature has been redistricted. The wards must be redistricted within 60 days after the legislature has been redistricted or at least 19 weeks before the state primary election in the year ending in two, whichever is first.\nIn a city of the first class electing council members by wards in a year ending in one, the ward boundaries may be reestablished no later than 14 days before the first day to file affidavits of candidacy for city council members. The ward boundaries may be modified after the legislature has been redistricted for the purpose of establishing precinct boundaries as provided in section 204B.14, subdivision 3.\nFor purposes of this subdivision, \"local government election district\" means a county district, park and recreation district, school district, or soil and water conservation district. Local government election districts, other than city wards covered by subdivision 1, may not be redistricted until precinct boundaries are reestablished under section 204B.14, subdivision 3, paragraph (c). Election districts covered by this subdivision must be redistricted within 80 days of the time when the legislature has been redistricted or at least 15 weeks before the state primary election in the year ending in two, whichever comes first.\n(a) An eligible voter may apply to the district court for either a writ of mandamus requiring the redistricting of wards or local government election districts or to revise any plan adopted by the governing body responsible for redistricting of wards or local government election districts.\n(b) If a city adopts a ward redistricting plan at least 19 weeks before the primary in a year ending in two, an application for revision of the plan that seeks to affect elections held in the year ending in two must be filed with the district court within three weeks but no later than 18 weeks before the state primary election in the year ending in two, notwithstanding any charter provision. If a city adopts a ward redistricting plan less than 19 weeks before either the municipal primary in a year ending in one or before the state primary in a year ending in two, an application for revision of the plan that seeks to affect elections held in that year must be filed with the district court no later than one week after the plan has been adopted, notwithstanding any charter provision.\n(c) If a plan for redistricting of a local government election district is adopted at least 15 weeks before the state primary election in a year ending in two, an application for revision of the plan that seeks to affect elections held in the year ending in two must be filed with the district court within three weeks but no later than 14 weeks before the state primary election in the year ending in two. If a plan for redistricting of a local government election district is adopted less than 15 weeks before the state primary election in a year ending in two, an application for revision of the plan that seeks to affect elections held in the year ending in two must be filed with the district court no later than one week after the plan has been adopted.\nNo municipality or school district may conduct a special election during the 19 weeks before the state primary election in the year ending in two. A school district special election required by any other law may be deferred until the date of the next school district general election, the state primary election, or the state general election.\nThe county board may levy a tax not to exceed $1 per capita in the year ending in \"0\" to pay costs incurred in the year ending in \"1\" or \"2\" that are reasonably related to the redistricting of election districts, establishment of precinct boundaries, designation of polling places, and the updating of voter records in the statewide registration system. The county auditor shall distribute to each municipality in the county on a per capita basis 25 percent of the amount levied as provided in this subdivision, based on the population of the municipality in the most recent census. This levy is not subject to statutory levy limits.",
	"repealed": false
}