{
	"id": "319B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.08",
	"title": "319B.08 EFFECT OF DEATH OR DISQUALIFICATION OF OWNER.",
	"text": "(a) If an owner dies or becomes disqualified to practice all the pertinent professional services, then either:\n(1) within 90 days after the death or the beginning of the disqualification, all of that owner's ownership interest must be acquired by the professional firm, by persons permitted by section 319B.07 to own the ownership interest, or by some combination; or\n(2) at the end of the 90-day period, the firm's election under section 319B.03, subdivision 2, or 319B.04, subdivision 2, is automatically rescinded, the firm loses its status as a professional firm, and the authority created by that election and status terminates.\nAn acquisition satisfies clause (1) if all right and title to the deceased or disqualified owner's interest are acquired before the end of the 90-day period, even if some or all of the consideration is paid after the end of the 90-day period. However, payment cannot be secured in any way that violates sections 319B.01 to 319B.12.\n(b) If automatic rescission does occur under paragraph (a), the firm must immediately and accordingly update its organizational document, certificate of authority, or statement of foreign qualification. Even without that updating, however, the rescission, loss of status, and termination of authority provided by paragraph (a) occur automatically at the end of the 90-day period.\n(a) If:\n(1) an owner dies or becomes disqualified to practice all the pertinent professional services;\n(2) the professional firm has in effect a mechanism, valid according to the professional firm's generally applicable governing law, to effect a purchase of the deceased or disqualified owner's ownership interest so as to satisfy subdivision 1, paragraph (a), clause (1); and\n(3) the professional firm does not agree with the disqualified owner or the representative of the deceased owner to set aside the mechanism,\nthen that mechanism applies.\n(b) If:\n(1) an owner dies or becomes disqualified to practice all the pertinent professional services;\n(2) the professional firm has in effect no mechanism as described in paragraph (a), or has agreed as mentioned in paragraph (a), clause (3), to set aside that mechanism; and\n(3) consistent with its generally applicable governing law, the professional firm agrees with the disqualified owner or the representative of the deceased owner, before the end of the 90-day period, to an arrangement to effect a purchase of the deceased or disqualified owner's ownership interest so as to satisfy subdivision 1, paragraph (a), clause (1),\nthen that arrangement applies.\n(c) If:\n(1) an owner of a Minnesota professional firm dies or becomes disqualified to practice all the pertinent professional services;\n(2) the Minnesota professional firm does not have in effect a mechanism as described in paragraph (a);\n(3) the Minnesota professional firm does not make an arrangement as described in paragraph (b); and\n(4) no provision or tenet of the Minnesota professional firm's generally applicable governing law and no provision of any document or agreement authorized by the Minnesota professional firm's generally applicable governing law expressly precludes an acquisition under this paragraph,\nthen the firm may acquire the deceased or disqualified owner's ownership interest as stated in this paragraph. To act under this paragraph, the Minnesota professional firm must within 90 days after the death or beginning of the disqualification tender to the representative of the deceased owner's estate or to the disqualified owner the fair value of the owner's ownership interest, as determined by the Minnesota professional firm's governance authority. That price must be at least the book value, as determined in accordance with the Minnesota professional firm's regular method of accounting, as of the end of the month immediately preceding the death or loss of license. The tender must be unconditional and may not attempt to have the recipient waive any rights provided in this section. If the Minnesota professional firm tenders a price under this paragraph within the 90-day period, the deceased or disqualified owner's ownership interest immediately transfers to the Minnesota professional firm regardless of any dispute as to the fairness of the price. A disqualified owner or representative of the deceased owner's estate who disputes the fairness of the tendered price may take the tendered price and bring suit in district court seeking additional payment. The suit must be commenced within one year after the payment is tendered. A Minnesota professional firm may agree with a disqualified owner or the representative of a deceased owner's estate to delay all or part of the payment due under this paragraph, but all right and title to the owner's ownership interests must be acquired before the end of the 90-day period and payment may not be secured in any way that violates sections 319B.01 to 319B.12.\nIf the holder of an option issued under section 319B.07, subdivision 3, paragraph (a), clause (1), dies or becomes disqualified, the option automatically expires.\nFor purposes of this section, each mention of \"90 days,\" \"90-day period,\" or similar term shall be interpreted as one year after the death of a professional who was the sole owner of the professional firm if the surviving spouse of the deceased professional owns and controls the firm after the death.",
	"repealed": false
}