{
	"id": "245.713",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.713",
	"title": "245.713 ALLOCATION FORMULA.",
	"text": "[Repealed, 1987 c 403 art 2 s 164]\nFunds granted to the state by the federal government under United States Code, title 42, sections 300X to 300X-9 each federal fiscal year for mental health services must be allocated as follows:\n(a) Any amount set aside by the commissioner of human services for American Indian organizations within the state, which funds shall not duplicate any direct federal funding of American Indian organizations and which funds shall be at least 25 percent of the total federal allocation to the state for mental health services. Money from this source may be used for special committees to advise the commissioner on mental health programs and services for American Indians and other minorities or underserved groups. For purposes of this subdivision, \"American Indian organization\" means an American Indian tribe or band or an organization providing mental health services that is legally incorporated as a nonprofit organization registered with the secretary of state and governed by a board of directors having at least a majority of American Indian directors.\n(b) An amount not to exceed five percent of the federal block grant allocation for mental health services to be retained by the commissioner for administration.\n(c) Any amount permitted under federal law which the commissioner approves for demonstration or research projects for severely disturbed children and adolescents, the underserved, special populations or multiply disabled mentally ill persons. The groups to be served, the extent and nature of services to be provided, the amount and duration of any grant awards are to be based on criteria set forth in the Alcohol, Drug Abuse and Mental Health Block Grant Law, United States Code, title 42, sections 300X to 300X-9, and on state policies and procedures determined necessary by the commissioner. Grant recipients must comply with applicable state and federal requirements and demonstrate fiscal and program management capabilities that will result in provision of quality, cost-effective services.\n(d) The amount required under federal law, for federally mandated expenditures.\n(e) An amount not to exceed 15 percent of the federal block grant allocation for mental health services to be retained by the commissioner for planning and evaluation.\n[Repealed, 1987 c 403 art 2 s 164]\n[Repealed, 2005 c 98 art 3 s 25]",
	"repealed": false
}