{
	"id": "270C.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.34",
	"title": "270C.34 ABATEMENT OF PENALTY, INTEREST, AND ADDITIONAL TAX CHARGE.",
	"text": "(a) The commissioner may abate, reduce, or refund any penalty or interest that is imposed by a law administered by the commissioner, or imposed by section 270.0725, subdivision 1 or 2, or 270.075, subdivision 2, as a result of the late payment of tax or late filing of a return, or any part of an additional tax charge under section 289A.25, subdivision 2, or 289A.26, subdivision 4, if the failure to timely pay the tax or failure to timely file the return is due to reasonable cause, or if the taxpayer is located in a presidentially declared disaster or in a presidentially declared state of emergency area or in an area declared to be in a state of emergency by the governor under section 12.31.\n(b) The commissioner shall abate any part of a penalty or additional tax charge under section 289A.25, subdivision 2, or 289A.26, subdivision 4, attributable to erroneous advice given to the taxpayer in writing by an employee of the department acting in an official capacity, if the advice:\n(1) was reasonably relied on and was in response to a specific written request of the taxpayer; and\n(2) was not the result of failure by the taxpayer to provide adequate or accurate information.\n(a) A request for abatement of penalty under subdivision 1 or section 289A.60, subdivision 4, or a request for abatement of interest or additional tax charge, must be filed with the commissioner within 60 days of the notice date of the penalty or additional tax charge. For purposes of this section, \"notice date\" means the notice date designated by the commissioner on the order or other notice that a penalty or additional tax charge has been imposed.\n(b) If the commissioner issues an order denying a request for abatement of penalty, interest, or additional tax charge, the taxpayer may file an administrative appeal as provided in section 270C.35 or appeal to Tax Court as provided in section 271.06.\n(c) If the commissioner does not issue an order on the abatement request within 60 days from the date the request is received, the taxpayer may appeal to Tax Court as provided in section 271.06.",
	"repealed": false
}