{
	"id": "214.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.32",
	"title": "214.32 PROGRAM OPERATIONS AND RESPONSIBILITIES.",
	"text": "(a) A Health Professionals Services Program Committee is established, consisting of one person appointed by each participating board, with each participating board having one vote. The committee shall designate one board to provide administrative management of the program, set the program budget and the pro rata share of program expenses to be borne by each participating board, provide guidance on the general operation of the program, including hiring of program personnel, and ensure that the program's direction is in accord with its authority. If the participating boards change which board is designated to provide administrative management of the program, any appropriation remaining for the program shall transfer to the newly designated board on the effective date of the change. The participating boards must inform the appropriate legislative committees and the commissioner of management and budget of any change in the administrative management of the program, and the amount of any appropriation transferred under this provision.\n(b) The designated board, upon recommendation of the Health Professional Services Program Committee, shall hire the program manager and employees and pay expenses of the program from funds appropriated for that purpose. The designated board may apply for grants to pay program expenses and may enter into contracts on behalf of the program to carry out the purposes of the program. The participating boards shall enter into written agreements with the designated board.\n(c) An advisory committee is established to advise the program committee consisting of:\n(1) one member appointed by each of the following: the Minnesota Academy of Physician Assistants, the Minnesota Dental Association, the Minnesota Chiropractic Association, the Minnesota Licensed Practical Nurse Association, the Minnesota Medical Association, the Minnesota Nurses Association, and the Minnesota Podiatric Medicine Association;\n(2) one member appointed by each of the professional associations of the other professions regulated by a participating board not specified in clause (1); and\n(3) two public members, as defined by section 214.02.\nMembers of the advisory committee shall be appointed for two years and members may be reappointed.\n(a) The program shall provide the following services to program participants:\n(1) referral of eligible regulated persons to qualified professionals for evaluation, treatment, and a written plan for continuing care consistent with the regulated person's illness. The referral shall take into consideration the regulated person's financial resources as well as specific needs;\n(2) development of individualized program participation agreements between participants and the program to meet the needs of participants and protect the public. An agreement may include, but need not be limited to, recommendations from the continuing care plan, practice monitoring, health monitoring, practice restrictions, random drug screening, support group participation, filing of reports necessary to document compliance, and terms for successful completion of the regulated person's program; and\n(3) monitoring of compliance by participants with individualized program participation agreements or board orders.\n(b) The program may develop services related to sections 214.31 to 214.37 for employers and colleagues of regulated persons from participating boards.\nEach program participant shall be responsible for paying for the costs of physical, psychosocial, or other related evaluation, treatment, laboratory monitoring, and random drug screens.\nAdmission to the health professional services program is available to a person regulated by a participating board who is unable to practice with reasonable skill and safety by reason of illness, use of alcohol, drugs, chemicals, or any other materials, or as a result of any mental, physical, or psychological condition. Admission in the health professional services program shall be denied to persons:\n(1) who have diverted controlled substances for other than self-administration;\n(2) who have been terminated from this or any other state professional services program for noncompliance in the program;\n(3) currently under a board disciplinary order or corrective action agreement, unless referred by a board;\n(4) accused of sexual misconduct; or\n(5) whose continued practice would create a serious risk of harm to the public.\nA regulated person completes the program when the terms of the program participation agreement are fulfilled. A regulated person may voluntarily terminate participation in the health professionals service program at any time by reporting to the person's board. The program manager may choose to discharge a regulated person from the program and make a referral to the person's board at any time for reasons including but not limited to: the degree of cooperation and compliance by the regulated person, the inability to secure information or the medical records of the regulated person, or indication of other possible violations of the regulated person's practice act. The regulated person shall be notified in writing by the program manager of any change in the person's program status. A regulated person who has been terminated or discharged from the program may be referred back to the program for monitoring.\nUpon receiving a report from the program manager in accordance with section 214.33, subdivision 3, and if the participating health-related licensing board has probable cause to believe continued practice by the regulated person presents an imminent risk of serious harm, the health-related licensing board shall proceed pursuant to the requirements in section 214.077.",
	"repealed": false
}