{
	"id": "115B.442",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.442",
	"title": "115B.442 SETTLEMENT PROCESS; INFORMATION GATHERING.",
	"text": "The commissioner and the attorney general shall select qualified facilities for which they intend to make offers of settlement to insurers under section 115B.443. The first group of qualified facilities, consisting of not less than ten facilities, must be selected within 60 days after March 27, 1996. Upon selection of a qualified facility under this subdivision, the commissioner shall commence reasonable efforts to identify potential insurance policyholders and insurance coverage for the qualified facility in accordance with this section.\nFor the purposes of sections 115B.441 to 115B.445, \"qualified facility\" means only those qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1).\nFor the purpose of this section, \"potential insurance policyholder\" means a person who may bear legal responsibility for environmental response costs related to a qualified facility including the following:\n(1) a person who has been the subject of a request for response action under section 115B.17, or an order under section 106 of the federal Superfund Act with respect to a qualified facility;\n(2) an owner or operator of a qualified facility;\n(3) a person who engaged in commercial, industrial, or other activities generally known to produce waste containing a hazardous substance, or pollutant or contaminant, and whose waste was disposed of at a qualified facility; and\n(4) a person who engaged in the business of hauling waste for disposal and who accepted waste from one or more persons of the type described in clause (3) for transport to a qualified facility.\nThe commissioner may request information from a person that the commissioner has reason to believe is a potential insurance policyholder or has information needed to identify potential insurance policyholders. The recipient of the request shall provide to the commissioner any information in the person's possession, or which the person can reasonably obtain, that the commissioner requires to identify potential insurance policyholders for a qualified facility and to explain to the commissioner the person's efforts to discover and provide the information. An owner or operator of a qualified facility shall retain and preserve all documents and other information relevant to the identification of potential insurance policyholders for the qualified facility.\nThe commissioner may request a person that the commissioner has reason to believe is a potential insurance policyholder to provide, and the recipient of the request shall provide to the commissioner, any information in the person's possession, or which the person can reasonably obtain, regarding the person's potential liability insurance coverage for environmental response costs related to a qualified facility. A potential insurance policyholder for which evidence of potential coverage has been identified shall cooperate with reasonable requests of the commissioner or the attorney general for assistance in preparing for and negotiating a settlement under this section or in preparing or pursuing a claim under section 115B.444 related to that policyholder's potential coverage. Nothing in this subdivision relieves a potential insurance policyholder of any duties imposed upon it pursuant to the terms, conditions, and provisions of its insurance policy, including any duty to cooperate with its insurer in the investigation, negotiation, and settlement of claims or demands, or the defense of suits. The commissioner may contract for the services of persons to assist in reconstructing insurance policies and potential coverage from incomplete insurance information. The commissioner may authorize the attorney general to carry out all or a portion of the authority provided in this section.\nThe commissioner may request an insurer to make reasonable efforts to identify or confirm potential insurance coverage of any potential insurance policyholder identified under subdivision 4, or may direct the potential insurance policyholder to make this request of an insurer. An insurer that is requested to identify or confirm potential coverage of a potential insurance policyholder under this subdivision has 90 days after receiving the request to confirm coverage or to provide all information in the possession of the insurer that may assist in identifying potential coverage, and to explain the insurer's efforts to discover and provide such information. An insurer requested to provide information under this subdivision shall preserve all information relevant to the request until any claim relating to the request is resolved.\nSubdivisions 3 to 5 are enforceable under sections 115.071 and 116.072.",
	"repealed": false
}