{
	"id": "270C.991",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.991",
	"title": "270C.991 PROPERTY TAX SYSTEM BENCHMARKS AND CRITICAL INDICATORS.",
	"text": "State policy makers should be provided with the tools to create a more accountable and efficient property tax system. This section provides the principles and available tools necessary to work toward achieving that goal.\nTo better evaluate the various property tax proposals that come before the legislature, the following basic property tax principles should be taken into consideration. The property taxes proposed should be:\n(1) transparent and understandable;\n(2) simple and efficient;\n(3) equitable;\n(4) stable and predictable;\n(5) compliance and accountability;\n(6) competitive, both nationally and globally; and\n(7) responsive to economic conditions.\nThere are many different types of indicators available to legislators to evaluate tax legislation. Indicators are useful to have available as benchmarks when legislators are contemplating changes. Each tool has its own limitation, and no one tool is perfect or should be used independently. Some of the tools measure the global characteristics of the entire tax system, while others are only a measure of the property tax impacts and its administration. The following is a list of the available major indicators:\n(1) property tax principles scale, the components of which are listed in subdivision 2, as they relate to the various features of the property tax system;\n(2) price of government report, as required under section 16A.102;\n(3) tax incidence report, as required under section 270C.13;\n(4) tax expenditure budget and report, as required under section 270C.11;\n(5) state tax rankings;\n(6) property tax levy plus aid data, and market value and net tax capacity data, by taxing district for current and past years;\n(7) effective tax rate (tax as a percent of market value) and the equalized effective tax rate (effective tax rate adjusted for assessment differences);\n(8) assessment sales ratio study, as required under section 273.1325;\n(9) \"Voss\" database, which matches homeowner property taxes and household income;\n(10) revenue estimates under section 270C.11, subdivision 5, and state fiscal notes under section 477A.03, subdivision 2b; and\n(11) local impact notes under section 3.987.\n[Repealed, 2014 c 286 art 1 s 5; 2014 c 308 art 9 s 94]\nOn or before March 1, 2012, and every two years thereafter, the house of representatives and senate Taxes Committees must review the major indicators as contained in subdivision 3, and ascertain the accountability and efficiency of the property tax system. The house of representatives and senate Taxes Committees shall prepare a resolution on targets and benchmarks for use during the current biennium.\nAs provided under section 270C.11, subdivision 5, the Department of Revenue is required to prepare an estimate of the effect on the state's tax revenues which result from the passage of a legislative bill establishing, extending, or restricting a tax expenditure. Beginning with the 2011 legislative session, those revenue estimates must also identify how the property tax principles contained in subdivision 2 apply to the proposed tax changes. The commissioner of revenue shall develop a scale for measuring the appropriate principles for each proposed change. The department shall quantify the effects, if possible, or at a minimum, shall identify the relevant factors so that legislators are aware of possible outcomes, including administrative difficulties and cost. The interaction of property tax shifting should be identified and quantified to the degree possible.\nThe sum of $30,000 in fiscal year 2011 and $25,000 in each fiscal year thereafter is appropriated from the general fund to the commissioner of revenue to carry out the commissioner's added responsibilities under subdivision 6.",
	"repealed": false
}