{
	"id": "290.0137",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0137",
	"title": "290.0137 ACCELERATED RECOGNITION OF CERTAIN INSTALLMENT SALE GAINS.",
	"text": "(a) In the case of a nonresident individual or a person who becomes a nonresident individual during the tax year, taxable net income shall include the amount realized upon a sale of the assets of, or any interest in, an S corporation or partnership that operated in Minnesota during the year of sale, including any income or gain to be recognized in future years pursuant to an installment sale method of reporting under the Internal Revenue Code.\n(1) For the purposes of this paragraph, an individual who becomes a nonresident of Minnesota in any year after an installment sale is required to recognize the full amount of any income or gain described in this paragraph on the individual's final Minnesota resident tax return to the extent that such income has not been recognized in a prior year.\n(2) For the purposes of this section, \"realized\" has the meaning given in section 1001(b) of the Internal Revenue Code.\n(3) For the purposes of this section, \"installment sale\" means any installment sale under section 453 of the Internal Revenue Code and any other sale that is reported utilizing a method of accounting authorized under subchapter E of the Internal Revenue Code that allows taxpayers to delay reporting or recognizing a realized gain until a future year.\n(b) Notwithstanding paragraph (a), nonresident taxpayers may elect to defer recognizing unrecognized installment sale gains by making an election under this paragraph. The election must be filed on a form to be determined or prescribed by the commissioner and must be filed by the due date of the individual income tax return, including any extension. Electing taxpayers must make an irrevocable agreement to:\n(1) file Minnesota tax returns in all subsequent years when gains from the installment sales are recognized and reported to the Internal Revenue Service;\n(2) allocate gains to the state of Minnesota as though the gains were realized in the year of sale under section 290.17, 290.191, or 290.20; and\n(3) include all relevant federal tax documents reporting the installment sale with subsequent Minnesota tax returns.\n(c) Income or gain recognized for Minnesota purposes pursuant to paragraph (a) must be excluded from taxable net income in any future year that the taxpayer files a Minnesota tax return to the extent that the income or gain has already been subject to tax pursuant to paragraph (a).",
	"repealed": false
}