{
	"id": "169.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.34",
	"title": "169.34 PROHIBITIONS; STOPPING, PARKING.",
	"text": "(a) A person must not stop, stand, or park a vehicle, except when necessary to avoid conflict with other traffic or in compliance with the directions of a police officer or traffic-control device, in any of the following places:\n(1) on a sidewalk;\n(2) in front of a public or private driveway;\n(3) within an intersection;\n(4) within ten feet of a fire hydrant;\n(5) on a crosswalk;\n(6) within 20 feet of a crosswalk at an intersection;\n(7) within 30 feet upon the approach to any flashing beacon, stop sign, or traffic-control signal located at the side of a roadway;\n(8) within 50 feet of the nearest rail of a railroad crossing;\n(9) within 20 feet of the driveway entrance to any fire station and on the side of a street opposite the entrance to any fire station within 75 feet of said entrance when properly signposted;\n(10) alongside or opposite any street excavation or obstruction when such stopping, standing, or parking would obstruct traffic;\n(11) on the roadway side of any vehicle stopped or parked at the edge or curb of a street;\n(12) upon any bridge or other elevated structure upon a highway or within a highway tunnel, except as otherwise provided by ordinance;\n(13) within a bicycle lane, except when posted signs permit parking; or\n(14) at any place where official signs prohibit stopping.\n(b) A person must not move a vehicle not owned by the person into any prohibited area or away from a curb such distance as is unlawful.\n(c) A person must not, for camping purposes, leave or park a travel trailer on or within the limits of any highway or on any highway right-of-way, except where signs are erected designating the place as a campsite.\n(d) A person must not stop or park a vehicle on a street or highway when directed or ordered to proceed by any peace officer invested by law with authority to direct, control, or regulate traffic.\n(a) If a motor vehicle is stopped, standing, or parked in violation of subdivision 1, the owner of the vehicle, or for a leased motor vehicle the lessee of the vehicle, is guilty of a petty misdemeanor.\n(b) The owner or lessee may not be fined under paragraph (a) if (1) another person is convicted for, or pleads guilty to, that violation, or (2) the motor vehicle was stolen at the time of the violation.\n(c) Paragraph (a) does not apply to a lessor of a motor vehicle if the lessor keeps a record of the name and address of the lessee.\n(d) Paragraph (a) does not prohibit or limit the prosecution of a motor vehicle operator who violates subdivision 1.\n(e) A violation under paragraph (a) does not constitute grounds for revocation or suspension of the owner's or lessee's driver's license.",
	"repealed": false
}