{
	"id": "51A.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.44",
	"title": "51A.44 REPORTS AND EXAMINATIONS.",
	"text": "On or before the last day of April in each year, every association shall make an annual written report to the commissioner, upon a form to be prescribed and furnished by the commissioner, of its affairs and operations, which shall include a complete statement of its financial condition, including a statement of income and expense since its last previous similar report, for the 12 months ending on the 31st day of December of the previous year. Every such report shall be verified by the president and treasurer.\nEvery association also shall make such other reports as the commissioner may from time to time require, which shall be in such form and filed on such date as the commissioner may prescribe and shall, if required, be verified in the same manner as the annual report.\n[Repealed, 1984 c 576 s 27]\nIn lieu of such examination, the commissioner may accept any examination made by a federal home loan bank, the federal home loan bank board, or by the Federal Savings and Loan Insurance Corporation. One copy of any examination, signed and certified by the agencies making such examination, shall be filed promptly with the commissioner.\nWhenever, in the judgment of the commissioner, the condition of any association renders it necessary or expedient to make an extra examination of audit or to devote any extraordinary attention to its affairs, the commissioner shall cause the same to be done. A full and complete copy of the report of all examinations and audits shall be furnished to the association examined. Such report of examination or audit shall be presented by the president to the board of directors at its next regular or special meeting.\nThe commissioner is authorized in connection with any examination or audit of any association to cause to be made appraisal so real estate held by the association or securing the association's assets when specific facts or information with respect to real estate held, secured loans or lending, or when in the commissioner's opinion the association's policies, practices, operating results and trends give evidence that an association's appraisals may be excessive, that lending or investment may be of a marginal nature, that appraisal policies and practices may not conform with generally accepted and established professional standards, or that real estate held by the association or assets secured by real estate are overvalued. In lieu of causing such appraisals to be made, the commissioner may accept any appraisal caused to be made by a federal home loan bank, the Federal Home Loan Bank Board, or by the Federal Savings and Loan Insurance Corporation or other insuring agency of an insured association. Unless otherwise ordered by the commissioner, appraisal of real estate in connection with any examination or audit pursuant to this section shall be made by a professional appraiser or appraisers selected by the commissioner, and the cost of such appraisal promptly shall be paid by such association directly to such appraiser or appraisers upon receipt by the association of a statement of such cost bearing the written approval of the commissioner. A copy of the report of each appraisal caused to be made by the commissioner pursuant to this subdivision shall be furnished to the association within a reasonable time, not to exceed 60 days, following the completion of such appraisals, and may in the case of an insured association be furnished to the insuring agency.",
	"repealed": false
}