{
	"id": "115.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.035",
	"title": "115.035 EXTERNAL PEER REVIEW OF WATER QUALITY STANDARDS.",
	"text": "(a) Every new or revised numeric water quality standard must be supported by a technical support document that provides the scientific basis for the proposed standard and that has undergone external, scientific peer review. Numeric water quality standards in which the agency is adopting, without change, a United States Environmental Protection Agency criterion that has been through peer review are not subject to this paragraph. Documentation of the external peer review panel, including the name or names of the peer reviewer or reviewers, must be included in the statement of need and reasonableness for the water quality standard.\n(b) Every technical support document developed by the agency must be released in draft form for public comment before peer review and before finalizing the technical support document.\n(c) The commissioner must provide public notice and information about the external peer review through the request for comments published at the beginning of the rulemaking process for the numeric water quality standard, and:\n(1) the request for comments must identify the draft technical support document and where the document can be found;\n(2) the request for comments must include a proposed charge for the external peer review and request comments on the charge;\n(3) all comments received during the public comment period must be made available to the external peer reviewers; and\n(4) if the agency is not soliciting external peer review because the agency is adopting a United States Environmental Protection Agency criterion without change, that must be noted in the request for comments.\n(d) The purpose of the external peer review is to evaluate whether the technical support document and proposed standard are based on sound scientific knowledge, methods, and practices. The external peer review must be conducted according to the guidance in the most recent edition of the United States Environmental Protection Agency's Peer Review Handbook. Peer reviewers must not have participated in developing the scientific basis of the standard. Peer reviewers must disclose any activities or circumstances that could pose a conflict of interest or create an appearance of a loss of impartiality that could interfere with an objective review.\n(e) The type of review and the number of peer reviewers depends on the nature of the science underlying the standard. A panel review must be used when the agency is developing significant new science or science that expands significantly beyond current documented scientific practices or principles.\n(f) In response to the findings of the external peer review, the agency must revise the draft technical support document as appropriate. The findings of the external peer review must be documented and attached to the final technical support document, which must be an exhibit as part of the statement of need and reasonableness in the rulemaking to adopt the new or revised water quality standard. The agency must note changes in the final technical support document made in response to the external peer review.\n(g) By December 15 each year, the commissioner must post on the agency's website a report identifying the water quality standards development work in progress or completed in the past year, the lead agency scientist for each development effort, and opportunities for public input.",
	"repealed": false
}