{
	"id": "383B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.31",
	"title": "383B.31 DUTIES OF HUMAN RESOURCES DIRECTOR.",
	"text": "(a) The director as administrator of the Human Resources Department shall cooperate with and assist department heads and elected officials in providing an effective human resources program. The director shall direct and supervise all of the Human Resources Department's administrative and technical activities in addition to the duties imposed on the director in sections 383B.26 to 383B.42.\n(b) The director shall:\n(1) attend the meetings of the board, act as its secretary and maintain its official records;\n(2) appoint the employees of the Human Resources Department in accordance with and subject to the provisions of sections 383B.26 to 383B.42; and\n(3) recommend rules and amendments to rules for the administration of sections 383B.26 to 383B.42.\n(c) The director shall establish uniform procedures and standards to:\n(1) prepare, recommend and maintain a classification plan which shall group all positions in the county into classes;\n(2) prepare, recommend, and maintain a compensation plan for the county service;\n(3) except as provided in clauses (4) and (5), develop and hold competitive examinations to determine the qualifications of persons seeking employment in any class and to establish lists of those passing such examinations;\n(4) develop a procedure and define the criteria for the selection and referral of qualified applicants to fill positions in classifications involving unskilled tasks or in classifications which require state licensure or certification to engage in the activity;\n(5) establish alternative selection procedures to measure the ability of persons whose disabilities are so severe that the usual selection process cannot adequately predict job performance;\n(6) when a vacancy is to be filled, to certify to the appointing authority upon requisition, the names of the persons highest on the appropriate layoff list, or if there is no such list, the appropriate eligible list for the class;\n(7) maintain records necessary for the proper administration of sections 383B.26 to 383B.42;\n(8) provide a system for checking payrolls and accounts for the payment of compensation to employees in the classified and unclassified service so as to enable the director, upon evidence thereof, to certify or cause to be certified the persons whose names appear thereon have been employed or on authorized leave before payment may be lawfully made to such employees;\n(9) make investigations concerning the administration of sections 383B.26 to 383B.42 and rules made thereunder, and take corrective actions as deemed reasonable and appropriate to the situation;\n(10) make investigations and reports required by the county board and report thereon; and\n(11) make an annual report to the county board and the Human Resources Board on the activities of the Human Resources Department.\n(d) The classification plan authorized in paragraph (c), clause (1), is effective on approval by the county board.\n(e) The compensation plan authorized in paragraph (c), clause (2), may include benefits and other emoluments to improve the public service as determined by the human resources director. The plan is effective on approval by the county board which may approve or reject all or part of it.\n(f) The examination process described in paragraph (c), clause (3), must provide for: (1) the rejection of otherwise eligible applicants or candidates who fail to comply with the reasonable requirements of the human resources director; and (2) examinations that may consist of any one or a combination of the following: written or oral tests of the subjective or objective type, physical tests, practical or demonstration tests, or evaluation of past training and experience. Oral tests, either of the question and answer type, or the interview type, may be used to test the candidates.\n(g) The classifications described in paragraph (c), clause (4), must be authorized by the county board. Applicants to fill vacancies in the classifications are exempt from ranking and certification provided for in section 383B.29, subdivision 2, paragraph (b), clause (2). The director shall refer all qualified applicants to the appointing authority having vacancies in the appropriate classifications.",
	"repealed": false
}