{
	"id": "424A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.08",
	"title": "424A.08 MUNICIPALITY WITHOUT RELIEF ASSOCIATION; AUTHORIZED DISBURSEMENTS.",
	"text": "(a) Any municipality which is entitled to receive fire state aid but which has no firefighters relief association directly associated with its fire department and which has no full-time firefighters with retirement coverage by the public employees police and fire retirement plan shall deposit the fire state aid in a special account established for that purpose in the municipal treasury. Disbursement from the special account may not be made for any purpose except:\n(1) payment of the fees, dues and assessments to the Minnesota State Fire Department Association and to the state Volunteer Firefighters Benefit Association in order to entitle its firefighters to membership in and the benefits of these state associations;\n(2) payment of the cost of purchasing and maintaining needed equipment for the fire department; and\n(3) payment of the cost of construction, acquisition, repair, or maintenance of buildings or other premises to house the equipment of the fire department.\n(b) A municipality which is entitled to receive fire state aid, which has no firefighters relief association directly associated with its fire department, which does not participate in the statewide volunteer firefighter plan under chapter 353G, and which has full-time firefighters with retirement coverage by the public employees police and fire retirement plan may disburse the fire state aid as provided in paragraph (a), for the payment of the employer contribution requirement with respect to firefighters covered by the public employees police and fire retirement plan under section 353.65, subdivision 3, or for a combination of the two types of disbursements.\n(c) A municipality that has no firefighters relief association directly associated with it and that participates in the statewide volunteer firefighter plan under chapter 353G shall transmit any fire state aid that it receives to the statewide volunteer firefighter fund.",
	"repealed": false
}