{
	"id": "61A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.25",
	"title": "61A.25 STANDARD VALUATION LAW.",
	"text": "This section shall be known as the \"Standard Valuation Law.\"\n(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Accident and health insurance\" means contracts that incorporate morbidity risk and provide protection against economic loss resulting from accident, sickness, or medical conditions and as may be specified in the valuation manual.\n(c) \"Appointed actuary\" means a qualified actuary who is appointed in accordance with the valuation manual to prepare the actuarial opinion required in subdivision 2d.\n(d) \"Company\" means an entity that (1) has written, issued, or reinsured life insurance contracts, accident and health insurance contracts, or deposit-type contracts in this state and has at least one such policy in force or on claim, or (2) has written, issued, or reinsured life insurance contracts, accident and health insurance contracts, or deposit-type contracts in any state and is required to hold a certificate of authority to write life insurance, accident and health insurance, or deposit-type contracts in this state.\n(e) \"Deposit-type contract\" means contracts that do not incorporate mortality or morbidity risks and as may be specified in the valuation manual.\n(f) \"Life insurance\" means contracts that incorporate mortality risk, including annuity and pure endowment contracts, and as may be specified in the valuation manual.\n(g) \"NAIC\" means the National Association of Insurance Commissioners.\n(h) \"Operative date of the valuation manual\" means January 1 of the first calendar year that the valuation manual is effective.\n(i) \"Policyholder behavior\" means an action a policyholder, contract holder, or any other person with the right to elect options, such as a certificate holder, may take under a policy or contract subject to this section including, but not limited to, lapse, withdrawal, transfer, deposit, premium payment, loan, annuitization, or benefit elections prescribed by the policy or contract, but excluding events of mortality or morbidity that result in benefits prescribed in their essential aspects by the terms of the policy or contract.\n(j) \"Principle-based valuation\" means a reserve valuation that uses one or more methods or one or more assumptions determined by the insurer and is required to comply with subdivision 11, as specified in the valuation manual.\n(k) \"Qualified actuary\" means an individual who is qualified to sign the applicable statement of actuarial opinion in accordance with the American Academy of Actuaries qualification standards for actuaries signing such statements and who meets the requirements specified in the valuation manual.\n(l) \"Tail risk\" means a risk that occurs either where the frequency of low probability events is higher than expected under a normal probability distribution or where there are observed events of significant size or magnitude.\n(m) \"Valuation manual\" means the manual of valuation instructions adopted by the NAIC as specified in this section or as subsequently amended.\n(a) The commissioner shall cause to be valued annually the reserve liabilities, hereinafter called reserves, for all outstanding life insurance policies and annuity and pure endowment contracts of every life insurance company doing business in this state, except that in the case of a foreign or alien insurer such valuation shall be limited to its insurance transactions in the United States, issued on or after the operative date of Laws 1947, chapter 182, and prior to the operative date of the valuation manual. In calculating such reserves, the commissioner may use group methods and approximate averages for fractions of a year or otherwise. In lieu of the valuation of the reserves herein required of any foreign or alien company, the commissioner may accept any valuation made, or caused to be made, by the insurance supervisory official of any state or other jurisdiction when such valuation complies with the minimum standard provided in this section. In the case of insurance issued by a domestic insurer upon the lives of residents of a foreign country, the commissioner may vary the mortality standard to a standard applicable to that country.\n(b) The provisions in subdivisions 3, 3a, 3b, 4, 4a, 5, 6, 7, 8, and 9 shall apply to all policies and contracts, as appropriate, subject to this section issued on or after the operative date of Laws 1947, chapter 182, and, prior to the operative date of the valuation manual and the provisions in subdivisions 10 and 11, shall not apply to any such policies and contracts.\n(c) The minimum standard for the valuation of policies and contracts issued prior to the operative date of Laws 1947, chapter 182, shall be that provided by the laws in effect immediately prior to that date.\n(a) Every life insurance company doing business in this state shall annually submit the opinion of a qualified actuary as to whether the reserves and related actuarial items held in support of the policies and contracts specified by the commissioner by rule are computed appropriately, are based on assumptions which satisfy contractual provisions, are consistent with prior reported amounts, and comply with applicable laws of this state. The commissioner may by rule define the specifics of this opinion and add any other items considered to be necessary to its scope. The opinion must be included in the company's annual statement.\n(b) The requirement to annually submit the opinion of a qualified actuary applies to service plan corporations licensed under chapter 62C, to legal service plans licensed under chapter 62G, and to all fraternal benefit societies except those societies paying only sick benefits not exceeding $250 in any one year, or paying funeral benefits of not more than $350, or aiding those dependent on a member not more than $350, nor any subordinate lodge or council which is, or whose members are, assessed for benefits which are payable by a grand body.\n(c) The opinion applies to all business in force, including individual and group health insurance plans, and must be based on standards adopted by the Actuarial Standards Board. The opinion must be acceptable to the commissioner in both form and substance.\n(d) In the case of an opinion required to be submitted by a foreign or alien company, the commissioner may accept the opinion filed by that company with the insurance supervisory official of another state if the commissioner determines that the opinion reasonably meets the requirements applicable to a company domiciled in this state.\n(e) For the purposes of this section, \"qualified actuary\" means a member in good standing of the American Academy of Actuaries who meets the requirements specified in the regulations.\n(f) The board of directors of every insurer subject to this section shall appoint a qualified actuary to sign its actuarial opinion. The appointment of the qualified actuary shall be approved by the commissioner. The qualified actuary so appointed may be an employee of the insurer. Notice of the appointment, including a copy of the board of directors' resolution, and the date of appointment shall be filed with the commissioner. The notice may be filed before or at the time the actuarial opinion is submitted. The notice shall state the qualifications of the actuary. If the board appoints a new actuary to sign actuarial opinions during the year, the commissioner shall be notified of the new appointment and the reason for change.\n(g) Except in cases of fraud or willful misconduct, the qualified actuary is not liable for damages to any person, other than the insurance company and the commissioner, for any act, error, omission, decision, or conduct with respect to the actuary's opinion.\n(h) A memorandum, in form and substance acceptable to the commissioner based on standards adopted by the Actuarial Standards Board and on additional standards as the commissioner may by rule prescribe, must be prepared to support each actuarial opinion.\n(i) If the insurance company fails to provide a supporting memorandum at the request of the commissioner within a period specified by the commissioner, or the commissioner determines that the supporting memorandum provided by the insurance company fails to meet the standards based on standards adopted by the Actuarial Standards Board and on additional standards as the commissioner may by rule prescribe or is otherwise unacceptable to the commissioner, the commissioner may engage a qualified actuary at the expense of the company to review the opinion and the basis for the opinion and prepare the required supporting memorandum. The commissioner may only seek reimbursement from a company for the actual expenses incurred by an actuary in reviewing or preparing a supporting memorandum for that company.\n(j) Any memorandum in support of the opinion, and any other material provided by the company to the commissioner in connection with the memorandum, must be kept confidential by the commissioner and must not be made public and is not subject to subpoena, other than for the purpose of defending an action seeking damages from any person by reason of any action required by this section or by rules promulgated under this section. The memorandum or other material may otherwise be released by the commissioner (1) with the written consent of the company or (2) to the American Academy of Actuaries upon request stating that the memorandum or other material is required for the purpose of professional disciplinary proceedings and setting forth procedures satisfactory to the commissioner for preserving the confidentiality of the memorandum or other material. Once any portion of the confidential memorandum is cited by the company in its marketing or is cited before any governmental agency other than a state insurance department or is released by the company to the news media, all portions of the confidential memorandum are no longer confidential.\n(a) Every life insurance company, except as exempted by or pursuant to regulation, shall also annually include in the opinion required under subdivision 2a, paragraph (a), an opinion of the same qualified actuary as to whether the reserves and related actuarial items, including page 3, line 10, of the annual statement, held in support of the policies and contracts specified by the commissioner, when considered in light of the assets held by the company with respect to the reserves and related actuarial items, including but not limited to the investment earnings on the assets and the considerations anticipated to be received and retained under the policies and contracts, make adequate provision for the company's obligations under the policies and contracts, including but not limited to the benefits under and expenses associated with the policies and contracts.\n(b) The commissioner may provide by rule for a transition period for establishing any higher reserves which the qualified actuary may consider necessary in order to give the opinion required under subdivision 2a.\n(a) The commissioner shall annually value, or cause to be valued, the reserve liabilities referred to in this section as reserves for all outstanding life insurance contracts, annuity and pure endowment contracts, accident and health contracts, and deposit-type contracts of every company issued on or after the operative date of the valuation manual. In lieu of the valuation of the reserves required of a foreign or alien company, the commissioner may accept a valuation made, or caused to be made, by the insurance supervisory official of any state or other jurisdiction when the valuation complies with the minimum standard provided in this section.\n(b) The provisions in subdivisions 10 and 11 shall apply to all policies and contracts issued on or after the operative date of the valuation manual.\n(a) Every company with outstanding life insurance contracts, accident and health insurance contracts, or deposit-type contracts in this state and subject to regulation by the commissioner shall annually submit the opinion of the appointed actuary as to whether the reserves and related actuarial items held in support of the policies and contracts are computed appropriately, are based on assumptions that satisfy contractual provisions, are consistent with prior reported amounts, and comply with applicable laws of this state. The valuation manual will prescribe the specifics of this opinion, including any items deemed to be necessary to its scope.\n(b) Every company with outstanding life insurance contracts, accident and health insurance contracts, or deposit-type contracts in this state and subject to regulation by the commissioner, except as exempted in the valuation manual, shall annually include in the opinion required by paragraph (a) an opinion of the same appointed actuary as to whether the reserves and related actuarial items held in support of the policies and contracts specified in the valuation manual, when considered in light of the assets held by the company with respect to the reserves and related actuarial items, including but not limited to the investment earnings on the assets and the considerations anticipated to be received and retained under the policies and contracts, make adequate provision for the company's obligations under the policies and contracts, including but not limited to the benefits under and expenses associated with the policies and contracts.\n(c) Each opinion required by paragraph (b) shall be governed by the following provisions:\n(1) a memorandum, in form and substance as specified in the valuation manual, and acceptable to the commissioner, shall be prepared to support each actuarial opinion; and\n(2) if the company fails to provide a supporting memorandum at the request of the commissioner within a period specified in the valuation manual or the commissioner determines that the supporting memorandum provided by the company fails to meet the standards prescribed by the valuation manual or is otherwise unacceptable to the commissioner, the commissioner may engage a qualified actuary at the expense of the company to review the opinion and the basis for the opinion and prepare the supporting memorandum required by the commissioner. The commissioner may only seek reimbursement from a company for the actual expenses incurred by an actuary in reviewing or preparing a supporting memorandum for that company.\n(d) Every opinion subject to this subdivision shall be governed by the following provisions:\n(1) the opinion shall be in form and substance as specified in the valuation manual and acceptable to the commissioner;\n(2) the opinion shall be submitted with the annual statement reflecting the valuation of such reserve liabilities for each year ending on or after the operative date of the valuation manual;\n(3) the opinion shall apply to all policies and contracts subject to paragraph (b), plus other actuarial liabilities as may be specified in the valuation manual;\n(4) the opinion shall be based on standards adopted from time to time by the Actuarial Standards Board or its successor and on such additional standards as may be prescribed in the valuation manual;\n(5) in the case of an opinion required to be submitted by a foreign or alien company, the commissioner may accept the opinion filed by that company with the insurance supervisory official of another state if the commissioner determines that the opinion reasonably meets the requirements applicable to a company domiciled in this state;\n(6) except in cases of fraud or willful misconduct, the appointed actuary shall not be liable for damages to any person, other than the company and the commissioner for any act, error, omission, decision, or conduct with respect to the appointed actuary's opinion; and\n(7) the commissioner may take disciplinary action against a company or an appointed actuary for failure to satisfy the requirements of this subdivision.\nExcept as otherwise provided in subdivisions 3a and 3b, the minimum standard for the valuation of the policies and contracts issued prior to the operative date of Laws 1947, chapter 182, shall be that provided by the laws in effect immediately prior to that date. Except as provided in subdivisions 3a and 3b, the minimum standard for the valuation of the policies and contracts issued on or after the operative date of Laws 1947, chapter 182, shall be the commissioners reserve valuation methods described in subdivisions 4, 4a and 7, 3-1/2 percent interest, or in the case of policies and contracts, other than annuity and pure endowment contracts, issued on or after April 11, 1974, four percent interest for policies issued prior to August 1, 1978, 5-1/2 percent interest for single premium life insurance policies and 4-1/2 percent interest for other policies issued on or after August 1, 1978, and the following tables:\n(a) For ordinary policies of life insurance issued on the standard basis, excluding any disability and accidental death benefits in the policies, the Commissioners 1941 Standard Ordinary Mortality Table for the policies issued prior to the operative date of section 61A.24, subdivision 9 and the Commissioners 1958 Standard Ordinary Mortality Table for the policies issued on or after the operative date of section 61A.24, subdivision 9, and prior to the operative date of section 61A.24, subdivision 12; provided, that for any category of the policies issued on female risks all modified net premiums and present values referred to in Laws 1959, chapter 26, may be calculated according to an age not more than six years younger than the actual age of the insured; and for policies issued on or after the operative date of section 61A.24, subdivision 12:\n(1) the Commissioners 1980 Standard Ordinary Mortality Table;\n(2) at the election of the company for any one or more specified plans of life insurance, the Commissioners 1980 Standard Ordinary Mortality Table with Ten-Year Select Mortality Factors; or\n(3) any ordinary mortality table, including any adopted after 1980 by the National Association of Insurance Commissioners, which is approved by rule adopted by the commissioner for use in determining the minimum standard of valuation for the policies.\n(b) For industrial life insurance policies issued on the standard basis, excluding any disability and accidental death benefits in the policies, the 1941 Standard Industrial Mortality Table for the policies issued prior to the operative date of section 61A.24, subdivision 11, and for the policies issued on or after the operative date, the Commissioners 1961 Standard Industrial Mortality Table or any industrial mortality table, including any adopted after 1980 by the National Association of Insurance Commissioners, that is approved by rule adopted by the commissioner for use in determining the minimum standard of valuation for the policies.\n(c) For individual annuity and pure endowment contracts, excluding any disability and accidental death benefits in the policies, the 1937 Standard Annuity Mortality Table or, at the option of the company, the Annuity Mortality Table for 1949, ultimate, or any modification of either of these tables approved by the commissioner.\n(d) For group annuity and pure endowment contracts, excluding any disability and accidental death benefits in the policies, the Group Annuity Mortality Table for 1951, any modification of the table approved by the commissioner, or at the option of the company, any of the tables or modifications of tables specified for individual annuity and pure endowment contracts.\n(e) For total and permanent disability benefits in or supplemental to ordinary policies or contracts, for policies or contracts issued on or after January 1, 1966, the tables of period 2 disablement rates and the 1930 to 1950 termination rates of the 1952 disability study of the Society of Actuaries, with due regard to the type of benefit or any tables of disablement rates and termination rates, including any adopted after 1980 by the National Association of Insurance Commissioners, that are approved by rule adopted by the commissioner for use in determining the minimum standard of valuation for the policies; for policies or contracts issued on or after January 1, 1963, and prior to January 1, 1966, either the tables or, at the option of the company, the class (3) disability table (1926); and for policies issued prior to January 1, 1963, the class (3) disability table (1926). The table shall, for active lives, be combined with a mortality table permitted for calculating the reserves for life insurance policies.\n(f) For accidental death benefits in or supplementary to policies, for policies issued on or after January 1, 1966, the 1959 Accidental Death Benefits Table or any accidental death benefits table, including any adopted after 1980 by the National Association of Insurance Commissioners, that is approved by rule adopted by the commissioner for use in determining the minimum standard of valuation for the policies; for policies issued on or after January 1, 1963, and prior to January 1, 1966, either table or, at the option of the company, the Intercompany Double Indemnity Mortality Table; and for policies issued prior to January 1, 1963, the Intercompany Double Indemnity Mortality Table. Either table shall be combined with a mortality table permitted for calculating the reserves for life insurance policies.\n(g) For group life insurance, life insurance issued on the substandard basis and other special benefits, any tables as may be approved by the commissioner.\nExcept as provided in subdivision 3b, the minimum standard of valuation for individual annuity and pure endowment contracts issued on or after the operative date of this subdivision and for annuities and pure endowments purchased on or after this operative date under group annuity and pure endowment contracts, shall be the commissioner's reserve valuation methods defined in subdivisions 4 and 4a, and the following tables and interest rates:\n(a) For individual annuity and pure endowment contracts issued prior to August 1, 1978, excluding any disability and accidental death benefits in the contracts, the 1971 individual annuity mortality table, or any modification of this table approved by the commissioner, and six percent interest for single premium immediate annuity contracts, and four percent interest for all other individual annuity and pure endowment contracts.\n(b) For individual single premium immediate annuity contracts issued on or after August 1, 1978, excluding any disability and accidental death benefits in the contracts, the 1971 individual annuity mortality table, any individual annuity mortality table, including any adopted after 1980 by the National Association of Insurance Commissioners, that is approved by rule adopted by the commissioner for use in determining the minimum standard of valuation for the contracts, or any modification of these tables approved by the commissioner, and 7-1/2 percent interest.\n(c) For individual annuity and pure endowment contracts issued on or after August 1, 1978, other than single premium immediate annuity contracts, excluding any disability and accidental death benefits in the contracts, the 1971 individual annuity mortality table, any individual annuity mortality table, including any adopted after 1980 by the National Association of Insurance Commissioners, that is approved by rule adopted by the commissioner for use in determining the minimum standard of valuation for the contracts, or any modification of these tables approved by the commissioner, and 5-1/2 percent interest for single premium deferred annuity and pure endowment contracts and 4-1/2 percent interest for all other individual annuity and pure endowment contracts.\n(d) For annuities and pure endowments purchased prior to August 1, 1978, under group annuity and pure endowment contracts, excluding any disability and accidental death benefits purchased under the contracts, the 1971 group annuity mortality table, or any modification of this table approved by the commissioner, and six percent interest.\n(e) For annuities and pure endowments purchased on or after August 1, 1978, under group annuity and pure endowment contracts, excluding any disability and accidental death benefits purchased under the contracts, the 1971 group annuity mortality table, any group annuity mortality table, including any adopted after 1980 by the National Association of Insurance Commissioners, that is approved by rule adopted by the commissioner for use in determining the minimum standard of valuation for the annuities and pure endowments, or any modification of these tables approved by the commissioner, and 7-1/2 percent interest.\nAfter April 11, 1974, a company may file with the commissioner a written notice of its election to comply with the provisions of this subdivision after a specified date before January 1, 1979, which shall be the operative date of this subdivision for the company. A company may elect a different operative date for individual annuity and pure endowment contracts from that elected for group annuity and pure endowment contracts. If a company makes no election, the operative date of this subdivision for the company shall be January 1, 1979.\n(a) The interest rates used in determining the minimum standard for the valuation of the following shall be the calendar year statutory valuation interest rates as defined in this subdivision:\n(1) life insurance policies issued in a particular calendar year, on or after the operative date of section 61A.24, subdivision 12;\n(2) individual annuity and pure endowment contracts issued in a particular calendar year on or after January 1, 1982;\n(3) annuities and pure endowments purchased in a particular calendar year on or after January 1, 1982, under group annuity and pure endowment contracts; and\n(4) the net increase, if any, in a particular calendar year after January 1, 1982, in amounts held under guaranteed interest contracts.\n(b) The calendar year statutory valuation interest rates, I, shall be determined as follows and the results rounded to the nearer one-quarter of one percent:\n(1) for life insurance, I = .03 + W (R1 - .03) + (W/2) (R2 - .09);\n(2) for single premium immediate annuities and for annuity benefits involving life contingencies arising from other annuities with cash settlement options and from guaranteed interest contracts with cash settlement options, I = .03 + W (R - .03) where R1 is the lesser of R and .09, R2 is the greater of R and .09, R is the reference interest rate defined in this subdivision, and W is the weighting factor defined in this subdivision;\n(3) for other annuities with cash settlement options and guaranteed interest contracts with cash settlement options, valued on an issue year basis, except as stated in clause (2), the formula for life insurance stated in clause (1) shall apply to annuities and guaranteed interest contracts with guarantee durations in excess of ten years and the formula for single premium immediate annuities stated in clause (2) shall apply to annuities and guaranteed interest contracts with guarantee duration of ten years or less;\n(4) for other annuities with no cash settlement options and for guaranteed interest contracts with no cash settlement options, the formula for single premium immediate annuities stated in clause (2) shall apply;\n(5) for other annuities with cash settlement options and guaranteed interest contracts with cash settlement options, valued on a change in fund basis, the formula for single premium immediate annuities stated in clause (2) shall apply.\nHowever, if the calendar year statutory valuation interest rate for life insurance policies issued in a calendar year determined without reference to this sentence differs from the corresponding actual rate for similar policies issued in the immediately preceding calendar year by less than one-half of one percent, the calendar year statutory valuation interest rate for the life insurance policies shall be equal to the corresponding actual rate for the immediately preceding calendar year.\nFor purposes of applying the immediately preceding sentence, the calendar year statutory valuation interest rate for life insurance policies issued in a calendar year shall be determined for 1980 using the reference interest rate defined for 1979 and shall be determined for each subsequent calendar year regardless of when section 61A.24, subdivision 12, becomes operative.\n(c) The weighting factors referred to in the formulas stated above are as follows:\n(1) The weighting factors for life insurance are:\nFor life insurance, the guarantee duration is the maximum number of years the life insurance can remain in force on a basis guaranteed in the policy or under options to convert to plans of life insurance with premium rates or nonforfeiture values or both which are guaranteed in the original policy;\n(2) The weighting factor for single premium immediate annuities and for annuity benefits involving life contingencies arising from other annuities with cash settlement options and guaranteed interest contracts with cash settlement options is .80; and\n(3) The weighting factors for other annuities and for guaranteed interest contracts, except as stated in clause (2), shall be as specified in tables (i), (ii), and (iii), according to the rules and definitions in (iv), (v), and (vi):\n(iv) For other annuities with cash settlement options and guaranteed interest contracts with cash settlement options, the guarantee duration is the number of years for which the contract guarantees interest rates in excess of the calendar year statutory valuation interest rate for life insurance policies with guarantee duration in excess of 20 years. For other annuities with no cash settlement options and for guaranteed interest contracts with no cash settlement options, the guarantee duration is the number of years from the date of issue or date of purchase to the date annuity benefits are scheduled to commence.\n(v) Plan type as used in the above tables is defined as follows:\nPlan Type A: At any time policyholders may withdraw funds only (1) with an adjustment to reflect changes in interest rates or asset values since receipt of the funds by the insurance company, (2) without the adjustment but in installments over five years or more, or (3) as an immediate life annuity.\nPlan Type B: Before expiration of the interest rate guarantee, policyholders may withdraw funds only (1) with an adjustment to reflect changes in interest rates or asset values since receipt of the funds by the insurance company, or (2) without the adjustment but in installments over five years or more. At the end of interest rate guarantee, funds may be withdrawn without the adjustment in a single sum or installments over less than five years.\nPlan Type C: Policyholders may withdraw funds before expiration of interest rate guarantee in a single sum or installments over less than five years either (1) without adjustment to reflect changes in interest rates or asset values since receipt of the funds by the insurance company, or (2) subject only to a fixed surrender charge stipulated in the contract as a percentage of the fund.\n(vi) A company may elect to value guaranteed interest contracts with cash settlement options and annuities with cash settlement options on either an issue year basis or on a change in fund basis. Guaranteed interest contracts with no cash settlement options and other annuities with no cash settlement options must be valued on an issue year basis. As used in this subdivision, an issue year basis of valuation refers to a valuation basis under which the interest rate used to determine the minimum valuation standard for the entire duration of the annuity or guaranteed interest contract is the calendar year valuation interest rate for the year of issue or year of purchase of the annuity or guaranteed interest contract, and the change in fund basis of valuation refers to a valuation basis under which the interest rate used to determine the minimum valuation standard applicable to each change in the fund held under the annuity or guaranteed interest contract is the calendar year valuation interest rate for the year of the change in the fund.\n(d) The reference interest rate referred to in paragraph (b) shall be defined as follows:\n(1) for all life insurance, the lesser of the average over a period of 36 months and the average over a period of 12 months, ending on June 30 of the calendar year next preceding the year of issue, of Moody's Corporate Bond Yield Average-Monthly Average Corporates, as published by Moody's Investors Service, Inc.;\n(2) for single premium immediate annuities and for annuity benefits involving life contingencies arising from other annuities with cash settlement options and guaranteed interest contracts with cash settlement options, the average over a period of 12 months, ending on June 30 of the calendar year of issue or year of purchase, of Moody's Corporate Bond Yield Average-Monthly Average Corporates, as published by Moody's Investors Service, Inc.;\n(3) for other annuities with cash settlement options and guaranteed interest contracts with cash settlement options, valued on a year of issue basis, except as stated in clause (2), with guarantee duration in excess of ten years, the lesser of the average over a period of 36 months and the average over a period of 12 months, ending on June 30 of the calendar year of issue or purchase, of Moody's Corporate Bond Yield Average-Monthly Average Corporates, as published by Moody's Investors Service, Inc.;\n(4) for other annuities with cash settlement options and guaranteed interest contracts with cash settlement options, valued on a year of issue basis, except as stated in clause (2), with guarantee duration of ten years or less, the average over a period of 12 months, ending on June 30 of the calendar year of issue or purchase, of Moody's Corporate Bond Yield Average-Monthly Average Corporates, as published by Moody's Investors Service, Inc.;\n(5) for other annuities with no cash settlement options and for guaranteed interest contracts with no cash settlement options, the average over a period of 12 months, ending on June 30 of the calendar year of issue or purchase, of Moody's Corporate Bond Yield Average-Monthly Average Corporates, as published by Moody's Investors Service, Inc.; and\n(6) for other annuities with cash settlement options and guaranteed interest contracts with cash settlement options, valued on a change in fund basis, except as stated in clause (2), the average over a period of 12 months, ending on June 30 of the calendar year of the change in the fund, of Moody's Corporate Bond Yield Average-Monthly Average Corporates, as published by Moody's Investors Service, Inc.\n(e) In the event that Moody's Corporate Bond Yield Average-Monthly Average Corporates is no longer published by Moody's Investors Service, Inc., or in the event that the commissioner determines that Moody's Corporate Bond Yield Average-Monthly Average Corporates as published by Moody's Investors Service, Inc. is no longer appropriate for the determination of the reference interest rate, then an alternative method for determination of the reference interest rate, which has been approved by rule adopted by the commissioner, may be substituted.\n(a) Except as otherwise provided in paragraph (b) and subdivisions 4a and 7, reserves according to the commissioners reserve valuation method, for the life insurance and endowment benefits of policies providing for a uniform amount of insurance and requiring the payment of uniform premiums shall be the excess, if any, of the present value at the date of valuation of future guaranteed benefits provided for by the policies over the then present value of any future modified net premiums therefor. The modified net premiums for a policy shall be the uniform percentage of the respective contract premiums for the benefits such that the present value, at the date of issue of the policy, of all the modified net premiums shall be equal to the sum of the then present value of the benefits provided for by the policy and the excess of clause (1) over clause (2) as follows:\n(1) a net level annual premium equal to the present value, at the date of issue, of the benefits provided for after the first policy year, divided by the present value at the date of issue of an annuity of one per annum payable on the first and each subsequent anniversary of the policy on which a premium falls due; but the net level annual premium shall not exceed the net level annual premium on the 19 year premium whole life plan for insurance of the same amount at an age one year higher than the age at issue of the policy;\n(2) a net one year term premium for the benefits provided for in the first policy year.\n(b) For a life insurance policy issued on or after January 1, 1985, for which the contract premium in the first policy year exceeds that of the second year and for which no comparable additional benefit is provided in the first year for the excess and which provides an endowment benefit or a cash surrender value or a combination thereof in an amount greater than the excess premium, the reserve according to the commissioners reserve valuation method as of a policy anniversary occurring on or before the assumed ending date defined herein as the first policy anniversary on which the sum of any endowment benefit and any cash surrender value then available is greater than the excess premium shall, except as otherwise provided in subdivision 7, be the greater of the reserve as of the policy anniversary calculated as described in paragraph (a) and the reserve as of the policy anniversary calculated as described in that paragraph, but with the value defined in clause (1) of that paragraph being reduced by 15 percent of the amount of the excess first year premium; all present values of benefits and premiums being determined without reference to premiums or benefits provided for by the policy after the assumed ending date; the policy being assumed to mature on that date as an endowment; and the cash surrender value provided on that date being considered as an endowment benefit. In making the above comparison the mortality and interest bases stated in subdivisions 3 and 3b shall be used.\n(c) Reserves according to the commissioners reserve valuation method for (1) life insurance policies providing for a varying amount of insurance or requiring the payment of varying premiums, (2) group annuity and pure endowment contracts purchased under a retirement plan or plan of deferred compensation, established or maintained by an employer, including but not limited to a partnership or sole proprietorship, or by an employee organization, or by both, other than a plan providing individual retirement accounts or individual retirement annuities under Section 408 of the Internal Revenue Code, as amended, (3) disability and accidental death benefits in all policies and contracts, and (4) all other benefits, except life insurance and endowment benefits in life insurance policies and benefits provided by all other annuity and pure endowment contracts, shall be calculated by a method consistent with the principles of paragraphs (a) and (b), except that any extra premiums charged because of impairments or special hazards shall be disregarded in the determination of modified net premiums.\n(d) For a universal life insurance policy that guarantees coverage to remain in force as long as the accumulation of premiums paid satisfies a secondary guarantee requirement, reserves according to the commissioners reserve valuation method may be calculated using a lapse assumption only in accordance with and in the circumstances described in the National Association of Insurance Commissioners' accounting practices and procedures manual.\nThis subdivision shall apply to all annuity and pure endowment contracts other than group annuity and pure endowment contracts purchased under a retirement plan or plan of deferred compensation, established or maintained by an employer, including but not limited to a partnership or sole proprietorship, or by an employee organization, or by both, other than a plan providing individual retirement accounts or individual retirement annuities under Section 408 of the Internal Revenue Code, as amended.\nReserves according to the commissioner's annuity reserve method for benefits under annuity or pure endowment contracts, excluding any disability and accidental death benefits in the contracts, shall be the greatest of the respective excesses of the present values, at the date of valuation, of the future guaranteed benefits, including guaranteed nonforfeiture benefits, provided for by the contracts at the end of each respective contract year, over the present value, at the date of valuation, of any future valuation considerations derived from future gross considerations, required by the terms of the contract, that become payable prior to the end of the respective contract year. The future guaranteed benefits shall be determined by using the mortality table, if any, and the interest rate, or rates, specified in the contracts for determining guaranteed benefits. The valuation considerations are the portions of the respective gross considerations applied under the terms of the contracts to determine nonforfeiture values.\nA company's aggregate reserves for all life insurance policies, excluding disability and accidental death benefits, issued on or after the operative date of Laws 1947, chapter 182, shall not be less than the aggregate reserves calculated in accordance with the methods set forth in subdivisions 4, 4a, 7, and 8, and the mortality table or tables and rate or rates of interest used in calculating nonforfeiture benefits for the policies.\nIn no event shall the aggregate reserves for all policies, contracts, and benefits be less than the aggregate reserves determined by the appointed actuary to be necessary to render the opinion required under subdivisions 2a and 2b.\n(a) Reserves for policies and contracts issued prior to the operative date of Laws 1947, chapter 182, may be calculated, at the option of the company, according to any standards which produce greater aggregate reserves for all such policies and contracts than the minimum reserves required by the laws in effect immediately prior to such date.\n(b) Reserves for any category of policies, contracts or benefits as established by the commissioner, issued on or after the operative date of Laws 1947, chapter 182, may be calculated, at the option of the company, according to any standards which produce greater aggregate reserves for such category than those calculated according to the minimum standard herein provided, but the rate or rates of interest used for policies and contracts, other than annuity and pure endowment contracts, shall not be greater than the corresponding rate or rates of interest used in calculating any nonforfeiture benefits provided for in the policies or contracts.\n(c) Any such company which adopts at any time any standard of valuation producing greater aggregate reserves than those calculated according to the minimum standard provided under this section may, with the approval of the commissioner, adopt any lower standard of valuation, but not lower than the minimum herein provided. For purposes of this section, the holding of additional reserves previously determined by the appointed actuary to be necessary to give the opinion required under subdivisions 2a and 2d shall not be considered the adoption of a higher standard of valuation.\nIf in a contract year the gross premium charged by a company on a policy or contract is less than the valuation net premium for the policy or contract calculated by the method used in calculating the reserve thereon, but using the minimum valuation standards of mortality and rate of interest, the minimum reserve required for the policy or contract shall be the greater of either the reserve calculated according to the mortality table, rate of interest, and method actually used for the policy or contract, or the reserve calculated by the method actually used for the policy or contract but using the minimum valuation standards of mortality and rate of interest and replacing the valuation net premium by the actual gross premium in each contract year for which the valuation net premium exceeds the actual gross premium. The minimum valuation standards of mortality and rate of interest referred to in this subdivision are those standards stated in subdivisions 3 and 3b. However, for a life insurance policy issued on or after January 1, 1985, for which the gross premium in the first policy year exceeds that of the second year and for which no comparable additional benefit is provided in the first year for the excess and which provides an endowment benefit or a cash surrender value or a combination thereof in an amount greater than the excess premium, the foregoing provisions of this subdivision shall be applied as if the method actually used in calculating the reserve for the policy was the method described in subdivision 4, ignoring subdivision 4, paragraph (b). The minimum reserve at each policy anniversary of the policy shall be the greater of the minimum reserve calculated in accordance with subdivision 4, including subdivision 4, paragraph (b), and the minimum reserve calculated in accordance with this subdivision.\nIn the case of a plan of life insurance or annuity for which the minimum reserves cannot be determined by the methods described in subdivisions 4, 4a, and 7, the reserves which are held under any plan must:\n(a) be appropriate in relation to the benefits and the pattern of premiums for that plan, and\n(b) be computed by a method which is consistent with the principles of this section as determined by rules adopted by the commissioner.\nFor health, disability, accident, and sickness plans issued on or after the operative date of Laws 1947, chapter 182, and prior to the operative date of the valuation manual, the minimum standard of valuation is the standard adopted by the commissioner by rule. For accident and health insurance contracts issued on or after the operative date of the valuation manual, the standard prescribed in the valuation manual is the minimum standard of valuation required under subdivision 2c.\n(a) For policies issued on or after the operative date of the valuation manual, the standard prescribed in the valuation manual is the minimum standard of valuation required under subdivision 2c, except as provided under paragraph (e) or (g).\n(b) The operative date of the valuation manual is January 1 of the first calendar year following the first July 1 as of which all of the following have occurred:\n(1) the valuation manual has been adopted by the National Association of Insurance Commissioners by an affirmative vote of at least 42 members, or three-fourths of the members voting, whichever is greater;\n(2) the Standard Valuation Law, as amended by the National Association of Insurance Commissioners in 2009, or legislation including substantially similar terms and provisions, has been enacted by states representing greater than 75 percent of the direct premiums written as reported in the following annual statements submitted for 2008: life, accident and health annual statements; health annual statements; or fraternal annual statements; and\n(3) the Standard Valuation Law, as amended by the National Association of Insurance Commissioners in 2009, or legislation including substantially similar terms and provisions, has been enacted by at least 42 of the following 55 jurisdictions: the 50 states of the United States, American Samoa, the American Virgin Islands, the District of Columbia, Guam, and Puerto Rico.\n(c) Unless a change in the valuation manual specifies a later effective date, changes to the valuation manual shall be effective on January 1 following the date when the change to the valuation manual has been adopted by the National Association of Insurance Commissioners by an affirmative vote representing:\n(1) at least three-fourths of the members of the National Association of Insurance Commissioners voting, but not less than a majority of the total membership; and\n(2) members of the National Association of Insurance Commissioners representing jurisdictions totaling greater than 75 percent of the direct premiums written as reported in the following annual statements most recently available prior to the vote in clause (1): life, accident and health annual statements, health annual statements, or fraternal annual statements.\n(d) The valuation manual must specify all of the following:\n(1) minimum valuation standards for and definitions of the policies or contracts subject to subdivision 2c. Such minimum valuation standards shall be:\n(i) the commissioner's reserve valuation method for life insurance contracts, other than annuity contracts, subject to subdivision 2c;\n(ii) the commissioner's annuity reserve valuation method for annuity contracts subject to subdivision 2c; and\n(iii) minimum reserves for all other policies or contracts subject to subdivision 2c;\n(2) the policies or contracts or types of policies or contracts that are subject to the requirements of a principle-based valuation in subdivision 11, paragraph (a), and the minimum valuation standards consistent with those requirements;\n(3) for policies and contracts subject to a principle-based valuation under subdivision 11:\n(i) requirements for the format of reports to the commissioner under subdivision 11, paragraph (b), clause (3), which shall include information necessary to determine if the valuation is appropriate and in compliance with this section;\n(ii) assumptions shall be prescribed for risks over which the company does not have significant control or influence; and\n(iii) procedures for corporate governance and oversight of the actuarial function and a process for appropriate waiver or modification of such procedures;\n(4) for policies not subject to a principle-based valuation under subdivision 11 the minimum valuation standard shall either:\n(i) be consistent with the minimum standard of valuation prior to the operative date of the valuation manual; or\n(ii) develop reserves that quantify the benefits and guarantees and the funding associated with the contracts and their risks at a level of conservatism that reflects conditions that include unfavorable events that have a reasonable probability of occurring;\n(5) other requirements, including but not limited to those relating to reserve methods, models for measuring risk, generation of economic scenarios, assumptions, margins, use of company experience, risk measurement, disclosure, certifications, reports, actuarial opinions and memorandums, and transition rules and internal controls; and\n(6) the data and form of the data required under subdivision 12, with whom the data must be submitted, and may specify other requirements including data analyses and reporting of analyses.\n(e) In the absence of a specific valuation requirement or if a specific valuation requirement in the valuation manual is not, in the opinion of the commissioner, in compliance with this section, then the company shall, with respect to such requirements, comply with minimum valuation standards prescribed by the commissioner by rule.\n(f) The commissioner may engage a qualified actuary, at the expense of the company, to perform an actuarial examination of the company and opine on the appropriateness of any reserve assumption or method used by the company, or to review and opine on a company's compliance with any requirement in this section. The commissioner may rely upon the opinion, regarding provisions contained within this section, of a qualified actuary engaged by the commissioner of another state, district, or territory of the United States. The commissioner may only seek reimbursement from a company for the actual expenses incurred by an actuary in performing the actuarial examination and opining on the reserves of that company.\n(g) The commissioner may require a company to change an assumption or method that in the opinion of the commissioner is necessary in order to comply with the requirements of the valuation manual or this section, and the company shall adjust the reserves as required by the commissioner. The commissioner may take other disciplinary action to enforce this section.\n(a) A company must establish reserves using a principle-based valuation that meets the following conditions for policies or contracts as specified in the valuation manual:\n(1) quantify the benefits and guarantees and the funding associated with the contracts and their risks at a level of conservatism that reflects conditions that include unfavorable events that have a reasonable probability of occurring during the lifetime of the contracts. For polices or contracts with significant tail risk, reflects conditions appropriately adverse to quantify the tail risk;\n(2) incorporate assumptions, risk analysis methods, and financial models and management techniques that are consistent with, but not necessarily identical to, those utilized within the company's overall risk assessment process, while recognizing potential differences in financial reporting structures and any prescribed assumptions or methods;\n(3) incorporate assumptions that are derived in one of the following manners:\n(i) the assumption is prescribed in the valuation manual; or\n(ii) for assumptions that are not prescribed, the assumptions shall:\n(A) be established utilizing the company's available experience, to the extent it is relevant and statistically credible; or\n(B) to the extent that company data is not available, relevant, or statistically credible, be established utilizing other relevant, statistically credible experience; and\n(4) provide margins for uncertainty including adverse deviation and estimation error, such that the greater the uncertainty the larger the margin and resulting reserve.\n(b) A company using a principle-based valuation for one or more policies or contracts subject to this subdivision as specified in the valuation manual shall:\n(1) establish procedures for corporate governance and oversight of the actuarial valuation function consistent with those described in the valuation manual;\n(2) provide to the commissioner and the board of directors an annual certification of the effectiveness of the internal controls with respect to the principle-based valuation. Such controls shall be designed to ensure that all material risks inherent in the liabilities and associated assets subject to such valuation are included in the valuation and that valuations are made in accordance with the valuation manual. The certification shall be based on the controls in place as of the end of the preceding calendar year; and\n(3) develop and file with the commissioner upon request a principle-based valuation report that complies with standards prescribed in the valuation manual.\n(c) A principle-based valuation may include a prescribed formulaic reserve component.\nA company shall submit mortality, morbidity, policyholder behavior, or expense experience, and other data as prescribed in the valuation manual.\n(a) The following data are confidential or protected nonpublic data, as defined in section 13.02, subdivision 3 or 13:\n(1) a memorandum in support of an opinion submitted under subdivision 2a or 2d and any other documents, materials, and other information, including but not limited to all working papers, and copies thereof, created, produced, or obtained by or disclosed to the commissioner or any other person in connection with such memorandum;\n(2) all documents, materials, and other information, including but not limited to all working papers, and copies thereof, created, produced, or obtained by or disclosed to the commissioner or any other person in the course of an examination made under subdivision 10, paragraph (f), provided that if an examination report or other material prepared in connection with an examination under section 60A.031, subdivision 4, paragraph (f), is not given confidential treatment under that provision, an examination report or other material prepared in connection with an examination under subdivision 10, paragraph (f), is not given confidential treatment to the same extent as if the examination report or other material had been prepared under section 60A.031, subdivision 4, paragraph (f);\n(3) any reports, documents, materials, and other information developed by a company in support of, or in connection with, an annual certification by the company under subdivision 11, paragraph (b), clause (2), evaluating the effectiveness of the company's internal controls with respect to a principle-based valuation and any other documents, materials, and other information, including but not limited to all working papers, and copies thereof, created, produced, or obtained by or disclosed to the commissioner or any other person in connection with such reports, documents, materials, and other information;\n(4) any principle-based valuation report developed under subdivision 11, paragraph (b), clause (3), and any other documents, materials, and other information, including but not limited to all working papers, and copies thereof, created, produced, or obtained by or disclosed to the commissioner or any other person in connection with such report; and\n(5) any documents, materials, data, and other information submitted by a company under subdivision 12 (collectively, \"experience data\") and any other documents, materials, data, and other information, including but not limited to all working papers, and copies thereof, created or produced in connection with such experience data, in each case that includes any potentially company-identifying or personally identifiable information that is provided to or obtained by the commissioner together with any experience data, the experience materials, and any other documents, materials, data, and other information, including but not limited to all working papers, and copies thereof, created, produced, or obtained by or disclosed to the commissioner or any other person in connection with such experience materials.\n(b) Except as provided in this subdivision, the documents, materials, or other information described in paragraph (a) are not subject to subpoena and shall not be subject to discovery or admissible in evidence in any private civil action, provided that the commissioner is authorized to use the documents, materials, or other information described in paragraph (a) in the furtherance of any regulatory or legal action brought against the company as a part of the commissioner's official duties.\n(c) Neither the commissioner nor any person who received the documents, materials, or other information described in paragraph (a) while acting under the authority of the commissioner shall be permitted or required to testify in any private civil action concerning documents, materials, or other information classified by this subdivision.\n(d) In order to assist in the performance of the commissioner's duties, the commissioner may share documents, materials, data, and other information, including information that is confidential and privileged (i) with other state, federal, and international regulatory agencies and with the National Association of Insurance Commissioners and its affiliates and subsidiaries and (ii) in the case of the documents, materials, or other information specified in paragraph (a), clauses (1) and (4), only, with the Actuarial Board for Counseling and Discipline or its successor upon request stating that the documents, materials, or other information is required for the purpose of professional disciplinary proceedings and with state, federal, and international law enforcement officials; provided that the recipient agrees, and has the legal authority to agree, to maintain the confidential and privileged status of the documents, materials, data, and other information in the same manner and to the same extent as required for the commissioner.\n(e) The commissioner may receive documents, materials, data, and other information, including otherwise confidential and privileged documents, materials, data, or information, from the National Association of Insurance Commissioners and its affiliates and subsidiaries, from regulatory or law enforcement officials of other foreign or domestic jurisdictions and from the Actuarial Board for Counseling and Discipline or its successor and shall maintain the confidential and privileged status of any document, material, data, or other information received with notice or the understanding that it is confidential and privileged under the laws of the jurisdiction that is the source of the document, material, or other information.\n(f) The commissioner may enter into agreements governing sharing and use of information consistent with this subdivision.\n(g) No waiver of any applicable privilege or claim of confidentiality in documents, materials, or other information described in paragraph (a) shall occur as a result of disclosure to the commissioner under this subdivision or as a result of sharing as authorized in paragraph (d).\n(h) A privilege established under the law of a state or jurisdiction that is substantially similar to the privilege established under this subdivision shall be available and enforced in any proceeding in, and in any court of, this state.\n(i) Notwithstanding this subdivision, any documents, materials, or information specified in paragraph (a), clauses (1) and (4):\n(1) may be subject to subpoena for the purpose of defending an action seeking damages from the appointed actuary submitting the related memorandum in support of an opinion submitted under subdivision 2a or 2d or principle-based valuation report developed under subdivision 11, paragraph (b), clause (3), by reason of an action required by this section or by rules adopted hereunder;\n(2) may otherwise be released by the commissioner with the written consent of the company; and\n(3) once any portion of a memorandum in support of an opinion submitted under subdivision 2a or 2d or a principle-based valuation report developed under subdivision 11, paragraph (b), clause (3), is cited by the company in its marketing or is publicly volunteered to or before a governmental agency other than a state insurance department or is released by the company to the news media, all portions of such memorandum or report shall no longer be classified under this subdivision.\n(a) The commissioner may exempt specific product forms or product lines of a domestic company that is licensed and doing business only in Minnesota from the requirements of subdivision 10 provided:\n(1) the commissioner has issued an exemption in writing to the company and has not subsequently revoked the exemption in writing; and\n(2) the company computes reserves using assumptions and methods used prior to the operative date of the valuation manual in addition to any requirements established by the commissioner and adopted by rules.\n(b) For any company granted an exemption under this subdivision, subdivisions 2a, 2b, 2d, 3, 3a, 3b, 4, 4a, 5, 6, 7, 8, and 9 shall be applicable. With respect to any company applying this exemption, any reference to subdivision 10 found in subdivisions 2a, 2b, 2d, 3, 3a, 3b, 4, 4a, 5, 6, 7, 8, and 9 shall not be applicable.\nNotwithstanding anything in this section, or any other law to the contrary, a company may use the Commissioners 2017 Standard Ordinary Mortality Table in determining the minimum valuation standard for policies issued on or after January 1, 2017.",
	"repealed": false
}