{
	"id": "115A.1453",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1453",
	"title": "115A.1453 RECYCLABLE OR COMPOSTABLE COVERED MATERIALS LISTS; EXEMPT MATERIALS LIST.",
	"text": "By July 1, 2028, the commissioner must develop a list of covered materials determined to be recyclable or compostable statewide through systems where covered materials are commingled into a recyclables stream and a separate compostables stream. These covered materials must be collected at an optimal level of service and convenience for covered entities, at a minimum, wherever collection services for mixed municipal solid waste are available.\nBy July 1, 2028, the commissioner must complete a list of covered materials determined to be recyclable or compostable and collected statewide through systems other than the system required for covered materials on the list established in subdivision 1.\nThe commissioner must consult with the advisory board, producer responsibility organizations, service providers, political subdivisions, and other interested parties to develop or amend the recyclable or compostable covered materials lists and must review any requests by interested parties for addition or removal of covered materials from the lists created under this section.\nIn developing the lists under subdivisions 1 and 2, the commissioner may consider the following criteria:\n(1) current availability of recycling and composting collection services;\n(2) recycling and composting processing infrastructure;\n(3) capacity and technology for sorting covered materials;\n(4) whether a covered material is of a type and form that is regularly sorted and aggregated into defined streams for recycling processes or is included in a relevant Institute of Scrap Recycling Industries specification or its successors;\n(5) availability of responsible markets;\n(6) presence and amount of processing residuals, contamination, and toxic substances;\n(7) quantity of covered material estimated to be available and recoverable;\n(8) projected future conditions for the criteria in clauses (1) to (7); and\n(9) other criteria or factors, as determined by the commissioner.\nThe commissioner may amend a list completed under this section at any time and must provide amended lists to producer responsibility organizations within a reasonable amount of time after adopting an amendment. Producer responsibility organizations must provide amended lists to service providers as soon as possible after receiving the amendment and work to incorporate changes in relevant service provider reimbursement rates within a year.\n(a) A producer may request the commissioner, on a form prescribed by the commissioner, to classify as an exempt material one or more types of packaging. The commissioner must submit the request to the advisory board for review and comment before approving or denying the request.\n(b) The commissioner may approve the request only if the commissioner determines that a specific federal or state health and safety requirement prevents the packaging from being waste reduced or made reusable, recyclable, or compostable.\n(c) The commissioner must review and approve, deny, or request additional information for a request to classify packaging as an exempt material no later than 120 days after the date the commissioner receives the request.\n(d) The commissioner must post on the agency website a list of materials exempted under this subdivision.\n(e) An exemption granted under this subdivision expires two years after the date a request was approved by the commissioner. A material classified as exempt under this subdivision becomes a covered material immediately upon expiration of the exemption. A producer may reapply according to this subdivision.",
	"repealed": false
}