{
	"id": "43A.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.191",
	"title": "43A.191 AGENCY AFFIRMATIVE ACTION PROGRAMS.",
	"text": "(a) Each agency with 1,000 employees or more shall have at least one full-time affirmative action officer, who shall have primary responsibility for developing and maintaining the agency's affirmative action plan. The officer shall devote full time to affirmative action activities. The affirmative action officer shall report administratively and on policy issues directly to the agency head. The affirmative action officer shall be in the classified service.\n(b) The agency heads shall assign affirmative action officers or designees for agencies with fewer than 1,000 employees. The designees shall report administratively and on policy issues directly to the agency head.\n(c) An agency may not use authority under section 43A.08, subdivision 1a, to place the position of an agency affirmative action officer or designee in the unclassified service.\n(a) The head of each agency in the executive branch shall prepare and implement an agency affirmative action plan consistent with this section and rules issued under section 43A.04, subdivision 3.\n(b) The agency plan must include a plan for the provision of reasonable accommodation in the hiring and promotion of qualified persons with disabilities. The reasonable accommodation plan must consist of at least the following:\n(1) procedures for compliance with sections 16E.03, subdivision 9, 363A.08 to 363A.19, and 363A.28, subdivision 10, and, where appropriate, regulations implementing United States Code, title 29, section 794, as amended through December 31, 1984, which is section 504 of the Rehabilitation Act of 1973, as amended and the Americans with Disabilities Act, United States Code, title 42, sections 101 to 108, 201 to 231, 241 to 246, 401, 402, and 501 to 514;\n(2) methods and procedures for providing timely access to reasonable accommodations during the application process, throughout current employment, and when seeking promotion;\n(3) provisions for funding reasonable accommodations; and\n(4) the number of requests made, the number of requests approved, and the number of requests reimbursed from the state accommodation account under section 16B.4805.\n(c) The agency plan must be prepared by the agency head with the assistance of the agency affirmative action officer and the director of diversity and equal employment opportunity. The agency may consult with the Council on Disability, vocational rehabilitation services, state services for the blind, and other disability experts to review and make recommendations on recruitment and retention of people with disabilities.\n(d) The agency plan must identify any positions in the agency that can be used for supported employment as defined in section 268A.01, subdivision 13, of persons with significant disabilities. The agency shall report this information to the commissioner. An agency that hires more than one supported worker in the identified positions must receive recognition for each supported worker toward meeting the agency's affirmative action goals and objectives.\n(e) An agency affirmative action plan may not be implemented without the commissioner's approval.\n(a) Each agency affirmative action plan must include a section that provides sufficient assurances, procedures, and commitments to provide adequate hiring, placement, and advancement opportunities for individuals with disabilities at all levels of state employment. The criteria for this section of the agency affirmative action plan must include a section on disability hiring and advancement, including the provisions in this subdivision.\n(b) The plan must describe specific actions to ensure that a broad range of individuals with disabilities will be aware of and be encouraged to apply for job vacancies when eligible. The actions must include, at a minimum:\n(1) the use of programs and resources that identify job applicants with disabilities who are eligible to be appointed under a hiring authority that takes disability into account, consistent with the demonstration program under section 43A.15, subdivision 14. The programs may include the Department of Employment and Economic Development's Vocational Rehabilitation Services and State Services for the Blind that provide the qualifications necessary for positions within the agency to individuals with disabilities. Resources may include databases of individuals with disabilities who previously applied to the agency but were not hired for the positions they applied for, and training and internship programs that lead directly to employment for individuals with disabilities; and\n(2) establishment and maintenance of contacts, that may include formal agreements, with organizations that specialize in providing assistance to individuals with disabilities in securing and maintaining employment, such as the Department of Employment and Economic Development's Vocational Rehabilitation Services, State Services for the Blind, community rehabilitation programs, day training and habilitation programs, and employment network service providers.\n(c) The plan must ensure that the agency has designated sufficient staff to handle any disability-related issues that arise during the application and selection process, and shall require the agency to provide staff with sufficient training, support, and other resources to carry out the responsibilities under this section. Responsibilities include, at a minimum:\n(1) ensuring that disability-related questions from members of the public regarding the agency's application and selection processes are answered promptly and correctly, including questions about reasonable accommodations needed by job applicants during the application and selection process and questions about how individuals may apply for positions under hiring authorities that take disability into account;\n(2) processing requests for reasonable accommodations needed by job applicants during the application and placement process and ensuring that the agency provides such accommodations when required;\n(3) accepting applications for a position under hiring authorities that take disability into account;\n(4) if an individual has applied for appointment to a particular position under a hiring authority that takes disability into account, determining whether the individual is eligible for appointment under such authority and if so forwarding the individual's application to the relevant hiring officials with an explanation of how and when the individual may be appointed, consistent with all applicable laws; and\n(5) overseeing any other agency programs designed to increase hiring of individuals with disabilities.\n(a) The commissioner shall annually audit the record of each agency to determine the rate of compliance with affirmative action requirements. The commissioner must report all audit findings to the governor if a state agency fails to meet any of its affirmative action requirements for two consecutive years.\n(b) By March 1 of each odd-numbered year, the commissioner shall submit a report on affirmative action progress of each agency and the state as a whole to the governor and to the Finance Committee of the senate, the Ways and Means Committee of the house of representatives, the Governmental Operations Committees of both houses of the legislature, and the Legislative Coordinating Commission. The report must include noncompetitive appointments made under section 43A.08, subdivision 2a, or 43A.15, subdivisions 3 to 7, 10, and 12, and cover each agency's rate of compliance with affirmative action requirements. The report must be made available to the public on the department's website.\n(c) An agency that does not meet its hiring goals must justify its nonaffirmative action hires in competitive appointments and noncompetitive appointments made under section 43A.08, subdivisions 1, clauses (9), (11), and (16), and 2a; and section 43A.15, subdivisions 3, 10, 12, and 13, according to criteria issued by the department. In addition, an agency shall:\n(1) demonstrate a good faith effort to recruit protected group members by following an active recruitment plan;\n(2) implement a coordinated retention plan; and\n(3) have an established complaint resolution procedure.\n(d) The commissioner shall develop reporting standards and procedures for measuring compliance.\n(e) An agency is encouraged to develop other innovative ways to promote awareness, acceptance, and appreciation for diversity and affirmative action. These innovations will be considered when evaluating an agency's compliance with this section.\n(f) An agency not in compliance with affirmative action requirements of this section must identify methods and programs to improve performance, to reallocate resources internally in order to increase support for affirmative action programs, and to submit program and resource reallocation proposals to the commissioner for approval. An agency must submit these proposals within 120 days of being notified by the commissioner that it is out of compliance with affirmative action requirements. The commissioner shall monitor quarterly the affirmative action programs of an agency found to be out of compliance.\n(g) The commissioner shall establish a program to recognize an agency that has made significant and measurable progress in implementing an affirmative action plan.\n(h) The commissioner must maintain and make available, on an annual basis, summary data as defined in section 13.02, subdivision 19, on the percentage of members of each protected group as defined in section 43A.02, subdivision 33, that were hired in the executive branch in each of the federal Equal Employment Opportunity (EEO) occupational categories applicable to state employment. Nothing in this provision, however, shall require any person to disclose their protected group status, nor shall it require the commissioner or any appointing authority to determine the protected group status of any person.",
	"repealed": false
}