{
	"id": "171.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.29",
	"title": "171.29 REVOKED LICENSE; CONDITIONS FOR REINSTATEMENT.",
	"text": "(a) No person whose driver's license has been revoked by reason of conviction, plea of guilty, or forfeiture of bail not vacated, under section 169.791, 169.797, 171.17, or 171.172, or revoked under section 169.792 shall be issued another license unless and until that person shall have successfully passed an examination as required by the commissioner of public safety. This subdivision does not apply to an applicant for early reinstatement under section 169.792, subdivision 7a.\n(b) The requirement to successfully pass the examination described in paragraph (a) does not apply to a person whose driver's license has been revoked because of an impaired driving offense.\n(a) An individual whose driver's license has been revoked by reason of one or more convictions, pleas of guilty, forfeitures of bail not vacated, or mandatory revocations under section 169.791, 169.792, 169.797, 171.17, or 171.172, and who is otherwise eligible for reinstatement must pay a single $30 fee before the driver's license is reinstated. An individual whose driver's license has been revoked under provisions specified in both this paragraph and paragraph (b) must pay the reinstatement fee as provided in paragraph (b).\n(b) A person whose driver's license has been revoked under section 169A.52, 169A.54, 171.177, 609.2112, 609.2113, or 609.2114, or Minnesota Statutes 2012, section 609.21, must pay a $250 fee plus a $430 surcharge for each instance of revocation before the driver's license is reinstated, except as provided in paragraph (f). The $250 fee must be credited as follows:\n(1) 20 percent to the driver and vehicle services operating account under section 299A.705;\n(2) 67 percent to the general fund;\n(3) eight percent to a separate account to be known as the Bureau of Criminal Apprehension account. Money in this account is annually appropriated to the commissioner of public safety and the appropriated amount must be apportioned 80 percent for laboratory costs and 20 percent for carrying out the provisions of section 299C.065; and\n(4) five percent to a separate account to be known as the vehicle forfeiture account, which is created in the special revenue fund. The money in the account is annually appropriated to the commissioner for costs of handling vehicle forfeitures.\n(c) The revenue from $50 of the surcharge must be credited to a separate account to be known as the traumatic brain injury and spinal cord injury account. The revenue from $50 of the surcharge on a reinstatement under paragraph (f) is credited from the first installment payment to the traumatic brain injury and spinal cord injury account. The money in the account is annually appropriated to the commissioner of health to be used as follows: 83 percent for contracts with a qualified community-based organization to provide information, resources, and support to assist persons with traumatic brain injury and their families to access services, and 17 percent to maintain the traumatic brain injury and spinal cord injury registry created in section 144.662. For the purposes of this paragraph, a \"qualified community-based organization\" is a private, not-for-profit organization of consumers of traumatic brain injury services and their family members. The organization must be registered with the United States Internal Revenue Service under section 501(c)(3) as a tax-exempt organization and must have as its purposes:\n(1) the promotion of public, family, survivor, and professional awareness of the incidence and consequences of traumatic brain injury;\n(2) the provision of a network of support for persons with traumatic brain injury, their families, and friends;\n(3) the development and support of programs and services to prevent traumatic brain injury;\n(4) the establishment of education programs for persons with traumatic brain injury; and\n(5) the empowerment of persons with traumatic brain injury through participation in its governance.\nA patient's name, identifying information, or identifiable medical data must not be disclosed to the organization without the informed voluntary written consent of the patient or patient's guardian or, if the patient is a minor, of the parent or guardian of the patient.\n(d) The remainder of the surcharge must be credited to a separate account to be known as the remote electronic alcohol-monitoring program account. The commissioner shall transfer the balance of this account to the commissioner of management and budget on a monthly basis for deposit in the general fund.\n(e) When these fees are collected by a driver's license agent, appointed under section 171.061, a filing fee is imposed in the amount specified under section 171.061, subdivision 4. The reinstatement fees, surcharge, and filing fee must be deposited in an approved depository as directed under section 171.061, subdivision 4.\n(f) A person whose driver's license has been revoked as provided in subdivision 1 under section 169A.52, 169A.54, or 171.177 may choose to pay 50 percent and an additional $25 of the total amount of the surcharge and 50 percent of the fee required under paragraph (b) to reinstate the person's driver's license, provided the person meets all other requirements of reinstatement. If a person chooses to pay 50 percent of the total and an additional $25, the driver's license must expire after two years. The person must pay an additional 50 percent less $25 of the total to extend the license for an additional two years, provided the person is otherwise still eligible for the license. After this final payment of the surcharge and fee, the license may be renewed on a standard schedule, as provided under section 171.27. A filing fee may be imposed for each installment payment. Revenue from the filing fee is credited to the driver and vehicle services operating account under section 299A.705 and is appropriated to the commissioner.\n(g) Any person making installment payments under paragraph (f), whose driver's license subsequently expires, or is canceled, revoked, or suspended before payment of 100 percent of the surcharge and fee, must pay the outstanding balance due for the initial reinstatement before the driver's license is subsequently reinstated. Upon payment of the outstanding balance due for the initial reinstatement, the person may pay any new surcharge and fee imposed under paragraph (b) in installment payments as provided under paragraph (f).\nA person whose license has been revoked under section 169A.52, 169A.54, or 171.177 may not be issued another license at the end of the revocation period unless the person has complied with all applicable registration plate impoundment provisions of sections 168.041 and 169A.60.",
	"repealed": false
}