{
	"id": "142G.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.21",
	"title": "142G.21 APPLICANT AND PARTICIPANT RIGHTS; COUNTY AGENCY DUTY.",
	"text": "An applicant or participant has the right to obtain from the county agency information about the benefits, requirements, restrictions, and appeal provisions of public assistance programs.\nAn applicant or participant has the right to designate an authorized representative to act on the applicant's or participant's behalf. An applicant or participant has the right to be assisted or represented by an authorized representative in eligibility determinations, recertification, conciliation conferences, the fair hearing process, and any other contacts with the county agency or the department. When a county agency determines that it is necessary for a person to assist an applicant or participant, the county agency must designate a staff member to assist the applicant or participant. Upon a request from an applicant or participant, a county agency must provide addresses and telephone numbers of organizations that provide legal services at low cost or no cost to low-income persons.\nA county agency must notify an applicant of the disposition of the applicant's application. The notice must be in writing and on forms prescribed by the commissioner. The county agency must mail the notice to the last known mailing address provided by the applicant. When an application is denied, the county agency must notify the applicant in writing of the reasons for the denial, of the right to appeal, and of the right to reapply for assistance.\nA county agency must give a participant written notice of all adverse actions affecting the participant including payment reductions, suspensions, terminations, and use of protective, vendor, or two-party payments. The notice of adverse action must be on a form prescribed or approved by the commissioner, must be understandable at a seventh grade reading level, and must be mailed to the last known mailing address provided by the participant. A notice written in English must include the Department of Children, Youth, and Families language block and must be sent to every applicable participant. The county agency must state on the notice of adverse action the action it intends to take, the reasons for the action, the participant's right to appeal the action, the conditions under which assistance can be continued pending an appeal decision, and the related consequences of the action.\nThe notice of adverse action shall be issued according to paragraphs (a) to (d).\n(a) A notice of adverse action must be mailed at least ten days before the effective date of the adverse action, except as provided in paragraphs (b) to (d).\n(b) A notice of adverse action must be mailed no later than four working days before the end of the month when the county agency:\n(1) is informed of the death of the only caregiver or payee in an assistance unit;\n(2) receives a signed statement from the caregiver that assistance is no longer wanted;\n(3) has factual information to reduce, suspend, or terminate assistance based on the failure to timely report changes;\n(4) verifies that a member of the assistance unit has entered a regional treatment center or a licensed residential facility for medical or psychological treatment or rehabilitation;\n(5) verifies that a member of an assistance unit has been removed from the home as a result of a judicial determination or placed in foster care, and the provisions of section 142G.13, subdivision 2, paragraph (c), clause (2), do not apply; or\n(6) cannot locate a caregiver.\n(c) A notice of adverse action must be mailed for a payment month when the caregiver makes a written request for closure before the first of that payment month.\n(d) A notice of adverse action must be mailed before the effective date of the adverse action when the county agency receives the caregiver's signed and completed MFIP household report form or recertification form that includes information that requires payment reduction, suspension, or termination.\nAn applicant, participant, or former participant has the right to request a fair hearing when aggrieved by an action or inaction of a county agency. A request for a fair hearing and rights pending a fair hearing are set as specified in section 142G.45.\nA county agency must make financial case records available to the participant or former participant as soon as possible but no later than the fifth business day following the date of the request. When the participant or former participant asks for photocopies of material from the financial case record, the county agency must provide one copy of each page at no cost.\nExcept for protective payment provisions authorized under section 142G.35, participants have the right to manage their own affairs.\nMinor caregivers have the right to protection. The county agency must refer a minor caregiver to the social service unit within 30 days of the date the application is approved. The social service unit must assist the caregiver who is less than 18 years of age to develop a plan as specified in section 142G.57.\nMFIP grants or earnings of a caregiver shall be protected from garnishment. This protection for earnings shall extend for a period of six months from the date of termination from MFIP.\nThe county agency must retain financial case records and employment and training service records for MFIP cases according to chapter 13.\nA participant who is not in vendor payment status may discontinue receipt of the cash assistance portion of the MFIP assistance grant and retain eligibility for child care assistance under section 142E.08. For the months a participant chooses to discontinue the receipt of the cash portion of the MFIP grant, the assistance unit accrues months of eligibility to be applied toward eligibility for child care under section 142E.08.",
	"repealed": false
}