{
	"id": "386.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/386.375",
	"title": "386.375 TRANSFER AND STORAGE OF ABSTRACTS.",
	"text": "(a) A person holding an abstract of title to real estate located in Minnesota shall, at a closing of a sale of the property to which the abstract pertains, make a written offer to transfer the abstract of title to the mortgagor or fee owner at no charge to the mortgagor or fee owner. If the offer is accepted, the abstract must be transferred at the closing unless the abstract of title is being held after the closing for issuance of a final title opinion or policy of title insurance in which case the holder has a reasonable period of time to transfer the abstract.\n(b) A person holding an abstract of title to real estate located in Minnesota shall, within ten days of receipt of a written request from the mortgagor or fee owner of the property to which the abstract pertains, transfer the abstract of title to the mortgagor or fee owner at no charge, other than postage, to the mortgagor or fee owner. If the abstract of title is being held after a closing for issuance of a final title opinion or policy of title insurance, the holder has a reasonable period of time to transfer the abstract.\n(c) If a person holding an abstract of title to real estate located in Minnesota fails to comply with the requirements of this subdivision, the mortgagor or fee owner of the property may have an abstract of title made at the expense of the last known person holding the abstract of title, and is also entitled to collect actual civil damages of up to $500 from the person last known to hold the abstract of title.\nBefore a person holding an abstract of title to real estate located in Minnesota may impose a charge or fee to store the abstract, the person shall first make a written offer to the mortgagor or fee owner to transfer the abstract at no charge, other than postage, to the fee owner or mortgagor. This subdivision does not apply to a person who holds an abstract pursuant to a written contract with the fee owner or mortgagor. A person violating this subdivision is subject to a penalty of $200 for each violation.\n(a) A person other than the mortgagor or fee owner who transfers or offers to transfer an abstract of title shall present to the mortgagor or fee owner basic information in plain English about abstracts of title. This information must be sent in a form prepared and approved by the commissioner of commerce and must contain at least the following items:\n(1) a definition and description of abstracts of title;\n(2) an explanation that holders of abstracts of title must maintain it with reasonable care;\n(3) an approximate cost or range of costs to replace a lost or damaged abstract of title;\n(4) an explanation that abstracts of title may be required to sell, finance, or refinance real estate; and\n(5) an explanation of options for storage of abstracts.\n(b) The commissioner shall prepare the form for use under this subdivision as soon as possible. This subdivision does not apply until 60 days after the form is approved by the commissioner.\n(c) A person violating this subdivision is subject to a penalty of $200 for each violation.\nAfter August 1, 1987, abstracts of title to real estate located in Minnesota must be stored within the state of Minnesota. Failure to comply with this subdivision entitles a mortgagor or fee owner to civil damages of up to $500.\nThis section does not apply if the person holding the abstract of title is the mortgagor or fee owner of the real estate to which the abstract pertains.\nMS 1994 [Repealed, 1996 c 310 s 1]",
	"repealed": false
}