{
	"id": "306.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.88",
	"title": "306.88 ACQUISITION OF CEMETERY.",
	"text": "A lodge, order, or association of a purely religious, charitable, or benevolent description, may acquire the cemetery property of the cemetery association by gift or purchase and maintain and enlarge it if it: (1) does not operate for purposes of profit; (2) is exempt from chapter 64B under section 64B.38; (3) has been organized under state law; (4) has been in existence for 20 years; (5) one of its purposes under its charter is to provide free burial ground for its members and their families; and (6) all of its members are also members of a cemetery association by virtue of a specific provision in the charter of the association and the provision has been in effect for 15 years before enactment of this section. The cemetery association may convey to the lodge, order, or association any cemetery land or property.\nA lodge, order, or association that acquires cemetery land under this section in a county with a population of 600,000 or more and maintains the land for cemetery purposes may also acquire by gift or purchase the cemetery land or any part of it owned by a public or other cemetery association that is adjacent to the land maintained for cemetery purposes or is separated from it by a public highway or street. A public or other cemetery association owning the land may convey it or any part of it to the previously described lodge, order, or association by deed, in accordance with authorization by its board of directors or trustees. Sections 306.76 to 306.85 do not apply to the proceeds of the sale. On acquisition, the lodge, order, or association succeeds to all the rights to maintain and use the other land for cemetery purposes as were possessed by the public or other cemetery association from which the land was acquired.\nSections 306.10 and 306.76 to 306.85 do not apply to lodges, orders, or associations acquiring, maintaining, or enlarging cemeteries as authorized by this section. Section 306.14 applies to land or property acquired or maintained by the lodge, order, or association for cemetery purposes. Sections 307.01 to 307.10, in so far as they relate to cemeteries owned or managed by religious corporations, also apply to cemeteries acquired, owned, and managed by the lodge, order, or association under this section.",
	"repealed": false
}