{
	"id": "10A.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.022",
	"title": "10A.022 VIOLATIONS AND ENFORCEMENT.",
	"text": "The executive director must inspect all material filed with the board as promptly as necessary to comply with this chapter, with other provisions of law requiring the filing of a document with the board, and with other provisions of law under the board's jurisdiction pursuant to subdivision 3. The executive director must immediately notify an individual if a written complaint is filed with the board alleging, or it otherwise appears, that a document filed with the board is inaccurate or does not comply with this chapter, or that the individual has failed to file a document required by this chapter or has failed to comply with this chapter or other provisions under the board's jurisdiction pursuant to subdivision 3.\n(a) Within limits of available resources, the board must make audits and investigations with respect to the requirements of this chapter. A final audit report completed under this chapter must contain the name of the primary board employee responsible for conducting the audit. The board may impose statutory civil penalties and issue orders for compliance with respect to the requirements of this chapter and provisions under the board's jurisdiction pursuant to subdivision 3. In all matters relating to its official duties, the board has the power to require testimony under oath, to permit written statements to be given under oath, and to issue subpoenas and cause them to be served. If a person does not comply with a subpoena, the board may apply to the District Court of Ramsey County for issuance of an order compelling obedience to the subpoena. A person failing to obey the order is punishable by the court as for contempt.\n(b) The board shall issue rules, using the expedited rulemaking process in section 14.389, setting forth procedures to be followed for all audits and investigations conducted by the board under this chapter and other provisions under the board's jurisdiction pursuant to subdivision 3. The rules regarding the board's investigative procedure shall set forth:\n(1) the process for the board initiating and overseeing an investigation;\n(2) when summary proceedings may be available;\n(3) dedication of staff resources in taking witness testimony and conducting discovery;\n(4) parties' rights and opportunities to be heard by the board; and\n(5) board hearings and disposition of complaints, audits, and investigations.\n(a) The board may investigate any alleged or potential violation of this chapter. The board may also investigate an alleged or potential violation of section 211B.04, 211B.12, or 211B.15 by or related to a candidate, treasurer, principal campaign committee, political committee, political fund, or party unit, as those terms are defined in this chapter. The board may only investigate an alleged violation if the board:\n(1) receives a written complaint alleging a violation;\n(2) discovers a potential violation as a result of an audit conducted by the board; or\n(3) discovers a potential violation as a result of a staff review.\n(b) When the board investigates the allegations made in a written complaint and the investigation reveals other potential violations that were not included in the complaint, the board may investigate the potential violations not alleged in the complaint only after making a determination under paragraph (d) that probable cause exists to believe a violation that warrants a formal investigation has occurred.\n(c) Upon receipt of a written complaint filed with the board, the board chair or another board member designated by the chair shall promptly make a determination as to whether the complaint alleges a prima facie violation. If a determination is made that the complaint does not allege a prima facie violation, the complaint shall be dismissed without prejudice and the complainant and the subject of the complaint must be promptly notified of the reasons the complaint did not allege a prima facie violation. The notice to the subject of the complaint must include a copy of the complaint. If the complainant files a revised complaint regarding the same facts and the same subject, the prima facie determination must be completed by a board member other than the member who made the initial determination and who does not support the same political party as the member who made the initial determination. The chair may order that the prima facie determination for any complaint be made by the full board and must order that the prima facie determination for a complaint being submitted for the third time be made by the full board.\n(d) If a determination is made that the complaint alleges a prima facie violation, the board shall, within 60 days of the prima facie determination, make findings and conclusions as to whether probable cause exists to believe the alleged violation that warrants a formal investigation has occurred. Any party filing a complaint and any party against whom a complaint is filed must be given an opportunity to be heard by the board prior to the board's determination as to whether probable cause exists to believe a violation that warrants a formal investigation has occurred.\n(e) Upon a determination by the board that probable cause exists to believe a violation that warrants a formal investigation has occurred, the board must undertake an investigation under subdivision 2 and must issue an order at the conclusion of the investigation, except that if the complaint alleges a violation of section 10A.25 or 10A.27, the board must either enter a conciliation agreement or make public findings and conclusions as to whether a violation has occurred and must issue an order within 60 days after the probable cause determination has been made. Prior to making findings and conclusions in an investigation, the board must offer the subject of the complaint an opportunity to answer the allegations of the complaint in writing and to appear before the board to address the matter. The deadline for action on a written complaint, including but not limited to issuance of a probable cause determination in accordance with paragraph (d), entering into a conciliation agreement, or issuance of public findings may be extended by majority vote of the board.\n(a) A matter under staff review that is resolved by conciliation agreement must be presented to the board for approval at a meeting closed to the public. The respondent must be given an opportunity to be heard by the board before the board makes a determination regarding the agreement.\n(b) The executive director must send notice of the meeting under paragraph (a) to the respondent. The notice must be sent no later than the time that the agreement is provided to the board and must include a copy of the agreement. The notice must include the date of the meeting at which the board will consider the matter and a statement that the respondent has the opportunity to be heard by the board before the board's determination regarding the agreement.\n(c) A conciliation agreement to resolve a matter under staff review is final only after the board approves the agreement.\n(d) If the board does not approve a conciliation agreement to resolve a matter under staff review, the board must lay the matter over until its next meeting and:\n(1) provide guidance and direct the executive director to continue the staff review; or\n(2) direct the executive director to prepare the matter for resolution by the board without an agreement pursuant to subdivision 3d.\n(e) If an agreement proposed under this subdivision is not approved by the board, any admissions by the respondent and any remedial steps taken or agreed to by the respondent are not evidence of a violation in any subsequent proceeding.\nThe executive director must close a matter under staff review when the staff review establishes that no violation of campaign finance laws has occurred. The executive director must report the closure of the matter to the board at a meeting closed to the public and send notice of the closure to the respondent.\n(a) A matter under staff review that is resolved without a formal investigation under subdivision 3d must be submitted to the board for approval at a meeting closed to the public. The respondent must be given an opportunity to be heard by the board before the board makes a determination regarding the staff review.\n(b) The executive director must send notice of the meeting under paragraph (a) to the respondent. The notice must be sent no later than the time when the written document resolving the matter is provided to the board and must include a copy of the written document resolving the matter. The notice must include the date of the meeting at which the board will consider the matter and a statement that the respondent has the opportunity to be heard by the board before the board's determination regarding the resolution of staff review.\n(c) A written document concluding a matter under staff review without formal investigation is final only after the board approves the document.\n(d) If the board does not approve the written document resolving a matter under staff review without a formal investigation, the board must:\n(1) provide guidance and direct the executive director to continue the staff review;\n(2) initiate a formal investigation of the matter; or\n(3) direct the executive director to prepare the matter for resolution by the board under subdivision 3d.\n(e) If a written document resolving a staff review without a formal investigation under this subdivision is not approved by the board, any admissions by the respondent and any remedial steps taken or agreed to by the respondent are not evidence of a violation in any subsequent proceeding.\n(a) The executive director must submit the following matters to the board for a determination under this subdivision:\n(1) a matter under staff review that is not resolved under subdivision 3a, 3b, or 3c; and\n(2) any other matter that the board is to consider for the authorization of a formal investigation, other than a matter arising from a filed complaint.\nThe submission must be in writing, must describe the potential violation involved, and must include any supporting information. The submission must explain the actions undertaken in any summary proceedings and any points of disagreement preventing resolution of the matter. The respondent must be given an opportunity to be heard by the board before the board makes a determination regarding the submission.\n(b) The executive director must send notice of the submission made under paragraph (a) to the respondent. The notice must be sent no later than the time the submission is provided to the board and must include a copy of the submission. The notice must include the date of the meeting at which the board will consider the matter and a statement that the respondent has the opportunity to be heard by the board before the board's determination regarding the submission.\nWithin a reasonable time after beginning an investigation of an individual or association, the board must notify the individual or association of the fact of the investigation. The board must not make a finding that a violation has occurred without notifying the individual or association of the nature of the allegations and affording an opportunity to answer those allegations. After the board has sent notice of the investigation to the individual or association, the individual or association must preserve evidence related to the investigation.\n(a) A hearing before the board or action of the board concerning a complaint or investigation other than findings, conclusions, and orders or a conciliation agreement is confidential. Until the board makes a public finding or enters a conciliation agreement:\n(1) a member, employee, or agent of the board must not disclose to an individual information obtained by that member, employee, or agent concerning a complaint or investigation except as required to carry out the investigation or take action in the matter as authorized by this chapter; and\n(2) an individual who discloses information contrary to this subdivision is subject to a civil penalty imposed by the board of up to $1,000.\n(b) If, after making a public finding or entering a conciliation agreement, the board determines that the record of the investigation contains statements, documents, or other matter that, if disclosed, would unfairly injure the reputation of an innocent individual, the board may:\n(1) retain the statement, document, or other matter as a private record, as defined in section 13.02, subdivision 12, for a period of one year, after which it must be destroyed; or\n(2) return the statement, document, or other matter to the individual who supplied it to the board.\nAll data related to an audit, including the existence of the audit, are confidential. A member, employee, or agent of the board must not disclose information obtained by the member, employee, or agent concerning the audit except as required to carry out the audit or take action in the matter. Upon completion of the audit, the board's final audit report is public. The final audit report must contain the name of the individual subject to the audit, a description of any audit findings, a description of any responses provided by the individual who was subject to the audit, and a description of the manner in which any findings were resolved.\nA matter that is under the board's jurisdiction pursuant to this section and that may result in a criminal offense must be finally disposed of by the board before the alleged violation may be prosecuted by a city or county attorney.\n(a) The board may bring legal actions or negotiate settlements in its own name to recover money raised from contributions subject to the conditions in this subdivision.\n(b) No action may be commenced unless the board has made a formal determination, after an investigation, that the money was raised for political purposes as defined in section 211B.01, subdivision 6, and that the money was used for purposes not permitted under this chapter or under section 211B.12.\n(c) Prior to commencing an action, the board must give the association whose money was misused written notice by certified mail of its intent to take action under this subdivision and must give the association a reasonable opportunity, for a period of not less than 90 days, to recover the money without board intervention. This period must be extended for at least an additional 90 days for good cause if the association is actively pursuing recovery of the money. The board may not commence a legal action under this subdivision if the association has commenced a legal action for the recovery of the same money.\n(d) Any funds recovered under this subdivision must be deposited in a campaign finance recovery account in the special revenue fund and are appropriated as follows:\n(1) an amount equal to the board's actual costs and disbursements in the action, including court reporter fees for depositions taken in the course of an investigation, is appropriated to the board for its operations;\n(2) an amount equal to the reasonable value of legal services provided by the Office of the Attorney General in the recovery matter, calculated on the same basis as is used for charging legal fees to state agencies, is appropriated to the attorney general for the attorney general's operations; and\n(3) any remaining balance is appropriated to the board for distribution to the association to which the money was originally contributed.\n(e) Notwithstanding paragraph (d), clause (3), if the candidate of a principal campaign committee is the person who used the association's money for illegal purposes, or if the association or political fund whose money was misused is no longer registered with the board, any money remaining after the payments specified in paragraph (d), clauses (1) and (2), must be transferred to the general account of the state elections campaign account.\n(f) Any action by the board under this subdivision must be commenced not later than four years after the improper use of money is shown on a report filed with the board or the board has actual knowledge of improper use. No action may be commenced under this subdivision for improper uses disclosed on reports for calendar years prior to 2011.\n(g) If the board prevails in an action brought under this subdivision and the court makes a finding that the misuse of funds was willful, the court may enter judgment in favor of the board and against the person misusing the funds in the amount of the misused funds.",
	"repealed": false
}