{
	"id": "245.464",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.464",
	"title": "245.464 COORDINATION OF MENTAL HEALTH SYSTEM.",
	"text": "The commissioner shall supervise the development and coordination of locally available adult mental health services by the county boards in a manner consistent with sections 245.461 to 245.486. The commissioner shall coordinate locally available services with those services available from the regional treatment center serving the area including state-operated services offered at sites outside of the regional treatment centers. The commissioner shall provide technical assistance to county boards in developing and maintaining locally available mental health services. The commissioner shall monitor the county board's progress in developing its full system capacity and quality through ongoing review of the county board's adult mental health component of the community social services plan and other information as required by sections 245.461 to 245.486.\nBy January 1, 1990, the commissioner shall require that each of the treatment services and management activities described in sections 245.469 to 245.477 are developed for adults with mental illness within available resources based on the following ranked priorities:\n(1) the provision of locally available emergency services;\n(2) the provision of locally available services to all adults with serious and persistent mental illness and all adults with acute mental illness;\n(3) the provision of specialized services regionally available to meet the special needs of all adults with serious and persistent mental illness and all adults with acute mental illness;\n(4) the provision of locally available services to adults with other mental illness; and\n(5) the provision of education and preventive mental health services targeted at high-risk populations.\nThe commissioner may establish a mechanism by which counties, the Department of Human Services, Direct Care and Treatment, hospitals, health plans, consumers, providers, and others may enter into agreements that allow for capacity building and oversight of any agreed-upon entity that is developed through these partnerships. The purpose of these partnerships is the development and provision of mental health services which would be more effective, efficient, and accessible than services that might be provided separately by each partner.",
	"repealed": false
}