{
	"id": "429.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/429.091",
	"title": "429.091 FINANCING.",
	"text": "At any time after one or more improvements are ordered as contemplated in section 429.031, the council may issue obligations in such amount as it deems necessary to defray in whole or in part the expense incurred and estimated to be incurred in making the improvement or improvements, including every item of cost of the kinds authorized in section 475.65. In the event of any omission, error, or mistake in any of the proceedings required precedent to the ordering of any improvement, the validity of the obligations shall not be affected thereby. The council shall cause all further actions and proceedings to be taken with due diligence that are required for the construction of each improvement financed wholly or partly from the proceeds of obligations issued hereunder, and for the final and valid levy of special assessments and the appropriation of any other funds needed to pay the obligations and interest thereon when due.\nThe council may by resolution adopted prior to the sale of obligations pledge the full faith, credit, and taxing power of the municipality for the payment of the principal and interest. Such obligations shall be called improvement bonds and the council shall pay the principal and interest out of any fund of the municipality when the amount credited to the specified fund is insufficient for the purpose and shall each year levy a sufficient amount to take care of accumulated or anticipated deficiencies, which levy shall not be subject to any statutory or charter tax limitation. Obligations for the payment of which the full faith and credit of the municipality is not pledged shall be called assessment revenue notes or, in the case of bonds for fire protection, revenue bonds and shall contain a promise to pay solely out of the proper special fund or funds pledged to their payment. It shall be the duty of the municipal treasurer to pay maturing principal and interest on warrants or revenue bonds out of funds on hand in the proper funds and not otherwise.\nAll obligations shall be issued in accordance with the provisions of chapter 475, except as provided in this subdivision.\nAn election shall be required for bonds if less than 20 percent of the cost of the improvement to the municipality is to be assessed against benefited property.\nIf the full faith, credit, and taxing power of the municipality is not pledged and the bonds are issued to finance a fire protection system, a public sale shall not be required and the obligations may\n(1) mature at any time or times within 30 years from date of issue; or 40 years or the useful life of the asset, whichever is less, for municipal water and wastewater treatment systems and essential community facilities financed or guaranteed by the United States Department of Agriculture;\n(2) mature in the amount or amounts;\n(3) be sold at a price equal to the percentage of their par value, plus accrued interest; and\n(4) bear interest at the rate or rates,\nas agreed by the purchaser and the municipality, notwithstanding any limitation of interest rate or cost or of the amounts of annual maturities contained in any other law.\nThe maturities shall be such as in the opinion of the council are warranted by the anticipated collections of assessments and ad valorem levies for the municipality's share of the cost; except that the council may in its discretion issue and sell temporary improvement bonds maturing and subject to further conditions as set forth in subdivision 5. All obligations shall state upon their face the purpose of the issue and the fund from which they are payable. The amount of any obligations issued hereunder shall not be included in determining the net indebtedness of any municipality under the provisions of any law limiting such indebtedness.\nThe proceeds from the sale of each issue of obligations and from collections of special assessments levied and other moneys appropriated for each improvement to be financed wholly or partly from such proceeds shall be credited to a separate construction fund which shall be used solely to defray expenses of such improvements and payment of principal and interest due upon the obligations prior to completion and payment of all costs of the improvements so financed. Any balance of the proceeds of bonds remaining therein may be used to pay the cost, in whole or in part, of any other improvement instituted pursuant to this chapter. A separate account shall be maintained in the construction fund to record expenditures for each improvement, and when the total cost thereof has been paid all subsequent collections of special assessments levied for the improvement shall be credited and paid into the debt service fund for the obligations issued to finance the improvement, as provided in section 475.61. Any taxes levied for improvements financed by an issue of obligations shall be credited directly to the debt service fund.\nIn anticipation of the issuance of improvement bonds, the council may by resolution issue and sell temporary improvement bonds maturing within not more than three years from their date of issue to pay any part or all of the cost of one or more improvements. To the extent that the principal of and interest on the temporary improvement bonds cannot be paid when due from receipts of special assessments, taxes, or other funds appropriated for the purpose, they shall be paid from the proceeds of improvement bonds or additional temporary improvement bonds which the council shall offer for sale in advance of their maturity but the indebtedness funded by an issue of temporary improvement bonds shall not be extended by the issue of additional temporary improvement bonds for more than six years from the date of the first issue. The holders of any temporary improvement bonds shall have and may enforce, by mandamus or other appropriate proceedings, all rights respecting the levy and collection of sufficient special assessments and taxes to pay the cost of the improvements financed by them which are granted by law to holders of improvement bonds, except the right to require the levies to be collected prior to the maturity of the temporary improvement bonds. If any temporary improvement bonds are not paid in full at maturity, the holders may require the issuance in exchange for them, at par, of new temporary improvement bonds maturing within one year from their date of issue (but not subject to any other maturity limitation), and bearing interest at the maximum rate permitted by law.\nFunds of a municipality may be invested in its temporary improvement bonds in accordance with the provisions of section 118A.04, and may be purchased upon their initial issue, but shall be purchased only from funds which the council determines will not be required for other purposes before the maturity date, and shall be resold before maturity only in case of emergency. If purchased from a debt service fund securing other bonds, the holders of those bonds may enforce the municipality's obligations on the temporary improvement bonds in the same manner as if they held the temporary improvement bonds.\nThe council may by resolution adopted prior to the sale of any temporary improvement bonds pledge the full faith, credit, and taxing power of the municipality for the payment of the principal and interest, in addition to all provisions made for their security in subdivision 5. In this event the bonds shall be designated as general obligation temporary improvement bonds, and the council shall levy taxes for their payment in accordance with section 475.61. Proceeds of improvement bonds or temporary improvement bonds not yet sold may be treated as pledged revenues, in reduction of the tax otherwise required by section 475.61 to be levied prior to delivery of the obligations.\nThe council may by resolution establish a revolving fund for the payment of the costs of any improvement or any waterworks systems, sewer systems, or storm sewer systems described in section 444.075, the costs of facilities to maintain streets and water, sewer, and storm sewer systems and for the payment of any obligations issued to pay the costs of the facilities and systems referred to in this subdivision or to refund obligations issued for those purposes. The council may create within the revolving fund a separate construction account into which the municipality may deposit the proceeds of any obligations payable from the fund, the proceeds of any special assessments collected with respect to any improvement, any net revenues of a waterworks, sewer system, or storm sewer system described in section 444.075 or any other available funds of the municipality appropriated to it. Amounts on deposit in the construction account may be used to pay the costs of any improvement or any waterworks, sewer system, or storm sewer system described in section 444.075 or any street or water, sewer, or storm sewer maintenance facilities. No funds may be expended for an improvement unless at least 20 percent of the costs of each such improvement is to be assessed against benefited property. No funds may be expended for a waterworks, sewer system, or storm sewer system, other than a sewer system described in section 115.46, or maintenance facilities unless the council estimates that the costs will be recovered from the net revenues of the system or any combined waterworks, sewer systems, or storm sewer systems operated by the municipality. The council may also create a separate debt service account within the revolving fund for the payment of principal of and interest on any obligations payable therefrom. Notwithstanding subdivision 4, the council is not required to pledge any particular assessments or other revenues to the payment of the obligations. Collections of special assessments or net revenues may be deposited in either the construction account or the debt service account as the council or an officer designated by the council may determine, having due regard for anticipated collections of special assessments and net revenues from improvements or waterworks, sewer systems, or storm sewer systems financed in whole or in part from the construction account, and taxes levied for the payment of the obligations. The council may issue obligations that are payable primarily from the debt service account for the purpose of providing funds to defray in whole or in part any expenses incurred or estimated to be incurred in making the improvement or improvements or in constructing the waterworks, sewer system, or storm sewer system, including every item of cost of the kinds authorized by section 475.65, and street and water, sewer, and storm sewer maintenance facilities or to refund obligations previously issued under this section or section 115.46 or 444.075. The obligations may be general obligations to which the full faith and credit of the municipality are pledged. If the special assessments to be levied and net revenues estimated to be available for their payment are estimated to be at least 20 percent of the principal amount of the obligations, the obligations may be issued without an election and shall not be included in determining the net indebtedness of the municipality under the provisions of any law limiting net indebtedness. The cost of a maintenance facility that may be financed under this subdivision is limited only to the portion of the facility that is fairly allocable to the maintenance of streets and water, sewer, and storm sewer systems.\nSections 474A.01 to 474A.21 apply to any issuance of obligations under this section which are subject to limitation under a federal tax law as defined in section 474A.02, subdivision 8.",
	"repealed": false
}