{
	"id": "138.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.31",
	"title": "138.31 DEFINITIONS.",
	"text": "As used in sections 138.31 to 138.42, the terms defined in this section have the meanings given them.\nMS 2000 [Renumbered subd 14]\n\"Archaeological methods\" means scientific procedures used in field archaeology by recognized professional authorities on archaeology.\nMS 2000 [Renumbered subd 13]\n\"Commissioner\" means the commissioner of administration.\nMS 2000 [Renumbered subd 9]\n\"Custodian\" means any school or scientific institution which has the physical possession of objects of archaeological significance or data belonging to the state.\nMS 2000 [Renumbered subd 7]\n\"Data\" means field notes, photographs, maps, and other records relating to field archaeology.\n\"Director of the historical society\" means the director of the Minnesota Historical Society.\nMS 2000 [Renumbered subd 8]\n\"Field archaeology\" means the study of the traces of human culture at any land or water site by means of surveying, digging, sampling, excavating, or removing objects, or going on a site with that intent.\nMS 2000 [Renumbered subd 15]\n\"Historical society\" means the Minnesota Historical Society.\nMS 2000 [Renumbered subd 11]\n\"Object\" means a natural or artificial article, implement, skeleton, bone, or other item of archaeological interest.\nMS 2000 [Renumbered subd 12]\n\"Qualified professional archaeologist\" means an archaeologist who meets the United States Secretary of the Interior's professional qualification standards in Code of Federal Regulations, title 36, part 61, appendix A, or subsequent revisions.\nMS 2000 [Renumbered subd 2]\n\"Schools\" means universities, colleges, and community colleges, whether publicly or privately owned.\nMS 2000 [Renumbered subd 5]\n\"Scientific institutions\" means museums, historical societies, foundations for archaeological study, state agencies, and scholarly groups with professional standing and physical facilities for the display, study, and preservation of objects of archaeological interest.\nMS 2000 [Renumbered subd 4]\n\"Site\" or \"archaeological site\" has the same meaning as \"state site\" or \"state archaeological site.\"\n\"State Historic Preservation Office\" means the State Historic Preservation Office at the Department of Administration.\nMS 2000 [Renumbered subd 10]\n\"State site\" or \"state archaeological site\" means a land or water area, owned or leased by or subject to the paramount right of the state, county, township, or municipality where there are objects or other evidence of archaeological interest. This term includes all aboriginal mounds and earthworks, ancient burial grounds, prehistoric ruins, historical remains, and other archaeological features on state land or on land subject to the paramount rights of the state. Historical remains do not include bottles or ceramics manufactured after 1875.\n\"The university\" means the University of Minnesota.",
	"repealed": false
}