{
	"id": "62C.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/62C.13",
	"title": "62C.13 AUTHORIZED CONTRACTS AND AGREEMENTS.",
	"text": "A service plan corporation may act for, or as agent of, a provider and may contract with subscribers and others to render or provide health services for the benefit of subscribers. It may enter into service agreements. A subscriber contract may provide for payment to, or reimbursement of, a subscriber for expenses incurred for health services when rendered or furnished by nonparticipating providers.\nA service plan corporation may contract or make other arrangements with any agency, instrumentality or political subdivision of the United States, or this state, and may accept and administer funds, directly or indirectly, made available thereby provided such agency, instrumentality or political subdivision is authorized by law to make such contracts or arrangements. It may subcontract with any organization which has contracted with any such agency, instrumentality or political subdivision for the administration or furnishing of health services or any publicly supported health service plan.\nA service plan corporation may enter into contracts or other arrangements with similar organizations or corporations domiciled in this or any other state or country, for transfer of subscribers, reciprocal or joint benefits, or for other joint undertakings approved by its board and not inconsistent with the purposes of Laws 1971, chapter 568, provided, however, that in no event shall a service plan corporation enter into any such contract, arrangement or undertaking which would have the effect of relieving such corporation of its duties and obligations to any subscribers unless the corporation has received the prior written consent of the affected subscribers, or a qualified agent or representative of such subscribers.\nA service plan corporation may enter into contracts or other arrangements with providers or with any agency, instrumentality or political subdivision of the United States or any state or country or any other organization for administrative, accounting, record keeping, data processing, or planning, facility or service related to rendering or furnishing health services.\nLaws 1971, chapter 568 shall not be construed to require a service plan corporation to contract or arrange to remain under contract or arrangement with any provider, subscriber or group of subscribers.",
	"repealed": false
}