{
	"id": "327.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.71",
	"title": "327.71 INNKEEPER LIABILITY FOR THE PERSONAL PROPERTY OF GUESTS.",
	"text": "No innkeeper who has in the establishment a fireproof, metal safe or vault, in good order and fit for the custody of valuables, and who keeps a copy of this subdivision clearly and conspicuously posted at or near the front desk and on the inside of the entrance door of every bedroom, shall be liable for the loss of or injury to the valuables of a guest unless: (1) the guest has offered to deliver the valuables to the innkeeper for custody in the safe or vault; and (2) the innkeeper has omitted or refused to take the valuables and deposit them in the safe or vault for custody and to give the guest a receipt for them. Except as otherwise provided in subdivision 6, the liability of an innkeeper for the loss of or injury to the valuables of a guest shall not exceed $1,000. No innkeeper shall be required to accept valuables for custody in the safe or vault if their value exceeds $1,000, unless the acceptance is in writing.\nNo innkeeper shall be liable for the loss of or damage to baggage, parcels, packages or wearing material of a guest that has been delivered to the innkeeper for custody elsewhere than in the room assigned to the guest, or in the hotel safe or vault, unless the innkeeper has given the guest a check or receipt in writing evidencing the delivery. Except as otherwise provided in subdivision 6, the liability of an innkeeper for the loss of or damage to property delivered to the innkeeper for custody under this subdivision shall not exceed $1,000.\nNo innkeeper shall be liable for the loss of or damage to baggage or other receptacles of a guest, containing property of special value, and not suitable to be placed in the hotel safe or vault unless: (1) the property is delivered to the innkeeper for custody; (2) the guest, prior to the loss or damage, has filed with the innkeeper a written inventory of the property and its approximate value; (3) the innkeeper has been given an opportunity to inspect the property and to check it against the inventory; and (4) the innkeeper has given the guest a check or receipt evidencing the delivery. The liability of an innkeeper for the loss of or damage to property delivered for custody under this subdivision shall not exceed the actual value of the receptacle and its contents or the amount of the actual injury to the receptacle and its contents.\nExcept as otherwise provided in subdivision 6, no innkeeper shall be liable in an amount exceeding $1,000 for the loss of or damage to personal property of a guest that is contained in the bedroom registered to the guest.\nExcept as otherwise provided in subdivision 6, no innkeeper shall be liable for the loss of or damage to valuables or personal property of a guest that the guest has allowed to remain in the hotel after the relationship of innkeeper and guest has ceased, or that the guest has forwarded to the hotel before the relationship of innkeeper and guest has begun. If the valuables or personal property remain at the hotel for a period of at least ten days without having been claimed by the owner, the innkeeper has the right to deposit them in a storage warehouse, and to take a warehouse receipt in the name of the owner. An innkeeper who deposits valuables or personal property of a guest in a storage warehouse shall hold the warehouse receipt for the owner, and deliver it to the owner upon demand and upon payment of the costs of storage. The innkeeper may also dispose of abandoned, unclaimed property in the manner provided in sections 345.01 to 345.07.\nAn innkeeper who, intentionally or negligently, causes the loss of or damage to valuables or property delivered for custody as provided in subdivisions 1 and 2, to property contained in the assigned room of a guest as provided in subdivision 4, or to abandoned valuables or property not delivered to a storage warehouse provided in subdivision 5, shall be liable to the guest for either the actual value of the valuables or the property, or the amount of the actual injury to the valuables or the property.",
	"repealed": false
}