{
	"id": "182.6525",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.6525",
	"title": "182.6525 CRANE OPERATION.",
	"text": "An individual may not operate a crane with a lifting capacity of five tons or more on a construction site unless the individual has a valid crane operator certificate received from a nationally recognized and accredited certification program. No employer, and no person who is under a contract to construct an improvement to land, may permit any employee, agent, or independent contractor to perform work in violation of this section. A crane operator certification required under this subdivision must be renewed by an accredited certification program every five years.\nThe requirements of subdivision 1 do not apply to:\n(1) a crane operator trainee or apprentice, if the individual is under the direct supervision of a crane operator who holds a valid crane operator certificate as required in subdivision 1;\n(2) a person directly employed by a class 1 or 2 railroad who is qualified by the employing railroad as a crane operator or boom truck operator while performing work on property owned, leased, or controlled by the employing railroad;\n(3) a person who is employed by or performing work for a public utility, rural electric cooperative, municipality, telephone company, or industrial manufacturing plant;\n(4) a person who is subject to inspection and regulation under the Mine Safety and Health Act, United States Code, title 30, sections 801 through 962;\n(5) a person engaged in boating, fishing, agriculture, or arboriculture;\n(6) a person who is a member of and performing work for a uniformed service or who is a member of and performing work for the United States Merchant Marine;\n(7) a person who is operating a crane for personal use on premises owned or leased by that person; and\n(8) a person who is operating a crane in an emergency situation.\nAn employer or general contractor may be cited by the commissioner for a violation of the certification requirements in this section. A citation is punishable as a serious violation under section 182.666.",
	"repealed": false
}