{
	"id": "116J.548",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.548",
	"title": "116J.548 HOST COMMUNITY ECONOMIC DEVELOPMENT GRANTS.",
	"text": "A host community economic development grant program is created in the Department of Employment and Economic Development. Grants awarded under this section may only be spent for capital costs of an eligible project.\nFor purposes of this section:\n(a) \"Capital costs\" means expenditures for the public acquisition of land and buildings, betterment of public lands and buildings, and for other publicly owned capital improvements. Capital costs also include expenditures for predesign, design, engineering, and similar activities for specifically identified eligible projects.\n(b) \"Eligible project\" means a development or redevelopment project that will generate economic development within a time frame of five years or less or facilitate the preparation of long-term economic development within a host community.\n(c) \"Economic development\" means assistance in preparation of a redevelopment or development area contained in the application that results in at least one of the following:\n(1) job creation, including jobs relating to construction and temporary jobs;\n(2) an increase in the tax base;\n(3) the ability of the eligible project to attract private investment;\n(4) long-term economic development;\n(5) needed public infrastructure or transportation-related improvements to facilitate long-term redevelopment or development; or\n(6) other objective criteria established by the commissioner that demonstrate a public benefit to the host community.\n(d) \"Host community\" means a city located within the seven-county metropolitan area, as defined in section 473.121, subdivision 2, that is the site of a waste disposal facility that meets the standards in section 473.849, that accepts unprocessed mixed municipal solid waste generated in the metropolitan area.\n(e) \"Long-term economic development\" means capital costs associated with economic development projects identified by a host community comprehensive plan or redevelopment plan that will generate eligible economic development.\nHost communities may apply for a grant under this section on a form and in a manner prescribed by the commissioner. In awarding grants under this section, the commissioner must allocate available money between host communities as evenly as practicable.\nNotwithstanding section 16A.86 or any other law to the contrary, the state share of a project covered by this section shall cover 100 percent of the total cost of the project.\nThe commissioner must report to committees of the legislature with jurisdiction over economic development by February 15 of each year on grants awarded under this section.",
	"repealed": false
}