{
	"id": "115A.965",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.965",
	"title": "115A.965 PROHIBITIONS ON SELECTED TOXICS IN PACKAGING.",
	"text": "(a) As soon as feasible but not later than August 1, 1993, no manufacturer or distributor may sell or offer for sale or for promotional purposes in this state packaging or a product that is contained in packaging if the packaging itself, or any inks, dyes, pigments, adhesives, stabilizers, or any other additives to the packaging contain any lead, cadmium, mercury, or hexavalent chromium that has been intentionally introduced as an element during manufacture or distribution of the packaging.\n(b) For the purposes of this section:\n(1) \"distributor\" means a person who imports packaging or causes packaging to be imported into the state; it does not include a person involved solely in delivering packages on behalf of a third party;\n(2) \"intentional introduction\" means the act of deliberately using a regulated metal in the formulation of a package where its continued presence is desired in the final package to provide a specific characteristic, appearance, or quality. It does not include:\n(i) the use of a regulated metal as a processing agent or intermediate to impart certain chemical or physical changes during manufacturing, where the incidental retention of a residue of the metal in the final package is neither desired nor deliberate if the final package is in compliance with subdivision 2;\n(ii) the use of recycled materials as feedstock for the manufacture of new packaging materials, where some portion of the recycled materials may contain amounts of a regulated metal if the new package is in compliance with subdivision 2; or\n(iii) the incidental presence of any of the regulated metals.\nThe total concentration level of lead, cadmium, mercury, and hexavalent chromium added together in any packaging must not exceed the following amounts:\n(1) 600 parts per million by weight by August 1, 1993;\n(2) 250 parts per million by weight by August 1, 1994; and\n(3) 100 parts per million by weight by August 1, 1995.\n(a) Until January 1, 2010, the following packaging is exempt from the requirements of subdivisions 1 and 2:\n(1) packaging that would not exceed the total toxics concentration levels under subdivision 2 but for the addition in the packaging of materials that have fulfilled their intended use and have been discarded by consumers; and\n(2) packages that are reused but exceed the total toxics concentration levels in subdivision 2, provided that:\n(i) the product being conveyed by the package is regulated under federal or state health or safety requirements;\n(ii) transportation of the packaged product is regulated under federal or state transportation requirements; and\n(iii) disposal of the package is performed according to federal or state radioactive or hazardous waste disposal requirements.\n(b) Until January 1, 2010, packages that have a controlled distribution and reuse, but exceed the total toxics concentration levels in subdivision 2 and do not meet the requirements of paragraph (a), may be exempted from subdivisions 1 and 2 if the manufacturers or distributors of the packages petition for and receive approval from the commissioner. In granting approval, the commissioner shall base the decision on satisfactory demonstrations that the environmental benefit of the controlled distribution and reuse is significantly greater compared to the same package manufactured in compliance with the total toxics concentration levels in subdivision 2, and on plans proposed by the manufacturer that include each of the following elements:\n(1) a means of identifying the packaging in a permanent and visible manner;\n(2) a method of regulatory and financial accountability so that a specified percentage of the packaging manufactured and distributed to other persons is not discarded by those persons after use but are returned to the manufacturer or the manufacturer's designee;\n(3) a system of inventory and record maintenance to account for the packaging placed in, and removed from, service;\n(4) a means of transforming packaging that is no longer reusable into recycled materials for manufacturing or into manufacturing wastes which are subject to existing federal or state laws or regulations governing such manufacturing wastes that ensure that these wastes do not enter the industrial or mixed municipal solid waste stream; and\n(5) a system of annually reporting to the commissioner changes to the system and changes in designees.\n(c) Packaging to which lead, cadmium, mercury, or hexavalent chromium has been intentionally introduced in the manufacturing process may be exempted from the requirements of subdivisions 1 and 2 by the commissioner of the Pollution Control Agency if:\n(1) the use of the toxic element in the packaging is required by federal or state health or safety laws; or\n(2) there is no feasible alternative for the packaging because the toxic element used is essential to the protection, safe handling, or function of the contents of the package.\n(d) The commissioner may grant an exemption under paragraph (c) for a period not to exceed two years upon application by the packaging manufacturer that includes documentation showing that the criteria for an exemption are met. Exemptions granted by the commissioner may be renewed upon reapplication every two years.\n(a) Beginning August 1, 1993, each manufacturer and distributor of packaging for sale or other distribution in this state shall certify to each of their purchasers or receivers that the packaging purchased or received complies with this section. The certificate of compliance must be in writing and must be signed by an official of the manufacturer or distributor. For packaging that has received an exemption under subdivision 3, the certificate of compliance must list the amount of total toxics concentration in the packaging, the specific toxics present, and the basis for the exemption.\n(b) The manufacturer or distributor shall keep on file a copy of the certificate of compliance for each type of packaging manufactured or distributed and shall make copies available to the commissioner of the Pollution Control Agency or the attorney general on request, or to any member of the public within 60 days of receipt of a written request that specifies the type of packaging for which the information is requested.\n(c) Each purchaser or receiver, except a retailer, of packaging shall retain the certificate of compliance for as long as the packaging is in use.\n(d) If a manufacturer or distributor of packaging reformulates the packaging or creates new packaging, the manufacturer or distributor shall provide an amended or new certificate of compliance to purchasers and receivers for the reformulated or new packaging.\nThis section may be enforced under sections 115.071 and 116.072. A person who fails to comply with this section is subject to a civil fine of up to $5,000 per day of violation, court costs and attorney fees, and all costs associated with the separate collection, storage, transfer, and appropriate processing or disposal of nonconforming packaging, to be determined by the true cost of those activities per ton times the approximate actual tonnage of nonconforming packaging sold or otherwise distributed in the state.\n[Repealed, 1997 c 186 s 4]\nIn the interests of promoting consistent, nationally applicable standards, the commissioner shall have discretion to coordinate efforts under this section with similar efforts in other jurisdictions.\n[Repealed, 2012 c 272 s 98]",
	"repealed": false
}