{
	"id": "116C.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.83",
	"title": "116C.83 AUTHORIZATION FOR ADDITIONAL DRY CASK STORAGE.",
	"text": "Subject to the dry cask storage limits of the federal license for the independent spent-fuel storage installation at Prairie Island, the public utility that owns the Prairie Island nuclear generation plant has authorization for sufficient dry cask storage capacity at that installation to allow:\n(1) the unit 1 reactor at Prairie Island to operate until the end of its current license in 2013; and\n(2) the unit 2 reactor at Prairie Island to operate until the end of its current license in 2014.\nAuthorization of any additional dry cask storage other than that provided for in subdivision 1, or expansion or establishment of an independent spent-fuel storage facility at a nuclear generation facility in this state, is subject to approval of a certificate of need by the Public Utilities Commission pursuant to section 216B.243. In any proceeding under this subdivision, the commission may make a decision that could result in a shutdown of a nuclear generating facility. In considering an application for a certificate of need pursuant to this subdivision, the commission may consider whether the public utility that owns the nuclear generation facility in the state is in compliance with section 216B.1691 and the utility's past performance under that section.\n(a) To allow opportunity for review by the legislature, a decision by the commission on an application for a certificate of need pursuant to subdivision 2 is stayed until the June 1 following the next regular annual session of the legislature that begins after the date of the commission decision. By January 15 of the year of that legislative session, the commission shall issue a report to the chairs of the house of representatives and senate committees with jurisdiction over energy and environmental policy issues, providing a summary of the commission's decision and the grounds for that decision, the alternatives considered and rejected by the commission, and the reasons for rejecting those alternatives. If the legislature does not modify or reject the commission's decision by law enacted during that regular legislative session, the commission's decision shall become effective on the expiration of the stay.\n(b) The stay of a commission decision to approve an application for a certificate of need for additional dry cask storage under subdivision 2 does not apply to the fabrication of the spent-fuel storage casks. However, if the utility proceeds with the fabrication of casks, it does so bearing the risk of an adverse legislative decision.\n(a) The storage of spent nuclear fuel in the pool and in dry casks at a nuclear generating plant must be managed to facilitate the shipment of waste out of state to a permanent or interim storage facility as soon as feasible in a manner that allows the continued operation of the plant consistent with sections 116C.71 to 116C.83 and 216B.1645, subdivision 4.\n(b) The authorization for storage capacity pursuant to this section is limited to the storage of spent nuclear fuel generated by a Minnesota nuclear generation facility and stored on the site of that facility.\nThe standards established in section 116C.76, subdivision 1, clauses (1) to (3), apply to an independent spent-fuel installation. Such an installation must be operated in accordance with those standards.\n(a) The siting, construction, and operation of an independent spent-fuel storage installation located on the site of a Minnesota generation facility for dry cask storage of spent nuclear fuel generated solely by that facility is subject to all environmental review and protection provisions of this chapter and chapters 115, 115B, 116, 116B, 116D, and 216B, and rules associated with those chapters, except those statutes and rules that apply specifically to a radioactive waste management facility as defined in section 116C.71, subdivision 7.\n(b) An environmental impact statement is required under chapter 116D for a proposal to construct and operate a new or expanded independent spent-fuel storage installation. The Public Utilities Commission is the responsible governmental unit for the environmental impact statement. Prior to finding the statement adequate, the commission must find that the applicant has demonstrated that the facility is designed to provide a reasonable expectation that the operation of the facility will not result in groundwater contamination in excess of the standards established in section 116C.76, subdivision 1, clauses (1) to (3).",
	"repealed": false
}