{
	"id": "144E.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.30",
	"title": "144E.30 COOPERATION; DIRECTOR POWERS.",
	"text": "MS 1998 [Repealed, 1999 c 245 art 9 s 66]\nMS 1998 [Repealed, 1999 c 245 art 9 s 66]\nA licensee, person credentialed by the director, education program approved by the director, or agent of one who is the subject of an investigation or who is questioned in connection with an investigation by or on behalf of the director shall cooperate fully with the investigation. Cooperation includes responding fully and promptly to any question raised by or on behalf of the director relating to the subject of the investigation, executing all releases requested by the director, providing copies of ambulance service records, as reasonably requested by the director to assist in their investigation, and appearing at conferences or hearings scheduled by the director. The director shall pay reasonable costs for copies requested.\nIn addition to any other remedy provided by law, the director may bring an action for injunctive relief in the district court in Hennepin County or, at the director's discretion, in the district court in the county in which a violation of any statute, rule, or order that the director is empowered to enforce or issue, has occurred, to enjoin the violation.\nThe director may, as part of an investigation to determine whether a serious public health threat exists, issue subpoenas to require the attendance and testimony of witnesses and production of books, records, correspondence, and other information relevant to any matter involved in the investigation. The director or the director's designee may administer oaths to witnesses or take their affirmation. The subpoenas may be served upon any person named therein anywhere in the state by any person authorized to serve subpoenas or other processes in civil actions of the district courts. If a person to whom a subpoena is issued does not comply with the subpoena, the director may apply to the district court in any district and the court shall order the person to comply with the subpoena. Failure to obey the order of the court may be punished by the court as contempt of court. No person may be compelled to disclose privileged information as described in section 595.02, subdivision 1. All information pertaining to individual medical records obtained under this section shall be considered health data under section 13.3805, subdivision 1. All other information is considered public data unless otherwise protected under the Minnesota Data Practices Act or other specific law. The fees for the service of a subpoena must be paid in the same manner as prescribed by law for service of process used out of a district court. Subpoenaed witnesses must receive the same fees and mileage as in civil actions.\nMS 1998 [Repealed, 1999 c 245 art 9 s 66]",
	"repealed": false
}