{
	"id": "149A.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.47",
	"title": "149A.47 TRANSFER CARE SPECIALIST.",
	"text": "A transfer care specialist may remove a dead human body from the place of death under the direct supervision of a licensed mortician if the transfer care specialist is registered with the commissioner in accordance with this section. A transfer care specialist is not licensed to engage in the practice of mortuary science and shall not engage in the practice of mortuary science except as provided in this section. A transfer care specialist must be an employee of a licensed funeral establishment.\n(a) To be eligible for registration as a transfer care specialist, an applicant must submit to the commissioner:\n(1) a completed application on a form provided by the commissioner that includes at a minimum:\n(i) the applicant's name, home address and telephone number, business name, business address and telephone number, and email address; and\n(ii) the name, license number, business name, and business address and telephone number of the supervising licensed mortician;\n(2) proof of completion of a training program that meets the requirements specified in subdivision 4; and\n(3) the appropriate fee specified in section 149A.65.\n(b) All transfer care specialist registrations are valid for one calendar year, beginning on January 1 and ending on December 31 regardless of the date of issuance. Fees shall not be prorated.\n(a) A transfer care specialist registered under this section is authorized to perform the removal of a dead human body from the place of death in accordance with this chapter to a licensed funeral establishment. A transfer care specialist must comply with the universal precaution requirements in section 149A.91, subdivision 1, when handling a dead human body.\n(b) A transfer care specialist must work under the direct supervision of a licensed mortician. The supervising mortician is responsible for the work performed by the transfer care specialist. A licensed mortician may supervise up to four transfer care specialists at any one time.\n(a) Each transfer care specialist must complete a training program prior to initial registration. A training program must be at least seven hours long and must cover, at a minimum, the following:\n(1) ethical care and transportation procedures for a deceased person;\n(2) health and safety concerns to the public and the individual performing the transfer of the deceased person, and the use of universal precautions and other reasonable precautions to minimize the risk for transmitting communicable diseases; and\n(3) all relevant state and federal laws and regulations related to the transfer and transportation of deceased persons.\n(b) A transfer care specialist must complete three hours of continuing education annually on content described in paragraph (a), clauses (1) to (3), and submit evidence of completion with the individual's registration renewal.\n(a) A registration issued under this section expires on December 31 of the calendar year in which the registration was issued and must be renewed to remain valid.\n(b) To renew a registration, a transfer care specialist must submit to the commissioner a completed renewal application as provided by the commissioner and the appropriate fee specified in section 149A.65. The renewal application must include proof of completion of the continuing education requirements in subdivision 4.",
	"repealed": false
}