{
	"id": "123A.482",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.482",
	"title": "123A.482 JOINT POWERS COOPERATIVE FACILITY.",
	"text": "Two or more school districts may agree to jointly operate a secondary facility. The districts may choose to operate the facility according to a joint powers agreement under section 123A.78 or 471.59.\nA jointly operated secondary program seeking funding under section 123A.485 must demonstrate to the commissioner's satisfaction that the jointly operated program provides enhanced learning opportunities and broader curriculum offerings to the students attending that program. The commissioner must approve or disapprove a cooperative secondary program within 60 days of receipt of an application.\nIf an employee is transferred between two employer members of the joint powers agreement under this section, the employee's length of service under section 122A.40, subdivision 5, remains uninterrupted. The employee shall receive credit on the receiving district's salary schedule for the employee's educational attainment and years of continuous service in the sending district, or shall receive a comparable salary, whichever is greater. The employee shall receive credit for accrued sick leave and rights to severance benefits as if the employee had been employed by the receiving district during the employee's years of employment in the sending district.\nAn approved program that is jointly operated under this section is eligible for aid under section 123A.485 and qualifies for a facilities grant under sections 123A.44 to 123A.445.\nA school district operating a joint facility under this section meets the requirements of section 123A.64.\nBonds for a cooperative facility operated under this section issued by a member school district are not subject to the net debt limit under section 475.53, subdivision 4.\nFor purposes of determining each member district's school levy, a jointly operated secondary program may allocate program costs to each member district according to the joint powers agreement and each member district may include those costs in its tax levy. The joint powers agreement may choose to allocate costs on any basis adopted as part of the joint powers agreement.\nThe joint powers agreement may allow member school districts that choose to consolidate to continue to certify levies separately based on each component district's characteristics.\nA joint powers district formed under this section may issue bonds according to section 123A.78 or its member districts may issue bonds individually after complying with this subdivision. The joint powers board must submit the project for review and comment under section 123B.71. The joint powers board must hold a hearing on the proposal. If the bonds are not issued under section 123A.78, each member district of the joint powers district must submit the question of authorizing borrowing of funds for the project to the voters of the district at a special election. The question submitted shall state the total amount of funding needed from that district. The member district may issue the bonds according to chapter 475 and certify the levy required by section 475.61 only if a majority of those voting on the question in that district vote in the affirmative and only after the board has adopted a resolution pledging the full faith and credit of that unit. The resolution must irrevocably commit that unit to pay an agreed-upon share of any debt levy shortages that, together with other funds available, would allow the member school board to pay the principal and interest on the obligations. The clerk of the joint powers board must certify the vote of any bond elections to the commissioner. Bonds issued under this section first qualify for debt service equalization aid in fiscal year 2018.\nA district entering into a joint powers agreement under this section may conduct a referendum seeking approval for a new facility. This election may be held separately or at the same time as a bond election under subdivision 9. If the election is held at the same time, the questions may be asked separately or as a conjunctive question. The question must be approved by a majority of those voting on the question. If asked separately and the question fails, a district may not proceed with the sale of bonds according to subdivision 9.",
	"repealed": false
}