{
	"id": "325D.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/325D.32",
	"title": "325D.32 DEFINITIONS.",
	"text": "For the purpose of sections 325D.30 to 325D.42, the words, terms and phrases defined in this section have the meanings ascribed to them except where the context clearly indicates a different meaning.\n\"Cigarettes\" means and includes any roll for smoking, made wholly or in part of tobacco, irrespective of size and shape and whether or not such tobacco is flavored, adulterated or mixed with any other ingredient, the wrapper or cover of which is made of paper or any other substance or material except whole tobacco leaf, and includes any cigarette as defined in section 297F.01, subdivision 3.\n\"Person\" means and includes any individual, firm, trade association, company, partnership, nonprofit corporation, corporation, joint stock company, club agency, syndicate, or anyone engaged in the sale of cigarettes.\n\"Wholesaler\" means and includes any person who acquires cigarettes for the purpose of sale to retailers or to other persons for resale, and who maintains an established place of business when any part of the business is the sale of cigarettes at wholesale to persons licensed to sell cigarettes by the state or any municipality, and where at all times a stock of cigarettes is available to retailers for resale, or any cigarette manufacturer or manufacturer's representative who sells to retailers or to other persons for resale, and any person defined as a \"distributor\" under section 297F.01, subdivision 4. The term \"wholesaler\" shall also include a \"subjobber\" as defined by section 297F.01, subdivision 5. This subdivision does not prohibit any person from engaging in business as a retailer as defined in subdivision 5.\n\"Retailer\" means any person who is engaged in this state in the business of selling, or offering to sell, cigarettes at retail.\n\"Sale\" and \"sell\" mean and include any transfer for a consideration, exchange, barter, gift, offer for sale, and distribution in any manner or by any means whatsoever.\n\"Sell at wholesale,\" \"sale at wholesale\" and \"wholesale sales\" mean and include any sale or offer for sale made in the course of trade or usual conduct of the wholesaler's business to a retailer for the purpose of resale.\n\"Sell at retail,\" \"sale at retail,\" and \"retail sales\" mean and include any sale or offer for sale for consumption or use made in the ordinary course of trade of the seller's business.\n\"Basic cost of cigarettes\" means the gross invoice cost of cigarettes to the wholesaler or retailer plus the full face value of any stamps which may be required by any cigarette tax or fee act of this state, unless included by the manufacturer in the list price.\n(a) \"Cost to wholesaler\" means the basic cost of the cigarettes, prior to deducting manufacturer's timely payment and stamping discounts and any other discounts or rebates, plus the cost of doing business by the wholesaler, as defined in sections 325D.30 to 325D.42.\n(b) In the absence of proof of a lesser or higher cost, the cost of doing business by the wholesaler is presumed to be four percent of the basic cost of the cigarettes, plus cartage to the retail outlet, if furnished or paid for by the wholesaler. Such cartage cost is presumed to be one-half of one percent of the basic cost of the cigarettes in the absence of proof of a lesser or higher cost. A manufacturer's timely payment and stamping discounts and any other discounts or rebates shall not be deducted in determining the cost of doing business by the wholesaler, whether it is determined under the percentage formula set forth in this paragraph or proof of actual cost.\n(c) A wholesaler electing to sell cigarettes at a price other than that presumed by law must submit to the commissioner documentation substantiating the actual cost of the cigarettes before selling at actual cost. For purposes of this paragraph \"actual cost\" means basic cost as defined in subdivision 9 plus the wholesaler's cost of doing business. The commissioner shall review the documents submitted and, if necessary, request additional documentation to verify the accuracy of the cost computations. If, within 15 days of submission of the documentation, the commissioner has not notified the wholesaler of any deficiencies in the cost computations, the wholesaler may begin selling at actual cost. The cost computations are effective for a period of not more than 12 months beginning 15 days after submission of the documentation. Fifteen days before expiration of the 12-month period, the wholesaler must submit new cost documentation for review by the commissioner to continue selling at less than the price presumed by law. New cost documentation must also be submitted to the commissioner on the last day of a month in which the basic cost of cigarettes increases.\n(a) \"Cost of the retailer\" means the basic cost of the cigarettes involved to the retailer plus the cost of doing business by the retailer as defined in sections 325D.30 to 325D.42.\n(b) The cost of doing business by the retailer is presumed to be eight percent of the basic cost of cigarettes in the absence of proof of a lesser or a higher cost.\n(c) If a retailer qualifies for the purchase of cigarettes at a manufacturer's price to wholesaler and ultimately sells the cigarettes at retail, the cost of doing business by the retailer with respect to the cigarettes shall be, in the absence of showing of a lesser or higher cost of doing business, the sum of the cost of doing business by the wholesaler, as defined in subdivision 10, paragraph (b), and the cost of doing business by the retailer, as defined in paragraph (b) of this subdivision.\n[Repealed, 1987 c 268 art 13 s 54]",
	"repealed": false
}