{
	"id": "617.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.85",
	"title": "617.85 NUISANCE; MOTION TO CANCEL LEASE.",
	"text": "Where notice is provided under section 617.81, subdivision 4, that an abatement of a nuisance is sought and the circumstances that are the basis for the requested abatement involved the acts of a commercial or residential tenant or lessee of part or all of a building, the owner of the building that is subject to the abatement proceeding may file before the court that has jurisdiction over the abatement proceeding a motion to cancel the lease or otherwise secure restitution of the premises from the tenant or lessee who has maintained or conducted the nuisance. The owner may assign to the prosecuting attorney the right to file this motion. In addition to the grounds provided in sections 504B.281 to 504B.371, the maintaining or conducting of a nuisance as defined in section 617.81, subdivision 2, by a tenant or lessee, is an additional ground authorized by law for seeking the cancellation of a lease or the restitution of the premises. Service of motion brought under this section must be served in a manner that is sufficient under the Rules of Civil Procedure and sections 504B.281 to 504B.371.\nIt is no defense to a motion under this section by the owner or the prosecuting attorney that the lease or other agreement controlling the tenancy or leasehold does not provide for eviction or cancellation of the lease upon the ground provided in this section.\nUpon a finding by the court that the tenant or lessee has maintained or conducted a nuisance in any portion of the building, the court shall order cancellation of the lease or tenancy and grant restitution of the premises to the owner. The court must not order abatement of the premises if the court:\n(1) cancels a lease or tenancy and grants restitution of that portion of the premises to the owner; and\n(2) further finds that the act or acts constituting the nuisance as defined in section 617.81, subdivision 2, were committed by the tenant or lessee whose lease or tenancy has been canceled pursuant to this section and the tenant or lessee was not committing the act or acts in conjunction with or under the control of the owner.",
	"repealed": false
}