{
	"id": "168A.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.085",
	"title": "168A.085 APPLICATION FOR TITLE OR REGISTRATION, CERTAIN CASES.",
	"text": "No application for certificate of title or registration may be issued for a vehicle that was not manufactured in compliance with applicable federal emission standards in force at the time of manufacture as provided by the Clean Air Act, United States Code, title 42, sections 7401 through 7642, and regulations adopted pursuant thereto, and safety standards as provided by the National Traffic and Motor Safety Act, United States Code, title 15, sections 1381 through 1431, and regulations adopted pursuant thereto, unless the applicant furnishes either proof satisfactory to the agent that the vehicle was not brought into the United States from outside the country or all of the following:\n(1) a bond release letter, with all attachments, issued by the United States Department of Transportation acknowledging receipt of a statement of compliance submitted by the importer of the vehicle and that the statement meets the safety requirements as provided by Code of Federal Regulations, title 19, section 12.80(e);\n(2) a bond release letter, with all attachments, issued by the United States Environmental Protection Agency stating that the vehicle has been tested and known to be in conformity with federal emission requirements; and\n(3) a receipt or certificate issued by the United States Department of the Treasury showing that any gas-guzzler taxes due on the vehicle as provided by Public Law 95-618, title 2, section 201(a), have been fully paid.\nThe application for certificate of title and the application for registration must be accompanied by a manufacturer's certificate of origin in the English language which was issued by the actual vehicle manufacturer and either:\n(1) the original documents constituting valid proof of ownership in the country in which the vehicle was originally purchased, together with a translation of the documents into the English language verified as to accuracy of the translation by affidavit of the translator; or\n(2) with regard to a vehicle imported from a country that cancels the vehicle registration and title for export, a bond as required by section 168A.07, subdivision 1, clause (2).\nA valid and unexpired consular identification card issued to the applicant by the recognized consulate of a jurisdiction other than the United States is a primary document for purposes of Minnesota Rules, part 7410.0400, and successor rules, when the applicant is an individual who is applying as the owner for a vehicle title or registration.\nA valid and unexpired passport issued to the applicant by a recognized foreign government is a primary document for purposes of Minnesota Rules, part 7410.0400, and successor rules, when the applicant is an individual who is applying as the owner for a vehicle title or registration.",
	"repealed": false
}