{
	"id": "458.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/458.59",
	"title": "458.59 RECLAIMING WASTED HARBOR LAND; SALE AND USE.",
	"text": "The use of submerged, eroded, or depleted tracts of land in harbors on navigable waters by a political subdivision or by a port authority to conserve, develop, reclaim, or protect the land so as to restore them to economic usefulness is a public use conferring a public benefit.\nThe commissioner of revenue may transfer such a tract forfeited to the state for taxes to a political subdivision or port authority for a purpose in subdivision 1 in accordance with section 282.01. A political subdivision or a port authority acquiring the lands may conserve, develop, reclaim or protect them in any manner considered suitable by its governing body. After restoring the lands to a state of economic usefulness, the political subdivision or port authority may use the lands itself, or lease them on any terms and conditions the governing body sees fit.\nA lease of the lands must not be made without the approval of the governor and the state executive council.\nState-owned tax-forfeited riparian or submerged lands located in harbors on the Great Lakes-St. Lawrence Seaway and lying within 1,500 feet of the established harbor line may be offered for sale or sold as tax-forfeited land under law. If the lands lie within a port district of a seaway port authority the offer for sale or sale must not be made without the approval by resolution of the seaway port authority and of the state executive council. This subdivision does not affect Laws 1963, chapter 827.\nIf the lands have been developed, improved or used for business or development purposes by persons, firms, or corporations who are using and occupying, and who have used and occupied, the property for business or development purposes for at least two years prior to sale, under a lease with the state or a governmental subdivision, then the person, firm, or corporation has the right, on the first day set for sale by the county auditor, to purchase the property at 125 percent of the appraised value.",
	"repealed": false
}