{
	"id": "414.033",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.033",
	"title": "414.033 ANNEXATION BY ORDINANCE.",
	"text": "Unincorporated property abutting a municipality may be annexed to the municipality by ordinance as provided for in this section.\nA municipal council may by ordinance declare land annexed to the municipality and any such land is deemed to be urban or suburban in character or about to become so if:\n(1) the land is owned by the municipality;\n(2) the land is completely surrounded by land within the municipal limits;\n(3) the land abuts the municipality and the area to be annexed is 120 acres or less, and the area to be annexed is not presently served by public wastewater facilities or public wastewater facilities are not otherwise available, and the municipality receives a petition for annexation from all the property owners of the land. Except as provided for by an orderly annexation agreement, this clause may not be used to annex any property contiguous to any property either simultaneously proposed to be or previously annexed under this clause within the preceding 12 months if the property is or has been owned at any point during that period by the same owners and annexation would cumulatively exceed 120 acres; or\n(4) the land has been approved after August 1, 1995, by a preliminary plat or final plat for subdivision to provide residential lots that average 21,780 square feet or less in area and the land is located within two miles of the municipal limits.\nMS 1996 [Repealed, 1997 c 202 art 5 s 9]\nBefore a municipality may adopt an ordinance under subdivision 2, clause (2), (3), or (4), a municipality must hold a public hearing and give 30 days' written notice by certified mail to the town or towns affected by the proposed ordinance and to all landowners within and contiguous to the area to be annexed.\nIf the perimeter of the area to be annexed by a municipality is 60 percent or more bordered by the municipality and if the area to be annexed is 40 acres or less, the municipality shall serve notice of intent to annex upon the town board and the chief administrative law judge, unless the area is appropriate for annexation by ordinance under subdivision 2, clause (3). The town board shall have 90 days from the date of service to serve objections with the chief administrative law judge. If no objections are forthcoming within the said 90-day period, such land may be annexed by ordinance. If objections are filed with the chief administrative law judge, the chief administrative law judge shall conduct hearings and issue an order as in the case of annexations under section 414.031, subdivisions 3 and 4.\nMS 1976 [Repealed, 1978 c 705 s 33]\nIf the land is platted, or, if unplatted, does not exceed 200 acres, a majority of the property owners in number may petition the municipal council to have such land included within the abutting municipality and, within ten days thereafter, shall file copies of the petition with the chief administrative law judge, the town board, the county board and the municipal council of any other municipality which borders the land to be annexed. Within 90 days from the date of service, the town board or the municipal council of such abutting municipality may submit written objections to the annexation to the chief administrative law judge and the annexing municipality. Upon receipt of such objections, the chief administrative law judge shall proceed to hold a hearing and issue an order in accordance with section 414.031, subdivisions 3 and 4. If written objections are not submitted within the time specified in this section and if the municipal council determines that property proposed for the annexation is now or is about to become urban or suburban in character, it may by ordinance declare such land annexed to the municipality. If the petition is not signed by all the property owners of the land proposed to be annexed, the ordinance shall not be enacted until the municipal council has held a hearing on the proposed annexation after at least 30 days' mailed notice to all property owners within the area to be annexed.\nWhenever a proceeding for annexation is initiated under this section and all or any part of the land is included in another boundary adjustment proceeding pending before the chief administrative law judge, no action thereon shall be taken by the municipality, unless otherwise provided by an order of the chief administrative law judge, until final disposition has been made of the pending petition. Under this section, the chief administrative law judge will accept a waiver from all parties having a right to object, stating they have no objections to the proposed annexation and waiving the 90-day period before an annexation ordinance may be adopted.\nAny annexation ordinance provided for in this section must be filed with the chief administrative law judge, the township, the county auditor and the secretary of state and is final on the date the ordinance is approved by the chief administrative law judge. A copy of the annexation ordinance must be delivered immediately by the governing body of the municipality to the appropriate county auditors.\nMS 1978 [Repealed, 1980 c 487 s 23]\nMS 1996 [Repealed, 1997 c 87 s 4]\nThe chief administrative law judge may require the city or property owners to furnish additional information concerning an annexation by ordinance to inform the chief administrative law judge about the extent to which the proposed annexation conforms to the statutory criteria set forth in sections 414.01, subdivision 1, and 414.031, subdivision 4.\nWhen a municipality declares land annexed to the municipality under subdivision 2, clause (3), and the land is within a designated floodplain, as provided by section 103F.111, subdivision 4, or a shoreland area, as provided by section 103F.205, subdivision 4, the municipality shall adopt or amend its land use controls to conform to chapter 103F, and any new development of the annexed land shall be subject to chapter 103F.\nWhen a municipality annexes land under subdivision 2, clause (2), (3), or (4), property taxes payable on the annexed land shall continue to be paid to the affected town or towns for the year in which the annexation becomes effective. If the annexation becomes effective on or before August 1 of a levy year, the municipality may levy on the annexed area beginning with that same levy year. If the annexation becomes effective after August 1 of a levy year, the town may continue to levy on the annexed area for that levy year, and the municipality may not levy on the annexed area until the following levy year.\nAt least 30 days before a municipality may adopt an ordinance under subdivision 2, clause (2), (3), or (4), the petitioner must be notified by the municipality that the cost of electric utility service to the petitioner may change if the land is annexed to the municipality. The notice must include an estimate of the cost impact of any change in electric utility services, including rate changes and assessments, resulting from the annexation.",
	"repealed": false
}