{
	"id": "299F.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.56",
	"title": "299F.56 DEFINITIONS; NATURAL GAS PIPELINE SAFETY.",
	"text": "As used in sections 299F.56 to 299F.641, the terms defined in this section shall have the meanings given them.\n[Renumbered subd 9]\n[Renumbered subd 8]\n[Renumbered subd 15]\n[Renumbered subd 10]\n[Renumbered subd 12]\n[Renumbered subd 14]\n[Renumbered subd 16]\n[Renumbered subd 11]\n[Renumbered subd 13]\n\"Commissioner\" means the commissioner of public safety, acting through the director of pipeline safety.\nThe federal \"Hazardous Liquid Pipeline Safety Act\" means United States Code, title 49, sections 2001 to 2014.\nThe federal \"Natural Gas Pipeline Safety Act\" means United States Code, title 49, sections 1671 to 1686.\n\"Gas\" means natural gas, liquefied natural gas, flammable gas, or gas which is toxic or corrosive. \"Gas\" also includes liquefied petroleum gas in distribution systems.\n\"Gas pipeline facilities\" includes, without limitation, new and existing pipe, rights-of-way, and any equipment, facility, or building used in the transportation of gas or the treatment of gas during the course of transportation. \"Pipeline facilities\" shall not include any facilities subject to the jurisdiction of the Federal Energy Regulatory Commission under the Natural Gas Act of the United States, Statutes at Large, volume 52, chapter 556.\n\"Hazardous liquid\" means \"hazardous liquid\" and \"highly volatile liquid\" as defined in Code of Federal Regulations, title 49, section 195.2.\n\"Hazardous liquid pipeline facilities\" includes, without limitation, new and existing pipe, rights-of-way, and any equipment, facility, or building used or intended for use in the transportation of hazardous liquids including transportation by gravity or at a stress level of 20 percent or less of the specified minimum yield strength of the pipe.\n\"Liquefied natural gas\" means natural gas or synthetic gas having methane (CH4) as its major constituent that has been changed to a liquid or semisolid.\n\"Person\" means any individual, firm, joint venture, partnership, corporation, association, municipality, cooperative association or joint stock association, and includes any trustee, receiver, assignee, or personal representative thereof.\n\"Transportation\" means the gathering, transmission, or distribution of gas or hazardous liquid by pipeline or its storage; except that it shall not include any such transportation of gas or hazardous liquid which is subject to the jurisdiction of the Federal Energy Regulatory Commission under the Natural Gas Act of the United States, Statutes at Large, volume 52, chapter 556, and the federal Hazardous Liquid Pipeline Safety Act of 1979, United States Code, title 49, section 60101 et seq., or the gathering of gas or hazardous liquid in those rural locations which lie outside the limits of any incorporated or unincorporated city, town, or any other designated residential or commercial area such as a subdivision, a business or shopping center, a community development, or any similar populated area which the Office of Pipeline Safety may define as a nonrural area.",
	"repealed": false
}