{
	"id": "424B.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/424B.22",
	"title": "424B.22 RELIEF ASSOCIATION DISSOLUTION AND RETIREMENT PLAN TERMINATION.",
	"text": "(a) Notwithstanding any laws to the contrary, this section applies to:\n(1) the termination of a retirement plan established and administered by a relief association, whether or not the relief association is also dissolved or eliminated; and\n(2) the dissolution of a relief association that is not consolidating with another relief association under sections 424B.01 to 424B.10.\nThis section does not apply to the dissolution of a relief association or the termination of a retirement plan that occurs due to the change in retirement coverage from a retirement plan administered by a relief association to the Public Employees Retirement Association statewide volunteer firefighter plan under section 353G.06.\n(b) To terminate a retirement plan, the board of trustees must comply with subdivisions 3, 5 to 11, and, if desired, subdivision 4.\n(c) To dissolve a relief association, the board of trustees of the relief association must:\n(1) terminate the retirement plan in accordance with paragraph (b);\n(2) determine all legal obligations of the special and general funds of the relief association, as required by subdivision 5;\n(3) take the actions required by subdivision 12; and\n(4) comply with the requirements governing dissolution of nonprofit corporations under chapter 317A.\n(d) A relief association that terminates its retirement plan must liquidate its special fund as provided in subdivision 8, but need not liquidate its general fund if the relief association is not being dissolved.\n(a) A relief association is dissolved and the retirement plan administered by the relief association is terminated automatically if:\n(1) the fire department affiliated with a relief association is dissolved by action of the governing body of the municipality in which the fire department is located or by the governing body of the independent nonprofit firefighting corporation, whichever applies; or\n(2) the fire department affiliated with a relief association has terminated the employment or services of all active members of the relief association.\n(b) An involuntary termination of a relief association under this subdivision is effective on the December 31 that is at least eight months after the date on which the fire department is dissolved or the termination of employment or services of all active members of the relief association occurs. The board of trustees must comply with subdivisions 3 and 5 to 12. The board of trustees may comply with subdivision 4. The state auditor has the discretion to waive these requirements if the board of trustees requests a waiver in advance and provides adequate demonstration that meeting these requirements is not practicable.\n(c) The retirement plan administered by a relief association is terminated automatically if the relief association is dissolved, effective on the date of the dissolution of the relief association.\n(a) Unless subdivision 2 applies, the effective date of the termination of a retirement plan is the date approved by the board of trustees of the relief association. If the board of trustees does not approve a termination date, the effective date of the termination of a retirement plan is the effective date of the dissolution of the relief association or, if the relief association is not being dissolved, the end of the calendar year in which the termination of employment or services of all active members of the relief association occurs.\n(b) As of the earlier of the retirement plan termination date or the date on which the termination of employment or services of all active members of the relief association occurs, each participant becomes fully (100 percent) vested in the participant's retirement benefit under the retirement plan, notwithstanding any bylaws or laws to the contrary, except for any retiree in pay status who is receiving a monthly service pension from a relief association described in section 424A.093.\n(c) If the relief association is a defined contribution relief association, the account of each participant who becomes 100 percent vested under paragraph (b) shall include an allocation of any forfeiture that is required, under the bylaws of the relief association, to occur on or as of the end of the calendar year during which the termination of the retirement plan is effective, if the participant is entitled to an allocation of forfeitures under the bylaws. Any account so forfeited shall not be included in the retirement benefits that become 100 percent vested under paragraph (b).\n(a) Notwithstanding section 424A.02, subdivision 10, the board of trustees of a relief association may increase the benefit amount under a defined benefit relief association without the consent of the affiliated municipality or independent nonprofit firefighting corporation, as provided in this subdivision.\n(b) If the retirement plan being terminated is a defined benefit plan, the board of trustees may approve an amendment to the bylaws of the relief association to increase the lump-sum or monthly pension amount or both the lump-sum and monthly pension amount, if the relief association offers both, up to 125 percent of the maximum lump-sum service pension amount under section 424A.02, subdivision 3, paragraph (a), clause (2), or the maximum monthly service pension amount under section 424A.02, subdivision 3, paragraph (a), clause (1). The amount by which the lump-sum or monthly pension amount is increased must not cause the liabilities of the retirement plan to exceed the value of the assets, after taking into account full vesting as required under subdivision 3 and any administrative expenses.\n(c) The board of trustees shall specify whether the benefit increase will apply to only participants who are members active as of the date of the termination of the retirement plan or whether the benefit increase will apply to all participants, including members who are not active as of the plan termination date.\n(a) The board of trustees shall determine the following as of the date of termination of the retirement plan:\n(1) the fair market value of the assets of the special fund;\n(2) the present value of each participant's accrued benefit, taking into account full vesting under subdivision 3 and any increased lump-sum or monthly benefit level approved under subdivision 4;\n(3) the present value of any benefit remaining to be paid to each retiree in pay status, if any; and\n(4) administrative expenses incurred or reasonably anticipated to be incurred through the date on which all retirement benefits have been distributed or transferred or, if later, the effective date of the dissolution of the relief association.\n(b) The board of trustees shall compile a schedule that includes the following information:\n(1) the name of each participant, including each retiree in pay status to whom a benefit or pension is or will be owed;\n(2) the name of each other benefit recipient to whom a benefit or pension is or will be owed; and\n(3) for each individual described in clauses (1) and (2), the amount of the benefit or pension to which the individual is entitled under the bylaws of the relief association, taking into account the changes required or permitted by this section, the corresponding number of years of service on which the benefit or pension is based, and the earliest date on which the benefit or pension would have been payable under the bylaws of the relief association.\n(c) If the relief association is dissolving, in addition to the determination under paragraph (a) for the retirement plan, the board of trustees shall determine, as of the effective date of the dissolution of the relief association, the legal obligations of the general fund of the relief association.\nTo minimize the risk of investment losses between the termination date and the date benefits will begin to be distributed, the board of trustees shall invest the assets in the special fund in low-risk investments, to the extent consistent with its fiduciary duty under chapter 356A.\n(a) If the retirement plan is a defined benefit plan and if, after completing the determination of assets, liabilities, and administrative expenses under subdivision 5, there is a surplus, the board of trustees shall transfer to the affiliated municipality the lesser of (1) the amount of the surplus, or (2) the sum of all required contributions, without investment earnings or interest thereon, made by the municipality to the relief association during the year in which the termination of the retirement plan occurs or during the preceding nine years.\n(b) If the affiliated municipality did not make any required contributions to the relief association during the current or preceding nine years or if, after the transfer described in paragraph (a), there is surplus remaining, the relief association and the municipality will mutually agree on an allocation between them of the remaining surplus.\n(c) If, within 180 days of the date of termination of the retirement plan, the municipality and relief association have not reached an agreement on the allocation of the surplus under paragraph (b), then 50 percent of the surplus shall be retained by the relief association and 50 percent of the surplus shall be transferred to the affiliated municipality.\n(d) Any surplus retained by the relief association under paragraph (c) shall be allocated among all participants eligible to share in the surplus in the same proportion that the present value of the accrued benefit for each eligible participant bears to the total present value of the accrued benefits of all participants eligible to share in the surplus, and each eligible participant's benefit, as determined under subdivision 5, paragraph (a), clause (2), shall be increased by the participant's share of the surplus. The board of trustees shall determine eligibility to share in the surplus, which may include all participants and any former participants who, within the last three years or such other number of years as determined by the board of trustees, separated from active service and received their retirement benefit.\nIf the board of trustees decides to include former participants in the allocation of the surplus, the board of trustees shall modify the method for allocating the surplus to take into account the former participants.\n(e) Any amount of surplus transferred to the affiliated municipality under this subdivision may only be used for the purposes described in section 424A.08, paragraph (a) or (b).\n(a) The board of trustees shall liquidate the assets of the special fund and pay retirement benefits and administrative expenses under the retirement plan within 210 days after the effective date of the termination of the retirement plan.\n(b) If the retirement plan is a defined benefit plan that pays lump-sum benefits or a defined contribution plan, without regard to whether the participant has attained age 50, each participant and other benefit recipient shall be permitted to elect an immediate distribution or a direct rollover of the participant's benefit to an eligible retirement plan as permitted under section 356.633, subdivisions 1 and 2, if the benefit is an eligible rollover distribution as defined in section 356.633, subdivision 1, paragraph (d).\n(c) If the retirement plan is a defined benefit plan that pays monthly pension benefits, the board of trustees shall, at the election of the participant or other benefit recipient, purchase an annuity contract under section 424A.015, subdivision 3, naming the participant or other benefit recipient, as applicable, as the insured or distribute a lump-sum amount that is equal to the present value of the monthly pension benefits to which the participant or other benefit recipient is entitled. If an annuity is elected by the participant or other benefit recipient, the annuity shall provide for commencement at a date elected by the insured, to be paid as an annuity for the life of the insured. Legal title to the annuity contract shall be transferred to the insured. If a lump sum is elected, the option under paragraph (b) to take an immediate distribution or a direct rollover shall apply.\n(d) The board of trustees shall complete the distribution of all assets of the special fund by making any remaining distributions or transfers as required under subdivision 9 on behalf of participants or other benefit recipients who cannot be located or are unresponsive and paying any remaining administrative expenses related to the termination of the plan.\n(a) For purposes of this subdivision, the terms defined in this subdivision have the meanings given them.\n(b) \"Retirement benefit\" means:\n(1) the participant's account balance if the retirement plan is a defined contribution plan;\n(2) the participant's lump-sum benefit if the retirement plan is a defined benefit plan that pays a lump sum; or\n(3) an amount equal to the present value of the participant's benefit if the retirement plan is a defined benefit plan that pays a monthly annuity.\n(c) \"Individual retirement account\" means an account that satisfies the requirements of section 408(a) of the Internal Revenue Code which is established by an officer of the relief association in the name of the participant or other benefit recipient at a federally insured financial institution.\n(d) If the board of trustees cannot locate a participant or other benefit recipient, the board of trustees shall make a diligent effort to obtain a current address or other contact information as follows:\n(1) send a notice to the address on file for the participant or other benefit recipient using certified mail;\n(2) check with the Minnesota State Fire Department Association, the municipality, and any other employer of the participant;\n(3) check with the participant's designated beneficiary on file with the relief association; and\n(4) use one or more of the Internet search tools that are free of charge.\n(e) The board of trustees shall transfer the retirement benefit to an individual retirement account or consider the retirement benefit abandoned and deposit funds in the amount of the retirement benefit with the commissioner of commerce under chapter 345, notwithstanding any laws to the contrary, including section 345.381, if the board of trustees is unable to locate the participant or other benefit recipient after taking the actions described in paragraph (d) or the participant or other benefit recipient does not elect to receive or rollover a retirement benefit to which the participant or other benefit recipient is entitled.\nWithin 60 days after the distribution of benefits under subdivision 8, the municipality or firefighting corporation with which the fire department is affiliated shall pay supplemental benefits under section 424A.10 to each participant and survivor who satisfies the requirements of section 424A.10, subdivision 2. A supplemental benefit is payable to each participant who receives a retirement benefit if the participant is at least age 50. A supplemental benefit is payable to each participant or survivor who receives, respectively, a disability benefit or survivor benefit without regard to any minimum age requirement. The commissioner of revenue shall reimburse the municipality or firefighting corporation for all supplemental benefits paid as provided in section 424A.10, subdivision 3.\n[See Note.]\nThe board of trustees shall notify the commissioner of revenue and the state auditor that the retirement plan is being terminated no later than 30 days before the effective date of the termination of the retirement plan and provide any information the commissioner or state auditor may require.\nThe relief association is dissolved effective on the date that the board of trustees completes the following actions:\n(1) prepares and files with the state auditor final audited financial statements, pursuant to section 424A.014, subdivision 1, or, if applicable, the certified financial statement, pursuant to section 424A.014, subdivision 2;\n(2) liquidates the general fund and settles all legal obligations of the general fund as determined under subdivision 5;\n(3) transfers the records of the relief association to the chief administrative officer of the affiliated municipality; and\n(4) notifies the commissioner of revenue, the state auditor, and the secretary of state of the dissolution no later than 30 days before the effective date of the dissolution.",
	"repealed": false
}