{
	"id": "65B.133",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.133",
	"title": "65B.133 SURCHARGE DISCLOSURE.",
	"text": "For the purposes of this section, the terms defined in this section have the meanings given them.\n(a) \"Computed premium\" means the rate in effect before the application of a surcharge.\n(b) \"Chargeable accident\" means an accident which is taken into consideration in applying a surcharge.\n(c) \"Chargeable traffic violation\" means a traffic violation which is taken into consideration in applying a surcharge.\n(d) \"Policy\" means a policy providing private passenger vehicle insurance, as defined in section 65B.001, subdivision 2.\n(e) \"Surcharge\" means any increase in premium for a policy, including the removal of an accident-free or claim-free discount, based upon an accident or a traffic violation.\n(f) \"Surcharge disclosure statement\" means a written statement disclosing the surcharge plan of an insurer, the effective date of the surcharge plan, and the name of the insurer, and any other information which the commissioner may require to be disclosed to assist insureds in comparing surcharge plans among insurers.\n(g) \"Surcharge plan\" means the conditions under which an insurer applies a surcharge including but not limited to: (1) the maximum dollar amount which an insurer pays due to an accident without applying a surcharge, (2) accidents which are not chargeable, (3) chargeable traffic violations, (4) the length of time that an accident or a traffic violation is chargeable, and (5) surcharge rates for the first and each successive accident or traffic violation.\n(h) \"Surcharge rate\" means the amount of any surcharge expressed as a percentage of the computed premium rate or as a dollar amount surcharge, if a percentage surcharge is not used.\nBefore accepting the initial premium payment, an insurer or its agent shall provide a surcharge disclosure statement to any person who applies for a policy which is effective on or after January 1, 1983. If the insurer provides the surcharge disclosure statement on the insurer's website, the insurer or agent may notify the applicant orally or in writing of its availability for review on the insurer's website prior to accepting the initial payment, in lieu of providing a disclosure statement to the applicant in writing, if the insurer so notifies the applicant of the availability of a written version of this statement upon the applicant's request. The insurer shall provide the surcharge disclosure statement in writing if requested by the applicant. An oral notice shall be presumed delivered if the agent or insurer makes a contemporaneous notation in the applicant's record of the notice having been delivered or if the insurer or agent retains an audio recording of the notification provided to the applicant.\n[Repealed, 2010 c 384 s 104]\nNo insurer may change its surcharge plan unless a surcharge disclosure statement or written website notice is mailed or delivered to the named insured before the change is made. A surcharge disclosure statement disclosing a change applicable on the renewal of a policy, may be mailed with an offer to renew the policy. Surcharges cannot be applied to accidents or traffic violations that occurred prior to a change in a surcharge plan except to the extent provided under the prior plan.\nNo traffic violation is chargeable to a driver unless the driver is convicted of, or forfeits bail for, the offense, or the driver's license is revoked pursuant to section 169A.52 or 171.177. If a surcharge is applied because bail is forfeited and if the driver is later acquitted of the offense, the insurer shall rebate the surcharge. A violation of section 169.685, subdivision 5, is not chargeable.\nNo surcharge is chargeable to an insured who collects benefits under a policy because the insured is a passenger in a bus, taxi, or commuter van involved in an accident.\nFailure to comply with this section constitutes a violation of section 70A.04 and is subject to the penalties prescribed in section 70A.21.\nThe commissioner may promulgate rules reasonably necessary to carry out and make effective this section.",
	"repealed": false
}