{
	"id": "326B.978",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.978",
	"title": "326B.978 EXAMINATIONS; CLASSIFICATIONS; QUALIFICATIONS.",
	"text": "Engineers shall be divided into four classes:\n(1) Chief engineers; Grade A, Grade B, and Grade C.\n(2) First class engineers; Grade A, Grade B, and Grade C.\n(3) Second class engineers; Grade A, Grade B, and Grade C.\n(4) Special engineers.\nAny individual who desires an engineer's license shall submit an application on a written or electronic form prescribed by the commissioner with all fees required by section 326B.092.\nEach applicant for a license must pass an examination developed and administered by the commissioner. The examinations shall be of sufficient scope to establish the competency of the applicant to operate a boiler of the applicable license class and grade.\n[Repealed, 2013 c 85 art 2 s 44]\nFor the purposes of this section and section 326B.97, high-pressure boilers shall mean boilers operating at a steam or other vapor pressure in excess of 15 psig, or a water or other liquid boiler in which the pressure exceeds 160 psig or a temperature of 250 degrees Fahrenheit.\nLow-pressure boilers shall mean boilers operating at a steam or other vapor pressure of 15 psig or less, or a water or other liquid boiler in which the pressure does not exceed 160 psig or a temperature of 250 degrees Fahrenheit.\nAn individual seeking licensure as a chief engineer, Grade A, shall be at least 18 years of age and have experience which verifies that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers, steam engines, and turbines and their appurtenances; and, before receiving a license, the applicant shall take and subscribe an oath attesting to at least five years actual experience in operating the boilers except as provided in subdivision 18, including at least two years' experience in operating the engines or turbines except as provided in subdivision 18.\nAn individual seeking licensure as a chief engineer, Grade B, shall be at least 18 years of age and have habits and experience which justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers and their appurtenances; and, before receiving a license, the applicant shall take and subscribe an oath attesting to at least five years' actual experience in operating those boilers except as provided in subdivision 18.\nAn individual seeking licensure as a chief engineer, Grade C, shall be at least 18 years of age and have habits and experience which justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of low-pressure boilers and their appurtenances, and before receiving a license, the applicant shall take and subscribe an oath attesting to at least five years of actual experience in operating the boilers except as provided in subdivision 18.\nAn individual seeking licensure as a first-class engineer, Grade A, shall be at least 18 years of age and have experience which verifies that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers, engines, and turbines and their appurtenances of not more than 500 horsepower or to operate as a shift engineer in a plant of unlimited horsepower. Before receiving a license, the applicant shall take and subscribe an oath attesting to at least three years actual experience in operating the boilers, including at least two years' experience in operating such engines or turbines except as provided in subdivision 18.\nAn individual seeking licensure as a first-class engineer, Grade B, shall be at least 18 years of age and have habits and experience which justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers of not more than 500 horsepower or to operate as a shift engineer in a plant of unlimited horsepower. Before receiving a license the applicant shall take and subscribe an oath attesting to at least three years' actual experience in operating the boilers except as provided in subdivision 18.\nAn individual seeking licensure as a first-class engineer, Grade C, shall be at least 18 years of age and have habits and experience which justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of low-pressure boilers and their appurtenances of not more than 500 horsepower or to operate as a shift engineer in a low-pressure plant of unlimited horsepower. Before receiving a license, the applicant shall take and subscribe an oath attesting to at least three years' actual experience in operating the boilers except as provided in subdivision 18.\nAn individual seeking licensure as a second-class engineer, Grade A, shall be at least 18 years of age and have experience which verifies that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers, engines, and turbines and their appurtenances of not more than 100 horsepower or to operate as a shift engineer in a plant of not more than 500 horsepower, or to assist the shift engineer, under direct supervision, in a plant of unlimited horsepower. Before receiving a license the applicant shall take and subscribe an oath attesting to at least one year of actual experience in operating the boilers, including at least one year of experience in operating the engines or turbines except as provided in subdivision 18.\nAn individual seeking licensure as a second-class engineer, Grade B, shall be at least 18 years of age and have habits and experience which justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers of not more than 100 horsepower or to operate as a shift engineer in a plant of not more than 500 horsepower or to assist the shift engineer, under direct supervision, in a plant of unlimited horsepower. Before receiving a license the applicant shall take and subscribe an oath attesting to at least one year of actual experience in operating the boilers except as provided in subdivision 16 or 18.\nAn individual seeking licensure as a second-class engineer, Grade C, shall be at least 18 years of age and have habits and experience which justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of low-pressure boilers and their appurtenances of not more than 100 horsepower or to operate as a shift engineer in a low-pressure plant of not more than 500 horsepower, or to assist the shift engineer, under direct supervision, in a low-pressure plant of unlimited horsepower. Before receiving a license, the applicant shall take and subscribe an oath attesting to at least one year of actual experience in operating the boilers except as provided in subdivision 18.\n(a) An individual seeking licensure as a special engineer shall be at least 18 years of age and have habits and experience which justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers and their appurtenances of not more than 50 horsepower or to operate as a shift engineer in a plant of not more than 100 horsepower, or to serve as an apprentice in any plant under the direct supervision of the properly licensed engineer.\n(b) An individual seeking licensure as a special engineer who is at least 16 years of age but less than 18 years of age must be enrolled in a course approved by the commissioner, and have habits and experience that justify the belief that the individual is competent to take charge of and be responsible for the safe operation and maintenance of all classes of boilers and their appurtenances of not more than 50 horsepower or to operate as a shift engineer in a plant of not more than 100 horsepower, or to serve as an apprentice in any plant under the direct supervision of the properly licensed engineer.\nAny individual operating a boiler other than a steam boiler on or before April 15, 1982, shall be qualified for application for the applicable class license upon presentation of an affidavit furnished by an inspector and sworn to by the individual's employer or a chief engineer. Except as provided in subdivision 18, the applicant must have at least the number of years of actual experience specified for the class of license requested and pass the appropriate examination.\nFor the purpose of rating boiler horsepower for engineer license classifications only: ten square feet of heating surface shall be considered equivalent to one boiler horsepower for conventional boilers and five square feet of heating surface equivalent to one boiler horsepower for steam coil type generators.\nNotwithstanding the experience requirements in subdivisions 6 to 16, the commissioner may by rule establish educational equivalencies that an applicant may meet instead of a portion of the specified operating experience.\nThis section shall not apply to traction or hobby boiler engineer's licenses or provisional licenses.",
	"repealed": false
}