{
	"id": "323A.0303",
	"url": "https://www.revisor.mn.gov/statutes/cite/323A.0303",
	"title": "323A.0303 STATEMENT OF PARTNERSHIP AUTHORITY.",
	"text": "(a) A partnership may file a statement of partnership authority, which:\n(1) must include:\n(i) the name of the partnership;\n(ii) the street address, including the zip code, of its chief executive office and of one office in this state, if there is one;\n(iii) the names and mailing addresses, including zip codes, of all of the partners or of an agent appointed and maintained by the partnership for the purpose of subsection (b); and\n(iv) the names of the partners authorized to execute an instrument transferring real property held in the name of the partnership; and\n(2) may state the authority, or limitations on the authority, of some or all of the partners to enter into other transactions on behalf of the partnership and any other matter.\n(b) If a statement of partnership authority names an agent, the agent shall maintain a list of the names and mailing addresses, including zip codes, of all of the partners and make it available to any person on request for good cause shown.\n(c) If a filed statement of partnership authority is executed pursuant to section 323A.0105(c), and states the name of the partnership but does not contain all of the other information required by subsection (a), the statement nevertheless operates with respect to a person not a partner as provided in subsections (d) and (e).\n(d) A filed statement of partnership authority supplements the authority of a partner to enter into transactions on behalf of the partnership as follows:\n(1) Except for transfers of real property, a grant of authority contained in a filed statement of partnership authority is conclusive in favor of a person who gives value without knowledge to the contrary, so long as and to the extent that a limitation on that authority is not then contained in another filed statement. A filed cancellation of a limitation on authority revives the previous grant of authority.\n(2) A grant of authority to transfer real property held in the name of the partnership contained in a filed statement of partnership authority, whether or not a certified copy of the filed statement is recorded, is conclusive in favor of a person who gives value without knowledge to the contrary, so long as and to the extent that a certified copy of a filed statement containing a limitation on that authority is not then of record. The recording of a certified copy of a filed cancellation of a limitation on authority revives the previous grant of authority.\n(e) A person not a partner is deemed to know of a limitation on the authority of a partner to transfer real property held in the name of the partnership only if a certified copy of the filed statement containing the limitation on authority is of record.\n(f) Except as otherwise provided in subsections (d) and (e) and sections 323A.0704 and 323A.0805, a person not a partner is not deemed to know of a limitation on the authority of a partner merely because the limitation is contained in a filed statement.",
	"repealed": false
}