{
	"id": "144G.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.64",
	"title": "144G.64 TRAINING IN DEMENTIA, MENTAL ILLNESS, AND DE-ESCALATION REQUIRED.",
	"text": "(a) All assisted living facilities must meet the following dementia care, mental illness, and de-escalation training requirements:\n(1) supervisors of direct-care staff must have at least eight hours of initial training on dementia topics specified under paragraph (b), clauses (1) to (5), and two hours of initial training on mental illness and de-escalation topics specified under paragraph (b), clauses (6) to (8), within 120 working hours of the employment start date. Supervisors must have at least two hours of training on topics related to dementia and one hour of training on topics related to mental illness and de-escalation for each 12 months of employment thereafter;\n(2) direct-care staff must have completed at least eight hours of initial training on dementia topics specified under paragraph (b), clauses (1) to (5), and two hours of initial training on mental illness and de-escalation topics specified under paragraph (b), clauses (6) to (8), within 160 working hours of the employment start date. Until this initial training is complete, a staff member must not provide direct care unless there is another staff member on site who has completed the initial eight hours of training on topics related to dementia and the initial two hours of training on topics related to mental illness and de-escalation and who can act as a resource and assist if issues arise. A trainer of the requirements under paragraph (b) or a supervisor meeting the requirements in clause (1) must be available for consultation with the new staff member until the training requirement is complete. Direct-care staff must have at least two hours of training on topics related to dementia and one hour of training on topics related to mental illness and de-escalation for each 12 months of employment thereafter;\n(3) for assisted living facilities with dementia care, direct-care staff must have completed at least eight hours of initial training on topics specified under paragraph (b) within 80 working hours of the employment start date. Until this initial training is complete, the staff member must not provide direct care unless there is another staff member on site who has completed the initial eight hours of training on topics related to dementia and two hours of training on topics related to mental illness and de-escalation and who can act as a resource and assist if issues arise. A trainer of the requirements under paragraph (b) or a supervisor meeting the requirements in clause (1) must be available for consultation with the new staff member until the training requirement is complete. Direct-care staff must have at least two hours of training on topics related to dementia and one hour of training on topics related to mental illness and de-escalation for each 12 months of employment thereafter;\n(4) staff who do not provide direct care, including maintenance, housekeeping, and food service staff, must have at least four hours of initial training on topics specified under paragraph (b), clauses (1) to (5), and two hours of initial training on mental illness and de-escalation topics specified under paragraph (b), clauses (6) to (8), within 160 working hours of the employment start date, and must have at least two hours of training on topics related to dementia and one hour of training on topics related to mental illness and de-escalation for each 12 months of employment thereafter; and\n(5) new staff members may satisfy the initial training requirements by producing written proof of previously completed required training within the past 18 months.\n(b) Areas of required dementia, mental illness, and de-escalation training include:\n(1) an explanation of Alzheimer's disease and other dementias;\n(2) assistance with activities of daily living;\n(3) problem solving with challenging behaviors;\n(4) communication skills;\n(5) person-centered planning and service delivery;\n(6) recognizing symptoms of common mental illness diagnoses, including but not limited to mood disorders, anxiety disorders, trauma- and stressor-related disorders, personality and psychotic disorders, substance use disorder, and substance misuse;\n(7) de-escalation techniques and communication; and\n(8) crisis resolution and suicide prevention, including procedures for contacting county crisis response teams and 988 suicide and crisis lifelines.\n(c) The facility shall provide to consumers in written or electronic form a description of the training program, the categories of staff trained, the frequency of training, and the basic topics covered.",
	"repealed": false
}