{
	"id": "469.169",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.169",
	"title": "469.169 ADDITIONAL BORDER CITY ZONE ALLOCATIONS.",
	"text": "MS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\n(a) The commissioner shall allocate tax reductions to border city enterprise zones located on the western border of the state. The cumulative total amount of tax reductions for all years of the program under sections 469.1731 to 469.1735, is limited to:\n(1) for the city of Breckenridge, $394,000;\n(2) for the city of Dilworth, $118,200;\n(3) for the city of East Grand Forks, $788,000;\n(4) for the city of Moorhead, $591,000; and\n(5) for the city of Ortonville, $78,800.\nAllocations made under this subdivision may be used for tax reductions provided in section 469.1732 or 469.1734 or for reimbursements under section 469.1735, subdivision 3, but only if the municipality determines that the granting of the tax reduction or offset is necessary to enable a business to expand within a city or to attract a business to a city.\n(b) The limit in the allocation in paragraph (a) for a municipality may be waived by the commissioner if the commissioner of revenue finds that the municipality must provide an incentive under section 469.1732 or 469.1734 that, by itself or when aggregated with all other tax reductions granted by the municipality under those provisions, exceeds the municipality's maximum allocation under paragraph (a), in order to obtain or retain a business in the city that would not occur in the municipality without the incentive. The limit may be waived only if the commissioner finds that the business for which the tax incentives are to be provided:\n(1) requires a private capital investment of at least $1,000,000 within the city;\n(2) employs at least 25 new or additional full-time equivalent employees within the city; and\n(3) pays its employees at the location in the city wages that, on the average, will exceed the average wage paid in the county in which the municipality is located.\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nIn addition to tax reductions authorized in subdivision 12, the commissioner may allocate $1,500,000 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall make allocations to zones in cities on the western border on a per capita basis. Allocations made under this subdivision may be used for tax reductions as provided in section 469.171, or other offsets of taxes imposed on or remitted by businesses located in the enterprise zone, but only if the municipality determines that the granting of the tax reduction or offset is necessary in order to retain a business within or attract a business to the zone.\nIn addition to tax reductions authorized in subdivisions 12 and 14, the commissioner shall allocate $1,500,000 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall make allocations to zones in cities on the western border on a per capita basis. Allocations made under this subdivision may be used for tax reductions as provided in section 469.171, or for other offsets of taxes imposed on or remitted by businesses located in the enterprise zone, but only if the municipality determines that the granting of the tax reduction or offset is necessary in order to retain a business within or attract a business to the zone. Any portion of the allocation provided in this section may alternatively be used for tax reductions under section 469.1732 or 469.1734. If, at the end of the biennium, the total amount allowable under this section has not been expended, a city that has expended its allocation may submit a request for an additional allocation for qualifying reductions from the amount remaining. If more than one city exceeds their allocation and the additional qualifying amounts exceed the balance remaining, the commissioner shall allocate the amount remaining to each qualifying city in proportion to its request for additional allocation.\n(a) In addition to tax reductions authorized in subdivisions 12, 14, and 15, the commissioner shall allocate $750,000 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall make allocations to zones in cities on the western border on a per capita basis. Allocations made under this subdivision may be used for tax reductions as provided in section 469.171, or for other offsets of taxes imposed on or remitted by businesses located in the enterprise zone, but only if the municipality determines that the granting of the tax reduction or offset is necessary in order to retain a business within or attract a business to the zone. Any portion of the allocation provided in this paragraph may alternatively be used for tax reductions under section 469.1732 or 469.1734.\n(b) The commissioner shall allocate $750,000 for tax reductions under section 469.1732 or 469.1734 to cities with border city enterprise zones located on the western border of the state. The commissioner shall allocate this amount among the cities on a per capita basis. Any portion of the allocation provided in this paragraph may alternatively be used for tax reductions as provided in section 469.171.\n(a) In addition to tax reductions authorized in subdivisions 12 and 14 to 16, the commissioner shall allocate $750,000 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall make allocations to zones in cities on the western border on a per capita basis. Allocations made under this subdivision may be used for tax reductions as provided in section 469.171, or for other offsets of taxes imposed on or remitted by businesses located in the enterprise zone, but only if the municipality determines that the granting of the tax reduction or offset is necessary in order to retain a business within or attract a business to the zone. Any portion of the allocation provided in this paragraph may alternatively be used for tax reductions under section 469.1732 or 469.1734.\n(b) The commissioner shall allocate $750,000 for tax reductions under section 469.1732 or 469.1734 to cities with border city enterprise zones located on the western border of the state. The commissioner shall allocate this amount among the cities on a per capita basis. Any portion of the allocation provided in this paragraph may alternatively be used for tax reductions as provided in section 469.171.\n(a) In addition to tax reductions authorized in subdivisions 12 and 14 to 17, the commissioner shall allocate $352,500 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall make allocations to zones in cities on the western border on a per capita basis. Allocations made under this subdivision may be used for tax reductions as provided in section 469.171, or for other offsets of taxes imposed on or remitted by businesses located in the enterprise zone, but only if the municipality determines that the granting of the tax reduction or offset is necessary in order to retain a business within or attract a business to the zone. The city alternatively may elect to use any portion of the allocation provided in this paragraph for tax reductions under section 469.1732 or 469.1734.\n(b) The commissioner shall allocate $352,500 for tax reductions under section 469.1732 or 469.1734 to cities with border city enterprise zones located on the western border of the state. The commissioner shall allocate this amount among the cities on a per capita basis. The city alternatively may elect to use any portion of the allocation provided in this paragraph for tax reductions as provided in section 469.171.\n(a) In addition to the tax reductions authorized in subdivisions 12 to 18, the commissioner shall allocate $750,000 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall allocate this amount among cities on a per capita basis. Allocations made under this subdivision may be used for tax reductions under section 469.171, or for other offsets of taxes imposed on or remitted by businesses located in the enterprise zone, but only if the municipality determines that the granting of the tax reduction or offset is necessary to retain a business within or attract a business to the zone. The city alternatively may elect to use any portion of the allocation under this paragraph for tax reductions under section 469.1732 or 469.1734.\n(b) The commissioner shall allocate $750,000 for tax reductions under section 469.1732 or 469.1734 to cities with border city enterprise zones located on the western border of the state. The commissioner shall allocate this amount among the cities on a per capita basis. The city alternatively may elect to use any portion of the allocation provided in this paragraph for tax reductions under section 469.171.\n(a) In addition to the tax reductions authorized in subdivisions 12 to 19, the commissioner shall allocate $3,000,000 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall allocate this amount among cities on a per capita basis. Allocations under this subdivision may be used for tax reductions under sections 469.171, 469.1732, and 469.1734, or for other offsets of taxes imposed on or remitted by businesses located in the enterprise zone, but only if the municipality determines that the granting of the tax reduction or offset is necessary to retain a business within or attract a business to the zone.\n(b) The allocations under this subdivision do not cancel or expire, but remain available until used by the city.\n(a) In addition to the tax reductions authorized in subdivisions 12 to 20, the commissioner shall annually allocate $750,000 for tax reductions to border city enterprise zones in cities located on the western border of the state. The commissioner shall allocate this amount among cities on a per capita basis. Allocations made under this subdivision may be used for tax reductions under sections 469.171, 469.1732, and 469.1734, or for other offsets of taxes imposed on or remitted by businesses located in the enterprise zone as provided by law, but only if the municipality determines that the granting of the tax reduction or offset is necessary to retain a business within or attract a business to the zone.\n(b) The allocations under this subdivision do not cancel or expire, but remain available until used by the city.",
	"repealed": false
}