{
	"id": "475.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.73",
	"title": "475.73 STATE BOARD OF INVESTMENT.",
	"text": "Obligations sold under the provisions of section 475.60 may be purchased by the State Board of Investment if the obligations meet the requirements of section 11A.24, subdivision 2, upon the approval of the attorney general as to form and execution of the application therefor, and under rules as the board may specify, and the state board shall have authority to purchase the same to an amount not exceeding 3.63 percent of the estimated market value of the taxable property of the municipality, according to the last preceding assessment. The obligations shall not run for a shorter period than one year, nor for a longer period than 30 years and shall bear interest at a rate to be fixed by the state board but not less than two percent per annum. Forthwith upon the delivery to the state of Minnesota of any obligations issued by virtue thereof, the commissioner of management and budget shall certify to the respective auditors of the various counties wherein are situated the municipalities issuing the same, the number, denomination, amount, rate of interest and date of maturity of each obligation.\nThe annual tax levy for the payment of principal and interest on account of such obligations shall be for an amount 50 percent in excess of the sum to be paid therefrom. The state auditor, at the time of certifying the state tax, shall also certify to each county auditor the amount necessary to pay such principal and interest. When collected so much of such tax as may be necessary shall be paid into the state treasury. The excess remaining shall be held over in the county treasury to be applied on the next future payment due on such obligations, and the amount of such excess shall be reported by the county auditor to the state auditor on or before August first each year, who shall deduct the same from the next annual tax levy for such purpose. The remainder, when such bonds are paid in full, shall be credited to the general fund of the municipality; and, in case a portion of the territory embraced in such municipality at the time such obligations were issued, has since been set off to another municipality, such remainder shall be divided with such other municipality, using as a basis for such division the last net tax capacity of the territory affected by such obligations. Any such municipality which shall make payment to the state of the full amount of principal and interest due on account of such obligations prior to the extending of such tax therefor by the state auditor shall be exempt from the provisions of this section.",
	"repealed": false
}