{
	"id": "326B.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.44",
	"title": "326B.44 LOCAL REGULATIONS.",
	"text": "Any of the following entities may, by ordinance, adopt local regulations providing for plumbing permits, approval of plans and specifications, and inspections of plumbing, which regulations are not in conflict with the plumbing code: any city having a system of waterworks or sewerage, regardless of population; any town having a population of 5,000 or more according to the last federal census, exclusive of any statutory cities located therein; and the Metropolitan Airports Commission. No such entity shall prohibit plumbing contractors licensed by the commissioner from engaging in or working at the business of plumbing, except cities and statutory cities which, prior to April 21, 1933, by ordinance required the licensing of plumbers. No such entity shall require any person who engages in the business of plumbing to post a bond as a prerequisite for engaging in the business of plumbing, except the bond to the state required under section 326B.46 and except any performance bond required under a contract with the person for the performance of plumbing work for the entity. No such entity shall require any person who engages in the business of plumbing to maintain public liability insurance as a prerequisite for engaging in the business of plumbing, except the insurance required under section 326B.46 and except any public liability insurance required under a contract with the person for the performance of plumbing work for the entity. No city or town may require a license for persons performing building sewer or water service installation who have completed pipe laying training as prescribed by the commissioner of labor and industry. Any city by ordinance may prescribe regulations, reasonable standards, and inspections and grant permits to any person engaged in the business of installing water softeners, who is not licensed as a contractor by the commissioner, to connect water softening and water filtering equipment to private residence water distribution systems, where provision has been previously made therefor and openings left for that purpose or by use of cold water connections to a domestic water heater; where it is not necessary to rearrange, make any extension or alteration of, or addition to any pipe, fixture or plumbing connected with the water system except to connect the water softener, and provided the connections so made comply with minimum standards prescribed by the Plumbing Board.",
	"repealed": false
}