{
	"id": "103B.314",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.314",
	"title": "103B.314 CONTENTS OF PLAN.",
	"text": "Each plan must have an executive summary, including:\n(1) the purpose of the local water management plan;\n(2) a description of the priority concerns to be addressed by the plan;\n(3) a summary of goals and actions to be taken along with the projected total cost of the implementation program;\n(4) a summary of the consistency of the plan with other pertinent local, state, and regional plans and controls, and where inconsistencies are noted; and\n(5) a summary of recommended amendments to other plans and official controls to achieve consistency.\nFor each priority concern defined pursuant to section 103B.312, clause (1), the plan shall analyze relevant data, plans, and policies provided by agencies consistent with section 103B.313, subdivision 6, and describe the magnitude of the concern, including how the concern is impacting or changing the local land and water resources.\nEach plan must contain specific measurable goals and objectives relating to the priority concerns and other state, regional, or local concerns. The goals and objectives must coordinate and attempt to resolve conflict with city, county, regional, or state goals and policies.\n(a) For the measurable goals identified in subdivision 3, each plan must include an implementation program that includes the items described in paragraphs (b) to (e).\n(b) An implementation program may include actions involving, but not limited to, data collection programs, educational programs, capital improvement projects, project feasibility studies, enforcement strategies, amendments to existing official controls, and adoption of new official controls. If the local government finds that no actions are necessary to address the goals and objectives identified in subdivision 3 it must explain why actions are not needed. Staff and financial resources available or needed to carry out the local water management plan must be stated.\n(c) The implementation schedule must state the time in which each of the actions contained in the implementation program will be taken.\n(d) If a local government unit has made any agreement for the implementation of the plan or portions of a plan by another local unit of government, that local unit must be specified, the responsibility indicated, and a description included indicating how and when the implementation will happen.\n(e) If capital improvement projects are proposed to implement the local water management plan, the projects must be described in the plan. The description of a proposed capital improvement project must include the following information:\n(1) the physical components of the project, including their approximate size, configuration, and location;\n(2) the purposes of the project and relationship to the objectives in the plan;\n(3) the proposed schedule for project construction;\n(4) the expected federal, state, and local costs;\n(5) the types of financing proposed, such as special assessments, ad valorem taxes, and grants; and\n(6) the sources of local financing proposed.\nThe plan must also describe the actions that will be taken to carry out the responsibilities or activities, identify the lead and supporting organizations or government units that will be involved in carrying out the action, and estimate the cost of each action.\n(a) The plan authority may initiate an amendment to the local water management plan by submitting a petition to the board and sending copies of the proposed amendment and the date of the public hearing to the following entities for review: local government units defined in section 103B.305, subdivision 5, that are within the plan's jurisdiction; and the state review agencies.\n(b) After the public hearing the board shall review the amendment pursuant to section 103B.315, subdivision 5, paragraphs (b) and (c). The amendment becomes part of the local water management plan after being approved by the board. The board must send the order and the approved amendment to the entities that received the proposed amendment and notice of the public hearing.",
	"repealed": false
}