{
	"id": "148E.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.52",
	"title": "148E.52 OVERSIGHT, DISPUTE RESOLUTION, AND ENFORCEMENT.",
	"text": "(a) Oversight:\n(1) The executive and judicial branches of state government in each member state shall enforce this Compact and take all actions necessary and appropriate to implement the Compact.\n(2) Except as otherwise provided in this Compact, venue is proper and judicial proceedings by or against the Commission shall be brought solely and exclusively in a court of competent jurisdiction where the principal office of the Commission is located. The Commission may waive venue and jurisdictional defenses to the extent it adopts or consents to participate in alternative dispute resolution proceedings. Nothing herein shall affect or limit the selection or propriety of venue in any action against a licensee for professional malpractice, misconduct, or any such similar matter.\n(3) The Commission shall be entitled to receive service of process in any proceeding regarding the enforcement or interpretation of the Compact and shall have standing to intervene in such a proceeding for all purposes. Failure to provide the Commission service of process shall render a judgment or order void as to the Commission, this Compact, or promulgated rules.\n(b) Default, technical assistance, and termination:\n(1) If the Commission determines that a member state has defaulted in the performance of its obligations or responsibilities under this Compact or the promulgated rules, the Commission shall provide written notice to the defaulting state. The notice of default shall describe the default, the proposed means of curing the default, and any other action that the Commission may take, and shall offer training and specific technical assistance regarding the default.\n(2) The Commission shall provide a copy of the notice of default to the other member states.\n(c) If a state in default fails to cure the default, the defaulting state may be terminated from the Compact upon an affirmative vote of a majority of the delegates of the member states, and all rights, privileges, and benefits conferred on that state by this Compact may be terminated on the effective date of termination. A cure of the default does not relieve the offending state of obligations or liabilities incurred during the period of default.\n(d) Termination of membership in the Compact shall be imposed only after all other means of securing compliance have been exhausted. Notice of intent to suspend or terminate shall be given by the Commission to the governor, the majority and minority leaders of the defaulting state's legislature, the defaulting state's state licensing authority, and each of the member states' state licensing authority.\n(e) A state that has been terminated is responsible for all assessments, obligations, and liabilities incurred through the effective date of termination, including obligations that extend beyond the effective date of termination.\n(f) Upon the termination of a state's membership from this Compact, that state shall immediately provide notice to all licensees within that state of such termination. The terminated state shall continue to recognize all licenses granted pursuant to this Compact for a minimum of six months after the date of said notice of termination.\n(g) The Commission shall not bear any costs related to a state that is found to be in default or that has been terminated from the Compact, unless agreed upon in writing between the Commission and the defaulting state.\n(h) The defaulting state may appeal the action of the Commission by petitioning the United States District Court for the District of Columbia or the federal district where the Commission has its principal offices. The prevailing party shall be awarded all costs of such litigation, including reasonable attorney fees.\n(i) Dispute resolution:\n(1) Upon request by a member state, the Commission shall attempt to resolve disputes related to the Compact that arise among member states and between member and nonmember states.\n(2) The Commission shall promulgate a rule providing for both mediation and binding dispute resolution for disputes as appropriate.\n(j) Enforcement:\n(1) By majority vote as provided by rule, the Commission may initiate legal action against a member state in default in the United States District Court for the District of Columbia or the federal district where the Commission has its principal offices to enforce compliance with the provisions of the Compact and its promulgated rules. The relief sought may include both injunctive relief and damages. In the event judicial enforcement is necessary, the prevailing party shall be awarded all costs of such litigation, including reasonable attorney fees. The remedies herein shall not be the exclusive remedies of the Commission. The Commission may pursue any other remedies available under federal or the defaulting member state's law.\n(2) A member state may initiate legal action against the Commission in the United States District Court for the District of Columbia or the federal district where the Commission has its principal offices to enforce compliance with the provisions of the Compact and its promulgated rules. The relief sought may include both injunctive relief and damages. In the event judicial enforcement is necessary, the prevailing party shall be awarded all costs of such litigation, including reasonable attorney fees.\n(3) No person other than a member state shall enforce this compact against the Commission.",
	"repealed": false
}