{
	"id": "245I.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.011",
	"title": "245I.011 APPLICABILITY.",
	"text": "A license holder under this chapter must comply with the requirements in chapters 245A, 245C, and 260E; section 626.557; and Minnesota Rules, chapter 9544.\n(a) The commissioner may grant a variance to an applicant, license holder, or certification holder as long as the variance does not affect the staff qualifications or the health or safety of any person in a licensed or certified program and the applicant, license holder, or certification holder meets the following conditions:\n(1) an applicant, license holder, or certification holder must request the variance on a form approved by the commissioner and in a manner prescribed by the commissioner;\n(2) the request for a variance must include the:\n(i) reasons that the applicant, license holder, or certification holder cannot comply with a requirement as stated in the law; and\n(ii) alternative equivalent measures that the applicant, license holder, or certification holder will follow to comply with the intent of the law; and\n(3) the request for a variance must state the period of time when the variance is requested.\n(b) The commissioner may grant a permanent variance when the conditions under which the applicant, license holder, or certification holder requested the variance do not affect the health or safety of any person whom the licensed or certified program serves, and when the conditions of the variance do not compromise the qualifications of staff who provide services to clients. A permanent variance expires when the conditions that warranted the variance change in any way. Any applicant, license holder, or certification holder must inform the commissioner of any changes to the conditions that warranted the permanent variance. If an applicant, license holder, or certification holder fails to advise the commissioner of changes to the conditions that warranted the variance, the commissioner must revoke the permanent variance and may impose other sanctions under sections 245A.06 and 245A.07.\n(c) The commissioner's decision to grant or deny a variance request is final and not subject to appeal under the provisions of chapter 14.\n(a) An individual, organization, or government entity that is exempt from licensure under section 245A.03, subdivision 2, paragraph (a), clause (12), and chooses to be identified as a certified mental health clinic must:\n(1) be a mental health clinic that is certified under section 245I.20;\n(2) comply with all of the responsibilities assigned to a license holder by this chapter except subdivision 1; and\n(3) comply with all of the responsibilities assigned to a certification holder by chapter 245A.\n(b) An individual, organization, or government entity described by this subdivision must obtain a criminal background study for each staff person or volunteer who provides direct contact services to clients.\n(c) If a clinic is certified according to this chapter and is part of a certified community behavioral health clinic under section 245.735, the license holder must comply with the requirements in section 245.735, subdivisions 4b to 4e, as part of the licensing requirements under this chapter.\nAn individual, organization, or government entity providing intensive residential treatment services or residential crisis stabilization to adults must be licensed under section 245I.23. An entity with an adult foster care license providing residential crisis stabilization is exempt from licensure under section 245I.23.\n(a) An individual, organization, or government entity certified under the following sections must comply with all of the responsibilities assigned to a license holder under this chapter except subdivision 1:\n(1) an assertive community treatment provider under section 256B.0622, subdivision 3a;\n(2) an adult rehabilitative mental health services provider under section 256B.0623;\n(3) a mobile crisis team under section 256B.0624;\n(4) a children's therapeutic services and supports provider under section 256B.0943;\n(5) a children's intensive behavioral health services provider under section 256B.0946; and\n(6) an intensive nonresidential rehabilitative mental health services provider under section 256B.0947.\n(b) An individual, organization, or government entity certified under the sections listed in paragraph (a), clauses (1) to (6), must obtain a criminal background study for each staff person and volunteer providing direct contact services to a client.",
	"repealed": false
}