{
	"id": "334.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/334.011",
	"title": "334.011 RATES OF INTEREST; BUSINESS AND AGRICULTURAL LOANS.",
	"text": "Notwithstanding the provisions of any law to the contrary a person may, in the case of a contract for the loan or forbearance of money, goods, or other things in action in an amount of less than $100,000 for business or agricultural purposes, charge interest at a rate of not more than 4-1/2 percent in excess of the discount rate on 90-day commercial paper in effect at the Federal Reserve Bank in the Federal Reserve District encompassing Minnesota.\nFor the purposes of this subdivision, the term \"business\" means a commercial or industrial enterprise which is carried on for the purpose of active or passive investment or profit.\nFor the purposes of this subdivision, the term \"agricultural\" means the production, harvest, exhibition, marketing, transportation, processing, or manufacture of agricultural products, including horticultural, viticultural, and dairy products, livestock, wildlife, poultry, bees, forest products, fish and shellfish, and any parts thereof, including processed and manufactured products, and any and all products raised or produced on farms and any processed or manufactured products thereof.\nNo loan shall be made pursuant to this subdivision if the proceeds of the loan are used to finance the purchase or maintenance of real estate used principally for the borrower's residence.\nIf a greater rate of interest than that permitted by subdivision 1 is charged then the entire interest due on that note, bill or other evidence of debt is forfeited. If the greater rate of interest has been paid, the person who paid it may recover in a civil action an amount equal to twice the amount of interest paid.\nIf the rate of interest charged is permitted by this section at the time the loan was made, that rate of interest does not later become usurious because of a fluctuation in the federal discount rate.\n[Repealed, 1993 c 13 art 1 s 36]\n(a) This subdivision applies to nonprofit charitable organizations recognized as exempt from federal income taxation under section 501(c)(3) of the federal Internal Revenue Code of 1986, as amended, that make loans for business purposes to individuals who are disadvantaged or otherwise unable to access standard sources of business credit, in conjunction with a program of education, training, business counseling, or other assistance to assist borrowers in developing their businesses at no extra charge to the borrowers or at a charge that does not exceed the cost of providing the assistance.\n(b) Notwithstanding section 334.01 and subdivisions 1 and 2, an organization described in paragraph (a) may make loans described in that paragraph, in principal amounts not to exceed $10,000, at a rate of interest not to exceed 16 percent per year, and with an origination fee not to exceed two percent of the principal amount.\n(c) Prior to beginning to make loans under this subdivision, the lender shall provide written notice to the commissioner of commerce, on a form prescribed by that commissioner. The lender shall at the same time provide a copy of that written notice to the commissioner of employment and economic development.\n(d) A lender making loans under this subdivision shall annually file with the commissioner an annual report, on a date and on a form prescribed by the commissioner, summarizing the lender's loans made or outstanding in this state during the preceding year. The lender shall at the same time provide a copy of that annual report to the commissioner of employment and economic development.",
	"repealed": false
}