{
	"id": "62A.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.421",
	"title": "62A.421 DEMONSTRATION PROJECTS.",
	"text": "The commissioner may establish demonstration projects to allow an issuer of Medicare supplement policies to extend coverage to individuals enrolled in part A or part B, or both, of the Medicare program, Title XVIII of the Social Security Act, United States Code, title 42, section 1395, et seq. For purposes of this section, the commissioner may waive compliance with the benefits described in sections 62A.315 and 62A.316 and other applicable statutes and rules if there is reasonable evidence that the statutes or rules prohibit the operation of the demonstration project, but may not waive the six-month guaranteed issue provision. The commissioner shall provide for public comment before any statute or rule is waived.\nA demonstration project must provide health benefits equal to or exceeding the level of benefits provided in Title XVIII of the Social Security Act and an out-of-hospital prescription drug benefit. The out-of-hospital prescription drug benefit may be waived by the commissioner if the issuer presents evidence satisfactory to the commissioner that the inclusion of the benefit would restrict the operation of the demonstration project.\nAn issuer electing to participate in a demonstration project shall apply to the commissioner for approval on a form developed by the commissioner. The application shall include at least the following:\n(1) a statement identifying the population that the project is designed to serve;\n(2) a description of the proposed project including a statement projecting a schedule of costs and benefits for the policyholder;\n(3) reference to the sections of Minnesota Statutes and Department of Commerce rules for which waiver is requested;\n(4) evidence that application of the requirements of applicable Minnesota Statutes and Department of Commerce rules would, unless waived, prohibit the operation of the demonstration project;\n(5) an estimate of the number of years needed to adequately demonstrate the project's effects; and\n(6) other information the commissioner may reasonably require.\nThe commissioner shall approve, deny, or refer back to the issuer for modification, the application for a demonstration project within 60 days of the receipt of a complete application.\nThe commissioner may approve an application for a demonstration project for a period of six years, with an option to renew.\nEach issuer for which a demonstration project is approved shall annually file a report with the commissioner summarizing the project's experience at the same time it files its annual report. The report shall be on a form developed by the commissioner and shall be separate from the annual report.\nThe commissioner may rescind approval of a demonstration project if the commissioner makes any of the findings listed in section 60A.052 or 62D.15, subdivision 1, with respect to the project for which it has not been granted a specific exemption, or if the commissioner finds that the project's operation is contrary to the information contained in the approved application.",
	"repealed": false
}