{
	"id": "46A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/46A.08",
	"title": "46A.08 CONFIDENTIALITY.",
	"text": "(a) Any documents, materials, or other information in the control or possession of the department that are furnished by a licensee or a licensee's employee or agent acting on behalf of a financial institution pursuant to section 46A.06 or that are obtained by the commissioner in an investigation or examination pursuant to section 46A.07: (1) are classified as confidential, protected nonpublic, or both; (2) are not subject to subpoena; and (3) are not subject to discovery or admissible in evidence in any private civil action.\n(b) Notwithstanding paragraph (a), clauses (1) to (3), the commissioner is authorized to use the documents, materials, or other information in the furtherance of any regulatory or legal action brought as a part of the commissioner's duties.\nNeither the commissioner nor any person who received documents, materials, or other information while acting under the authority of the commissioner is permitted or required to testify in a private civil action concerning confidential documents, materials, or information subject to subdivision 1.\nIn order to assist in the performance of the commissioner's duties under sections 46A.01 to 46A.08, the commissioner may:\n(1) share documents, materials, or other information, including the confidential and privileged documents, materials, or information subject to subdivision 1, with other state, federal, and international regulatory agencies, with the Conference of State Bank Supervisors, the Conference of State Bank Supervisors' affiliates or subsidiaries, and with state, federal, and international law enforcement authorities, provided that the recipient agrees in writing to maintain the confidentiality and privileged status of the document, material, or other information;\n(2) receive documents, materials, or information, including otherwise confidential and privileged documents, materials, or information, from the Conference of State Bank Supervisors, the Conference of State Bank Supervisors' affiliates or subsidiaries, and from regulatory and law enforcement officials of other foreign or domestic jurisdictions, and must maintain as confidential or privileged any document, material, or information received with notice or the understanding that the document, material, or information is confidential or privileged under the laws of the jurisdiction that is the source of the document, material, or information;\n(3) share documents, materials, or other information subject to subdivision 1 with a third-party consultant or vendor, provided the consultant agrees in writing to maintain the confidentiality and privileged status of the document, material, or other information; and\n(4) enter into agreements governing the sharing and use of information that are consistent with this subdivision.\n(a) The disclosure of documents, materials, or information to the commissioner under this section or as a result of sharing as authorized in subdivision 3 does not result in a waiver of any applicable privilege or claim of confidentiality in the documents, materials, or information.\n(b) A document, material, or information disclosed to the commissioner under this section about a cybersecurity event must be retained and preserved by the financial institution for five years.\nNothing in sections 46A.01 to 46A.08 prohibits the commissioner from releasing final, adjudicated actions that are open to public inspection pursuant to chapter 13 to a database or other clearinghouse service maintained by the Conference of State Bank Supervisors, the Conference of State Bank Supervisors' affiliates, or the Conference of State Bank Supervisors' subsidiaries.\nDocuments, materials, or other information in the possession or control of the Conference of State Bank Supervisors or a third-party consultant pursuant to sections 46A.01 to 46A.08: (1) are classified as confidential, protected nonpublic, and privileged; (2) are not subject to subpoena; and (3) are not subject to discovery or admissible in evidence in a private civil action.",
	"repealed": false
}