{
	"id": "260C.178",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.178",
	"title": "260C.178 EMERGENCY REMOVAL HEARING.",
	"text": "(a) If a child was taken into custody under section 260C.175, subdivision 1, clause (1) or (2), item (ii), the court shall hold a hearing within 72 hours of the time that the child was taken into custody, excluding Saturdays, Sundays, and holidays, to determine whether the child should continue to be in custody.\n(b) Unless there is reason to believe that the child would endanger self or others or not return for a court hearing, or that the child's health or welfare would be immediately endangered, the child shall be released to the custody of a parent, guardian, custodian, or other suitable person, subject to reasonable conditions of release including, but not limited to, a requirement that the child undergo a chemical use assessment as provided in section 260C.157, subdivision 1.\n(c) If the court determines that there is reason to believe that the child would endanger self or others or not return for a court hearing, or that the child's health or welfare would be immediately endangered if returned to the care of the parent or guardian who has custody and from whom the child was removed, the court shall order the child:\n(1) into the care of the child's noncustodial parent and order the noncustodial parent to comply with any conditions that the court determines appropriate to ensure the safety and care of the child, including requiring the noncustodial parent to cooperate with paternity establishment proceedings if the noncustodial parent has not been adjudicated the child's father; or\n(2) into foster care as defined in section 260C.007, subdivision 18, under the legal responsibility of the responsible social services agency or responsible probation or corrections agency for the purposes of protective care as that term is used in the juvenile court rules. The court shall not give the responsible social services legal custody and order a trial home visit at any time prior to adjudication and disposition under section 260C.201, subdivision 1, paragraph (a), clause (3), but may order the child returned to the care of the parent or guardian who has custody and from whom the child was removed and order the parent or guardian to comply with any conditions the court determines to be appropriate to meet the safety, health, and welfare of the child.\n(d) In determining whether the child's health or welfare would be immediately endangered, the court shall consider whether the child would reside with a perpetrator of domestic child abuse.\n(e) The court, before determining whether a child should be placed in or continue in foster care under the protective care of the responsible agency, shall also make a determination, consistent with section 260.012 as to whether reasonable efforts were made to prevent placement or whether reasonable efforts to prevent placement are not required. In the case of an Indian child, the court shall determine whether active efforts, according to section 260.762 and the Indian Child Welfare Act of 1978, United States Code, title 25, section 1912(d), were made to prevent placement. The court shall enter a finding that the responsible social services agency has made reasonable efforts to prevent placement when the agency establishes either:\n(1) that the agency has actually provided services or made efforts in an attempt to prevent the child's removal but that such services or efforts have not proven sufficient to permit the child to safely remain in the home; or\n(2) that there are no services or other efforts that could be made at the time of the hearing that could safely permit the child to remain home or to return home. The court shall not make a reasonable efforts determination under this clause unless the court is satisfied that the agency has sufficiently demonstrated to the court that there were no services or other efforts that the agency was able to provide at the time of the hearing enabling the child to safely remain home or to safely return home. When reasonable efforts to prevent placement are required and there are services or other efforts that could be ordered that would permit the child to safely return home, the court shall order the child returned to the care of the parent or guardian and the services or efforts put in place to ensure the child's safety. When the court makes a prima facie determination that one of the circumstances under paragraph (g) exists, the court shall determine that reasonable efforts to prevent placement and to return the child to the care of the parent or guardian are not required.\n(f) If the court finds the social services agency's preventive or reunification efforts have not been reasonable but further preventive or reunification efforts could not permit the child to safely remain at home, the court may nevertheless authorize or continue the removal of the child.\n(g) The court may not order or continue the foster care placement of the child unless the court makes explicit, individualized findings that continued custody of the child by the parent or guardian would be contrary to the welfare of the child and that placement is in the best interest of the child.\n(h) At the emergency removal hearing, or at any time during the course of the proceeding, and upon notice and request of the county attorney, the court shall determine whether a petition has been filed stating a prima facie case that:\n(1) the parent has subjected a child to egregious harm as defined in section 260C.007, subdivision 14;\n(2) the parental rights of the parent to another child have been involuntarily terminated;\n(3) the child is an abandoned infant under section 260C.301, subdivision 2, paragraph (a), clause (2);\n(4) the parents' custodial rights to another child have been involuntarily transferred to a relative under a juvenile protection proceeding or a similar process of another jurisdiction;\n(5) the parent has committed sexual abuse as defined in section 260E.03, against the child or another child of the parent;\n(6) the parent has committed an offense that requires registration as a predatory offender under section 243.166, subdivision 1b, paragraph (a) or (b); or\n(7) the provision of services or further services for the purpose of reunification is futile and therefore unreasonable.\n(i) When a petition to terminate parental rights is required under section 260C.301, subdivision 4, or 260C.503, subdivision 2, but the county attorney has determined not to proceed with a termination of parental rights petition, and has instead filed a petition to transfer permanent legal and physical custody to a relative under section 260C.507, the court shall schedule a permanency hearing within 30 days of the filing of the petition.\n(j) If the county attorney has filed a petition under section 260C.307, the court shall schedule a trial under section 260C.163 within 90 days of the filing of the petition except when the county attorney determines that the criminal case shall proceed to trial first under section 260C.503, subdivision 2, paragraph (c).\n(k) If the court determines the child should be ordered into foster care and the child's parent refuses to give information to the responsible social services agency regarding the child's father or relatives of the child, the court may order the parent to disclose the names, addresses, telephone numbers, and other identifying information to the responsible social services agency for the purpose of complying with sections 260C.150, 260C.151, 260C.212, 260C.215, 260C.219, and 260C.221.\n(l) If a child ordered into foster care has siblings, whether full, half, or step, who are also ordered into foster care, the court shall inquire of the responsible social services agency of the efforts to place the children together as required by section 260C.212, subdivision 2, paragraph (d), if placement together is in each child's best interests, unless a child is in placement for treatment or a child is placed with a previously noncustodial parent who is not a parent to all siblings. If the children are not placed together at the time of the hearing, the court shall inquire at each subsequent hearing of the agency's reasonable efforts to place the siblings together, as required under section 260.012. If any sibling is not placed with another sibling or siblings, the agency must develop a plan to facilitate visitation or ongoing contact among the siblings as required under section 260C.212, subdivision 1, unless it is contrary to the safety or well-being of any of the siblings to do so.\n(m) When the court has ordered the child into the care of a noncustodial parent or in foster care, the court may order a chemical dependency evaluation, mental health evaluation, medical examination, and parenting assessment for the parent as necessary to support the development of a plan for reunification required under subdivision 7 and section 260C.212, subdivision 1, or the child protective services plan under section 260E.26, and Minnesota Rules, part 9560.0228.\n(n) When the court has ordered an Indian child into an emergency child placement, the Indian child shall be placed according to the placement preferences in the Minnesota Indian Family Preservation Act, section 260.773.\n[Repealed by amendment, 2005 c 159 art 2 s 15]\n(a) If a child has been taken into custody under section 260C.151, subdivision 5, or 260C.175, subdivision 1, clause (2), item (ii), and the court determines that the child should continue in foster care, the court shall include in its order notice that the responsible social services agency has a duty to develop and implement a plan for parental visitation of and contact with the child that promotes the parent and child relationship unless the court finds that visitation would endanger the child's physical or emotional well-being.\n(b) Unless the court finds that visitation would endanger the child's physical or emotional well-being or unless paragraph (c) or (d) apply, the plan for parental visitation required under section 260C.212, subdivision 1, paragraph (c), clause (5), must be developed and implemented by the agency and the child's parents as soon as possible after the court's order for the child to continue in foster care.\n(c) When a parent has had no or only limited visitation or contact with the child prior to the court order for the child to continue in foster care, the court may order a visitation plan developed and implemented while the agency conducts the assessment of the parent's ability to provide day-to-day care for the child required under section 260C.219.\n(d) When it is in the best interests of the child, the agency may ask the court to defer its duty to develop a visitation plan between a putative father and the child until the paternity status of the child's father is adjudicated or until there is a positive test result under section 257.62, subdivision 5.\n(e) The visitation plan developed under this subdivision is the same visitation plan required under section 260C.212, subdivision 1, paragraph (c), clause (5).\n(a) Except as provided in paragraph (b), a child who is ordered placed in foster care as an alleged victim of child abuse as defined in section 630.36, subdivision 2, may not be given mental health treatment specifically for the effects of the alleged abuse until the court finds that there is a prima facie basis to believe the abuse has occurred.\n(b) A child described in paragraph (a) may be given mental health treatment prior to a prima facie finding of child abuse if the treatment is either agreed to by the child's parent or guardian in writing, or ordered by the court according to the standard contained in section 260C.201, subdivision 1.\nCopies of the court's order shall be served upon the parties, including the placement facility, which shall release the child or continue to hold the child as the court orders.\nWhen the court's order is served upon these parties, notice shall also be given to the parties of the subsequent reviews provided by subdivision 6.\nWhen a child is placed in foster care, the child's placement shall be periodically reviewed as required under the juvenile court rules including notice to the parties required to be served with a copy of the order under subdivision 4.\nA hearing shall be held at the request of any one of the parties notified pursuant to subdivision 5, if that party notifies the court of a wish to present to the court new evidence concerning whether the child should be continued in detention or notifies the court of a wish to present an alternate placement arrangement to provide for the safety and protection of the child.\nIn addition, if a child was taken into custody under section 260C.151, subdivision 5, or 260C.175, subdivision 1, clause (2), item (ii), and is placed in foster care or placed in another facility under a court order issued under subdivision 2, the court shall schedule and hold an adjudicatory hearing on the petition within 60 days of the emergency removal hearing upon the request of any party to the proceeding. However, if good cause is shown by a party to the proceeding why the hearing should not be held within that time period, the hearing shall be held within 90 days, unless the parties agree otherwise and the court so orders.\n(a) When the court has ordered the child into the care of a parent under subdivision 1, paragraph (c), clause (1), the child protective services plan under section 260E.26 must be filed within 30 days of the filing of the juvenile protection petition under section 260C.141, subdivision 1.\n(b) When the court orders the child into foster care under subdivision 1, paragraph (c), clause (2), and not into the care of a parent, an out-of-home placement plan required under section 260C.212 must be filed with the court within 30 days of the filing of a juvenile protection petition under section 260C.141, subdivision 1, when the court orders emergency removal of the child under this section, or filed with the petition if the petition is a review of a voluntary placement under section 260C.141, subdivision 2.\n(c) Upon the filing of the child protective services plan under section 260E.26 or out-of-home placement plan that has been developed jointly with the parent and in consultation with others as required under section 260C.212, subdivision 1, the court may approve implementation of the plan by the responsible social services agency based on the allegations contained in the petition and any evaluations, examinations, or assessments conducted under subdivision 1, paragraph (m). The court shall send written notice of the approval of the child protective services plan or out-of-home placement plan to all parties and the county attorney or may state such approval on the record at a hearing. A parent may agree to comply with the terms of the plan filed with the court.\n(d) The responsible social services agency shall make reasonable efforts to engage both parents of the child in case planning. The responsible social services agency shall report the results of its efforts to engage the child's parents in the child protective services plan or out-of-home placement plan filed with the court. The agency shall notify the court of the services it will provide or efforts it will attempt under the plan notwithstanding the parent's refusal to cooperate or disagreement with the services. The parent may ask the court to modify the plan to require different or additional services requested by the parent, but which the agency refused to provide. The court may approve the plan as presented by the agency or may modify the plan to require services requested by the parent. The court's approval must be based on the content of the petition.\n(e) Unless the parent agrees to comply with the terms of the child protective services plan or out-of-home placement plan, the court may not order a parent to comply with the provisions of the plan until the court finds the child is in need of protection or services and orders disposition under section 260C.201, subdivision 1. However, the court may find that the responsible social services agency has made reasonable efforts for reunification if the agency makes efforts to implement the terms of the child protective services plan or out-of-home placement plan approved under this section.",
	"repealed": false
}