{
	"id": "277.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/277.23",
	"title": "277.23 CONFESSION OF JUDGMENT FOR HOMESTEAD.",
	"text": "The owner or another person having an interest in a manufactured home classified and taxed as a homestead may confess judgment and pay the delinquent personal property tax on the manufactured home in installments in the general manner provided in section 279.37 for real property tax. The provisions of section 279.37 apply to these confessions of judgment and installment payments, except as otherwise provided in this section. A down payment must be tendered of 20 percent of the amount of taxes, costs, penalty, and interest accrued to the date of tender. The balance of the judgment must be paid in four equal annual installments, plus interest on the unpaid balance as provided in this chapter.\nThe confession of judgment must be substantially in the following form:\n\"To the court administrator of the district court of ........ county:\nName of taxpayer: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nLocation of manufactured home (county): ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nDescription of property: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nI am the owner of the manufactured home described above.\nI offer to confess judgment on the following amount of the delinquent taxes on the property named above:\nAmount to be paid: $.........\nI direct the court to enter judgment for that amount.\nI waive all irregularities in the tax proceedings affecting these taxes, and I waive any defense or objection I may have to them.\nI agree to pay 20 percent of the total amount now.\nAmount paid now: $.........\nI agree to pay the balance of the amount in four equal annual installments. I agree to pay each installment on or before December 31 of each year after the year in which I file this form.\nI agree to pay interest as provided in Minnesota Statutes, chapter 277. I agree that the interest is payable annually on the installments remaining unpaid.\nI agree to pay current taxes each year before they become delinquent, unless I contest the taxes under Minnesota Statutes, chapter 277. If I do contest them, I agree to pay the amount decided by the Tax Court within 30 days after the court enters its final judgment in the proceedings.\nUpon receipt of the signed confession of judgment and the required payment, the county treasurer shall file the confession of judgment with the court administrator of the district court. When entered by the court administrator, the judgment has the same force and effect of other civil judgments in personam.\nThe county treasurer shall give notice by mail before December 1 of each year to the person making a confession of judgment at the address given in it of the payment due under the confession on the following December 31. If the county treasurer has not received the installment payment by December 31, the treasurer shall give notice by certified mail at the last known address of the person making the confession of judgment, without regard to the county or state of the person's residency. This notice must state that the property is subject to levy and sale if payment is not made for the preceding December 31 within 60 days. Failure to send or receive the notice does not postpone any payment or excuse any default under the confession of judgment. Proof of mailing must be made by the certificate of the county treasurer filed in the treasurer's office.\nThe party making a confession of judgment shall pay the county treasurer a fee as set by the county board to defray the costs of processing the confession of judgment and making the annual billings required. Fees as set by the county board must be paid to the court administrator of the court for entry of judgment and for the entry of each full or partial release of the confession of judgment. Fees must be credited to the general revenue fund of the county.",
	"repealed": false
}