{
	"id": "62N.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/62N.25",
	"title": "62N.25 COMMUNITY INTEGRATED SERVICE NETWORKS.",
	"text": "Beginning July 1, 1994, the commissioner shall accept applications for licensure as a community integrated service network under this section. Licensed community integrated service networks may begin providing health coverage to enrollees no earlier than January 1, 1995, and may begin marketing coverage to prospective enrollees upon licensure.\nTo be licensed and to operate as a community integrated service network, an applicant must satisfy the requirements of chapter 62D, and all other legal requirements that apply to entities licensed under chapter 62D, except as exempted or modified in this section. Community networks must, as a condition of licensure, comply with section 62D.04, subdivision 5. A community integrated service network that phases in its net worth over a three-year period is not required to respond to requests for proposals under section 62D.04, subdivision 5, during the first 12 months of licensure. These community networks are not prohibited from responding to requests for proposals, however, if they choose to do so during that time period. After the initial 12 months of licensure, these community networks are required to respond to the requests for proposals as required under section 62D.04, subdivision 5.\nCommunity integrated service networks are regulated and licensed by the commissioner under the same authority that applies to entities licensed under chapter 62D, except as exempted or modified under this section. All statutes or rules that apply to health maintenance organizations apply to community networks, unless otherwise specified. A cooperative organized under chapter 308A may establish a community integrated service network.\nIn addition to the requirements of section 62D.06, at least 51 percent of the members of the governing body of the community integrated service network must be residents of the community integrated service network's service area. Service area, for purposes of this subdivision, may include contiguous geographic areas outside the state of Minnesota.\nCommunity integrated service networks must offer the health maintenance organization benefit set, as defined in chapter 62D, and other laws applicable to entities regulated under chapter 62D. Community networks and chemical dependency facilities under contract with a community network shall use the assessment criteria in section 245G.05 when assessing enrollees for chemical dependency treatment.\nA community integrated service network is exempt from the deposit, reserve, and solvency requirements specified in sections 62D.041, 62D.042, and 62D.044 and shall comply instead with sections 62N.27 to 62N.32. To the extent that there are analogous definitions or procedures in chapter 62D or in rules promulgated thereunder, the commissioner shall follow those existing provisions rather than adopting a contrary approach or interpretation.\nCommunity integrated service networks are exempt from the following requirements applicable to health maintenance organizations:\n(1) conducting focused studies under Minnesota Rules, part 4685.1125;\n(2) preparing and filing, as a condition of licensure, a written quality assurance plan, and annually filing such a plan and a work plan, under Minnesota Rules, parts 4685.1110 and 4685.1130;\n(3) maintaining statistics under Minnesota Rules, part 4685.1200;\n(4) filing provider contract forms under sections 62D.03, subdivision 4, and 62D.08, subdivision 1; and\n(5) preparing and filing, as a condition of licensure, a marketing plan, and annually filing a marketing plan, under sections 62D.03, subdivision 4, paragraph (l), and 62D.08, subdivision 1.\nThe provisions of section 62D.123 are implied in every provider contract or agreement between a community integrated service network and a provider, regardless of whether those provisions are expressly included in the contract. No participating provider, agent, trustee, or assignee of a participating provider has or may maintain any cause of action against a subscriber or enrollee to collect sums owed by the community network.\nA community integrated service network may enroll enrollees in excess of 50,000 if necessary to comply with guaranteed issue or guaranteed renewal requirements of chapter 62L or section 62A.65.",
	"repealed": false
}