{
	"id": "376.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/376.56",
	"title": "376.56 TAX LEVIES AND BONDS.",
	"text": "The county board establishing or participating in establishing a nursing home under section 376.55 may annually levy a tax to pay all or its proportion of the net costs of maintenance and operation of the nursing home after taking into consideration payments received for care of residents. The board may levy an additional tax to repay the cost of acquiring, establishing, equipping, furnishing, enlarging, or adding to a county nursing home, and to pay the principal of and interest on general obligation bonds issued for that purpose.\nThe proceeds of taxes for costs of maintenance and operation shall be paid into a county nursing home fund, which, in the case of counties operating jointly, shall be kept in the treasury of the county in which the nursing home is located and spent as provided in sections 376.55 to 376.60.\nBonds issued under section 376.55, subdivision 3, may be general obligations of the county and may be issued and sold, and taxes levied for their payment as provided under chapter 475. No election shall be required to authorize the bond issue for acquiring, improving, remodeling, or replacing an existing nursing home without increasing the total number of accommodations for residents in all nursing homes in the county. The revenues of the nursing home shall also be pledged for the payment of the bonds and for any interest and premium. Part of the proceeds may be deposited in the debt service fund for the issue, to capitalize interest and create a reserve to reduce or eliminate the tax otherwise required by section 475.61 to be levied before issuing the bonds. The remaining proceeds from the sale of the bonds and any surplus funds transferred under section 376.55, subdivision 3 must be credited to and deposited in the county nursing home building fund of the county in which the nursing home is located.\nThe county treasurer of the county in which the nursing home is located shall make payments out of the county nursing home fund and county nursing home building fund on properly authenticated vouchers of the county nursing home administrative board, as provided in sections 376.58 and 376.59. The county treasurer of each county issuing general obligation bonds under subdivision 3 shall pay the bonds and interest from the county's debt service fund and be the custodian of net revenues transmitted by the administrative board for the payment of the bonds.",
	"repealed": false
}