{
	"id": "626.8436",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8436",
	"title": "626.8436 HATE OR EXTREMIST GROUPS.",
	"text": "(a) A peace officer may not join, support, advocate for, maintain membership, or participate in the activities of:\n(1) a hate or extremist group; or\n(2) a criminal gang as defined in section 609.229, subdivision 1.\n(b) This section does not apply when the conduct is sanctioned by the law enforcement agency as part of the officer's official duties.\n(a) \"Hate or extremist group\" means a group that, as demonstrated by its official statements or principles, the statements of its leaders or members, or its activities:\n(1) promotes the use of threats, force, violence, or criminal activity:\n(i) against a local, state, or federal entity, or the officials of such an entity;\n(ii) to deprive, or attempt to deprive, individuals of their civil rights under the Minnesota or United States Constitution; or\n(iii) to achieve goals that are political, religious, discriminatory, or ideological in nature;\n(2) promotes seditious activities; or\n(3) advocates for differences in the right to vote, speak, assemble, travel, or maintain citizenship based on a person's perceived race, color, creed, religion, national origin, disability, sex, sexual orientation, gender identity, public assistance status, or any protected class as defined in Minnesota Statutes or federal law.\n(b) For the purposes of this section, advocacy, membership, or participation in a hate or extremist group or criminal gang is demonstrated by:\n(1) dissemination of material that promotes:\n(i) the use of threats, force, violence, or criminal activity;\n(ii) seditious activities; or\n(iii) the objectives described in paragraph (a), clause (3);\n(2) engagement in cyber or social media posts, chats, forums, and other forms of promotion of the group's activities;\n(3) display or use of insignia, colors, tattoos, hand signs, slogans, or codes associated with the group;\n(4) direct financial or in-kind contributions to the group;\n(5) a physical or cyber presence in the group's events; or\n(6) other conduct that could reasonably be considered support, advocacy, or participation in the group's activities.",
	"repealed": false
}