{
	"id": "326.3361",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.3361",
	"title": "326.3361 TRAINING.",
	"text": "The board shall, by rule, prescribe the requirements, duration, contents, and standards for successful completion of certified training programs for license holders, qualified representatives, Minnesota managers, partners, and employees, including:\n(1) for those individuals who are armed with a firearm, training in the proper use of, and the risks and dangers arising from the use of, firearms;\n(2) for those individuals who are armed with a weapon, training in the proper use of, and the risks and dangers arising from the use of, weapons other than firearms, including, but not limited to, bludgeons, nightsticks, batons, chemical weapons, and electronic incapacitation devices, and restraint or immobilization techniques;\n(3) for those individuals who are armed with a firearm or armed with a weapon, training in first aid and alternatives to the use of force, including advantages to not using force and specifically when force should not be used;\n(4) for those individuals who are armed with a firearm or armed with a weapon, training in the legal limitations on the justifiable use of force and deadly force as specified in sections 609.06 and 609.065;\n(5) standards for weapons and equipment issued to or carried or used by those individuals;\n(6) preassignment or on-the-job training, or its equivalent, required before applicants may be certified as having completed training; and\n(7) continuing training for license holders, qualified representatives, Minnesota managers, partners, employees, individuals armed with a firearm, and individuals armed with a weapon.\nThe rules adopted by the board must require:\n(1) 12 hours of preassignment or on-the-job certified training within the first 21 days of employment, or evidence that the employee has successfully completed equivalent training before the start of employment. Notwithstanding any statute or rule to the contrary, this clause is satisfied if the employee provides a prospective employer with a certificate or a copy of a certificate demonstrating that the employee successfully completed this training prior to employment with a different Minnesota licensee and completed this training within three previous calendar years, or successfully completed this training with a Minnesota licensee while previously employed with a Minnesota licensee. The certificate or a copy of the certificate is the property of the employee who completed the training, regardless of who paid for the training or how training was provided. Upon a current or former employee's request, a current or former licensed employer must provide a copy of a certificate demonstrating the employee's successful completion of training to the current or former employee. The current or former licensed employer must not charge the employee a fee for a copy of the certificate. The employee who completed the training is entitled to access a copy of the certificate at no charge according to sections 181.960 to 181.966. A current or former employer must comply with sections 181.960 to 181.966;\n(2) certification by the board of completion of certified training for a license holder, qualified representative, Minnesota manager, partner, and employee to carry or use a firearm, a weapon other than a firearm, or an immobilizing or restraint technique; and\n(3) six hours a year of certified continuing training for all license holders, qualified representatives, Minnesota managers, partners, and employees, and an additional six hours a year for individuals who are armed with firearms or armed with weapons, which must include annual certification of the individual.\nAn individual may not carry or use a weapon while undergoing on-the-job training under this subdivision.\nThe rules must provide that no license holder, qualified representative, Minnesota manager, partner, or employee may carry or use a weapon or immobilizing or restraint technique without having successfully completed certified training as directed by the board.\nA person licensed as a peace officer by the Board of Peace Officer Standards and Training meets the training requirements of this section.",
	"repealed": false
}