{
	"id": "168.1294",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1294",
	"title": "168.1294 LAW ENFORCEMENT MEMORIAL PLATES.",
	"text": "The commissioner shall issue special law enforcement memorial license plates or a single motorcycle plate to an applicant who:\n(1) is a registered owner of a passenger automobile, noncommercial one-ton pickup truck, motorcycle, or recreational motor vehicle;\n(2) pays an additional fee in the amount specified for special plates under section 168.12, subdivision 5, for each set of plates;\n(3) pays the registration tax as required under section 168.013, along with any other fees required by this chapter;\n(4) contributes $25 upon initial application and a minimum of $5 annually to the Minnesota law enforcement memorial account; and\n(5) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\nThe commissioner, in consultation with representatives from the Minnesota Law Enforcement Memorial Association, shall adopt a suitable design for the plate that must include a blue line with a black line of equal proportion above and below the blue line, representing the thin blue line.\nOn application to the commissioner and payment of a transfer fee of $5, special plates may be transferred to another qualified motor vehicle that is registered to the same individual to whom the special plates were originally issued.\nSpecial plates issued under this section are not subject to section 168.1293, subdivision 2.\nMS 2022 [Repealed, 2023 c 68 art 4 s 129]\nContributions collected under subdivision 1, clause (4), must be deposited in the Minnesota law enforcement memorial account, which is established in the special revenue fund. Money in the account is appropriated to the commissioner of public safety. This appropriation is first for the annual cost of administering the account funds, and the remaining funds are for distribution to the Minnesota Law Enforcement Memorial Association. By August 15 of each year, the commissioner must distribute all funds remaining to the association. The association must use the funds to further the mission of the association in assisting the families and home agencies of Minnesota law enforcement officers who have died in the line of duty. By January 15 of each year, the association must submit a report to the commissioner of public safety and to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. The report must include an itemized list of each expenditure the association made with the funds received under this section for the previous calendar year.",
	"repealed": false
}