{
	"id": "504B.216",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.216",
	"title": "504B.216 UTILITY SERVICE IN SHARED-METERED RESIDENTIAL BUILDINGS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Directly metered tenant\" means a tenant who receives utility service directly from, is billed directly by, and is a customer of the utility provider.\n(c) \"Landlord\" has the meaning given in section 504B.001, subdivision 7. For the purposes of this section, landlord includes a third-party billing agent.\n(d) \"Nonusage charges\" means the total of the charges on a utility bill from a utility provider that represent all nonconsumption-based charges and fees, including but not limited to fixed-meter or service charges, taxes, surcharges, and other fees.\n(e) \"Shared-metered residential building\" means a building with multiple separate residential dwelling units where the building's utility service is measured by fewer meters than the number of separate dwelling units in the building. Shared-metered residential building does not include a manufactured home park.\n(f) \"Submeter\" means a meter that (1) is owned by a landlord and installed by the landlord or by a third-party billing agent or other agent, and (2) measures utility service consumed solely within an individual dwelling unit in the shared-metered residential building.\n(g) \"Third-party billing agent\" means a person or entity, other than the property owner, that performs one or more utility management services at a shared-metered residential building on behalf of a landlord, including but not limited to installing submeters, reading submeters, or handling utility billing or collections, or both.\n(h) \"Utility provider\" means a public utility, a municipal utility, a cooperative electric association, or a local municipal water company providing utility service.\n(i) \"Utility service\" means natural gas, electricity, or water and sewer.\n(a) The landlord of a shared-metered residential building must be the bill payer responsible and must be the customer of record contracting with a utility provider for utility service. The landlord must advise the utility provider that the utility services apply to a shared-metered residential building.\n(b) A landlord is prohibited from removing a directly metered tenant from the tenant's existing utility account or requesting that a utility remove the tenant from the tenant's existing utility account.\n(c) This subdivision may not be waived by contract or otherwise.\nA landlord who submeters natural gas or electricity (1) must comply with this section and sections 216B.022 and 216B.023, and (2) is subject to section 216B.024.\n(a) On or after January 1, 2025, any submeters installed by a landlord to measure water and sewer usage must comply with standards established by the local municipal water company for meters the company uses to measure water and sewer service provided to the company's customers.\n(b) All submeters, regardless of when the submeter was installed, must accurately measure utility service. Landlords are prohibited from billing submetered tenants less frequently than the landlord is billed by the utility.\n(c) A landlord who submeters water must:\n(1) bill tenants according to section 216B.023, subdivision 1;\n(2) charge tenants according to section 216B.023, subdivision 2, paragraph (b); and\n(3) comply with sections 216B.022, subdivision 4, and 216B.023, subdivisions 5, 7, and 8.\n(d) A landlord must not charge to or collect from tenants any administrative, capital, or any other expenses associated with the installation, maintenance, repair, replacement, or reading of submeters, unless the expense is due to the tenant's willful, malicious, or negligent conduct. Nothing in this subdivision prevents the landlord from imposing a late payment charge, as provided under subdivision 9, or an administrative billing charge, as provided under subdivision 8.\n(a) Apportionment of electricity is prohibited.\n(b) Landlords must not bill tenants for apportioned utility service under this section less frequently than the landlord is billed by the utility.\n(c) A landlord who apportions utility service must, upon a tenant's request, provide:\n(1) a copy of the current actual natural gas or water and sewer utility bill from the utility provider that is being apportioned; and\n(2) a copy of past natural gas or water and sewer utility bills for which the tenant received an apportioned utility bill for the preceding two years or from the time the current landlord acquired the building, whichever is the most recent.\n(d) A landlord must include in the lease or in a separate written notice a list of the tenant's rights under paragraph (c).\n(e) A landlord who apportions utility service must comply with section 216B.023, subdivisions 5, 7, and 8. A landlord who apportions natural gas is also subject to section 216B.024.\n(a) A landlord may apportion and bill for natural gas usage and nonusage charges only as provided in this subdivision.\n(b) A tenant's apportioned natural gas bill must be based on the previous billing period's actual natural gas bills from the utility provider, allocated to each unit based on the square footage in the tenant's unit as a proportion of square footage of all the units in the building.\n(c) A landlord must not charge any tenant for natural gas consumed in common areas, spaces used exclusively or primarily by the landlord, or any vacant unit.\n(d) A landlord must deduct from a tenant's total bill the tenant's pro rata share of any bill credits or adjustments received by the landlord on the bill from the utility.\n(a) A landlord may apportion water and sewer utility service and nonusage charges only as provided in this subdivision.\n(b) A tenant's apportioned water and sewer bill must be based on the previous period's water and sewer bills from the utility provider, allocated to each unit based on the number of tenants listed on the lease as a proportion of the occupancy of all the units as listed on the leases in the building.\n(c) A landlord must not charge any tenant for water and sewer usage in common areas; in spaces used exclusively or primarily by the landlord; in vacant units; for maintenance of the property; or for shared amenities, including but not limited to laundry facilities and pools.\n(d) A landlord must deduct from a tenant's total bill the tenant's pro rata share of any bill credits or adjustments received by the landlord on the bill from the utility.\nA landlord who bills separately from rent for any utility service may charge a tenant a single administrative billing charge per billing period for all the utilities that are separately billed. The administrative billing charge must not exceed $8. Except as provided in subdivision 9, no other fees or charges may be imposed on or collected from tenants for utility service, including but not limited to any administrative, capital, or any other expenses associated with the installation, maintenance, repair, replacement, or reading of submeters, unless the expense involving a submeter is due to the tenant's willful, malicious, or negligent conduct.\nA landlord may impose one late payment charge per billing period if a tenant's utility bill payment is not received by the landlord by the next scheduled billing date. The late payment charge for all utilities billed must not exceed $5 per month. Late fees must not be compounded.\nIf natural gas or water and sewer is apportioned, leases entered into or renewed on or after January 1, 2025, must include an attachment with the following notice:\n\"UTILITY BILLS\nHow Will My Bill be Calculated?\n1. Your utility bill is for your portion of the building's natural gas or water and sewer usage, plus your portion of nonusage fees we get charged by the utility (for example, taxes and surcharges).\nFor natural gas, your portion is based on the square footage of your unit as a percentage of the square footage of all the units.\nFor water and sewer, your portion is based on the number of people in your unit (as listed on your lease) as a percentage of all the occupants of all units.\n2. You are not charged for utilities used in the common areas or used in our spaces. In the case of water, your bill does not include usage for shared amenities such as laundry rooms or pools.\n3. Your bill may include a late payment charge, which is capped at $5, and an administrative billing charge, which is capped at $8.\nWhat If I Fall Behind on Utility Payments or Have a Question About My Bill?\n1. If you fall behind on your payments, you have the right to a reasonable payment plan that you and we mutually agree on to pay off the amount you owe. The plan must take into account any financial and extenuating circumstances of your household that you tell us about.\n2. You may request, and we will timely provide, the utility bill we received from the utility company and your percentage of the amount of the bill apportioned to tenants.\n3. We must first try to resolve any disputes about your natural gas or electricity utility charges, including those about payment agreements. If we cannot agree on a payment plan or resolve any other dispute, you have the right to seek assistance from the Public Utilities Commission's Consumer Affairs Office at 651-296-0406 or consumer.puc@state.mn.us.\"\nNo later than July 1, 2025, an organization representing landlords shall work with organizations representing tenants and other relevant groups and agencies to determine the steps necessary to, on each apportioned utility bill rendered under leases entered into or renewed on or after July 1, 2026, enable a tenant to understand how the tenant's utility bill was calculated and to verify that the calculation is accurate.\n(a) Disconnection of a tenant's utility service by a landlord for the failure to pay utility service charges is prohibited. Nothing in this subdivision prohibits a public utility, a municipal utility, or a cooperative electric association from disconnecting service to a landlord's building as otherwise provided by law.\n(b) If a landlord asserts a tenant owes rent and utilities, sums paid by the tenant to the landlord must first be applied to unpaid rent.\n(c) Except as provided in paragraph (d), a landlord may bring a claim for breach of lease under section 504B.285, subdivision 4, for the failure of a tenant to pay for utilities billed separately from rent as provided under this section.\n(d) Notwithstanding paragraph (c):\n(1) a landlord may not bring a claim for breach unless the landlord has offered the tenant a payment plan under section 216B.023, subdivision 7, and the tenant has failed to make two consecutive payments on the plan; and\n(2) an eviction action may not be filed and any eviction already filed must be stayed:\n(i) for the failure to pay natural gas or electric utility service charges during the cold weather period;\n(ii) for the failure to pay electric utility charges during a heat emergency; and\n(iii) if the tenant notifies the landlord or the court that the tenant or a member of the tenant's household is experiencing a medical emergency, or where medical equipment requiring electricity necessary to sustain life is in use and certification of the emergency is provided to the landlord or the court by a licensed medical health care professional within five days of notification to the landlord or the court.\n(e) If the failure to pay natural gas or electric utility charges occurs during the cold weather period, or in the event of a medical emergency or where medical equipment requiring electricity necessary to sustain life is in use, a landlord must follow the procedures set forth in section 216B.023, subdivision 7.\n(f) A violation of this subdivision is a violation of section 504B.221.\n(g) For the purposes of this subdivision:\n(1) \"cold weather period\" has the meaning given in section 216B.096, subdivision 2;\n(2) \"disconnection\" includes installation of a service or load limiter or any device that limits or interrupts utility service in any way; and\n(3) \"heat emergency\" means any period when an excessive heat watch, heat advisory, or excessive heat warning issued by the National Weather Service is in effect.\n(a) A utility provider supplying natural gas, electricity, or water and sewer, or another company supplying home heating oil or propane, to a building who issues a final notice proposing to disconnect or discontinue the service to the building because a landlord who has contracted for the service has failed to pay for the service, or because a landlord is required by law or contract to pay for the service and fails to do so, must provide notice to the residents of the impending disconnection by posting in the building. The posting must be placed in at least one conspicuous location in or on the building and provide tenants with, at a minimum, the following information:\n(1) the date the service will be discontinued;\n(2) the telephone number to call the utility to obtain further information;\n(3) a brief description of the rights of tenants under this section to continue or restore service; and\n(4) advice to consider seeking assistance from legal aid, a private attorney, or a housing organization in exercising the tenant rights under Minnesota law to maintain utility service.\nA tenant or group of tenants may pay to have the service continued or reconnected as provided under this section. Before paying for the service, the tenant or group of tenants shall give oral or written notice to the landlord of the tenant's intention to pay after 48 hours, or a shorter period that is reasonable under the circumstances, if the landlord has not already paid for the service. In the case of oral notification, written notice shall be mailed or delivered to the landlord within 24 hours after the time oral notice is given.\n(b) In the case of natural gas or electricity, if the landlord has not paid the bill by the time of the tenant's intended payment or if the service remains discontinued, the tenant or tenants may pay the current charges for the most recent billing period and the utility company or municipality must restore the service for at least one billing period. In a residential building with less than five units, one of the tenants may notify the utility company or municipality that the tenant agrees to become the bill payer responsible and customer of record and the utility company or municipality must place the account disconnected or subject to disconnection in the tenant's name and provide service prospectively, provided the tenant satisfies all requirements for establishing service. A tenant that becomes the customer of record of a cooperative electric association does not acquire membership rights. Exercise of the right to pay the current charges for the most recent billing period does not preclude exercising the right to become the bill payer responsible and customer of record, provided that if there are multiple tenants in an affected multifamily building, the utility company or municipality is not required to offer the right to become the bill payer responsible and the customer of record to more than one tenant in a 12-month period.\n(c) In the case of water and sewer, if the landlord has not paid the bill by the time of the tenant's intended payment or if the service remains discontinued, upon request from a tenant a municipality must provide a copy of each bill the landlord fails to pay. The tenant:\n(1) has a continuing right to pay the current charges for the most recent billing period and retain service;\n(2) has the period of time provided by the governing ordinance, policy, or practice within which to pay the charges;\n(3) is not subject to any deposit requirements; and\n(4) is entitled to reasonable notice of any disconnection.\nThis paragraph does not require a municipality to alter the municipality's accounting system or billing records if the tenant exercises the right to pay current charges and retain water service. If there are multiple tenants in an affected property, the municipality is not required to offer the right to pay current charges and retain service to more than one tenant in a 12-month period.\n(d) For purposes of this subdivision, \"current charges\" does not include arrears or late payment fees incurred by the landlord.\n(e) In a shared-metered residential building, other residential tenants in the building may contribute payments to the utility company or municipality on the account of the tenant who is the customer of record under paragraph (b), or on the landlord's account under paragraph (c).\n(f) A landlord who satisfies all requirements for reestablishing service, including paying or entering into an agreement acceptable to the utility company or municipality to pay all arrears and other lawful charges incurred by the landlord on the account that was placed in the tenant's name, may reestablish service in the landlord's name.\n(g) This section does not restrict or prohibit a municipal utility provider from exercising the municipal utility provider's authority pursuant to section 444.075, subdivisions 3 and 3e, to make contracts with and impose utility charges against property owners and to certify unpaid charges to the county auditor with taxes against the property served for collection as a tax.\n(h) In the case of home heating oil or propane, if the landlord has not paid the bill by the time of the tenant's intended payment, or if the service remains discontinued, the tenant or tenants may order and pay for one month's supply of the proper grade and quality of oil or propane.\n(i) After submitting documentation to the landlord of the tenant's payment to the utility company or municipality, a tenant may deduct the amount of the tenant's payment to the utility company or municipality from the rental payment next paid to the landlord. Any amount paid to the municipality, utility company, or other company by a tenant under this subdivision is considered payment of rent to the landlord for purposes of section 504B.291.\nThe tenant rights under this section:\n(1) do not extend to conditions caused by the willful, malicious, or negligent conduct of the tenant or of a person under the tenant's direction or control;\n(2) may not be waived or modified; and\n(3) are in addition to and do not limit other rights that may be available to the tenant in law or equity, including the right to damages and the right to restoration of possession of the premises under section 504B.291.\nBy September 30 of each year, a landlord of a shared-metered residential building who bills for gas, electric utility charges, or both separate from rent must inform tenants in writing of the possible availability of energy assistance from the low-income home energy assistance program. The information must contain the toll-free telephone number of the administering agency.\nA violation of subdivisions 2 to 12 is a violation of section 504B.161 and a violation of subdivisions 2, 3, 4, 5, 6, 7, 10, and 12 is a violation of section 504B.221.\nThe attorney general has authority under section 8.31 to investigate and prosecute violations of this section.",
	"repealed": false
}