{
	"id": "103E.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.005",
	"title": "103E.005 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Affected\" means benefited or damaged by a drainage system or project.\n\"Auditor\" means the auditor of the county where the petition for a drainage project was properly filed.\n\"Board\" means the board of commissioners of the county, a joint county board, the board of managers of the watershed district, or a metropolitan watershed management organization that serves as the drainage authority where the drainage system or project is located.\n\"Commissioner\" means the commissioner of natural resources.\n\"Director\" means the director of the Division of Ecological and Water Resources in the Department of Natural Resources.\n\"Dismissal of proceedings\" means that the petition and proceedings related to the petition are dismissed.\n\"Ditch\" means an open channel to conduct the flow of water.\n\"Drainage authority\" means the board or joint county drainage authority having jurisdiction over a drainage system or project.\n\"Drainage lien\" means a lien recorded on property for the costs of drainage proceedings and construction and interest on the lien, as provided under this chapter.\n\"Drainage project\" means a new drainage system, an improvement of a drainage system, an improvement of an outlet, or a lateral.\n\"Drainage system\" means a system of ditch or tile, or both, to drain property, including laterals, improvements, and improvements of outlets, established and constructed by a drainage authority. Drainage system includes the improvement of a natural waterway used in the construction of a drainage system and any part of a flood control plan proposed by the United States or its agencies in the drainage system.\n\"Engineer\" means the engineer for a drainage project appointed by the drainage authority under section 103E.241, subdivision 1.\n\"Established\" means the drainage authority has made the order to construct the drainage project.\n\"Lateral\" means any drainage construction by branch or extension, or a system of branches and extensions, or a drain that connects or provides an outlet to property with an established drainage system.\n\"Municipality\" means a statutory or home rule charter city or a town having urban powers under section 368.01, subdivision 1 or 1a. For purposes of sections 103E.315, 103E.611, and 103E.615, municipality includes a water management authority to which a portion of a drainage system is transferred under section 103E.812.\n\"Notice by mail\" means a notice mailed and addressed to each person entitled to receive the notice, if the address is known to the auditor or can be determined by the county treasurer of the county where the affected property is located.\n\"Owner\" means an owner of property or a buyer of property under a contract for deed.\n\"Passes over\" means in reference to property that has a drainage project or system, the 40-acre tracts or government lots or property that is bordered by, touched by, or underneath the path of the proposed drainage project.\n\"Person\" means an individual, firm, partnership, association, or private corporation.\n\"Political subdivisions\" means statutory and home rule charter cities, counties, towns, school districts, and other political subdivisions.\n\"Proceeding\" means a procedure under this chapter for or related to drainage that begins with filing a petition and ends by dismissal or establishment of a drainage project.\n\"Property\" means real property.\n\"Publication\" means a notice published at least once a week for three successive weeks in a legal newspaper in general circulation in each county affected by the notice.\n\"Public health\" includes an act or thing that tends to improve the general sanitary condition of the community by drainage, relieving low wetland or stagnant and unhealthful conditions, or preventing the overflow of any property that produces or tends to produce unhealthful conditions.\n\"Public waters\" has the meaning given in section 103G.005, subdivision 15.\n\"Public welfare\" or \"public benefit\" includes an act or thing that tends to improve or benefit the general public, either as a whole or as to any particular community or part, including works contemplated by this chapter, that drain or protect roads from overflow, protect property from overflow, or reclaim and render property suitable for cultivation that is normally wet and needing drainage or subject to overflow.\n\"Road\" means any road used by the public for transportation purposes.\n\"Secretary\" means the secretary of the watershed district that serves as the drainage authority for the applicable drainage system.\n\"Water management authority\" means a county or municipality, watershed district, watershed management organization, stormwater management district, lake improvement district, subordinate service district, joint powers organization or other special district organized and formed according to law for the purpose of managing storm, surface, and floodwaters, or with the authority to manage storm, surface, and floodwaters.",
	"repealed": false
}