{
	"id": "295.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.75",
	"title": "295.75 LIQUOR GROSS RECEIPTS TAX.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of revenue.\n(c) \"Gross receipts\" means the total amount received, in money or by barter or exchange, for all liquor sales at retail as measured by the sales price, but does not include any taxes imposed directly on the consumer that are separately stated on the invoice, bill of sale, or similar document given to the purchaser.\n(d) \"Liquor\" means:\n(1) intoxicating liquor, as defined in section 340A.101, subdivision 14;\n(2) beverage containing intoxicating liquor; and\n(3) 3.2 percent malt liquor, as defined in section 340A.101, subdivision 19, when sold at an on-sale or off-sale municipal liquor store or other establishment licensed to sell any type of intoxicating liquor.\n(e) \"Liquor retailer\" means a retailer that sells liquor.\n(f) \"Retail sale\" has the meaning given in section 297A.61, subdivision 4.\nA tax is imposed on each liquor retailer equal to 2.5 percent of gross receipts from retail sales in Minnesota of liquor. The liquor retailer may, but is not required to, collect the tax from the purchaser. If separately stated on the invoice, bill of sale, or similar document given to the purchaser, the tax is excluded from the sales price for purposes of the tax imposed under chapter 297A.\n(a) A person that receives liquor for use or storage in Minnesota, other than from a liquor retailer that paid the tax under subdivision 2, is subject to tax at the rate imposed under subdivision 2. Liability for the tax is incurred when the person has possession of the liquor in Minnesota. The tax must be remitted to the commissioner in the same manner prescribed for the taxes imposed under chapter 297A.\n(b) A person that has paid taxes to another jurisdiction on the same transaction and is subject to tax under this section is entitled to a credit for the tax legally due and paid to another jurisdiction to the extent of the lesser of (1) the tax actually paid to the other jurisdiction, or (2) the amount of tax imposed by Minnesota on the transaction subject to tax in the other jurisdiction.\nA liquor retailer with nexus in Minnesota, who is not subject to tax under subdivision 2, is required to collect the tax imposed under subdivision 3 from the purchaser of the liquor and give the purchaser a receipt for the tax paid. The tax collected must be remitted to the commissioner in the same manner prescribed for the taxes imposed under chapter 297A.\nA liquor retailer that has paid taxes to another jurisdiction measured by gross receipts and is subject to tax under this section on the same gross receipts is entitled to a credit for the tax legally due and paid to another jurisdiction to the extent of the lesser of (1) the tax actually paid to the other jurisdiction, or (2) the amount of tax imposed by Minnesota on the gross receipts subject to tax in the other taxing jurisdictions.\nAll of the exemptions applicable to the taxes imposed under chapter 297A are applicable to the taxes imposed under this section.\nAll of the provisions of section 297A.668 apply to the taxes imposed by this section.\nA liquor retailer shall report the tax on a return prescribed by the commissioner of revenue, and shall remit the tax with the return. The return and the tax must be filed and paid using the filing cycle and due dates provided for taxes imposed under chapter 297A.\nUnless specifically provided otherwise by this section, the audit, assessment, refund, penalty, interest, enforcement, collection remedies, appeal, and administrative provisions of chapters 270C and 289A that are applicable to taxes imposed under chapter 297A apply to taxes imposed under this section.\nInterest must be paid on an overpayment refunded or credited to the taxpayer from the date of payment of the tax until the date the refund is paid or credited. For purposes of this subdivision, the date of payment is the due date of the return or the date of actual payment of the tax, whichever is later.\nThe commissioner shall deposit all revenues, including penalties and interest, derived from the tax imposed by this section in the general fund.",
	"repealed": false
}