{
	"id": "595.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/595.02",
	"title": "595.02 TESTIMONY OF WITNESSES.",
	"text": "Every person of sufficient understanding, including a party, may testify in any action or proceeding, civil or criminal, in court or before any person who has authority to receive evidence, except as provided in this subdivision:\n(a) A husband cannot be examined for or against his wife without her consent, nor a wife for or against her husband without his consent, nor can either, during the marriage or afterwards, without the consent of the other, be examined as to any communication made by one to the other during the marriage. This exception does not apply to a civil action or proceeding by one against the other, nor to a criminal action or proceeding for a crime committed by one against the other or against a child of either or against a child under the care of either spouse, nor to a criminal action or proceeding in which one is charged with homicide or an attempt to commit homicide and the date of the marriage of the defendant is subsequent to the date of the offense, nor to an action or proceeding for nonsupport, neglect, dependency, or termination of parental rights.\n(b) An attorney cannot, without the consent of the attorney's client, be examined as to any communication made by the client to the attorney or the attorney's advice given thereon in the course of professional duty; nor can any employee of the attorney be examined as to the communication or advice, without the client's consent.\n(c) A member of the clergy or other minister of any religion shall not, without the consent of the party making the confession, be allowed to disclose a confession made to the member of the clergy or other minister in a professional character, in the course of discipline enjoined by the rules or practice of the religious body to which the member of the clergy or other minister belongs; nor shall a member of the clergy or other minister of any religion be examined as to any communication made to the member of the clergy or other minister by any person seeking religious or spiritual advice, aid, or comfort or advice given thereon in the course of the member of the clergy's or other minister's professional character, without the consent of the person.\n(d) A licensed physician or surgeon, dentist, or chiropractor shall not, without the consent of the patient, be allowed to disclose any information or any opinion based thereon which the professional acquired in attending the patient in a professional capacity, and which was necessary to enable the professional to act in that capacity; after the decease of the patient, in an action to recover insurance benefits, where the insurance has been in existence two years or more, the beneficiaries shall be deemed to be the personal representatives of the deceased person for the purpose of waiving this privilege, and no oral or written waiver of the privilege shall have any binding force or effect except when made upon the trial or examination where the evidence is offered or received.\n(e) A public officer shall not be allowed to disclose communications made to the officer in official confidence when the public interest would suffer by the disclosure.\n(f) Persons of unsound mind and persons intoxicated at the time of their production for examination are not competent witnesses if they lack capacity to remember or to relate truthfully facts respecting which they are examined.\n(g) A registered nurse, psychologist, consulting psychologist, or licensed social worker engaged in a psychological or social assessment or treatment of an individual at the individual's request shall not, without the consent of the professional's client, be allowed to disclose any information or opinion based thereon which the professional has acquired in attending the client in a professional capacity, and which was necessary to enable the professional to act in that capacity. Nothing in this clause exempts licensed social workers from compliance with the provisions of section 626.557 and chapter 260E.\n(h) An interpreter for a person disabled in communication shall not, without the consent of the person, be allowed to disclose any communication if the communication would, if the interpreter were not present, be privileged. For purposes of this section, a \"person disabled in communication\" means a person who, because of a hearing, speech or other communication disorder, or because of the inability to speak or comprehend the English language, is unable to understand the proceedings in which the person is required to participate. The presence of an interpreter as an aid to communication does not destroy an otherwise existing privilege.\n(i) Licensed chemical dependency counselors shall not disclose information or an opinion based on the information which they acquire from persons consulting them in their professional capacities, and which was necessary to enable them to act in that capacity, except that they may do so:\n(1) when informed consent has been obtained in writing, except in those circumstances in which not to do so would violate the law or would result in clear and imminent danger to the client or others;\n(2) when the communications reveal the contemplation or ongoing commission of a crime; or\n(3) when the consulting person waives the privilege by bringing suit or filing charges against the licensed professional whom that person consulted.\n(j) A parent or the parent's minor child may not be examined as to any communication made in confidence by the minor to the minor's parent. A communication is confidential if made out of the presence of persons not members of the child's immediate family living in the same household. This exception may be waived by express consent to disclosure by a parent entitled to claim the privilege or by the child who made the communication or by failure of the child or parent to object when the contents of a communication are demanded. This exception does not apply to a civil action or proceeding by one spouse against the other or by a parent or child against the other, nor to a proceeding to commit either the child or parent to whom the communication was made or to place the person or property or either under the control of another because of an alleged mental or physical condition, nor to a criminal action or proceeding in which the parent is charged with a crime committed against the person or property of the communicating child, the parent's spouse, or a child of either the parent or the parent's spouse, or in which a child is charged with a crime or act of delinquency committed against the person or property of a parent or a child of a parent, nor to an action or proceeding for termination of parental rights, nor any other action or proceeding on a petition alleging child abuse, child neglect, abandonment or nonsupport by a parent.\n(k) Sexual assault counselors may not be allowed to disclose any opinion or information received from or about the victim without the consent of the victim. However, a counselor may be compelled to identify or disclose information in investigations or proceedings related to neglect or termination of parental rights if the court determines good cause exists. In determining whether to compel disclosure, the court shall weigh the public interest and need for disclosure against the effect on the victim, the treatment relationship, and the treatment services if disclosure occurs. Nothing in this clause exempts sexual assault counselors from compliance with the provisions of section 626.557 and chapter 260E.\n\"Sexual assault counselor\" for the purpose of this section means a person who has undergone at least 40 hours of crisis counseling training and works under the direction of a supervisor in a crisis center, whose primary purpose is to render advice, counseling, or assistance to victims of sexual assault.\n(l) A domestic abuse advocate may not be compelled to disclose any opinion or information received from or about the victim without the consent of the victim unless ordered by the court. In determining whether to compel disclosure, the court shall weigh the public interest and need for disclosure against the effect on the victim, the relationship between the victim and domestic abuse advocate, and the services if disclosure occurs. Nothing in this paragraph exempts domestic abuse advocates from compliance with the provisions of section 626.557 and chapter 260E.\nFor the purposes of this section, \"domestic abuse advocate\" means an employee or supervised volunteer from a community-based battered women's shelter and domestic abuse program eligible to receive grants under section 611A.32; that provides information, advocacy, crisis intervention, emergency shelter, or support to victims of domestic abuse and who is not employed by or under the direct supervision of a law enforcement agency, a prosecutor's office, or by a city, county, or state agency.\n(m) A person cannot be examined as to any communication or document, including work notes, made or used in the course of or because of mediation pursuant to an agreement to mediate or a collaborative law process pursuant to an agreement to participate in collaborative law. This does not apply to the parties in the dispute in an application to a court by a party to have a mediated settlement agreement or a stipulated agreement resulting from the collaborative law process set aside or reformed. A communication or document otherwise not privileged does not become privileged because of this paragraph. This paragraph is not intended to limit the privilege accorded to communication during mediation or collaborative law by the common law.\n(n) A child under ten years of age is a competent witness unless the court finds that the child lacks the capacity to remember or to relate truthfully facts respecting which the child is examined. A child describing any act or event may use language appropriate for a child of that age.\n(o) A communication assistant for a telecommunications relay system for persons who have communication disabilities shall not, without the consent of the person making the communication, be allowed to disclose communications made to the communication assistant for the purpose of relaying.\nNo person presiding at any alternative dispute resolution proceeding established pursuant to law, court rule, or by an agreement to mediate, shall be competent to testify, in any subsequent civil proceeding or administrative hearing, as to any statement, conduct, decision, or ruling, occurring at or in conjunction with the prior proceeding, except as to any statement or conduct that could:\n(1) constitute a crime;\n(2) give rise to disqualification proceedings under the Rules of Professional Conduct for attorneys; or\n(3) constitute professional misconduct.\n(a) The exception provided by paragraphs (d) and (g) of subdivision 1 shall not apply to any testimony, records, or other evidence relating to the abuse or neglect of a minor in any proceeding under chapter 260 or any proceeding under section 245A.08, to revoke a day care or foster care license, arising out of the neglect or physical or sexual abuse of a minor, as defined in section 260E.03.\n(b) The exception provided by paragraphs (d) and (g) of subdivision 1 shall not apply to criminal proceedings arising out of the neglect or physical or sexual abuse of a minor, as defined in section 260E.03, if the court finds that:\n(1) there is a reasonable likelihood that the records in question will disclose material information or evidence of substantial value in connection with the investigation or prosecution; and\n(2) there is no other practicable way of obtaining the information or evidence. This clause shall not be construed to prohibit disclosure of the patient record when it supports the otherwise uncorroborated statements of any material fact by a minor alleged to have been abused or neglected by the patient; and\n(3) the actual or potential injury to the patient-health professional relationship in the treatment program affected, and the actual or potential harm to the ability of the program to attract and retain patients, is outweighed by the public interest in authorizing the disclosure sought.\nNo records may be disclosed under this paragraph other than the records of the specific patient suspected of the neglect or abuse of a minor. Disclosure and dissemination of any information from a patient record shall be limited under the terms of the order to assure that no information will be disclosed unnecessarily and that dissemination will be no wider than necessary for purposes of the investigation or prosecution.\nAn out-of-court statement made by a child under the age of ten years or a person who is mentally impaired as defined in section 609.341, subdivision 6, alleging, explaining, denying, or describing any act of sexual contact or penetration performed with or on the child or any act of physical abuse of the child or the person who is mentally impaired by another, not otherwise admissible by statute or rule of evidence, is admissible as substantive evidence if:\n(a) the court or person authorized to receive evidence finds, in a hearing conducted outside of the presence of the jury, that the time, content, and circumstances of the statement and the reliability of the person to whom the statement is made provide sufficient indicia of reliability; and\n(b) the child or person mentally impaired as defined in section 609.341, subdivision 6, either:\n(i) testifies at the proceedings; or\n(ii) is unavailable as a witness and there is corroborative evidence of the act; and\n(c) the proponent of the statement notifies the adverse party of the proponent's intention to offer the statement and the particulars of the statement sufficiently in advance of the proceeding at which the proponent intends to offer the statement into evidence to provide the adverse party with a fair opportunity to prepare to meet the statement.\nFor purposes of this subdivision, an out-of-court statement includes video, audio, or other recorded statements. An unavailable witness includes an incompetent witness.\n(a) In a proceeding in which a child less than 12 years of age is alleging, denying, or describing:\n(1) an act of physical abuse or an act of sexual contact or penetration performed with or on the child or any other person by another; or\n(2) an act that constitutes a crime of violence committed against the child or any other person,\nthe court may, upon its own motion or upon the motion of any party, order that the testimony of the child be taken in a room other than the courtroom or in the courtroom and televised at the same time by closed-circuit equipment, or recorded for later showing to be viewed by the jury in the proceeding, to minimize the trauma to the child of testifying in the courtroom setting and, where necessary, to provide a setting more amenable to securing the child witness's uninhibited, truthful testimony.\n(b) At the taking of testimony under this subdivision, only the judge, the attorneys for the defendant and for the state, any person whose presence would contribute to the welfare and well-being of the child, persons necessary to operate the recording or closed-circuit equipment and, in a child protection proceeding under chapter 260 or a dissolution or custody proceeding under chapter 518, the attorneys for those parties with a right to participate may be present with the child during the child's testimony.\n(c) The court shall permit the defendant in a criminal or delinquency matter to observe and hear the testimony of the child in person. If the court, upon its own motion or the motion of any party, finds in a hearing conducted outside the presence of the jury, that the presence of the defendant during testimony taken pursuant to this subdivision would psychologically traumatize the witness so as to render the witness unavailable to testify, the court may order that the testimony be taken in a manner that:\n(1) the defendant can see and hear the testimony of the child in person and communicate with counsel, but the child cannot see or hear the defendant; or\n(2) the defendant can see and hear the testimony of the child by video or television monitor from a separate room and communicate with counsel, but the child cannot see or hear the defendant.\n(d) As used in this subdivision, \"crime of violence\" has the meaning given it in section 624.712, subdivision 5, and includes violations of section 609.26.\nA party who commences an action for malpractice, error, mistake, or failure to cure, whether based on contract or tort, against a health care provider on the person's own behalf or in a representative capacity, waives in that action any privilege existing under subdivision 1, paragraphs (d) and (g), as to any information or opinion in the possession of a health care provider who has examined or cared for the party or other person whose health or medical condition has been placed in controversy in the action. This waiver must permit all parties to the action, and their attorneys or authorized representatives, to informally discuss the information or opinion with the health care provider if the provider consents. Prior to an informal discussion with a health care provider, the defendant must mail written notice to the other party at least 15 days before the discussion. The plaintiff's attorney or authorized representative must have the opportunity to be present at any informal discussion. Appropriate medical authorizations permitting discussion must be provided by the party commencing the action upon request from any other party.\nA health care provider may refuse to consent to the discussion but, in that event, the party seeking the information or opinion may take the deposition of the health care provider with respect to that information and opinion, without obtaining a prior court order.\nFor purposes of this subdivision, \"health care provider\" means a physician, surgeon, dentist, or other health care professional or hospital, including all persons or entities providing health care as defined in section 145.61, subdivisions 2 and 4, or a certified health care professional employed by or providing services as an independent contractor in a hospital.",
	"repealed": false
}