{
	"id": "116.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.49",
	"title": "116.49 ENVIRONMENTAL PROTECTION REQUIREMENTS.",
	"text": "The agency must adopt rules applicable to all owners and operators of underground storage tanks. The rules must establish the safeguards necessary to protect human health and the environment. The agency may delay adopting the rules until the United States Environmental Protection Agency proposes regulations for regulated substances, as defined in section 116.46, subdivision 6, clause (1). The agency shall delay adopting the rules for regulated substances, as defined in section 116.46, subdivision 6, clause (2), until the United States Environmental Protection Agency publishes final regulations for underground storage tanks, or February 8, 1987, whichever is earlier.\nThe state, an agency of the state, or a political subdivision is not considered an owner or operator of a tank solely as a result of the forfeiture of title to the tank or real property where the tank is located for nonpayment of taxes, or solely as a result of actions taken to manage, sell, or transfer tax-forfeited land where a tank is located under chapter 282 and other laws applicable to tax-forfeited lands. This subdivision does not relieve the state, a state agency, or a political subdivision from liability for the daily operation of a tank under its control or responsibility located on tax-forfeited land.\nUntil the rules required by subdivision 1 become effective, a person may not install an underground storage tank unless the tank:\n(1) is installed according to requirements of the American Petroleum Institute Bulletin 1615 (November 1979) and all manufacturer's recommendations;\n(2) is cathodically protected against corrosion, constructed of noncorrosive material, steel clad with a noncorrosive material, or designed in a manner to prevent the release of any stored substance; and\n(3) is constructed to be compatible with the substance to be stored.\nEvery underground gasoline storage tank at a retail location must be fitted with vapor recovery equipment by January 1, 2006. The equipment must be certified by the manufacturer as capable of collecting 95 percent of hydrocarbons emitted during gasoline transfers from a transport delivery vehicle to an underground storage tank. Product delivery and vapor recovery access points must be on the same side of the transport vehicle when the transport vehicle is positioned for delivery into the underground tank. After January 1, 2006, no gasoline may be delivered to a retail location that is not equipped with a vapor recovery system.\nAll transport delivery vehicles that deliver gasoline into underground storage tanks in the metropolitan area as defined in section 473.121, subdivision 2, must be fitted with vapor recovery equipment. The equipment must recover and manage 95 percent of hydrocarbons emitted during the transfer of gasoline from the underground storage tank and the transport delivery vehicle by January 1, 2006. After January 1, 2006, no gasoline may be delivered to a retail location by a transport vehicle that is not fitted with vapor recovery equipment.",
	"repealed": false
}