{
	"id": "246C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.05",
	"title": "246C.05 EMPLOYEE PROTECTIONS FOR ESTABLISHING DIRECT CARE AND TREATMENT.",
	"text": "(a) Personnel whose duties relate to the functions assigned to the executive board in this chapter are transferred to Direct Care and Treatment effective 30 days after approval by the commissioner of management and budget.\n(b) Before the executive board is appointed, personnel whose duties relate to the functions in this chapter may be transferred beginning July 1, 2024, with 30 days' notice from the commissioner of management and budget.\n(c) The following protections shall apply to employees who are transferred from the Department of Human Services to Direct Care and Treatment:\n(1) No transferred employee shall have their employment status and job classification altered as a result of the transfer.\n(2) Transferred employees who were represented by an exclusive representative prior to the transfer shall continue to be represented by the same exclusive representative after the transfer.\n(3) The applicable collective bargaining agreements with exclusive representatives shall continue in full force and effect for such transferred employees after the transfer.\n(4) The state shall have the obligation to meet and negotiate with the exclusive representatives of the transferred employees about any proposed changes affecting or relating to the transferred employees' terms and conditions of employment to the extent such changes are not addressed in the applicable collective bargaining agreement.\n(5) When an employee in a temporary unclassified position is transferred to Direct Care and Treatment, the total length of time that the employee has served in the appointment shall include all time served in the appointment at the transferring agency and the time served in the appointment at Direct Care and Treatment. An employee in a temporary unclassified position who was hired by a transferring agency through an open competitive selection process in accordance with a policy enacted by Minnesota Management and Budget shall be considered to have been hired through such process after the transfer.\n(6) In the event that the state transfers ownership or control of any of the facilities, services, or operations of Direct Care and Treatment to another entity, whether private or public, by subcontracting, sale, assignment, lease, or other transfer, the state shall require as a written condition of such transfer of ownership or control the following provisions:\n(i) Employees who perform work in transferred facilities, services, or operations must be offered employment with the entity acquiring ownership or control before the entity offers employment to any individual who was not employed by the transferring agency at the time of the transfer.\n(ii) The wage and benefit standards of such transferred employees must not be reduced by the entity acquiring ownership or control through the expiration of the collective bargaining agreement in effect at the time of the transfer or for a period of two years after the transfer, whichever is longer.\n(d) There is no liability on the part of, and no cause of action arises against, the state of Minnesota or its officers or agents for any action or inaction of any entity acquiring ownership or control of any facilities, services, or operations of Direct Care and Treatment.\n(e) This section expires upon the completion of the transfer of duties to the executive board under this chapter. The commissioner of human services shall notify the revisor of statutes when the transfer of duties is complete.",
	"repealed": false
}