{
	"id": "169.798",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.798",
	"title": "169.798 RULES OF COMMISSIONER OF PUBLIC SAFETY.",
	"text": "The commissioner of public safety shall have the power and perform the duties imposed by this section and sections 65B.41 to 65B.71 and 169.797 and may adopt rules to implement and provide effective administration of the provisions requiring security and governing termination of security.\nThe commissioner of public safety may by rule provide that vehicles owned by certain persons may not be registered in this state unless satisfactory evidence is furnished that security has been provided as required by section 65B.48. If a person who is required to furnish evidence ceases to maintain security, the person shall immediately surrender the registration certificate and license plates for the vehicle. These requirements may be imposed if:\n(1) the registrant has not previously registered a vehicle in this state; or\n(2) an owner or operator of the vehicle has previously failed to comply with the security requirements of sections 65B.41 to 65B.71 or of prior law; or\n(3) the driving record of an owner or operator of the vehicle evidences a continuing disregard of the laws of this state enacted to protect the public safety; or\n(4) other circumstances indicate that action is necessary to effectuate the purposes of sections 65B.41 to 65B.71.\nNo owner of a boat, snowmobile, or utility trailer registered for a gross weight of 3,000 pounds or less shall be required by the commissioner of public safety to furnish evidence that the security required by section 65B.48 has been provided.\nEvery owner, when applying for motor vehicle or motorcycle registration, reregistration, or transfer of ownership, must provide information showing that the motor vehicle or motorcycle is covered by an insurance policy. Information required under this subdivision consists of the insurance company's name, the policy number, and the policy expiration date for the subject motor vehicle or motorcycle.",
	"repealed": false
}