{
	"id": "85.052",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.052",
	"title": "85.052 USES OF STATE PARKS; FEES.",
	"text": "(a) The commissioner may establish, by written order, provisions for the use of state parks for the following:\n(1) special parking space for automobiles or other motor-driven vehicles in a state park or state recreation area;\n(2) special parking spurs, campgrounds for automobiles, sites for tent camping, other types of lodging, camping, or day use facilities, and special auto trailer coach parking spaces, for the use of the individual charged for the space or facility;\n(3) providing water, sewer, and electric service to trailer or tent campsites and charging a reasonable use fee; and\n(4) administrative penalties related to courtesy warnings and letters issued for failure to display a state park permit as required under section 85.053, subdivision 2.\n(b) Provisions established under paragraph (a) are exempt from section 16A.1283 and the rulemaking provisions of chapter 14. Section 14.386 does not apply.\n(c) For the purposes of this subdivision, \"lodging\" means an enclosed shelter, room, or building with furnishings for overnight use.\n(a) The commissioner may stage state park special events in a state park, municipal park, or on other land near or adjoining a state park and charge an entrance or use fee for the special event. All receipts from the special events must be used in the same manner as though the special events were conducted in a state park.\n(b) The commissioner may establish, by written order, state park special event areas to hold historical or other special events conducted by the commissioner of a state agency or other public agency. Establishment of the areas is exempt from the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(a) An individual using spaces in state parks under subdivision 1, clause (2), shall be charged daily rates determined and set by the commissioner in a manner and amount consistent with the type of facility provided for the accommodation of guests in a particular park and with similar facilities offered for tourist camping and similar use in the area.\n(b) The fee for special parking spurs, campgrounds for automobiles, sites for tent camping, and special auto trailer coach parking spaces is one-half of the fee set in paragraph (a) on Sunday through Thursday of each week for a physically disabled person:\n(1) with a motor vehicle that has disability plates issued under section 168.021, subdivision 1;\n(2) who possesses a certificate issued under section 169.345; or\n(3) who possesses an interagency access pass for state residents with permanent disabilities, issued by the federal government under the Federal Lands Recreation Enhancement Act.\n(a) Fees paid for providing contracted products and services within a state park, state recreation area, or wayside, and for special state park uses under this section shall be deposited in the natural resources fund and credited to a state parks account.\n(b) Gross receipts derived from sales, rentals, or leases of natural resources within state parks, recreation areas, and waysides, other than those on trust fund lands, must be deposited in the state treasury and credited to the state parks working capital account.\n(c) Notwithstanding paragraph (b), the gross receipts from the sale of stockpile materials, aggregate, or other earth materials from the Iron Range Off-Highway Vehicle Recreation Area shall be deposited in the dedicated accounts in the natural resources fund from which the purchase of the stockpile material was made. Notwithstanding paragraph (b), the payments made under section 93.22, subdivision 1, paragraph (c), pursuant to a state mineral lease on lands and mineral rights purchased for and within the Iron Range Off-Highway Vehicle Recreation Area shall be deposited in the dedicated accounts in the natural resources fund from which the purchase of the lands was made.\nExcept as otherwise specified in law, and notwithstanding sections 16A.1283 and 16A.1285, subdivision 2, the commissioner shall, by written order, establish fees providing for the use of state parks and state recreation areas. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(a) The commissioner may, by written order, develop reasonable reservation policies for using camping, lodging, and day-use facilities and for tours, educational programs, seminars, events, and rentals. The policies are exempt from the rulemaking provisions under chapter 14, and section 14.386 does not apply.\n(b) The revenue collected from the state park reservation fee established under subdivision 5, including interest earned, must be deposited in the state park account in the natural resources fund and is annually appropriated to the commissioner for the cost of operating the state park reservation and point-of-sale system.\nThe commissioner may, by written order, develop reasonable policies for special-use permits to use state parks, state recreation areas, and state waysides. The policies are exempt from the rulemaking provisions under chapter 14, and section 14.386 does not apply.",
	"repealed": false
}