{
	"id": "477A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.11",
	"title": "477A.11 NATURAL RESOURCES LANDS, PAYMENTS IN LIEU; DEFINITIONS.",
	"text": "For the purpose of sections 477A.11 to 477A.14, the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of natural resources.\n\"Acquired natural resources land\" means:\n(1) land, other than wildlife management land, presently administered by the commissioner in which the state acquired by purchase, condemnation, or gift, a fee title interest in lands which were previously privately owned; and\n(2) lands acquired by the state under chapter 84A that are designated as state parks, state recreation areas, scientific and natural areas, or wildlife management areas.\n\"Other natural resources land\" means any land, other than acquired natural resource land or wildlife management land, presently owned in fee title by the state and administered by the commissioner, or any tax-forfeited land, other than platted lots within a city or those lands described under subdivision 3, clause (2), which is owned by the state and administered by the commissioner or by the county in which it is located.\n\"Land utilization project land\" means land that is leased by the state from the United States through the United States Secretary of Agriculture according to Title III of the Bankhead Jones Farm Tenant Act and that is administered by the commissioner.\n\"Military game refuge\" means land owned in fee by another state agency for military purposes and designated as a state game refuge under section 97A.085.\n\"Transportation wetland\" means land administered by the Department of Transportation in which the state acquired, by purchase from a private owner, a fee title interest in over 500 acres of land within a county to replace wetland losses from transportation projects.\n\"Wildlife management land\" means land administered by the commissioner in which the state acquired, from a private owner by purchase, condemnation, or gift, a fee interest under the authority granted in chapter 94 or 97A for wildlife management purposes and actually used as a wildlife management area.",
	"repealed": false
}