{
	"id": "142G.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.71",
	"title": "142G.71 GOOD CAUSE EXEMPTION FROM SANCTION.",
	"text": "The county agency shall not impose the sanction under section 142G.70 if it determines that the participant has good cause for failing to comply with the requirements of sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71. Good cause exists when:\n(1) appropriate child care is not available;\n(2) the job does not meet the definition of suitable employment;\n(3) the participant is ill or injured;\n(4) a member of the assistance unit, a relative in the household, or a foster child in the household is ill and needs care by the participant that prevents the participant from complying with the employment plan;\n(5) the participant is unable to secure necessary transportation;\n(6) the participant is in an emergency situation that prevents compliance with the employment plan;\n(7) the schedule of compliance with the employment plan conflicts with judicial proceedings;\n(8) a mandatory MFIP meeting is scheduled during a time that conflicts with a judicial proceeding or a meeting related to a juvenile court matter, or a participant's work schedule;\n(9) the participant is already participating in acceptable work activities;\n(10) the employment plan requires an educational program for a caregiver under age 20, but the educational program is not available;\n(11) activities identified in the employment plan are not available;\n(12) the participant is willing to accept suitable employment, but suitable employment is not available;\n(13) the participant documents other verifiable impediments to compliance with the employment plan beyond the participant's control; or\n(14) the documentation needed to determine if a participant is eligible for family stabilization services is not available, but there is information that the participant may qualify and the participant is cooperating with the county or employment service provider's efforts to obtain the documentation necessary to determine eligibility.\nThe job counselor shall work with the participant to reschedule mandatory meetings for individuals who fall under clauses (1), (3), (4), (5), (6), (7), and (8).\n(a) When a participant fails without good cause to comply with the requirements of sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71, the job counselor or the county agency must provide a notice of intent to sanction to the participant specifying the program requirements that were not complied with, informing the participant that the county agency will impose the sanctions specified in section 142G.70, and informing the participant of the opportunity to request a conciliation conference as specified in paragraph (b). The notice must also state that the participant's continuing noncompliance with the specified requirements will result in additional sanctions under section 142G.70, without the need for additional notices or conciliation conferences under this subdivision. The notice, written in English, must include the Department of Children, Youth, and Families language block, and must be sent to every applicable participant. If the participant does not request a conciliation conference within ten calendar days of the mailing of the notice of intent to sanction, the job counselor must notify the county agency that the assistance payment should be reduced. The county must then send a notice of adverse action to the participant informing the participant of the sanction that will be imposed, the reasons for the sanction, the effective date of the sanction, and the participant's right to have a fair hearing under section 142G.45.\n(b) The participant may request a conciliation conference by sending a written request, by making a telephone request, or by making an in-person request. The request must be received within ten calendar days of the date the county agency mailed the ten-day notice of intent to sanction. If a timely request for a conciliation is received, the county agency's service provider must conduct the conference within five days of the request. The job counselor's supervisor, or a designee of the supervisor, must review the outcome of the conciliation conference. If the conciliation conference resolves the noncompliance, the job counselor must promptly inform the county agency and request withdrawal of the sanction notice.\n(c) Upon receiving a sanction notice, the participant may request a fair hearing under section 142G.45, without exercising the option of a conciliation conference. In such cases, the county agency shall not require the participant to engage in a conciliation conference prior to the fair hearing.\n(d) If the participant requests a fair hearing or a conciliation conference, sanctions will not be imposed until there is a determination of noncompliance. Sanctions must be imposed as provided in section 142G.70.",
	"repealed": false
}