{
	"id": "244.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.195",
	"title": "244.195 DEFINITIONS.",
	"text": "For purposes of sections 244.195 to 244.24, the terms defined in this section have the meanings given them.\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 5]\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 5]\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 5]\n[Repealed, 2009 c 59 art 4 s 9]\n\"Commissioner\" means the commissioner of corrections.\n\"Detain\" means to take into actual custody, including custody within a local correctional facility.\n\"Probation\" has the meaning given in section 609.02, subdivision 15.\n\"Probation agency\" means an entity supervising an individual on probation, which may include the Department of Corrections field services or an agency, including a Tribal Nation, organized under section 244.19 or chapter 401.\n\"Probation officer\" means a county or Tribal probation officer or community supervision officer employed by a probation agency.\n\"Probation violation sanction\":\n(1) includes but is not limited to electronic monitoring, intensive probation, sentencing to service, reporting to a day reporting center, substance use disorder or mental health treatment or counseling, community work service, remote electronic alcohol monitoring, random drug testing, and participation in an educational or restorative justice program; and\n(2) does not include any type of custodial sanction, including but not limited to detention and incarceration.\n\"Release\" means to release from actual custody.\n\"Sanctions conference\" means a voluntary conference at which a probation officer; an individual on probation; and, if appropriate, other interested parties meet to discuss the probation violation sanction imposed because of the individual's technical violation.\n\"Sanctions conference form\" means a plain-language form developed by a probation agency with the approval of the district court that explains the sanctions conference and that the individual on probation may elect to participate in the sanctions conference or proceed to a judicial hearing.\n\"Technical violation\" means any violation of a court order of probation, except an allegation of a subsequent criminal act that is alleged in a formal complaint, citation, or petition.",
	"repealed": false
}