{
	"id": "611A.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.95",
	"title": "611A.95 CERTIFICATIONS FOR VICTIMS OF CRIMES.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"certifying entity\" means a state or local law enforcement agency;\n(2) \"criminal activity\" means qualifying criminal activity pursuant to section 101(a)(15)(U)(iii) of the Immigration and Nationality Act, as amended through June 1, 2021, and includes the attempt, conspiracy, or solicitation to commit such crimes; and\n(3) \"certification\" means any certification or statement required by federal immigration law, as amended through June 1, 2021, including but not limited to the information required by United States Code, title 8, section 1184(p), and United States Code, title 8, section 1184(o), including current United States Citizenship and Immigration Services Form I-918, Supplement B, and United States Citizenship and Immigration Services Form I-914, Supplement B, and any substantively similar successor forms.\n(a) A certifying entity shall process a certification requested by a victim of criminal activity or a representative of the victim, including the victim's attorney, family member, or domestic violence or sexual assault violence advocate, within the time period prescribed in paragraph (b).\n(b) A certifying entity shall process the certification within 90 days of request, unless the victim is in removal proceedings, in which case the certification shall be processed within 14 days of request. Requests for expedited certification must be affirmatively raised at the time of the request.\n(c) An active investigation, the filing of charges, or a prosecution or conviction are not required for the victim of criminal activity to request and obtain the certification, provided that the certifying entity initiated an investigation and the victim cooperated in it.\n(a) The head of a certifying entity shall designate an agent to perform the following responsibilities:\n(1) timely process requests for certification;\n(2) provide outreach to victims of criminal activity to inform them of the entity's certification process; and\n(3) keep a written or electronic record of all certification requests and responses.\n(b) All certifying entities shall implement a language access protocol for non-English-speaking victims of criminal activity.\n(a) A certifying entity is prohibited from disclosing the immigration status of a victim of criminal activity, except to comply with federal law or legal process, or if authorized by the victim of criminal activity or representative requesting the certification.\n(b) Data provided to a certifying entity under this section is classified as private data pursuant to section 13.02, subdivision 12.",
	"repealed": false
}