{
	"id": "144G.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.84",
	"title": "144G.84 SERVICES FOR RESIDENTS WITH DEMENTIA.",
	"text": "(a) In addition to the minimum services required in section 144G.41, an assisted living facility with dementia care must also provide the following services:\n(1) assistance with activities of daily living that address the needs of each resident with dementia due to cognitive or physical limitations. These services must meet or be in addition to the requirements in the licensing rules for the facility. Services must be provided in a person-centered manner that promotes resident choice, dignity, and sustains the resident's abilities;\n(2) nonpharmacological practices that are person-centered and evidence-informed;\n(3) services to prepare and educate persons living with dementia and their legal and designated representatives about transitions in care and ensuring complete, timely communication between, across, and within settings; and\n(4) services that provide residents with choices for meaningful engagement with other facility residents and the broader community.\n(b) Each resident must be evaluated for activities according to the licensing rules of the facility. In addition, the evaluation must address the following:\n(1) past and current interests;\n(2) current abilities and skills;\n(3) emotional and social needs and patterns;\n(4) physical abilities and limitations;\n(5) adaptations necessary for the resident to participate; and\n(6) identification of activities for behavioral interventions.\n(c) An individualized activity plan must be developed for each resident based on their activity evaluation. The plan must reflect the resident's activity preferences and needs.\n(d) A selection of daily structured and non-structured activities must be provided and included on the resident's activity service or care plan as appropriate. Daily activity options based on resident evaluation may include but are not limited to:\n(1) occupation or chore related tasks;\n(2) scheduled and planned events such as entertainment or outings;\n(3) spontaneous activities for enjoyment or those that may help defuse a behavior;\n(4) one-to-one activities that encourage positive relationships between residents and staff such as telling a life story, reminiscing, or playing music;\n(5) spiritual, creative, and intellectual activities;\n(6) sensory stimulation activities;\n(7) physical activities that enhance or maintain a resident's ability to ambulate or move; and\n(8) a resident's individualized activity plan for regular outdoor activity.\n(e) Behavioral symptoms that negatively impact the resident and others in the assisted living facility with dementia care must be evaluated and included on the service or care plan. The staff must initiate and coordinate outside consultation or acute care when indicated.\n(f) Support must be offered to family and other significant relationships on a regularly scheduled basis but not less than quarterly.\n(g) Existing housing with services establishments registered under chapter 144D prior to August 1, 2021, that obtain an assisted living facility license must provide residents with regular access to outdoor space. A licensee with new construction on or after August 1, 2021, or a new licensee that was not previously registered under chapter 144D prior to August 1, 2021, must provide regular access to secured outdoor space on the premises of the facility. A resident's access to outdoor space must be in accordance with the resident's documented care plan.",
	"repealed": false
}