{
	"id": "315.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.16",
	"title": "315.16 DIOCESAN CORPORATIONS; FORMATION; POWERS.",
	"text": "The bishop of a diocese may join with the vicar general and chancellor of the diocese. They, or a majority of them, shall designate and join with two other members of the religious denomination, residents of the diocese. These five shall adopt, sign, and acknowledge, in duplicate, a certificate reciting the fact of association and selection of the two persons, and containing the name, general purpose, and location of the corporation. When they file and record it, as provided in section 315.15, they and their successors become a corporation. The corporation has power to take, hold, receive, and dispose of real or personal property for the use and benefit of the diocese, and for the use and benefit of the religious denomination creating the diocese, and to administer the temporalities of the diocese, to establish and conduct schools, seminaries, colleges, or benevolent, charitable, religious, or missionary work or society of religious denomination within the diocese, with the rights, powers, and privileges enumerated in this section and in section 315.15.\nThe persons who hold the offices, respectively, of bishop, vicar general, and chancellor of the religious denomination in the diocese, and their successors in office are members of the corporation. On ceasing to hold office the corporate membership of each at once ends. The other two incorporators and their successors in office must always be selected and appointed by the bishop, vicar general, and chancellor of the diocese, or a majority of them, for the same term and in the same manner as provided in section 315.15 for the selection and appointment of the two lay members by the bishop, vicar general, and pastor. Vacancies must be filled by the three first named incorporators. An appointment must be in writing and entered of record in the minutes of the corporation, and appointees must be members of the religious denomination and residents of the diocese of its location. Any incorporator selected may at any time resign. The resignation and its acceptance must be entered on the minutes of the corporation. In case of a vacancy in the office of bishop of the diocese or the temporary suspension of the bishop's authority to act, the relevant provisions of section 315.15 apply.\nA member of either corporation specified in this section and in section 315.15 may, by a signed writing, appoint a proxy to represent the member and to vote in the member's place at a corporation meeting.\nA religious corporation may be formed in the manner set forth in this section to establish cemeteries in accordance with section 307.01.",
	"repealed": false
}