{
	"id": "469.094",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.094",
	"title": "469.094 TRANSFER OF AUTHORITY.",
	"text": "The city may, by ordinance, divide the economic development, housing, and redevelopment powers granted under sections 469.001 to 469.047 and 469.090 to 469.108 between the economic development authority and any other authority or commission established under statute or city charter for economic development, housing, or redevelopment as provided in subdivision 2.\nThe city may, by resolution, transfer the control, authority, and operation of any project as defined in section 469.174, subdivision 8, or any other program or project authorized by sections 469.001 to 469.047 or 469.124 to 469.133 located within the city, from the governmental agency or subdivision that established the project to the economic development authority. The city council may also require acceptance of control, authority, and operation of the project by the economic development authority. The economic development authority may exercise all of the powers that the governmental unit establishing the project could exercise with respect to the project.\nWhen a project or program is transferred to the economic development authority, the authority shall covenant and pledge to perform the terms, conditions, and covenants of the bond indenture or other agreements executed for the security of any bonds issued by the governmental subdivision that initiated the project or program. The economic development authority may exercise all of the powers necessary to perform the terms, conditions, and covenants of any indenture or other agreements executed for the security of the bonds and shall become obligated on the bonds when the project or program is transferred as provided in this subdivision.\nIf the city transfers a housing project or a housing development project to the economic development authority, the city must transfer all housing development and management powers relating to that specific project to the authority.\nNotwithstanding any other law or charter provision to the contrary, the city council may, by resolution, place any employees of the housing and redevelopment authority under the direction, supervision, or control of the economic development authority. The placement of any employees under the direction, supervision, or control of the economic development authority does not affect the rights of any employees of the housing and redevelopment authority, including any rights existing under a collective bargaining agreement or fringe benefit plan. The employees shall become employees of the economic development authority.",
	"repealed": false
}