{
	"id": "13A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/13A.04",
	"title": "13A.04 EXCEPTIONS.",
	"text": "Nothing in this chapter precludes any financial institution, or any officer, employee, or agent of a financial institution, from notifying a government authority that the institution, or officer, employee, or agent has information which may be relevant to a possible violation of any statute or rule or the financial exploitation of a vulnerable adult and providing access to financial records relevant to the possible violation or financial exploitation.\nNothing in this chapter precludes a financial institution, as an incident to perfecting a security interest, proving a claim in bankruptcy, or otherwise collecting on a debt owing either to the financial institution itself or in its role as a fiduciary, from providing copies of any financial record to any court or government authority.\nNothing in this chapter precludes a financial institution, as an incident to processing an application for assistance to a customer in the form of a government loan, loan guaranty, or loan insurance agreement, or as an incident to processing a default on, or administering a government guaranteed or insured loan, from providing access to an appropriate government authority with any financial record necessary to permit the authority to carry out its responsibilities under a loan, loan guaranty, or loan insurance agreement.\nWhenever a customer applies for participation in a government loan, loan guaranty, or loan insurance program, the government authority administering the program shall give the customer written notice of the authority's access rights under this subdivision. No further notification shall be required for subsequent access by that authority during the term of the loan, loan guaranty, or loan insurance agreement.\nFinancial records obtained pursuant to this subdivision may be used only for the purpose for which they were originally obtained.\nNothing in this chapter:\n(a) prohibits the disclosure of any financial records or information which is not identified with or identifiable as being derived from the financial records of a particular customer;\n(b) prohibits examination by or disclosure to the commissioner of commerce of financial records or information in the exercise of the commissioner's supervisory, regulatory, or monetary functions with respect to a financial institution;\n(c) shall apply when financial records are sought by a government authority under the Rules of Civil or Criminal Procedure in connection with litigation to which the government authority and the customer are parties;\n(d) shall apply when financial records are sought by a government authority in connection with a lawful proceeding, investigation, examination, or inspection directed at the financial institution in possession of the records or at a legal entity which is not a customer;\n(e) shall apply to any subpoena or court order issued in connection with proceedings before a grand jury;\n(f) shall apply to subpoenas issued in civil cases pursuant to the Rules of Civil Procedure; or\n(g) shall apply when a government authority is seeking only the name, address, account number, and type of account of any customer or ascertainable group of customers associated with a financial transaction or class of financial transaction.",
	"repealed": false
}