{
	"id": "144.7407",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.7407",
	"title": "144.7407 BLOOD SAMPLE COLLECTION FOR TESTING.",
	"text": "(a) If a blood sample is not otherwise available, the facility shall obtain consent from the source individual before collecting a blood sample for testing for blood-borne pathogens. The consent process shall include informing the source individual that the individual may refuse to provide a blood sample and that the source individual's refusal may result in a request for a court order under subdivision 2 to require the source individual to provide a blood sample.\n(b) If the source individual consents to provide a blood sample, the facility shall collect a blood sample and test the sample for blood-borne pathogens.\n(c) The facility shall inform the emergency medical services person about the source individual's test results without the individual's name, address, or other uniquely identifying information. The facility shall inform the source individual of the test results.\n(d) If the source individual refuses to provide a blood sample for testing, the facility shall inform the emergency medical services person of the source individual's refusal.\n(a) An emergency medical services agency, or, if there is no agency, an emergency medical services person, may bring a petition for a court order to require a source individual to provide a blood sample for testing for blood-borne pathogens. The petition shall be filed in the district court in the county where the source individual resides or is hospitalized. The petitioner shall serve the petition on the source individual at least three days before a hearing on the petition. The petition shall include one or more affidavits attesting that:\n(1) the facility followed the procedures in sections 144.7401 to 144.7415 and attempted to obtain blood-borne pathogen test results according to those sections;\n(2) it has been determined under section 144.7414, subdivision 2, that a significant exposure has occurred to the emergency medical services person; and\n(3) a physician with specialty training in infectious diseases, including HIV, has documented that the emergency medical services person has provided a blood sample and consented to testing for blood-borne pathogens and blood-borne pathogen test results are needed for beginning, continuing, modifying, or discontinuing medical treatment for the emergency medical services person.\n(b) Facilities shall cooperate with petitioners in providing any necessary affidavits to the extent that facility staff can attest under oath to the facts in the affidavits.\n(c) The court may order the source individual to provide a blood sample for blood-borne pathogen testing if:\n(1) there is probable cause to believe the emergency medical services person has experienced a significant exposure to the source individual;\n(2) the court imposes appropriate safeguards against unauthorized disclosure that must specify the persons who have access to the test results and the purposes for which the test results may be used;\n(3) a licensed physician, advanced practice registered nurse, or physician assistant for the emergency medical services person needs the test results for beginning, continuing, modifying, or discontinuing medical treatment for the emergency medical services person; and\n(4) the court finds a compelling need for the test results. In assessing compelling need, the court shall weigh the need for the court-ordered blood collection and test results against the interests of the source individual, including, but not limited to, privacy, health, safety, or economic interests. The court shall also consider whether the involuntary blood collection and testing would serve the public interest.\n(d) The court shall conduct the proceeding in camera unless the petitioner or the source individual requests a hearing in open court and the court determines that a public hearing is necessary to the public interest and the proper administration of justice.\n(e) The court shall conduct an ex parte hearing if the source individual does not attend the noticed hearing and the petitioner complied with the notice requirements in paragraph (a).\n(f) The source individual has the right to counsel in any proceeding brought under this subdivision.\n(g) The court may order a source individual taken into custody by a peace officer for purposes of obtaining a blood sample if the source individual does not comply with an order issued by the court pursuant to paragraph (c). The source individual shall be held no longer than is necessary to secure a blood sample. A person may not be held for more than 24 hours without receiving a court hearing.",
	"repealed": false
}