{
	"id": "148.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.65",
	"title": "148.65 DEFINITIONS.",
	"text": "As used in sections 148.65 to 148.78 the term \"physical therapy\" means the evaluation or treatment or both of any person by the employment of physical measures and the use of therapeutic exercises and rehabilitative procedures, with or without assistive devices, for the purpose of preventing, correcting, or alleviating a physical or mental disability. Physical measures shall include but shall not be limited to heat or cold, air, light, water, electricity and sound. Physical therapy includes evaluation other than medical diagnosis, treatment planning, treatment, documentation, performance of appropriate tests and measurement, interpretation of orders or referrals, instruction, consultative services, and supervision of supportive personnel. \"Physical therapy\" does not include the practice of medicine as defined in section 147.081, or the practice of chiropractic as defined in section 148.01.\n\"Physical therapist\" means a person licensed by the board who practices physical therapy as defined in sections 148.65 to 148.78.\n\"Physical therapist assistant\" means a person licensed by the board who provides physical therapy under the direction and supervision of a physical therapist, and who performs physical therapy interventions and assists with coordination, communication, documentation, and patient-client-related instruction.\n\"Physical therapy aide\" means a person, working under the direct supervision of a physical therapist, who is not a physical therapist assistant as defined in subdivision 3, who performs tasks as provided under section 148.706.\n\"Student physical therapist\" means a person in a professional educational program, approved by the board under section 148.705, who is satisfying supervised clinical education requirements by performing physical therapy under the on-site supervision of a licensed physical therapist. \"On-site supervision\" means the physical therapist is easily available for instruction to the student physical therapist. The physical therapist shall have direct contact with the patient during at least every second treatment session by the student physical therapist. Telecommunications, except within the facility, does not meet the requirement of on-site supervision.\n\"Student physical therapist assistant\" means a person in a physical therapist assistant educational program accredited by the Commission on Accreditation in Physical Therapy Education (CAPTE) or a recognized comparable national accrediting agency approved by the board. The student physical therapist assistant, under the direct supervision of the physical therapist, or the direct supervision of the physical therapist and physical therapist assistant, performs physical therapy interventions and assists with coordination, communication, documentation, and patient-client-related instruction. \"Direct supervision\" means the physical therapist is physically present and immediately available to provide instruction to the student physical therapist assistant.\n\"Supportive personnel\" means a physical therapist assistant and a physical therapy aide.\n\"Licensee\" means a person licensed as a physical therapist or a physical therapist assistant.\n\"Licensed health care professional\" or \"licensed health care provider\" means a person licensed in good standing in Minnesota to practice medicine, osteopathic medicine, chiropractic, podiatry, dentistry, or advanced practice nursing.",
	"repealed": false
}