{
	"id": "150A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.02",
	"title": "150A.02 BOARD OF DENTISTRY.",
	"text": "There is hereby created a Board of Dentistry whose duty it shall be to carry out the purposes and enforce the provisions of sections 150A.01 to 150A.12. The board shall consist of two public members as defined by section 214.02, five qualified resident dentists, one qualified resident licensed dental assistant, and one qualified resident dental hygienist appointed by the governor. Membership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements shall be as provided in sections 214.07 to 214.09. The provision of staff, administrative services and office space; the review and processing of board complaints; the setting of board fees; and other provisions relating to board operations shall be as provided in chapter 214. Each board member who is a dentist, licensed dental assistant, or dental hygienist shall have been lawfully in active practice in this state for five years immediately preceding appointment; and no board member shall be eligible for appointment to more than two consecutive four-year terms, and members serving on the board at the time of the enactment hereof shall be eligible to reappointment provided they shall not have served more than nine consecutive years at the expiration of the term to which they are to be appointed. At least 90 days prior to the expiration of the terms of dentists, licensed dental assistants, or dental hygienists, the Minnesota Dental Association, Minnesota Dental Assistants Association, or the Minnesota Dental Hygienists' Association shall recommend to the governor for each term expiring not less than two dentists, two licensed dental assistants, or two dental hygienists, respectively, who are qualified to serve on the board, and from the list so recommended the governor may appoint members to the board for the term of four years, the appointments to be made within 30 days after the expiration of the terms. Within 60 days after the occurrence of a dentist, licensed dental assistant, or dental hygienist vacancy, prior to the expiration of the term, in the board, the Minnesota Dental Association, the Minnesota Dental Assistants Association, or the Minnesota Dental Hygienists' Association shall recommend to the governor not less than two dentists, two licensed dental assistants, or two dental hygienists, who are qualified to serve on the board and from the list so recommended the governor, within 30 days after receiving such list of dentists, may appoint one member to the board for the unexpired term occasioned by such vacancy. Any appointment to fill a vacancy shall be made within 90 days after the occurrence of such vacancy. The first four-year term of the dental hygienist and of the licensed dental assistant shall commence on the first Monday in January, 1977.\nMS 1974 [Repealed, 1975 c 136 s 77]",
	"repealed": false
}