{
	"id": "297B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/297B.07",
	"title": "297B.07 PRESUMPTIONS.",
	"text": "For the purpose of the proper administration of this chapter, and to prevent evasion of the tax, the following presumptions shall apply:\n(a) Evidence that a motor vehicle was sold for delivery in this state shall be prima facie evidence that it was sold for use in this state.\n(b) When an application for registration plates for a motor vehicle is received by the motor vehicle registrar within 30 days of the date it was purchased or acquired by the purchaser, it shall be presumed, until the contrary is shown by the purchaser, that it was purchased or acquired for use in this state. This presumption shall apply whether or not such vehicle was previously titled or registered in another state.\n(a) When a business entity not organized under the laws of this state owns a motor vehicle that is under the control of a Minnesota resident, it is presumed that the Minnesota resident is the owner of the motor vehicle if two or more of the following are true:\n(1) the business entity lacks a specific business activity or purpose other than the avoidance of tax;\n(2) the business entity maintains no physical location in the jurisdiction where it is organized;\n(3) the business entity earns de minimis or no revenue;\n(4) the business entity maintains minimal or no business records;\n(5) the business entity fails to employ individual persons and provide those persons with federal income tax W-2 wage and tax statements; or\n(6) the business entity fails to file federal income tax returns or fails to file a required state tax return where it is organized.\n(b) For purposes of this subdivision, a motor vehicle is under the control of a Minnesota resident if the Minnesota resident:\n(1) is a partner, member, or shareholder of the business entity;\n(2) is insured to drive the vehicle; and\n(3) operates or stores the vehicle in Minnesota for any period of time.",
	"repealed": false
}