{
	"id": "144.1201",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1201",
	"title": "144.1201 DEFINITIONS.",
	"text": "For purposes of sections 144.1201 to 144.1204, the terms defined in this section have the meanings given to them.\n\"Byproduct material\" means:\n(1) any radioactive material, except special nuclear material, yielded in or made radioactive by exposure to the radiation incident to the process of producing or using special nuclear material;\n(2) the tailings or wastes produced by the extraction or concentration of uranium or thorium from ore processed primarily for its source material content, including discrete surface wastes resulting from uranium solution extraction processes. Underground ore bodies depleted by these solution extraction operations do not constitute byproduct material within this definition;\n(3) any discrete source of radium-226 that is produced, extracted, or converted after extraction for commercial, medical, or research activity, or any material that:\n(i) has been made radioactive by use of a particle accelerator; and\n(ii) is produced, extracted, or converted after extraction for commercial, medical, or research activity; and\n(4) any discrete source of naturally occurring radioactive material, other than source nuclear material, that:\n(i) the United States Nuclear Regulatory Commission, in consultation with the Administrator of the Environmental Protection Agency, the Secretary of Energy, the Secretary of Homeland Security, and the head of any other appropriate federal agency determines would pose a threat similar to the threat posed by a discrete source of radium-226 to the public health and safety or the common defense and security; and\n(ii) is extracted or converted after extraction for use in a commercial, medical, or research activity.\n\"Radiation\" means ionizing radiation and includes alpha rays; beta rays; gamma rays; x-rays; high energy neutrons, protons, or electrons; and other atomic particles.\n\"Radioactive material\" means a matter that emits radiation. Radioactive material includes special nuclear material, source nuclear material, and byproduct material.\n\"Source nuclear material\" means uranium or thorium, or a combination thereof, in any physical or chemical form; or ores that contain by weight 1/20 of one percent (0.05 percent) or more of uranium, thorium, or a combination thereof. Source nuclear material does not include special nuclear material.\n\"Special nuclear material\" means:\n(1) plutonium, uranium enriched in the isotope 233 or in the isotope 235, and any other material that the Nuclear Regulatory Commission determines to be special nuclear material according to United States Code, title 42, section 2071, except that source nuclear material is not included; and\n(2) a material artificially enriched by any of the materials listed in clause (1), except that source nuclear material is not included.",
	"repealed": false
}