{
	"id": "574.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/574.08",
	"title": "574.08 PROTECTION OF PLEDGE ON COMMENCING ACTION.",
	"text": "Any person entitled to the protection of such pledge, wishing to take advantage of its benefits at the time of commencing any action against either the contractor or any subcontractor engaged in such work, shall notify, in writing, the state or corporation or department with which such pledge is made, of the commencement of such suit, giving the names of the parties and the amount and nature of the claim. No judgment shall be entered within 30 days after the giving of such notice and the state or other corporation or department with which such bonds are pledged and any other person entitled to the protection of such pledge may be admitted on its motion as a party to the action, and the court shall determine the rights of all parties in the premises. In such suit or other appropriate action in which the corporation or department holding the bonds is a party, the court may order the bonds, or a part of them sufficient to pay the unpaid claims, sold at public auction or private sale or on the New York stock exchange and from the proceeds, after deducting the costs of sale, make payments among the parties to the suit entitled thereto; if the proceeds are insufficient to pay the claims in full, they may be paid pro rata. If the state or other corporation or department does not appear and defend, it may, after entry of judgment in favor of such claimants, enforce the pledge and sell the securities at public or private sale or upon the New York stock exchange, and it shall have in addition any and all rights and remedies given pledgees by law for the enforcement of their securities, but it shall not be required to sell such security until 90 days after completion of contract and acceptance of the work done, as provided in section 574.09, or until the work is completed at the instance of the corporation if abandoned by the contractor.",
	"repealed": false
}