{
	"id": "123B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.09",
	"title": "123B.09 BOARDS OF INDEPENDENT SCHOOL DISTRICTS.",
	"text": "The care, management, and control of independent districts is vested in a board of directors, to be known as the school board. The term of office of a member shall be four years commencing on the first Monday in January and until a successor qualifies. The membership of the board shall consist of six elected directors together with such ex officio member as may be provided by law. The board may submit to the electors at any school election the question whether the board shall consist of seven members. If a majority of those voting on the proposition favor a seven-member board, a seventh member shall be elected at the next election of directors for a four-year term and thereafter the board shall consist of seven members.\nThose districts with a seven-member board may submit to the electors at any school election at least 150 days before the next election of three members of the board the question whether the board shall consist of six members. If a majority of those voting on the proposition favor a six-member board instead of a seven-member board, three members instead of four members shall be elected at the next election of the board of directors and thereafter the board shall consist of six members.\nA sex offender who has been convicted of an offense for which registration under section 243.166 is required is ineligible to become a candidate for the office of school board member, as defined in subdivision 1. Ineligibility is determined by the registration requirements in effect at the time the offender files for office, not by the registration requirements, if any, that were in effect at the time the offender was convicted.\nA member shall receive training in school finance and management developed in consultation with the Minnesota School Boards Association and consistent with section 127A.19. The School Boards Association must make available to each newly elected school board member training in school finance and management consistent with section 127A.19 within 180 days of that member taking office. The program shall be developed in consultation with the department and appropriate representatives of higher education.\nA vacancy in any board occurs when a member (a) dies, (b) resigns, (c) ceases to be a resident of the district, or (d) is unable to serve on such board and attend its meetings for not less than 90 days because of illness or prolonged absence from the district.\nA vacancy caused by a member being unable to serve on such board and attend its meetings for not less than 90 days because of illness or prolonged absence from the district, may, after the board has by resolution declared such vacancy to exist, be filled by the board at any regular or special meeting thereof for the remainder of the unexpired term, or until such ill or absent member is again able to resume duties as a member of such board, whichever date is earliest. When the ill or absent member is able to resume duties as a member of the board, the board must by resolution so determine and declare such person to be again a member of the board, and the member appointed by the board to be no longer a member thereof.\n[Repealed, 2015 c 70 art 1 s 63]\n[Repealed, 2016 c 161 art 2 s 2]\n(a) Any vacancy on the board, other than a vacancy described in subdivision 4, must be filled by board appointment at a regular or special meeting. The appointment shall be evidenced by a resolution entered in the minutes and shall be effective 30 days following adoption of the resolution, subject to paragraph (d). If the appointment becomes effective, it shall continue for the remainder of the unexpired term or until an election is held under this subdivision, as applicable. All elections to fill vacancies shall be for the unexpired term. A special election to fill the vacancy must be held no later than the first Tuesday after the first Monday in November following the vacancy. If the vacancy occurs less than 90 days prior to the first Tuesday after the first Monday in November in the year in which the vacancy occurs, the special election must be held no later than the first Tuesday after the first Monday in November of the following calendar year.\n(b) Notwithstanding paragraph (a), if the vacancy occurs less than two years prior to the expiration of the term, no special election is required and the appointee of the board shall serve for the remainder of the unexpired term, subject to paragraph (d).\n(c) Notwithstanding paragraph (a), if the vacancy occurs less than 90 days prior to the expiration of the term, the board may, but is not required to, fill the vacancy by board appointment at a regular or special meeting.\n(d) Notwithstanding paragraphs (a) and (b), if the vacancy occurs because a school board member was removed pursuant to section 123B.09, subdivision 9, a special election must be held to fill the vacancy as soon as possible on a uniform election date. This paragraph does not apply if the vacancy occurs after candidate filing begins under section 205A.06 in the year preceding the end of the term.\n(e) An appointment made under paragraph (a) shall not be effective if a petition to reject the appointee is filed with the school district clerk. To be valid, a petition to reject an appointee must be signed by a number of eligible voters residing in the district equal to at least five percent of the total number of voters voting in the district at the most recent state general election, and must be filed within 30 days of the board's adoption of the resolution making the appointment. If a valid petition is filed according to the requirements of this paragraph, the appointment by the school board is ineffective and the board must name a new appointee as provided in paragraph (a).\nA majority of the voting members of the board shall constitute a quorum. No contract shall be made or authorized, except at a regular meeting of the board or at a special meeting at which all members are present or of which all members have had notice. Special meetings may be called by the chair or clerk or any three members upon notice mailed to each member at least three days prior thereto.\nThe board shall make, and when deemed advisable, change or repeal rules relating to the organization and management of the board and the duties of its officers.\nThe board must superintend and manage the schools of the district; adopt rules for their organization, government, and instruction; keep registers; and prescribe textbooks and courses of study. The board may enter into an agreement with a postsecondary institution for secondary or postsecondary nonsectarian courses to be taught at a secondary school, nonsectarian postsecondary institution, or another location.\nThe board may remove, for proper cause, any member or officer of the board and fill the vacancy; but such removal must be by a concurrent vote of at least four members, at a meeting of whose time, place, and object the charged member has been duly notified, with the reasons for such proposed removal and after an opportunity to be heard in defense against the removal.\nThe board must cause its official proceedings to be published once in the official newspaper of the district. Such publication shall be made within 30 days of the meeting at which such proceedings occurred. If the board determines that publication of a summary of the proceedings would adequately inform the public of the substance of the proceedings, the board may direct that only a summary be published, conforming to the requirements of section 331A.01, subdivision 10.\nIf a board of a district that has no newspaper with its known office of issue or a secondary office located within the boundaries of the district and no newspaper that is distributed to more than one-third of the residences in the district determines that mailing a summary of its proceedings would be more economical than publication of the proceedings and that it would adequately inform the public, it may mail a summary of its proceedings to each residence in the district that can be identified as a homestead from the property tax records and to each other residence in the district that the board can identify. The county must make the property tax records available to the board for this purpose. The board must keep a copy of the summary of the proceedings as part of its records. The decision of a board to mail summaries, rather than publish the proceedings under this subdivision shall be presumed valid, subject to challenge by a court action.\nThe clerk, treasurer, and superintendent of any district shall receive such compensation as may be fixed by the board. Unless otherwise provided by law, the other members of the board shall also receive such compensation as may be fixed by the board. All members of the board may receive reimbursement for transportation at the rate provided for in section 471.665. No board member or school district employee shall receive any compensation or benefits based on incentives or other money provided to the school district by or from a source of group insurance coverage referenced in section 471.6161, subdivision 1, except for a refund provided under section 123B.75, subdivision 10, or a wellness plan that is mutually agreed upon by the district and the exclusive representatives of employees.",
	"repealed": false
}