{
	"id": "148.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.231",
	"title": "148.231 REGISTRATION; FAILURE TO REGISTER; REREGISTRATION; VERIFICATION.",
	"text": "(a) Every person licensed to practice advanced practice, professional, or practical nursing must maintain with the board a current registration for practice as an advanced practice registered nurse, registered nurse, or licensed practical nurse which must be renewed at regular intervals established by the board by rule. No registration shall be issued by the board to a nurse until the nurse has submitted satisfactory evidence of compliance with the procedures and minimum requirements established by the board.\n(b) Upon receipt of the application and the required fees, as determined under section 148.243, the board shall verify the application and the evidence of completion of continuing education requirements in effect, and issue to the nurse registration for the next renewal period.\n(c) An applicant for advanced practice registered nursing (APRN) renewal must provide evidence of current certification or recertification in the appropriate APRN role in at least one population focus by a nationally accredited certifying body recognized by the board.\n[Repealed, 1981 c 94 s 12]\n[Repealed, 1976 c 222 s 209]\nAny person licensed under the provisions of sections 148.171 to 148.285 who fails to register within the required period shall not be entitled to practice nursing in this state as an advanced practice registered nurse, a registered nurse, or a licensed practical nurse.\nA person whose registration has lapsed desiring to resume practice shall make application for reregistration, submit satisfactory evidence of compliance with the procedures and requirements established by the board, and pay the reregistration fee for the current period to the board. A penalty fee shall be required from a person who practiced nursing without current registration. Thereupon, registration shall be issued to the person who shall immediately be placed on the practicing list as an advanced practice registered nurse, a registered nurse, or a licensed practical nurse.\nA person licensed under the provisions of sections 148.171 to 148.285 who requests the board to verify a Minnesota license to another state, territory, or country or to an agency, facility, school, or institution shall pay a fee for each verification.",
	"repealed": false
}