{
	"id": "135A.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.162",
	"title": "135A.162 INCLUSIVE HIGHER EDUCATION GRANTS.",
	"text": "(a) The commissioner of the Office of Higher Education in collaboration with the director of the Inclusive Higher Education Technical Assistance Center must establish a competitive grant program for Minnesota institutions of higher education to develop new or enhance existing inclusive higher education initiatives to enroll or increase enrollment of students with an intellectual disability. The commissioner and director must collaborate to establish the grant program framework, including:\n(1) minimum grant requirements;\n(2) application format;\n(3) criteria for evaluating applications;\n(4) grant selection process;\n(5) milestones and accountability; and\n(6) reporting.\n(b) The commissioner must send a description of the competitive grants, including materials describing the grant purpose and goals, an application, compliance requirements, and available funding to each institution of higher education that meets the requirements of subdivision 2, clauses (1) and (2).\nA Tribal college or public or nonprofit postsecondary two-year or four-year institution is eligible to apply for a grant under this section if the institution:\n(1) is accredited by the Higher Learning Commission; and\n(2) meets the eligibility requirements under section 136A.103.\n(a) Applications must be made to the commissioner on a form developed and provided by the commissioner. The commissioner must, to the greatest extent possible, make the application form as short and simple to complete as is reasonably possible. The commissioner must establish a schedule for applications and grants. The application must include without limitation a written plan to develop or enhance a sustainable inclusive higher education initiative that:\n(1) offers the necessary supports to students with an intellectual disability to access the same rights, privileges, experiences, benefits, and outcomes of a typically matriculating student;\n(2) includes the development of a meaningful credential for students with an intellectual disability to attain upon successful completion of the student's postsecondary education;\n(3) adopts admission standards that do not require a student with an intellectual disability to complete a curriculum-based, achievement college entrance exam that is administered nationwide;\n(4) ensures that students with an intellectual disability:\n(i) have access and choice in a wide array of academic courses to enroll in for credit or audit that align with the student's interest areas and are attended by students without disabilities;\n(ii) have the option to live on or off campus in housing that is available to typically matriculating students;\n(iii) have access and support for genuine membership in campus life, including events, social activities and organizations, institution facilities, and technology; and\n(iv) are able to access and utilize campus resources available to typical matriculating students;\n(5) provides students with an intellectual disability with the supports and experiences necessary to seek and sustain competitive integrated employment;\n(6) develops and promotes the self-determination skills of students with an intellectual disability;\n(7) utilizes peer mentors who support enrolled students with an intellectual disability in academic, campus engagement, residence life, employment, and campus clubs and organizations;\n(8) provides professional development and resources for university professors and instructors to utilize universal design for learning and differentiated instruction that supports and benefits all students; and\n(9) presents a ten-year plan including student enrollment projections for sustainability of an initiative that is financially accessible and equitable for all interested students with an intellectual disability.\n(b) Eligible institutions of higher education may apply for funding in subsequent years for up to a total of ten years of funding.\n(c) Receipt of grant funds does not preclude nor replace the provision of accommodation for enrolled students with disabilities.\nAn inclusive higher education grant account is created in the special revenue fund for depositing money appropriated to or received by the commissioner for the program. Money deposited in the account is appropriated to the commissioner, does not cancel, and is continuously available for grants under this section. The commissioner may use up to five percent of the amount deposited into the account for the administration of this section.\n(a) The commissioner must award grants to eligible institutions of higher education on a competitive basis using criteria established in collaboration with the center. The commissioner must consider and prioritize applicants that have submitted for or received a comprehensive transition and postsecondary program designation, or applicants with documented progress or intent toward submitting for federal approval. An eligible institution of higher education may apply annually for and receive up to $200,000 per year for four years and $100,000 in subsequent years pending performance and the funding limitation in subdivision 3, paragraph (b).\n(b) A grant recipient must:\n(1) adopt the model Program Accreditation Standards for Postsecondary Education Programs for Students with Intellectual Disabilities and the inclusive higher education guiding principles as developed by the National Coordinating Center;\n(2) provide a 25 percent match for the grant funds, either monetary or in-kind; and\n(3) collaborate with the Office of Higher Education, the center, and key stakeholders in the development of the inclusive higher education initiative.\nBy August 1 and January 1 following a fiscal year in which a grant was received and for five years thereafter, the grantee must submit a report to the director that includes the status and outcomes of the initiative funded. The report must include performance indicators and information deemed relevant by the director and commissioner. The report must include the following performance indicators:\n(1) student recruitment and number of students enrolled;\n(2) student retainment effort and retention rate;\n(3) initiative goals and outcomes;\n(4) student attainment rate;\n(5) graduated student employment rates and salary levels at year one and year five after completion; and\n(6) additional performance indicators or information established under subdivision 1, paragraph (a), clauses (5) and (6).\nMS 2023 Supp [Repealed, 2024 c 124 art 2 s 48; 2024 c 127 art 35 s 48]",
	"repealed": false
}