{
	"id": "298.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.22",
	"title": "298.22 IRON RANGE RESOURCES AND REHABILITATION.",
	"text": "(a) The Department of Iron Range Resources and Rehabilitation is created as an agency in the executive branch of state government. The governor shall appoint the commissioner of Iron Range resources and rehabilitation under section 15.06. The commissioner may expend amounts appropriated to the commissioner for projects after consultation with the advisory board created under subdivision 1a.\n(b) The commissioner may hold other positions or appointments that are not incompatible with duties as commissioner of Iron Range resources and rehabilitation. The commissioner may appoint a deputy commissioner. All expenses of the commissioner, including the payment of staff and other assistance as may be necessary, must be paid out of the amounts appropriated by section 298.28 or otherwise made available by law to the commissioner. Notwithstanding chapters 16A, 16B, and 16C, the commissioner may utilize contracting options available under section 471.345 when the commissioner determines it is in the best interest of the agency. The agency is not subject to sections 16E.016 and 16C.05. The commissioner has the authority to reimburse any nongovernmental manager operating state-owned facilities within the Giants Ridge Recreation Area for purchasing materials, supplies, equipment, or other items used in the operations at such facilities.\n(c) When the commissioner determines that distress and unemployment exists or may exist in the future in any county by reason of the removal of natural resources or a possibly limited use of natural resources in the future and any resulting decrease in employment, the commissioner may use whatever amounts of the appropriation made to the commissioner of revenue in section 298.28 that are determined to be necessary and proper in the development of the remaining resources of the county and in the vocational training and rehabilitation of its residents. For the purposes of this section, \"development of remaining resources\" includes, but is not limited to, the promotion of tourism.\n(a) The Iron Range Resources and Rehabilitation Board consists of the state senators and representatives elected from state senatorial or legislative districts in which one-third or more of the residents reside in a taconite assistance area as defined in section 273.1341. One additional state senator shall also be appointed by the senate Subcommittee on Committees of the Committee on Rules and Administration. All expenditures and projects made by the commissioner shall first be submitted to the advisory board. The advisory board shall recommend approval or disapproval or modification of the expenditures and projects. The expenses of the advisory board shall be paid by the state from the funds raised pursuant to this section. Members of the advisory board may be reimbursed for expenses in the manner provided in sections 3.099, subdivision 1, and 3.101, and may receive per diem payments during the interims between legislative sessions in the manner provided in section 3.099, subdivision 1.\nThe members shall be appointed in January of every odd-numbered year, and shall serve until January of the next odd-numbered year. Vacancies on the board shall be filled in the same manner as original members were chosen.\n(b) The advisory board must develop procedures to elect a chair who shall preside over and convene meetings as often as necessary to conduct duties prescribed by this chapter. The advisory board must meet at least two times per year to review the actions of the commissioner.\n(a) In evaluating programs proposed by the commissioner, the advisory board must consider factors, including but not limited to the extent to which the program:\n(1) contributes to increasing the effectiveness of promoting or managing Iron Range economic and workforce development, community development, minerals and natural resources development, and any other issue as determined by the advisory board; and\n(2) advances the strategic plan adopted under subdivision 1c.\n(b) In evaluating programs proposed by the commissioner, the advisory board must consider factors, including but not limited to:\n(1) job creation or retention goals for the program, including but not limited to wages and benefits; whether the jobs created are full time, part time, temporary, or permanent; and whether the stated job creation or retention goals in the program proposal can be adequately measured using methods established by the commissioner;\n(2) how and to what extent the program is expected to impact the economic climate of the Iron Range resources and rehabilitation services area;\n(3) how the program would meet match requirements, if any; and\n(4) whether the program meets the written objectives, priorities, and policies established by the commissioner.\nThe commissioner, in consultation with the advisory board, shall adopt a four-year strategic plan for making expenditures, including identifying the priority areas for funding for the term of the commissioner's appointment. The strategic plan must be reviewed annually. The strategic plan must have clearly stated short- and long-term goals and strategies for expenditures, provide measurable outcomes for expenditures, and determine areas of emphasis for funding.\n[Repealed, 2013 c 3 s 27]\nWhenever the commissioner of Iron Range resources and rehabilitation has made determinations required by subdivision 1 and has determined that distress and unemployment exists or may exist in the future in any county by reason of the removal of the natural resources or a possible limited use thereof in the future and the decrease in employment resulting therefrom and deems that the acquirement of real estate or personal property is necessary and proper in the development of the remaining resources, the commissioner may acquire such property or interests therein by gift, purchase, or lease. The commissioner may purchase insurance to protect any property acquired from loss or damage by fire, or to protect the commissioner from any liability the commissioner may incur by reason of ownership of the property, or both. If after such property is acquired it is necessary in the judgment of the commissioner to acquire a right-of-way for access to projects operated on property acquired by gift, purchase, or lease, said right-of-way may be acquired by condemnation in the manner provided by law. If the owner or operator of an iron mine or related production or beneficiation facilities discontinues the operation of the mine or facilities for any reason, the commissioner may acquire any or all of the mine lands and related facilities by gift, purchase, lease, or condemnation in the manner provided in chapter 117.\nWhenever property has been granted and conveyed to the state of Minnesota in accordance with an agreement made by the commissioner of Iron Range resources and rehabilitation and the commissioner of administration for the necessary and proper development of the remaining resources of any distressed county, such grants, and conveyances or leases are hereby accepted in accordance with the terms and conditions thereof.\nIn order to carry out the terms and provisions of this section, the commissioner of Iron Range resources and rehabilitation and the commissioner of administration may lease any property acquired hereunder for a term not to exceed 20 years upon such terms as they may determine, provided that such property shall not be leased to any person in such a manner as to constitute a direct contribution of working capital to a business enterprise. Such lease may provide that in the event the property is ever sold by the state to such lessee, the lessee may obtain a credit on the purchase price covering the rentals paid under the lease or any renewals thereof and that said real estate can be conveyed by the commissioner of Iron Range resources and rehabilitation and the commissioner of administration and the said commissioners are hereby authorized to make such conveyances.\nThe commissioner, after consultation with the advisory board, may purchase forest lands in the taconite assistance area defined under section 273.1341 with funds specifically authorized for the purchase. The acquired forest lands must be held in trust for the benefit of the citizens of the taconite assistance area as the Iron Range Miners' Memorial Forest. The forest trust lands shall be managed and developed for recreation and economic development purposes. The commissioner, after consultation with the advisory board, may sell forest lands purchased under this subdivision if the commissioner determines that the sale advances the purposes of the trust. Proceeds derived from the management or sale of the lands and from the sale of timber or removal of gravel or other minerals from these forest lands shall be deposited into an Iron Range Miners' Memorial Forest account that is established within the state financial accounts. Funds may be expended from the account by the commissioner, after consultation with the advisory board, to purchase, manage, administer, convey interests in, and improve the forest lands. After consultation with the advisory board, the commissioner may transfer money in the Iron Range Miners' Memorial Forest account into the corpus of the Douglas J. Johnson economic protection trust fund established under sections 298.291 to 298.294. The property acquired under the authority granted by this subdivision and income derived from the property or the operation or management of the property are exempt from taxation by the state or its political subdivisions while held by the forest trust.\nThe commissioner, after consultation with the advisory board, may acquire an equity interest in any project for which the commissioner provides funding. The commissioner may, after consultation with the advisory board, establish, participate in the management of, and dispose of the assets of charitable foundations, nonprofit limited liability companies, and nonprofit corporations associated with any project for which the commissioner provides funding, including specifically, but without limitation, a corporation within the meaning of section 317A.011, subdivision 6.\n(a) In addition to the other powers granted in this section and other law and notwithstanding any limitations contained in subdivision 5, the commissioner, for purposes of fostering economic development and tourism within the Giants Ridge Recreation Area or the Ironworld Discovery Center area, may spend any money made available to the agency under section 298.28 to acquire real or personal property or interests therein by gift, purchase, or lease and may convey by lease, sale, or other means of conveyance or commitment any or all property interests owned or administered by the commissioner within such areas.\n(b) In furtherance of development of the Giants Ridge Recreation Area or the Ironworld Discovery Center area, the commissioner may establish and participate in charitable foundations, nonprofit limited liability companies, and nonprofit corporations, including a corporation within the meaning of section 317A.011, subdivision 6.\n(c) The term \"Giants Ridge Recreation Area\" refers to an economic development project area established by the commissioner in furtherance of the powers delegated in this section within St. Louis County in the following portions of the town of White and the city of Biwabik:\nTownship 59 North, Range 15 West, Sections 7, 8, 17-20 and 29-32;\nTownship 59 North, Range 16 West, Sections 12, 13, 24, 25, and 36;\nTownship 58 North, Range 16 West, Section 1; and\nTownship 58 North, Range 15 West, Sections 5 and 6.\n(d) \"Ironworld Discovery Center Area\" means an economic development and tourism promotion project area established by the commissioner in furtherance of the powers delegated in this section within St. Louis County in the south portion of the town of Balkan.\n[Repealed, 2017 c 94 art 7 s 60]\nIn the promotion of tourism, trade, and economic development, the commissioner may expend money made available to the agency under section 298.28 in the same manner as private persons, firms, corporations, and associations make expenditures for these purposes. An expenditure for food, lodging, or travel is not governed by the travel rules of the commissioner of management and budget.\nThe commissioner of Iron Range resources and rehabilitation may not sell or privatize the Minnesota Discovery Center or Giants Ridge Golf and Ski Resort without prior approval by the advisory board.\nThe commissioner of Iron Range resources and rehabilitation shall annually prepare a budget for operational expenditures, programs, and projects, and submit it to the Iron Range Resources and Rehabilitation Board. After the budget is approved by the advisory board and the governor, the commissioner may spend money in accordance with the approved budget.\n[Repealed, 2012 c 290 s 72]\n(a) Prior to awarding any grants or approving loans from any fund or account from which the commissioner has the authority under law to expend money, the commissioner must evaluate applications based on criteria including, but not limited to:\n(1) job creation or retention goals for the project, including but not limited to wages and benefits, and whether the jobs created are full time, part time, temporary, or permanent;\n(2) whether the applicant's stated job creation or retention goals can be adequately measured using methods established by the commissioner;\n(3) how and to what extent the project proposed by the applicant is expected to impact the economic climate of the Iron Range resources and rehabilitation services area;\n(4) how the applicant would meet match requirements, if any; and\n(5) whether the project for which a grant or loan application has been submitted meets the written objectives, priorities, and policies established by the commissioner.\n(b) The commissioner, if appropriate, may include incentives in loan and grant award agreements to promote and assist grant recipients in achieving the stated job creation and retention objectives established by the commissioner.\n(c) For all loans and grants awarded from funds under the commissioner's authority pursuant to this chapter, the commissioner must:\n(1) maintain a database for tracking loan and grant awards;\n(2) maintain an objective mechanism for measuring job creation and retention;\n(3) verify achievement of job creation and retention goals by grant and loan recipients;\n(4) monitor grant and loan awards to ensure that projects comply with applicable Iron Range resources and rehabilitation policies; and\n(5) verify that grant or loan recipients have met applicable matching fund requirements.",
	"repealed": false
}