{
	"id": "270A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/270A.07",
	"title": "270A.07 PROCEDURE FOR SETOFF COLLECTION.",
	"text": "(a) Any claimant agency, seeking collection of a debt through setoff against a refund due, shall submit to the commissioner information indicating the amount of each debt and information identifying the debtor, as required by section 270A.04, subdivision 3.\n(b) For each setoff of a debt against a refund due, the commissioner shall charge a fee of $15. The proceeds of fees shall be allocated by depositing $4 of each $15 fee collected into a Department of Revenue recapture revolving fund and depositing the remaining balance into the general fund. The sums deposited into the revolving fund are appropriated to the commissioner for the purpose of administering the Revenue Recapture Act.\n(c) The claimant agency shall notify the commissioner when a debt has been satisfied or reduced by at least $200 within 30 days after satisfaction or reduction.\n(a) The commissioner, upon receipt of notification, shall initiate procedures to detect any refunds otherwise payable to the debtor. When the commissioner determines that a refund is due to a debtor whose debt was submitted by a claimant agency, the commissioner shall first deduct the fee in subdivision 1, paragraph (b), and then remit the refund or the amount claimed, whichever is less, to the agency. In transferring or remitting moneys to the claimant agency, the commissioner shall provide information indicating the amount applied against each debtor's obligation and the debtor's address listed on the tax return.\n(b) The commissioner shall remit to the debtor the amount of any refund due in excess of the debt submitted for setoff by the claimant agency. Notice of the amount set off and address of the claimant agency shall accompany any disbursement to the debtor of the balance of a refund, or shall be sent to the debtor at the time of setoff if the entire refund is set off. The notice shall also advise the debtor of the right to contest the validity of the claim, other than a claim based upon child support under chapter 518A or 518C at a hearing, subject to the restrictions in this paragraph. The debtor must assert this right by written request to the claimant agency, which request the claimant agency must receive within 45 days of the date of the notice. This right does not apply to (1) issues relating to the validity of the claim that have been previously raised at a hearing under this section or section 270A.09; (2) issues relating to the validity of the claim that were not timely raised by the debtor under section 270A.08, subdivision 2; (3) issues relating to the validity of the claim that have been previously raised at a hearing conducted under rules promulgated by the United States Department of Housing and Urban Development or any public agency that is responsible for the administration of a low-income housing program, or that were not timely raised by the debtor under those rules; or (4) issues relating to the validity of the claim for which a hearing is discretionary under section 270A.09. The notice shall include an explanation of the right of the spouse who does not owe the debt to request the claimant agency to repay the spouse's portion of a joint refund.\nAny amounts remitted or transferred to state agencies shall be deposited as provided in section 16A.72.\nTransfer or remittance of funds to a claimant agency pursuant to this section constitutes payment of the department's obligation to refund the sums as overpayments of taxes or property tax credits or refunds. Any action for the setoff funds shall be made against the claimant agency pursuant to section 270A.09.\nAny refund wrongfully or incorrectly applied to a debt and transferred to a claimant agency shall be paid by the agency to the debtor. The sum wrongfully or incorrectly withheld shall bear interest at the rate specified in section 270C.405, computed from the date when the refund would begin to bear interest under section 289A.56, subdivision 2, regardless of whether the refund is payable under chapter 290 or 290A. If the claimant agency is a state agency, the payment shall be made out of the agency's appropriation.",
	"repealed": false
}