{
	"id": "125A.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.27",
	"title": "125A.27 DEFINITIONS.",
	"text": "For the purposes of sections 125A.259 to 125A.48, the following terms have the meanings given them.\n\"Coordinate\" means to provide ready access to a community's services and resources to meet child and family needs.\n\"Core early intervention services\" means services that are available at no cost to children and families. These services include:\n(1) identification and referral;\n(2) screening;\n(3) evaluation;\n(4) assessment;\n(5) service coordination;\n(6) special education and related services provided under section 125A.08, and United States Code, title 20, section 1401; and\n(7) protection of parent and child rights by means of procedural safeguards.\n\"County board\" means a county board established under chapter 375.\n\"Early intervention record\" means any personally identifiable information about a child or the child's family that is generated by the early intervention system, and that pertains to evaluation and assessment, development of an individualized family service plan, and the delivery of early intervention services.\n\"Early intervention services\" means services provided in conformity with an individualized family service plan that are designed to meet the special developmental needs of a child eligible under Code of Federal Regulations, title 34, part 303, and the needs of the child's family related to enhancing the child's development and that are selected in collaboration with the parent. These services include core early intervention services and additional early intervention services listed in section 125A.29 and services defined in Code of Federal Regulations, title 34, section 303, et seq.\n\"Early intervention system\" means the total effort in the state to meet the needs of eligible children and their families.\n\"Eligibility for Part C\" means eligibility for infant and toddler intervention services under section 125A.02 and Minnesota Rules, part 3525.1350.\n\"Facilitate payment\" means helping families access necessary public or private assistance that provides payment for services required to meet needs identified in a service plan, individualized education program (IEP), individual service plan (ISP), or individualized family service plan (IFSP), according to time frames required by the plan. This may also include activities to collect fees for services provided on a sliding fee basis, where permitted by state law.\n\"Individualized family service plan\" or \"IFSP\" means a written plan for providing services to a child age birth to three years and the child's family.\n\"Interagency child find systems\" means activities developed on an interagency basis with the involvement of interagency early intervention committees and other relevant community groups, including primary referral sources included in Code of Federal Regulations, title 34, section 303.303 (c), using rigorous standards to actively seek out, identify, and refer infants and young children, with, or at risk of, disabilities, and their families, to reduce the need for future services. The child find system must mandate referrals for a child under the age of three who: (1) is the subject of a substantiated case of abuse or neglect, or (2) is identified as directly affected by illegal substance abuse, or withdrawal symptoms resulting from prenatal drug exposure, to reduce the need for future services. The referral procedures must specify that a referral must occur within seven calendar days from the date of identification.\n\"Local primary agency\" means the agency designated jointly by the school and county board under section 125A.29.\n\"Natural environments\" means the child's home and community settings in which children without disabilities participate.\n\"Parent\" means \"parent\" as defined by Code of Federal Regulations, title 34, section 303.27, or a surrogate parent appointed in accordance with Code of Federal Regulations, title 34, section 303.422, or United States Code, title 20, section 1439(a)(5).\n\"Part C state plan\" means the annual state plan application approved by the federal government.\n\"Pay for\" means using federal, state, local, and private dollars available for early intervention services.\n\"Respite\" means short-term, temporary care provided to a child with a disability due to the temporary absence or need for relief of the family member or members or primary caregiver, normally providing the care.\n\"State lead agency\" means the state agency receiving federal funds for the purposes of providing early intervention services.\n\"Surrogate parent\" means a person appointed by the local education agency to assure that the rights of the child to early intervention services are protected. A person cannot be a surrogate parent to a child for whom the person provides early intervention services.",
	"repealed": false
}