{
	"id": "38.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/38.01",
	"title": "38.01 COUNTY AGRICULTURAL SOCIETIES; FORMATION, POWERS.",
	"text": "(a) An agricultural society or association may be incorporated by citizens of any county, or two or more counties jointly, but only one agricultural society shall be organized in any county. An agricultural society may sue and be sued in its corporate name; may adopt bylaws, rules, and regulations, alter and amend the same; may purchase and hold, lease and control any real or personal property deemed to promote the objects of the society, and may rent, lease, sell, exchange, and convey the same. Any income from the rental or lease of the property may be used for any or all of the following purposes: (1) Acquisition of additional real property; (2) Construction of additional buildings; or (3) Maintenance and care of the society's property. This section shall not be construed to preclude the continuance of any agricultural society now existing or the granting of aid to the society.\n(b) An agricultural society shall have jurisdiction and control of the grounds upon which its fairs are held and of the streets and adjacent grounds during the fair, so far as may be necessary for fair purposes, and are exempt from local zoning ordinances throughout the year as provided in section 38.16.\n(c) The society may contract with the sheriff, local municipality, or security guard as defined in section 626.88 to provide the society with police service. A person providing police service pursuant to a contract is not, by reason of the contract, classified as an employee of the agricultural society for any purpose other than the discharge of powers and duties under the contract.\n(d) Any person who shall willfully violate any rule or regulation made by agricultural societies during the days of a fair shall be guilty of a misdemeanor.\nThe provisions of this section supersede all special laws on the same subject.",
	"repealed": false
}