{
	"id": "325A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/325A.01",
	"title": "325A.01 DEFINITIONS.",
	"text": "As used in sections 325A.01 to 325A.10, the following terms shall have the meanings given.\n\"Contract for invention development services\" includes a contract by which an invention developer undertakes to develop or promote an invention for a customer.\n\"Customer\" means any natural person who is solicited by, inquires about, seeks the services of or enters into a contract with an invention developer for invention development services.\n\"Invention\" includes a process, machine, manufacture, composition of matter, improvement upon the foregoing, or a concept.\n\"Invention developer\" means any person, firm, corporation or association and the agents, employees or representatives of the person, firm, corporation or association which develops or promotes or offers to develop or promote an invention of a customer in order that the customer's invention may be patented, licensed or sold for manufacture or manufactured in large quantities, except the term does not include:\n(1) a partnership or corporation when all of its partners, stockholders or members are licensed by a state or the United States to render legal advice concerning patents and trademarks, or a person so licensed,\n(2) a department or agency of the federal, state or local government,\n(3) a charitable, scientific, educational, religious or other organization registered under section 309.52 or described in section 170 (b) (1) (A) of the Internal Revenue Code of 1954, as amended and in effect on January 1, 1977,\n(4) a person, firm, corporation, association or other entity that does not charge a fee for invention development services, or\n(5) any person, firm, corporation, association or other entity whose gross receipts from contracts for invention development services do not exceed ten percent of its gross receipts from all sources during the fiscal year preceding the year in which any contract for invention development services is signed.\nFor the purposes of this subdivision, \"fee\" shall include any payment made by the customer to the entity, including reimbursements for expenditures made or costs incurred by such entity, but shall not include a payment made from a portion of the income received by a customer by virtue of invention development services performed by the entity.\n\"Invention development services\" includes acts required or promised to be performed, or actually performed by an invention developer for a customer.\n\"Business day\" means any day other than a Saturday, Sunday or holiday as defined in section 645.44, subdivision 5.",
	"repealed": false
}