{
	"id": "216D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/216D.04",
	"title": "216D.04 EXCAVATION; LAND SURVEY.",
	"text": "(a) Except in an emergency, an excavator must and a land surveyor may contact the notification center and provide notice at least 48 hours, excluding the day of notification, Saturdays, Sundays, and holidays and not more than 14 calendar days before beginning any excavation or boundary survey. An excavation or boundary survey begins, for purposes of this requirement, the first time excavation or a boundary survey occurs in an area that was not previously identified by the excavator or land surveyor in the notice.\n(b) The notice may be oral or written, and must contain the following information:\n(1) the name of the individual providing the notice;\n(2) the precise location of the proposed area of excavation or survey;\n(3) the name, address, and telephone number of the individual or individual's company;\n(4) the field telephone number, if one is available;\n(5) the type and extent of the activity;\n(6) whether or not the discharge of explosives is anticipated;\n(7) the date and time when the excavation or survey is to commence; and\n(8) the estimated duration of the activity.\n(a) Any person, prior to soliciting bids or entering into a contract for excavation, must provide a proposed notice to the notification center to obtain from the affected operators of underground facilities the type, size, and general location of underground facilities. Affected operators must provide the information within 15 working days. An operator who provides information to a person who is not a unit of government may indicate any portions of the information which are proprietary and may require the person to provide appropriate confidentiality protection. The information obtained from affected operators must be submitted on the final drawing used for the bid or contract and must depict the utility quality level of that information. This information must be updated not more than 90 days before completion of the final drawing used for the bid or contract.\n(b) This subdivision does not apply to bids and contracts for:\n(1) routine maintenance of underground facilities or installation, maintenance, or repair of service lines;\n(2) excavation for operators of underground facilities performed on a unit of work or similar basis; or\n(3) excavation for home construction and projects by home owners.\n(c) A person required by this section to show existing underground facilities on its drawings must conduct one or more preliminary design meetings during the design phase to communicate the project design and project scope and timeline and to coordinate utility relocation. Affected facility operators must attend these meetings. Project owners must provide project start dates, duration information, and scope of work.\n(d) A person required by this section to show existing underground facilities on its drawings must conduct one or more preconstruction meetings to communicate the project design and project scope and timeline and to coordinate utility relocation. Affected facility operators and contractors must attend these meetings.\n(e) This subdivision does not affect the obligation to provide a notice of excavation as required under subdivision 1.\n(a) An on-site meet may be requested for any excavation at the discretion of the excavator. The meet request must include the entire geographic area of the proposed excavation and the specific location of the meet.\n(b) Unless otherwise agreed to between an excavator and operator, an on-site meet is required for:\n(1) an excavation notice that involves excavation of one mile or more in length; or\n(2) any combination of notices provided for adjacent geographic sections that, when combined, meet or exceed the minimum excavation length under clause (1).\n(c) The excavator must provide a precise geographic area of the proposed excavation and use markings as specified under section 216D.05, clause (2).\n(d) An affected operator must (1) attend the on-site meet at the proposed date and time, or (2) contact the excavator before the meet and (i) reschedule the meet for a mutually agreed date and time, or (ii) reach an agreement with the excavator that a meet is not required. At the meet, the operator and the excavator must reach an agreement on any subsequent planned meets or further communication.\n(e) The on-site meet date and time must occur at least 48 hours after the notice, excluding Saturdays, Sundays, and holidays. The excavation start time must be at least 48 hours after the proposed meet date and time specified on the notice, excluding Saturdays, Sundays, and holidays.\n(f) The excavator and the operator must submit documentation of each on-site meet to the notification center, in the manner specified by the notification center. The documentation must include:\n(1) the date and time of the meet;\n(2) the names, company affiliations, and contact information of the attendees of each meet;\n(3) a diagram, sketch, or description of the precise excavation locations, dates, and times; and\n(4) the agreed schedule of any future on-site meets or communications.\nThe notification center must assign an inquiry identification number to each notice and retain a record of all notices received for at least six years. The center must immediately transmit the information contained in a notice to every operator that has an underground facility in the area of the proposed excavation or boundary survey.\n(a) Prior to the conclusion of the locate period, an operator must locate and mark or otherwise provide the approximate horizontal location of the underground facilities of the operator and provide readily available information regarding the operator's abandoned and out-of-service underground facilities as shown on maps, drawings, diagrams, or other records used in the operator's normal course of business, without cost to the excavator. The excavator must determine the precise location of the underground facility, without damage, before excavating within two feet of the marked location of the underground facility.\n(b) Within 96 hours or the time specified in the notice, whichever is later, after receiving a notice for boundary survey from the notification center, excluding Saturdays, Sundays, and holidays, unless otherwise agreed to between the land surveyor and operator, an operator must locate and mark or otherwise provide the approximate horizontal location of the underground facilities of the operator, without cost to the land surveyor.\n(c) For the purpose of this section, the approximate horizontal location of the underground facilities is a strip of land two feet on either side of the underground facilities.\n(d) Markers used to designate the approximate horizontal location of underground facilities are subject to the following requirements:\n(1) markers must be a combination of paint markings and at least one of the following: (i) a flag or flags, (ii) a stake or stakes, or (iii) a whisker or whiskers;\n(2) all markers under clause (1) must follow the current color code standard used by the American Public Works Association;\n(3) markers must be located within a plus or minus two-foot tolerance; and\n(4) the name of the operator must be indicated on each flag, stake, or whisker.\nIf the surface being marked is hard, markers without flags, stakes, or whiskers may be used but must comply with the color code standard and tolerance requirement under clauses (2) and (3).\n(e) If the operator cannot complete marking of the excavation or boundary survey area before the excavation or boundary survey start time stated in the notice, the operator must promptly contact the excavator or land surveyor.\n(f) Operators must maintain maps, drawings, diagrams, or other records of any underground facility abandoned or out-of-service after December 31, 1998.\n(g) An operator or other person providing information pursuant to this subdivision is not responsible to any person, for any costs, claims, or damages for information provided in good faith regarding abandoned, out-of-service, or private or customer-owned underground facilities.\n(h) An operator must use geospatial location information or an equivalent technology to develop as-built drawings of newly installed or newly abandoned facilities if exposed in the excavation area. The requirements under this paragraph apply (1) on or after January 1, 2026, or (2) on or after January 1, 2027, for an operator that provided services to fewer than 10,000 customers in calendar year 2025.\n(a) The excavator or land surveyor must determine the precise location of the underground facility, without damage, before excavating within two feet on either side of the marked location of the underground facility.\n(b) Activities in the proposed area of excavation or boundary survey must take place before the expiration date and time on the notification. If the excavator or land surveyor cancels the excavation or boundary survey, the excavator or land surveyor must cancel the notice through the notification center.\n(c) The notice is valid for 14 calendar days from the start time stated on the notice. If the activity will continue after the expiration time, then the person responsible for the activity must serve an additional notice at least 48 hours, excluding Saturdays, Sundays, and holidays, before the expiration time of the original notice, unless the excavator makes arrangements with the operators affected to periodically verify or refresh the marks, in which case the notice is valid for six months from the start time stated on the notice.\n(d) The excavator is responsible for reasonably protecting and preserving the marks until no longer required for proper and safe excavation near the underground facility. If the excavator has reason to believe the marks are obliterated, obscured, missing, or incorrect, the excavator must notify the facility operator or notification center in order to have an operator verify or refresh the marks.",
	"repealed": false
}