{
	"id": "116J.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.68",
	"title": "116J.68 BUREAU OF SMALL BUSINESS.",
	"text": "The Bureau of Small Business within the business assistance center shall serve as a clearinghouse, technical assistance center, and referral service for information and other assistance needed by small businesses including small targeted group businesses and small businesses located in an economically disadvantaged area.\nThe bureau shall:\n(1) provide information and assistance with respect to all aspects of business planning, business finance, and business management related to the start-up, operation, or expansion of a small business in Minnesota;\n(2) refer persons interested in the start-up, operation, or expansion of a small business in Minnesota to assistance programs sponsored by federal agencies, state agencies, educational institutions, chambers of commerce, civic organizations, community development groups, private industry associations, and other organizations;\n(3) plan, develop, and implement a master file of information on small business assistance programs of federal, state, and local governments, and other public and private organizations so as to provide comprehensive, timely information to the bureau's clients;\n(4) employ staff with adequate and appropriate skills and education and training for the delivery of information and assistance;\n(5) seek out and utilize, to the extent practicable, contributed expertise and services of federal, state, and local governments, educational institutions, and other public and private organizations;\n(6) maintain a close and continued relationship with the director of the procurement program within the Department of Administration so as to facilitate the department's duties and responsibilities under sections 16C.16 to 16C.19 relating to the small targeted group business and economically disadvantaged business program of the state;\n(7) develop an information system which will enable the commissioner and other state agencies to efficiently store, retrieve, analyze, and exchange data regarding small business development and growth in the state. All executive branch agencies of state government and the secretary of state shall to the extent practicable, assist the bureau in the development and implementation of the information system;\n(8) establish and maintain a toll-free telephone number, email account, and other electronic contact mediums determined by the commissioner so that all small business persons anywhere in the state may contact the bureau office for assistance. An outreach program shall be established to make the existence of the bureau and the assistance and services the bureau may provide to small businesses well known to its potential clientele throughout the state. If the small business person requires a referral to another provider the bureau may use the business assistance referral system established by the Minnesota Project Outreach Corporation;\n(9) conduct research and provide data as required by the state legislature;\n(10) develop and publish material on all aspects of the start-up, operation, or expansion of a small business in Minnesota;\n(11) collect and disseminate information on state procurement opportunities, including information on the procurement process;\n(12) develop a public awareness program regarding state assistance programs for small businesses, including those programs specifically for socially disadvantaged small business persons. The commissioner may utilize print and electronic newsletters, personal contacts, advertising devices as defined in section 173.02, subdivision 16, social media, other electronic and print news media advertising, and any other means determined by the commissioner;\n(13) enter into agreements with the federal government and other public and private entities to serve as the statewide coordinator or host agency for the federal small business development center program under United States Code, title 15, section 648; and\n(14) assist providers in the evaluation of their programs and the assessment of their service area needs. The bureau may establish model evaluation techniques and performance standards for providers to use.\n[Repealed, 1984 c 604 s 5]\n[Repealed, 1984 c 604 s 5]\n[Repealed, 2014 c 271 art 1 s 3]",
	"repealed": false
}