{
	"id": "298.2211",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.2211",
	"title": "298.2211 FINANCING ACTIVITIES.",
	"text": "In order to accomplish the legislative purposes specified in sections 469.142 to 469.165 and chapter 462C, within the taconite assistance area as defined in section 273.1341, the commissioner of Iron Range resources and rehabilitation may exercise the following powers: (1) all powers conferred upon a rural development financing authority under sections 469.142 to 469.149; (2) all powers conferred upon a city under chapter 462C; (3) all powers conferred upon a municipality or a redevelopment agency under sections 469.152 to 469.165; (4) all powers provided by sections 469.142 to 469.151 to further any of the purposes and objectives of chapter 462C and sections 469.152 to 469.165; (5) apply for, borrow, receive, and expend grant and loan money made available from federal sources and from federally funded programs; and (6) all powers conferred upon a municipality or an authority under sections 469.174 to 469.177, 469.178, except subdivision 2 thereof, and 469.179, subject to compliance with the provisions of section 469.175, subdivisions 1, 2, and 3; provided that any tax increments derived by the commissioner from the exercise of this authority may be used only to finance or pay premiums or fees for insurance, letters of credit, or other contracts guaranteeing the payment when due of net rentals under a project lease or the payment of principal and interest due on or repurchase of bonds issued to finance a project or program, to accumulate and maintain reserves securing the payment when due on bonds issued to finance a project or program, or to provide an interest rate reduction program pursuant to section 469.012, subdivision 7. Tax increments and earnings thereon remaining in any bond reserve account after payment or discharge of any bonds secured thereby shall be used within one year thereafter in furtherance of this section or returned to the county auditor of the county in which the tax increment financing district is located. If returned to the county auditor, the county auditor shall immediately allocate the amount among all government units which would have shared therein had the amount been received as part of the other ad valorem taxes on property in the district most recently paid, in the same proportions as other taxes were distributed, and shall immediately distribute it to the government units in accordance with the allocation.\nProjects undertaken, developed, or financed pursuant to this section shall be located within the taconite assistance area defined in section 273.1341.\nThe commissioner may authorize a project under this section only after consulting the advisory board. Prior to the commencement of a project involving the exercise by the commissioner of any authority of sections 469.174 to 469.179, the governing body of each municipality in which any part of the project is located and the county board of any county containing portions of the project not located in an incorporated area shall by majority vote approve or disapprove the project. Any project approved by the commissioner and the applicable governing bodies, if any, together with detailed information concerning the project, its costs, the sources of its funding, and the amount of any bonded indebtedness to be incurred in connection with the project, shall be transmitted to the governor, who shall approve, disapprove, or return the proposal for additional consideration within 30 days of receipt. No project authorized under this section shall be undertaken, and no obligations shall be issued and no tax increments shall be expended for a project authorized under this section until the project has been approved by the governor.\n[Repealed, 1995 c 224 s 126]\nBonds and other obligations issued by the commissioner pursuant to this section, along with all related documents, are not general obligations of the state of Minnesota and are not subject to sections 16C.03, subdivision 4, and 16C.05. The full faith and credit and taxing powers of the state are not and may not be pledged for the payment of these bonds or other obligations, and no person has the right to compel the levy of any state tax for their payment or to compel the appropriation of any moneys of the state for their payment except as specifically provided herein. These bonds and obligations shall be payable solely from the property and moneys derived by the commissioner pursuant to the authority granted in this section that the commissioner pledges to their payment. The legislature intends not to appropriate money from the general fund to pay for these bonds or other obligations. All these bonds or other obligations must contain the provisions of this subdivision or words to the same effect on their face.\nThere is appropriated to the commissioner for the purpose of carrying out any project or program undertaken pursuant to this section, all property and moneys derived by the commissioner through the exercise of the powers conferred by this section. The commissioner may pledge all the property or moneys for the security or payment of bonds or other obligations issued or entered into by the commissioner for this purpose.\nFees for admission to or use of facilities operated by the commissioner of Iron Range resources and rehabilitation that have been established according to prevailing market conditions and to recover operating costs need not be set by rule.",
	"repealed": false
}