{
	"id": "152.126",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.126",
	"title": "152.126 PRESCRIPTION MONITORING PROGRAM.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Board\" means the Minnesota State Board of Pharmacy established under chapter 151.\n(c) \"Controlled substances\" means those substances listed in section 152.02, subdivisions 3 to 6, and those substances defined by the board pursuant to section 152.02, subdivisions 7, 8, and 12. For the purposes of this section, controlled substances includes butalbital and gabapentin.\n(d) \"Dispense\" or \"dispensing\" has the meaning given in section 151.01, subdivision 30. Dispensing does not include the direct administering of a controlled substance to a patient by a licensed health care professional.\n(e) \"Dispenser\" means a person authorized by law to dispense a controlled substance, pursuant to a valid prescription. For the purposes of this section, a dispenser does not include a licensed hospital pharmacy that distributes controlled substances for inpatient hospital care or a veterinarian who is dispensing prescriptions under section 156.18.\n(f) \"Prescriber\" means a licensed health care professional who is authorized to prescribe a controlled substance under section 152.12, subdivision 1 or 2.\n(g) \"Prescription\" has the meaning given in section 151.01, subdivision 16a.\nThis section is not intended to limit or interfere with the legitimate prescribing of controlled substances for pain. No prescriber shall be subject to disciplinary action by a health-related licensing board for prescribing a controlled substance according to the provisions of section 152.125.\n(a) The board shall establish by January 1, 2010, an electronic system for reporting the information required under subdivision 4 for all controlled substances dispensed within the state.\n(b) The board may contract with a vendor for the purpose of obtaining technical assistance in the design, implementation, operation, and maintenance of the electronic reporting system.\n(a) The board shall appoint an advisory task force consisting of at least one representative of:\n(1) the Department of Health;\n(2) the Department of Human Services;\n(3) each health-related licensing board that licenses prescribers;\n(4) a professional medical association, which may include an association of pain management and substance use disorder specialists;\n(5) a professional pharmacy association;\n(6) a professional nursing association;\n(7) a professional dental association;\n(8) a consumer privacy or security advocate;\n(9) a consumer or patient rights organization; and\n(10) an association of medical examiners and coroners.\n(b) The advisory task force shall advise the board on the development and operation of the prescription monitoring program, including, but not limited to:\n(1) technical standards for electronic prescription drug reporting;\n(2) proper analysis and interpretation of prescription monitoring data;\n(3) an evaluation process for the program; and\n(4) criteria for the unsolicited provision of prescription monitoring data by the board to prescribers and dispensers.\n(c) The task force is governed by section 15.059. Notwithstanding any other provisions of law to the contrary, the task force shall not expire.\n(a) Each dispenser must submit the following data to the board or its designated vendor:\n(1) name of the prescriber;\n(2) national provider identifier of the prescriber;\n(3) name of the dispenser;\n(4) national provider identifier of the dispenser;\n(5) prescription number;\n(6) name of the patient for whom the prescription was written;\n(7) address of the patient for whom the prescription was written;\n(8) date of birth of the patient for whom the prescription was written;\n(9) date the prescription was written;\n(10) date the prescription was filled;\n(11) name and strength of the controlled substance;\n(12) quantity of controlled substance prescribed;\n(13) quantity of controlled substance dispensed; and\n(14) number of days supply.\n(b) The dispenser must submit the required information by a procedure and in a format established by the board. The board may allow dispensers to omit data listed in this subdivision or may require the submission of data not listed in this subdivision provided the omission or submission is necessary for the purpose of complying with the electronic reporting or data transmission standards of the American Society for Automation in Pharmacy, the National Council on Prescription Drug Programs, or other relevant national standard-setting body.\n(c) A dispenser is not required to submit this data for those controlled substance prescriptions dispensed for:\n(1) individuals residing in a health care facility as defined in section 151.58, subdivision 2, paragraph (b), when a drug is distributed through the use of an automated drug distribution system according to section 151.58;\n(2) individuals receiving a drug sample that was packaged by a manufacturer and provided to the dispenser for dispensing as a professional sample pursuant to Code of Federal Regulations, title 21, part 203, subpart D; and\n(3) individuals whose prescriptions are being mailed, shipped, or delivered from Minnesota to another state, so long as the data are reported to the prescription drug monitoring program of that state.\n(d) A dispenser must provide notice to the patient for whom the prescription was written, or to that patient's authorized representative, of the reporting requirements of this section and notice that the information may be used for program administration purposes.\n(e) The dispenser must submit the required information within the time frame specified by the board; if no reportable prescriptions are dispensed or sold on any day, a report indicating that fact must be filed with the board.\n(f) The dispenser must submit accurate information to the database and must correct errors identified during the submission process within seven calendar days.\n(g) For the purposes of this paragraph, the term \"subject of the data\" means the individual reported as being the patient, the practitioner reported as being the prescriber, the client when an animal is reported as being the patient, or an authorized agent of these individuals. The dispenser must correct errors brought to its attention by the subject of the data within seven calendar days, unless the dispenser verifies that an error did not occur and the data were correctly submitted. The dispenser must notify the subject of the data that either the error was corrected or that no error occurred.\n(a) The board shall develop and maintain a database of the data reported under subdivision 4. The board shall maintain data that could identify an individual prescriber or dispenser in encrypted form. Except as otherwise allowed under subdivision 6, the database may be used by permissible users identified under subdivision 6 for the identification of:\n(1) individuals receiving prescriptions for controlled substances from prescribers who subsequently obtain controlled substances from dispensers in quantities or with a frequency inconsistent with generally recognized standards of use for those controlled substances, including standards accepted by national and international pain management associations; and\n(2) individuals presenting forged or otherwise false or altered prescriptions for controlled substances to dispensers.\n(b) No permissible user identified under subdivision 6 may access the database for the sole purpose of identifying prescribers of controlled substances for unusual or excessive prescribing patterns without a valid search warrant or court order.\n(c) No personnel of a state or federal occupational licensing board or agency may access the database for the purpose of obtaining information to be used to initiate a disciplinary action against a prescriber.\n(d) Data reported under subdivision 4 shall be made available to permissible users for a 12-month period beginning the day the data was received and ending 12 months from the last day of the month in which the data was received, except that permissible users defined in subdivision 6, paragraph (b), clauses (7) and (8), may use all data collected under this section for the purposes of administering, operating, and maintaining the prescription monitoring program and conducting trend analyses and other studies necessary to evaluate the effectiveness of the program.\n(e) Data reported during the period January 1, 2015, through December 31, 2018, may be retained through December 31, 2019, in an identifiable manner. Effective January 1, 2020, data older than 24 months must be destroyed. Data reported for prescriptions dispensed on or after January 1, 2020, must be destroyed no later than 12 months from the date the prescription was reported as dispensed.\n(a) Except as indicated in this subdivision, the data submitted to the board under subdivision 4 is private data on individuals as defined in section 13.02, subdivision 12, and not subject to public disclosure.\n(b) Except as specified in subdivision 5, the following persons shall be considered permissible users and may access the data submitted under subdivision 4 in the same or similar manner, and for the same or similar purposes, as those persons who are authorized to access similar private data on individuals under federal and state law:\n(1) a prescriber or an agent or employee of the prescriber to whom the prescriber has delegated the task of accessing the data, to the extent the information relates specifically to a current patient, to whom the prescriber is:\n(i) prescribing or considering prescribing any controlled substance;\n(ii) providing emergency medical treatment for which access to the data may be necessary;\n(iii) providing care, and the prescriber has reason to believe, based on clinically valid indications, that the patient is potentially abusing a controlled substance; or\n(iv) providing other medical treatment for which access to the data may be necessary for a clinically valid purpose and the patient has consented to access to the submitted data, and with the provision that the prescriber remains responsible for the use or misuse of data accessed by a delegated agent or employee;\n(2) a dispenser or an agent or employee of the dispenser to whom the dispenser has delegated the task of accessing the data, to the extent the information relates specifically to a current patient to whom that dispenser is dispensing or considering dispensing any controlled substance and with the provision that the dispenser remains responsible for the use or misuse of data accessed by a delegated agent or employee;\n(3) a licensed dispensing practitioner or licensed pharmacist to the extent necessary to determine whether corrections made to the data reported under subdivision 4 are accurate;\n(4) a licensed pharmacist who is providing pharmaceutical care for which access to the data may be necessary to the extent that the information relates specifically to a current patient for whom the pharmacist is providing pharmaceutical care: (i) if the patient has consented to access to the submitted data; or (ii) if the pharmacist is consulted by a prescriber who is requesting data in accordance with clause (1);\n(5) an individual who is the recipient of a controlled substance prescription for which data was submitted under subdivision 4, or a guardian of the individual, parent or guardian of a minor, or health care agent of the individual acting under a health care directive under chapter 145C. For purposes of this clause, access by individuals includes persons in the definition of an individual under section 13.02;\n(6) personnel or designees of a health-related licensing board listed in section 214.01, subdivision 2, or of the Office of Emergency Medical Services, assigned to conduct a bona fide investigation of a complaint received by that board or office that alleges that a specific licensee is impaired by use of a drug for which data is collected under subdivision 4, has engaged in activity that would constitute a crime as defined in section 152.025, or has engaged in the behavior specified in subdivision 5, paragraph (a);\n(7) personnel of the board engaged in the collection, review, and analysis of controlled substance prescription information as part of the assigned duties and responsibilities under this section;\n(8) authorized personnel under contract with the board, or under contract with the state of Minnesota and approved by the board, who are engaged in the design, evaluation, implementation, operation, or maintenance of the prescription monitoring program as part of the assigned duties and responsibilities of their employment, provided that access to data is limited to the minimum amount necessary to carry out such duties and responsibilities, and subject to the requirement of de-identification and time limit on retention of data specified in subdivision 5, paragraphs (d) and (e);\n(9) federal, state, and local law enforcement authorities acting pursuant to a valid search warrant;\n(10) personnel of the Minnesota health care programs assigned to use the data collected under this section to identify and manage recipients whose usage of controlled substances may warrant restriction to a single primary care provider, a single outpatient pharmacy, and a single hospital;\n(11) personnel of the Department of Human Services assigned to access the data pursuant to paragraph (k);\n(12) personnel of the health professionals services program established under section 214.31, to the extent that the information relates specifically to an individual who is currently enrolled in and being monitored by the program, and the individual consents to access to that information. The health professionals services program personnel shall not provide this data to a health-related licensing board, except as permitted under section 214.33, subdivision 3;\n(13) personnel or designees of a health-related licensing board other than the Board of Pharmacy listed in section 214.01, subdivision 2, assigned to conduct a bona fide investigation of a complaint received by that board that alleges that a specific licensee is inappropriately prescribing controlled substances as defined in this section. For the purposes of this clause, the health-related licensing board may also obtain utilization data; and\n(14) personnel of the board specifically assigned to conduct a bona fide investigation of a specific licensee or registrant. For the purposes of this clause, the board may also obtain utilization data.\n(c) By July 1, 2017, every prescriber licensed by a health-related licensing board listed in section 214.01, subdivision 2, practicing within this state who is authorized to prescribe controlled substances for humans and who holds a current registration issued by the federal Drug Enforcement Administration, and every pharmacist licensed by the board and practicing within the state, shall register and maintain a user account with the prescription monitoring program. Data submitted by a prescriber, pharmacist, or their delegate during the registration application process, other than their name, license number, and license type, is classified as private pursuant to section 13.02, subdivision 12.\n(d) Notwithstanding paragraph (b), beginning January 1, 2021, a prescriber or an agent or employee of the prescriber to whom the prescriber has delegated the task of accessing the data, must access the data submitted under subdivision 4 to the extent the information relates specifically to the patient:\n(1) before the prescriber issues an initial prescription order for a Schedules II through IV opiate controlled substance to the patient; and\n(2) at least once every three months for patients receiving an opiate for treatment of chronic pain or participating in medically assisted treatment for an opioid addiction.\n(e) Paragraph (d) does not apply if:\n(1) the patient is receiving palliative care, or hospice or other end-of-life care;\n(2) the patient is being treated for pain due to cancer or the treatment of cancer;\n(3) the prescription order is for a number of doses that is intended to last the patient five days or less and is not subject to a refill;\n(4) the prescriber and patient have a current or ongoing provider/patient relationship of a duration longer than one year;\n(5) the prescription order is issued within 14 days following surgery or three days following oral surgery or follows the prescribing protocols established under the opioid prescribing improvement program under section 256B.0638;\n(6) the controlled substance is prescribed or administered to a patient who is admitted to an inpatient hospital;\n(7) the controlled substance is lawfully administered by injection, ingestion, or any other means to the patient by the prescriber, a pharmacist, or by the patient at the direction of a prescriber and in the presence of the prescriber or pharmacist;\n(8) due to a medical emergency, it is not possible for the prescriber to review the data before the prescriber issues the prescription order for the patient; or\n(9) the prescriber is unable to access the data due to operational or other technological failure of the program so long as the prescriber reports the failure to the board.\n(f) Only permissible users identified in paragraph (b), clauses (1), (2), (3), (4), (7), (8), (10), and (11), may directly access the data electronically. No other permissible users may directly access the data electronically. If the data is directly accessed electronically, the permissible user shall implement and maintain a comprehensive information security program that contains administrative, technical, and physical safeguards that are appropriate to the user's size and complexity, and the sensitivity of the personal information obtained. The permissible user shall identify reasonably foreseeable internal and external risks to the security, confidentiality, and integrity of personal information that could result in the unauthorized disclosure, misuse, or other compromise of the information and assess the sufficiency of any safeguards in place to control the risks.\n(g) The board shall not release data submitted under subdivision 4 unless it is provided with evidence, satisfactory to the board, that the person requesting the information is entitled to receive the data.\n(h) The board shall maintain a log of all persons who access the data for a period of at least three years and shall ensure that any permissible user complies with paragraph (c) prior to attaining direct access to the data.\n(i) Section 13.05, subdivision 6, shall apply to any contract the board enters into pursuant to subdivision 2. A vendor shall not use data collected under this section for any purpose not specified in this section.\n(j) The board may participate in an interstate prescription monitoring program data exchange system provided that permissible users in other states have access to the data only as allowed under this section, and that section 13.05, subdivision 6, applies to any contract or memorandum of understanding that the board enters into under this paragraph.\n(k) With available appropriations, the commissioner of human services shall establish and implement a system through which the Department of Human Services shall routinely access the data for the purpose of determining whether any client enrolled in an opioid treatment program licensed according to chapter 245A has been prescribed or dispensed a controlled substance in addition to that administered or dispensed by the opioid treatment program. When the commissioner determines there have been multiple prescribers or multiple prescriptions of controlled substances, the commissioner shall:\n(1) inform the medical director of the opioid treatment program only that the commissioner determined the existence of multiple prescribers or multiple prescriptions of controlled substances; and\n(2) direct the medical director of the opioid treatment program to access the data directly, review the effect of the multiple prescribers or multiple prescriptions, and document the review.\nIf determined necessary, the commissioner of human services shall seek a federal waiver of, or exception to, any applicable provision of Code of Federal Regulations, title 42, section 2.34, paragraph (c), prior to implementing this paragraph.\n(l) The board shall review the data submitted under subdivision 4 on at least a quarterly basis and shall establish criteria, in consultation with the advisory task force, for referring information about a patient to prescribers and dispensers who prescribed or dispensed the prescriptions in question if the criteria are met.\n(m) The board shall conduct random audits, on at least a quarterly basis, of electronic access by permissible users, as identified in paragraph (b), clauses (1), (2), (3), (4), (7), (8), (10), and (11), to the data in subdivision 4, to ensure compliance with permissible use as defined in this section. A permissible user whose account has been selected for a random audit shall respond to an inquiry by the board, no later than 30 days after receipt of notice that an audit is being conducted. Failure to respond may result in deactivation of access to the electronic system and referral to the appropriate health licensing board, or the commissioner of human services, for further action. The board shall report the results of random audits to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance and government data practices.\n(n) A permissible user who has delegated the task of accessing the data in subdivision 4 to an agent or employee shall audit the use of the electronic system by delegated agents or employees on at least a quarterly basis to ensure compliance with permissible use as defined in this section. When a delegated agent or employee has been identified as inappropriately accessing data, the permissible user must immediately remove access for that individual and notify the board within seven days. The board shall notify all permissible users associated with the delegated agent or employee of the alleged violation.\n(o) A permissible user who delegates access to the data submitted under subdivision 4 to an agent or employee shall terminate that individual's access to the data within three business days of the agent or employee leaving employment with the permissible user. The board may conduct random audits to determine compliance with this requirement.\n(a) A dispenser who knowingly fails to submit data to the board as required under this section is subject to disciplinary action by the appropriate health-related licensing board.\n(b) A prescriber or dispenser authorized to access the data who knowingly discloses the data in violation of state or federal laws relating to the privacy of health care data shall be subject to disciplinary action by the appropriate health-related licensing board, and appropriate civil penalties.\n(c) A prescriber or dispenser authorized to access the data who fails to comply with subdivision 6, paragraph (l) or (m), shall be subject to disciplinary action by the appropriate health-related licensing board.\n[Repealed by amendment, 2014 c 291 art 2 s 3]\n(a) A pharmacist, prescriber, or other dispenser making a report to the program in good faith under this section is immune from any civil, criminal, or administrative liability, which might otherwise be incurred or imposed as a result of the report, or on the basis that the pharmacist or prescriber did or did not seek or obtain or use information from the program.\n(b) Nothing in this section shall require a pharmacist, prescriber, or other dispenser to obtain information about a patient from the program, and the pharmacist, prescriber, or other dispenser, if acting in good faith, is immune from any civil, criminal, or administrative liability that might otherwise be incurred or imposed for requesting, receiving, or using information from the program.\n(a) The board may seek grants and private funds from nonprofit charitable foundations, the federal government, and other sources to fund the enhancement and ongoing operations of the prescription monitoring program established under this section. Any funds received shall be appropriated to the board for this purpose. The board may not expend funds to enhance the program in a way that conflicts with this section without seeking approval from the legislature.\n(b) Notwithstanding any other section, the administrative services unit for the health-related licensing boards shall apportion between the Board of Medical Practice, the Board of Nursing, the Board of Dentistry, the Board of Podiatric Medicine, the Board of Optometry, the Board of Veterinary Medicine, and the Board of Pharmacy an amount to be paid through fees by each respective board. The amount apportioned to each board shall equal each board's share of the annual appropriation to the Board of Pharmacy from the state government special revenue fund for operating the prescription monitoring program under this section. Each board's apportioned share shall be based on the number of prescribers or dispensers that each board identified in this paragraph licenses as a percentage of the total number of prescribers and dispensers licensed collectively by these boards. Each respective board may adjust the fees that the boards are required to collect to compensate for the amount apportioned to each board by the administrative services unit.\nA patient who has been prescribed a controlled substance may access the prescription monitoring program database in order to obtain information on access by permissible users to the patient's data record, including the name and organizational affiliation of the permissible user and the date of access. In order to obtain this information, the patient must complete, notarize, and submit a request form developed by the board. The board shall make this form available to the public on the board's website.",
	"repealed": false
}