{
	"id": "103E.525",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.525",
	"title": "103E.525 CONSTRUCTING AND MAINTAINING BRIDGES AND CULVERTS.",
	"text": "A public or private bridge or culvert may not be constructed or maintained across or in a drainage system with less hydraulic capacity than specified in the detailed survey report, except with the written approval of the director. If the detailed survey report does not specify the hydraulic capacity, a public or private bridge or culvert in or across a drainage system ditch may not be constructed without the director's approval of the hydraulic capacity.\nBridges and culverts on public roads required by the construction or improvement of a drainage project or system must be constructed and maintained by the road authority responsible for keeping the road in repair, except as provided in this section.\nThe auditor shall notify the state and each railroad company, corporation, or political subdivision that they are to construct a required bridge or culvert on a road or right-of-way under their jurisdiction, within a reasonable time as stated in the notice. If the work is not done within the prescribed time, the drainage authority may order the bridge or culvert constructed as part of the drainage project construction. The cost must be deducted from the damages awarded to the corporation or collected from it as an assessment for benefits. If the detailed survey report or viewers' report shows that the construction of the bridge or culvert is necessary, the drainage authority may, by order, retain an amount to secure the construction of the bridge or culvert from amounts to be paid to a railroad, corporation, or political subdivision.\nThe costs of constructing a bridge or culvert that is required by construction of a drainage project on a public road that is not a state trunk highway on the line between two statutory or home rule charter cities, whether in the same county or not, must be paid jointly, in equal shares, by the cities. The cities shall pay jointly, in equal shares, for the cost of maintaining the bridge or culvert.\nThe cost of constructing and maintaining bridges and culverts on a town or county road across a drainage system ditch constructed along the boundary line between towns or counties, with excavated material deposited on the boundary line or within 33 feet of the line, must be paid equally by the town or county where the bridge or culvert is located and the other town or county adjoining the boundary.",
	"repealed": false
}