{
	"id": "32D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/32D.01",
	"title": "32D.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Adulterated\" means an item is covered by section 34A.02.\n\"Cheese\" includes all varieties of cheese, cheese spreads, cheese foods, cheese compounds, or processed cheese made or manufactured in whole or in part from milk.\n\"Commissioner\" means the commissioner of agriculture.\n\"Dairy farm\" means a place or premises where one or more lactating animals, including cows, goats, sheep, water buffalo, camels, or other hoofed mammals, are kept, and from which all or a portion of the milk produced at the place or premises is delivered, sold, or offered for sale.\n\"Dairy plant\" means any place where a dairy product is manufactured, processed, or handled and includes milk-receiving stations, creameries, cheese factories, condenseries, milk plants, transfer stations, and marketing organizations that purchase milk and cream directly from producers for resale and other establishments, as those terms are used in this chapter and chapters 17, 27, and 31; but does not include any place where dairy products are not processed but sold at wholesale or retail only.\n\"Dairy product\" means milk as defined by Code of Federal Regulations, title 21, cream, any product or by-product of either, or any commodity among the principal constituents or ingredients of which is one or a combination of two or more of them, as determined by standards, grades, or rules adopted by the commissioner.\n\"Fluid milk products\" means yogurt, cream, sour cream, half and half, reconstituted half and half, concentrated milk, concentrated milk products, skim milk, nonfat milk, chocolate flavored milk, chocolate flavored dairy drink, chocolate flavored reconstituted milk, chocolate flavored reconstituted dairy drink, buttermilk, cultured buttermilk, cultured milk, vitamin D milk, reconstituted or recombined milk, reconstituted cream, reconstituted skim milk, homogenized milk, and any other fluid milk product made by the addition of any substance to milk or to any of the fluid milk products enumerated under this subdivision or by rule adopted by the commissioner.\n\"Goat milk\" means a whole, fresh, clean lacteal secretion free from colostrum, obtained by the complete milking of one or more healthy goats.\n\"Milk\" means the normal lacteal secretion, practically free of colostrum, obtained by the milking of one or more healthy hoofed mammals. Hoofed mammals include but are not limited to cattle, water buffalo, sheep, goats, yaks, and camels.\n\"Milk for manufacturing purposes\" means milk produced for processing and manufacturing into products for human consumption but not subject to Grade A or comparable requirements.\n\"Milk-receiving station\" means a dairy plant where raw milk for pasteurization or for manufacture is received, handled, or prepared for processing or for resale as unpasteurized milk or fluid milk products.\n\"Minnesota farmstead cheese\" means cheese manufactured in Minnesota on the same farm that the milk used in its manufacturing is produced.\n\"Misbranded\" or \"misbranding\" means an item is covered by section 34A.03.\n(a) \"Pasteurization,\" \"pasteurized,\" and similar terms mean:\n(1) the process of heating every particle of milk or dairy product in properly operated equipment approved by the commissioner to a temperature of at least 145 degrees Fahrenheit and holding the temperature for at least 30 minutes;\n(2) the process of heating every particle of milk or dairy product in properly operated equipment approved by the commissioner to a temperature of at least 161 degrees Fahrenheit and holding the temperature for at least 15 seconds; or\n(3) the process of heating every particle of milk or dairy product in properly operated equipment approved by the commissioner to the temperatures and holding for the times as the commissioner may prescribe by rule, containing standards more stringent than those imposed by this subdivision.\n(b) Nothing in this subdivision shall be construed as excluding any other process that has been demonstrated to be equally efficient and is approved by the commissioner.\n\"Recombinant bovine growth hormone\" or \"rBGH\" means a growth hormone intended for use in bovine animals that has been produced through recombinant DNA techniques, described alternately as recombinant bovine somatotropin or rBST.",
	"repealed": false
}