{
	"id": "61B.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/61B.28",
	"title": "61B.28 MISCELLANEOUS PROVISIONS.",
	"text": "Records must be kept of all negotiations and meetings of the board of directors to discuss the activities of the association in carrying out its powers and duties under section 61B.23. Records of the association with respect to an impaired or insolvent insurer shall be made public only upon the termination of a liquidation, rehabilitation, or conservation proceeding involving the impaired or insolvent insurer, upon the termination of the impairment or insolvency of the insurer, or upon the order of a court of competent jurisdiction. Nothing in this subdivision limits the duty of the association to report its activities under section 61B.27.\n(a) A report, recommendation, or notification by the association, its board of directors, or officers to the commissioner concerning a member insurer, together with statements or documents furnished to the commissioner with, or subsequent to, a report, recommendation, or notification, is confidential and a privileged communication. Reports, recommendations, notifications, statements, and documents furnished to the commissioner are not admissible in whole or in part for any purpose in an action or proceeding against:\n(1) the association or its member insurers, officers, employees, or representatives submitting or providing the report, recommendation, notification, statement, or document; or\n(2) a person, firm, or entity who in good faith furnishes to the association the information or document upon which the association has relied in making its report, recommendation, or notification to the commissioner.\n(b) Notwithstanding the provisions of sections 13.711, 13.715, and 13.719, the commissioner may release to the association's board of directors any or all nonpublic data collected and maintained by the commissioner on a member insurer or a potential member insurer. Information furnished to the board of directors is private.\nFor the purpose of carrying out its obligations under sections 61B.18 to 61B.32, the association is considered to be a creditor of the impaired or insolvent insurer to the extent of assets attributable to covered policies, reduced by amounts which the association recovers from the assets of the impaired or insolvent insurer as subrogee under section 61B.23, subdivision 12. Recoveries by the association as subrogee under section 61B.23, subdivision 12, from assets other than from assets of the impaired or insolvent insurer shall not reduce or act as an offset to the association's claim as creditor of the impaired or insolvent insurer. Assets of the impaired or insolvent insurer attributable to covered policies or contracts must be used to continue all covered policies or contracts and pay all contractual obligations of the impaired or insolvent insurer as required by sections 61B.18 to 61B.32. Assets attributable to covered policies or contracts, as used in this subdivision, are that proportion of the assets which the reserves that should have been established for those policies bear to the reserves that should have been established for all policies of insurance written by the impaired or insolvent insurer.\nAs a creditor of the impaired or insolvent insurer as established in subdivision 3 of this section and consistent with section 60B.46, the association and other similar associations is entitled to receive a disbursement of assets out of the marshalled assets, from time to time as the assets become available to reimburse it, as a credit against contractual obligations under sections 61B.18 to 61B.32. If the liquidator has not, within 120 days of a final determination of insolvency of a member insurer by the receivership court, made an application to the court for the approval of a proposal to disburse assets out of marshalled assets to guaranty associations having obligations because of the insolvency, then the association shall be entitled to make application to the receivership court for approval of its own proposal to disburse these assets.\nNo person, including a member insurer, agent, or affiliate of a member insurer, shall make, publish, disseminate, circulate, or place before the public, or cause directly or indirectly, to be made, published, disseminated, circulated, or placed before the public, in any newspaper, magazine, or other publication, or in the form of a notice, circular, pamphlet, letter, or poster, or over any radio station or television station, or in any other way, an advertisement, announcement, or statement, written or oral, which uses the existence of the Minnesota Life and Health Insurance Guaranty Association for the purpose of sales, solicitation, or inducement to purchase any form of insurance or other coverage covered by sections 61B.18 to 61B.32. The notice required by subdivision 8 is not a violation of this subdivision nor is it a violation of this subdivision to explain verbally to an applicant or potential applicant the coverage provided by the Minnesota Life and Health Insurance Guaranty Association at any time during the application process or thereafter. This subdivision does not apply to the Minnesota Life and Health Insurance Guaranty Association or an entity that does not sell or solicit insurance or coverage by a health maintenance organization.\nNo distribution to stockholders of an impaired domiciliary insurer shall be made until the total amount of assessments levied by the association with respect to the insurer have been fully recovered by the association.\nNo member insurer may be reinstated to do business in this state until all payments of or on account of the impaired insurer's contractual obligations by the guaranty association, along with all expenses thereof and interest on all such payments and expenses, shall have been repaid to the guaranty association or a plan of repayment by the impaired insurer shall have been approved by the association.\n(a) No person, including a member insurer, agent, or affiliate of a member insurer or agent, shall offer for sale in this state a covered life insurance, annuity, or health insurance policy or contract without delivering, either at the time of application for that policy or contract or at the time of delivery of the policy or contract, a notice in the form specified in subdivision 8, or in a form approved by the commissioner under paragraph (b), relating to coverage provided by the Minnesota Life and Health Insurance Guaranty Association. The notice may be part of the application. A copy of the notice must be given to the applicant or the policy owner, contract owner, certificate holder, or enrollee. The person offering the policy or contract shall document the fact that the notice was given at the time of application or the fact that the notice was delivered at the time the policy or contract was delivered. This does not require that the receipt of the notice be acknowledged by the applicant.\n(b) The association may prepare, and file with the commissioner for approval, a form of notice as an alternative to the form of notice specified in subdivision 8 describing the general purposes and limitations of this chapter. The form of notice shall:\n(1) state the name, address, and telephone number of the Minnesota Life and Health Insurance Guaranty Association;\n(2) prominently warn the policy owner, contract owner, certificate holder, or enrollee that the Minnesota Life and Health Insurance Guaranty Association may not cover the policy or, if coverage is available, it will be subject to substantial limitations and exclusions and conditioned on continued residence in the state;\n(3) state that the member insurer and its agents are prohibited by law from using the existence of the Minnesota Life and Health Insurance Guaranty Association for the purpose of sales, solicitation, or inducement to purchase any form of insurance or health maintenance organization coverage;\n(4) emphasize that the policy owner, contract owner, certificate holder, or enrollee should not rely on coverage under the Minnesota Life and Health Insurance Guaranty Association when selecting an insurer or health maintenance organization;\n(5) provide other information as directed by the commissioner. The commissioner may approve any form of notice proposed by the association and, as to the approved form of notice, the association may notify all member insurers by mail or other electronic means that the form of notice is available as an alternative to the notice specified in subdivision 8.\n(c) A policy or contract not covered by the Minnesota Life and Health Insurance Guaranty Association or the Minnesota Insurance Guaranty Association must contain the following notice in ten-point type, stamped in red ink or contrasting type on the policy or contract and the application:\n\"THIS POLICY OR CONTRACT IS NOT PROTECTED BY THE MINNESOTA LIFE AND HEALTH INSURANCE GUARANTY ASSOCIATION OR THE MINNESOTA INSURANCE GUARANTY ASSOCIATION. IN THE CASE OF INSOLVENCY, PAYMENT OF CLAIMS IS NOT GUARANTEED. ONLY THE ASSETS OF THIS INSURER OR HEALTH MAINTENANCE ORGANIZATION WILL BE AVAILABLE TO PAY YOUR CLAIM.\"\nThis section does not apply to fraternal benefit societies regulated under chapter 64B.\nThe form of notice referred to in subdivision 7, paragraph (a), is as follows:\n\"........................................\n.........................................\n.........................................\n(insert name, current address, and\ntelephone number of member insurer)\nNOTICE CONCERNING POLICYHOLDER RIGHTS IN AN\nINSOLVENCY UNDER THE MINNESOTA LIFE AND HEALTH\nINSURANCE GUARANTY ASSOCIATION LAW\nIf the insurer or health maintenance organization that issued your life, annuity, or health insurance policy becomes impaired or insolvent, you are entitled to compensation for your policy or contract from the assets of that insurer. The amount you recover will depend on the financial condition of the insurer or health maintenance organization.\nIn addition, residents of Minnesota who purchase life insurance, annuities, health insurance, or health maintenance organization coverage from insurance companies authorized to do business in Minnesota are protected, SUBJECT TO LIMITS AND EXCLUSIONS, in the event the insurer or health maintenance organization becomes financially impaired or insolvent. This protection is provided by the Minnesota Life and Health Insurance Guaranty Association.\nFor purposes of this notice, the terms \"insurance company\" and \"insurer\" include health maintenance organizations.\nMinnesota Life and Health Insurance Guaranty Association\n(insert current\naddress and telephone number)\nThe maximum amount the guaranty association will pay for all policies or contracts issued on one life by the same insurer or health maintenance organization is limited to $500,000. Subject to this $500,000 limit, the guaranty association will pay up to $500,000 in life insurance death benefits, $130,000 in net cash surrender and net cash withdrawal values for life insurance, $500,000 in health insurance, health maintenance organization, and long-term care benefits, including any net cash surrender and net cash withdrawal values, $500,000 in disability income insurance, $250,000 in annuity net cash surrender and net cash withdrawal values, $410,000 in present value of annuity benefits for annuities which are part of a structured settlement or for annuities in regard to which periodic annuity benefits, for a period of not less than the annuitant's lifetime or for a period certain of not less than ten years, have begun to be paid on or before the date of impairment or insolvency, or if no coverage limit has been specified for a covered policy or benefit, the coverage limit shall be $500,000 in present value. Unallocated annuity contracts issued to retirement plans, other than defined benefit plans, established under section 401, 403(b), or 457 of the Internal Revenue Code of 1986, as amended through December 31, 1992, are covered up to $250,000 in net cash surrender and net cash withdrawal values, for Minnesota residents covered by the plan provided, however, that the association shall not be responsible for more than $10,000,000 in claims from all Minnesota residents covered by the plan. If total claims exceed $10,000,000, the $10,000,000 shall be prorated among all claimants. These are the maximum claim amounts. Coverage by the guaranty association is also subject to other substantial limitations and exclusions and requires continued residency in Minnesota. If your claim exceeds the guaranty association's limits, you may still recover a part or all of that amount from the proceeds of the liquidation of the insolvent insurer, if any exist. Funds to pay claims may not be immediately available. The guaranty association assesses insurers and health maintenance organizations licensed to sell life and health insurance in Minnesota after the insolvency occurs. Claims are paid from this assessment.\nBenefits provided by a long-term care rider to a life insurance policy or annuity contract shall be considered the same type of benefits as the base life insurance policy or annuity contract to which it relates.\nTHE COVERAGE PROVIDED BY THE GUARANTY ASSOCIATION IS NOT A SUBSTITUTE FOR USING CARE IN SELECTING INSURANCE COMPANIES THAT ARE WELL MANAGED AND FINANCIALLY STABLE. IN SELECTING AN INSURANCE COMPANY, CONTRACT, OR POLICY, YOU SHOULD NOT RELY ON COVERAGE BY THE GUARANTY ASSOCIATION.\nTHIS NOTICE IS REQUIRED BY MINNESOTA STATE LAW TO ADVISE POLICYHOLDERS OF LIFE, ANNUITY, HEALTH INSURANCE, OR HEALTH MAINTENANCE ORGANIZATION POLICIES AND CONTRACTS OF THEIR RIGHTS IN THE EVENT THEIR INSURANCE CARRIER BECOMES FINANCIALLY IMPAIRED OR INSOLVENT. THIS NOTICE IN NO WAY IMPLIES THAT THE COMPANY CURRENTLY HAS ANY TYPE OF FINANCIAL PROBLEMS. ALL LIFE, ANNUITY, HEALTH INSURANCE, AND HEALTH MAINTENANCE ORGANIZATION POLICIES AND CONTRACTS ARE REQUIRED TO PROVIDE THIS NOTICE.\"\nAdditional language may be added to the notice if approved by the commissioner prior to its use in the form. This section does not apply to fraternal benefit societies regulated under chapter 64B.\nThe notice required in subdivision 8 must clearly describe what portions of a combination fixed-variable policy are not covered by the Minnesota Life and Health Insurance Guaranty Association. The notice requirements specified in subdivision 7, paragraph (c), do not apply to a combination fixed-variable policy.\nThe distribution, delivery, contents, or interpretation of the notices described in subdivision 7, 8, or 9 shall not mean that either the policy or contract, or the owner or holder thereof, would be covered in the event of the impairment or insolvency of a member insurer if coverage is not otherwise provided by sections 61B.18 to 61B.32. Failure to receive the notice does not give the policyholder, contract holder, certificate holder, insured, owner, beneficiaries, assignees, or payees any greater rights than those provided by sections 61B.18 to 61B.32.",
	"repealed": false
}