{
	"id": "471.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.61",
	"title": "471.61 GROUP BENEFITS FOR OFFICERS, EMPLOYEES, RETIREES.",
	"text": "A county, municipal corporation, town, school district, county extension committee, other political subdivision or other body corporate and politic of this state, other than the state or any department of the state, through its governing body, and any two or more subdivisions acting jointly through their governing bodies, may insure or protect its or their officers and employees, and their dependents, or any class or classes of officers, employees, or dependents, under a policy or policies or contract or contracts of group insurance or benefits covering life, health, and accident, in the case of employees, and medical and surgical benefits and hospitalization insurance or benefits for both employees and dependents or dependents of an employee whose death was due to causes arising out of and in the course of employment, or any one or more of those forms of insurance or protection. A governmental unit, including county extension committees and those paying their employees, may pay all or any part of the premiums or charges on the insurance or protection. A payment is deemed to be additional compensation paid to the officers or employees, but for purposes of determining contributions or benefits under a public pension or retirement system it is not deemed to be additional compensation. One or more governmental units may determine that a person is an officer or employee if the person receives income from the governmental subdivisions without regard to the manner of election or appointment, including but not limited to employees of county historical societies that receive funding from the county and employees of the Minnesota Inter-county Association. The appropriate officer of the governmental unit, or those disbursing county extension funds, shall deduct from the salary or wages of each officer and employee who elects to become insured or so protected, on the officer's or employee's written order, all or part of the officer's or employee's share of premiums or charges and remit the share or portion to the insurer or company issuing the policy or contract.\nA governmental unit, other than a school district, that pays all or part of the premiums or charges is authorized to levy and collect a tax, if necessary, in the next annual tax levy for the purpose of providing the necessary money for the payment of the premiums or charges, and the sums levied and appropriated are not, in the event the sum exceeds the maximum sum allowed by the charter of a municipal corporation, considered part of the cost of government of the governmental unit as defined in any levy or expenditure limitation; provided at least 50 percent of the cost of benefits on dependents must be contributed by the employee or be paid by levies within existing charter tax limitations.\nThe word \"dependents\" as used in this subdivision means spouse and minor unmarried children under the age of 18 years actually dependent upon the employee.\nNotwithstanding any other law to the contrary, a political subdivision described in this subdivision may provide health benefits to its employees, dependents, any class or classes of officers, employers, or dependents, and other eligible persons through negotiated contributions to self-funded multiemployer health and welfare funds.\nNotwithstanding the provisions of Minnesota Statutes 1969, section 471.61, as amended by Laws 1971, chapter 451, section 1, the word \"dependents\" as used therein shall mean spouse and children under the age of 26 years.\nMS 1979 Supp [Repealed, 1980 c 528 s 5; 1Sp1981 c 4 art 2 s 44]\nMS 1949 [Repealed, 1953 c 696 s 4]\nAny county, municipal corporation, town, school district, county extension committee, other political subdivision or other body corporate and politic of this state, including the state or any department thereof, through its governing body, and any two or more subdivisions acting jointly through their governing bodies, may insure or protect its or their retired officers and retired employees entitled to benefits under any public employees retirement act and their dependents, or any class or classes thereof, under a policy or policies, or contract or contracts of group insurance or benefits covering life, health, and accident, medical and surgical benefits, or hospitalization insurance or benefits, for retired officers and retired employees and their dependents, or any one or more of such forms of insurance or protection. Any such governmental unit, including county extension committees, may pay all or any part of the premiums or charges on such insurance or protection or may require the retired officer or employee to pay all or part of the premiums or charges. Any one or more of such governmental units may determine that a person is a retired officer or a retired employee if such officer or employee, when employed, received income from such governmental subdivisions without regard to the manner of election or appointment. The appropriate officer of such governmental unit, or those disbursing county extension funds, shall collect from each such retired officer and retired employee who elects to become insured or so protected, on such officer's or employee's written order, all or part of the retired officer's or retired employee's share of such premiums or charges and remit the same to the insurer or company issuing such policy or contract. An insurer, health maintenance organization, or company issuing the policy or contract may not require a public employer to contribute any portion of the retired officer's or employee's share as a condition of eligibility for the insurance or protection. An insurer, health maintenance organization, or company issuing the policy or contract may require a retired officer or a retired employee to pay all or any part of the premiums or charges.\nAny governmental unit, other than a school district, which pays all or any part of such premiums or charges is authorized to levy and collect a tax, if necessary, in the next annual tax levy for the purpose of providing the necessary funds for the payment of such premiums or charges, and such sums so levied and appropriated shall not, in the event such sum exceeds the maximum sum allowed by the charter of a municipal corporation, be considered part of the cost of government of such governmental unit as defined in any tax or expenditure limitation; provided at least 50 percent of the cost of benefits on dependents shall be contributed by the retired officer or retired employee or be paid by levies within existing charter tax limitations.\nThe word \"dependents\" as used herein shall mean spouse and minor unmarried children under the age of 18 years actually dependent upon the retired officer or retired employee.\nA unit of local government must allow a former employee and the employee's dependents to continue to participate indefinitely in the employer-sponsored hospital, medical, and dental insurance group that the employee participated in immediately before retirement, under the following conditions:\n(a) The continuation requirement of this subdivision applies only to a former employee who is receiving a disability benefit or an annuity from a Minnesota public pension plan other than a volunteer firefighter plan, or who has met age and service requirements necessary to receive an annuity from such a plan.\n(b) Until the former employee reaches age 65, the former employee and dependents must be pooled in the same group as active employees for purposes of establishing premiums and coverage for hospital, medical, and dental insurance. However, a former employee under the age of 65 who is enrolled in Medicare Parts A and B due to the former employee's disability and for whom Medicare's obligation to pay claims is primary, and the former employee's dependents, must be pooled in the same group for purposes of this paragraph as former employees who have reached age 65.\n(c) A former employee may receive dependent coverage only if the employee received dependent coverage immediately before leaving employment. This subdivision does not require dependent coverage to continue after the death of the former employee. For purposes of this subdivision, \"dependent\" has the same meaning for former employees as it does for active employees in the unit of local government.\n(d) Coverage for a former employee and dependents may not discriminate on the basis of evidence of insurability or preexisting conditions unless identical conditions are imposed on active employees in the group that the employee left.\n(e) The former employee must pay the entire premium for continuation coverage, except as otherwise provided in a collective bargaining agreement or personnel policy. A unit of local government may discontinue coverage if a former employee fails to pay the premium within the deadline provided for payment of premiums under federal law governing insurance continuation.\n(f) An employer must notify an employee before termination of employment of the options available under this subdivision, and of the deadline for electing to continue to participate.\n(g) A former employee must notify the employer of intent to participate within the deadline provided for notice of insurance continuation under federal law. A former employee who does not elect to continue participation does not have a right to reenter the employer's group insurance program.\n(h) A former employee who initially selects dependent coverage may later drop dependent coverage while retaining individual coverage. A former employee may not drop individual coverage and retain dependent coverage.\n(i) This subdivision does not limit rights granted to former employees under other state or federal law, or under collective bargaining agreements or personnel plans.\n(j) Unless otherwise provided by a collective bargaining agreement, if retired employees were not permitted to remain in the active employee group prior to August 1, 1992, a public employer may assess active employees through payroll deduction for all or part of the additional premium costs from the inclusion of retired employees in the active employee group. This paragraph does not apply to employees covered by section 179A.03, subdivision 7.\n(k) Notwithstanding section 179A.20, subdivision 2a, insurance continuation under this subdivision may be provided for in a collective bargaining agreement or personnel policy.\nA like payroll deduction and remittance shall be made upon the written order of any such officer or employee who are, or become, subscribers under a contract with a nonprofit hospital service plan corporation as defined by law.\nMS 1961 [Repealed, 1965 c 780 s 9]\nAny political subdivision, or any two or more political subdivisions acting jointly, may contract with an insurance company licensed to do business in this state for the voluntary purchase of long-term care insurance by the employees and their dependents of the political subdivision or subdivisions. The coverage may be through a group policy or through individual coverage.",
	"repealed": false
}