{
	"id": "62L.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.08",
	"title": "62L.08 RESTRICTIONS RELATING TO PREMIUM RATES.",
	"text": "Premium rates for all health benefit plans sold or issued to small employers are subject to the restrictions specified in this section.\n[Repealed by amendment, 2013 c 84 art 1 s 56]\n[Repealed by amendment, 2013 c 84 art 1 s 56]\nEach health carrier may offer premium rates to small employers that vary based upon the ages of the eligible employees and dependents of the small employer only as provided in this subdivision. Premium rates may vary based upon the ages of the eligible employees and dependents of the small employer in accordance with the provisions of the Affordable Care Act as defined in section 62A.011, subdivision 1a.\nPremium rates may vary based on geographic rating areas set by the commissioner. The commissioner shall grant approval if the health carrier provides actuarial justification acceptable to the commissioner for the proposed geographic variations in rates.\nNo health carrier may determine premium rates through a method that is in any way based upon the gender of eligible employees or dependents. Rates must not in any way reflect marital status or generalized differences in expected costs between employees and spouses.\nPremium rates may vary based upon tobacco use in accordance with the provisions of the Affordable Care Act as defined in section 62A.011, subdivision 1a.\n(a) In developing its rates and premiums, a health carrier may take into account only the following factors:\n(1) actuarially valid differences in benefit designs of health benefit plans; and\n(2) actuarially valid geographic variations if approved by the commissioner as provided in subdivision 4.\n(b) All premium variations permitted under this section must be based upon actuarially valid differences in expected cost to the health carrier of providing coverage. The variation must be justified in initial rate filings and upon request of the commissioner in rate revision filings. All premium variations are subject to approval by the commissioner.\n[Repealed, 1995 c 234 art 7 s 28]\nA health carrier that offers, sells, issues, or renews a health benefit plan for small employers shall file with the commissioner the rates and must demonstrate that all rates shall be within the rating restrictions defined in this chapter. Such demonstration must include a description of how the health carrier intends to use demographic factors including case characteristics in calculating the premium rates. The rates shall not be approved, unless the commissioner has determined that the rates are reasonable. In determining reasonableness, the commissioner shall consider the growth rates applied under section 62J.04, subdivision 1, paragraph (b), to the calendar year or years that the proposed premium rate would be in effect, and actuarially valid changes in risk associated with the enrollee population.\nPremium rates must comply with the rating requirements of this section, notwithstanding the imposition of any assessments or premiums paid by health carriers as provided under sections 62L.13 to 62L.22.\n[Repealed by amendment, 2013 c 84 art 1 s 56]\nNotwithstanding section 62A.02, subdivision 3, relating to loss ratios, each policy or contract form used with respect to a health benefit plan offered, or issued in the small employer market, is subject, beginning July 1, 1993, to section 62A.021. The commissioner of health has, with respect to carriers under that commissioner's jurisdiction, all of the powers of the commissioner of commerce under that section.",
	"repealed": false
}