{
	"id": "169A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.20",
	"title": "169A.20 DRIVING WHILE IMPAIRED.",
	"text": "It is a crime for any person to drive, operate, or be in physical control of any motor vehicle, as defined in section 169A.03, subdivision 15, within this state or on any boundary water of this state when:\n(1) the person is under the influence of alcohol;\n(2) the person is under the influence of a controlled substance;\n(3) the person is under the influence of an intoxicating substance and the person knows or has reason to know that the substance has the capacity to cause impairment;\n(4) the person is under the influence of a combination of any two or more of the elements named in clauses (1) to (3) or (8);\n(5) the person's alcohol concentration at the time, or as measured within two hours of the time, of driving, operating, or being in physical control of the motor vehicle is 0.08 or more;\n(6) the vehicle is a commercial motor vehicle and the person's alcohol concentration at the time, or as measured within two hours of the time, of driving, operating, or being in physical control of the commercial motor vehicle is 0.04 or more;\n(7) the person's body contains any amount of a controlled substance listed in Schedule I or II, or its metabolite, other than cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, an artificially derived cannabinoid, or tetrahydrocannabinols; or\n(8) the person is under the influence of cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, an artificially derived cannabinoid, or tetrahydrocannabinols.\nMS 2020 [Repealed, 1Sp2021 c 6 art 3 s 13]\nMS 2020 [Repealed, 1Sp2021 c 6 art 3 s 13]\nMS 2020 [Repealed, 1Sp2021 c 6 art 3 s 13]\nIt is a crime for any person to refuse to submit to a chemical test:\n(1) of the person's breath under section 169A.51 (chemical tests for intoxication), or 169A.52 (test refusal or failure; revocation of license); or\n(2) of the person's blood or urine as required by a search warrant under sections 171.177 and 626.04 to 626.18.\nA person who violates this section may be sentenced as provided in section 169A.24 (first-degree driving while impaired), 169A.25 (second-degree driving while impaired), 169A.26 (third-degree driving while impaired), or 169A.27 (fourth-degree driving while impaired).",
	"repealed": false
}