{
	"id": "12.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.61",
	"title": "12.61 TEMPORARY MEDICAL CARE FACILITIES; LIABILITY.",
	"text": "For purposes of this section:\n(a) \"Emergency plan\" includes:\n(i) any plan for managing an emergency threatening public health developed by the commissioner of health or a local public health agency;\n(ii) any plan for managing an emergency threatening public health developed by one or more hospitals, clinics, nursing homes, or other health care facilities or providers and approved by the commissioner of health or local public health agency in consultation with emergency management officials; or\n(iii) any provision for assistance by out-of-state responders under interstate or international compacts, including but not limited to the Emergency Management Assistance Compact.\n(b) \"Regional hospital system\" means all hospitals in one of the hospital bioterrorism preparedness program geographic regions of the state set forth in the most recent hospital preparedness plan available on the Department of Health website.\n(c) \"Responder\" means any person or organization whether paid or volunteer that provides health care or other health-related services in an emergency including, but not limited to, physicians, physician assistants, registered and other nurses, certified nursing assistants, or other staff within a health care provider organization, pharmacists, chiropractors, dentists, emergency medical technicians, members of a specialized medical response unit, laboratory technicians, morticians, registered first responders, mental health professionals, hospitals, nursing and boarding care facilities, home health care agencies, other long-term care providers, medical and dental clinics, medical laboratories, and ambulance service personnel, dispatch services, and persons not registered as first responders but affiliated with a medical response unit and dispatched to the scene of an emergency by a public safety answering point or licensed ambulance service.\n(a) During a national security emergency or a peacetime emergency declared under section 12.31, the governor may issue an emergency executive order upon finding that the number of seriously ill or injured persons exceeds the emergency hospital or medical transport capacity of one or more regional hospital systems and that care for those persons has to be given in temporary care facilities.\n(b) During the effective period of the emergency executive order, a responder in any impacted region acting consistent with emergency plans is not liable for any civil damages or administrative sanctions as a result of good-faith acts or omissions by that responder in rendering emergency care, advice, or assistance. This section does not apply in case of malfeasance in office or willful or wanton actions.",
	"repealed": false
}