{
	"id": "171.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.12",
	"title": "171.12 DRIVING RECORD; FILING; PRIVATE DATA.",
	"text": "(a) The department shall file every application for a driver's license received by it and shall maintain suitable indices containing, in alphabetical order:\n(1) all applications denied and the reason for denial;\n(2) all applications granted; and\n(3) the name of every person whose license has been suspended, revoked, or canceled or who has been disqualified from operating a commercial motor vehicle by the department, and after each name the reasons for the action.\n(b) Notwithstanding section 260B.171 or 260C.171, data revealing that the reason for the action under paragraph (a), clause (3) is an order of the juvenile court are accessible to the public.\n(a) The commissioner must establish written procedures to ensure that only individuals authorized by law may enter, update, or access not public data collected, created, or maintained by the driver and vehicle services information system. An authorized individual's ability to enter, update, or access data in the system must correspond to the official duties or training level of the individual and to the statutory authorization granting access for that purpose. All queries and responses, and all actions in which data are entered, updated, accessed, shared, or disseminated, must be recorded in a data audit trail. Data contained in the audit trail are public to the extent the data are not otherwise classified by law.\n(b) If the commissioner determines that an individual willfully entered, updated, accessed, shared, or disseminated data in violation of state or federal law, the commissioner must impose disciplinary action. If an individual willfully gained access to data without authorization by law, the commissioner must forward the matter to the appropriate prosecuting authority for prosecution. The commissioner must not impose disciplinary action against an individual who properly accessed data to complete an authorized transaction or to resolve an issue that did not result in a completed authorized transaction.\n(c) The commissioner must establish a process that allows an individual who was subject to disciplinary action to appeal the action. If the commissioner imposes disciplinary action, the commissioner must notify the individual in writing of the action, explain the reason for the action, and explain how to appeal the action. The commissioner must transmit the notification within five calendar days of the action.\n(d) The commissioner must arrange for an independent biennial audit of the driver and vehicle services information system to determine whether data currently in the system are classified correctly, how the data are used, and to verify compliance with this subdivision. The results of the audit are public. No later than 30 days following completion of the audit, the commissioner must provide a report summarizing the audit results to the commissioner of administration; the chairs and ranking minority members of the committees of the house of representatives and the senate with jurisdiction over transportation policy and finance, public safety, and data practices; and the Legislative Commission on Data Practices and Personal Data Privacy. The report must be submitted as required under section 3.195, except that printed copies are not required.\n(e) For purposes of this subdivision, \"disciplinary action\" means a formal or informal disciplinary measure, including but not limited to requiring corrective action or suspending or revoking the individual's access to the driver and vehicle information system.\n[See Note.]\nThe department shall file all accident reports and abstracts of court records of convictions and violations received by it under the laws of this state and its political subdivisions, and in connection therewith maintain convenient records or make suitable notations in order that an individual record of each licensee showing the convictions of such licensee and the traffic accidents in which the licensee has been involved shall be readily ascertainable and available for the consideration of the department upon any application for renewal of license and the revocation, suspension, or limitation of licenses.\nWhen a person's driver's license or permit to drive is revoked or suspended pursuant to section 169A.52 or 171.177, or when a person is convicted for violating section 169A.20, 169A.31, 169A.33, 360.0752, 609.2112, 609.2113, or 609.2114, or Minnesota Statutes 2012, section 609.21, and a test of the person's breath, urine, or blood has been made to determine the person's alcohol concentration, the commissioner of public safety shall record the test results on the person's driving record pertaining to that violation. The alcohol concentration is classified as public data on individuals, as defined in section 13.02, subdivision 15, and must be kept for the period of time specified in subdivision 3, clause (4).\nThe department may cause applications for drivers' licenses, provisional licenses, and instruction permits, and related records, to be destroyed immediately after the period for which issued, except that:\n(1) the driver's record pertaining to revocations, suspensions, cancellations, disqualifications, convictions, and accidents is cumulative and must be kept for a period of at least five years;\n(2) the driver's record pertaining to violations of a driver or vehicle out-of-service order must be kept for a period of at least ten years;\n(3) medical certificates and medical waivers submitted in accordance with section 171.162 must be kept for a period of at least three years from the date of issuance; and\n(4) the driver's record pertaining to felony convictions in the commission of which a motor vehicle was used, to the alcohol-related offenses and licensing actions listed in section 169A.03, subdivisions 20 and 21, to violations of section 169.09, to violations of section 169A.31, and to violations of section 171.24, subdivision 5, must be retained permanently.\nNotwithstanding subdivision 3 or section 138.163, when an order for revocation, suspension, or cancellation of a driver's license or disqualification of a driver from operating a commercial motor vehicle is rescinded and all rights of appeal have been exhausted or have expired, the commissioner shall remove the record of that revocation, suspension, cancellation, or disqualification from the computer records that are disclosed to persons or agencies outside the Driver and Vehicle Services Division, Department of Public Safety.\nNotwithstanding subdivision 3 or section 138.163, when an order for suspension of a driver's license issued pursuant to section 171.186 is rescinded because the license was improperly suspended and all rights of appeal have been exhausted or have expired, the commissioner shall remove the record of that suspension from the computer records that are disclosed to persons or agencies outside the Driver and Vehicle Services Division of the Department of Public Safety.\n(a) If the procedures established by the commissioner for driver's license or Minnesota identification card records include retention of a physical copy or digital image of a birth certificate, the commissioner must:\n(1) notify a driver's license or identification card applicant of the retention procedure; and\n(2) allow the applicant, licensee, or identification cardholder to designate that the applicant, licensee, or identification cardholder's birth certificate physical copy or digital image must not be retained.\n(b) The commissioner must not retain a birth certificate if directed by an applicant, licensee, or identification cardholder under paragraph (a), clause (2), but must record and retain data on the birth certificate required under Code of Federal Regulations, title 6, section 37.31(c).\n[See Note.]\n[Repealed, 1976 c 2 s 69]\nThe department shall file all donor documents received by it, and in connection therewith maintain convenient records in order that donor status shall be readily ascertainable. On request of any interested party upon or after the donor's death, the department shall produce the donor document for examination.\nWhen an applicant for a driver's license, instruction permit, or Minnesota identification card requests a veteran designation under section 171.06, subdivision 3, the commissioner shall maintain a computer record of veteran designations. The veteran designation may be removed from the computer record only upon written notice to the department. The veteran designation is classified as private data on individuals as defined in section 13.02, subdivision 12, except that this information is available to the commissioner of veterans affairs for the purpose of administering veterans benefits.\n(a) Upon a request by an applicant for a driver's license, instruction permit, or Minnesota identification card under section 171.06, subdivision 3, the commissioner must maintain electronic records of names and contact information for up to three emergency contacts for the applicant. The request must be made on a form prescribed by the commissioner. The commissioner must make the form available on the department's website. The form must include a notice as described in section 13.04, subdivision 2.\n(b) A person who has provided emergency contact information under this subdivision may change, add, or delete the information at any point. Notwithstanding sections 171.06, subdivision 2, and 171.061, the commissioner or a driver's license agent must not charge a fee for a transaction described in this paragraph.\n(c) Emergency contact data are classified as private data on individuals, as defined in section 13.02, subdivision 12, except that the commissioner may share emergency contact information with law enforcement agencies to notify the emergency contacts regarding an emergency.\n(a) Upon request by an applicant for a driver's license, instruction permit, or Minnesota identification card under section 171.06, subdivision 3, the commissioner must maintain electronic records of names and contact information for individuals receiving exclusive care from the applicant. The request must be made on a form prescribed by the commissioner. The commissioner must make the form available on the department's website. The form must include a notice as described in section 13.04, subdivision 2.\n(b) A person who has provided caretaker information under this subdivision may change, add, or delete the information at any time. Notwithstanding sections 171.06, subdivision 2; and 171.061, the commissioner or a driver's license agent must not charge a fee for a transaction described in this paragraph.\n(c) Caretaker data are classified as private data on individuals, as defined in section 13.02, subdivision 12, except that the commissioner may share caretaker information with law enforcement agencies to notify the cared-for individuals regarding an emergency.\n(a) Except as provided in paragraph (c), the department must not keep on the record of a driver any conviction for a violation of a speed limit of 55 miles per hour unless the violation consisted of a speed greater than ten miles per hour in excess of the speed limit.\n(b) Except as provided in paragraph (c), the department must not keep on the record of a driver any conviction for a violation of a speed limit of 60 miles per hour unless the violation consisted of a speed greater than five miles per hour in excess of the speed limit.\n(c) This subdivision does not apply to (1) a violation that occurs in a commercial motor vehicle, or (2) a violation committed by a holder of a class A, B, or C commercial driver's license or commercial driver learner's permit, without regard to whether the violation was committed in a commercial motor vehicle or another vehicle.\n(a) Except as provided in paragraph (b), the commissioner must not record on an individual's driving record any violation of:\n(1) a traffic-control signal under section 169.06, subdivision 10; or\n(2) a speed limit under section 169.14, subdivision 13.\n(b) This subdivision does not apply to:\n(1) a violation that occurs in a commercial motor vehicle; or\n(2) a violation committed by a holder of a class A, B, or C commercial driver's license or commercial driver learner's permit, without regard to whether the violation was committed in a commercial motor vehicle or another vehicle.\n(c) This subdivision applies to violations committed on or after August 1, 2025, and before August 1, 2029.\n(a) Data on individuals provided to obtain a driver's license or Minnesota identification card shall be treated as provided by United States Code, title 18, section 2721, as in effect on May 23, 2005, and shall be disclosed as required or permitted by that section. The commissioner shall disclose the data in bulk form upon request to an authorized recipient under United States Code, title 18, section 2721. For any disclosure of data on individuals related to a noncompliant driver's license or identification card, the commissioner must require a certification pursuant to subdivision 7b, paragraph (d).\n(b) An applicant for a driver's license or a Minnesota identification card may consent, in writing, to the commissioner to disclose the applicant's personal information exempted by United States Code, title 18, section 2721, to any person who makes a request for the personal information. If the applicant so authorizes disclosures, the commissioner shall implement the request and the information may be used.\n(c) If authorized by an applicant for a driver's license or a Minnesota identification card, as indicated in paragraph (b), the applicant's personal information may be used, rented, or sold solely for bulk distribution by organizations for business purposes, including surveys, marketing, or solicitation.\n(d) An applicant for a driver's license, instruction permit, or Minnesota identification card may request that the applicant's residence address be classified as \"private data on individuals,\" as defined in section 13.02, subdivision 12. The commissioner shall grant the classification on receipt of a signed statement by the individual that the classification is required for the safety of the applicant or the applicant's family, if the statement also provides a valid, existing address where the applicant consents to receive service of process. The commissioner shall use the service for process mailing address in place of the residence address in all documents and notices pertaining to the driver's license, instruction permit, or Minnesota identification card. The residence address and any information provided in the classification request, other than the mailing address, are private data on individuals and may be provided to requesting law enforcement agencies, probation and parole agencies, and public authorities, as defined in section 518A.26, subdivision 18.\n(a) Subject to subdivision 11, the commissioner must disclose personal information where the use is related to the operation of a motor vehicle or to public safety. The use of personal information is related to public safety if it concerns the physical safety or security of drivers, vehicles, pedestrians, or property. The commissioner may refuse to disclose data under this subdivision when the commissioner concludes that the requester is likely to use the data for illegal, improper, or noninvestigative purposes.\n(b) The commissioner must disclose personal information to the secretary of state for the purpose of increasing voter registration and improving the accuracy of voter registration records in the statewide voter registration system. The secretary of state may not retain data provided by the commissioner under this subdivision for more than 60 days and may not share or disseminate any data on individuals who have applied for or been issued a noncompliant driver's license or identification card except for the purpose of administering elections or as permitted in section 201.13, subdivision 3, paragraph (d).\n(a) With respect to noncompliant licenses or identification cards, the commissioner is prohibited from:\n(1) electronically disseminating outside the state data that is not disseminated as of May 19, 2017; or\n(2) utilizing any electronic validation or verification system accessible from or maintained outside the state that is not in use as of May 19, 2017.\n(b) The limitations in paragraph (a) do not apply to the extent necessary to:\n(1) maintain compliance with the driver's license compact under section 171.50 and applicable federal law governing commercial driver's licenses;\n(2) perform identity verification as part of an application for a replacement Social Security card issued by the Social Security Administration; and\n(3) perform identity verification for a program participant in the Transportation Security Administration's Registered Traveler program who has voluntarily provided their Minnesota driver's license or identification card to confirm their identity to a private entity operating under the Registered Traveler program.\n(c) For purposes of paragraph (b), clause (3), the information provided for identity verification is limited to name, date of birth, the license or identification card's identification number, issuance date, expiration date, and credential security features which does not include facial recognition.\n(d) For purposes of this subdivision, \"outside the state\" includes federal agencies, states other than Minnesota, organizations operating under agreement among the states, and private entities.\n(e) Prior to disclosing to a data requester, other than the data subject, any data on individuals relating to a noncompliant driver's license or identification card, the commissioner or a driver's license agent must require the data requester to certify that the data requester must not use the data for civil immigration enforcement purposes or disclose the data to a state or federal government entity that primarily enforces immigration law or to any employee or agent of any such government entity. A data requester who violates the certification required in this paragraph may be liable in a civil action brought under section 13.08, may be subject to criminal penalties under section 13.09, may have subsequent requests for noncompliant driver's license or identification card data be denied by the commissioner, and may lose access to the driver records subscription service under section 168.327. A certification form used by the commissioner or a driver's license agent under this paragraph must include information about penalties that apply for violations.\n[See Note.]\n(a) The commissioner must not share any data the department maintains under section 171.07, subdivision 13, with any federal agency, federal department, or federal entity for a use that would otherwise be permissible under United States Code, title 18, section 2721, or other law.\n(b) Data collected by government entities under sections 624.712 to 624.719 are classified under section 13.87, subdivision 2.\n[See Note.]\n[Repealed, 1Sp2005 c 6 art 2 s 48]\nSubject to subdivision 11, the commissioner shall also furnish driving records, without charge, to chiefs of police, county sheriffs, prosecuting attorneys, and other law enforcement agencies with the power to arrest.\nFor purposes of this section, \"license\" includes \"enhanced driver's license,\" and \"identification card\" includes \"enhanced identification card.\"\n(a) For purposes of this section, \"immigration status data\" means data on individuals who have applied for or been issued a noncompliant driver's license or identification card and that indicate or otherwise have the effect of identifying (1) whether the individual has demonstrated United States citizenship, or (2) whether the individual has demonstrated lawful presence in the United States. Immigration status data include but are not limited to any documents specified under section 171.062; immigration status data contained in those documents; or the applicant's submission of the documents.\n(b) Immigration status data are classified as private data on individuals, as defined in section 13.02, subdivision 12. Notwithstanding any law to the contrary, the commissioner or a driver's license agent must not share or disseminate immigration status data except to or within the division of the department that administers driver licensing and to the secretary of state for purposes of improving the accuracy of voter registration records under subdivision 7a.\n(c) As authorized or required by state or federal law, the commissioner or a driver's license agent may share or disseminate data on individuals who have applied for or been issued a noncompliant driver's license or identification card that are not immigration status data to a government entity, as defined in section 13.02, subdivision 7a, or to a federal government entity that does not enforce immigration law, provided that the receiving entity must not use the data for civil immigration enforcement purposes or further disclose the data to a state or federal government entity that primarily enforces immigration law or to any employee or agent of any such government entity.\n(d) Notwithstanding any law to the contrary, the commissioner or a driver's license agent must not share or disseminate any data on individuals who have applied for or been issued a noncompliant driver's license or identification card to any federal government entity that primarily enforces immigration law, except pursuant to a valid search warrant or court order issued by a state or federal judge.\n(e) Violation of this subdivision by the commissioner, a driver's license agent, a government entity, or an employee or agent thereof constitutes a violation of the Minnesota Government Data Practices Act and may be subject to penalties and remedies applicable under that chapter.",
	"repealed": false
}