{
	"id": "18H.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.02",
	"title": "18H.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Agent\" means an entity who, on behalf of another entity, receives on consignment, contracts for, or solicits for sale on commission, a plant product from a producer or supplier of the product or negotiates the consignment or purchase of a plant product on behalf of another entity.\n\"Annual\" means a plant with a life cycle of less than one year when grown in Minnesota.\n\"Certificate\" means a document authorized or prepared by a federal or state regulatory official that affirms, declares, or verifies that a plant, product, shipment, or other officially regulated item meets phytosanitary, nursery inspection, pest freedom, plant registration or certification, or other legal requirements.\n\"Certification\" means a regulatory official's act of affirming, declaring, or verifying compliance with phytosanitary, nursery inspection, pest freedom, plant registration or certification, or other legal requirements.\n\"Certified nursery stock\" means nursery stock which has been officially inspected by the commissioner and found apparently free of quarantine and regulated nonquarantine pests or significant dangerous or potentially damaging plant pests.\n\"Commissioner\" means the commissioner of agriculture or the commissioner's designated employee, representative, or agent.\n\"Consignee\" means an entity to whom a plant, nursery stock, horticultural product, or plant product is shipped for handling, planting, sale, resale, or any other purpose.\n\"Consignor\" means an entity who ships or delivers to a consignee a plant, nursery stock, horticultural product, or plant product for handling, planting, sale, resale, or any other purpose.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Department\" means the Minnesota Department of Agriculture.\n\"Distribute\" means offer for sale, sell, barter, give away, ship, deliver for shipment, receive and deliver, offer to deliver, receive on consignment, contract for, solicit for sale on commission, or negotiate the consignment or purchase in this state.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Etiolated growth\" means plant growth with reduced or no chlorophyll production due to a lack of sunlight. Etiolated growth is evidenced by pale, yellowish or white plants and weak, spindly stems.\n\"Individual\" means a human being who is not the sole proprietor of a registered business selling plants for planting.\n\"Infected\" means a plant that is:\n(1) contaminated with pathogenic microorganisms;\n(2) being parasitized;\n(3) a host or carrier of an infectious, transmissible, or contagious pest; or\n(4) so exposed to a plant listed in clause (1), (2), or (3) that one of those conditions can reasonably be expected to exist and the plant may also pose a risk of contamination to other plants or the environment.\n\"Infested\" means a plant that contains an unacceptable level of plant pests, including weeds, or contains or harbors plant pests in a quantity that may threaten other plants.\n[Repealed, 1Sp2005 c 1 art 1 s 98]\n\"Label\" means a legible tag or other signage attached to a specific plant or plant container that provides the identity of the plant and any other required or relevant information regarding the plant.\n\"Live plant dealer\" means an entity who:\n(1) raises, grows, or propagates nursery stock for sale, outdoors or indoors;\n(2) acquires and further distributes nursery stock, including through landscaping or distribution with a tree spade; or\n(3) operates a business in Minnesota selling nursery stock with or without taking ownership or handling the nursery stock.\n\"Mark\" means an official indicator affixed by the commissioner for purposes of identification or separation to, on, around, or near plants or plant material known or suspected to be infested or infected with a plant pest or to otherwise distinguish the plants or plant material from other plants or materials. This includes, but is not limited to, paint, markers, tags, seals, stickers, tape, ribbons, signs, or placards.\n\"Nonhardy\" means a plant that cannot be expected to survive or reliably produce flowers and fruit in average minimum winter temperatures at the growing site as determined by the commissioner based upon independent field trials and industry input represented by the United States Department of Agriculture Plant Hardiness Zone designations.\n\"Nursery\" means a place where nursery stock is grown, propagated, collected, or distributed, including, but not limited to, private property or property owned, leased, or managed by any agency of the United States, Minnesota or its political subdivisions, or any other state or its political subdivisions where nursery stock is fumigated, treated, packed, or stored.\n\"Nursery certificate\" means a document issued by the commissioner recognizing that an entity is eligible to sell, offer for sale, or distribute certified nursery stock at a particular location under a specified business name.\n[Repealed, 1Sp2005 c 1 art 1 s 98]\n\"Nursery stock\" means a plant intended for planting or propagation, including, but not limited to, trees, shrubs, vines, perennials, biennials, grafts, cuttings, and buds that may be sold for propagation, whether cultivated or wild, and all viable parts of these plants. Nursery stock does not include:\n(1) field and forage crops or sod;\n(2) seeds;\n(3) vegetable plants, bulbs, or tubers;\n(4) cut material such as flowers or other herbaceous or woody plants, unless stems or other portions are intended for propagation;\n(5) tropical plants;\n(6) annuals; or\n(7) Christmas trees.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Owner\" includes, but is not limited to, the entity with the legal right of possession, proprietorship of, or responsibility for the property or place where any of the articles regulated in this chapter are found, or the entity who is in possession of, proprietorship of, or has responsibility for the regulated articles.\n\"Packaged nursery stock\" means bare root nursery stock packed with the roots in moisture-retaining material encased in plastic film or other material designed to hold the moisture-retaining material in place.\n\"Entity\" means a registered business such as a firm, a corporation, a partnership, an association, a trust, a joint stock company, an unincorporated organization, or a sole proprietorship; the state; a state agency; or a political subdivision.\n\"Place of origin\" means the county and state where nursery stock was most recently certified or grown for at least one growing season.\n\"Plant\" means a plant, plant product, plant part, or reproductive or propagative part of a plant, plant product, or plant part, including all growing media, packing material, or containers associated with the plants, plant parts, or plant products.\n\"Plant pest\" means any organism that the commissioner determines is capable of causing harm to terrestrial plants, including but not limited to insects, snails, nematodes, fungi, viruses, bacteria, microorganisms, mycoplasma-like organisms, weeds, and parasitic plants.\n\"Pollinator lethal insecticide\" means an insecticide absorbed by a plant that makes the plant lethal to pollinators. Pollinator lethal insecticide includes, but is not limited to, the neonicotinoid class of insecticides that affect the central nervous system of pollinators and may cause pollinator paralysis or death.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Quarantine\" means an enforced isolation or restriction of free movement of plants, plant material, animals, animal products, or any article or material in order to treat, control, or eradicate a plant pest.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Sales location\" means a fixed location from which certified nursery stock is distributed or displayed with the intent to sell.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Tree spade\" means a mechanical device or machinery capable of removing nursery stock, root system, and soil from a planting.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Tropical plant\" means a plant that has a United States Department of Agriculture hardiness zone designation of zone 6 or greater, or an annual minimum hardiness temperature of -9 degrees Fahrenheit.",
	"repealed": false
}