{
	"id": "260E.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.36",
	"title": "260E.36 SPECIALIZED TRAINING AND EDUCATION REQUIRED.",
	"text": "(a) The commissioner of human services, for employees subject to the Minnesota Merit System, and directors of county personnel systems, for counties not subject to the Minnesota Merit System, shall establish a job classification consisting exclusively of persons with the specialized knowledge, skills, and experience required to satisfactorily perform child protection duties pursuant to this chapter.\n(b) All child protection workers or social services staff having responsibility for child protection duties under this chapter shall receive 15 hours of continuing education or in-service training each year relevant to providing child protective services. The local welfare agency shall maintain a record of training completed by each employee having responsibility for performing child protection duties.\nAs required by the Child Abuse Prevention and Treatment Act amendments through Public Law 114-22 and to implement Public Laws 113-183 and 115-123, all child protection social workers and social services staff who have responsibility for child protective duties under this chapter or chapter 260C shall complete training implemented by the commissioner of children, youth, and families regarding identification, prevention, and response to human trafficking and sexual exploitation of children and youth, including prevention for youth missing from care.\n[See Note.]\nAn individual who seeks employment as a child protection worker after the commissioner of children, youth, and families has implemented the foundation training program developed under section 260E.37 must complete competency-based foundation training during their first six months of employment as a child protection worker.\n(a) County employees hired on or after July 1, 2015, who have responsibility for child protection duties or current county employees who are assigned new child protection duties on or after July 1, 2015, are required to undergo a background study. A county may complete these background studies by either:\n(1) use of the Department of Human Services NETStudy 2.0 system according to sections 245C.03 and 245C.10; or\n(2) an alternative process defined by the county.\n(b) County social services agencies and local welfare agencies must initiate background studies before an individual begins a position allowing direct contact with persons served by the agency.\nThe commissioners of children, youth, and families and public safety shall cooperate in developing and maintaining a joint program for training child maltreatment services professionals in the appropriate techniques for child maltreatment assessment and investigation. The program shall include but need not be limited to the following areas:\n(1) the public policy goals of the state as set forth in section 260C.001 and the role of the assessment or investigation in meeting these goals;\n(2) the special duties of child protection workers and law enforcement officers under this chapter;\n(3) the appropriate methods for directing and managing affiliated professionals who may be utilized in providing protective services and strengthening family ties;\n(4) the appropriate methods for interviewing alleged victims of child maltreatment and other children in the course of performing an assessment or an investigation;\n(5) the dynamics of child maltreatment within family systems and the appropriate methods for interviewing parents in the course of the assessment or investigation, including training in recognizing cases in which one of the parents is a victim of domestic abuse and in need of special legal or medical services;\n(6) the legal, evidentiary considerations that may be relevant to the conduct of an assessment or an investigation;\n(7) the circumstances under which it is appropriate to remove the alleged offender or the alleged victim from the home;\n(8) the protective social services that are available to protect alleged victims from further maltreatment, to prevent child maltreatment and domestic abuse, and to preserve the family unit; and training in the preparation of case plans to coordinate services for the alleged child victim with services for any parents who are victims of domestic abuse;\n(9) the methods by which child protection workers and law enforcement workers cooperate in conducting assessments and investigations in order to avoid duplication of efforts; and\n(10) appropriate methods for interviewing alleged victims and conducting investigations in cases where the alleged victim is developmentally, physically, or mentally disabled.\nThe commissioners of human services and public safety shall provide the program courses described in subdivision 2 at convenient times and locations in the state. The commissioners shall give training priority in the program areas cited in subdivision 2 to persons currently performing assessments and investigations pursuant to this chapter.\n(a) The commissioner of children, youth, and families shall add the following funds to the funds appropriated under section 260E.37, subdivision 2, to develop and support training.\n(b) The commissioner of children, youth, and families shall submit claims for federal reimbursement earned through the activities and services supported through Department of Children, Youth, and Families child protection or child welfare training funds. Federal revenue earned must be used to improve and expand training services by the department. The department expenditures eligible for federal reimbursement under this section must not be made from federal funds or funds used to match other federal funds.\n(c) Each year, the commissioner of children, youth, and families shall withhold from funds distributed to each county under Minnesota Rules, parts 9550.0300 to 9550.0370, an amount equivalent to 1.5 percent of each county's annual title XX allocation under section 256M.50. The commissioner must use these funds to ensure decentralization of training.\n(d) The federal revenue under this subdivision is available for these purposes until the funds are expended.",
	"repealed": false
}