{
	"id": "297F.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.24",
	"title": "297F.24 FEE IN LIEU OF SETTLEMENT.",
	"text": "(a) A fee is imposed upon the sale of nonsettlement cigarettes in this state, upon having nonsettlement cigarettes in possession in this state with intent to sell, upon any person engaged in business as a distributor, and upon the use or storage by consumers of nonsettlement cigarettes. The fee equals a rate of 2.5 cents per cigarette.\n(b) The purpose of this fee is to:\n(1) ensure that manufacturers of nonsettlement cigarettes pay fees to the state that are comparable to costs attributable to the use of the cigarettes;\n(2) prevent manufacturers of nonsettlement cigarettes from undermining the state's policy of discouraging underage smoking by offering nonsettlement cigarettes at prices substantially below the cigarettes of other manufacturers; and\n(3) fund such other purposes as the legislature determines appropriate.\nFor purposes of this section, a \"nonsettlement cigarette\" means a cigarette manufactured by a person other than a manufacturer that:\n(1) is making annual payments to the state of Minnesota under a settlement of the lawsuit styled as State v. Philip Morris Inc., No. C1-94-8565 (Minnesota District Court, Second Judicial District), if the style of cigarettes is included in computation of the payments under the agreement; or\n(2) has voluntarily entered into an agreement with the state of Minnesota, approved by the attorney general, agreeing to terms similar to those contained in the settlement agreement, identified in clause (1) including making annual payments to the state, with respect to its national sales of the style of cigarettes, equal to at least 75 percent of the payments that would apply if the manufacturer was one of the four original parties to the settlement agreement required to make annual payments to the state.\nThe commissioner shall administer the fee under this section in the same manner as the excise tax imposed under section 297F.05 and all of the provisions of this chapter apply as if the fee were a tax imposed under section 297F.05. The commissioner shall deposit the proceeds of the fee in the general fund.",
	"repealed": false
}