{
	"id": "357.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/357.09",
	"title": "357.09 SHERIFFS.",
	"text": "Fees set under subdivision 8 shall be charged and collected by the sheriff for:\n(1) serving a summons, warrant, writ, subpoena, or any process issued by a court of record, for each defendant served and mileage;\n(2) taking and approving a bond, and for a certified copy;\n(3) collection on execution after levy;\n(4) posting three notices of sale;\n(5) certificate of sale of real estate; a copy when requested;\n(6) selling land on foreclosure of a mortgage, for all services required, including executing a certificate of sale; postponing such a sale;\n(7) making diligent search and inquiry and returning a summons when defendants cannot be found;\n(8) returning an execution unsatisfied when no service is made;\n(9) receiving and paying over money paid on redemption of property and executing a certificate, to be collected from the person redeeming;\n(10) securing and safely keeping property in replevin or attachment or on execution;\n(11) for services not herein enumerated, if provided by the county board;\n(12) for all process when no charge is made for service of a return of not found or unsatisfied.\nWhen mileage is allowed the sheriff it shall be computed from the place where the court is usually held.\nThe sheriff shall be allowed reasonable and necessary expenses actually paid out for food furnished any prisoner while conducting the prisoner to jail and for the prisoner's transportation by a common carrier.\nThe fees allowed for the service of an execution, for advertising thereon, and for filing certificate with the county recorder shall be collected by virtue thereof and in the same manner as the sum therein directed to be levied.\n[Repealed, 1977 c 338 s 4]\nThis section shall not relate to or affect the fees of the sheriff of Ramsey County.\nAll special laws relating to sheriffs' fees and mileage allowance which are inconsistent with the provisions of Laws 1977, chapter 338, are superseded to the extent of the inconsistency.\nThe county board shall set the sheriff's fees with the advice and consultation of the sheriff.",
	"repealed": false
}