{
	"id": "103C.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.501",
	"title": "103C.501 CONSERVATION CONTRACTS PROGRAM.",
	"text": "The state board may allocate available funds to districts for practices, projects, and systems for:\n(1) erosion or sedimentation control;\n(2) improvements to water quality or water quantity;\n(3) habitat enhancement;\n(4) plant biodiversity;\n(5) energy conservation; or\n(6) climate adaptation, resiliency, or mitigation.\nMS 2022 [Repealed, 2023 c 60 art 5 s 22]\nMS 2022 [Repealed, 2023 c 60 art 5 s 22]\nThe allocated funds must be used:\n(1) for conservation activities, including technical and financial assistance, identified in state-approved plans that are related to water and natural resources and established under chapters 103B, 103C, 103D, 103F, 103G, and 114D;\n(2) to leverage federal or other nonstate funds; or\n(3) to address high-priority needs identified by the district based on public input.\n(a) A district may provide technical and financial assistance to a land occupier or to a state or federal agency for practices and projects for:\n(1) erosion or sedimentation control;\n(2) improvements to water quality or water quantity;\n(3) habitat enhancement;\n(4) plant biodiversity;\n(5) energy conservation; or\n(6) climate adaptation, resiliency, or mitigation.\n(b) A district, consistent with state board rules and policies, may contract to provide technical and financial assistance for structural and nonstructural practices and projects.\n(c) The state board or the district may not furnish any financial assistance for practices designed only to increase land productivity.\n(d) When a district determines that long-term maintenance of a system or practice is desirable, the district or the state board may require that maintenance be made a covenant upon the land for the effective life of the practice. A covenant under this subdivision shall be construed in the same manner as a conservation restriction under section 84.65.\nThe state board may adopt rules and shall adopt policies prescribing:\n(1) procedures and criteria for allocating funds; and\n(2) standards and guidelines for implementing the conservation contracts program.\nThe district or the district's delegate must conduct site inspections of conservation practices installed to determine if the land occupier is in compliance with design, operation, and maintenance specifications.",
	"repealed": false
}