{
	"id": "144A.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.70",
	"title": "144A.70 REGISTRATION OF SUPPLEMENTAL NURSING SERVICES AGENCIES.",
	"text": "As used in sections 144A.70 to 144A.74, the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of health.\n\"Controlling person\" means a business entity or entities, officer, program administrator, or director, whose responsibilities include the management and decision-making authority to establish or control business policy and all other policies of a supplemental nursing services agency. Controlling person also means an individual who, directly or indirectly, beneficially owns an interest in a corporation, partnership, or other business association that is a controlling person.\n\"Health care facility\" means a hospital, boarding care home, or outpatient surgical center licensed under sections 144.50 to 144.58; a nursing home or home care agency licensed under this chapter; an assisted living facility licensed under chapter 144G; or a board and lodging establishment that is registered to provide supportive or health supervision services under section 157.17.\n\"Nurse\" means a licensed practical nurse as defined in section 148.171, subdivision 8, or a registered nurse as defined in section 148.171, subdivision 20.\n\"Person\" includes an individual, corporation, partnership, limited liability company, or association.\n\"Supplemental nursing services agency\" means a person, corporation, partnership, limited liability company, or association engaged for hire in the business of providing or procuring temporary employment in health care facilities for nurses, nursing assistants, nurse aides, and orderlies. Supplemental nursing services agency does not include an individual who only engages in providing the individual's services on a temporary basis to health care facilities. Supplemental nursing services agency does not include a professional home care agency licensed under section 144A.471 that only provides staff to other home care providers.\nThe commissioner is responsible for the oversight of supplemental nursing services agencies through semiannual unannounced surveys and follow-up surveys, complaint investigations under sections 144A.51 to 144A.53, and other actions necessary to ensure compliance with sections 144A.70 to 144A.74.",
	"repealed": false
}