{
	"id": "125A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.06",
	"title": "125A.06 BLIND PERSONS' LITERACY RIGHTS.",
	"text": "(a) Paragraphs (b) to (f) may be cited as the \"Blind Persons' Literacy Rights and Education Act.\"\n(b) The following definitions apply to paragraphs (c) to (f).\n\"Blind student\" means an individual who is eligible for special educational services and who:\n(1) has a visual acuity of 20/200 or less in the better eye with correcting lenses or has a limited field of vision such that the widest diameter subtends an angular distance of no greater than 20 degrees; or\n(2) has a medically indicated expectation of visual deterioration.\n\"Braille\" means the system of reading and writing through touch commonly known as standard English Braille.\n(c) In developing an individualized education program for each blind student the presumption must be that proficiency in Braille reading and writing is essential for the student to achieve satisfactory educational progress. The assessment required for each student must include a Braille skills inventory, including a statement of strengths and deficits. Braille instruction and use are not required by this paragraph if, in the course of developing the student's individualized education program, team members concur that the student's visual impairment does not affect reading and writing performance commensurate with ability. This paragraph does not require the exclusive use of Braille if other special education services are appropriate to the student's educational needs. The provision of other appropriate services does not preclude Braille use or instruction. Instruction in Braille reading and writing must be available for each blind student for whom the multidisciplinary team has determined that reading and writing is appropriate.\n(d) Instruction in Braille reading and writing must be sufficient to enable each blind student to communicate effectively and efficiently with the same level of proficiency expected of the student's peers of comparable ability and grade level.\n(e) The student's individualized education program must specify:\n(1) the results obtained from the assessment required under paragraph (c);\n(2) how Braille will be implemented through integration with other classroom activities;\n(3) the date on which Braille instruction will begin;\n(4) the length of the period of instruction and the frequency and duration of each instructional session;\n(5) the level of competency in Braille reading and writing to be achieved by the end of the period and the objective assessment measures to be used; and\n(6) if a decision has been made under paragraph (c) that Braille instruction or use is not required for the student:\n(i) a statement that the decision was reached after a review of pertinent literature describing the educational benefits of Braille instruction and use; and\n(ii) a specification of the evidence used to determine that the student's ability to read and write effectively without Braille is not impaired.\n(f) Instruction in Braille reading and writing is a service for the purpose of special education and services under this section.\n(g) Paragraphs (b) to (f) must not be construed to supersede any rights of a parent or guardian of a child with a disability under federal or state law.",
	"repealed": false
}