{
	"id": "62U.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.05",
	"title": "62U.05 PROVIDER PRICING FOR BASKETS OF CARE.",
	"text": "(a) By July 1, 2009, the commissioner of health shall establish uniform definitions for baskets of care beginning with a minimum of seven baskets of care. In selecting health conditions for which baskets of care should be defined, the commissioner shall consider coronary artery and heart disease, diabetes, asthma, and depression. In selecting health conditions, the commissioner shall also consider the prevalence of the health conditions, the cost of treating the health conditions, and the potential for innovations to reduce cost and improve quality.\n(b) The commissioner shall convene one or more work groups to assist in establishing these definitions. Each work group shall include members appointed by statewide associations representing relevant health care providers and health plan companies, and organizations that work to improve health care quality in Minnesota.\n(c) To the extent possible, the baskets of care must incorporate a patient-directed, decision-making support model.\n(a) Beginning January 1, 2010, health care providers may establish package prices for the baskets of care defined under subdivision 1.\n(b) Beginning January 1, 2010, no health care provider or group of providers that has established a package price for a basket of care under this section shall vary the payment amount that the provider accepts as full payment for a health care service based upon the identity of the payer, upon a contractual relationship with a payer, upon the identity of the patient, or upon whether the patient has coverage through a group purchaser. This paragraph applies only to health care services provided to Minnesota residents or to non-Minnesota residents who obtain health insurance through a Minnesota employer. This paragraph does not apply to services paid for by Medicare, state public health care programs through fee-for-service or prepaid arrangements, workers' compensation, or no-fault automobile insurance. This paragraph does not affect the right of a provider to provide charity care or care for a reduced price due to financial hardship of the patient or due to the patient being a relative or friend of the provider.\n(a) The commissioner shall establish quality measurements for the defined baskets of care by December 31, 2009. The commissioner may contract with an organization that works to improve health care quality to make recommendations about the use of existing measures or establishing new measures where no measures currently exist.\n(b) Beginning July 1, 2010, the commissioner or the commissioner's designee shall publish comparative price and quality information on the baskets of care in a manner that is easily accessible and understandable to the public, as this information becomes available.",
	"repealed": false
}