{
	"id": "84.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.03",
	"title": "84.03 ADDITIONAL DUTIES AND POWERS.",
	"text": "(a) So far as practicable the commissioner shall collect and arrange statistics and other information in reference to the lands and general and special resources of the state.\n(b) The commissioner is hereby authorized and empowered to take such measures as the commissioner may deem advisable to advertise, both within and without the state, sales of all state lands, and to secure, compile, and issue such valuable statistics of the resources of the state.\n(c) The commissioner may adopt and promulgate reasonable rules, not inconsistent with law, governing the use and enjoyment of state land reserved from sale, state parks, state water-access sites, state trails, state monuments, state scientific and natural areas, state wilderness areas, and recreational areas owned by other state, local and federal agencies and operated under agreement by the Department of Natural Resources, which shall have the force and effect of law. A reasonable fee may be fixed, charged, and collected by the commissioner for the privilege of the use of any or all of the foregoing privileges and facilities.\n(d) The commissioner, on or before November 15 of each even-numbered year, shall report to the legislature the commissioner's acts and doings, with recommendation for the improvement or conservation of state parks, state water-access sites, state trails, and state monuments, state scientific and natural areas, state forests, state wildlife management areas, public hunting grounds, public shooting grounds, food and cover planting areas, wildlife lands, recreational or public hunting areas, state wild and scenic rivers, state wilderness areas, and all other recreational lands under the jurisdiction of the Department of Natural Resources, and for desirable accessions thereto, such report to include an inventory of the tracts and parcels of land, and rights, interests, and easements therein, held by the state or withdrawn from sale for any of these purposes, with the value thereof, and a list of the name, location, size, and description of each state trail, state scientific and natural area, state wildlife management area, state water-access site, and state wild, scenic, or recreational river designated by the commissioner, and each public hunting grounds, public shooting grounds, food and cover planting area, wildlife lands, and recreational or public hunting area acquired by the commissioner since the last report. The commissioner shall maintain a long range plan governing the use of the public domain under the commissioner's jurisdiction.",
	"repealed": false
}