{
	"id": "70A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/70A.06",
	"title": "70A.06 FILING REQUIREMENTS.",
	"text": "Every licensed insurer and every rate service organization licensed under section 70A.14 shall file with the commissioner all rates and all changes and amendments of rates made by it for use in this state not later than their effective date. No rates contained in a filing shall become effective unless they have been filed with the commissioner. In any filing, the commissioner may require the insurer or rate service organization to file supporting data and explanatory data which shall include:\n(1) the experience and judgment of the filer, and, to the extent it wishes or the commissioner requires, of other insurers or rate service organizations;\n(2) its interpretation of any statistical data relied upon;\n(3) descriptions of the actuarial and statistical methods employed; and\n(4) any other matters deemed relevant by the commissioner or the filer.\nNotwithstanding the foregoing, if the supporting data is not filed within 30 days after so requested by the commissioner, the rate is no longer effective and is presumed to be an excessive rate.\nWhenever an insurer files a change in a rate that will result in a 25 percent or more increase in a 12-month period over existing rates, the commissioner may hold a hearing to determine if the change is excessive. The hearing must be conducted under chapter 14. The commissioner must give notice of intent to hold a hearing within 60 days of the filing of the change. It shall be the responsibility of the insurer to show the rate is not excessive. The rate is effective unless it is determined as a result of the hearing that the rate is excessive.\nNo policy form shall be delivered or issued for delivery unless it has been filed with the commissioner and either (i) the commissioner has approved it or (ii) 60 days have elapsed and the commissioner has not disapproved it as misleading or violative of public policy, which period may be extended by the commissioner for an additional period not to exceed 60 days.\nSubdivisions 1 and 2 shall not apply to policies or rates for inland marine risks which by general custom of the business are not written according to manual rates or rating plans, except that subdivisions 1 and 2 shall apply to policies insuring the personal property purchased under a credit transaction or a credit transaction involving a debtor pledging personal property as collateral. For purposes of this subdivision the personal property insured in credit transactions or credit transactions involving a debtor pledging personal property as collateral shall refer only to such personal property of the debtor used for personal use and not used in any business, trade or profession of the debtor.\n[Repealed, 1986 c 455 s 94]\n[Repealed, 1995 c 24 s 2]",
	"repealed": false
}