{
	"id": "638.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/638.12",
	"title": "638.12 TYPES OF CLEMENCY; ELIGIBILITY AND WAIVER.",
	"text": "(a) The board may:\n(1) pardon a criminal conviction imposed under the laws of this state;\n(2) commute a criminal sentence imposed by a court of this state to time served or a lesser sentence; or\n(3) grant a reprieve of a sentence imposed by a court of this state.\n(b) A pardon, after being granted and filed with the district court of the county in which the conviction and sentence were imposed, will also seal all records wherever held related to the arrest, indictment or information, trial, verdict, and pardon.\n(c) A grant of clemency must be in writing and has no force or effect if the governor or a board majority duly convened opposes the clemency. Every conditional grant of clemency must state the terms and conditions upon which it was granted, and every commutation must specify the terms of the commuted sentence.\n(d) A granted pardon sets aside the conviction and purges the conviction from an individual's criminal record. The individual is not required to disclose the conviction at any time or place other than:\n(1) in a judicial proceeding; or\n(2) during the licensing process for peace officers.\n(a) Except as provided in paragraphs (b) and (c), an individual convicted of a crime in a court of this state may apply for a pardon of the individual's conviction on or after five years from the sentence's expiration or discharge date.\n(b) An individual convicted before August 1, 2023, of a violation of section 609.19, subdivision 1, clause (1), under the theory of liability for crimes of another may apply for a pardon upon the sentence's expiration or discharge date if the individual:\n(1) was charged with a violation of section 609.185, paragraph (a), clause (3), and:\n(i) thereafter pled guilty to a violation of section 609.19, subdivision 1, clause (1);\n(ii) did not cause the death of a human being; and\n(iii) did not intentionally aid, advise, hire, counsel, or conspire with or otherwise procure another with the intent to cause the death of a human being; or\n(2) was charged with a violation of section 609.19, subdivision 2, and:\n(i) thereafter pled guilty to a violation of section 609.19, subdivision 1, clause (1);\n(ii) did not cause the death of a human being; and\n(iii) was not a major participant, as defined in section 609.05, subdivision 2a, paragraph (c), in the underlying felony or did not act with extreme indifference to human life.\n(c) An individual may request the board to waive the waiting period if there is a showing of unusual circumstances and special need.\n(d) The commission must review a waiver request and recommend to the board whether to grant the request. When considering a waiver request, the commission is exempt from the meeting requirements under section 638.14 and chapter 13D.\n(e) The board must grant a waiver request unless the governor or a board majority opposes the waiver.\n(a) An individual may apply for a commutation of an unexpired criminal sentence imposed by a court of this state, including an individual confined in a correctional facility or on probation, parole, supervised release, or conditional release. An application for commutation may not be filed until the date that the individual has served at least one-half of the sentence imposed or on or after five years from the conviction date, whichever is earlier.\n(b) An individual may request the board to waive the waiting period if there is a showing of unusual circumstances and special need.\n(c) The commission must review a waiver request and recommend to the board whether to grant the request. When considering a waiver request, the commission is exempt from the meeting requirements under section 638.14 and chapter 13D.\n(d) The board must grant a waiver request unless the governor or a board majority opposes the waiver.",
	"repealed": false
}