{
	"id": "325F.992",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.992",
	"title": "325F.992 PROHIBITION OF ASSIGNMENT OF MILITARY PAY OR MILITARY BENEFITS.",
	"text": "(a) For the purposes of this section, the terms in paragraphs (b) and (c) have the meanings given.\n(b) \"Military beneficiary\" means any of the following:\n(1) a current or former member of the armed forces of the United States or a reserve component of the armed forces of the United States, who receives pay or benefits from the United States, or any state, for service in the armed forces of the United States or a reserve component of the armed forces of the United States;\n(2) the spouse of the member as described in clause (1); and\n(3) any individual considered a beneficiary of the military benefits of the member as described in clause (1).\n(c) \"Person\" has the meaning given in section 325F.68.\n(a) A person shall not enter into or attempt to enter into an agreement with a military beneficiary that assigns the military beneficiary's military pay or military benefits in violation of United States Code, title 37, section 701, or United States Code, title 38, section 5301.\n(b) A person shall not enter into or attempt to enter into any agreement, device, scheme, or other artifice with a military beneficiary, including but not limited to a purchase and sale agreement, that assigns or sells all or a portion of the military beneficiary's military pay or military benefits.\n(c) An agreement prohibited by paragraph (a) or (b) is void, and a military beneficiary is not required to disgorge or repay any consideration received under the agreement.\nIn addition to any other remedies available under the law, the military beneficiary injured by a violation of this section may bring a cause of action to recover damages, reasonable attorney fees and costs, and equitable relief related to a violation of subdivision 2. The attorney general may enforce this section pursuant to applicable law.",
	"repealed": false
}