{
	"id": "518A.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.47",
	"title": "518A.47 PROVISION OF LEGAL SERVICES BY THE PUBLIC AUTHORITY.",
	"text": "(a) The provision of services under the child support enforcement program that includes services by an attorney or an attorney's representative employed by, under contract to, or representing the public authority does not create an attorney-client relationship with any party other than the public authority. Attorneys employed by or under contract with the public authority have an affirmative duty to inform applicants and recipients of services under the child support enforcement program that no attorney-client relationship exists between the attorney and the applicant or recipient. This section applies to all legal services provided by the child support enforcement program.\n(b) The written notice must inform the individual applicant or recipient of services that no attorney-client relationship exists between the attorney and the applicant or recipient; the rights of the individual as a subject of data under section 13.04, subdivision 2; and that the individual has a right to have an attorney represent the individual.\n(c) Data disclosed by an applicant for, or recipient of, child support services to an attorney employed by, or under contract with, the public authority is private data on an individual. However, the data may be disclosed under section 13.46, subdivision 2, clauses (1) to (3) and (6) to (19), under subdivision 2, and in order to obtain, modify or enforce child support, medical support, and parentage determinations.\n(d) An attorney employed by, or under contract with, the public authority may disclose additional information received from an applicant for, or recipient of, services for other purposes with the consent of the individual applicant for, or recipient of, child support services.\n(a) If there is an IV-D case as defined in section 518A.26, a party may obtain an ex parte order under this subdivision. The party may obtain an ex parte order requiring the public authority to serve legal documents on the other party by mail if the party submits a sworn affidavit to the court stating that:\n(1) the party needs to serve legal process in a support proceeding and does not have access to the address of the other party;\n(2) the party has made reasonable efforts to locate the other party; and\n(3) the other party is not represented by counsel.\n(b) The public authority shall serve legal documents provided by the moving party at the last known address of the other party upon receipt of a court order under paragraph (a). The public authority shall provide for appropriate service and shall certify to all parties the date of service by mail. The public authority's proof of service must not include the place or address of service.\n(c) The state court administrator shall prepare and make available forms for use in seeking access to an address under this subdivision.",
	"repealed": false
}