{
	"id": "17.116",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.116",
	"title": "17.116 SUSTAINABLE AGRICULTURE DEMONSTRATION GRANTS.",
	"text": "The commissioner shall establish a grant program for sustainable agriculture methods that demonstrates best management practices, including farm input reduction or management, enterprise diversification including new crops and livestock, farm energy efficiency or production, or the transfer of technologies that enhance the environment and farm profitability. The commissioner shall use the program to demonstrate and publicize the energy efficiency, environmental benefit, and profitability of sustainable agriculture techniques or systems from production through marketing. The grants must fund research or demonstrations on farms consistent with the program objectives.\n(a) Grants may be made to farmers and organizations such as farms, agricultural cooperatives, educational institutions, individuals at educational institutions, nonprofit organizations, Tribal governments, or local units of government residing or located in the state for research or demonstrations on farms in the state.\n(b) Grants may only be made for projects that show:\n(1) the ability to maximize direct or indirect energy savings or production;\n(2) a positive effect or reduced adverse effect on the environment; or\n(3) increased profitability for the individual farm by reducing costs or improving marketing opportunities.\n(a) Applications for grants must be made to the commissioner on forms prescribed by the commissioner.\n(b) The applications must be reviewed, ranked, and recommended by a technical review panel appointed by the commissioner. The technical review panel shall consist of a soil scientist, an agronomist, a representative from a postsecondary educational institution, an agricultural marketing specialist, two resident farmers of the state using sustainable agriculture methods, two resident farmers of the state using organic agriculture methods, and a chair from the department.\n(c) The technical review panel shall rank applications according to the following criteria:\n(1) direct or indirect energy savings or production;\n(2) environmental benefit;\n(3) farm profitability;\n(4) the number of farms able to apply the techniques or the technology proposed;\n(5) the effectiveness of the project as a demonstration;\n(6) the immediate transferability of the project to farms; and\n(7) the ability of the project to accomplish its goals.\n(d) The commissioner shall consider the recommendations of the technical review panel and may award grants for eligible projects. Priority must be given to applicants who are farmers or groups of farmers.\n(e) Grants for eligible projects may not exceed $25,000 unless the portion above $25,000 is matched on an equal basis by the applicant's cash contribution or the value of the applicant's in-kind land use, equipment use, or personal labor. Grant recipients who are not required to provide a match and grant recipients whose in-kind contributions exceed the amount needed to meet matching requirements may submit the value of the grant recipients' labor or equipment use as an expense eligible for payment from grant money. Grant funding of projects may not exceed $50,000 under this section, but applicants may utilize other funding sources. A portion of each grant must be targeted for public information activities of the project.\n(f) A project may continue for up to three years. Multiyear projects must be reevaluated by the technical review panel and the commissioner before second or third year funding is approved. A project is limited to one grant for its funding.",
	"repealed": false
}