{
	"id": "327B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/327B.09",
	"title": "327B.09 PROHIBITIONS.",
	"text": "No person shall engage in the business, either exclusively or in addition to any other occupation of manufacturing, selling, offering to sell, soliciting or advertising the sale of manufactured homes, or act as a broker without being licensed as a manufacturer or a dealer as provided in section 327B.04. Any person who manufactures, sells, offers to sell, solicits or advertises the sale of manufactured homes, or acts as a broker in violation of this subdivision shall nevertheless be subject to the duties, prohibitions and penalties imposed by sections 327B.01 to 327B.12. This chapter does not prohibit either an individual from reselling, without a license, a manufactured home which is or has been the individual's residence or any bank, savings bank, savings association, or credit union, chartered by either this state or the federal government, from reselling, without a license, a repossessed manufactured home.\nNo person shall advertise as a manufactured home dealer, or as a lister, broker or agent for the sale of manufactured homes, without being licensed as a dealer as provided in section 327B.04.\nNo person shall act as a dealer or manufacturer unless the certificate authorizing that activity is prominently displayed on the business premises covered by the license. Before moving to a new location from the established place of business occupied when the license is granted, the licensee must first secure the commissioner's written permission. To obtain that permission, the licensee must prove that the proposed new premises conform to the requirements of section 327B.04, subdivision 4.\nNo dealer shall use or offer to use a net listing agreement.\nA dealer who is acting as a broker for the sale of a manufactured home and who can arrange financing for the sale may charge a separate fee for that service, if:\n(a) the listing agreement does not require that the seller or buyer use the dealer's services to arrange financing;\n(b) in arranging the financing, the dealer will pay a fee or will guarantee all or part of the buyer's performance to a third person; and\n(c) the listing agreement clearly and conspicuously discloses the amount of the fee, the fact that the fee is in addition to the dealer's commission and the fact that the seller and buyer are not required to use the dealer's services to arrange financing.\n(a) No manufactured home lender shall:\n(1) charge a fee for a product or service where the product or service is not actually provided, or misrepresent the amount charged by or paid to a third party for a product or service;\n(2) make or cause to be made, directly or indirectly, any false, deceptive, or misleading statement or representation in connection with a manufactured home loan transaction, including, without limitation, a false, deceptive, or misleading statement or representation regarding the borrower's ability to qualify for any manufactured home loan product;\n(3) issue any document indicating conditional qualification or conditional approval for a manufactured home loan, unless the document also clearly indicates that final qualification or approval is not guaranteed, and may be subject to additional review;\n(4) make or assist in making any manufactured home loan without verifying the reasonable ability of the borrower to repay the loan, taking into consideration taxes and insurance in connection with the manufactured home;\n(5) make, provide, or arrange for a manufactured home loan for a higher interest rate or on less favorable terms than the rate or terms for which the borrower qualifies based on criteria typically used by that lender to evaluate rate and term offerings;\n(6) make, provide, or arrange for a manufactured home loan all or a portion of the proceeds of which are used to fully or partially pay off a \"special loan\" unless the borrower has obtained a written certification from an authorized independent loan counselor that the borrower has received counseling on the advisability of the loan transaction. For the purposes of this section, \"special loan\" means a loan for the purchase, refinance, improvement, or repair of the manufactured home originated, subsidized, or guaranteed by or through a state, tribal, or local government, or nonprofit organization, that bears one or more of the following nonstandard payment terms, which substantially benefit the borrower:\n(i) payments vary with income;\n(ii) payments of principal or interest are not required or can be deferred under specified conditions;\n(iii) principal or interest is forgivable under specified conditions; or\n(iv) where no interest or an annual interest rate of two percent or less is charged in connection with the loan. For the purposes of this section, \"authorized independent loan counselor\" means a nonprofit, third-party individual or organization providing home buyer education programs, foreclosure prevention services, loan counseling, or credit counseling certified by the United States Department of Housing and Urban Development, the Minnesota Home Ownership Center, the Minnesota Mortgage Foreclosure Prevention Association, AARP, or NeighborWorks America;\n(7) engage in churning; or\n(8) make, provide, or arrange for a manufactured home loan if the borrower's compliance with any repayment option offered under the terms of the loan will result in negative amortization during any six-month period. This excludes existing loan extensions and modifications.\n(b) This subdivision does not apply to a state or federally chartered bank, savings bank, or credit union, an institution chartered by Congress under the Farm Credit Act, or to a person making, providing, or arranging a manufactured home loan originated or purchased by a state agency or a tribal or local unit of government.",
	"repealed": false
}