{
	"id": "617.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.261",
	"title": "617.261 NONCONSENSUAL DISSEMINATION OF PRIVATE SEXUAL IMAGES.",
	"text": "It is a crime to intentionally disseminate an image of another person who is depicted in a sexual act or whose intimate parts are exposed, in whole or in part, when:\n(1) the person is identifiable:\n(i) from the image itself, by the person depicted in the image or by another person; or\n(ii) from personal information displayed in connection with the image;\n(2) the actor knows or reasonably should know that the person depicted in the image does not consent to the dissemination; and\n(3) the image was obtained or created under circumstances in which the actor knew or reasonably should have known the person depicted had a reasonable expectation of privacy.\n(a) Except as provided in paragraph (b), whoever violates subdivision 1 is guilty of a gross misdemeanor.\n(b) Whoever violates subdivision 1 may be sentenced to imprisonment for not more than three years or to payment of a fine of $5,000, or both, if one of the following factors is present:\n(1) the person depicted in the image suffers financial loss due to the dissemination of the image;\n(2) the actor disseminates the image with intent to profit from the dissemination;\n(3) the actor maintains an Internet website, online service, online application, or mobile application for the purpose of disseminating the image;\n(4) the actor posts the image on a website;\n(5) the actor disseminates the image with intent to harass the person depicted in the image;\n(6) the actor obtained the image by committing a violation of section 609.52, 609.746, 609.89, or 609.891; or\n(7) the actor has previously been convicted under this chapter.\nIt is not a defense to a prosecution under this section that the person consented to the capture or possession of the image.\nNotwithstanding anything to the contrary in section 627.01, an offense committed under this section may be prosecuted in:\n(1) the county where the offense occurred;\n(2) the county of residence of the actor or victim or in the jurisdiction of the victim's designated address if the victim participates in the address confidentiality program established by chapter 5B; or\n(3) only if venue cannot be located in the counties specified under clause (1) or (2), the county where any image is produced, reproduced, found, stored, received, or possessed in violation of this section.\nSubdivision 1 does not apply when:\n(1) the dissemination is made for the purpose of a criminal investigation or prosecution that is otherwise lawful;\n(2) the dissemination is for the purpose of, or in connection with, the reporting of unlawful conduct;\n(3) the dissemination is made in the course of seeking or receiving medical or mental health treatment and the image is protected from further dissemination;\n(4) the image involves exposure in public or was obtained in a commercial setting for the purpose of the legal sale of goods or services, including the creation of artistic products for sale or display;\n(5) the image relates to a matter of public interest and dissemination serves a lawful public purpose;\n(6) the dissemination is for legitimate scientific research or educational purposes; or\n(7) the dissemination is made for legal proceedings and is consistent with common practice in civil proceedings necessary for the proper functioning of the criminal justice system, or protected by court order which prohibits any further dissemination.\nNothing in this section shall be construed to impose liability upon the following entities solely as a result of content or information provided by another person:\n(1) an interactive computer service as defined in United States Code, title 47, section 230, paragraph (f), clause (2);\n(2) a provider of public mobile services or private radio services; or\n(3) a telecommunications network or broadband provider.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Dissemination\" means distribution to one or more persons, other than the person depicted in the image, or publication by any publicly available medium.\n(c) \"Harass\" means an act that would cause a substantial adverse effect on the safety, security, or privacy of a reasonable person.\n(d) \"Image\" means a photograph, film, video recording, or digital photograph or recording.\n(e) \"Intimate parts\" means the genitals, pubic area, or anus of an individual, or if the individual is female, a partially or fully exposed nipple.\n(f) \"Personal information\" means any identifier that permits communication or in-person contact with a person, including:\n(1) a person's first and last name, first initial and last name, first name and last initial, or nickname;\n(2) a person's home, school, or work address;\n(3) a person's telephone number, email address, or social media account information; or\n(4) a person's geolocation data.\n(g) \"Sexual act\" means either sexual contact or sexual penetration.\n(h) \"Sexual contact\" means the intentional touching of intimate parts or intentional touching with seminal fluid or sperm onto another person's body.\n(i) \"Sexual penetration\" means any of the following acts:\n(1) sexual intercourse, cunnilingus, fellatio, or anal intercourse; or\n(2) any intrusion, however slight, into the genital or anal openings of an individual by another's body part or an object used by another for this purpose.\n(j) \"Social media\" means any electronic medium, including an interactive computer service, telephone network, or data network, that allows users to create, share, and view user-generated content.\nNothing in this section shall limit the power of the state to prosecute or punish a person for conduct that constitutes any other crime under any other law of this state.",
	"repealed": false
}