{
	"id": "124E.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.13",
	"title": "124E.13 FACILITIES.",
	"text": "A charter school may lease space from: an independent or special school board; other public organization; private, nonprofit, nonsectarian organization; private property owner; or a sectarian organization if the leased space is constructed as a school facility. In all cases, the eligible lessor must also be the building owner. The commissioner must review and approve or disapprove lease aid applications in a timely manner to determine eligibility for lease aid under section 124E.22.\n(a) A charter school must not enter into a lease of real property with a related party unless the lessor is a nonprofit corporation under chapter 317A or a cooperative under chapter 308A, and the lease cost is reasonable under section 124E.22, paragraph (a), clause (1).\n(b) A related party permitted to enter into a lease under paragraph (a) must include the following statement in the lease: \"This lease is subject to Minnesota Statutes, section 124E.13, subdivision 2.\"\n(c) If a charter school leases space from a related party and the charter school subsequently closes, the commissioner has the right to recover from the related party any lease payments in excess of those that are reasonable under section 124E.22, paragraph (a), clause (1).\n(a) An affiliated nonprofit building corporation may purchase, expand, or renovate an existing facility to serve as a school or may construct a new school facility. One charter school may organize an affiliated nonprofit building corporation that serves only that charter school if the charter school:\n(1) has operated for at least six consecutive years;\n(2) as of June 30, has a net positive unreserved general fund balance in the preceding three fiscal years;\n(3) has long-range strategic and financial plans that include enrollment projections for at least five years;\n(4) completes a feasibility study of facility options that outlines the benefits and costs of each option; and\n(5) has a plan that describes project parameters and budget.\n(b) An affiliated nonprofit building corporation under this subdivision must:\n(1) be incorporated under chapter 317A;\n(2) comply with applicable Internal Revenue Service regulations, including regulations for \"supporting organizations\" as defined by the Internal Revenue Service;\n(3) post on the school website the name, mailing address, bylaws, minutes of board meetings, and names of the current board of directors of the affiliated nonprofit building corporation;\n(4) submit to the commissioner a copy of its annual audit by December 31 of each year; and\n(5) comply with government data practices law under chapter 13.\n(c) An affiliated nonprofit building corporation must not serve as the leasing agent for property or facilities it does not own. A charter school that leases a facility from an affiliated nonprofit building corporation that does not own the leased facility is ineligible to receive charter school lease aid. The state is immune from liability resulting from a contract between a charter school and an affiliated nonprofit building corporation.\n(d) The board of directors of the charter school must ensure the affiliated nonprofit building corporation complies with all applicable legal requirements. The charter school's authorizer must oversee the efforts of the board of directors of the charter school to ensure legal compliance of the affiliated building corporation. A school's board of directors that fails to ensure the affiliated nonprofit building corporation's compliance violates its responsibilities and an authorizer must consider that failure when evaluating the charter school.\nIf the amount of a purchase agreement or construction contract exceeds the review and comment threshold, a charter school or its affiliated nonprofit building corporation must receive a positive review and comment from the commissioner before initiating any purchase agreement or construction contract. Without a positive review and comment from the commissioner, a purchase agreement or construction contract under this subdivision is null and void. For purposes of this subdivision, \"review and comment threshold\" means the dollar amount specified in section 123B.71, subdivision 8, applicable to a school entity that is not a recipient of a maximum effort capital loan.",
	"repealed": false
}