{
	"id": "16C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.08",
	"title": "16C.08 PROFESSIONAL OR TECHNICAL SERVICES.",
	"text": "For the purposes of this section, \"professional or technical services\" means services that are intellectual in character, including consultation, analysis, evaluation, prediction, planning, programming, or recommendation, and result in the production of a report or the completion of a task. Professional or technical contracts do not include the provision of supplies or materials except by the approval of the commissioner or except as incidental to the provision of professional or technical services.\nNotwithstanding section 15.061 or any other law, the commissioner shall, to the fullest extent practicable, conduct enterprise procurements that result in the establishment of professional or technical contracts for use by multiple state agencies. The commissioner is authorized to mandate use of any contract entered into as a result of an enterprise procurement process. Agencies shall fully cooperate in the development and use of contracts entered into under this section.\nThe following applies to all contracts for professional or technical services:\n(1) no contract shall be entered into if a current state agency employee is able and available to perform the services called for by the contract;\n(2) unless otherwise authorized by law, a competitive proposal process shall be used to acquire professional or technical services. A competitive bidding process shall not be utilized to acquire professional or technical services;\n(3) agencies shall assign specific agency personnel to manage each contract;\n(4) agencies shall not allow a contractor to begin work before the contract is fully executed unless an exception under section 16C.05, subdivision 2a, has been granted by the commissioner and funds are fully encumbered;\n(5) a contract shall not establish an employment relationship between the state or the agency and any persons performing under the contract;\n(6) in the event the results of the contract work will be carried out or continued by state employees upon completion of the contract, the contractor is required to include state employees in development and training, to the extent necessary to ensure that after completion of the contract, state employees can perform any ongoing work related to the same function;\n(7) agencies shall not contract out their previously eliminated jobs for four years without first considering the same former employees who are on the seniority unit layoff list who meet the minimum qualifications determined by the agency;\n(8) the contractor and agents must not be employees of the state;\n(9) a professional or technical services contract must by its terms permit the commissioner to unilaterally terminate the contract prior to completion, upon payment of just compensation, if the commissioner determines that further performance under the contract would not serve agency purposes; and\n(10) the terms of a contract must provide that no more than 90 percent of the amount due under the contract may be paid until the final product has been reviewed by the head of the agency entering into the contract and the head of the agency has certified that the contractor has satisfactorily fulfilled the terms of the contract, unless specifically excluded or modified in writing by the commissioner. This clause does not apply to contracts for professional services as defined in sections 326.02 to 326.15.\nBefore issuing notice of a proposed contract for professional or technical services in excess of $25,000, the agency must provide the solicitation document along with the following for review and approval by the commissioner:\n(1) a certification that all provisions of subdivision 2 and section 16C.16 have been verified or complied with;\n(2) a description demonstrating that the work to be performed under the contract is necessary to the agency's achievement of its statutory responsibilities and there is statutory authority to enter into the contract;\n(3) a description of the agency's plan to notify firms or individuals who may be available to perform the services called for in the solicitation;\n(4) a description of the performance measures or other tools that will be used to monitor and evaluate contractor performance; and\n(5) a description of the procurement method to be utilized to address accessibility standards for technology services.\nThe commissioner is required to review and approve all agency requests to enter into contracts based on single source authority specified in section 16C.10, subdivision 1. Agencies shall submit a written request to the commissioner describing the search conducted and reasons supporting the request for single source authority along with the information specified in subdivision 3, clauses (1), (2), and (4).\n(a) The commissioner shall submit to the governor, the chairs and ranking minority members of the house of representatives Ways and Means and senate Finance Committees, and the Legislative Reference Library a yearly listing of all contracts for professional or technical services executed. The report must identify the contractor, contract amount, duration, and services to be provided. The commissioner shall also issue yearly reports summarizing the contract review activities of the department by fiscal year.\n(b) The fiscal year report must be submitted by September 1 of each year and must:\n(1) be sorted by agency and by contractor;\n(2) show the aggregate value of contracts issued by each agency and issued to each contractor;\n(3) distinguish between contracts that are being issued for the first time and contracts that are being extended;\n(4) state the termination date of each contract;\n(5) identify services by commodity code, including topics such as contracts for training, contracts for research and opinions, and contracts for computer systems; and\n(6) identify which contracts were awarded without following the solicitation process in this chapter because it was determined that there was only a single source for the services.\n(c) Within 30 days of final completion of a contract over $25,000 covered by this subdivision, the head of the agency entering into the contract must submit a report to the commissioner who must make the report publicly available online and submit a copy to the Legislative Reference Library. The report must:\n(1) summarize the purpose of the contract, including why it was necessary to enter into a contract;\n(2) state the amount spent on the contract;\n(3) if the contract was awarded without following the solicitation process in this chapter because it was determined that there was only a single source for the services, explain why the agency determined there was only a single source for the services; and\n(4) include a written performance evaluation of the work done under the contract. The evaluation must include an appraisal of the contractor's timeliness, quality, cost, and overall performance in meeting the terms and objectives of the contract. Contractors may request copies of evaluations prepared under this subdivision and may respond in writing. Contractor responses must be maintained with the contract file.\n[Repealed, 2007 c 148 art 2 s 84]\nNo action may be maintained by a contractor against an employee or agency who discloses information about a current or former contractor under subdivision 4, unless the contractor demonstrates by clear and convincing evidence that:\n(1) the information was false and defamatory;\n(2) the employee or agency knew or should have known the information was false and acted with malicious intent to injure the current or former contractor; and\n(3) the information was acted upon in a manner that caused harm to the current or former contractor.\n[Repealed by amendment, 2014 c 196 art 2 s 7]\nIf the final product of the contract is a written report, a copy must be filed with the Legislative Reference Library.\nThis section does not apply to contracts with individuals or organizations for administration of employee pension plans authorized under chapter 354B or 354C.",
	"repealed": false
}