{
	"id": "116J.980",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.980",
	"title": "116J.980 COMMUNITY DEVELOPMENT.",
	"text": "The Department of Employment and Economic Development shall:\n(1) be responsible for administering all state community development and assistance programs, including the economic recovery account, the rural development programs, the Minnesota Public Facilities Authority loan and grant programs, and the enterprise zone program;\n(2) be responsible for state administration of federally funded community development and assistance programs, including the small cities development grant program, the Minnesota cleanup revolving loan fund program created under the Brownfields Revitalization and Environmental Restoration Act of 2001, Public Law 107-118, title II, under the authority of the United States Environmental Protection Agency, and land and water conservation programs;\n(3) provide technical assistance to rural communities for community development in cooperation with regional development commissions;\n(4) coordinate the development and review of state rural development policies; and\n(5) be responsible for coordinating community assistance and development programs in cooperation with regional development commissions.\nThe department may combine all related state and federal complement positions into general fund positions, to carry out the responsibilities under subdivision 1. The number of general fund positions must not exceed the aggregate number of all state and federal positions that are to be combined. Records of the actual number of employee hours charged to each state and federal account must be maintained for each general fund position.\nThe commissioner must coordinate with the commissioner of the Minnesota Housing Finance Agency to ensure that housing related grant applications for the Small Cities Community Development Block Grant Program under section 116J.401 are consistent with the agency's most recent housing affordability plan and do not duplicate existing state housing programs.\n[Repealed, 2001 c 200 s 4]",
	"repealed": false
}