{
	"id": "60M.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/60M.02",
	"title": "60M.02 PREMIUMS.",
	"text": "(a) Regardless of whether a producer is an employee or an independent contractor, a producer must charge the approved, filed rate of the surety being used to post a bail bond. Except as provided in subdivision 2 or in a situation where cash bail is set by the court under subdivision 5, the rate charged must not be less than the surety's filed rate.\n(b) A producer is prohibited from providing a premium rebate.\n(c) A producer may charge travel or other related fees, provided the producer complies with section 60K.46, subdivision 2.\nA producer must charge a minimum premium of $100. Any premium amount must be included in the surety's rate filing with the commissioner.\n(a) A producer is prohibited from posting a bail bond with a penal sum of $10,000 or less unless the producer has:\n(1) received at least 50 percent of the total premium owed under the surety's rate filing;\n(2) provided the depositor with a receipt that indicates the premium paid; and\n(3) if the full premium is not collected before posting the bond, a signed promissory note must be obtained requiring the unpaid premium in full within four months of the date the bond is posted.\n(b) A promissory note issued under paragraph (a), clause (3), must be made on a surety or bail bond agency form as approved by the commissioner. The maximum annual interest rate allowed on a promissory note under this subdivision is six percent. A promissory note may authorize collection of the actual costs incurred to collect the premium, including reasonable attorney fees, in the event of a default.\n(a) A producer is prohibited from posting a bail bond with a penal sum greater than $10,000 unless the producer has:\n(1) received at least 30 percent of the total premium owed under the surety's rate filing;\n(2) provided the depositor with a receipt that indicates the premium paid; and\n(3) if the full premium is not collected before posting the bond, a signed promissory note must be obtained requiring the unpaid premium in full within 12 months of the date the bond is posted.\n(b) A promissory note issued under paragraph (a), clause (3), must be made on a surety or bail bond agency form as approved by the commissioner. The maximum annual interest rate allowed on a promissory note under this subdivision is six percent. A promissory note may authorize collection of the actual costs incurred to collect the premium, including reasonable attorney fees, in the event of a default.\n(a) A bail bond agency or producer may include an alternative premium structure as part of the bail bond agency or producer's surety rate filing submitted to the commissioner.\n(b) If a court sets cash bail at 15 percent or less of the bond's penal amount, a surety, bail bond agency, or producer may charge an alternative premium that is as low as one-half of the cash bail amount set by the court. An alternative premium charged under this subdivision is subject to the minimum premium requirement under subdivision 2.\n(c) A bail bond agency or producer is required to obtain from the court documentation indicating the cash bail amount set by the court and must maintain the documentation in the bond file.\n(d) A bail bond agency and producer must maintain a log of all bonds where an alternative premium was charged under this subdivision.\n(e) Subdivisions 3 and 4 apply to the payment of an alternative premium structure under this subdivision.\nIf a payment, including a minimum monthly payment, that is required under a promissory note executed pursuant to subdivision 3 or 4 is more than 90 days late, the bail bond agency or producer must, within 20 days of the date a payment becomes 90 days late:\n(1) for amounts owed that are $2,500 or less, assign the debt to a Minnesota-licensed debt collector; or\n(2) for amounts owed that are greater than $2,500:\n(i) file a civil action against the delinquent premium payer; and\n(ii) make all reasonable efforts to:\n(A) serve a summons and complaint;\n(B) enter judgment, unless the matter is settled while the action is pending; and\n(C) enforce the judgment, which may be satisfied by assigning the debt to a licensed debt collector.\nA surety, bail bond agency, or producer may only accept cash, money orders, checks, wire transfers, electronic funds transfers, debit cards, prepaid cash cards, or credit cards as a premium payment method. Any balance owed must be evidenced by a promissory note, as provided under subdivision 3 or 4.\n(a) A payment made to or received by the producer, bail bond agency, or surety must be deposited into a premium trust account that is maintained by the producer, bail bond agency, or surety within seven business days.\n(b) A premium trust account must be used only for premium payments and travel or other related fees authorized under subdivision 1, paragraph (c). A producer, bail bond agency, or surety is prohibited from depositing any other money into a premium trust account.\n(c) A deposit into a premium trust account must be accompanied by a deposit slip that:\n(1) separately designates the principal; and\n(2) lists the power of attorney number of the bond for which the payment is being collected.\n(d) Money may be withdrawn from a premium trust account only to:\n(1) pay the net premium to the surety or bail bond agency;\n(2) pay a surety or bail bond agency any build-up fund or escrow account required by a contract executed by the producer and the surety or bail bond agency;\n(3) pay or reimburse travel or other related fees authorized under subdivision 1, paragraph (c);\n(4) pay or reimburse the producer any fees or charges deducted electronically by credit card processing vendors, provided the fees and charges comply with section 60K.46, subdivision 2; and\n(5) distribute any excess amounts to the operating account.",
	"repealed": false
}