{
	"id": "125A.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.56",
	"title": "125A.56 ALTERNATE INSTRUCTION REQUIRED BEFORE ASSESSMENT REFERRAL.",
	"text": "(a) Before a pupil in kindergarten through grade 12 is referred for a special education evaluation, the district must conduct and document at least two instructional strategies, alternatives, or interventions using a system of scientific, research-based instruction and intervention in academics or behavior, based on the pupil's needs, while the pupil is in the regular classroom. The pupil's teacher must document the results. A special education evaluation team may waive this requirement when it determines the pupil's need for the evaluation is urgent. This section may not be used to deny a pupil's right to a special education evaluation.\n(b) A school district shall use alternative intervention services, including the assurance of mastery program under section 124D.66, or an early intervening services program under subdivision 2 to serve at-risk pupils who demonstrate a need for alternative instructional strategies or interventions.\n(c) A student identified as being unable to read at grade level under section 120B.12, subdivision 2, paragraph (a), must be provided with alternate instruction under this subdivision that is multisensory, systematic, sequential, cumulative, and explicit.\n(a) A district may meet the requirement under subdivision 1 by establishing an early intervening services program that includes:\n(1) a system of valid and reliable general outcome measures aligned to state academic standards that is administered at least three times per year to pupils in kindergarten through grade 8 who need additional academic or behavioral support to succeed in the general education environment. The school must provide interim assessments that measure pupils' performance three times per year and implement progress monitoring appropriate to the pupil. For purposes of this section, \"progress monitoring\" means the frequent and continuous measurement of a pupil's performance that includes these three interim assessments and other pupil assessments during the school year. A school, at its discretion, may allow pupils in grades 9 through 12 to participate in interim assessments;\n(2) a system of scientific, research-based instruction and intervention; and\n(3) an organizational plan that allows teachers, paraprofessionals, and volunteers funded through various sources to work as a grade-level team or use another configuration across grades and settings to deliver instruction. The team must be trained in scientific, research-based instruction and intervention. Teachers and paraprofessionals at a site operating under this paragraph must work collaboratively with those pupils who need additional academic or behavioral support to succeed in a general education environment.\n(b) As an intervention under paragraph (a), clause (2), staff generating special education aid under section 125A.76 may provide small group instruction to pupils who need additional academic or behavioral support to succeed in the general education environment. Small group instruction that includes pupils with a disability may be provided in the general education environment if the needs of the pupils with a disability are met, consistent with their individualized education programs, and all pupils in the group receive the same level of instruction and make the same progress in the instruction or intervention. Teachers and paraprofessionals must ensure that the needs of pupils with a disability participating in small group instruction under this paragraph remain the focus of the instruction. Expenditures attributable to the time special education staff spends providing instruction to nondisabled pupils in this circumstance is eligible for special education aid under section 125A.76 as an incidental benefit if:\n(1) the group consists primarily of disabled pupils;\n(2) no special education staff are added to meet nondisabled pupils' needs; and\n(3) the primary purpose of the instruction is to implement the individualized education programs of pupils with a disability in this group.\nExpenditures attributable to the time special education staff spends providing small group instruction to nondisabled pupils that affords more than an incidental benefit to such pupils is not eligible for special education aid under section 125A.76, except that such expenditures may be included in the alternative delivery initial aid adjustment under section 125A.78 if the district has an approved program under section 125A.50. During each 60-day period that a nondisabled pupil participates in small group instruction under this paragraph, the pupil's progress monitoring data must be examined to determine whether the pupil is making progress and, if the pupil is not making progress, the pupil's intervention strategies must be changed or the pupil must be referred for a special education evaluation.",
	"repealed": false
}