{
	"id": "103E.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.015",
	"title": "103E.015 CONSIDERATIONS BEFORE DRAINAGE WORK IS DONE.",
	"text": "Before establishing a drainage project, the drainage authority must consider each of the following criteria:\n(1) private and public benefits and costs of the proposed drainage project;\n(2) alternative measures, including measures identified in applicable state-approved and locally adopted water management plans, to:\n(i) conserve, allocate, and use drainage waters for agriculture, stream flow augmentation, or other beneficial uses;\n(ii) reduce downstream peak flows and flooding;\n(iii) provide adequate drainage system capacity;\n(iv) reduce erosion and sedimentation; and\n(v) protect or improve water quality;\n(3) the present and anticipated land use within the drainage project or system, including compatibility of the project with local land use plans;\n(4) current and potential flooding characteristics of property in the drainage project or system and downstream for 5-, 10-, 25-, and 50-year flood events, including adequacy of the outlet for the drainage project;\n(5) the effects of the proposed drainage project on wetlands;\n(6) the effects of the proposed drainage project on water quality;\n(7) the effects of the proposed drainage project on fish and wildlife resources;\n(8) the effects of the proposed drainage project on shallow groundwater availability, distribution, and use; and\n(9) the overall environmental impact of all the above criteria.\nWhen planning a drainage project or a repair under section 103E.715, and prior to making an order on the engineer's preliminary survey report for a drainage project or the engineer's report for a repair, the drainage authority shall investigate the potential use of external sources of funding to facilitate the purposes indicated in section 103E.011, subdivision 5, and alternative measures in subdivision 1, clause (2). This investigation shall include early coordination with applicable soil and water conservation district and county and watershed district water planning authorities about potential external sources of funding and technical assistance for these purposes and alternative measures. The drainage authority may request additional information about potential funding or technical assistance for these purposes and alternative measures from the executive director of the Board of Water and Soil Resources.\nIn any proceeding to establish a drainage project, or in the construction or repair of or other work affecting a public drainage system under any law, the drainage authority or other authority having jurisdiction over the proceeding must give proper consideration to conservation of soil, water, wetlands, forests, wild animals, and related natural resources, and to other public interests affected, together with other material matters as provided by law in determining whether the project will be of public utility, benefit, or welfare.",
	"repealed": false
}