{
	"id": "103D.341",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.341",
	"title": "103D.341 RULES.",
	"text": "The managers must adopt rules to implement the regulatory powers of the managers.\n(a) Rules of the watershed district must be adopted or amended by a majority vote of the managers, after public notice and hearing. Rules must be signed by the secretary of the board of managers and recorded in the board of managers' official minute book.\n(b) Prior to adoption, the proposed rule or amendment to the rule must be submitted to the board for review and comment. The board's review shall be considered advisory. The board shall have 45 days from receipt of the proposed rule or amendment to the rule to provide its comments in writing to the watershed district. Proposed rules or amendments to the rule shall also be noticed for review and comment to all public transportation authorities that have jurisdiction within the watershed district at least 45 days prior to adoption. The public transportation authorities have 45 days from receipt of the proposed rule or amendment to the rule to provide comments in writing to the watershed district.\n(c) For each county affected by the watershed district, the managers must publish a notice of hearings and adopted rules in one or more legal newspapers published in the county and generally circulated in the watershed district. The managers must also provide written notice of adopted or amended rules to public transportation authorities that have jurisdiction within the watershed district. The managers must file adopted rules with the county recorder of each county affected by the watershed district and the board.\n(d) The managers must mail a copy of the rules to the governing body of each municipality affected by the watershed district.\nA rule or resolution that affects land or water within the boundaries of a city is not effective within the city's boundaries until the governing body of the city is notified.",
	"repealed": false
}