{
	"id": "490.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/490.121",
	"title": "490.121 DEFINITIONS.",
	"text": "For purposes of this chapter, unless the context clearly indicates otherwise, each of the terms defined in this section has the meaning given it.\n[Repealed, 2006 c 271 art 11 s 49]\n(a) \"Actuarial equivalent\" means the condition of one annuity or benefit having an equal actuarial present value as another annuity or benefit, determined as of a given date with each actuarial present value based on the appropriate mortality table adopted by the board of directors of the Minnesota State Retirement System based on the experience of the fund as recommended by the actuary retained under section 356.214 and approved under section 356.215, subdivision 18, and using the applicable investment return assumption specified in section 356.215, subdivision 8.\n(b) For purposes of computing a joint and survivor annuity, the investment return assumption specified in section 356.461 must be used, rather than the investment return specified in section 356.215, subdivision 8.\n[Repealed, 2006 c 271 art 11 s 49]\n(a) \"Allowable service\" means any calendar month, subject to the service credit limit in subdivision 22, served as a judge at any time, during which the judge received compensation for that service from the state, municipality, or county, whichever applies, and for which the judge made any required member contribution. It also includes any month served as a referee in probate for all referees in probate who were in office before January 1, 1974.\n(b) \"Allowable service\" also means a period of authorized leave of absence for which the judge has made a payment in lieu of contributions, not in an amount in excess of the service credit limit under subdivision 22. To obtain the service credit, the judge shall pay an amount equal to the normal cost of the judges retirement plan on the date of return from the leave of absence, as determined in the most recent actuarial report for the plan filed with the Legislative Commission on Pensions and Retirement, multiplied by the judge's average monthly salary rate during the authorized leave of absence and multiplied by the number of months of the authorized leave of absence, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, compounded annually, from the date of the termination of the leave to the date on which payment is made. The payment must be made within one year of the date on which the authorized leave of absence terminated. Service credit for an authorized leave of absence is in addition to a uniformed service leave under section 490.1211.\n(c) \"Allowable service\" does not mean service as a retired judge.\n[Repealed, 2006 c 271 art 11 s 49]\n\"Annuity\" means the payments that are made each year to an annuitant from the judges' retirement fund under this chapter.\n\"Annuitant\" means a former judge, a surviving spouse, or a dependent child who is entitled to and is receiving an annuity under this chapter.\n\"Approved actuary\" means an actuary as defined in section 356.215, subdivision 1, paragraph (c).\n\"Court\" means any court of this state that is established by the Minnesota Constitution.\n\"Dependent surviving child\" means an individual who is an unmarried natural or adopted child of a deceased judge, has not reached the age of 18 years or, having reached the age of 18, is under age 22 and is a full-time student throughout the normal school year, and was actually dependent for more than one-half of the child's support upon the judge for a period of at least 90 days immediately before the judge's death. It also means any natural child of the judge who was born after the death of the judge unless a parent-child relationship does not exist under section 524.2-120, subdivision 10.\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n\"Disability\" means the permanent inability of a judge to continue to perform the functions of judge by reason of a physical or mental impairment resulting from a sickness or an injury.\n\"Disability retirement date\" means the last day of the first month after the date on which the governor determines, upon receipt of the voluntary application by the judge or otherwise, that a judge suffers from a disability.\n\"Disability retirement annuity\" means an annuity to which a judge is entitled under section 490.124, subdivisions 1 and 4, after the retirement of the judge because of a disability.\n\"Early retirement date\" means any date after a judge attains the age of 60 but before the judge reaches the normal retirement date.\n\"Early retirement annuity\" means an annuity to which a judge is entitled under section 490.124, subdivisions 1 and 3, upon retirement by the judge at an early retirement date.\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 2006 c 271 art 11 s 49]\n\"Final average compensation\" means the total amount of salary payable to a judge in the highest five years out of the last ten years before the termination of judicial service, divided by five if the number of years of service by the judge equals or exceeds ten. If the number of years of service by the judge is less than ten, but more than five, the highest five years of salary must be counted. If the number of years of service by the judge is less than five, the aggregate salary for the period of service must be divided by the number of months in the period and multiplied by 12.\n\"Final average compensation\" is subject to the limitations of section 356.611.\n\"Judge\" means a judge or a justice of any court as defined under subdivision 7b.\n\"Judges' retirement fund,\" \"retirement fund,\" or \"fund\" means the fund created by section 490.123.\n\"Mandatory retirement date\" means the last day of the month in which a judge has attained 70 years of age.\nExcept as otherwise provided in this chapter, \"normal retirement annuity\" means an annuity to which a judge is entitled under section 490.124, subdivision 1, upon retirement on or after the normal retirement date of the judge.\n(a) For a judge in the tier I program, \"normal retirement date\" means the date the judge attains age 65.\n(b) For a judge in the tier II program, normal retirement date means the date the judge attains age 66.\n\"Service credit limit\" means, for a judge covered by tier I, the greater of: (1) 24 years of allowable service under this chapter; or (2) for a judge with allowable service rendered before July 1, 1980, the number of years of allowable service under chapter 490, which, when multiplied by the percentage 2.7 or 3.2, whichever is applicable to each year of service, equals 76.8. For a judge covered by tier II, there is no service credit limit.\n\"Surviving spouse\" means the surviving legally married spouse of a deceased judge.\n\"Survivor's annuity\" means an annuity to which a surviving spouse or dependent child is entitled under section 490.124, subdivision 9.\n\"Tier I\" is the benefit program of the retirement plan with a membership specified by section 490.1221, paragraph (b), and governed by sections 356.415, subdivision 1f; and 490.121 to 490.133, except as modified in sections 490.121, subdivision 21f, paragraph (b); 490.1222; 490.123, subdivision 1a, paragraph (b); and 490.124, subdivision 1, paragraphs (c) and (d).\n\"Tier II\" is the benefit program of the retirement plan with a membership specified by section 490.1221, paragraph (c), and governed by sections 356.415, subdivision 1f; 490.121 to 490.133, as modified in section 490.121, subdivision 21f, paragraph (b); 490.1222; 490.123, subdivision 1a, paragraph (b); and 490.124, subdivision 1, paragraphs (c) and (d).",
	"repealed": false
}