{
	"id": "473.867",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.867",
	"title": "473.867 PLANNING ASSISTANCE; GRANTS; LOANS.",
	"text": "The council shall prepare and provide advisory materials, model plan provisions and official controls, and on the request of a local governmental unit may provide assistance, to accomplish the purposes of sections 462.355, 473.175, and 473.851 to 473.871. The council may also provide specific technical and legal assistance in connection with the preparation, adoption and defense of plans, programs, and controls.\nThe council may establish a planning assistance fund as a separate bookkeeping account in its general fund for the purpose of making grants and loans to local governmental units under this section. The council shall adopt uniform procedures for the award, disbursement and repayment of grants and loans.\nLocal governmental units may apply, contract for and receive loans and grants as provided herein, and the provisions of chapter 475 shall not apply to loans made pursuant hereto. Applications for grants and loans shall be submitted to the council describing the activities for which the grant or loan funds will be used; the persons which the grantee or borrower plans to use in performing the grant contract; services and activities which will be paid for by funds of the grantee or borrower; the grantee or borrower's need and ability to pay for the contract services; and other information as the council may reasonably request. Grants and loans shall be made subject to contracts between the council and the recipient specifying the use and disbursement of the funds and, for loans, the terms and conditions of repayment, and other appropriate matters. In making grants and loans, the council shall base its decisions on the recipient's demonstrated need and available financial resources.\nMS 1998 [Repealed, 2000 c 493 s 25]\nLoans made by the council shall be payable on such terms and conditions as the council determines appropriate, provided that no loan shall carry an interest rate nor be for a term in excess of five years. Funds received in payment of loans shall be credited to the planning assistance fund and shall be used for additional loans or grants under this section.\nThe council shall give priority for the use of loan and grant funds available under this section to local governmental units for review and amendment of local comprehensive plans and fiscal devices and official controls, as required by section 473.864, subdivision 2. The council shall consult with affected local government units to evaluate the need for technical and financial assistance.",
	"repealed": false
}