{
	"id": "260.773",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.773",
	"title": "260.773 PLACEMENT OF INDIAN CHILDREN.",
	"text": "In all proceedings where custody of the Indian child may be removed from the Indian child's parent or Indian custodian, the Indian child shall be placed in the least restrictive setting which most approximates a family and in which the Indian child's special needs, if any, may be met. The Indian child shall also be placed within reasonable proximity to the Indian child's home, taking into account any special needs of the Indian child.\nIn the case of a placement under subdivision 3 or 4, if the Indian child's Tribe has established a different order of placement preference by resolution, the child-placing agency or petitioner and the court shall recognize the Indian child's Tribe's order of placement in the form provided by the Tribe.\nPreference shall be given, in the absence of good cause to the contrary, to a placement with:\n(1) a noncustodial parent or Indian custodian;\n(2) a member of the Indian child's extended family;\n(3) a foster home licensed, approved, or specified by the Indian child's Tribe;\n(4) an Indian foster home licensed or approved by an authorized non-Indian licensing authority; or\n(5) an institution for children approved by an Indian Tribe or operated by an Indian organization which has a program suitable to meet the Indian child's needs.\nIn any adoptive placement, transfer of custody placement, or other permanency placement of an Indian child, a preference shall be given, in the absence of good cause to the contrary, to a placement with:\n(1) the Indian child's noncustodial parent or Indian custodian;\n(2) a member of the Indian child's extended family;\n(3) other members of the Indian child's Tribe; or\n(4) other persons or entities recognized as appropriate to be a permanency resource for the Indian child, by the Indian child's parent or parents, Indian custodian, or Indian Tribe.\nThe child-placing agency and petitioner shall defer to the judgment of the Indian child's Tribe as to the suitability of a placement.\nThe court shall consider the preference of the Indian child or parent.\nThe standards to be applied in meeting the preference requirements of this section shall be the prevailing social and cultural standards of the Indian community in which the parent or extended family resides or with which the parent or extended family members maintain social and cultural ties.\nWhenever an Indian child is removed from a foster care home or institution for the purpose of further foster care, preadoptive, or adoptive placement, the placement shall be in accordance with the placement preferences, except in the case where an Indian child is being returned to the parent or Indian custodian from whose custody the Indian child was originally removed.\nA record of each such placement of an Indian child under state law shall be maintained by the county in which the placement was made and by the Department of Children, Youth, and Families evidencing the efforts to comply with the order of preference specified in this section. The record shall be made available at any time upon the request of the Secretary of the Interior or the Indian child's Tribe.\nThe court shall follow the placement preferences in subdivisions 1 to 9, except as follows:\n(1) where a parent evidences a desire for anonymity, the child-placing agency or petitioner and the court shall give weight to the parent's desire for anonymity in applying the preferences. A parent's desire for anonymity does not excuse the application of sections 260.751 to 260.835; or\n(2) where the court determines there is good cause based on:\n(i) the reasonable request of the Indian child's parents, if one or both parents attest that they have reviewed the placement options that comply with the order of placement preferences;\n(ii) the reasonable request of the Indian child if the Indian child is able to understand and comprehend the decision that is being made;\n(iii) the testimony of a qualified expert designated by the Indian child's Tribe and, if necessary, testimony from an expert witness who meets qualifications of section 260.771, subdivision 6, paragraph (d), clause (2), that supports placement outside the order of placement preferences due to extraordinary physical or emotional needs of the Indian child that require highly specialized services; or\n(iv) the testimony by the child-placing agency or petitioner that a diligent search has been conducted that did not locate any available, suitable families for the Indian child that meet the placement preference criteria.\nTestimony of the Indian child's bonding or attachment to a foster family alone, without the existence of at least one of the factors in subdivision 10, clause (2), shall not be considered good cause to keep an Indian child in a lower preference or nonpreference placement. Ease of visitation and facilitation of relationship with the Indian child's parents, Indian custodian, extended family, or Tribe may be considered when determining placement.\nA party who proposes that the required order of placement preferences not be followed bears the burden of establishing by clear and convincing evidence that good cause exists to modify the order of placement preferences.\nIf the court finds there is good cause to place the Indian child outside the order of placement preferences, the court must make written findings.\nA good cause finding under this subdivision must consider whether active efforts were provided to extended family members who are considered the primary placement option to assist them in becoming a placement option for the Indian child as required by section 260.762.\nWhen an Indian child is placed outside the order of placement preferences, good cause to continue this placement must be determined at every stage of the proceedings.",
	"repealed": false
}