{
	"id": "120B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.30",
	"title": "120B.30 GENERAL REQUIREMENTS; STATEWIDE ASSESSMENTS.",
	"text": "(a) [Renumbered 120B.30, subd 11, para (b); 120B.302, subd 2]\n(b) [Renumbered 120B.302, subd 3, para (a)]\n(c) [Renumbered 120B.303, subdivision 1]\n(d) [Renumbered 120B.303, subd 2; 120B.307, subd 2]\n(e) [Renumbered 120B.30, subd 16]\n(f) [Renumbered 120B.307, subd 3]\n(g) [Renumbered 120B.307, subd 4, para (a)]\n(h) [Renumbered 120B.307, subd 4, para (b)]\n(i) [Renumbered 120B.303, subd 3]\n(j) [Renumbered 120B.307, subd 4, para (c)]\n(k) [Renumbered 120B.307, subd 4, para (d)]\n(l) [Renumbered 120B.307, subd 4, para (e)]\n(m) [Renumbered 120B.305, subd 2, para (b)]\n(n) [Renumbered 120B.30, subd 11, para (a); 120B.302 subd 3, para (b); 120B.305, subd 2, para (c)]\n(o) [Renumbered 120B.305, subd 3, para (a)]\n(p) [Renumbered 120B.307, subdivision 1]\n(q) [Renumbered 120B.30, subd 8]\n(a) [Renumbered 120B.302, subdivision 1]\n(b) [Renumbered 120B.302, subd 3, para (c)]\n(c) [Renumbered 120B.302, subd 3, para (d)]\n(d) [Renumbered 120B.305, subd 2, para (a)]\n(e) [Renumbered 120B.30, subd 12, para (a)]\n(f) [Renumbered 120B.305, subdivision 1]\n(g) [Renumbered 120B.30, subd 9]\n(h) [Renumbered 120B.30, subd 7]\n[Renumbered 120B.30, subd 10]\n(a) [Renumbered 120B.30, subd 12, para (b)]\n(b) [Renumbered 120B.30, subd 12, para (c)]\n[Renumbered 120B.30, subd 12, para (d)]\n[Renumbered 120B.305, subd 3, para (b)]\n[Renumbered 120B.30, subd 13]\n[Renumbered 120B.30, subd 14]\n[Renumbered 120B.30, subd 15]\nA student who demonstrates attainment of required state academic standards, which include career and college readiness benchmarks, on high school assessments under section 120B.302 is academically ready for a career or college and is encouraged to participate in courses awarding college credit to high school students. Such courses and programs may include sequential courses of study within broad career areas and technical skill assessments that extend beyond course grades.\nFor purposes of statewide accountability, \"cultural competence,\" \"cultural competency,\" or \"culturally competent\" means the ability of families and educators to interact effectively with people of different cultures, native languages, and socioeconomic backgrounds.\nConsistent with applicable federal law, the commissioner must include appropriate, technically sound accommodations or alternative assessments for the very few students with disabilities for whom statewide assessments are inappropriate and for English learners.\nThe Department of Education shall develop a list of circumstances in which a student may be unable to test. The list shall include but not be limited to: students transferring to Minnesota from another state, students transferring from nonpublic to public school and students hospitalized. Students unable to participate in statewide assessment due to a circumstance on the list authorized under this subdivision shall not be penalized for missing the opportunity to take a test.\n(a) The commissioner must determine the testing process and the order of administration.\n(b) The commissioner must establish a testing period as late as possible each school year during which schools must administer the Minnesota Comprehensive Assessments to students. The commissioner must publish the testing schedule at least two years before the beginning of the testing period.\n(a) The Department of Education shall contract for professional and technical services according to competitive solicitation procedures under chapter 16C for purposes of this section.\n(b) A proposal submitted under this section must include disclosures containing:\n(1) comprehensive information regarding test administration monitoring practices; and\n(2) data privacy safeguards for student information to be transmitted to or used by the proposing entity.\n(c) Information provided in the proposal is not security information or trade secret information for purposes of section 13.37.\nConsistent with section 13.34, the commissioner must adopt and publish a policy to provide public and parental access for review of Minnesota-developed assessments which would not compromise the objectivity or fairness of the testing or examination process. Upon receiving a written request, the commissioner must make available to parents or guardians a copy of their student's actual responses to the test questions for their review.\nIn the event that it becomes necessary for the commissioner to order the suspension of assessments under this section because of service disruptions, technical interruptions, or any other reason beyond the control of school districts, the commissioner must immediately notify the chair and ranking member of the legislative committees with jurisdiction over kindergarten through grade 12 education.\nThe commissioner shall establish a reporting system for teachers, administrators, and students to report service disruptions and technical interruptions. The information reported through this system shall be maintained in a database accessible through the department's website.\nThough not a high school graduation requirement, students are encouraged to participate in a nationally recognized college entrance exam. To the extent state funding for college entrance exam fees is available, a district must pay the cost, one time, for an interested student in grade 11 or 12 who is eligible for a free or reduced-price meal, to take a nationally recognized college entrance exam before graduating. A student must be able to take the exam under this paragraph at the student's high school during the school day and at any one of the multiple exam administrations available to students in the district. A district may administer the ACT or SAT or both the ACT and SAT to comply with this paragraph. If the district administers only one of these two tests and a free or reduced-price meal eligible student opts not to take that test and chooses instead to take the other of the two tests, the student may take the other test at a different time or location and remains eligible for the examination fee reimbursement. Notwithstanding sections 123B.34 to 123B.39, a school district may require a student that is not eligible for a free or reduced-price meal to pay the cost of taking a nationally recognized college entrance exam. The district must waive the cost for a student unable to pay.\nAn employee who discloses information to the commissioner or a parent or guardian about service disruptions or technical interruptions related to administering assessments under this section is protected under section 181.932, governing disclosure of information by employees.",
	"repealed": false
}