{
	"id": "245.462",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.462",
	"title": "245.462 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 245.461 to 245.4863.\n\"Acute care hospital inpatient treatment\" means short-term medical, nursing, and psychosocial services provided in an acute care hospital licensed under chapter 144.\n\"Case management services\" means activities that are coordinated with the community support services program as defined in subdivision 6 and are designed to help adults with serious and persistent mental illness in gaining access to needed medical, social, educational, vocational, and other necessary services as they relate to the client's mental health needs. Case management services include developing a functional assessment, an individual community support plan, referring and assisting the person to obtain needed mental health and other services, ensuring coordination of services, and monitoring the delivery of services.\n(a) \"Case management service provider\" means a case manager or case manager associate employed by the county or other entity authorized by the county board to provide case management services specified in section 245.4711.\n(b) A case manager must:\n(1) be skilled in the process of identifying and assessing a wide range of client needs;\n(2) be knowledgeable about local community resources and how to use those resources for the benefit of the client;\n(3) be a mental health practitioner as defined in section 245I.04, subdivision 4, or have a bachelor's degree in one of the behavioral sciences or related fields including, but not limited to, social work, psychology, or nursing from an accredited college or university. A case manager who is not a mental health practitioner and who does not have a bachelor's degree in one of the behavioral sciences or related fields must meet the requirements of paragraph (c); and\n(4) meet the supervision and continuing education requirements described in paragraphs (d), (e), and (f), as applicable.\n(c) Case managers without a bachelor's degree must meet one of the requirements in clauses (1) to (3):\n(1) have three or four years of experience as a case manager associate as defined in this section;\n(2) be a registered nurse without a bachelor's degree and have a combination of specialized training in psychiatry and work experience consisting of community interaction and involvement or community discharge planning in a mental health setting totaling three years; or\n(3) be a person who qualified as a case manager under the 1998 Department of Human Service waiver provision and meet the continuing education and mentoring requirements in this section.\n(d) A case manager with at least 2,000 hours of supervised experience in the delivery of services to adults with mental illness must receive regular ongoing supervision and clinical supervision totaling 38 hours per year of which at least one hour per month must be clinical supervision regarding individual service delivery with a case management supervisor. The remaining 26 hours of supervision may be provided by a case manager with two years of experience. Group supervision may not constitute more than one-half of the required supervision hours. Clinical supervision must be documented in the client record.\n(e) A case manager without 2,000 hours of supervised experience in the delivery of services to adults with mental illness must:\n(1) receive clinical supervision regarding individual service delivery from a mental health professional at least one hour per week until the requirement of 2,000 hours of experience is met; and\n(2) complete 40 hours of training approved by the commissioner in case management skills and the characteristics and needs of adults with serious and persistent mental illness.\n(f) A case manager who is not licensed, registered, or certified by a health-related licensing board must receive 30 hours of continuing education and training in mental illness and mental health services every two years.\n(g) A case manager associate (CMA) must:\n(1) work under the direction of a case manager or case management supervisor;\n(2) be at least 21 years of age;\n(3) have at least a high school diploma or its equivalent; and\n(4) meet one of the following criteria:\n(i) have an associate of arts degree in one of the behavioral sciences or human services;\n(ii) be a certified peer specialist under section 256B.0615;\n(iii) be a registered nurse without a bachelor's degree;\n(iv) within the previous ten years, have three years of life experience with serious and persistent mental illness as defined in subdivision 20; or as a child had severe emotional disturbance as defined in section 245.4871, subdivision 6; or have three years life experience as a primary caregiver to an adult with serious and persistent mental illness within the previous ten years;\n(v) have 6,000 hours work experience as a nondegreed state hospital technician; or\n(vi) have at least 6,000 hours of supervised experience in the delivery of services to persons with mental illness.\nIndividuals meeting one of the criteria in items (i) to (v) may qualify as a case manager after four years of supervised work experience as a case manager associate. Individuals meeting the criteria in item (vi) may qualify as a case manager after three years of supervised experience as a case manager associate.\n(h) A case management associate must meet the following supervision, mentoring, and continuing education requirements:\n(1) have 40 hours of preservice training described under paragraph (e), clause (2);\n(2) receive at least 40 hours of continuing education in mental illness and mental health services annually; and\n(3) receive at least five hours of mentoring per week from a case management mentor.\nA \"case management mentor\" means a qualified, practicing case manager or case management supervisor who teaches or advises and provides intensive training and clinical supervision to one or more case manager associates. Mentoring may occur while providing direct services to consumers in the office or in the field and may be provided to individuals or groups of case manager associates. At least two mentoring hours per week must be individual and face-to-face.\n(i) A case management supervisor must meet the criteria for mental health professionals, as specified in subdivision 18.\n(j) An immigrant who does not have the qualifications specified in this subdivision may provide case management services to adult immigrants with serious and persistent mental illness who are members of the same ethnic group as the case manager if the person:\n(1) is currently enrolled in and is actively pursuing credits toward the completion of a bachelor's degree in one of the behavioral sciences or a related field including, but not limited to, social work, psychology, or nursing from an accredited college or university;\n(2) completes 40 hours of training as specified in this subdivision; and\n(3) receives clinical supervision at least once a week until the requirements of this subdivision are met.\nMS 2022 [Repealed, 2021 c 30 art 17 s 113]\n\"Commissioner\" means the commissioner of human services.\n\"Community support services program\" means services, other than inpatient or residential treatment services, provided or coordinated by an identified program and staff under the treatment supervision of a mental health professional designed to help adults with serious and persistent mental illness to function and remain in the community. A community support services program includes:\n(1) client outreach,\n(2) medication monitoring,\n(3) assistance in independent living skills,\n(4) development of employability and work-related opportunities,\n(5) crisis assistance,\n(6) psychosocial rehabilitation,\n(7) help in applying for government benefits, and\n(8) housing support services.\nThe community support services program must be coordinated with the case management services specified in section 245.4711. A program that meets the accreditation standards for Clubhouse International model programs meets the requirements of this subdivision.\n\"County board\" means the county board of commissioners or board established pursuant to the Joint Powers Act, section 471.59, or the Human Services Act, sections 402.01 to 402.10.\n\"Day treatment,\" \"day treatment services,\" or \"day treatment program\" means the treatment services described by section 256B.0671, subdivision 3.\n\"Diagnostic assessment\" has the meaning given in section 245I.10, subdivisions 4 to 6.\n\"Education and prevention services\" means services designed to educate the general public or special high-risk target populations about mental illness, to increase the understanding and acceptance of problems associated with mental illness, to increase people's awareness of the availability of resources and services, and to improve people's skills in dealing with high-risk situations known to affect people's mental health and functioning. The services include the distribution of information to individuals and agencies identified by the county board and the local mental health advisory council, on predictors and symptoms of mental disorders, where mental health services are available in the county, and how to access the services.\n\"Emergency services\" means an immediate response service available on a 24-hour, seven-day-a-week basis for persons having a psychiatric crisis, a mental health crisis, or emergency.\n\"Functional assessment\" means an assessment by the case manager of the adult's:\n(1) mental health symptoms as presented in the adult's diagnostic assessment;\n(2) mental health needs as presented in the adult's diagnostic assessment;\n(3) use of drugs and alcohol;\n(4) vocational and educational functioning;\n(5) social functioning, including the use of leisure time;\n(6) interpersonal functioning, including relationships with the adult's family;\n(7) self-care and independent living capacity;\n(8) medical and dental health;\n(9) financial assistance needs;\n(10) housing and transportation needs; and\n(11) other needs and problems.\n\"Individual community support plan\" means a written plan developed by a case manager on the basis of a diagnostic assessment and functional assessment. The plan identifies specific services needed by an adult with serious and persistent mental illness to develop independence or improved functioning in daily living, health and medication management, social functioning, interpersonal relationships, financial management, housing, transportation, and employment.\n\"Individual placement agreement\" means a written agreement or supplement to a service contract entered into between the county board and a service provider on behalf of an individual adult to provide residential treatment services.\n\"Individual treatment plan\" means the formulation of planned services that are responsive to the needs and goals of a client. An individual treatment plan must be completed according to section 245I.10, subdivisions 7 and 8.\n\"Mental health crisis services\" means crisis assessment, crisis intervention, and crisis stabilization services.\n[Repealed, 1991 c 94 s 25]\n\"Mental health funds\" are funds expended under sections 245.73 and 256K.10, federal mental health block grant funds, and funds expended under section 256D.06 to facilities licensed under section 245I.23 or Minnesota Rules, parts 9520.0500 to 9520.0670.\n\"Mental health practitioner\" means a staff person who is qualified according to section 245I.04, subdivision 4.\n\"Mental health professional\" means a staff person who is qualified according to section 245I.04, subdivision 2.\n\"Mental health services\" means at least all of the treatment services and case management activities that are provided to adults with mental illness and are described in sections 245.461 to 245.486.\n(a) \"Mental illness\" means an organic disorder of the brain or a clinically significant disorder of thought, mood, perception, orientation, memory, or behavior that is detailed in a diagnostic codes list published by the commissioner, and that seriously limits a person's capacity to function in primary aspects of daily living such as personal relations, living arrangements, work, and recreation.\n(b) An \"adult with acute mental illness\" means an adult who has a mental illness that is serious enough to require prompt intervention.\n(c) For purposes of case management and community support services, a \"person with serious and persistent mental illness\" means an adult who has a mental illness and meets at least one of the following criteria:\n(1) the adult has undergone two or more episodes of inpatient care for a mental illness within the preceding 24 months;\n(2) the adult has experienced a continuous psychiatric hospitalization or residential treatment exceeding six months' duration within the preceding 12 months;\n(3) the adult has been treated by a crisis team two or more times within the preceding 24 months;\n(4) the adult:\n(i) has a diagnosis of schizophrenia, bipolar disorder, major depression, schizoaffective disorder, or borderline personality disorder;\n(ii) indicates a significant impairment in functioning; and\n(iii) has a written opinion from a mental health professional, in the last three years, stating that the adult is reasonably likely to have future episodes requiring inpatient or residential treatment, of a frequency described in clause (1) or (2), unless ongoing case management or community support services are provided;\n(5) the adult has, in the last three years, been committed by a court as a person who is mentally ill under chapter 253B, or the adult's commitment has been stayed or continued;\n(6) the adult (i) was eligible under clauses (1) to (5), but the specified time period has expired or the adult was eligible as a child under section 245.4871, subdivision 6; and (ii) has a written opinion from a mental health professional, in the last three years, stating that the adult is reasonably likely to have future episodes requiring inpatient or residential treatment, of a frequency described in clause (1) or (2), unless ongoing case management or community support services are provided; or\n(7) the adult was eligible as a child under section 245.4871, subdivision 6, and is age 21 or younger.\n\"Outpatient services\" means mental health services, excluding day treatment and community support services programs, provided by or under the treatment supervision of a mental health professional to adults with mental illness who live outside a hospital. Outpatient services include clinical activities such as individual, group, and family therapy; individual treatment planning; diagnostic assessments; medication management; and psychological testing.\n\"Regional treatment center inpatient services\" means the 24-hour-a-day comprehensive medical, nursing, or psychosocial services required to be provided pursuant to section 246C.12.\n\"Residential treatment\" means a 24-hour-a-day program under the treatment supervision of a mental health professional, in a community residential setting other than an acute care hospital or regional treatment center inpatient unit, that must be licensed as a residential treatment program for adults with mental illness under chapter 245I, Minnesota Rules, parts 9520.0500 to 9520.0670, or other rules adopted by the commissioner.\n\"Service provider\" means either a county board or an entity under contract with the county board that provides adult mental health services funded by sections 245.461 to 245.486. A contracting entity may be an individual, organization, or agency, including a regional treatment center.\n[Repealed, 1989 c 282 art 4 s 64]\n\"Significant impairment in functioning\" means a condition, including significant suicidal ideation or thoughts of harming self or others, which harmfully affects, recurrently or consistently, a person's activities of daily living in employment, housing, family and social relationships, or education.\n\"Treatment supervision\" means the treatment supervision described by section 245I.06.",
	"repealed": false
}