{
	"id": "253B.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.15",
	"title": "253B.15 PROVISIONAL DISCHARGE; PARTIAL INSTITUTIONALIZATION.",
	"text": "(a) The head of the treatment facility, state-operated treatment program, or community-based treatment program may provisionally discharge any patient without discharging the commitment, unless the patient was found by the committing court to be a person who has a mental illness and is dangerous to the public, a sexually dangerous person, or a sexual psychopathic personality.\n(b) When a patient committed to the executive board becomes ready for provisional discharge before being placed in a state-operated treatment program, the head of the treatment facility or community-based treatment program where the patient is placed pending transfer to the executive board may provisionally discharge the patient pursuant to this subdivision.\n(c) Each patient released on provisional discharge shall have a written provisional discharge plan developed with input from the patient and the designated agency which specifies the services and treatment to be provided as part of the provisional discharge plan, the financial resources available to pay for the services specified, the expected period of provisional discharge, the precise goals for the granting of a final discharge, and conditions or restrictions on the patient during the period of the provisional discharge. The provisional discharge plan shall be provided to the patient, the patient's attorney, and the designated agency.\n(d) The provisional discharge plan shall be reviewed on a quarterly basis by the patient, designated agency and other appropriate persons. The provisional discharge plan shall contain the grounds upon which a provisional discharge may be revoked. The provisional discharge shall terminate on the date specified in the plan unless specific action is taken to revoke or extend it.\nBefore a provisional discharge is granted, a representative of the designated agency must be identified to ensure continuity of care by being involved with the treatment facility, state-operated treatment program, or community-based treatment program and the patient prior to the provisional discharge. The representative of the designated agency shall coordinate plans for and monitor the patient's aftercare program. When the patient is on a provisional discharge, the representative of the designated agency shall provide the treatment report to the court required under section 253B.12, subdivision 1.\n(a) The designated agency may initiate with the court a revocation of a provisional discharge if revocation is the least restrictive alternative and either:\n(1) the patient has violated material conditions of the provisional discharge, and the violation creates the need to return the patient to a more restrictive setting or more intensive community services; or\n(2) there exists a serious likelihood that the safety of the patient or others will be jeopardized, in that either the patient's need for food, clothing, shelter, or medical care are not being met, or will not be met in the near future, or the patient has attempted or threatened to seriously physically harm self or others.\n(b) Any interested person may request that the designated agency revoke the patient's provisional discharge. Any person making a request shall provide the designated agency with a written report setting forth the specific facts, including witnesses, dates and locations, supporting a revocation, demonstrating that every effort has been made to avoid revocation and that revocation is the least restrictive alternative available.\nRevocation shall be commenced by the designated agency's written notice of intent to revoke provisional discharge given or sent to the patient, the patient's attorney, the facility or program from which the patient was provisionally discharged, and the current community services provider. The notice shall set forth the grounds upon which the intention to revoke is based, and shall inform the patient of the rights of a patient under this chapter.\nWithin 48 hours, excluding weekends and legal holidays, of giving notice to the patient, the designated agency shall file with the court a copy of the notice and a report setting forth the specific facts, including witnesses, dates and locations, which (1) support revocation, (2) demonstrate that revocation is the least restrictive alternative available, and (3) show that specific efforts were made to avoid revocation. The designated agency shall provide copies of the report to the patient, the patient's attorney, the county attorney, and the treatment facility or program from which the patient was provisionally discharged within 48 hours of giving notice to the patient under subdivision 3.\nThe patient or patient's attorney may request judicial review of the intended revocation by filing a petition for review and an affidavit with the committing court. The affidavit shall state specific grounds for opposing the revocation. If the patient does not file a petition for review within five days of receiving the notice under subdivision 3, revocation of the provisional discharge is final and the court, without hearing, may order the patient into a facility or program from which the patient was provisionally discharged, another treatment facility, state-operated treatment program, or community-based treatment program that consents to receive the patient, or more intensive community treatment. If the patient files a petition for review, the court shall review the petition and determine whether a genuine issue exists as to the propriety of the revocation. The burden of proof is on the designated agency to show that no genuine issue exists as to the propriety of the revocation. If the court finds that no genuine issue exists as to the propriety of the revocation, the revocation of the provisional discharge is final.\n(a) If the court finds under subdivision 3b that a genuine issue exists as to the propriety of the revocation, the court shall hold a hearing on the petition within three days after the patient files the petition. The court may continue the review hearing for an additional five days upon any party's showing of good cause. At the hearing, the burden of proof is on the designated agency to show a factual basis for the revocation. At the conclusion of the hearing, the court shall make specific findings of fact. The court shall affirm the revocation if it finds:\n(1) a factual basis for revocation due to:\n(i) a violation of the material conditions of the provisional discharge that creates a need for the patient to return to a more restrictive setting or more intensive community services; or\n(ii) a probable danger of harm to the patient or others if the provisional discharge is not revoked; and\n(2) that revocation is the least restrictive alternative available.\n(b) If the court does not affirm the revocation, the court shall order the patient returned to provisional discharge status.\n[Repealed, 1997 c 217 art 1 s 118]\nWhen the designated agency gives or sends notice of the intent to revoke a patient's provisional discharge, it may also apply to the committing court for an order directing that the patient be returned to the facility or program from which the patient was provisionally discharged or another treatment facility, state-operated treatment program, or community-based treatment program that consents to receive the patient. The court may order the patient returned to a facility or program prior to a review hearing only upon finding that immediate return is necessary because there is a serious likelihood that the safety of the patient or others will be jeopardized, in that (1) the patient's need for food, clothing, shelter, or medical care is not being met, or will not be met in the near future, or (2) the patient has attempted or threatened to seriously harm self or others. If a voluntary return is not arranged, the head of the treatment facility, state-operated treatment program, or community-based treatment program may request a health officer or a peace officer to return the patient to the facility or program from which the patient was released or to any other treatment facility, state-operated treatment program, or community-based treatment program that consents to receive the patient. If necessary, the head of the treatment facility, state-operated treatment program, or community-based treatment program may request the committing court to direct a health officer or peace officer in the county where the patient is located to return the patient to the facility or program or to another treatment facility, state-operated treatment program, or community-based treatment program that consents to receive the patient. The expense of returning the patient to a state-operated treatment program shall be paid by the executive board unless paid by the patient or the patient's relatives. If the court orders the patient to return to the facility or program, or if a health officer or peace officer returns the patient to the facility or program, and the patient wants judicial review of the revocation, the patient or the patient's attorney must file the petition for review and affidavit required under subdivision 3b within 14 days of receipt of the notice of the intent to revoke.\n[Repealed, 1997 c 217 art 1 s 118]\n(a) A provisional discharge may be modified upon agreement of the parties.\n(b) A provisional discharge may be extended only in those circumstances where the patient has not achieved the goals set forth in the provisional discharge plan or continues to need the supervision or assistance provided by an extension of the provisional discharge. In determining whether the provisional discharge is to be extended, the designated agency shall consider the willingness and ability of the patient to voluntarily obtain needed care and treatment.\n(c) The designated agency must provide any proposed extension in writing to the patient and the patient's attorney at least 30 days prior to the expiration of the provisional discharge unless the patient cannot be located or is unavailable to receive the notice. The proposal for extension shall include: the specific grounds for proposing the extension, the anniversary date of the provisional discharge, the termination date of the provisional discharge, and the proposed length of extension. If the grounds for proposing the extension occur less than 30 days before its expiration, the designated agency must submit the written proposal for extension as soon as practicable.\n(d) The designated agency shall extend a provisional discharge only after providing the patient an opportunity for a meeting to object or make suggestions for alternatives to an extension. The designated agency shall provide a written decision to the patient and the patient's attorney regarding extension within five days after receiving the patient's input or after holding a meeting with the patient or after the patient has declined to provide input or participate in the meeting. The designated agency may seek input from the community-based treatment team or other persons the patient chooses.\nNo provisional discharge, revocation, or extension shall extend the term of the commitment beyond the period provided for in the commitment order.\nIf the provisional discharge extends until the end of the period of commitment and, before the commitment expires, the court extends the commitment under section 253B.12 or issues a new commitment order under section 253B.13, the provisional discharge shall continue for the duration of the new or extended period of commitment ordered unless the commitment order provides otherwise or the designated agency revokes the patient's provisional discharge pursuant to this section. To continue the patient's provisional discharge under this subdivision, the designated agency is not required to comply with the procedures in subdivision 7.\n(a) Except as otherwise provided, a provisional discharge is absolute when it expires. If, while on provisional discharge or extended provisional discharge, a patient is discharged as provided in section 253B.16, the discharge shall be absolute.\n(b) The designated agency shall give notice of the expiration of the provisional discharge to the committing court; the petitioner, if known; the patient's attorney; the county attorney in the county of commitment; and the facility or program that provisionally discharged the patient.\n(a) With the consent of the head of the treatment facility or state-operated treatment program, a patient may voluntarily return to inpatient status as follows:\n(1) as a voluntary patient, in which case the patient's commitment is discharged;\n(2) as a committed patient, in which case the patient's provisional discharge is voluntarily revoked; or\n(3) on temporary return from provisional discharge, in which case both the commitment and the provisional discharge remain in effect.\n(b) Prior to readmission, the patient shall be informed of status upon readmission.\nMS 2018 [Repealed, 1Sp2020 c 2 art 6 s 124]",
	"repealed": false
}