{
	"id": "573.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/573.02",
	"title": "573.02 ACTION FOR DEATH BY WRONGFUL ACT; SURVIVAL OF ACTIONS.",
	"text": "When death is caused by the wrongful act or omission of any person or corporation, the trustee appointed as provided in subdivision 3 may maintain an action therefor if the decedent might have maintained an action, had the decedent lived, for an injury caused by the wrongful act or omission. An action to recover damages for a death caused by the alleged professional negligence of a physician, surgeon, dentist, hospital or sanitarium, or an employee of a physician, surgeon, dentist, hospital or sanitarium shall be commenced within three years of the date of death, but in no event shall be commenced beyond the time set forth in section 541.076. An action to recover damages for a death caused by an intentional act constituting murder may be commenced at any time after the death of the decedent. Any other action under this section may be commenced within three years after the date of death provided that the action must be commenced within six years after the act or omission. The recovery in the action is the amount the jury deems fair and just for all damages suffered by the decedent resulting from the injury prior to the decedent's death and the pecuniary loss resulting from the death, and shall be for the exclusive benefit of the surviving spouse and next of kin, proportionate to the pecuniary loss severally suffered by the death. The court then determines the proportionate pecuniary loss of the persons entitled to the recovery and orders distribution accordingly. Funeral expenses and any demand for the support of the decedent allowed by the court having jurisdiction of the action, are first deducted and paid. Punitive damages may be awarded as provided in section 549.20.\nIf an action for the injury was commenced by the decedent and not finally determined while living, it may be continued by the trustee for recovery of all damages for the exclusive benefit of the surviving spouse and next of kin, proportionate to the pecuniary loss severally suffered by the death. The court on motion shall make an order allowing the continuance and directing pleadings to be made and issues framed as in actions begun under this section.\nWhen injury is caused to a person by the wrongful act or omission of any person or corporation and the person thereafter dies from a cause unrelated to those injuries, the trustee appointed in subdivision 3 may maintain an action for all damages arising out of such injury if the decedent might have maintained an action therefor had the decedent lived. An action under this subdivision may be commenced within three years after the date of death provided that the action must be commenced within six years after the act or omission.\nUpon written petition by the surviving spouse or one of the next of kin, the court having jurisdiction of an action falling within the provisions of subdivisions 1 or 2, shall appoint a suitable and competent person as trustee to commence or continue such action and obtain recovery of damages therein. The trustee, before commencing duties shall file a consent and oath. Before receiving any money, the trustee shall file a bond as security therefor in such form and with such sureties as the court may require.\nThis section shall not apply to any death or cause of action arising prior to its enactment, nor to any action or proceeding now pending in any court of the state of Minnesota, except, notwithstanding section 645.21, this section shall apply to any death or cause of action arising prior to its enactment which resulted from an intentional act constituting murder, and to any such action or proceeding now pending in any court of the state of Minnesota with respect to issues on which a final judgment has not been entered.",
	"repealed": false
}