{
	"id": "358.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.52",
	"title": "358.52 DEFINITIONS.",
	"text": "For purposes of sections 358.51 to 358.76, the terms defined in subdivisions 2 to 16 have the meanings given them.\n\"Acknowledgment\" means a declaration by an individual before a notarial officer that the individual has signed a record for the purpose stated in the record and, if the record is signed in a representative capacity, that the individual signed the record with proper authority and signed it as the act of the individual or entity identified in the record.\n\"Electronic\" means relating to technology having electrical, digital, magnetic, wireless, optical, electromagnetic, or similar capabilities.\n\"Electronic signature\" means an electronic symbol, sound, or process attached to or logically associated with a record and executed or adopted by an individual with the intent to sign the record.\n\"In a representative capacity\" means acting as:\n(1) an authorized officer, agent, partner, trustee, or other representative for a person other than an individual;\n(2) a public officer, personal representative, guardian, or other representative, in the capacity stated in a record;\n(3) an agent or attorney-in-fact for a principal; or\n(4) an authorized representative of another in any other capacity.\n\"Notarial act\" means an act, whether performed with respect to a tangible or electronic record, that a notarial officer may perform under the law of this state. The term includes taking an acknowledgment, administering an oath or affirmation, taking a verification on oath or affirmation, witnessing or attesting a signature, certifying or attesting a copy, and noting a protest of a negotiable instrument.\n\"Notarial officer\" means a notary public or other individual authorized to perform a notarial act.\n\"Notary public\" means an individual commissioned to perform a notarial act.\n\"Official stamp\" means a physical image affixed to a tangible record or an electronic image attached to or logically associated with an electronic record.\n\"Person\" means an individual, corporation, business trust, statutory trust, estate, trust, partnership, limited liability company, association, joint venture, public corporation, government or governmental subdivision, agency, or instrumentality, or any other legal or commercial entity.\n\"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n\"Sign\" means, with present intent to authenticate or adopt a record:\n(1) to execute or adopt a tangible symbol; or\n(2) to attach to or logically associate with the record an electronic symbol, sound, or process.\n\"Signature\" means a tangible symbol or an electronic signature that evidences the signing of a record.\n\"Stamping device\" means:\n(1) a physical device capable of affixing to a tangible record an official stamp; or\n(2) an electronic device or process capable of attaching to or logically associating with an electronic record an official stamp.\n\"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.\n\"Verification on oath or affirmation\" means a declaration, made by an individual on oath or affirmation before a notarial officer, that a statement in a record is true.",
	"repealed": false
}