{
	"id": "62E.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.06",
	"title": "62E.06 MINIMUM BENEFITS OF QUALIFIED PLAN.",
	"text": "A plan of health coverage shall be certified as a number three qualified plan if it otherwise meets the requirements established by chapters 62A, 62C, and 62Q, and the other laws of this state, whether or not the policy is issued in Minnesota, and meets or exceeds the following minimum standards:\n(a) The minimum benefits for a covered individual shall, subject to the other provisions of this subdivision, be equal to at least 80 percent of the cost of covered services in excess of an annual deductible which does not exceed $150 per person. The coverage shall include a limitation of $3,000 per person on total annual out-of-pocket expenses for services covered under this subdivision. The coverage shall not be subject to a lifetime maximum on essential health benefits.\nThe prohibition on lifetime maximums for essential health benefits and $3,000 limitation on total annual out-of-pocket expenses shall not be subject to change or substitution by use of an actuarially equivalent benefit.\n(b) Covered expenses shall be the usual and customary charges for the following services and articles when prescribed by a physician, advanced practice registered nurse, or physician assistant:\n(1) hospital services;\n(2) professional services for the diagnosis or treatment of injuries, illnesses, or conditions, other than dental, which are rendered by a physician, advanced practice registered nurse, or physician assistant or at the physician's, advanced practice registered nurse's, or physician assistant's direction;\n(3) drugs requiring a physician's, advanced practice registered nurse's, or physician assistant's prescription;\n(4) services of a nursing home for not more than 120 days in a year if the services would qualify as reimbursable services under Medicare;\n(5) services of a home health agency if the services would qualify as reimbursable services under Medicare;\n(6) use of radium or other radioactive materials;\n(7) oxygen;\n(8) anesthetics;\n(9) prostheses other than dental but including scalp hair prostheses worn for hair loss suffered as a result of alopecia areata;\n(10) rental or purchase, as appropriate, of durable medical equipment other than eyeglasses and hearing aids, unless coverage is required under section 62Q.675;\n(11) diagnostic x-rays and laboratory tests;\n(12) oral surgery for partially or completely unerupted impacted teeth, a tooth root without the extraction of the entire tooth, or the gums and tissues of the mouth when not performed in connection with the extraction or repair of teeth;\n(13) services of a physical therapist;\n(14) transportation provided by licensed ambulance service to the nearest facility qualified to treat the condition; or a reasonable mileage rate for transportation to a kidney dialysis center for treatment; and\n(15) services of an occupational therapist.\n(c) Covered expenses for the services and articles specified in this subdivision do not include the following:\n(1) any charge for care for injury or disease either (i) arising out of an injury in the course of employment and subject to a workers' compensation or similar law, (ii) for which benefits are payable without regard to fault under coverage statutorily required to be contained in any motor vehicle, or other liability insurance policy or equivalent self-insurance, or (iii) for which benefits are payable under another policy of accident and health insurance, Medicare, or any other governmental program except as otherwise provided by section 62A.04, subdivision 3, clause (4);\n(2) any charge for treatment for cosmetic purposes other than for reconstructive surgery when such service is incidental to or follows surgery resulting from injury, sickness, or other diseases of the involved part or when such service is performed on a covered dependent child because of congenital disease or anomaly which has resulted in a functional defect as determined by the attending physician, advanced practice registered nurse, or physician assistant;\n(3) care which is primarily for custodial or domiciliary purposes which would not qualify as eligible services under Medicare;\n(4) any charge for confinement in a private room to the extent it is in excess of the institution's charge for its most common semiprivate room, unless a private room is prescribed as medically necessary by a physician, advanced practice registered nurse, or physician assistant, provided, however, that if the institution does not have semiprivate rooms, its most common semiprivate room charge shall be considered to be 90 percent of its lowest private room charge;\n(5) that part of any charge for services or articles rendered or prescribed by a physician, advanced practice registered nurse, physician assistant, dentist, or other health care personnel which exceeds the prevailing charge in the locality where the service is provided; and\n(6) any charge for services or articles the provision of which is not within the scope of authorized practice of the institution or individual rendering the services or articles.\n(d) The minimum benefits for a qualified plan shall include, in addition to those benefits specified in paragraphs (a) and (e), benefits for well baby care, effective July 1, 1980, subject to applicable deductibles, coinsurance provisions, and maximum lifetime benefit limitations.\n(e) Effective July 1, 1979, the minimum benefits of a qualified plan shall include, in addition to those benefits specified in paragraph (a), a second opinion from a physician on all surgical procedures expected to cost a total of $500 or more in physician, laboratory, and hospital fees, provided that the coverage need not include the repetition of any diagnostic tests.\n(f) Effective August 1, 1985, the minimum benefits of a qualified plan must include, in addition to the benefits specified in paragraphs (a), (d), and (e), coverage for special dietary treatment for phenylketonuria when recommended by a physician, advanced practice registered nurse, or physician assistant.\n(g) Outpatient mental health coverage is subject to section 62A.152, subdivision 2.\nA plan of health coverage shall be certified as a number two qualified plan if it meets the requirements established by subdivision 1 except that the deductible shall not exceed $500 per person.\nA plan of health coverage shall be certified as a number one qualified plan if it meets the requirements established by subdivision 1 except that the deductible shall not exceed $1,000 per person.\nA health maintenance organization which provides the services required by chapter 62D shall be deemed to be providing a number three qualified plan.\nFor any policy of accident and health insurance subject to the requirements of the Affordable Care Act, as defined under section 62A.011, subdivision 1a, that is offered, sold, issued, or renewed on or after January 1, 2018, the requirements of this section do not apply.",
	"repealed": false
}