{
	"id": "115B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.31",
	"title": "115B.31 OTHER ACTIONS.",
	"text": "(a) A person who has settled a claim for an eligible injury or eligible property damage with a responsible person, either before or after bringing an action in court for that injury or damage, may not file a claim with the fund for the same injury or damage. A person who has received a favorable judgment in a court action for an eligible injury or eligible property damage may not file a claim with the fund for the same injury or damage, unless the judgment cannot be satisfied in whole or in part against the persons responsible for the release of the harmful substance. A person who has filed a claim with the agency or its predecessor, the Harmful Substance Compensation Board, may not file another claim with the agency for the same eligible injury or damage, unless the claim was inactivated by the agency or board as provided in section 115B.32, subdivision 1.\n(b) A person who has filed a claim with the agency or board for an eligible injury or damage, and who has received and accepted an award from the agency or board, is precluded from bringing an action in court for the same eligible injury or damage.\n(c) A person who files a claim with the agency for personal injury or property damage must include all known claims eligible for compensation in one proceeding before the agency.\nThe findings and decision of the agency are inadmissible in any court action. Protected information may not be used in any court action except to the extent that the information is otherwise available to a party or discovered under the applicable Rules of Civil or Criminal Procedure.\nThe state is subrogated to all the claimant's rights under statutory or common law to recover losses compensated from the fund from other sources, including responsible persons as defined in section 115B.03. The state may bring a subrogation action in its own name or in the name of the claimant. The state may not bring a subrogation action against a person who was a party in a court action by the claimant for the same eligible injury or damage, unless the claimant dismissed the action prior to trial. Money recovered by the state under this subdivision must be deposited in the fund. Nothing in sections 115B.25 to 115B.37 shall be construed to create a standard of recovery in a subrogation action.\nA claimant may not commence a court action to recover for any injury or damage for which the claimant seeks compensation from the fund during the time that a claim is pending before the agency. A person may not file a claim with the agency for compensation for any injury or damage for which the claimant seeks to recover in a pending court action. The time for filing a claim under section 115B.30 or the statute of limitations for any civil action is suspended during the period of time that a claimant is precluded from filing a claim or commencing an action under this subdivision.",
	"repealed": false
}