{
	"id": "403.382",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.382",
	"title": "403.382 STATEWIDE EMERGENCY COMMUNICATION BOARD.",
	"text": "(a) By an affirmative vote of a majority of the members of the Statewide Radio Board, the board may elect to become a Statewide Emergency Communication Board.\n(b) As a Statewide Emergency Communication Board, the board shall be responsible for the statewide coordination of 911 service in addition to existing responsibilities for the ARMER system provided for in sections 403.21 to 403.37.\nIn addition to any other powers specifically provided by law, the Statewide Emergency Communication Board has the powers given in this section for the coordination of 911 services.\nThe board shall coordinate the plan for the implementation of Minnesota's next generation 911 service with local and regional plans and modify the plan as necessary to facilitate the implementation of 911 services throughout the state in accordance with federal law.\nThe board shall define the standards for system performance of 911 service necessary to assure development that maximizes compatibility and interoperability of 911 service throughout the state.\nThe board shall oversee the implementation of the plan under subdivision 3 for 911 service and ensure that the 911 services are implemented, operated, and maintained in accordance with the 911 service plan.\nThe board shall coordinate system enhancements to maintain interoperability and minimum design standards to the extent to which local governments and nongovernmental public safety entities eligible for direct connection to Minnesota's 911 network may provide for system enhancements at their own expense.\nThe board shall establish and enforce rules establishing performance, operational, and system standards for the operation of 911 services.\nIn addition to powers provided for in this section for the coordination of 911 service, the board shall be responsible for planning and coordination of the following public safety emergency communication networks:\n(1) developing and maintaining a plan for the implementation of a statewide public safety broadband network, including the definition of technical and operational standards for that network; and\n(2) other wireless communication technologies or wireless communication networks for public safety communications, where the board finds that coordination and planning on a regional or statewide basis is appropriate or where regional or statewide coordination has been requested by the Federal Communications Commission or the Department of Homeland Security which is coordinating the technology or network on a national level.",
	"repealed": false
}