{
	"id": "290.0681",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0681",
	"title": "290.0681 CREDIT FOR HISTORIC STRUCTURE REHABILITATION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Account\" means the historic credit administration account in the special revenue fund.\n(c) \"Office\" means the State Historic Preservation Office of the Department of Administration.\n(d) \"Project\" means rehabilitation of a certified historic structure, as defined in section 47(c)(3)(A) of the Internal Revenue Code, that is located in Minnesota and is allowed a federal credit.\n(e) \"Federal credit\" means the credit allowed under section 47(a) of the Internal Revenue Code, except that the amount allowed is deemed to be allocated in the taxable year that the project is placed in service.\n(f) \"Placed in service\" has the meaning used in section 47 of the Internal Revenue Code.\n(g) \"Qualified rehabilitation expenditures\" has the meaning given in section 47 of the Internal Revenue Code.\n(a) A credit is allowed against the tax imposed under this chapter equal to not more than 100 percent of the credit allowed under section 47(a) of the Internal Revenue Code for a project. The credit is payable in five equal yearly installments beginning with the year the project is placed in service. To qualify for the credit:\n(1) the project must receive Part 3 certification and be placed in service during the taxable year; and\n(2) the taxpayer must be allowed the federal credit and be issued a credit certificate for the taxable year as provided in subdivision 4.\n(b) The commissioner of administration may pay a grant in lieu of the credit. The grant equals 90 percent of the credit that would be allowed for the project. The grant is payable in five equal yearly installments beginning with the year the project is placed in service.\n(c) In lieu of the credit under paragraph (a), an insurance company may claim a credit against the insurance premiums tax imposed under chapter 297I.\n(a) To qualify for a credit or grant under this section, the developer of a project must apply to the office before the rehabilitation begins. The application must contain the information and be in the form prescribed by the office. The office may collect a fee for application of up to 0.5 percent of qualified rehabilitation expenditures, up to $40,000, based on estimated qualified rehabilitation expenditures, to offset costs associated with personnel and administrative expenses related to administering the credit and preparing the economic impact report in subdivision 9. Application fees are deposited in the account. The application must indicate if the application is for a credit or a grant in lieu of the credit or a combination of the two and designate the taxpayer qualifying for the credit or the recipient of the grant.\n(b) Upon approving an application for credit, the office shall issue allocation certificates that:\n(1) verify eligibility for the credit or grant;\n(2) state the amount of credit or grant anticipated with the project, with the credit amount equal to 100 percent and the grant amount equal to 90 percent of the federal credit anticipated in the application;\n(3) state that the credit or grant allowed may increase or decrease if the federal credit the project receives at the time it is placed in service is different than the amount anticipated at the time the allocation certificate is issued; and\n(4) state the fiscal year in which the credit or grant is allocated, and that the taxpayer or grant recipient is entitled to receive one-fifth of the total amount of either the credit or the grant at the time the project is placed in service, provided that date is within three calendar years following the issuance of the allocation certificate.\n(c) The office, in consultation with the commissioner, shall determine if the project is eligible for a credit or a grant under this section and must notify the developer in writing of its determination. Eligibility for the credit is subject to review and audit by the commissioner.\n(d) The federal credit recapture and repayment requirements under section 50 of the Internal Revenue Code do not apply to the credit allowed under this section.\n(e) Any decision of the office under paragraph (c) may be challenged as a contested case under chapter 14. The contested case proceeding must be initiated within 45 days of the date of written notification by the office.\n(a)(1) The developer of a project for which the office has issued an allocation certificate must notify the office when the project is placed in service. Upon verifying that the project has been placed in service, and was allowed a federal credit, the office must issue a credit certificate to the taxpayer designated in the application or must issue a grant to the recipient designated in the application. The credit certificate must state the amount of the credit.\n(2) The credit amount equals the federal credit allowed for the project.\n(3) The grant amount equals 90 percent of the federal credit allowed for the project.\n(b) The recipient of a credit certificate may assign the certificate to another taxpayer before the first one-fifth payment is claimed, which is then allowed the credit under this section or section 297I.20, subdivision 3. An assignment is not valid unless the assignee notifies the commissioner within 30 days of the date that the assignment is made. The commissioner shall prescribe the forms necessary for notifying the commissioner of the assignment of a credit certificate and for claiming a credit by assignment.\n(c) Credits passed through to partners, members, shareholders, or owners pursuant to subdivision 5 are not an assignment of a credit certificate under this subdivision.\n(d) A grant agreement between the office and the recipient of a grant may allow the grant to be issued to another individual or entity.\nCredits granted to a partnership, a limited liability company taxed as a partnership, S corporation, or multiple owners of property are passed through to the partners, members, shareholders, or owners, respectively, pro rata to each partner, member, shareholder, or owner based on their share of the entity's assets or as specially allocated in their organizational documents or any other executed agreement, as of the last day of the taxable year.\nIf the amount of credit that the taxpayer is eligible to receive under this section exceeds the liability for tax under this chapter, the commissioner shall refund the excess to the taxpayer.\n(a) An amount sufficient to pay the refunds authorized under this section is appropriated to the commissioner from the general fund.\n(b) An amount sufficient to pay the grants authorized under this section is appropriated to the commissioner of administration from the general fund.\n(c) Amounts in the account are appropriated to the commissioner of administration for costs associated with personnel and administrative expenses related to administering the credit for historic structure rehabilitation in this section, for refunding application fees under subdivision 3, and for costs associated with preparing the determination of economic impact report required in subdivision 9.\n(a) The commissioner shall prescribe the manner in which the credit may be issued or claimed. This may include allowing the credit only as a separately processed claim for refund.\n(b) The office shall prescribe the manner in which grants are paid.\nThe commissioner of administration must annually determine the economic impact to the state from the rehabilitation of property for which credits or grants are provided under this section and provide a written report on the impact to the chairs and ranking minority members of the legislative committees on taxes of the senate and house of representatives, in compliance with sections 3.195 and 3.197.\nThis section expires after fiscal year 2030, except that the office's authority to issue credit certificates under subdivision 4 based on allocation certificates that were issued before fiscal year 2031 remains in effect through 2034, and the reporting requirements in subdivision 9 remain in effect through the year following the year in which all allocation certificates have either been canceled or resulted in issuance of credit certificates, or 2035, whichever is earlier.",
	"repealed": false
}