{
	"id": "148F.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.05",
	"title": "148F.05 LICENSE RENEWAL REQUIREMENTS.",
	"text": "A license must be renewed every two years.\nAt least 60 calendar days before the renewal deadline date, the board shall mail a renewal notice to the licensee's last known address on file with the board. The notice must include instructions for accessing an online application for license renewal, the renewal deadline, and notice of fees required for renewal. The licensee's failure to receive notice does not relieve the licensee of the obligation to meet the renewal deadline and other requirements for license renewal.\n(a) To renew a license, a licensee must submit to the board:\n(1) a completed, signed, and notarized application for license renewal;\n(2) the renewal fee required under section 148F.115, subdivision 2; and\n(3) evidence satisfactory to the board that the licensee has completed 40 clock hours of continuing education during the preceding two-year renewal period that meet the requirements of section 148F.075.\n(b) The application must be postmarked or received by the board by the end of the day on which the license expires or the following business day if the expiration date falls on a Saturday, Sunday, or holiday. An application which is not completed, signed, notarized, or which is not accompanied by the correct fee is void and must be returned to the licensee.\nIf a licensee's application for license renewal is postmarked or received by the board by the end of the business day on the expiration date of the license, the licensee may continue to practice after the expiration date while the application for license renewal is pending with the board.\nIf the application for license renewal is postmarked or received after the expiration date, the licensee shall pay a late fee as specified by section 148F.115, subdivision 5, clause (1), in addition to the renewal fee, before the application for license renewal will be considered by the board.",
	"repealed": false
}