{
	"id": "238.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.081",
	"title": "238.081 FRANCHISE PROCEDURE.",
	"text": "The franchising authority shall have published once each week for two successive weeks in a newspaper of general circulation in each municipality within the cable service territory, a notice of intent to consider an application for a franchise other than a franchise renewal pursuant to United States Code, title 47, section 546.\nThe notice must include at least the following information:\n(1) the name of the municipality making the request;\n(2) the closing date for submission of applications;\n(3) a statement of the application fee, if any, and the method for its submission;\n(4) a statement by the franchising authority of the services to be offered;\n(5) a statement by the franchising authority of criteria and priorities against which the applicants for the franchise must be evaluated;\n(6) a statement that applications for the franchise must contain at least the information required by subdivision 4;\n(7) the date, time, and place for the public hearing, to hear proposals from franchise applicants; and\n(8) the name, address, and telephone number of the individuals who may be contacted for further information.\nIn addition to the published notice, the franchising authority shall mail copies of the notice of intent to franchise to any person it has identified as being a potential candidate for the franchise.\n(a) The franchising authority shall require that proposals for a cable communications franchise be notarized and contain, but not necessarily be limited to, the following information:\n(1) plans for channel capacity, including both the total number of channels capable of being energized in the system and the number of channels to be energized immediately;\n(2) a statement of the television and radio broadcast signals for which permission to carry will be requested from the Federal Communications Commission;\n(3) a description of the proposed system design and planned operation, including at least the following items:\n(i) the general area for location of antennae and the head end, if known;\n(ii) the schedule for activating two-way capacity;\n(iii) the type of automated services to be provided;\n(iv) the number of channels and services to be made available for access cable broadcasting; and\n(v) a schedule of charges for facilities and staff assistance for access cable broadcasting;\n(4) the terms and conditions under which particular service is to be provided to governmental and educational entities;\n(5) a schedule of proposed rates in relation to the services to be provided, and a proposed policy regarding unusual or difficult connection of services;\n(6) a time schedule for construction of the entire system with the time sequence for wiring the various parts of the area requested to be served in the request for proposals;\n(7) a statement indicating the applicant's qualifications and experience in the cable communications field, if any;\n(8) an identification of the municipalities in which the applicant either owns or operates a cable communications system, directly or indirectly, or has outstanding franchises for which no system has been built;\n(9) plans for financing the proposed system, which must indicate every significant anticipated source of capital and significant limitations or conditions with respect to the availability of the indicated sources of capital;\n(10) a statement of ownership detailing the corporate organization of the applicant, if any, including the names and addresses of officers and directors and the number of shares held by each officer or director, and intracompany relationship including a parent, subsidiary, or affiliated company; and\n(11) a notation and explanation of omissions or other variations with respect to the requirements of the proposal.\n(b) Upon submission of a proposal, the municipality and applicant may negotiate franchise terms.\nThe franchising authority shall allow at least 20 days from the first date of published notice to the closing date for submitting applications.\nA public hearing before the franchising authority affording reasonable notice and a reasonable opportunity to be heard with respect to all applications for the franchise must be completed at least seven days before the adoption of a franchise ordinance.\nFranchises may be awarded by ordinance or other official action by the franchising authority.\nNothing in this section prohibits a franchising authority from recovering from an applicant the entire reasonable and necessary costs of processing a cable communications franchise.\nNothing contained in this section prohibits a franchising authority from franchising a nonprofit or municipally owned system. The municipality or nonprofit entity is considered an applicant for purposes of this section.\nIn the cases of municipalities acting in concert, the municipalities may delegate to another entity any duties, responsibilities, privileges, or activities described in this section, if the delegation is proper according to state and local law.",
	"repealed": false
}