{
	"id": "168.1296",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1296",
	"title": "168.1296 CRITICAL HABITAT PLATES.",
	"text": "(a) The commissioner shall issue critical habitat plates to an applicant who:\n(1) is a registered owner of a passenger automobile or recreational vehicle;\n(2) pays a fee in the amount specified for special plates under section 168.12, subdivision 5;\n(3) pays the registration tax required under section 168.013;\n(4) pays the fees required under this chapter;\n(5) contributes a minimum of $30 annually to the Minnesota critical habitat private sector matching account established in section 84.943; and\n(6) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\n(b) The critical habitat plate application must indicate that the annual contribution specified under paragraph (a), clause (5), is a minimum contribution to receive the plate and that the applicant may make an additional contribution to the account.\n(c) Special critical habitat license plates, the designs for which are selected under subdivision 2, may be personalized according to section 168.12, subdivision 2a.\nAfter consultation with interested groups, the commissioner of natural resources and the commissioner shall jointly select a suitable symbol for use by the commissioner to design the plates.\nContributions under this section must not be refunded.\nNotwithstanding section 168.12, subdivision 1, on payment of a transfer fee of $5, plates issued under this section may be transferred to another passenger automobile registered to the person to whom the plates were issued.\nContributions under subdivision 1, paragraph (a), clause (5), must be paid to the commissioner and credited to the Minnesota critical habitat private sector matching account established in section 84.943. The fees collected under this section must be deposited in the driver and vehicle services operating account under section 299A.705.\nThe commissioner shall maintain a record of the number of plates issued under this section.",
	"repealed": false
}