{
	"id": "325A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/325A.09",
	"title": "325A.09 REMEDIES AND ENFORCEMENT.",
	"text": "The provisions of sections 325A.01 to 325A.10 are not exclusive and do not relieve the parties or the contract from compliance with all other applicable provisions of law.\nAny contract for invention development services that does not comply with the applicable provisions of sections 325A.01 to 325A.10 shall be unenforceable against the customer as contrary to public policy, provided that no contract shall be unenforceable if the invention developer proves that noncompliance was unintentional and resulted from a bona fide error in spite of reasonable procedures adopted to avoid any such errors, and if the invention developer makes an appropriate correction.\nAny contract for invention development services entered into by a customer with an invention developer who has used any fraud, false pretense, false promise, misrepresentation, misleading statement or deceptive practice in respect to that customer with the intent that the customer rely thereon, whether or not the customer was in fact misled, deceived or damaged, shall be unenforceable against the customer.\nAny waiver by the customer of the provisions of sections 325A.01 to 325A.10 shall be deemed contrary to public policy and shall be void and unenforceable.\nAny person who has been injured by a violation of sections 325A.01 to 325A.10 by an invention developer, by any false or fraudulent statement, representation or omission of material fact by an invention developer or by failure of an invention developer to make all the disclosures required by sections 325A.01 to 325A.10 may bring a civil action against the invention developer for the damages sustained together with costs and disbursements, including reasonable attorney's fees. The court in its discretion may increase the award of damages to an amount not to exceed three times the damages sustained or $10,000, whichever is greater.\nFailure to make the disclosures required by section 325A.05 shall render any contract subsequently entered into between the customer and the invention developer voidable by the customer.\nIn addition to the penalties provided in subdivisions 1 to 6, any invention developer who is found to have violated sections 325A.01 to 325A.10 shall be deemed in violation of section 325F.69, subdivision 1, and the provisions of section 8.31 shall apply.\nThe statute of limitations on actions arising out of a breach of contract for invention development services shall be six years as provided in section 541.05, subdivision 1.",
	"repealed": false
}