{
	"id": "237.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.065",
	"title": "237.065 RATE FOR SCHOOL OR PURCHASING COOPERATIVE.",
	"text": "Each telephone company that provides local telephone service in a service area that includes a school that has classes within the range from kindergarten to 12th grade shall provide, upon request, additional service to the school that is sufficient to ensure access to basic telephone service from each classroom and other areas within the school, as determined by the school board. Each company shall set a flat rate for this additional service that is less than the company's flat rate for an access line for a business and the same as or greater than the company's flat rate for an access line for a residence in the same local telephone service exchange. When a company's flat rates for businesses and residences are the same, the company shall use the residential rate for service to schools under this section. The rate required under this section is available only for a school that installs additional service that includes access to basic telephone service from each classroom and other areas within the school, as determined by the school board.\n(a) Notwithstanding the provisions of sections 237.09, 237.14, 237.60, subdivision 3, and 237.74, each telephone company and telecommunications carrier that provides local telephone service in a service area that includes a school that has classes within the range from kindergarten to grade 12, a public library, or a telecommunication services purchasing cooperative may provide, upon request, basic and advanced telecommunication services at reduced or no cost to that school, library, or may provide, upon request, advanced telecommunication services at reduced wholesale rates to the members of a telecommunication services purchasing cooperative. For purposes of this section, a \"telecommunication services purchasing cooperative\" means a cooperative organized under section 308A.210. A school or library receiving telecommunications services at reduced or no cost may not resell or sublease the discounted services. No members of a telecommunication services purchasing cooperative may resell or sublease the discounted services. A purchasing cooperative is not required to negotiate or provide a uniform rate for its members. Telecommunications services shall be provided in accordance with Public Law 104-104, and the regulations of the Federal Communications Commission adopted under the act.\n(b) An agent that provides telecommunications services to a school or library may request the favorable rate on behalf of and for the exclusive benefit of the school or library. The school or library must authorize the agent to make the request of the local telephone company or telecommunications carrier. The telephone company or telecommunications carrier is not required to offer the same price discount to the agent that it would offer to the school district or library. An agent that receives a price discount for telecommunications services on behalf of a school or library may only resell or sublease the discounted services to that school or library.\n(c) For the purposes of this subdivision, \"school\" includes a public school as defined in section 120A.05, nonpublic, and church or religious organization schools that provide instruction in compliance with sections 120A.22, 120A.24, and 120A.41.",
	"repealed": false
}