{
	"id": "103E.641",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.641",
	"title": "103E.641 DRAINAGE FUNDING BONDS.",
	"text": "The board may issue drainage funding bonds under the conditions and terms in this section.\nDrainage funding bonds may be issued if:\n(1) money in a drainage system account or in the common drainage bond redemption fund will not be sufficient to pay the principal and interest of the drainage bonds payable from the funds and becoming due within one year afterwards; or\n(2) the county has paid any of the principal or interest on any of its drainage bonds from county funds other than the fund from which the bonds are payable, or by the issuance of county warrants issued and outstanding.\n(a) Before drainage funding bonds are authorized or issued under this section, the county auditor shall first sign and seal a certificate and present the certificate to the board. The board shall enter the certificate in its records. The certificate must state in detail, for each of the several drainage systems:\n(1) the amount that will be required to pay an existing shortage under subdivision 2; and\n(2) the probable amount that will be required to pay the principal and interest of the county's outstanding drainage bonds that become due within one year afterwards.\n(b) The certificate is conclusive evidence that the county has authority to issue bonds under the provisions of this section in an amount that does not exceed the aggregate amount specified in the auditor's certificate.\nWhen the auditor's certificate is entered in the board's records, the board may issue and sell, from time to time, county drainage funding bonds for the same drainage purposes as the funds listed in the certificate were used. The bonds must be designated drainage funding bonds. The board shall authorize issuance of the drainage funding bonds by resolution. The drainage funding bonds must be sold, issued, bear interest, and obligate the county as provided in section 103E.635 for drainage bonds. The drainage funding bonds must mature serially in annual installments that are payable within 15 years.\nThe proceeds of drainage funding bonds that are paid into the treasury must be applied to the purpose for which they are issued.\nDrainage funding bonds are general obligations of the county but are not included in determining the county's net indebtedness under any law.",
	"repealed": false
}