{
	"id": "325F.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.18",
	"title": "325F.18 DUTY OF MANUFACTURER.",
	"text": "(a) No manufacturer shall sell any building materials and no builder shall sell or lease to the initial occupant a housing unit, other than a unit of manufactured housing, containing urea formaldehyde unless the manufacturer or builder has made the following written disclosure to any purchaser of the materials or housing unit or lessee of the housing unit:\n\"IMPORTANT HEALTH NOTICE.\nSOME OF THE BUILDING MATERIALS USED IN THIS HOME (OR THESE BUILDING MATERIALS) EMIT FORMALDEHYDE. EYE, NOSE, AND THROAT IRRITATION, HEADACHE, NAUSEA AND A VARIETY OF ASTHMA-LIKE SYMPTOMS, INCLUDING SHORTNESS OF BREATH, HAVE BEEN REPORTED AS A RESULT OF FORMALDEHYDE EXPOSURE. ELDERLY PERSONS AND YOUNG CHILDREN, AS WELL AS ANYONE WITH A HISTORY OF ASTHMA, ALLERGIES, OR LUNG PROBLEMS, MAY BE AT GREATER RISK. RESEARCH IS CONTINUING ON THE POSSIBLE LONG-TERM EFFECTS OF EXPOSURE TO FORMALDEHYDE.\nREDUCED VENTILATION MAY ALLOW FORMALDEHYDE AND OTHER CONTAMINANTS TO ACCUMULATE IN THE INDOOR AIR. HIGH INDOOR TEMPERATURES AND HUMIDITY RAISE FORMALDEHYDE LEVELS. WHEN A HOME IS TO BE LOCATED IN AREAS SUBJECT TO EXTREME SUMMER TEMPERATURES, AN AIR-CONDITIONING SYSTEM CAN BE USED TO CONTROL INDOOR TEMPERATURE LEVELS. OTHER MEANS OF CONTROLLED MECHANICAL VENTILATION CAN BE USED TO REDUCE LEVELS OF FORMALDEHYDE AND OTHER INDOOR AIR CONTAMINANTS.\nIF YOU HAVE ANY QUESTIONS REGARDING THE HEALTH EFFECTS OF FORMALDEHYDE, CONSULT YOUR DOCTOR OR LOCAL HEALTH DEPARTMENT.\"\n(b) No manufacturer shall sell or lease a manufactured home containing urea formaldehyde unless the manufacturer has made the written disclosure prescribed in Code of Federal Regulations, title 24, section 3280.309 (1984).\nFor the purposes of this section \"building materials\" means any urea formaldehyde-containing material used in the construction, insulation, or renovation of a housing unit or a nonresidential building, but does not include:\n(1) draperies, carpeting, furniture and furnishings not normally permanently affixed to a housing unit; and\n(2) noncellular insulation.\nThe disclosure required by subdivision 1 shall be made clearly and conspicuously on the label or written warranty of the materials in a manner designed to attract the attention of a prospective buyer or user. If the product or housing unit has neither a label nor a written warranty the disclosure shall be made in a separate writing included with the product or housing unit.\nNo person shall sell for use in a dwelling place building materials subject to the written disclosure requirement of subdivision 1 unless the seller has provided to the purchaser a copy of the written disclosure provided by the manufacturer. No person shall for gain install or use in a dwelling place building materials subject to the written disclosure requirement of subdivision 1 unless the installer or user has provided to the person on whose behalf the materials are installed or used a copy of the written disclosure provided by the manufacturer.\nThe manufacturer of a product that contains urea formaldehyde shall pay the reasonable cost of repair or relocation if the consumer can document that the product used in constructing the consumer's residence did not, at the time of manufacture, meet the product standard established in section 325F.181. The builder of a housing unit shall pay the reasonable cost of repair or relocation if the consumer can document that the builder used products in the construction of the housing unit that were subject to the product standard adopted under section 325F.181 but were not certified and labeled under section 325F.181. A manufacturer or builder is not liable under this subdivision unless the consumer has documented medical records of illness related to formaldehyde and a statement from a physician that the consumer must vacate the premises. The party who has received the claim has the right to test the housing unit or products at reasonable times.\nIf within 30 days after the presentation of the items set forth above the manufacturer or builder and the consumer do not agree on a remedy the consumer may bring suit to recover the reasonable cost of repair or relocation plus reasonable attorneys' fees. Notwithstanding the remedy under this subdivision, the consumer may bring an action for personal injury, if any, if the action is commenced within one year from the consumer's receipt of the order of a physician to vacate the premises due to an illness related to formaldehyde.\n[Repealed, 1985 c 216 s 7]\nAny person who is found in violation of subdivisions 1 to 3 shall be deemed in violation of section 325F.69, subdivision 1, and the provisions of section 8.31 shall apply.",
	"repealed": false
}