{
	"id": "171.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.03",
	"title": "171.03 PERSONS EXEMPT.",
	"text": "The following persons are exempt from license hereunder:\n(a) A person in the employ or service of the United States federal government is exempt while driving or operating a motor vehicle owned by or leased to the United States federal government.\n(b) A person in the employ or service of the United States federal government is exempt from the requirement to possess a valid class A, class B, or class C commercial driver's license while driving or operating for military purposes a commercial motor vehicle for the United States federal government if the person is:\n(1) on active duty in the U. S. Coast Guard;\n(2) on active duty in a branch of the U. S. armed forces, which includes the Army, Air Force, Navy, and Marine Corps;\n(3) a member of a reserve component of the U. S. armed forces; or\n(4) on active duty in the Army National Guard or Air National Guard, which includes (i) a member on full-time National Guard duty, (ii) a member undergoing part-time National Guard training, and (iii) a National Guard military technician, who is a civilian required to wear a military uniform.\nThe exemption provided under this paragraph does not apply to a U. S. armed forces reserve technician.\n(c) A person operating a covered farm vehicle as defined in Code of Federal Regulations, title 49, section 390.05, that is not carrying hazardous materials of a type or quantity that requires the vehicle to be placarded in accordance with Code of Federal Regulations, title 49, section 172.504, is exempt from the requirement to possess a valid class A, class B, or class C commercial driver's license.\n(d) Any person while driving or operating any farm tractor or implement of husbandry temporarily on a highway is exempt. For purposes of this section, an all-terrain vehicle, as defined in section 84.92, subdivision 8, an off-highway motorcycle, as defined in section 84.787, subdivision 7, and an off-road vehicle, as defined in section 84.797, subdivision 7, are not implements of husbandry.\n(e) A nonresident who is at least 15 years of age and who has in immediate possession a valid driver's license issued to the nonresident in the home state or country may operate a motor vehicle in this state only as a driver.\n(f) A nonresident who has in immediate possession a valid commercial driver's license issued by a state or jurisdiction in accordance with the standards of Code of Federal Regulations, title 49, part 383, and who is operating in Minnesota the class of commercial motor vehicle authorized by the issuing state or jurisdiction is exempt.\n(g) Any nonresident who is at least 18 years of age, whose home state or country does not require the licensing of drivers may operate a motor vehicle as a driver, but only for a period of not more than 90 days in any calendar year, if the motor vehicle so operated is duly registered for the current calendar year in the home state or country of the nonresident.\n(h) Any person who becomes a resident of the state of Minnesota and who has in possession a valid driver's license issued to the person under and pursuant to the laws of some other state or jurisdiction or by military authorities of the United States may operate a motor vehicle as a driver, but only for a period of not more than 60 days after becoming a resident of this state, without being required to have a Minnesota driver's license as provided in this chapter.\n(i) Any person who becomes a resident of the state of Minnesota and who has in possession a valid commercial driver's license issued by another state or jurisdiction in accordance with the standards of Code of Federal Regulations, title 49, part 383, is exempt for not more than 30 days after becoming a resident of this state.\n(j) Any person operating a snowmobile, as defined in section 84.81, is exempt.\n(k) A railroad operator, as defined in section 169.035, subdivision 4, paragraph (a), is exempt while operating a railroad locomotive or train, or on-track equipment while being operated upon rails. This exemption includes operation while crossing a street or highway, whether public or private.",
	"repealed": false
}