{
	"id": "97A.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.071",
	"title": "97A.071 WILDLIFE ACQUISITION ACCOUNT.",
	"text": "The wildlife acquisition account is established as an account in the game and fish fund.\nRevenue from the small-game surcharge and $6.50 annually from the lifetime fish and wildlife trust fund, established in section 97A.4742, for each license issued under sections 97A.473, subdivisions 3 and 5, and 97A.474, subdivision 3, shall be credited to the wildlife acquisition account and is appropriated to the commissioner. The money in the account shall be used by the commissioner only for the purposes of this section, and acquisition and development of wildlife lands under section 97A.145 and maintenance of the lands, in accordance with appropriations made by the legislature.\nOf the money annually appropriated and available from the wildlife acquisition account:\n(1) at least 50 percent must be used for land costs; and\n(2) the remainder may only be used for other land acquisition costs, development, and maintenance of wildlife lands, and activities under subdivision 3.\nThe wildlife acquisition account may be used for developing, preserving, restoring, and maintaining waterfowl breeding grounds in Canada under agreement or contract with any nonprofit organization dedicated to the construction, maintenance, and repair of projects that are acceptable to the governmental agency having jurisdiction over the land and water affected by the projects. The commissioner may execute agreements and contracts if the commissioner determines that the use of the funds will benefit the migration of waterfowl into the state.\n[Repealed, 1994 c 561 s 28]\n(a) The definitions in this subdivision apply to this section.\n(b) \"Development\" means fencing, signing, and on-site improvement of the land that is related to the purposes for which the land was acquired. Development includes material or equipment that is purchased or rented and labor that is necessary to provide for the onsite improvement of the land.\n(c) \"Land costs\" means the purchase price of land acquired by the commissioner under section 97A.145.\n(d) \"Maintenance\" means noxious weed control and other on-site functions performed on a regular basis to sustain the environmental conditions that result from the original improvement of the land.\n(e) \"Other acquisition costs\" means acquisition coordination costs, costs of engineering services, appraisal fees, attorney fees, taxes, assessments required at the time of purchase, and recording fees for land acquired by the commissioner under section 97A.145.",
	"repealed": false
}