{
	"id": "325F.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.80",
	"title": "325F.80 RETAIL SALES OF CONSUMER GOODS; REFUNDS.",
	"text": "For purposes of this section, the following terms have the meanings given them under this subdivision:\n(1) \"consumer\" means a natural person who buys goods for personal, family, or household purposes and not for commercial, agricultural, or business purposes;\n(2) \"seller\" means a person who regularly sells goods at retail to consumers;\n(3) \"acceptable\" means that the goods returned are in a condition acceptable to the seller using reasonable and objective standards, the goods are returned within a reasonable time from the date of purchase, and proof of purchase is presented by the consumer at time of return;\n(4) \"cash refund\" means the seller provides the consumer cash at the time of the return; or the seller mails a check to the consumer within a reasonable time following return; or, for sales involving financial transaction cards, as defined in section 325G.02, subdivision 2, or sales in which the seller extends credit to the consumer, the seller credits the account that was charged.\nA seller may not refuse to give a cash refund to a consumer for goods that are acceptable for return unless the seller complies with subdivision 3.\nIf a seller wishes to alter the cash refund policy required by this section, written notice of the seller's cash refund policy must be clearly and conspicuously displayed on the premises. The notice must be written in boldface type of a minimum size of 14 points.\nThis section does not apply to home solicitation sales, as defined in section 325G.06, goods custom ordered or special ordered by the consumer, sellers licensed under section 168.27, or sales that are subject to a written agreement or contract under the Uniform Commercial Code.\nA seller who violates this section is subject to the remedies under section 8.31, except that a civil penalty imposed under that section may not exceed $500 per violation.",
	"repealed": false
}