{
	"id": "134.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.34",
	"title": "134.34 REGIONAL LIBRARY BASIC SYSTEM SUPPORT AID; REQUIREMENTS.",
	"text": "(a) Regional library basic system support aid shall be provided to any regional public library system where there are at least three participating counties and where each participating city and county is providing for public library service support the lesser of (1) an amount equivalent to .82 percent of the average of the adjusted net tax capacity of the taxable property of that city or county, as determined by the commissioner of revenue for the second, third, and fourth year preceding that calendar year, or (2) a per capita amount calculated under the provisions of this subdivision. The per capita amount is established for calendar year 1993 as $7.62. In succeeding calendar years, the per capita amount shall be increased by a percentage equal to one-half of the percentage by which the total state adjusted net tax capacity of property as determined by the commissioner of revenue for the second year preceding that calendar year increases over that total adjusted net tax capacity for the third year preceding that calendar year.\n(b) The minimum level of support specified under this subdivision or subdivision 4 shall be certified annually to the participating cities and counties by the Department of Education. If a city or county chooses to reduce its local support in accordance with subdivision 4, paragraph (b) or (c), it shall notify its regional public library system. The regional public library system shall notify the Department of Education that a revised certification is required. The revised minimum level of support shall be certified to the city or county by the Department of Education.\n(c) A city which is a part of a regional public library system shall not be required to provide this level of support if the property of that city is already taxable by the county for the support of that regional public library system. In no event shall the Department of Education require any city or county to provide a higher level of support than the level of support specified in this section in order for a system to qualify for regional library basic system support aid. This section shall not be construed to prohibit a city or county from providing a higher level of support for public libraries than the level of support specified in this section.\n(d) The amounts required to be expended under this section are subject to the reduced maintenance of effort requirements under section 275.761.\n[Repealed, 1992 c 499 art 10 s 4]\nRegional library basic system support aid shall be provided only to those regional public library systems officially designated by the commissioner of education as the appropriate agency to strengthen, improve and promote public library services in the participating areas. The commissioner of education shall designate no more than one such regional public library system located entirely within any single development region existing under sections 462.381 to 462.398 or chapter 473.\n(a) For calendar year 2010 and later, regional library basic system support aid shall not be provided to a regional public library system for a participating city or county which decreases the dollar amount provided for support for operating purposes of public library service below the amount provided by it for the second, or third preceding year, whichever is less. For purposes of this subdivision and subdivision 1, any funds provided under section 473.757, subdivision 2, for extending library hours of operation shall not be considered amounts provided by a city or county for support for operating purposes of public library service. This subdivision shall not apply to participating cities or counties where the adjusted net tax capacity of that city or county has decreased, if the dollar amount of the reduction in support is not greater than the dollar amount by which support would be decreased if the reduction in support were made in direct proportion to the decrease in adjusted net tax capacity.\n(b) For calendar year 2009 and later, in any calendar year in which a city's or county's aid under sections 477A.011 to 477A.014 or credit reimbursement under section 273.1384 is reduced after the city or county has certified its levy payable in that year, it may reduce its local support by the lesser of:\n(1) ten percent; or\n(2) a percent equal to the ratio of the aid and credit reimbursement reductions to the city's or county's revenue base, based on aids certified for the current calendar year. For calendar year 2009 only, the reduction under this paragraph shall be based on 2008 aid and credit reimbursement reductions under the December 2008 unallotment, as well as any aid and credit reimbursement reductions in calendar year 2009. For pay 2009 only, the commissioner of revenue will calculate the reductions under this paragraph and certify them to the commissioner of education within 15 days of May 17, 2009.\n(c) For taxes payable in 2010 and later, in any payable year in which the total amounts certified for city or county aids under sections 477A.011 to 477A.014 are less than the total amounts paid under those sections in the previous calendar year, a city or county may reduce its local support by the lesser of:\n(1) ten percent; or\n(2) a percent equal to the ratio of:\n(i) the difference between (A) the sum of the aid it was paid under sections 477A.011 to 477A.014 and the credit reimbursement it received under section 273.1384 in the previous calendar year and (B) the sum of the aid it is certified to be paid in the current calendar year under sections 477A.011 to 477A.014 and the credit reimbursement estimated to be paid under section 273.1384; to\n(ii) its revenue base for the previous year, based on aids actually paid in the previous calendar year. The commissioner of revenue shall calculate the percent aid cut for each county and city under this paragraph and certify the percentage cuts to the commissioner of education by August 1 of the year prior to the year in which the reduced aids and credit reimbursements are to be paid. The percentage of reduction related to reductions to credit reimbursements under section 273.1384 shall be based on the best estimation available as of July 30.\n(d) Notwithstanding paragraph (a), (b), or (c), no city or county shall reduce its support for public libraries below the minimum level specified in subdivision 1.\n(e) For purposes of this subdivision, \"revenue base\" means the sum of:\n(1) its levy for taxes payable in the current calendar year, including the levy on the fiscal disparities distribution under section 276A.06, subdivision 3, clause (1), or 473F.08, subdivision 3, paragraph (a);\n(2) its aid under sections 477A.011 to 477A.014 in the current calendar year; and\n(3) its taconite aid in the current calendar year under sections 298.28 and 298.282.\n[Repealed, 1Sp1997 c 4 art 8 s 6]\n[Repealed, 1989 c 329 art 10 s 5]\n[Repealed, 1Sp1989 c 1 art 5 s 51]\nIn addition to the annual report required in section 134.13, a regional public system that receives basic system support aid under this section must provide each participating county and city with its proposed budget for the next year.",
	"repealed": false
}