{
	"id": "518A.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.82",
	"title": "518A.82 CONTRIBUTION BY PARENTS.",
	"text": "A parent of a child is liable for the amount of public assistance, as defined in section 256.741, furnished to and for the benefit of the child, including any assistance furnished for the benefit of the caretaker of the child, which the parent has had the ability to pay. Ability to pay must be determined according to this chapter. The parent's liability is limited to the two years immediately preceding the commencement of the action, except that where child support has been previously ordered, the state or county agency providing the assistance, as assignee of the obligee, shall be entitled to judgments for child support payments accruing within ten years preceding the date of the commencement of the action up to the full amount of assistance furnished. The action may be ordered by the state agency or county agency and shall be brought in the name of the county or in the name of the state agency against the parent for the recovery of the amount of assistance granted, together with the costs and disbursements of the action.\nIn addition to granting the county or state agency a money judgment, the court may, upon a motion or order to show cause, order continuing support contributions by a parent found able to reimburse the county or state agency. The order shall be effective for the period of time during which the recipient receives public assistance from any county or state agency and thereafter. The order shall require support according to this chapter and include the names and Social Security numbers of the father, mother, and the child or children. An order for continuing contributions is reinstated without further hearing upon notice to the parent by any county or state agency that public assistance, as defined in section 256.741, is again being provided for the child of the parent. The notice shall be in writing and shall indicate that the parent may request a hearing for modification of the amount of support or maintenance.\n[Repealed, 1983 c 308 s 32]\nMS 1980 [Repealed, 1981 c 360 art 2 s 52]\nThe order for continuing support contributions shall remain in effect following the period after public assistance, as defined in section 256.741, granted is terminated unless the former recipient files an affidavit with the court requesting termination of the order.\n[Repealed, 1989 c 282 art 2 s 219]\nA person or entity having physical custody of a dependent child not receiving public assistance as defined in section 256.741 has a cause of action for child support against the child's noncustodial parents. Upon a motion served on the noncustodial parent, the court shall order child support payments, including medical support and child care support, from the noncustodial parent under this chapter. A noncustodial parent's liability may include up to the two years immediately preceding the commencement of the action. This subdivision applies only if the person or entity has physical custody with the consent of a custodial parent or approval of the court.\nAny order for support issued under this section shall provide for a conspicuous notice that, if the obligor fails to make a support payment, the payment owed becomes a judgment by operation of law on and after the date the payment is due, and the obligee or public agency responsible for support enforcement may obtain entry and docketing of the judgment for the unpaid amounts under the provisions of section 548.091.\nEvery order for maintenance issued under this section shall provide for a conspicuous notice that, if the obligor fails to make the maintenance payments, the obligee or public agency responsible for maintenance enforcement may obtain docketing of a judgment for the unpaid amount under the provisions of section 548.091. The notice shall enumerate the conditions that must be met before the judgment can be docketed.\nThe public authority shall not release private data on the location of a party to the action or the joint child if:\n(1) the public authority has knowledge that one party is currently subject to a protective order with respect to the other party or the joint child, and the protected party or guardian of the joint child has not authorized disclosure; or\n(2) the public authority has reason to believe that the release of the information may result in physical or emotional harm to a party or the joint child.\n(a) A parent liable for assistance under this section may seek a suspension of collection efforts under Title IV-D of the Social Security Act or a payment agreement based on ability to pay if the parent has reunited with that parent's family and lives in the same household as the child on whose behalf the assistance was furnished.\n(b) The Title IV-D agency shall consider the individual financial circumstances of each obligor in evaluating the obligor's ability to pay a proposed payment agreement and shall propose a reasonable payment agreement tailored to those individual financial circumstances.\n(c) The Title IV-D agency may suspend collection of arrears owed to the state under this section for as long as the obligor continues to live in the same household as the child on whose behalf the assistance was furnished if the total gross household income of the obligor is less than 185 percent of the federal poverty level.\n(d) An obligor must annually reapply for suspension of collection of arrearages under paragraph (c).\n(e) The obligor must notify the Title IV-D agency if the obligor no longer resides in the same household as the child.",
	"repealed": false
}