{
	"id": "279.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/279.37",
	"title": "279.37 CONFESSION OF JUDGMENT FOR DELINQUENT TAXES.",
	"text": "Delinquent taxes upon any parcel of real estate may be composed into one item or amount by confession of judgment at any time prior to the forfeiture of the parcel of land to the state for taxes, for the aggregate amount of all the taxes, costs, penalties, and interest accrued against the parcel, as provided in this section. Taxes upon property which, for the previous year's assessment, was classified as mineral property, employment property, or commercial or industrial property are only eligible to be composed into any confession of judgment under this section as provided in subdivision 1a. Delinquent taxes for property that has been reclassified from 4bb to 4b under section 273.1319 may not be composed into a confession of judgment under this subdivision. Delinquent taxes on unimproved land are eligible to be composed into a confession of judgment only if the land is classified under section 273.13 as homestead, agricultural, rural vacant land, or managed forest land, in the previous year or is eligible for installment payment under subdivision 1a. The entire parcel is eligible for the ten-year installment plan as provided in subdivision 2 if 25 percent or more of the market value of the parcel is eligible for confession of judgment under this subdivision.\n(a) The delinquent taxes upon a parcel of property which was classified class 3a for the previous year's assessment shall be eligible to be composed into a confession of judgment with the approval of the county auditor. Property qualifying under this subdivision shall be subject to the same provisions as provided in this section except as provided in paragraphs (b) to (f).\n(b) Current year taxes and penalty due at the time the confession of judgment is entered must be paid.\n(c) The down payment must include all special assessments due in the current tax year, all delinquent special assessments, and 20 percent of the ad valorem tax, penalties, and interest accrued against the parcel. The balance remaining is payable in four equal annual installments. A municipality as defined in section 429.011, cities of the first class, and other special assessment authorities, that have certified special assessments against any parcel of property, may, through resolution, waive the requirement of payment of all current and delinquent special assessments at the time the confession is entered. If the municipality, city, or authority grants the waiver, 100 percent of all current year taxes, special assessments, and penalties due at the time, along with 20 percent of all delinquent taxes, special assessments, penalties, interest, and fees, must be paid. The balance remaining shall be subject to and included in the installment plan.\n(d) When there are current and delinquent special assessments certified and billed against a parcel, the assessment authority or municipality as defined in section 429.011 may abate under section 375.192, subdivision 2, all special assessments and the penalty and interest affiliated with the special assessments, and reassess the special assessments, penalties, and interest accrued thereon, under section 429.071, subdivision 2. The municipality shall notify the county auditor of its intent to reassess as a precondition to the entry of the confession of judgment. Upon the notice to abate and reassess, the municipality shall, through resolution, notify the county auditor to remove all current and delinquent special assessments and the accrued penalty and interest on the special assessments, and the payment of all or a portion of the current and delinquent assessments shall not be required as part of the down payment due at the time the confession of judgment is entered in accordance with paragraph (c).\n(e) The amounts entered in judgment bear interest at the rate provided in section 279.03, subdivision 1a, commencing with the date the judgment is entered. The interest rate is subject to change each year on the unpaid balance in the manner provided in section 279.03, subdivision 1a.\n(f) The county auditor may require conditions on properties including, but not limited to, environmental remediation action plan requirements, restrictions, or covenants when considering a request for approval of eligibility for composition into a confession of judgment for delinquent taxes upon a parcel of property which was classified class 3a for the previous year's assessment.\nThe county auditor may offer on a voluntary basis financial literacy counseling as part of entering into a confession of judgment. The county auditor may fund the financial literacy counseling using the fee in subdivision 8. The counseling shall not be at taxpayer expense.\n(a) The owner of any such parcel, or any person to whom the right to pay taxes has been given by statute, mortgage, or other agreement, may make and file with the county auditor of the county in which the parcel is located a written offer to pay the current taxes each year before they become delinquent, or to contest the taxes under chapter 278 and agree to confess judgment for the amount provided, as determined by the county auditor. By filing the offer, the owner waives all irregularities in connection with the tax proceedings affecting the parcel and any defense or objection which the owner may have to the proceedings, and also waives the requirements of any notice of default in the payment of any installment or interest to become due pursuant to the composite judgment to be so entered. Unless the property is subject to subdivision 1a, with the offer, the owner shall (i) tender one-tenth of the amount of the delinquent taxes, costs, penalty, and interest, and (ii) tender all current year taxes and penalty due at the time the confession of judgment is entered. In the offer, the owner shall agree to pay the balance in nine equal installments, with interest as provided in section 279.03, payable annually on installments remaining unpaid from time to time, on or before December 31 of each year following the year in which judgment was confessed.\n(b) For property which qualifies under section 279.03, subdivision 2, paragraph (b), each year the commissioner shall set the interest rate for offers made under paragraph (a) at the greater of five percent or two percent above the prime rate charged by banks during the six-month period ending on September 30 of that year, rounded to the nearest full percent, provided that the rate must not exceed the maximum annum rate specified under section 279.03, subdivision 1a. The rate of interest becomes effective on January 1 of the immediately succeeding year. The commissioner's determination under this subdivision is not a rule subject to the Administrative Procedure Act in chapter 14, including section 14.386. If a default occurs in the payments under any confessed judgment entered under this paragraph, the taxes and penalties due are subject to the interest rate specified in section 279.03.\nFor the purposes of this subdivision:\n(1) the term \"prime rate charged by banks\" means the average predominant prime rate quoted by commercial banks to large businesses, as determined by the Board of Governors of the Federal Reserve System; and\n(2) \"default\" means the cancellation of the confession of judgment due to nonpayment of the current year tax or failure to make any installment payment required by this confessed judgment within 60 days from the date on which payment was due.\n(c) The interest rate established at the time judgment is confessed is fixed for the duration of the judgment. By October 15 of each year, the commissioner of revenue must determine the rate of interest as provided under paragraph (b) and, by November 1 of each year, must certify the rate to the county auditor.\n(d) A qualified property owner eligible to enter into a second confession of judgment may do so at the interest rate provided in paragraph (b).\n(e) Repurchase agreements or contracts for repurchase for properties being repurchased under section 282.261 are not eligible to receive the interest rate under paragraph (b).\n(f) The offer must be substantially as follows:\n\"To the court administrator of the district court of ........... county, I, ....................., am the owner of the following described parcel of real estate located in .................... county, Minnesota:\n.............................. Upon that real estate there are delinquent taxes for the year ........., and prior years, as follows: (here insert year of delinquency and the total amount of delinquent taxes, costs, interest, and penalty). By signing this document I offer to confess judgment in the sum of $...... and waive all irregularities in the tax proceedings affecting these taxes and any defense or objection which I may have to them, and direct judgment to be entered for the amount stated above, minus the sum of $............, to be paid with this document, which is one-tenth or one-fifth of the amount of the taxes, costs, penalty, and interest stated above. I agree to pay the balance of the judgment in nine or four equal, annual installments, with interest as provided in section 279.03, payable annually, on the installments remaining unpaid. I agree to pay the installments and interest on or before December 31 of each year following the year in which this judgment is confessed and current taxes each year before they become delinquent, or within 30 days after the entry of final judgment in proceedings to contest the taxes under chapter 278.\nDated .............., .......\"\nUpon the receipt of the offer and payment of the sum required, the auditor shall notify the county board of the offer. The auditor shall record it and shall file the offer and confession of judgment with the court administrator of the district court of the county who is directed to enter judgment in accordance with the offer.\nThe auditor shall immediately deliver to the treasurer the initial payments received by the auditor. The judgment so rendered shall not constitute a personal judgment against the party or parties therein and shall be a judgment in rem. For the purpose of computing the applicable period of redemption pursuant to section 281.17, lands included in a confession of judgment will be deemed to be sold to the state at the first tax judgment sale following the entry of judgment.\nUpon the entry of said judgment, all the interest on the taxes embraced within said judgment shall be waived, except as herein provided, and further proceedings shall be suspended on any judgment for taxes embraced in said confessed judgment as long as no default exists. Upon the payment in full of the amounts required to be paid under the confessed judgment, except the then current taxes not yet delinquent, the original judgment shall be satisfied.\nThe county auditor shall give notice by mail not later than November 30 of each year to the person or persons making such confession of judgment at the address given therein of the payment due under the confession on the following December 31. If the county auditor has not received the installment payment by December 31, the auditor shall give notice by certified mail at the last known address of the person making the confession of judgment, without regard to the county or state of the person's residency. This notice shall state that the property shall be subject to the tax forfeiture laws if payment is not made within 60 days from the preceding December 31. Failure to send or receive the notice shall not operate to postpone any payment or excuse any default under the confession of judgment. Proof of such mailing shall be made by the certificate of the auditor filed in the auditor's office.\nThe county auditor's statement and county treasurer's receipt issued for payment of a deferred installment, as herein provided for, shall not read for any specific year's taxes, but shall read for partial or full release of judgment, as the case may be, and shall show the year that such judgment was entered. In distributing the taxes collected in this manner, the county auditor shall apply the same in the inverse order to that in which such taxes were levied. All penalties and interest collected under the provisions of this section shall be apportioned by the county auditor in accordance with section 276.131. A duplicate treasurer's receipt for payment of a deferred installment, as hereinafter provided, shall be delivered to the court administrator of the district court, and the court administrator of the district court shall credit the amount so paid upon the judgment entered.\nThe party or parties making such confession of judgment shall pay the county auditor a fee as set by the county board to defray the costs of processing the confession of judgment and making the annual billings required. Fees as set by the county board shall be in lieu of the fees provided for in section 357.021 and shall be processed by the county and credited to the general revenue fund of the county.\nThis section shall not apply to any parcel of land which has become or hereafter may become the absolute property of the state in fee or in trust under the provisions of any law declaring a forfeiture of lands to the state for taxes. Failure to make any payment required by this confessed judgment within 60 days from the date on which payment was due shall constitute a default. In the event of default occurring in the payments to be made under any confessed judgment entered pursuant hereto, the interest waived under the terms of subdivision 5 shall be reinstated and the lands described in such confessed judgment shall thereupon be subject to forfeiture according to the provisions of law applicable thereto.\nNot more than two confessions of judgment and agreement to pay in installments under this section affecting the same taxes or any portion thereof may be made by or on behalf of any owner of any particular right, title, interest in, or lien upon, any given parcel of land, or the owner's heirs, representatives, or assigns.\nThis section shall not apply in cases where the redemption period has been shortened under sections 281.173 and 281.174.",
	"repealed": false
}