{
	"id": "138.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.35",
	"title": "138.35 STATE ARCHAEOLOGIST.",
	"text": "The state archaeologist shall be a qualified professional archaeologist appointed by the commissioner of administration in consultation with the Executive Council of the Minnesota Historical Society, the Indian Affairs Council, and other interested parties to perform the duties in sections 138.31 to 138.42.\nThe commissioner of administration shall provide the state archaeologist with necessary administrative services. State agencies shall provide the state archaeologist upon request with advisory staff services on matters relating to the duties and jurisdiction of the state archaeologist. The state archaeologist shall hire staff and maintain offices as necessary to perform the duties in sections 138.31 to 138.42.\nThe state archaeologist may contract with the federal government, local governmental units, other states, the university and other educational institutions, and private persons or organizations as necessary in the performance of the duties in sections 138.31 to 138.42. Contracts made under this section for professional services shall not be subject to chapter 16C, as it relates to competitive bidding. The state archaeologist may recruit, train, and accept, without regard to personnel laws or rules, the services of individuals as volunteers for or in aid of performance of the state archaeologist's duties, and may provide for the incidental expenses of volunteers, such as transportation, lodging, and subsistence. The state archaeologist may apply for, receive, and expend grants and gifts of money consistent with the powers and duties in sections 138.31 to 138.42. Any money so received is appropriated for the purpose for which it was granted.\nThe duties of the state archaeologist shall include the following:\n(1) to sponsor, engage in, and direct fundamental research into the archaeology of this state and to encourage and coordinate archaeological research and investigation undertaken within the state;\n(2) to cooperate with other agencies of the state which may have authority in areas where state sites are located, or which may have the responsibility for marking state sites, or arranging for their being viewed by the public;\n(3) to protect to the extent possible and to encourage the preservation of archaeological sites located on privately owned property;\n(4) to retrieve and protect objects of archaeological significance discovered by field archaeology on state sites or discovered during the course of any public construction or demolition work and, to the extent possible, those discovered during the course of any other construction or demolition work;\n(5) to obtain for the state other objects of archaeological significance, and data relating thereto;\n(6) to cooperate with the historical society, the university, and other custodians to preserve objects of archaeological significance, together with the data relating thereto;\n(7) to disseminate archaeological facts through the publication of reports of archaeological research conducted within the state;\n(8) to approve licensing of qualified professional archaeologists to engage in field archaeology on state sites, as provided in section 138.36; and\n(9) to otherwise carry out and enforce sections 138.31 to 138.42.\n[Repealed, 1997 c 202 art 2 s 38,64]",
	"repealed": false
}