{
	"id": "403.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.02",
	"title": "403.02 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n[Renumbered subd 16]\n[Renumbered subd 14]\n[Renumbered subd 18]\n[Renumbered subd 19]\n[Renumbered subd 17]\n\"Automatic location identification\" means the process of electronically identifying and displaying the name of the subscriber and the location, where available, of the calling telephone number to a person answering a 911 emergency call.\n[Renumbered subd 15]\n[Renumbered subd 13]\n\"Callback number\" means a number used by the public safety answering point to recontact the location from which the 911 call was placed.\n\"Commissioner\" means the commissioner of public safety.\n[Renumbered subd 20]\n\"Emergency location identification number\" means a valid North American numbering plan format telephone number, assigned to the multiline telephone system operator by the appropriate authority, that is used to route the call to a public safety answering point and is used to retrieve the automatic location identification for the public safety answering point.\n\"Emergency response location\" means a location to which a 911 emergency response team may be dispatched. The location must be specific enough to provide a reasonable opportunity for the emergency response team to locate a caller anywhere within it.\n[Renumbered subd 21]\n\"Enhanced 911 service\" means the use of automatic location identification or local location identification as part of local 911 service provided by an enhanced 911 system consisting of a common 911 network and database and customer data and network components connecting to the common 911 network and database.\n\"Governmental agency\" means any unit of local government or special purpose district located in whole or in part within this state that provides or has authority to provide firefighting, police, ambulance, medical, or other emergency services.\nMS 2012 [Repealed, 2014 c 212 art 2 s 5]\n\"Metropolitan area\" means the counties of Anoka, Carver, Chisago, Dakota, Hennepin, Isanti, Ramsey, Scott, Sherburne, and Washington.\n\"Multiline telephone system\" means a private telephone system comprised of common control units, telephones, and control hardware and software that share a common interface to the public switched telephone network. This includes network and premises-based systems and systems owned or leased by governmental agencies and nonprofit entities, as well as for-profit businesses.\n\"911 emergency telecommunications service provider\" means a telecommunications service provider or other entity, determined by the commissioner to be capable of providing effective and efficient components of the 911 system, that provides all or portions of the network and database for automatically selectively routing 911 calls to the public safety answering point serving the caller's jurisdiction.\n\"911 service\" means a telecommunications service that automatically connects a person dialing the digits 911 to an established public safety answering point. 911 service includes:\n(1) customer data and network components connecting to the common 911 network and database;\n(2) common 911 network and database equipment, as appropriate, for automatically selectively routing 911 calls to the public safety answering point serving the caller's jurisdiction; and\n(3) provision of automatic location identification if the public safety answering point has the capability of providing that service.\nMS 2020 [Renumbered subd 16b]\nMS 2020 [Renumbered subd 17d]\n\"911 telecommunicator\" means a person employed by a public safety answering point, an emergency medical dispatch service provider, or both, who is qualified to answer incoming emergency telephone calls or provide for the appropriate emergency response either directly or through communication with the appropriate public safety answering point.\n\"Prepaid wireless telecommunications service\" means a wireless telecommunications service that allows the caller to dial 911 to access the 911 system, which service must be paid for in advance and is:\n(1) sold in predetermined units or dollars of which the number declines with use in a known amount; or\n(2) provides unlimited use for a predetermined time period.\nThe inclusion of nontelecommunications services, including the download of digital products delivered electronically, content, and ancillary services, with a prepaid wireless telecommunications service does not preclude that service from being considered a prepaid wireless telecommunications service under this chapter.\n\"Public safety agency\" means a functional division of a public agency which provides firefighting, police, medical, or other emergency services, or a private entity which provides emergency medical or ambulance services.\n\"Public safety answering point\" means a communications facility operated on a 24-hour basis which first receives 911 calls from persons in a 911 service area and which may, as appropriate, directly dispatch public safety services or extend, transfer, or relay 911 calls to appropriate public safety agencies.\n\"Secondary public safety answering point\" means a communications facility that: (1) is operated on a 24-hour basis, in which a minimum of three public safety answering points (PSAPs) route calls for postdispatch or prearrival instructions; (2) receives calls directly from medical facilities to reduce call volume at the PSAPs; and (3) is able to receive 911 calls routed to it from a PSAP when the PSAP is unable to receive or answer 911 calls.\n\"Shared residential multiline telephone service\" means the use of a multiline telephone system to provide service to residential facilities. For purposes of this subdivision, \"residential facilities\" means both single-family and multifamily facilities including extended care facilities and dormitories.\n\"Wire-line telecommunications service provider\" means a person, firm, association, corporation, or other legal entity, however organized, or combination of them, authorized by state or federal regulatory agencies to furnish telecommunications service, including local service, over wire-line facilities.\n\"Wireless telecommunications service\" means a commercial mobile radio service, as that term is defined in Code of Federal Regulations, title 47, section 20.3, including all broadband personal communication services, wireless radio telephone services, and geographic area specialized mobile radio licensees, that offer real-time, two-way voice service interconnected with the public switched telephone network.\n\"Wireless telecommunications service provider\" means a provider of wireless telecommunications service.\n[Renumbered subd 9a]\n[Renumbered subd 11a]\n[Renumbered subd 11b]\n[Renumbered subd 16a]\n[Renumbered subd 19b]",
	"repealed": false
}