{
	"id": "306.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.16",
	"title": "306.16 TITLE TO BURIAL LOTS REGAINED BY ASSOCIATION; PROCEDURE.",
	"text": "If a cemetery association organized under state law or a public cemetery operated by a municipality or other entity has before March 1, 1906, conveyed to a person the right of burial in any platted lot or designated piece of ground within the cemetery, and the deed or conveyance from the cemetery provides that the lot is held subject to the rules, bylaws, and regulations of the cemetery and the deed or the rules, bylaws, or regulations further provide for the payment of an annual charge for the care, upkeep, and maintenance of the lot, and the owner of the lot named in the deed or conveyance does not pay the annual charge for a period of ten successive years, the cemetery association or municipally-owned cemetery may reinvest itself with the title to the part of the cemetery lot not used for burial purposes, in the manner hereinafter set forth.\nThe association or municipally owned cemetery may serve upon the owner of the lot, in the manner prescribed by law for the service of a summons in a civil action, a notice specifying the amount unpaid for care of the lot, and specifying a time within which the amount must be paid to the secretary of the association or the proper officer of the municipally-owned cemetery, which shall not be less than 30 days from the date of the service of the notice. The notice must also provide that if the owner of the lot fails to pay the amount within the specified time, the association or municipally-owned cemetery will take the necessary steps to reinvest itself with the title to the part of the cemetery lot not actually used for burial purposes. If the owner of the lot fails to pay the amount within the time specified in the notice, the board of trustees of the cemetery may, by resolution adopted at any regular meeting of the board of trustees, set forth the failure to pay the charges for lot care, the service of the notice, and declare the portion of the lot unused for burial purposes, describing it by metes and bounds in the resolution, to be the property of the association or the municipally owned cemetery.\nIf the return of the sheriff of the county in which the cemetery is located shows that the owner of the lot is not a resident of the county and cannot be found in it, then the association or public cemetery may have the notice published in a legal newspaper within the county for the period of three weeks. The notice shall specify a time for payment, at least 30 days after the completed service of the notice by publication. After the expiration of the time specified in the notice, the board of trustees may adopt the resolution provided in subdivision 2 and reinvest the association or municipality with the title to the part of the cemetery lot unused for burial purposes.",
	"repealed": false
}