{
	"id": "179.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.01",
	"title": "179.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the terms defined in this section have the meanings given them for purposes of sections 179.01 to 179.17.\n\"Person\" includes individuals, partnerships, associations, corporations, trustees, and receivers.\n\"Employer\" includes all persons employing others and all persons acting in the interest of an employer, but does not include the state, or any political or governmental subdivision thereof, nor any person subject to the Federal Railway Labor Act, as amended from time to time, nor the state or any political or governmental subdivision thereof except when used in section 179.13.\n\"Employee\" includes, in addition to the accepted definition of the word, any employee whose work has ceased because of any unfair labor practice, as defined in section 179.12, on the part of the employer or because of any current labor dispute and who has not obtained other regular and substantially equivalent employment, but does not include any individuals employed in agricultural labor or by a parent or spouse or in domestic service of any person at the person's own home.\n\"Representative of employees\" means a labor organization or one or more individuals selected by a group of employees as provided in section 179.16.\n\"Labor organization\" means any organization of employees which exists for the purpose, in whole or in part, of collective bargaining or of dealing with employers concerning grievances or terms or conditions of employment.\n\"Labor dispute\" includes any controversy concerning employment, tenure or conditions or terms of employment or concerning the association or right of representation of persons in negotiating, fixing, maintaining, changing, or seeking to arrange terms, tenure, or other conditions of employment, regardless of whether or not the relationship of employer and employee exists as to the disputants.\n\"Strike\" means the temporary stoppage of work by the concerted action of two or more employees as a result of a labor dispute.\n\"Lockout\" means the refusal of the employer to furnish work to employees as a result of a labor dispute.\n\"Commission\" means the commission of three members which may be appointed by the governor to conduct hearings under this chapter.\n\"Unfair labor practice\" means an unfair labor practice defined in sections 179.11 and 179.12.\n\"Competent evidence\" means evidence admissible in a court of equity and such other evidence other than hearsay as is relevant and material to the issue and is of such character that it would be accepted by reasonable persons as worthy of belief.\n\"Agricultural products\" includes, but is not restricted to, horticultural, viticultural, dairy, livestock, poultry, bee, and any farm products.\n\"Processor\" means the person who first processes or prepares agricultural products, or manufactures products therefrom, for sale after receipt thereof from the producer.\n\"Marketing organization\" means any organization of producers or processors organized to engage in any activity in connection with the marketing or selling of agricultural products or with the harvesting, preserving, drying, processing, canning, packing, grading, storing, handling, shipping or utilization thereof, or the manufacturing or marketing of the by-products thereof, or in connection with the manufacturing, selling or supply of machinery, equipment, or supplies for their members or patrons.\n(a) \"Professional strikebreaker\" means any person who:\n(1) makes an offer to an employer at whose place of business a labor dispute is presently in progress to work as a replacement for an employee or employees involved in such labor dispute; and\n(2) during a period of five years immediately preceding such offer, has, on more than one occasion, made an offer to employers to work as a temporary employee to personally replace employees involved in labor disputes.\n(b) For the purposes of this subdivision:\n(1) \"work\" means the rendering of services for wages or other consideration; and\n(2) \"offer\" includes arrangements made for or on behalf of employers by any person.",
	"repealed": false
}