{
	"id": "103B.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.251",
	"title": "103B.251 CAPITAL IMPROVEMENTS BY WATERSHED MANAGEMENT ORGANIZATIONS.",
	"text": "The authority provided to watershed districts in this section is in addition to the authority provided in chapter 103D. A watershed management organization which has adopted a watershed plan in accordance with section 103B.231 may certify for payment by the county as provided in this section all or any part of the cost of a capital improvement contained in the capital improvement program of the plan.\nA copy of the plan for the improvement shall be forwarded to the county board.\n(a) The organization shall then hold a public hearing on the proposed improvement, following publication once each week for two successive weeks before the date of the hearing in a legal newspaper published in the county or counties in which a part or all of the affected waters and lands are located. The last publication shall occur not more than 30 days nor less than ten days before the hearing.\n(b) The notice shall state the time and place of hearing, the general nature of the proposed improvement, the estimated cost, and the method by which the cost of the improvement is to be paid, including the cost to be allocated to each county or minor watershed unit under subdivision 5.\n(c) At least ten days before the hearing, notice by mail shall be given to the counties and to each home rule charter or statutory city or town located wholly or partly within the territory of the watershed management organization.\n(d) Failure to give mailed notice or defects in the notice shall not invalidate the proceedings.\nAt the time and place specified in the notice the organization shall hear all parties interested in the proposed improvement. If upon full hearing the organization finds that the improvement will be conducive to public health and promote the general welfare, and is in compliance with sections 103B.205 to 103B.255 and the plan adopted pursuant to section 103B.231, it shall make findings accordingly, determine the cost of the improvement, and certify the cost before October 1 to the county or counties for payment.\nIf the territory of the watershed management organization extends into more than one county, the cost of the improvement shall be certified to the respective county boards in the proportions prescribed in the capital improvement program of the organization. The certification of the watershed management organization may apportion the cost among some or all of the subwatershed units in the watershed and for this purpose may require the establishment of more than one tax district in the watershed.\nEach county receiving certifications for payment from watershed management organizations under this section shall promptly after September 30 of each year provide funds to meet its proportionate share of the cost of the improvements as shown in the certifications by organizations received during the prior 12 months. In an emergency and after receipt of certification the county shall provide funds at other times. When an organization anticipates an emergency it shall promptly inform the county and provide it with appropriate information.\nIn order to make the payment required by subdivision 6, the county board of each county may issue general obligation bonds of the county in the amount necessary to pay all or part of the cost of projects certified to the county board or to refund general obligation bonds issued for this purpose. The bonds shall be sold, issued, and secured in accordance with the provisions of chapter 475 for general obligation bonds, except as otherwise provided in this subdivision. No election shall be required.\n(a) For the payment of principal and interest on the bonds issued under subdivision 7 and the payment required under subdivision 6, the county shall irrevocably pledge and appropriate the proceeds of a tax levied on all taxable property located within the territory of the watershed management organization or subwatershed unit for which the bonds are issued. Each year until the reserve for payment of the bonds is sufficient to retire the bonds, the county shall levy on all taxable property in the territory of the organization or unit, without respect to any statutory or other limitation on taxes, an amount of taxes sufficient to pay principal and interest on the bonds and to restore any deficiencies in reserves required to be maintained for payment of the bonds.\n(b) The tax levied on rural towns other than urban towns may not exceed 0.02418 percent of estimated market value, unless approved by resolution of the town electors.\n(c) If at any time the amounts available from the levy on property in the territory of the organization are insufficient to pay principal and interest on the bonds when due, the county shall make payment from any available funds in the county treasury.\n(d) The amount of any taxes which are required to be levied outside of the territory of the watershed management organization or unit or taken from the general funds of the county to pay principal or interest on the bonds shall be reimbursed to the county from taxes levied within the territory of the watershed management organization or unit.\nFor the purpose of creating a maintenance fund to be used for normal and routine maintenance of a work of improvement constructed in whole or part with money provided by the county pursuant to subdivision 6, the board of managers of a watershed district, with the approval of the county, may impose an ad valorem levy on all property located within the territory of the watershed district or subwatershed unit. The levy shall be certified, levied, collected, and distributed as provided in sections 103D.915 and 103D.921, and shall be in addition to any other money levied and distributed to the district. The proceeds of the levy shall be deposited in a separate maintenance and repair account to be used only for the purpose for which the levy was made.",
	"repealed": false
}