{
	"id": "149A.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.95",
	"title": "149A.95 CREMATORIES AND CREMATION.",
	"text": "No person shall cremate a dead human body or cause any dead human body to be cremated in this state without being licensed by the commissioner of health.\nAny building to be used as a crematory must comply with all applicable local and state building codes, zoning laws and ordinances, and environmental standards. A crematory must have, on site, a human cremation system approved by the commissioner, a motorized mechanical device for processing cremated remains and must have, in the building, a holding facility for the retention of dead human bodies awaiting cremation. The holding facility must be secure from access by anyone except the authorized personnel of the crematory, preserve the dignity of the remains, and protect the health and safety of the crematory personnel.\nA licensed crematory may employ unlicensed personnel, provided that all applicable provisions of this chapter are followed. It is the duty of the licensed crematory to provide proper training for all unlicensed personnel and the licensed crematory shall be strictly accountable for compliance with this chapter and other applicable state and federal regulations regarding occupational and workplace health and safety.\nNo crematory shall cremate or cause to be cremated any dead human body or identifiable body part without receiving written authorization to do so from the person or persons who have the legal right to control disposition as described in section 149A.80 or the person's legal designee. The written authorization must include:\n(1) the name of the deceased and the date of death;\n(2) a statement authorizing the crematory to cremate the body;\n(3) the name, address, relationship to the deceased, and signature of the person or persons with legal right to control final disposition or a legal designee;\n(4) certification that the body does not contain any implanted mechanical or radioactive device, such as a heart pacemaker, that may create a hazard when placed in the cremation chamber;\n(5) authorization to remove the body from the container in which it was delivered, if that container is not appropriate for cremation, and to place the body in an appropriate cremation container and directions for the disposition of the original container;\n(6) authorization to open the cremation chamber and reposition the body to facilitate a thorough cremation and to remove from the cremation chamber and separate from the cremated remains, any noncombustible materials or items;\n(7) directions for the disposition of any noncombustible materials or items recovered from the cremation chamber;\n(8) acknowledgment that the cremated remains will be mechanically reduced to a granulated appearance and placed in an appropriate container and authorization to place any cremated remains that a selected urn or container will not accommodate into a temporary container;\n(9) acknowledgment that, even with the exercise of reasonable care, it is not possible to recover all particles of the cremated remains and that some particles may inadvertently become commingled with disintegrated chamber material and particles of other cremated remains that remain in the cremation chamber or other mechanical devices used to process the cremated remains; and\n(10) directions for the ultimate disposition of the cremated remains.\nA licensed crematory acting in good faith, with reasonable reliance upon an authorization to cremate, pursuant to an authorization to cremate, and in an otherwise lawful manner shall be held harmless from civil liability and criminal prosecution for any actions taken by the crematory.\nNo dead human body shall be accepted for final disposition by cremation unless encased in an appropriate cremation container or wrapped in an impermeable sheet or pouch and placed on a tray rigid enough for handling with ease, accompanied by a disposition permit issued pursuant to section 149A.93, subdivision 3, including a photocopy of the completed death record or a signed release authorizing cremation of the body received from the coroner or medical examiner, and accompanied by a cremation authorization that complies with subdivision 4. A crematory shall refuse to accept delivery of a cremation container where there is:\n(1) evidence of leakage of fluids from the cremation container;\n(2) a known dispute concerning cremation of the body delivered;\n(3) a reasonable basis for questioning any of the representations made on the written authorization to cremate; or\n(4) any other lawful reason.\nA dead human body must be cremated within 24 hours of the crematory accepting legal and physical custody of the body.\nAll crematory employees handling cremation containers for dead human bodies shall use universal precautions and otherwise exercise all reasonable precautions to minimize the risk of transmitting any communicable disease from the body. No dead human body shall be removed from the container in which it is delivered to the crematory without express written authorization of the person or persons with legal right to control the disposition and only by a licensed mortician. If, after accepting delivery of a body for cremation, it is discovered that the body contains an implanted mechanical or radioactive device, that device must be removed from the body by a licensed mortician or physician prior to cremation.\nAll licensed crematories shall develop, implement, and maintain an identification procedure whereby dead human bodies can be identified from the time the crematory accepts delivery of the remains until the cremated remains are released to an authorized party. After cremation, an identifying disk, tab, or other permanent label shall be placed within the cremated remains container before the cremated remains are released from the crematory. Each identification disk, tab, or label shall have a number that shall be recorded on all paperwork regarding the decedent. This procedure shall be designed to reasonably ensure that the proper body is cremated and that the cremated remains are returned to the appropriate party.\nA licensed crematory shall knowingly cremate only dead human bodies or human remains in a cremation chamber, along with the cremation container and the sheet or pouch used for disease control.\nThe final disposition of dead human bodies by cremation shall be done in privacy. Unless there is written authorization from the person with the legal right to control the disposition, only authorized crematory personnel shall be permitted in the cremation area while any dead human body is in the cremation area awaiting cremation, in the cremation chamber, being removed from the cremation chamber, or being processed and placed in a cremated remains container.\nExcept with the express written permission of the person with legal right to control the disposition, no crematory shall cremate more than one dead human body at the same time and in the same cremation chamber, or introduce a second dead human body into a cremation chamber until reasonable efforts have been employed to remove all fragments of the preceding cremated remains, or cremate a dead human body and other human remains at the same time and in the same cremation chamber. This section does not apply where commingling of human remains during cremation is otherwise provided by law. The fact that there is incidental and unavoidable residue in the cremation chamber used in a prior cremation is not a violation of this subdivision.\nUpon completion of the heat and flame reduction process, reasonable efforts shall be made to remove from the cremation chamber all of the recoverable cremated human remains and noncombustible materials or items. If possible, the noncombustible materials or items shall be separated from the cremated human remains and disposed of, in any lawful manner, by the crematory. The cremated human remains shall be placed in an appropriate container to be transported to the processing area.\nExcept with the express written permission of the person with legal right to control the final disposition or otherwise provided by law, no crematory shall mechanically process the cremated human remains of more than one body at a time in the same mechanical processor, or introduce the cremated human remains of a second body into a mechanical processor until processing of any preceding cremated human remains has been terminated and reasonable efforts have been employed to remove all fragments of the preceding cremated remains. The fact that there is incidental and unavoidable residue in the mechanical processor or any container used in a prior cremation is not a violation of this provision.\nThe cremated human remains shall be reduced by a motorized mechanical device to a granulated appearance appropriate for final disposition and placed in a cremated remains container along with the appropriate identifying disk, tab, or permanent label.\nIf a cremated remains container is of insufficient capacity to accommodate all cremated remains of a given dead human body, subject to directives provided in the written authorization to cremate, the crematory shall place the excess cremated remains in a secondary cremated remains container and attach the second container, in a manner so as not to be easily detached through incidental contact, to the primary cremated remains container. The secondary container shall contain a duplicate of the identification disk, tab, or permanent label that was placed in the primary container and all paperwork regarding the given body shall include a notation that the cremated remains were placed in two containers.\nNo cremated remains shall be disposed of or scattered in a manner or in a location where the cremated remains are commingled with those of another person without the express written permission of the person with the legal right to control disposition or as otherwise provided by law. This subdivision does not apply to the burial of cremated remains at sea from individual containers, to the scattering or burial of cremated remains in a dedicated cemetery, to the disposal in a dedicated cemetery of accumulated residue removed from a cremation chamber or other cremation equipment, to the inurnment of members of the same family in a common container designed for the cremated remains of more than one body, or to the inurnment in a container or interment in a space that has been previously designated, at the time of sale or purchase, as being intended for the inurnment or interment of the cremated remains of more than one person.\nEvery crematory shall provide for the removal and disposition in a dedicated cemetery of any accumulated residue from any cremation chamber, mechanical processor, container, or other equipment used in cremation. Disposition of accumulated residue shall be in accord with the regulations of the dedicated cemetery and any applicable local ordinances.\nFollowing completion of the cremation, the inurned cremated remains shall be released according to the instructions given on the written authorization to cremate. If the cremated remains are to be shipped, they must be securely packaged and transported by a method which has an internal tracing system available and which provides for a receipt signed by the person accepting delivery. Where there is a dispute over release or disposition of the cremated remains, a crematory may deposit the cremated remains with a court of competent jurisdiction pending resolution of the dispute or retain the cremated remains until the person with the legal right to control disposition presents satisfactory indication that the dispute is resolved.\nIf, after 30 calendar days following the inurnment, the cremated remains are not claimed or disposed of according to the written authorization to cremate, the crematory or funeral establishment shall give written notice, by certified mail, to the person with the legal right to control the final disposition or a legal designee, that the cremated remains are unclaimed and requesting further release directions. Should the cremated remains be unclaimed 120 calendar days following the mailing of the written notification, the crematory or funeral establishment may dispose of the cremated remains in any lawful manner deemed appropriate.\nEvery crematory shall create and maintain on its premises or other business location in Minnesota an accurate record of every cremation provided. The record shall include all of the following information for each cremation:\n(1) the name of the person or funeral establishment delivering the body for cremation;\n(2) the name of the deceased and the identification number assigned to the body;\n(3) the date of acceptance of delivery;\n(4) the names of the cremation chamber and mechanical processor operator;\n(5) the time and date that the body was placed in and removed from the cremation chamber;\n(6) the time and date that processing and inurnment of the cremated remains was completed;\n(7) the time, date, and manner of release of the cremated remains;\n(8) the name and address of the person who signed the authorization to cremate;\n(9) all supporting documentation, including any transit or disposition permits, a photocopy of the death record, and the authorization to cremate; and\n(10) the type of cremation container.\nRecords required under subdivision 20 shall be maintained for a period of three calendar years after the release of the cremated remains. Following this period and subject to any other laws requiring retention of records, the crematory may then place the records in storage or reduce them to microfilm, microfiche, laser disc, or any other method that can produce an accurate reproduction of the original record, for retention for a period of ten calendar years from the date of release of the cremated remains. At the end of this period and subject to any other laws requiring retention of records, the crematory may destroy the records by shredding, incineration, or any other manner that protects the privacy of the individuals identified.",
	"repealed": false
}