{
	"id": "349.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.191",
	"title": "349.191 SALES ON CREDIT.",
	"text": "A manufacturer may not offer or extend to a distributor or linked bingo game provider, and a linked bingo game provider or a distributor may not offer or extend to an organization, credit for a period of more than 30 days for the sale or lease of any gambling equipment. No right of action exists for the collection of any claim based on credit prohibited by this subdivision. The 30-day period allowed by this subdivision begins with the day immediately following the day of invoice and includes all successive days, including Sundays and holidays, to and including the 30th successive day.\n(a) If a distributor or linked bingo game provider does not receive payment in full from an organization within 30 days of the day immediately following the date of the invoice, the distributor or linked bingo game provider must notify the board in writing of the delinquency on the next business day.\n(b) If a distributor or linked bingo game provider who has notified the board under paragraph (a) has not received payment in full from the organization within 60 days of the notification under paragraph (a), the distributor or linked bingo game provider must notify the board of the continuing delinquency.\n(c) On receipt of a notice under paragraph (a), the board shall order all distributors and linked bingo game providers that until further notice from the board, they may sell or lease gambling equipment to the delinquent organizations only on a cash basis with no credit extended. On receipt of a notice under paragraph (b), the board shall order all distributors and linked bingo game providers not to sell or lease any gambling equipment to the delinquent organization.\n(d) No distributor or linked bingo game provider may extend credit or sell or lease gambling equipment to an organization in violation of an order under paragraph (c) until the board has authorized such credit or sale or lease.\n(a) If a manufacturer does not receive payment in full from a distributor or linked bingo game provider within 30 days of the day immediately following the date of invoice, the manufacturer must notify the board in writing of the delinquency on the next business day.\n(b) If a manufacturer who has notified the board under paragraph (a) has not received payment in full from the distributor or linked bingo game provider within 60 days of the notification under paragraph (a), the manufacturer must notify the board of the continuing delinquency.\n(c) On receipt of a notice under paragraph (a), the board shall order all manufacturers that until further notice from the board, they may sell or lease gambling equipment to the delinquent distributor or linked bingo game provider only on a cash basis with no credit extended. On receipt of a notice under paragraph (b), the board shall order all manufacturers not to sell or lease any gambling equipment to the delinquent distributor or linked bingo game provider.\n(d) No manufacturer may extend credit or sell or lease gambling equipment to a distributor or linked bingo game provider in violation of an order under paragraph (c) until the board has authorized such credit or sale or lease.\nAll invoices prepared by a manufacturer, distributor, or linked bingo game provider and presented as part of a credit transaction for the purchase of gambling equipment must clearly bear the words \"Notice: State Law Prohibits the Extension of Credit For This Sale or Lease For More Than 30 Days.\"\nAny rule of the board which requires a manufacturer to report to the board any distributor or linked bingo game provider who is delinquent in payment for gambling equipment must provide that a distributor or linked bingo game provider is subject to the rule if the distributor or linked bingo game provider is more than 30 days delinquent in payment to a manufacturer.\nFor purposes of this section, \"credit\" includes acceptance by a manufacturer, distributor, or linked bingo game provider of a postdated check in payment for gambling equipment.",
	"repealed": false
}