{
	"id": "474A.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/474A.131",
	"title": "474A.131 NOTICE OF ISSUE AND NOTICE OF CARRYFORWARD.",
	"text": "(a) Each issuer with an allocation received under this chapter shall provide a notice of issue to the department on forms provided by the department stating:\n(1) the date of issuance of the bonds;\n(2) the title of the issue;\n(3) the principal amount of the bonds;\n(4) the type of qualified bonds under federal tax law;\n(5) the dollar amount of the bonds issued that were subject to the annual volume cap; and\n(6) for entitlement issuers, whether the allocation is from current year entitlement authority or is from carryforward authority.\nFor obligations that are issued as a part of a series of obligations, a notice must be provided for each series. A penalty of one-half of the amount of the application deposit not to exceed $5,000 shall apply to any issue of obligations for which a notice of issue is not provided to the department within five business days after issuance or before 4:30 p.m. on the last business day in December, whichever occurs first. Within 30 days after receipt of a notice of issue the department shall refund a portion of the application deposit equal to one percent of the amount of the bonding authority actually issued if a one percent application deposit was made, or equal to two percent of the amount of the bonding authority actually issued if a two percent application deposit was made, less any penalty amount.\n(b) If an issuer that receives an allocation under this chapter for a residential rental project issues obligations as provided in this chapter, the commissioner shall refund 50 percent of any application deposit previously paid within 30 days of the issuance of the obligations and the remaining 50 percent will be refunded within 30 days after the date on which:\n(1) final Internal Revenue Service Forms 8609 are provided to the commissioner with respect to preservation projects, 30 percent AMI residential rental projects, 50 percent AMI residential rental projects, 100 percent LIHTC projects, or 20 percent LIHTC projects; or\n(2) the issuer provides a certification and any other reasonable documentation requested by the commissioner evidencing that construction of the project has been completed.\nIf the issuer receives an allocation under this chapter for a residential rental project and fails to issue the bonds within the time permitted by federal law, the application deposit shall be forfeited.\nIf an allocation received under this chapter is used for mortgage credit certificates, a certificate notice must be submitted to the department on forms provided by the department stating the date of the filing of the election not to issue bonds as provided under section 25, paragraph (c), of the Internal Revenue Code and the amount of allocation authority to be used under the program.\nA penalty of one-half of the amount of the application deposit not to exceed $5,000 shall apply to any mortgage credit certificate program for which a certificate notice is not provided to the department within five days of the date of the filing of the election not to issue bonds or before the last Monday in December, whichever occurs first. Within 30 days after receipt of a certificate notice the department shall refund a portion of the application deposit equal to one percent of the amount of the bonding authority to be used for the mortgage credit certificate program, less any penalty amount.\nIf an issuer fails to notify the department before 4:30 p.m. on the last business day in December of the permanent issuance of obligations pursuant to an allocation received for any qualified bond project or issuance of an entitlement allocation, the allocation is canceled and the bonding authority is allocated to the Minnesota Housing Finance Agency for carryforward by the commissioner under section 474A.091, subdivision 6.\nIf an issuer intends to carry forward an allocation received under this chapter, it must notify the department in writing before 4:30 p.m. on the last business day in December. This notice requirement does not apply to the Minnesota Housing Finance Agency for the carryforward of unallocated unified pool balances.\nThe department may not revoke an allocation received under this chapter after receiving a notice of issue or certificate notice from the issuer.",
	"repealed": false
}