{
	"id": "62C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62C.04",
	"title": "62C.04 ORGANIZATION.",
	"text": "Except as otherwise expressly provided, a service plan corporation organized after August 1, 1971 shall be incorporated under and subject to chapter 317A, as it may be amended, and in addition shall have, to the extent provided in its articles of incorporation, all powers and duties provided by Laws 1971, chapter 568 for service plan corporations. A service plan corporation may be incorporated by not less than three legal residents of this state.\nAn existing corporation shall be deemed a service plan corporation under Laws 1971, chapter 568, subject to all of its terms and conditions, shall receive a certificate of authority from the commissioner, and shall not be required to obtain new licenses for its agents and representatives. However, any existing service plan corporation shall, within 30 days after the first annual meeting of the corporation following August 1, 1971, amend its articles and bylaws to the extent necessary to conform to and be governed by Laws 1971, chapter 568 and chapter 317A and file said articles and bylaws for approval and filing in accordance with Laws 1971, chapter 568. If any service plan corporation fails to meet these requirements the commissioner may suspend without a hearing its certificate of authority until the requirements of Laws 1971, chapter 568 have been fully met.\nNo service plan corporation shall include within its name the words \"insurance,\" \"casualty,\" \"surety,\" \"mutual,\" \"indemnity,\" or any other words descriptive of the insurance, casualty, or surety business. No service plan corporation shall have a name, mark or symbol which is the same as, or deceptively similar to, the name of any other domestic corporation.\nA service plan corporation may be organized to provide for a combination of health services and an existing corporation may so provide by amendment of its articles of incorporation, or by merger, consolidation, or joint operating arrangements with another service plan corporation. All such actions taken shall be subject to the provisions of chapter 317A, and to the approval of the commissioner for protection of the public and subscribers. If the commissioner denies approval an appeal may be made to the Ramsey County District Court for review de novo of all matters relevant to the proposed combination.",
	"repealed": false
}