{
	"id": "142B.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.66",
	"title": "142B.66 CHILD CARE CENTER HEALTH AND SAFETY REQUIREMENTS.",
	"text": "(a) Before admitting a child for care, the license holder must obtain documentation of any known allergy from the child's parent or legal guardian or the child's source of medical care. If a child has a known allergy, the license holder must maintain current information about the allergy in the child's record and develop an individual child care program plan as specified in Minnesota Rules, part 9503.0065, subpart 3. The individual child care program plan must include but not be limited to a description of the allergy, specific triggers, avoidance techniques, symptoms of an allergic reaction, and procedures for responding to an allergic reaction, including medication, dosages, and a doctor's contact information.\n(b) The license holder must ensure that each staff person who is responsible for carrying out the individual child care program plan review and follow the plan. Documentation of a staff person's review must be kept on site.\n(c) At least once each calendar year or following any changes made to allergy-related information in the child's record, the license holder must update the child's individual child care program plan and inform each staff person who is responsible for carrying out the individual child care program plan of the change. The license holder must keep on site documentation that a staff person was informed of a change.\n(d) A child's allergy information must be available at all times including on site, when on field trips, or during transportation. A child's food allergy information must be readily available to a staff person in the area where food is prepared and served to the child.\n(e) The license holder must contact the child's parent or legal guardian as soon as possible in any instance of exposure or allergic reaction that requires medication or medical intervention. The license holder must call emergency medical services when epinephrine is administered to a child in the license holder's care.\nThe licensed child care center must comply with the following procedures for safely handling and disposing of bodily fluids:\n(1) surfaces that come in contact with potentially infectious bodily fluids, including blood and vomit, must be cleaned and disinfected according to Minnesota Rules, part 9503.0005, subpart 11;\n(2) blood-contaminated material must be disposed of in a plastic bag with a secure tie;\n(3) sharp items used for a child with special care needs must be disposed of in a \"sharps container.\" The sharps container must be stored out of reach of a child;\n(4) the license holder must have the following bodily fluid disposal supplies in the center: disposable gloves, disposal bags, and eye protection; and\n(5) the license holder must ensure that each staff person follows universal precautions to reduce the risk of spreading infectious disease.\n(a) A licensed child care center must have a written emergency plan for emergencies that require evacuation, sheltering, or other protection of a child, such as fire, natural disaster, intruder, or other threatening situation that may pose a health or safety hazard to a child. The plan must be written on a form developed by the commissioner and must include:\n(1) procedures for an evacuation, relocation, shelter-in-place, or lockdown;\n(2) a designated relocation site and evacuation route;\n(3) procedures for notifying a child's parent or legal guardian of the evacuation, relocation, shelter-in-place, or lockdown, including procedures for reunification with families;\n(4) accommodations for a child with a disability or a chronic medical condition;\n(5) procedures for storing a child's medically necessary medicine that facilitates easy removal during an evacuation or relocation;\n(6) procedures for continuing operations in the period during and after a crisis;\n(7) procedures for communicating with local emergency management officials, law enforcement officials, or other appropriate state or local authorities; and\n(8) accommodations for infants and toddlers.\n(b) The license holder must train staff persons on the emergency plan at orientation, when changes are made to the plan, and at least once each calendar year. Training must be documented in each staff person's personnel file.\n(c) The license holder must conduct drills according to the requirements in Minnesota Rules, part 9503.0110, subpart 3. The date and time of the drills must be documented.\n(d) The license holder must review and update the emergency plan annually. Documentation of the annual emergency plan review shall be maintained in the program's administrative records.\n(e) The license holder must include the emergency plan in the program's policies and procedures as specified under section 142B.10, subdivision 21. The license holder must provide a physical or electronic copy of the emergency plan to the child's parent or legal guardian upon enrollment.\n(f) The relocation site and evacuation route must be posted in a visible place as part of the written procedures for emergencies and accidents in Minnesota Rules, part 9503.0140, subpart 21.\nA license holder must comply with all seat belt and child passenger restraint system requirements under section 169.685.\n(a) A working telephone which is capable of making outgoing calls and receiving incoming calls must be located within the licensed child care center at all times. Staff must have access to a working telephone while providing care and supervision to children in care, even if the care occurs outside of the child care facility. A license holder may use a cellular telephone to meet the requirements of this subdivision.\n(b) If a cellular telephone is used to satisfy the requirements of this subdivision, the cellular telephone must be accessible to staff, be stored in a centrally located area when not in use, and be sufficiently charged for use at all times.",
	"repealed": false
}