{
	"id": "473.504",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.504",
	"title": "473.504 WASTEWATER SERVICES, POWERS.",
	"text": "MS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe council shall have the power to adopt rules relating to the operation of any interceptors or treatment works operated by it, and may provide penalties for the violation thereof not exceeding the maximum which may be specified for a misdemeanor. Any rule prescribing a penalty for violation shall be published at least once in a newspaper having general circulation in the metropolitan area.\nThe council may accept gifts, may apply for and accept grants or loans of money or other property from the United States, the state, or any person for any of its purposes whether for construction, research, or pilot project implementation, may enter into any agreement required in connection therewith, and may hold, use, and dispose of such money or property in accordance with the terms of the gift, grant, loan, or agreement relating thereto.\nThe council may act under the provisions of section 471.59, or any other appropriate law providing for joint or cooperative action between government units.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe council may acquire by purchase, lease, condemnation, gift, or grant, any real or personal property including positive and negative easements and water and air rights, and it may construct, enlarge, improve, replace, repair, maintain, and operate any interceptor or treatment works determined to be necessary or convenient for the collection and disposal of sewage in the metropolitan area. Any local government unit and the commissioners of transportation and natural resources are authorized to convey to or permit the use of any such facilities owned or controlled by it by the council, subject to the rights of the holders of any bonds issued with respect thereto, with or without compensation, without an election or approval by any other government agency. All powers conferred by this subdivision may be exercised both within or without the metropolitan area as may be necessary for the exercise by the council of its powers or the accomplishment of its purposes. The council may hold such property for its purposes, and may lease any such property so far as not needed for its purposes, upon such terms and in such manner as it shall deem advisable. Unless otherwise provided, the right to acquire lands and property rights by condemnation shall be exercised in accordance with chapter 117, and shall apply to any property or interest therein owned by any local government unit; provided, that no such property devoted to an actual public use at the time, or held to be devoted to such use within a reasonable time, shall be so acquired unless a court of competent jurisdiction shall determine that the use proposed by the board is paramount to such use. Except in case of property in actual public use, the council may take possession of any property for which condemnation proceedings have been commenced at any time after the issuance of a court order appointing commissioners for its condemnation.\nThe council may construct or maintain its systems or facilities in, along, on, under, over, or through public streets, bridges, viaducts, and other public rights-of-way without first obtaining a franchise from any local government unit having jurisdiction over them; but such facilities shall be constructed and maintained in accordance with the ordinances and resolutions of any such government unit relating to construction, installation, and maintenance of similar facilities in such public properties and shall not obstruct the public use of such rights-of-way.\nThe council may sell or otherwise dispose of any real or personal property acquired by it which is no longer required for accomplishment of its purposes.\nThe council may contract with the United States or any agency thereof, any state or agency thereof, or any local government unit or governmental agency or subdivision, for the joint use of any facility owned by the council or such entity, for the operation by such entity of any system or facility of the council, or for the performance on the council's behalf of any service, on such terms as may be agreed upon by the contracting parties.",
	"repealed": false
}