{
	"id": "181.217",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.217",
	"title": "181.217 ENFORCEMENT.",
	"text": "Except as provided in section 181.213, subdivision 5, paragraph (b) or (c), the minimum wages and other compensation established by the board in rule as minimum nursing home employment standards shall be the minimum wages and other compensation for nursing home workers or a subgroup of nursing home workers as a matter of state law. Except as provided in section 181.213, subdivision 5, paragraph (b) or (c), it shall be unlawful for a nursing home employer to employ a nursing home worker for lower wages or other compensation than that established as the minimum nursing home employment standards.\nThe commissioner may investigate possible violations of sections 181.214 to 181.217 or of the minimum nursing home employment standards established by the board whenever it has cause to believe that a violation has occurred, either on the basis of a report of a suspected violation or on the basis of any other credible information, including violations found during the course of an investigation.\n(a) One or more nursing home workers may bring a civil action in district court seeking redress for violations of sections 181.211 to 181.217 or of any applicable minimum nursing home employment standards or local minimum nursing home employment standards. Such an action may be filed in the district court of the county where a violation or violations are alleged to have been committed or where the nursing home employer resides, or in any other court of competent jurisdiction, and may represent a class of similarly situated nursing home workers.\n(b) Upon a finding of one or more violations, a nursing home employer shall be liable to each nursing home worker for the full amount of the wages, benefits, and overtime compensation, less any amount the nursing home employer is able to establish was actually paid to each nursing home worker, and for an additional equal amount as liquidated damages. In an action under this subdivision, nursing home workers may seek damages and other appropriate relief provided by section 177.27, subdivision 7, or otherwise provided by law, including reasonable costs, disbursements, witness fees, and attorney fees. A court may also issue an order requiring compliance with sections 181.211 to 181.217 or with the applicable minimum nursing home employment standards or local minimum nursing home employment standards. A nursing home worker found to have experienced retaliation in violation of section 181.216 shall be entitled to back pay and reinstatement to the worker's previous position, wages, benefits, hours, and other conditions of employment.\n(c) An agreement between a nursing home employer and nursing home worker or labor union that fails to meet the minimum standards and requirements in sections 181.211 to 181.217 or established by the board is not a defense to an action brought under this subdivision.",
	"repealed": false
}