{
	"id": "16D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/16D.09",
	"title": "16D.09 UNCOLLECTIBLE DEBTS.",
	"text": "(a) When a debt is determined by a state agency to be uncollectible, the debt may be written off by the state agency from the state agency's financial accounting records and no longer recognized as an account receivable for financial reporting purposes. A debt is considered to be uncollectible when (1) all reasonable collection efforts have been exhausted, (2) the cost of further collection action will exceed the amount recoverable, (3) the debt is legally without merit or cannot be substantiated by evidence, (4) the debtor cannot be located, (5) the available assets or income, current or anticipated, that may be available for payment of the debt are insufficient, (6) the debt has been discharged in bankruptcy, (7) the applicable statute of limitations for collection of the debt has expired, or (8) it is not in the public interest to pursue collection of the debt.\n(b) Uncollectible debt must be reported by the state agency as part of its quarterly reports to the commissioner of management and budget. The basis for the determination of the uncollectibility of the debt must be maintained by the state agency. If an uncollectible debt equals or exceeds $100,000, the agency shall notify the chairs and ranking minority members of the legislative committees with jurisdiction over the state agency's budget at the time the debt is determined to be uncollectible. The information reported shall contain the entity associated with the uncollected debt, the amount of the debt, the revenue type, the reason the debt is considered uncollectible, and the duration the debt has been outstanding. The commissioner of management and budget shall report to the chairs and ranking minority members of the legislative committees with jurisdiction over Minnesota Management and Budget an annual summary of the number and dollar amount of debts determined to be uncollectible during the previous fiscal year by October 31 of each year. Determining that the debt is uncollectible does not cancel the legal obligation of the debtor to pay the debt.\n[Repealed, 2003 c 112 art 1 s 19]",
	"repealed": false
}