{
	"id": "62D.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.18",
	"title": "62D.18 REHABILITATION OR LIQUIDATION OF HEALTH MAINTENANCE ORGANIZATION.",
	"text": "The commissioner of health may apply by verified petition to the district court of Ramsey County or the county in which the principal office of the health maintenance organization is located for an order directing the commissioner of health to rehabilitate or liquidate a health maintenance organization. The rehabilitation or liquidation of a health maintenance organization shall be conducted under the supervision of the commissioner of health under the procedures, and with the powers granted to a rehabilitator or liquidator, in chapter 60B, except to the extent that the nature of health maintenance organizations renders the procedures or powers clearly inappropriate and as provided in this subdivision or in chapter 60B. A health maintenance organization shall be considered an insurance company for the purposes of rehabilitation or liquidation as provided in subdivisions 4, 6, and 7. For health maintenance organizations that will be liquidated on or after August 1, 2020, chapters 60B and 61B apply.\n[Repealed, 1990 c 538 s 32]\n[Repealed, 1990 c 538 s 32]\nThe powers of the rehabilitator include, subject to the approval of the court the power to change premium rates, without the notice requirements of section 62D.07, and the power to amend the terms of provider contracts, and of contracts with participating entities for the provision of administrative, financial, or management services, relating to reimbursement and termination, considering the interests of providers and other contracting participating entities and the continued viability of the health plan.\nIf the court approves a contract amendment that diminishes the compensation of a provider or of a participating entity providing administrative, financial, or management services to the health maintenance organization, the amendment may not be effective for more than 60 days and shall not be renewed or extended.\n[Repealed, 1990 c 538 s 32]\nThe commissioner as rehabilitator shall make every reasonable effort to employ a senior executive from a successful health maintenance organization to serve as special examiner to rehabilitate the health maintenance organization, provided that the individual does not have a conflict of interest. The special examiner shall have all the powers of the rehabilitator granted under this section and section 60B.17.\nThe commissioner of health shall assess against a health maintenance organization not yet in rehabilitation or liquidation a fee sufficient to cover the costs of a special examination. The fee must be deposited in an examination account. Money in the account is appropriated to the commissioner of health to pay for the examinations. If the money in the account is insufficient to pay the initial costs of examinations, the commissioner may use other money appropriated to the commissioner, provided the other appropriation is reimbursed from the examination account when it contains sufficient money. Money from the examination account must be used to pay per diem salaries and expenses of special examiners, including meals, lodging, laundry, transportation, and mileage. The salary of regular employees of the Health Department must not be paid out of the account.",
	"repealed": false
}