{
	"id": "148.6445",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6445",
	"title": "148.6445 FEES.",
	"text": "The initial licensure fee for occupational therapists is $185. The initial licensure fee for occupational therapy assistants is $105.\nThe biennial licensure renewal fee for occupational therapists is $185. The biennial licensure renewal fee for occupational therapy assistants is $105.\nThe fee for a duplicate license is $30.\nThe fee for late submission of a renewal application is $50.\nThe fee for temporary licensure is $75.\nThe fee for limited licensure is $100.\nThe fee for course approval after lapse of licensure is $100.\nThe fee for verification of licensure to other states is $25.\nThe fee for verification of licensure to institutions is $10.\n[Repealed, 1Sp2003 c 14 art 7 s 89]\n(a) All fees are nonrefundable. The board shall only use fees collected under this section for the purposes of administering this chapter. The legislature must not transfer money generated by these fees from the state government special revenue fund to the general fund.\n(b) Licensure fees are for the exclusive use of the board and shall be established by the board not to exceed the nonrefundable amounts in this section.\n(a) The penalty fee for practicing occupational therapy or using protected titles without a current license after the credential has expired and before it is renewed is the amount of the license renewal fee for any part of the first month, plus the license renewal fee for any part of any subsequent month up to 36 months.\n(b) The penalty fee for applicants who engage in the unauthorized practice of occupational therapy or use protected titles before being issued a license is the amount of the license application fee for any part of the first month, plus the license application fee for any part of any subsequent month up to 36 months. This paragraph does not apply to applicants not qualifying for a license who engage in the unauthorized practice of occupational therapy.\n(c) When an occupational therapy practitioner fails to submit a requested continuing education report by the due date with the correct number or type of hours in the correct time period the practitioner must pay either: (1) a $100 penalty fee and complete the missing contact hours within 30 calendar days from the date of the penalty fee notice; or (2) a $100 penalty fee and $20 for each missing contact hour, and complete the missing number of contact hours by the next reporting due date. \"Missing\" means not obtained between the effective and expiration dates of the license.\n(d) Civil penalties and discipline incurred by licensees for conduct described in paragraph (a), (b), or (c) shall be recorded as nondisciplinary penalty fees. For conduct described in paragraph (a) or (b) exceeding six months, payment of a penalty fee does not preclude any disciplinary action reasonably justified by the individual case.",
	"repealed": false
}