{
	"id": "86B.107",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.107",
	"title": "86B.107 REMOVING SUBMERGED VEHICLES FROM STATE WATERS.",
	"text": "(a) For purposes of this section, \"vehicle\" means a motor vehicle as defined in section 97A.015, subdivision 32, or a watercraft as defined in section 86B.005, subdivision 18.\n(b) For purposes of this section, \"owner\" means the registered owner, last registered owner, or legal owner of a vehicle if the vehicle is not registered.\n(a) The owner of a submerged vehicle is responsible for removing the vehicle from waters of the state, unless the vehicle is permitted or otherwise exempt from removal. Removal must be completed within 30 days of the vehicle entering the water or being discovered in the water, unless the owner is notified in writing by the political subdivision having jurisdiction that the removal must be completed sooner. Upon request of the political subdivision the commissioner may extend the 30-day time period for removal.\n(b) The owner of the vehicle shall report that the vehicle is submerged in a body of water. The owner shall report the date and the circumstances surrounding the submergence to the sheriff of the county where the body of water is located within 48 hours of the vehicle entering the water.\n(c) If the vehicle is not removed according to paragraph (a), the political subdivision in whose jurisdiction the lake or watercourse is located shall remove the vehicle. The owner of the vehicle is subject to a civil penalty of not less than twice nor more than five times the costs incurred by the political subdivision to remove, process, and dispose of the vehicle. Civil penalties imposed under this section may be enforced and distributed as provided in section 115A.99.\n(d) The owner of a submerged vehicle is not responsible for removal of the vehicle if the vehicle was used without the owner's knowledge. This includes, but is not limited to, the operation of a vehicle that was under the control of a member of the owner's household. If the driver or operator of the vehicle is known, the driver or operator is responsible for removing the vehicle according to this section.",
	"repealed": false
}