{
	"id": "480A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/480A.02",
	"title": "480A.02 SELECTION OF JUDGES.",
	"text": "Before entering upon the duties of office, each judge shall take and subscribe an oath in the form prescribed by law for judicial officers.\nEach judge shall be elected at the general election for a term of six years, beginning on the first Monday of the January next following the election and until a successor qualifies. Vacancies occurring between general elections shall be filled by appointment, as prescribed in the constitution.\nBy January 1, 1984, one seat on the court shall be designated for each congressional district. Only persons who have resided in that congressional district for at least one year shall be eligible for election or appointment to that seat. A judge who is elected or appointed to a congressional district seat shall continue to be eligible for that seat without regard to any subsequent change of residence. All other seats shall be without restriction as to residence.\nAll judges shall be subject to statewide election, whether they serve in at-large or congressional district seats.\nAfter each reapportionment, the chief judge shall designate a judge for each of the new congressional districts. The chief judge shall first redesignate the incumbent judges serving for the old congressional districts. If only one of them was, at the time of original election or appointment, resident at a place within a new congressional district, that judge shall be designated as serving for that district. If two or more of them were residents at the time of initial election or appointment in places which are within the same new congressional district, the judge whose district was in the opinion of the chief judge most substantially related to the new district shall be designated as serving for the new district and the other shall be designated as serving at large. If there is then any new congressional district for which there is no designated judge, but there is an incumbent at-large judge who was resident within that territory at the time of initial election or appointment, that judge, or the senior of them, if there is more than one, shall be assigned to the district seat. If there then remains any new congressional district for which there is no designated judge, there shall be no judge designated to serve from that district until the next at-large vacancy arising by death, retirement, resignation, or removal, which shall be filled by appointment of a person from that congressional district.\nThe redesignation of judges by reason of reapportionment shall not affect the term of office of any individual judge.\n(a) The salary of a judge of the court of appeals shall be as provided by section 15A.082. Except as provided in paragraph (b), travel expenses shall be paid by the state in the same manner and amount as provided for judges of the district court in section 484.54.\n(b) For any judge of the court of appeals whose permanent place of residence is more than 50 miles from the judge's permanent chambers in St. Paul, in addition to travel expenses provided in paragraph (a), the judge shall be reimbursed for the following expenses during the judge's term of service on the court of appeals:\n(1) housing expenses in an amount prescribed by judicial council policy, but not less than $1,000 per month; and\n(2) mileage for travel from the judge's permanent place of residence to and from the judge's permanent chambers charged at the current United States Internal Revenue Service reimbursement rate.\nReimbursable expenses under this paragraph shall be paid by the state in the same manner as provided for judges of the district court in section 484.54, subdivision 3.\n(c) Paragraph (b) expires June 30, 2019.",
	"repealed": false
}