{
	"id": "546.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/546.27",
	"title": "546.27 DECISION BY THE COURT.",
	"text": "(a) When an issue of fact has been tried by the court, the decision shall be in writing, the facts found and the conclusion of law shall be separately stated, and judgment shall be entered accordingly. Except as provided in paragraph (b), all questions of fact and law, and all motions and matters submitted to a judge for a decision in trial and appellate matters, shall be disposed of and the decision filed with the court administrator within 90 days after such submission, unless sickness or casualty shall prevent, or the time be extended by written consent of the parties. No part of the salary of any judge shall be paid unless the voucher therefor be accompanied by a certificate of the judge that there has been full compliance with the requirements of this section.\n(b) If a hearing has been held on a petition under chapter 260 involving physical or sexual abuse of a child who is alleged to be in need of protection or services or neglected and in foster care, the decision must be filed within 15 days after the matter is submitted to the judge.\nUnless different procedures for ensuring compliance with subdivision 1 are set by the Rules of the Board on Judicial Standards, the procedures in subdivision 2 shall be used.\n(a) The chief judges of the judicial districts and the Board on Judicial Standards shall review the compliance of district judges with the provisions of subdivision 1 as provided in this subdivision. To facilitate this review, the director of the state judicial information system shall provide monthly reports to the chief judges identifying matters that have exceeded 90 days without a disposition. Upon the first 90-day infraction, the director shall notify the chief judge of the judge's district that a judge is not in compliance. The chief judge shall take appropriate action to remedy the infraction. Upon a second 90-day infraction occurring on or before five years from the date of the first infraction by the same judge, the director shall again refer the matter to the chief judge. Within 45 days of the referral, the chief judge shall develop a written plan with the judge to remedy the 90-day infraction and avoid future 90-day infractions and notify the Board on Judicial Standards of the development of the written plan. At a minimum, the written plan must include measures taken to release timely decisions, timelines for substantial compliance, and audit procedures to monitor progress. If at any time the judge fails to follow the written plan, the chief judge shall notify the Board on Judicial Standards for further action. Upon a third 90-day infraction on or before five years from the date of the first 90-day infraction, the chief judge shall notify the Board on Judicial Standards, which shall take appropriate action. This section does not affect the chief judge's duty under the Minnesota Code of Judicial Conduct to take appropriate action in response to violations of the code. Should the board receive a complaint alleging a serious violation of this section, the board's authority to review and act shall not be limited.\n(b) If an infraction under paragraph (a) involves the chief judge, the notification must be made to the assistant chief judge who shall take on the responsibilities that would otherwise be the responsibility of the chief judge under paragraph (a).",
	"repealed": false
}