{
	"id": "327C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.07",
	"title": "327C.07 IN PARK SALES.",
	"text": "Except as otherwise provided in this section, a resident has the right to sell a home through an in park sale. The park owner may not charge a fee for allowing the resident to exercise this right, except to charge a fee of up to $25 for processing a prospective buyer's tenancy application. If the park owner is licensed as a dealer, the park owner may agree in writing to broker the in park sale of a resident's home. The park owner may not require a resident to use the park owner's services as a broker. The park owner may not give preferential treatment to applications for tenancy from people seeking to buy homes whose in park sale is being brokered by the park owner.\nAny in park sale is subject to the park owner's approval of the buyer as a resident. A park owner may not deny a prospective buyer approval as a resident unless:\n(1) the park owner has specified in writing the procedures and criteria used to evaluate the creditworthiness and suitability as a resident of individuals seeking to buy homes offered for in park sale;\n(2) the written disclosure required by clause (1) is included with the rental application and is available at no charge to residents, prospective buyers, and their agents;\n(3) the park owner is available to the prospective buyer at reasonable times if the park owner requires the prospective buyer to apply or be interviewed in person;\n(4) all the specified procedures and criteria are reasonable and applied uniformly;\n(5) in evaluating a prospective buyer, the park owner does not use any stricter standards than it uses for evaluating other prospective residents;\n(6) the park owner does not deny tenancy to a prospective buyer for any reason prohibited by federal, state or local law;\n(7) within 14 days of receiving a completed application form, the park owner makes a decision or gives the prospective buyer and the seller a written explanation of the specific reasons for the delay and makes a decision as soon as practicable;\n(8) if the park owner denies tenancy to a prospective buyer, the park owner gives the prospective buyer a written explanation of the denial within three days of receiving a written request for an explanation; and\n(9) the decision to deny tenancy is reasonable in light of the criteria set forth in section 327C.015, subdivision 12.\nWhen the prospective buyer of an in park sale seeks approval as a resident, the park owner may require the prospective buyer to submit information reasonably necessary to determine whether the prospective buyer satisfies the park's criteria as stated by the park in its rules. The required information may include the purchase price of the home and the amount of monthly payments on the home, together with any documents reasonably necessary to verify the information. The park owner may inquire into the creditworthiness of the prospective buyer but may not require the submission of any information concerning the business relationship between the seller and a dealer acting for the seller.\nMS 2008 [Repealed, 2010 c 347 art 3 s 75]\nBefore approving an in park sale, the park owner may inspect the resident's lot and the exterior of the resident's manufactured home to see whether they comply with reasonable and preexisting rules applicable to the resident and relating to maintenance. The park owner may not charge any fee for this inspection. As a condition to approving an in park sale, the park owner may require that the resident or the prospective buyer take whatever action is necessary to bring the lot or the home exterior into compliance with preexisting maintenance rules applicable to the resident, and may require that any lot rent and other charges due to the park be paid. The park owner may require the prospective buyer to agree to rules different from those applicable to the resident, but the park owner may not require the prospective buyer or the resident to comply with any rule adopted or amended after the resident entered into the rental agreement which would:\n(1) significantly increase the difficulty or time involved in selling the resident's home;\n(2) significantly decrease the price at which the resident's home can be sold; or\n(3) involve any other significant cost for either the resident or the buyer, except for costs involved in doing any work necessary to bring the home or lot into compliance with preexisting maintenance rules applicable to the resident.\nProvided that if a part of the resident's home, shed, or other appurtenance has become so dilapidated that repair is impractical and total replacement is necessary, the park owner may require the resident or prospective buyer to make the replacement in conformity with a generally applicable rule adopted after the resident initially entered into a rental agreement with the park owner.\nIf a home is being offered for in park sale, the home may remain vacant for 90 days, or longer if not prohibited by park rules. The park owner may not impose any additional fees or requirements on the owner of a vacant home being offered for in park sale, but the rent must be paid on time and the home and the lot must be maintained as required by the rules.\nAny contract for an in park sale which is not expressly made contingent on the park owner's approval of the buyer as a resident is voidable at the instance of the buyer if the park owner's approval is denied. Any person who sells, or signs a contract purporting to sell, a home located in a park while representing, either directly or indirectly, that the buyer can maintain the home in the park, and who does not inform the buyer in writing that the sale is contingent on the park owner's approval of the buyer as a resident has violated section 325F.69, subdivision 1.\nAny holder of a security interest who repossesses a manufactured home located in a park has the same rights as a resident to sell the home through an in park sale if:\n(1) as soon as the secured party either accepts voluntary repossession or takes any action pursuant to sections 327.61 to 327.67, the secured party notifies the park owner that the home has been or is being repossessed;\n(2) at the time the park owner receives the notice, the park owner has not already recovered possession of the lot through an eviction proceeding;\n(3) the secured party pays any past due lot rent not to exceed three months rent;\n(4) the secured party makes monthly lot rent payments until a buyer of the repossessed home has been approved by the park owner as a resident. A secured party's liability for past due rent under this subdivision does not include late fees or other charges; and\n(5) the secured party complies with all park rules relating to lot and home maintenance.\nA secured party who is offering a home for in park sale under this subdivision is subject to eviction on the same grounds as a resident.\nMS 2008 [Repealed, 2010 c 347 art 3 s 75]",
	"repealed": false
}