{
	"id": "142A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.06",
	"title": "142A.06 ADMINISTRATION OF FEDERAL GRANTS-IN-AID.",
	"text": "If, when and during such time as grants-in-aid are provided by the federal government for relief of the poor and accepted by this state, such aid shall be administered pursuant to and in accordance with rules promulgated and adopted by the commissioner of children, youth, and families; and during such time any provision of Minnesota Statutes 1945, chapter 261, as amended by Laws 1947, chapter 546, of Minnesota Statutes 1945, chapter 262, and of Minnesota Statutes 1945, chapter 263, in conflict with such rules shall be and remain, to the extent of such conflict, inoperative and suspended.\nGrants-in-aid received from the federal government for any welfare, assistance or relief program or for administration under the jurisdiction of the commissioner shall, in the first instance, be credited to a federal grant fund and shall be transferred therefrom to the credit of the commissioner in the appropriate account upon certification of the commissioner that the amounts so requested to be transferred have been earned or are required for the purposes and programs intended. Moneys received by the federal grant fund need not be budgeted as such, provided transfers from the fund are budgeted for allotment purposes in the appropriate appropriations.\nThe commissioner shall negotiate with the federal government, or any agency, bureau, or department thereof, for the purpose of securing or obtaining any grants or aids. Any grants or aids thus secured or received are appropriated to the commissioner and made available for the uses and purposes for which they were received but shall be used to reduce the direct appropriations provided by law unless federal law prohibits such action or unless the commissioner obtains approval of the governor who shall seek the advice of the Legislative Advisory Commission.\nThis section does not apply to federal grants or aids received from the United States Department of Education.",
	"repealed": false
}