{
	"id": "16A.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.69",
	"title": "16A.69 APPROPRIATIONS INTO SINGLE PROJECT ACCOUNT.",
	"text": "The commissioner shall place the money from two or more appropriations for the same or related projects in one account if all the appropriations do not lapse until their purposes are accomplished or abandoned. The agency to whom the appropriation was made shall first certify which accounts are involved to the commissioner.\nUpon the awarding of final contracts for the completion of a project for construction or other permanent improvement, or upon the abandonment of the project, the agency to whom the appropriation was made may transfer the unencumbered balance in the project account to another project enumerated in the same section of that appropriation act, or may transfer unencumbered balances from agency operating funds. The transfer must be made only to cover bids for the other project that were higher than was estimated when the appropriation for the other project was made and not to cover an expansion of the other project. The money transferred under this section is appropriated for the purposes for which transferred. For transfers for technical colleges by the Board of Trustees of the Minnesota State Colleges and Universities, the total cost of both projects and the required local share for both projects are adjusted accordingly. The agency proposing a transfer shall obtain approval from the commissioner of management and budget and the chair of the senate Finance Committee and the chair of the house of representatives Ways and Means Committee before the transfer is made under this subdivision.\nThe department shall set aside from a state appropriation available for that purpose funds for the planning and consulting services of the Capitol Area Architectural and Planning Board when a state agency or the Minnesota Historical Society plans and constructs any capital improvement in the Capitol Area as defined in section 15B.02.",
	"repealed": false
}