{
	"id": "353E.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/353E.02",
	"title": "353E.02 CORRECTIONAL SERVICE RETIREMENT PLAN MEMBERSHIP.",
	"text": "The members of the local government correctional service retirement plan established by this chapter are:\n(1) local government correctional service employees as defined in subdivision 2; and\n(2) medical center protection officers as defined in subdivision 2a.\n(a) A local government correctional service employee, for purposes of subdivision 1, is a person whom the employer certifies:\n(1) is employed in a county correctional institution as a correctional guard or officer, a joint jailer/dispatcher, or as a supervisor of correctional guards or officers or of joint jailers/dispatchers;\n(2) is directly responsible for the direct security, custody, and control of the county correctional institution and its inmates;\n(3) is expected to respond to incidents within the county correctional institution as part of the person's regular employment duties and is trained to do so; and\n(4) is a \"public employee\" as defined in section 353.01, but is not a member of the public employees police and fire plan.\n(b) The certification required under paragraph (a) must be made in writing on a form prescribed by the executive director of the Public Employees Retirement Association.\n(c) A person who was a member of the local government correctional service retirement plan on May 15, 2000, remains a member of the plan after May 16, 2000, for the duration of the person's employment in that county correctional institution position, even if the person's subsequent service in this position does not meet the requirements set forth in paragraph (a).\n(a) A medical center protection officer, for purposes of subdivision 1, is a person whom the employer certifies:\n(1) is employed by Hennepin Healthcare System, Inc. as a protection officer;\n(2) is directly responsible for the direct security of the medical center;\n(3) is expected to respond to any incidents within the medical center as part of the person's regular employment duties and is trained to do so; and\n(4) is a \"public employee\" as defined in section 353.01, but is not a member of the public employees police and fire plan.\n(b) The certification required under paragraph (a) must be made in writing on a form prescribed by the executive director of the Public Employees Retirement Association.\nA county correctional institution is:\n(1) a jail administered by a county;\n(2) a correctional facility administered by a county;\n(3) a regional correctional facility administered by or on behalf of multiple counties; or\n(4) a juvenile correctional facility administered by a county or on behalf of multiple counties.",
	"repealed": false
}