{
	"id": "148F.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.01",
	"title": "148F.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms in this section have the meanings given.\n\"Abuse\" means a maladaptive pattern of substance use leading to clinically significant impairment or distress, as manifested by one or more of the following occurring at any time during the same 12-month period:\n(1) recurrent substance use resulting in a failure to fulfill major role obligations at work, school, or home;\n(2) recurrent substance use in situations in which it is physically hazardous;\n(3) recurrent substance-related legal problems; and\n(4) continued substance use despite having persistent or recurrent social or interpersonal problems caused or exacerbated by the effects of the substance.\n\"Accredited school or educational program\" means a school of alcohol and drug counseling, university, college, or other postsecondary education program that, at the time the student completes the program, is accredited by a regional accrediting association whose standards are substantially equivalent to those of the North Central Association of Colleges and Postsecondary Education Institutions or an accrediting association that evaluates schools of alcohol and drug counseling for inclusion of the education, practicum, and core function standards in this chapter.\n\"Alcohol and drug counseling practicum\" means formal experience gained by a student and supervised by a person either licensed under this chapter or exempt under its provisions, as part of an accredited school or educational program of alcohol and drug counseling.\n\"Alcohol and drug counselor\" means a person who holds a valid license issued under this chapter to engage in the practice of alcohol and drug counseling.\n\"Applicant\" means a person seeking a license or temporary permit under this chapter.\n\"Board\" means the Board of Behavioral Health and Therapy established in section 148B.51.\n\"Client\" means an individual who is the recipient of any of the alcohol and drug counseling services described in this section. Client also means \"patient\" as defined in section 144.291, subdivision 2, paragraph (g).\n\"Competence\" means the ability to provide services within the practice of alcohol and drug counseling as defined in subdivision 18, that:\n(1) are rendered with reasonable skill and safety;\n(2) meet minimum standards of acceptable and prevailing practice as described in section 148F.12; and\n(3) take into account human diversity.\n\"Core functions\" means the following services provided in alcohol and drug treatment:\n(1) \"screening\" means the process by which a client is determined appropriate and eligible for admission to a particular program;\n(2) \"intake\" means the administrative and initial assessment procedures for admission to a program;\n(3) \"orientation\" means describing to the client the general nature and goals of the program; rules governing client conduct and infractions that can lead to disciplinary action or discharge from the program; in a nonresidential program, the hours during which services are available; treatment costs to be borne by the client, if any; and client's rights;\n(4) \"assessment\" means those procedures by which a counselor identifies and evaluates an individual's strengths, weaknesses, problems, and needs to develop a treatment plan or make recommendations for level of care placement;\n(5) \"treatment planning\" means the process by which the counselor and the client identify and rank problems needing resolution; establish agreed-upon immediate and long-term goals; and decide on a treatment process and the sources to be utilized;\n(6) \"counseling\" means the utilization of special skills to assist individuals, families, or groups in achieving objectives through exploration of a problem and its ramifications; examination of attitudes and feelings; consideration of alternative solutions; and decision making;\n(7) \"case management\" means activities that bring services, agencies, resources, or people together within a planned framework of action toward the achievement of established goals;\n(8) \"crisis intervention\" means those services which respond to an alcohol or other drug user's needs during acute emotional or physical distress;\n(9) \"client education\" means the provision of information to clients who are receiving or seeking counseling concerning alcohol and other drug abuse and the available services and resources;\n(10) \"referral\" means identifying the needs of the client which cannot be met by the counselor or agency and assisting the client to utilize the support systems and available community resources;\n(11) \"reports and record keeping\" means charting the results of the assessment and treatment plan and writing reports, progress notes, discharge summaries, and other client-related data; and\n(12) \"consultation with other professionals regarding client treatment and services\" means communicating with other professionals in regard to client treatment and services to assure comprehensive, quality care for the client.\n\"Credential\" means a license, permit, certification, registration, or other evidence of qualification or authorization to engage in the practice of an occupation in any state or jurisdiction.\n\"Dependent on the provider\" means that the nature of a former client's emotional or cognitive condition and the nature of the services by the provider are such that the provider knows or should have known that the former client is unable to withhold consent to sexually exploitative behavior by the provider.\n\"Familial\" means of, involving, related to, or common to a family member as defined in subdivision 14.\n\"Family member\" or \"member of the family\" means a spouse, parent, offspring, sibling, grandparent, grandchild, uncle, aunt, niece, or nephew, or an individual who serves in the role of one of the foregoing.\n\"Former student\" means an individual who has completed the educational requirements under section 148F.025, subdivision 2, or 148F.035, paragraph (a).\n\"Group clients\" means two or more individuals who are each a corecipient of alcohol and drug counseling services. Group clients may include, but are not limited to, two or more family members, when each is the direct recipient of services, or each client receiving group counseling services.\n\"Informed consent\" means an agreement between a provider and a client that authorizes the provider to engage in a professional activity affecting the client. Informed consent requires:\n(1) the provider to give the client sufficient information so the client is able to decide knowingly whether to agree to the proposed professional activity;\n(2) the provider to discuss the information in language that the client can reasonably be expected to understand; and\n(3) the client's consent to be given without undue influence by the provider.\n\"Licensee\" means a person who holds a valid license under this chapter.\n\"Practice of alcohol and drug counseling\" means the observation, description, evaluation, interpretation, and modification of human behavior by the application of core functions as it relates to the harmful or pathological use or abuse of alcohol or other drugs. The practice of alcohol and drug counseling includes, but is not limited to, the following activities, regardless of whether the counselor receives compensation for the activities:\n(1) assisting clients who use alcohol or drugs, evaluating that use, and recognizing dependency if it exists;\n(2) assisting clients with alcohol or other drug problems to gain insight and motivation aimed at resolving those problems;\n(3) providing experienced professional guidance, assistance, and support for the client's efforts to develop and maintain a responsible functional lifestyle;\n(4) recognizing problems outside the scope of the counselor's training, skill, or competence and referring the client to other appropriate professional services;\n(5) diagnosing the level of alcohol or other drug use involvement to determine the level of care;\n(6) individual planning to prevent a return to harmful alcohol or chemical use;\n(7) alcohol and other drug abuse education for clients;\n(8) consultation with other professionals;\n(9) gaining diversity awareness through ongoing training and education; and\n(10) providing the services in clauses (1) to (9), as needed, to family members or others who are directly affected by someone using alcohol or other drugs.\n\"Practice foundation\" means that an alcohol and drug counseling service or continuing education activity is based upon observations, methods, procedures, or theories that are generally accepted by the professional community in alcohol and drug counseling.\n\"Private information\" means any information, including, but not limited to, client records as defined in section 148F.15, test results, or test interpretations developed during a professional relationship between a provider and a client.\n\"Provider\" means a licensee, a temporary permit holder, or an applicant.\n\"Public statement\" means any statement, communication, or representation, by a provider to the public regarding the provider or the provider's professional services or products. Public statements include, but are not limited to, advertising, representations in reports or letters, descriptions of credentials and qualifications, brochures and other descriptions of services, directory listings, personal resumes or curricula vitae, comments for use in the media, websites, grant and credentialing applications, or product endorsements.\n\"Report\" means any written or oral professional communication, including a letter, regarding a client or subject that includes one or more of the following: historical data, behavioral observations, opinions, diagnostic or evaluative statements, or recommendations. The testimony of a provider as an expert or fact witness in a legal proceeding also constitutes a report. For purposes of this chapter, letters of recommendation for academic or career purposes are not considered reports.\n\"Significant risks and benefits\" means those risks and benefits that are known or reasonably foreseeable by the provider, including the possible range and likelihood of outcomes, and that are necessary for the client to know in order to decide whether to give consent to proposed services or to reasonable alternative services.\n\"Student\" means an individual who is enrolled in a program in alcohol and drug counseling at an accredited educational institution, or who is taking an alcohol and drug counseling course or practicum for credit.\n\"Supervisee\" means an individual whose supervision is required to obtain credentialing by a licensure board or to comply with a board order.\n\"Supervisor\" means a licensed alcohol and drug counselor licensed under this chapter or other licensed professional practicing alcohol and drug counseling under section 148F.11, who meets the requirements of section 148F.04, subdivision 3, and who provides supervision to persons seeking licensure under section 148F.025, subdivision 3, clause (2), item (ii).\n\"Test\" means any instrument, device, survey, questionnaire, technique, scale, inventory, or other process which is designed or constructed for the purpose of measuring, evaluating, assessing, describing, or predicting personality, behavior, traits, cognitive functioning, aptitudes, attitudes, skills, values, interests, abilities, or other characteristics of individuals.\n\"Unprofessional conduct\" means any conduct violating sections 148F.001 to 148F.205, or any conduct that fails to conform to the minimum standards of acceptable and prevailing practice necessary for the protection of the public.\n\"Variance\" means board-authorized permission to comply with a law or rule in a manner other than that generally specified in the law or rule.",
	"repealed": false
}