{
	"id": "116.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.14",
	"title": "116.14 HAZARDOUS WASTE FACILITIES; LIABILITY OF GUARANTOR.",
	"text": "(a) If the owner or operator of a hazardous waste facility is in bankruptcy, reorganization, or arrangement under the Federal Bankruptcy Code or if jurisdiction in any state or federal court cannot with reasonable diligence be obtained over an owner or operator likely to be solvent at the time of judgment, a person having a claim arising from conduct for which evidence of financial responsibility must be provided under the rules adopted under section 116.07, subdivision 4b, may bring the claim directly against the guarantor providing the evidence of financial responsibility.\n(b) For the purposes of this section, \"guarantor\" means any person other than the owner or operator who provides evidence of financial responsibility for that owner or operator.\n(c) In an action against a guarantor under this section, the guarantor is entitled to invoke the rights and defenses that would have been available to the owner or operator if the action had been brought against the owner or operator and that would have been available to the guarantor if an action had been brought against the guarantor by the owner or operator.\n(d) In an action under this section, the total liability of a guarantor is limited to the aggregate amount that the guarantor has provided as evidence of financial responsibility to the owner or operator under the rules.\n(e) Nothing in this section shall be construed to limit any other state or federal statutory, contractual, or common law liability of a guarantor to its owner or operator including the liability of the guarantor for bad faith either in negotiating or in failing to negotiate the settlement of any claim. Nothing in this section shall be construed to diminish the liability of any person under chapter 115B or the federal Superfund Act, United States Code, title 42, section 9601 et seq., or other applicable law.",
	"repealed": false
}