{
	"id": "61A.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.011",
	"title": "61A.011 INTEREST ON UNPAID BENEFITS.",
	"text": "Notwithstanding any other provision of law, when any insurer, including a fraternal benefit society, admitted to transact life insurance in this state pays the proceeds of or payments under any policy of life insurance, individual or group, such insurer shall pay interest at a rate not less than the then current rate of interest on death proceeds left on deposit with the insurer, computed from the insured's death until the date of payment, on any such proceeds or payments payable to a beneficiary residing in this state, or to a beneficiary under a policy issued in this state, or to a beneficiary under a policy insuring a person resident in this state at the time of death. If the insurer has no established current rate of interest for death proceeds left on deposit with the insurer, then the rate of interest to be paid under this subdivision shall be the rate of interest charged by the insurer to policyholders for loans under the insurer's policies.\nNotwithstanding the provisions of subdivision 1, if an insurer admitted to transact life insurance in this state does not pay within 60 days after receipt of due proof of death of the insured, the proceeds or payments under any policy of life insurance, individual or group, such insurer shall pay interest at an annual rate that is two percent more than the rate of interest provided for in subdivision 1. Such interest shall be computed from the date of the insured's death until the date of payment, on any such proceeds or payments payable to a beneficiary residing in this state, or to a beneficiary under a policy issued in this state or to a beneficiary under a policy insuring a person resident in this state at the time of death. Interest payments under this subdivision shall be in lieu of interest payments required under subdivision 1.\nIn any case in which interest on the proceeds of, or payments under, any policy of life insurance becomes payable pursuant to this section, the insurer shall enclose with the payment a notice stating that interest is being paid and specifying the rate of interest and the amount paid.\nThis section shall not require the payment of interest in any case in which: (a) the beneficiary or policy owner elects in writing delivered to the insurer to receive the proceeds of, or payments under, the policy by any means other than a lump-sum payment thereof, provided that the effective date of the policy settlement option shall not be later than 60 days after the date of the insured's death; (b) the terms of the policy insure an indebtedness owed by the insured and the proceeds include postdeath interest on the indebtedness; or (c) the beneficiary resides in a jurisdiction which has a law requiring the payment of interest to beneficiaries residing in that jurisdiction.\nNothing in this subdivision shall be construed to preclude the payment of interest required under subdivisions 1 or 2 on any proceeds remaining after extinguishment of the insured's indebtedness.\nThis section shall apply only to deaths of insureds which occur on or after August 1, 1977.\nFor the purposes of this section \"to pay\" means to issue a check for payment and \"date of payment\" means the date on which the insurer issues a check to transfer the amount in question to the beneficiaries or to deposit that amount:\n(a) with the district court of this state in accordance with rule 67, Minnesota Rules of Civil Procedure for the district courts;\n(b) with the courts of any foreign jurisdiction as authorized by the laws of that jurisdiction; or\n(c) in a trust account in any bank or trust company operating under the laws of this state or in any foreign bank, provided that the insurer keeps records of the account and makes these records open to inspection by the commissioner of commerce.\nPayments of accidental death benefits under an individual or group policy, whether payable in connection with a separate policy issued solely to provide that type of coverage or otherwise, are subject to this section. If the applicable rate of interest cannot be determined as provided in this section, the rate of interest for purposes of subdivision 1 is the rate provided in section 549.09, subdivision 1, paragraph (c).\n[Repealed, 1993 c 13 art 1 s 17]",
	"repealed": false
}