{
	"id": "41A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.05",
	"title": "41A.05 MINNESOTA AGRICULTURAL AND ECONOMIC DEVELOPMENT ACCOUNT AND BONDS.",
	"text": "The Minnesota agricultural and economic development account is established in the special revenue fund and may be invested by the state Board of Investment. All money appropriated to the account, and all guaranty fees, retail sales taxes, property tax increments, and other money from any source may be credited to the account and are appropriated to the board to carry out the purposes of this chapter. The board may maintain or establish within the Minnesota agricultural and economic development account reserve accounts, project accounts, trustee accounts, special guaranty fund accounts, or other restrictions it determines necessary or appropriate. The board may enter into pledge and escrow agreements or indentures of trust with a trustee for the purpose of maintaining the accounts.\n(a) The board by resolution may exercise the powers of a rural development authority under sections 469.142 to 469.151 and the powers of a municipality under sections 469.152 to 469.165 for the purposes of financing one or more projects, including the issuance of bonds and the application of the bond proceeds and investment income pursuant to a lease, loan, loan guaranty, loan participation, or other agreement. The bonds must be issued, sold, and secured on the terms and conditions and in the manner determined by resolution of the board. Notwithstanding subdivision 1, a reserve established for the bonds provided by the borrower, including out of bond proceeds, may be deposited and held in a separate account in the Minnesota agricultural and economic development account and applied to the last installments of principal or interest on the bonds, subject to the reserves being withdrawn for any purpose permitted by subdivision 1. The board may by resolution or indenture pledge any or all amounts in the fund, including any reserves and investment income on amounts in the fund, to secure the payment of principal and interest on any or all series of bonds, upon the terms and conditions as provided in the resolution or indenture. To the extent the board deems necessary or desirable to prevent interest on bonds from becoming subject to federal income taxation, (1) the amounts in the fund shall be invested in obligations or securities with restricted yields; and (2) the investment income on the amounts are released from the pledge securing the bonds or loan guaranty and appropriately applied to prevent taxation.\n(b) Bonds issued pursuant to this chapter are not general obligations of the state or the board. The full faith and credit and taxing powers of the state and the board are not and may not be pledged for the payment of the bonds. No person may compel the levy of a tax for the payment or compel the appropriation of money of the state or the board for the payment of the bonds, except as specifically provided in this chapter.\n(c) For purposes of sections 474A.01 to 474A.21, the board is a local issuer and may apply for allocations of authority to issue private activity obligations and may enter into an agreement for the issuance of obligations by another issuer.\nIn fulfillment of the state's covenant with the beneficiary of each loan guaranty executed by the board on behalf of the state pursuant to the agricultural resource loan guaranty program, in accordance with section 41A.04, subdivision 3, the state will not limit or alter the rights vested in the board to comply with the terms of the loan guaranties.\nIn the issuance of state bonds and the making of loan guaranties for the purposes of the program, the commissioner of management and budget and the board may and shall make all provisions and do or cause to be done all acts and things, consistent with sections 41A.01 to 41A.06, which are or may be effective under federal laws and regulations to comply with conditions for the exemption of interest on such bonds from federal income taxation. However, if for any reason, whether existing at the date of issue of any bonds or the date of execution of any loan guaranty or thereafter, the interest on any such bonds shall be or become subject to federal income taxes, this shall not impair or affect the validity of the bonds or of any loan guaranty or the provisions made for the security thereof, and shall not impair or affect the covenant made by the state in subdivision 3. Nothing herein affects the federal or state income tax treatment of interest on obligations of a borrower other than the state, whether or not guaranteed by the state.\nAmounts in the guaranty fund may be transferred to the general fund if the remaining amount in the fund exceeds the principal amount and one year's interest on the outstanding bonds and the guaranteed portion of outstanding guaranteed loans.",
	"repealed": false
}