{
	"id": "62I.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62I.03",
	"title": "62I.03 DEFINITION.",
	"text": "As used in sections 62I.01 to 62I.22 the following terms have the meanings given them in this section.\n\"Association\" means the Minnesota Joint Underwriting Association and incorporates the duties and responsibilities of the Medical Malpractice Joint Underwriting Association previously authorized by chapter 62F.\n\"Commissioner\" means the commissioner of commerce.\n\"Direct written premiums\" means that amount from the Statutory Annual Statement filed annually with the National Association of Insurance Commissioners (NAIC), at column (1) of the Exhibit of Premium and Losses (statutory page 14 data) for this state. Direct written premiums are further identified by kind of insurance as follows:\n(1) General at column (1), lines 5, 8, 9, 17.1, 17.2, 21.2, 22, 23, 24, 26, and 27.\n(2) Liquor Liability at column (1), lines 5.2, 17.1, and 17.2.\n(3) Medical Malpractice at column (1), lines 5.2, 11, 17.1, 17.2, 19.1, and 19.3.\n\"Deficit\" means, for a particular policy year, that amount by which total paid and outstanding losses and loss adjustment expenses and operating expenses exceed premium revenue.\n\"Market assistance coordinator\" means an employee of the association, or a person under contract with the association, who assists a person or entity applying to the association for coverage to obtain coverage in the private market.\n[Repealed by amendment, 2017 c 34 s 2]\n\"Member\" means an insurer licensed to write either or both of the following in this state: (1) property and casualty insurance; (2) personal injury liability insurance.\n\"Personal injury liability insurance\" means insurance described in section 60A.06, subdivision 1, clause (13).\n\"Licensed health care provider professional services\" means services performed by an individual licensed health care provider that are undertaken with the objective of providing prevention care, rehabilitative care, treatment of specific diseases, injuries, or conditions, or care rendered with the intent of stabilizing the patient's condition and preventing further deterioration or injury. Professional services do not include services provided by licensed health care providers who rely solely on spiritual or divine intervention as the only means of care or treatment.",
	"repealed": false
}