{
	"id": "144.7402",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.7402",
	"title": "144.7402 CONDITIONS FOR APPLICABILITY OF PROCEDURES.",
	"text": "An emergency medical services person or emergency medical services agency may request that a facility follow the procedures of sections 144.7401 to 144.7415 when an emergency medical services person may have experienced a significant exposure to a source individual.\nA facility shall follow the procedures outlined in sections 144.7401 to 144.7415 when all of the following conditions are met:\n(1) the facility determines that significant exposure has occurred, following the protocol under section 144.7414;\n(2) the licensed physician, advanced practice registered nurse, or physician assistant for the emergency medical services person needs the source individual's blood-borne pathogen test results to begin, continue, modify, or discontinue treatment, in accordance with the most current guidelines of the United States Public Health Service, because of possible exposure to a blood-borne pathogen; and\n(3) the emergency medical services person consents to provide a blood sample for testing for a blood-borne pathogen. If the emergency medical services person consents to blood collection, but does not consent at that time to blood-borne pathogen testing, the facility shall preserve the sample for at least 90 days. If the emergency medical services person elects to have the sample tested within 90 days, the testing shall be done as soon as feasible.\nIf the source individual is not received by a facility but the facility is providing treatment to the emergency medical services person, the emergency medical services agency shall make reasonable efforts to locate the source individual and inform the facility of the source individual's identity and location. The facility shall make a reasonable effort to contact the source individual in order to follow the procedures in sections 144.7401 to 144.7415. The emergency medical services agency and facilities may exchange private data about the source individual as necessary to fulfill their responsibilities under this subdivision, notwithstanding any provision of law to the contrary.",
	"repealed": false
}