{
	"id": "256B.439",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.439",
	"title": "256B.439 LONG-TERM CARE QUALITY PROFILES.",
	"text": "(a) The commissioner of human services, in cooperation with the commissioner of health, shall develop and implement quality profiles for nursing facilities and, beginning not later than July 1, 2014, for home and community-based services providers, except when the quality profile system would duplicate requirements under section 256B.5011, 256B.5012, or 256B.5013. For purposes of this section, home and community-based services providers are defined as providers of home and community-based services under chapter 256S and sections 256B.0625, subdivisions 6a, 7, and 19a; 256B.0913; 256B.092; 256B.49; and 256B.85, and intermediate care facilities for persons with developmental disabilities providers under section 256B.5013. To the extent possible, quality profiles must be developed for providers of services to older adults and people with disabilities, regardless of payor source, for the purposes of providing information to consumers. The quality profiles must be developed using existing data sets maintained by the commissioners of health and human services to the extent possible. The profiles must incorporate or be coordinated with information on quality maintained by area agencies on aging, long-term care trade associations, the ombudsman offices, counties, tribes, health plans, and other entities and the long-term care database maintained under section 256.975, subdivision 7. The profiles must be designed to provide information on quality to:\n(1) consumers and their families to facilitate informed choices of service providers;\n(2) providers to enable them to measure the results of their quality improvement efforts and compare quality achievements with other service providers; and\n(3) public and private purchasers of long-term care services to enable them to purchase high-quality care.\n(b) The profiles must be developed in consultation with the long-term care task force, area agencies on aging, and representatives of consumers, providers, and labor unions. Within the limits of available appropriations, the commissioners may employ consultants to assist with this project.\nThe commissioners shall identify and apply existing quality measurement tools to:\n(1) emphasize quality of care and its relationship to quality of life; and\n(2) address the needs of various users of long-term care services, including, but not limited to, short-stay residents, persons with behavioral problems, persons with dementia, and persons who are members of minority groups.\nThe tools must be identified and applied, to the extent possible, without requiring providers to supply information beyond state and federal requirements.\n(a) The commissioners shall identify and apply quality measurement tools to:\n(1) emphasize service quality and its relationship to quality of life; and\n(2) address the needs of various users of home and community-based services.\n(b) The tools must include, but not be limited to, surveys of consumers of home and community-based services. The tools must be identified and applied, to the extent possible, without requiring providers to supply information beyond state and federal requirements, for purposes of this subdivision.\nFollowing identification of the quality measurement tool, the commissioners shall conduct surveys of long-term care service consumers of nursing facilities to develop quality profiles of providers. To the extent possible, surveys must be conducted face-to-face by state employees or contractors. At the discretion of the commissioners, surveys may be conducted by telephone or by provider staff. Surveys must be conducted periodically to update quality profiles of individual nursing facilities providers.\nFollowing identification of the quality measurement tool, and within the limits of the appropriation, the commissioner shall conduct surveys of home and community-based services consumers to develop quality profiles of providers. To the extent possible, surveys must be conducted face-to-face by state employees or contractors. At the discretion of the commissioner, surveys may be conducted by an alternative method. Surveys must be conducted periodically to update quality profiles of individual service providers.\nMS 2022 [Repealed, 2023 c 25 s 190]\nFor purposes of conducting the consumer surveys under subdivision 3a, the commissioner may request contact information of clients and associated key representatives and aggregate, de-identified demographic information of clients served by the provider. The commissioner may request the following demographic information: (1) age; (2) race; (3) ethnicity; and (4) gender identity. Providers must furnish the contact and demographic information available to the provider and must provide notice to clients and associated key representatives that their contact information and aggregate demographic information has been provided to the commissioner.\nThe commissioner shall develop and administer a resident experience survey for assisted living facility residents and a family survey for families of assisted living facility residents. Money appropriated to the commissioner to administer the resident experience survey and family survey is available in either fiscal year of the biennium in which it is appropriated. Assisted living facilities licensed under chapter 144G must participate in the surveys when the commissioner requests their participation.\n(a) For purposes of including relevant information in the home and community-based services report card for consumers on the populations served by providers and for other data analysis, the commissioner may request from providers the following summary data about clients served by the provider:\n(1) age;\n(2) race;\n(3) ethnicity; and\n(4) gender identity.\n(b) For the purposes of this subdivision, \"summary data\" has the meaning given in section 13.02, subdivision 19. Providers must furnish the summary data only if the data on individuals is available to the provider. A provider is not required to collect any demographic data from clients for the sole purpose of providing the information requested by the commissioner under this subdivision. If a provider furnishes the requested summary data to the commissioner, the provider must provide notice to clients and associated key representatives that the client's demographic information was included in the summary data provided to the commissioner.\nBy July 1, 2014, the commissioners shall implement a public awareness effort to disseminate the quality profiles. Profiles may be disseminated through the Senior LinkAge Line and Disability Hub and to consumers, providers, and purchasers of long-term care services.\nBy April 1, 2014, the commissioner shall develop incentive-based grants for home and community-based services providers for achieving outcomes specified in a contract. The commissioner may solicit proposals from home and community-based services providers and implement those that, on a competitive basis, best meet the state's policy objectives. The commissioner shall determine the types of home and community-based services providers that will participate in the program. The determination of participating provider types may be revised annually by the commissioner. The commissioner shall limit the amount of any incentive-based grants and the number of grants under this subdivision to operate the incentive payments within funds appropriated for this purpose. The grant agreements may specify various levels of payment for various levels of performance. In establishing the specified outcomes and related criteria, the commissioner shall consider the following state policy objectives:\n(1) provide more efficient, higher quality services;\n(2) encourage home and community-based services providers to innovate;\n(3) equip home and community-based services providers with organizational tools and expertise to improve their quality;\n(4) incentivize home and community-based services providers to invest in better services; and\n(5) disseminate successful performance improvement strategies statewide.\n(a) The commissioner shall determine a quality score for each participating home and community-based services provider using quality measures established in subdivisions 1 and 2a, according to methods determined by the commissioner in consultation with stakeholders and experts. These methods shall be exempt from the rulemaking requirements under chapter 14.\n(b) For each quality measure, a score shall be determined with a maximum number of points available and number of points assigned as determined by the commissioner using the methodology established according to this subdivision. The determination of the quality measures to be used and the methods of calculating scores may be revised annually by the commissioner.\nOn July 1, 2015, the commissioner shall determine the quality add-on rate change and adjust payment rates for all home and community-based services providers for services rendered on or after that date. The adjustment to a provider payment rate determined under this subdivision shall become part of the ongoing rate paid to that provider. The payment rate for the quality add-on shall be a variable amount based on each provider's quality score as determined in subdivisions 1 and 2a. All home and community-based services providers shall receive a minimum rate increase under this subdivision. In addition to a minimum rate increase, a home and community-based services provider shall receive a quality add-on payment. The commissioner shall limit the types of home and community-based services providers that may receive the quality add-on based on availability of quality measures and outcome data. The commissioner shall limit the amount of the minimum rate increase and quality add-on payments to the equivalent of a one percent rate increase for all home and community-based services providers.",
	"repealed": false
}