{
	"id": "609.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.035",
	"title": "609.035 CRIME PUNISHABLE UNDER DIFFERENT PROVISIONS.",
	"text": "Except as provided in subdivisions 2, 3, 4, and 5, and in sections 609.2114, subdivision 3, 609.251, 609.2691, 609.486, 609.494, 609.585, and 609.856, and Minnesota Statutes 2012, section 609.21, subdivision 1b, if a person's conduct constitutes more than one offense under the laws of this state, the person may be punished for only one of the offenses and a conviction or acquittal of any one of them is a bar to prosecution for any other of them. All the offenses, if prosecuted, shall be included in one prosecution which shall be stated in separate counts.\n(a) When a person is being sentenced for a violation of a provision listed in paragraph (e), the court may sentence the person to a consecutive term of imprisonment for a violation of any other provision listed in paragraph (e), notwithstanding the fact that the offenses arose out of the same course of conduct, subject to the limitation on consecutive sentences contained in section 609.15, subdivision 2, and except as provided in paragraphs (b), (c), and (f).\n(b) When a person is being sentenced for a violation of section 171.09, 171.20, 171.24, or 171.30, the court may not impose a consecutive sentence for another violation of a provision in chapter 171.\n(c) When a person is being sentenced for a violation of section 169.791 or 169.797, the court may not impose a consecutive sentence for another violation of a provision of sections 169.79 to 169.7995.\n(d) This subdivision does not limit the authority of the court to impose consecutive sentences for crimes arising on different dates or to impose a consecutive sentence when a person is being sentenced for a crime and is also in violation of the conditions of a stayed or otherwise deferred sentence under section 609.135.\n(e) This subdivision applies to misdemeanor and gross misdemeanor violations of the following if the offender has two or more prior impaired driving convictions as defined in section 169A.03 within the past ten years:\n(1) section 169A.20, subdivision 1, driving while impaired;\n(2) section 169A.20, subdivision 2, test refusal;\n(3) section 169.791, failure to provide proof of insurance;\n(4) section 169.797, failure to provide vehicle insurance;\n(5) section 171.09, violation of condition of restricted license;\n(6) section 171.20, subdivision 2, operation after revocation, suspension, cancellation, or disqualification;\n(7) section 171.24, driving without valid license; and\n(8) section 171.30, violation of condition of limited license.\n(f) When a court is sentencing an offender for a violation of section 169A.20 and a violation of an offense listed in paragraph (e), and the offender has five or more qualified prior impaired driving incidents, as defined in section 169A.03, within the past ten years, the court shall sentence the offender to serve consecutive sentences for the offenses, notwithstanding the fact that the offenses arose out of the same course of conduct.\n[See Note.]\nNotwithstanding section 609.04, a prosecution for or conviction of a violation of section 609.165 or 624.713, subdivision 1, clause (2), is not a bar to conviction of or punishment for any other crime committed by the defendant as part of the same conduct.\nNotwithstanding section 609.04, a prosecution for or conviction of a violation of sections 609.561 to 609.563 or 609.5641 is not a bar to conviction of or punishment for any other crime committed by the defendant as part of the same conduct when the defendant is shown to have violated sections 609.561 to 609.563 or 609.5641 for the purpose of concealing any other crime.\nFor purposes of the Sentencing Guidelines, a violation of sections 609.561 to 609.563 or 609.5641 is a crime against the person.\nNotwithstanding subdivision 1, a prosecution or conviction for violating section 609.487 is not a bar to conviction of or punishment for any other crime committed by the defendant as part of the same conduct. If an offender is punished for more than one crime as authorized by this subdivision and the court imposes consecutive sentences for the crimes, the consecutive sentences are not a departure from the Sentencing Guidelines.\nNotwithstanding subdivision 1, a prosecution or conviction for committing a violation of sections 609.342 to 609.345 with force or violence is not a bar to conviction of or punishment for any other crime committed by the defendant as part of the same conduct. If an offender is punished for more than one crime as authorized by this subdivision and the court imposes consecutive sentences for the crimes, the consecutive sentences are not a departure from the Sentencing Guidelines.",
	"repealed": false
}