{
	"id": "273.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.111",
	"title": "273.111 AGRICULTURAL PROPERTY TAX.",
	"text": "This section may be cited as the \"Minnesota Agricultural Property Tax Law.\"\nThe present general system of ad valorem property taxation in the state of Minnesota does not provide an equitable basis for the taxation of certain agricultural real property and has resulted in inadequate taxes on some lands and excessive taxes on others. Therefore, it is hereby declared to be the public policy of this state that the public interest would best be served by equalizing tax burdens upon agricultural property within this state through appropriate taxing measures.\nThe legislature finds that it is in the interest of the state to encourage and preserve farms by mitigating the property tax impact of increasing land values due to nonagricultural economic forces.\n(a) Real estate consisting of ten acres or more or a nursery or greenhouse, and qualifying for classification as class 2a under section 273.13, shall be entitled to valuation and tax deferment under this section if it is primarily devoted to agricultural use, and either:\n(1) is the homestead of the owner, or of a surviving spouse, child, or sibling of the owner or is real estate which is farmed with the real estate which contains the homestead property; or\n(2) has been in possession of the applicant, the applicant's spouse, parent, or sibling, or any combination thereof, for a period of at least seven years prior to application for benefits under the provisions of this section, or is real estate which is farmed with the real estate which qualifies under this clause and is within four townships or cities or combination thereof from the qualifying real estate; or\n(3) is the homestead of an individual who is part of an entity described in paragraph (b), clause (1), (2), or (3); or\n(4) is in the possession of a nursery or greenhouse or an entity owned by a proprietor, partnership, or corporation which also owns the nursery or greenhouse operations on the parcel or parcels, provided that only the acres used to produce nursery stock qualify for treatment under this section.\n(b) Valuation of real estate under this section is limited to parcels owned by individuals except for:\n(1) a family farm entity or authorized farm entity regulated under section 500.24;\n(2) an entity, not regulated under section 500.24, in which the majority of the members, partners, or shareholders are related and at least one of the members, partners, or shareholders either resides on the land or actively operates the land; and\n(3) corporations that derive 80 percent or more of their gross receipts from the wholesale or retail sale of horticultural or nursery stock.\nThe terms in this paragraph have the meanings given in section 500.24, where applicable.\n(c) Land that previously qualified for tax deferment under this section and no longer qualifies because it is not primarily used for agricultural purposes but would otherwise qualify under Minnesota Statutes 2006, section 273.111, subdivision 3, for a period of at least three years will not be required to make payment of the previously deferred taxes, notwithstanding the provisions of subdivision 9. Sale of the land prior to the expiration of the three-year period requires payment of deferred taxes as follows: sale in the year the land no longer qualifies requires payment of the current year's deferred taxes plus payment of deferred taxes for the two prior years; sale during the second year the land no longer qualifies requires payment of the current year's deferred taxes plus payment of the deferred taxes for the prior year; and sale during the third year the land no longer qualifies requires payment of the current year's deferred taxes. Deferred taxes shall be paid even if the land qualifies pursuant to subdivision 11a. When such property is sold or no longer qualifies under this paragraph, or at the end of the three-year period, whichever comes first, all deferred special assessments plus interest are payable in equal installments spread over the time remaining until the last maturity date of the bonds issued to finance the improvement for which the assessments were levied. If the bonds have matured, the deferred special assessments plus interest are payable within 90 days. The provisions of section 429.061, subdivision 2, apply to the collection of these installments. Penalties are not imposed on any such special assessments if timely paid.\n(d) Land that is enrolled in the reinvest in Minnesota program under sections 103F.501 to 103F.535, the federal Conservation Reserve Program as contained in Public Law 99-198, or a similar state or federal conservation program qualifies for valuation and assessment deferral under this section if it was in agricultural use before enrollment and, provided that, in the case of land enrolled in the reinvest in Minnesota program, it is not subject to a perpetual easement.\n(a) Real estate receiving the tax deferment under this section for assessment year 2008, but that does not qualify for the 2009 assessment year due to changes in qualification requirements under Laws 2008, chapter 366, shall continue to qualify until: (1) the land is sold, transferred, or subdivided, or (2) the 2013 assessment, whichever is earlier, provided that the property continues to meet the requirements of Minnesota Statutes 2006, section 273.111, subdivision 3.\n(b) Except as provided in paragraph (c), and subdivision 9, paragraph (b), when property assessed under this subdivision is withdrawn from the program or becomes ineligible, the property shall be subject to additional taxes as provided in subdivision 9.\n(c) If land described in paragraph (a) is (1) sold or otherwise transferred to a son or daughter of the owner, or (2) transferred from a family farm limited liability company upon its termination to a son or daughter of an individual who had an ownership interest in the company, it will continue to qualify for treatment under this section as long as it continues to meet the requirements of Minnesota Statutes 2006, section 273.111, subdivision 3, but no later than the 2013 assessment.\n(d) When property assessed under this subdivision is removed from the program and is enrolled in the rural preserve property tax law program under section 273.114, the property is not subject to the additional taxes required under this subdivision or subdivision 9.\n(a) Real estate that received the tax deferment under this section for assessment year 2012 and would have continued to qualify for tax deferment for assessment years from 2013 to 2023 but for an eminent domain action that reduced the real estate to less than ten acres, shall reapply as provided in paragraph (b) and, if determined eligible, shall qualify for the tax deferment under this section for assessment year 2024 and thereafter until:\n(1) the property no longer qualifies for classification as class 2a under section 273.13;\n(2) the property is voluntarily withdrawn from the program; or\n(3) the property is sold, transferred, or subdivided.\n(b) Application for deferment under this subdivision shall be filed by May 1 of the year prior to the year in which the taxes are payable. The application must be filed with the assessor of the taxing district in which the real property is located on the form prescribed by the commissioner of revenue. The assessor may request additional information necessary to determine eligibility under this subdivision.\n(c) Property assessed under this subdivision is subject to additional taxes, as provided in subdivision 9, when the property:\n(1) no longer qualifies for classification as class 2a under section 273.13;\n(2) is voluntarily withdrawn from the program; or\n(3) is sold, transferred, or subdivided.\n(a) The value of any real estate described in subdivision 3 shall upon timely application by the owner, in the manner provided in subdivision 8, be determined solely with reference to its appropriate agricultural classification and value notwithstanding sections 272.03, subdivision 8, and 273.11. Furthermore, the assessor shall not consider any added values resulting from nonagricultural factors. In order to account for the presence of nonagricultural influences that may affect the value of agricultural land, the commissioner of revenue shall, in consultation with the Department of Applied Economics at the University of Minnesota, develop a fair and uniform method of determining the average value of agricultural land for each county in the state consistent with this subdivision. The values must be determined using appropriate sales data. When appropriate, the commissioner may make reasonable adjustments to the values based on the most recent available county or regional data for agricultural production, commodity prices, production expenses, rent, and investment return. The commissioner shall annually assign the resulting countywide average value to each county, and these values shall be used as the basis for determining the agricultural value for all properties in the county qualifying for tax deferment under this section. The county assessor, in consultation with the Department of Revenue, shall determine the relative value of agricultural land for each assessment district in comparison to the countywide average value, considering and giving recognition to appropriate agricultural market and soil data available.\n(b) In the case of property qualifying for tax deferment only under subdivision 3a, the assessor shall not consider the presence of commercial, industrial, residential, or seasonal recreational land use influences in determining the value for ad valorem tax purposes provided that in no case shall the value exceed the value prescribed by the commissioner of revenue for class 2a tillable property in that county.\nThe assessor shall, however, make a separate determination of the market value of such real estate. The tax based upon the appropriate local tax rate applicable to such property in the taxing district shall be recorded on the property assessment records.\nMS 2008 [Repealed, 2008 c 366 art 6 s 52]\nMS 1967 [Repealed, 1969 c 1039 s 10]\nApplication for deferment of taxes and assessment under this section shall be filed by May 1 of the year prior to the year in which the taxes are payable. Any application filed hereunder and granted shall continue in effect for subsequent years until the property no longer qualifies. The application must be filed with the assessor of the taxing district in which the real property is located on the form prescribed by the commissioner of revenue. The assessor may require proof by affidavit or otherwise that the property qualifies under subdivision 3 and may require the applicant to provide a copy of the appropriate schedule or form showing farm income that is attested to by the applicant as having been included in the most recently filed federal income tax return of the applicant.\nMS 1982 [Repealed, 1984 c 593 s 46]\n(a) Except as provided in paragraph (b), when real property which is being, or has been valued and assessed under this section no longer qualifies under subdivision 3, the portion no longer qualifying shall be subject to additional taxes, in the amount equal to the difference between the taxes determined in accordance with subdivision 4, and the amount determined under subdivision 5. Provided, however, that the amount determined under subdivision 5 shall not be greater than it would have been had the actual bona fide sale price of the real property at an arm's-length transaction been used in lieu of the market value determined under subdivision 5. Such additional taxes shall be extended against the property on the tax list for the current year, provided, however, that no interest or penalties shall be levied on such additional taxes if timely paid, and provided further, that such additional taxes shall only be levied with respect to the last three years that the said property has been valued and assessed under this section.\n(b) Real property that has been valued and assessed under this section prior to May 29, 2008, and that ceases to qualify under this section after May 28, 2008, and is withdrawn from the program before August 16, 2010, is not subject to additional taxes under this subdivision or subdivision 3, paragraph (c). If additional taxes have been paid under this subdivision with respect to property described in this paragraph prior to April 3, 2009, the county must repay the property owner in the manner prescribed by the commissioner of revenue.\nMS 2014 [Repealed, 2015 c 21 art 1 s 110]\nThe tax imposed by this section shall be a lien upon the property assessed to the same extent and for the same duration as other taxes imposed upon property within this state. The tax shall be annually extended by the county auditor and if and when payable shall be collected and distributed in the manner provided by law for the collection and distribution of other property taxes.\nThe payment of special local assessments levied after June 1, 1967, for improvements made to any real property described in subdivision 3 together with the interest thereon shall, on timely application as provided in subdivision 8, be deferred as long as such property meets the conditions contained in subdivision 3 or 3a or is transferred to an agricultural preserve under sections 473H.02 to 473H.17. If special assessments against the property have been deferred pursuant to this subdivision, the governmental unit shall file with the county recorder in the county in which the property is located a certificate containing the legal description of the affected property and of the amount deferred. When such property no longer qualifies under subdivision 3 or 3a, all deferred special assessments plus interest shall be payable in equal installments spread over the time remaining until the last maturity date of the bonds issued to finance the improvement for which the assessments were levied. If the bonds have matured, the deferred special assessments plus interest shall be payable within 90 days. The provisions of section 429.061, subdivision 2, apply to the collection of these installments. Penalty shall not be levied on any such special assessments if timely paid.\n(a) When real property qualifying under subdivision 3 is sold or transferred, no additional taxes or deferred special assessments plus interest shall be extended against the property provided the property continues to qualify pursuant to subdivision 3, and provided the new owner files an application for continued deferment within 30 days after the sale or transfer.\n(b) The following transfers do not constitute a change of ownership of property qualifying under subdivision 3:\n(1) death of a property owner when a surviving owner retains ownership of the property thereafter;\n(2) divorce of a married couple when one of the spouses retains ownership of the property thereafter;\n(3) marriage of a single property owner when that owner retains ownership of the property in whole or in part thereafter;\n(4) organization into or reorganization of a farm entity ownership under section 500.24, if all owners maintain the same beneficial interest both before and after the organizational changes; and\n(5) placement of the property in trust provided that the individual owners of the property are the grantors of the trust and they maintain the same beneficial interest both before and after placement of the property in trust.\nThis section shall be broadly construed to achieve its purpose. The invalidity of any provision shall be deemed not to affect the validity of other provisions.\nThis section shall apply to assessments for tax purposes made in 1968 and thereafter.\n(a) This section shall apply to special local assessments levied after July 1, 1967, and payable in the years thereafter, but shall not apply to any special assessments levied at any time by a county or district court under chapter 116A or by a watershed district under chapter 103D.\n(b) For special assessments levied by a watershed district under chapter 103D before June 1, 2008, this section is effective only for real property initially qualifying for tax deferment after May 31, 2008. For special assessments by a watershed district under chapter 103D levied after May 31, 2008, this section is effective for all real property qualifying for tax deferment under this section.\nReal estate consisting of more than ten, but less than 15, acres which has:\n(1) been owned by the applicant or the applicant's parents for at least 70 years;\n(2) been dissected by two or more major parkways or interstate highways; and\n(3) qualified for the agricultural valuation and tax deferment under this section through assessment year 1996, taxes payable in 1997,\nshall continue to qualify for treatment under this section until the applicant's death or transfer or sale by the applicant of the applicant's interest in the real estate. When the property ceases to qualify for treatment under this section, the recapture provisions of subdivision 9 will apply with respect to the last ten years that the property has been valued and assessed under this section.\nThis section must be applied to eligible properties by all county assessors, beginning no later than assessments for taxes levied in 2009, payable in 2010, and thereafter, unless the commissioner of revenue determines that a county is unable to comply with this requirement, in which case the county must implement it for taxes levied in 2010, payable in 2011, and thereafter.",
	"repealed": false
}