{
	"id": "321.0108",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.0108",
	"title": "321.0108 NAME.",
	"text": "(a) The name of a limited partnership may contain the name of any partner.\n(b) The name of a limited partnership that is not a limited liability limited partnership must contain the phrase \"limited partnership\" or the abbreviation \"L.P.\" or \"LP\" and may not contain the phrase \"limited liability limited partnership\" or the abbreviation \"LLLP\" or \"L.L.L.P.\"\n(c) Except as provided in section 321.1206(e)(1), the name of a limited liability limited partnership must contain the phrase \"limited liability limited partnership\" or the abbreviation \"LLLP\" or \"L.L.L.P.\" and must not otherwise contain the abbreviation \"L.P.\" or \"LP.\"\n(d) The limited partnership name shall not contain a word or phrase that indicates or implies that it is formed for a purpose other than a legal purpose.\n(e) The limited partnership name shall be distinguishable upon the records in the Office of the Secretary of State from the name of each domestic corporation, limited partnership, limited liability partnership, and limited liability company, whether profit or nonprofit, and each foreign corporation, limited partnership, limited liability partnership, and limited liability company on file, authorized or registered to do business in this state at the time of filing, whether profit or nonprofit, and each name the right to which is, at the time of formation, reserved as provided for in sections 5.35, 302A.117, 322A.03, 322C.0109, or 333.001 to 333.54, unless there is filed with the certificate of limited partnership one of the following:\n(1) the written consent of the domestic corporation, limited partnership, limited liability partnership, or limited liability company, or the foreign corporation, limited partnership, limited liability partnership, or limited liability company authorized or registered to do business in this state or the holder of a reserved name or a name filed by or registered with the secretary of state under sections 333.001 to 333.54 having a name that is not distinguishable;\n(2) a certified copy of a final decree of a court in this state establishing the prior right of the applicant to the use of the name in this state; or\n(3) the applicant's affidavit that the corporation, limited partnership, or limited liability company with the name that is not distinguishable has been incorporated or on file in this state for at least three years prior to the affidavit, if it is a domestic corporation, limited partnership, or limited liability company, or has been authorized or registered to do business in this state for at least three years prior to the affidavit, if it is a foreign corporation, limited partnership, or limited liability company, or that the holder of a name filed or registered with the secretary of state under sections 333.001 to 333.54 filed or registered that name at least three years prior to the affidavit; that the corporation, limited partnership, or limited liability company or holder has not during the three-year period before the affidavit filed any document with the secretary of state; that the applicant has mailed written notice to the corporation, limited partnership, or limited liability company or the holder of a name filed or registered with the secretary of state under sections 333.001 to 333.54 by certified mail, return receipt requested, properly addressed to the registered office of the corporation or limited liability company or in care of the agent of the limited partnership, or the address of the holder of a name filed or registered with the secretary of state under sections 333.001 to 333.54, shown in the records of the secretary of state, stating that the applicant intends to use a name that is not distinguishable and the notice has been returned to the applicant as undeliverable to the addressee corporation, limited partnership, limited liability company, or holder of a name filed or registered with the secretary of state under sections 333.001 to 333.54; that the applicant, after diligent inquiry, has been unable to find any telephone listing for the corporation, limited partnership, or limited liability company with the name that is not distinguishable in the county in which is located the registered office of the corporation, limited partnership, or limited liability company shown in the records of the secretary of state or has been unable to find any telephone listing for the holder of a name filed or registered with the secretary of state under sections 333.001 to 333.54 in the county in which is located the address of the holder shown in the records of the secretary of state; and that the applicant has no knowledge that the corporation, limited partnership, limited liability company, or holder of a name filed or registered with the secretary of state under sections 333.001 to 333.54 is currently engaged in business in this state.\n(f) The secretary of state shall determine whether a name is distinguishable from another name for purposes of this section and section 321.0109.\n(g) This section and section 321.0109 do not abrogate or limit the law of unfair competition or unfair practices; nor sections 333.001 to 333.54; nor the laws of the United States with respect to the right to acquire and protect copyrights, trade names, trademarks, service names, service marks, or any other rights to the exclusive use of names or symbols; nor derogate the common law or the principles of equity.\n(h) A limited partnership that is the surviving organization in a merger with one or more other organizations, or that is formed by the reorganization of one or more organizations, or that acquires by sale, lease, or other disposition to or exchange with an organization all or substantially all of the assets of another organization, including its name, may have the same name as that used in this state by any of the other organizations, if the other organization whose name is sought to be used was organized under the laws of, or is authorized to transact business in, this state.\n(i) The use of a name by a limited partnership in violation of this section does not affect or vitiate its existence, but a court in this state may, upon application of the state or of a person interested or affected, enjoin the limited partnership from doing business under a name assumed in violation of this section, although its certificate of limited partnership may have been filed with the secretary of state and a certificate of formation issued.",
	"repealed": false
}