{
	"id": "270.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.071",
	"title": "270.071 DEFINITIONS.",
	"text": "The following words and phrases, when used in sections 270.071 to 270.079, unless the context clearly indicates otherwise, shall have the meanings ascribed to them in this section.\n\"Air commerce\" means the transportation by aircraft of persons or property for hire in interstate, intrastate, or international transportation on regularly scheduled flights or on intermittent or irregularly timed flights by airline companies and includes transportation by any airline company making three or more flights in or out of Minnesota, or within Minnesota, during a calendar year.\n\"Aircraft\" means any contrivance now known or hereafter invented, used or designed for navigation of or flight in the air.\n\"Airline company\" means any person who undertakes, directly or indirectly, to engage in the business of air commerce.\n\"Commissioner\" means state commissioner of revenue.\n\"Equated plane hours\" means hours spent by aircraft in flight weighted according to the cargo capacity of each aircraft.\n\"Flight property\" means all aircraft and flight equipment used in connection therewith, including spare flight equipment. Flight property also includes computers and computer software used in operating, controlling, or regulating aircraft and flight equipment. Flight property does not include aircraft with a maximum takeoff weight of less than 30,000 pounds.\n\"Intermittent or irregularly timed flights\" means any flight in which the departure time, departure location, and arrival location are specifically negotiated with the customer or the customer's representative, including but not limited to charter flights.\n\"Person\" means an individual, trust, estate, fiduciary, partnership, company, corporation, limited liability company, association, governmental unit or agency, public or private organization of any kind, or other legal entity.\n\"Small or medium sized community\" means a home rule charter or statutory city or town in Minnesota with a population of 100,000 or fewer that is not located in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington Counties.",
	"repealed": false
}