{
	"id": "256.9655",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9655",
	"title": "256.9655 PAYMENTS TO MEDICAL PROVIDERS.",
	"text": "The commissioner shall establish procedures to analyze and correct problems associated with medical care claims preparation and processing under the medical assistance and MinnesotaCare programs. At a minimum, the commissioner shall:\n(1) designate a full-time position as a liaison between the Department of Human Services and providers;\n(2) analyze impediments to timely processing of claims, provide information and consultation to providers, and develop methods to resolve or reduce problems;\n(3) provide to each acute care hospital a quarterly listing of claims received and identify claims that have been suspended and the reason the claims were suspended;\n(4) provide education and information on reasons for rejecting and suspending claims and identify methods that would avoid multiple submissions of claims; and\n(5) for each acute care hospital, identify and prioritize claims that are in jeopardy of exceeding time factors that eliminate payment.\nMedical providers designated by the commissioner of human services are permitted to purchase authorized materials through commodity contracts administered by the commissioner of administration for the purpose of submitting electronic claims to the medical programs designated in subdivision 1. Providers so designated must be actively enrolled and participating in the medical programs and must sign a hardware purchase and electronic biller agreement with the commissioner of human services prior to purchase from the contract.\n(a) In paying claims under medical assistance, the commissioner shall comply with Code of Federal Regulations, title 42, section 447.45.\n(b) If the commissioner does not pay or deny a clean claim within the period provided in paragraph (a), the commissioner must pay interest on the claim for the period beginning on the day after the required payment date specified in paragraph (a) and ending on the date on which the commissioner makes the payment or denies the claim.\n(c) The rate of interest paid by the commissioner under this subdivision must be 1.5 percent per month or any part of a month.",
	"repealed": false
}