{
	"id": "260C.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.515",
	"title": "260C.515 PERMANENCY DISPOSITION ORDERS.",
	"text": "If the child is not returned to the home at or before the conclusion of permanency proceedings under sections 260C.503 to 260C.521, the court must order one of the permanency dispositions in this section.\nThe court may order:\n(1) termination of parental rights when the requirements of sections 260C.301 to 260C.328 are met; or\n(2) the responsible social services agency to file a petition for termination of parental rights in which case all the requirements of sections 260C.301 to 260C.328 remain applicable.\nThe court may issue an order that the child is under the guardianship of the commissioner of children, youth, and families under the following procedures and conditions:\n(1) there is an identified prospective adoptive parent agreed to by the responsible social services agency that has legal custody of the child pursuant to court order under this chapter and that prospective adoptive parent has agreed to adopt the child;\n(2) the court accepts the parent's voluntary consent to adopt in writing on a form prescribed by the commissioner, executed before two competent witnesses and confirmed by the consenting parent before the court or executed before the court. The consent shall contain notice that consent given under this chapter:\n(i) is irrevocable upon acceptance by the court unless fraud is established and an order is issued permitting revocation as stated in clause (9) unless the matter is governed by the Indian Child Welfare Act, United States Code, title 25, section 1913(c); and\n(ii) will result in an order that the child is under the guardianship of the commissioner of children, youth, and families;\n(3) a consent executed and acknowledged outside of this state, either in accordance with the law of this state or in accordance with the law of the place where executed, is valid;\n(4) the court must review the matter at least every 90 days under section 260C.317;\n(5) a consent to adopt under this subdivision vests guardianship of the child with the commissioner of children, youth, and families and makes the child a ward of the commissioner of children, youth, and families under section 260C.325;\n(6) the court must forward to the commissioner a copy of the consent to adopt, together with a certified copy of the order transferring guardianship to the commissioner;\n(7) if an adoption is not finalized by the identified prospective adoptive parent within six months of the execution of the consent to adopt under this clause, the responsible social services agency shall pursue adoptive placement in another home unless the court finds in a hearing under section 260C.317 that the failure to finalize is not due to either an action or a failure to act by the prospective adoptive parent;\n(8) notwithstanding clause (7), the responsible social services agency must pursue adoptive placement in another home as soon as the agency determines that finalization of the adoption with the identified prospective adoptive parent is not possible, that the identified prospective adoptive parent is not willing to adopt the child, or that the identified prospective adoptive parent is not cooperative in completing the steps necessary to finalize the adoption. The court may order a termination of parental rights under subdivision 2; and\n(9) unless otherwise required by the Indian Child Welfare Act, United States Code, title 25, section 1913(c), a consent to adopt executed under this section shall be irrevocable upon acceptance by the court except upon order permitting revocation issued by the same court after written findings that consent was obtained by fraud.\n(a) The court may order a transfer of permanent legal and physical custody to:\n(1) a parent. The court must find that the parent understands a transfer of permanent legal and physical custody includes permanent, ongoing responsibility for the protection, education, care, and control of the child and decision making on behalf of the child until adulthood; or\n(2) a fit and willing relative according to the requirements in paragraph (b).\n(b) An order for transfer of permanent legal and physical custody to a relative must only be made after the court has reviewed the suitability of the prospective legal and physical custodian, including a summary of information obtained from required background studies under section 245C.33 or 260C.209, if the court finds the permanency disposition to be in the child's best interests.\nIn transferring permanent legal and physical custody to a relative, the juvenile court shall follow the standards applicable under this chapter and chapter 260, and the procedures in the Minnesota Rules of Juvenile Protection Procedure. The court must issue written findings that include the following:\n(1) the prospective legal and physical custodian understands that:\n(i) a transfer of permanent legal and physical custody includes permanent, ongoing responsibility for the protection, education, care, and control of the child and decision making on behalf of the child until adulthood; and\n(ii) a permanent legal and physical custodian shall not return a child to the permanent care of a parent from whom the court removed custody without the court's approval and without notice to the responsible social services agency;\n(2) transfer of permanent legal and physical custody and receipt of Northstar kinship assistance under sections 142A.60 to 142A.612, when requested and the child is eligible, are in the child's best interests;\n(3) when the agency files the petition under paragraph (c) or supports the petition filed under paragraph (d), adoption is not in the child's best interests based on the determinations in the kinship placement agreement required under section 142A.605, subdivision 2;\n(4) the agency made efforts to discuss adoption with the child's parent or parents, or the agency did not make efforts to discuss adoption and the reasons why efforts were not made; and\n(5) there are reasons to separate siblings during placement, if applicable.\n(c) The responsible social services agency may file a petition naming a fit and willing relative as a proposed permanent legal and physical custodian. A petition for transfer of permanent legal and physical custody to a relative shall include facts upon which the court can determine suitability of the proposed custodian, including a summary of results from required background studies completed under section 245C.33. The petition must be accompanied by a kinship placement agreement under section 142A.605, subdivision 2, between the agency and proposed permanent legal and physical custodian.\n(d) Another party to the permanency proceeding regarding the child may file a petition to transfer permanent legal and physical custody to a relative. The petition must include facts upon which the court can make the determinations required under paragraph (b), including suitability of the proposed custodian and, if completed, a summary of results from required background studies completed under section 245C.33 or 260C.209. If background studies have not been completed at the time of filing the petition, they must be completed and a summary of results provided to the court prior to the court granting the petition or finalizing the order according to paragraph (e). The petition must be filed no later than the date for the required admit-deny hearing under section 260C.507; or if the agency's petition is filed under section 260C.503, subdivision 2, the petition must be filed not later than 30 days prior to the trial required under section 260C.509.\n(e) The court may:\n(1) defer finalization of an order transferring permanent legal and physical custody to a relative when deferring finalization is necessary to determine eligibility for Northstar kinship assistance under sections 142A.60 to 142A.612;\n(2) finalize a transfer of permanent legal and physical custody to a relative regardless of eligibility for Northstar kinship assistance under sections 142A.60 to 142A.612, provided that the court has reviewed the suitability of the proposed custodian, including the summary of background study results, consistent with paragraph (b); and\n(3) following a transfer of permanent legal and physical custody to a relative, maintain jurisdiction over the responsible social services agency, the parents or guardian of the child, the child, and the permanent legal and physical custodian for purposes of ensuring appropriate services are delivered to the child and permanent legal custodian for the purpose of ensuring conditions ordered by the court related to the care and custody of the child are met.\nThe court may order permanent custody to the responsible social services agency for continued placement of the child in foster care but only if it approves the responsible social services agency's compelling reasons that no other permanency disposition order is in the child's best interests and:\n(1) the child has reached age 16 and has been asked about the child's desired permanency outcome;\n(2) the responsible social services agency has made reasonable efforts to locate and place the child with an adoptive family or a fit and willing relative who would either agree to adopt the child or to a transfer of permanent legal and physical custody of the child, but these efforts have not proven successful; and\n(3) the parent will continue to have visitation or contact with the child and will remain involved in planning for the child.\nThe court may order temporary legal custody to the responsible social services agency for continued placement of the child in foster care for a specified period of time according to the following conditions:\n(1) the sole basis for an adjudication that the child is in need of protection or services is the child's behavior;\n(2) the court finds that foster care for a specified period of time is in the best interests of the child;\n(3) the court approves the responsible social services agency's compelling reasons that neither an award of permanent legal and physical custody to a relative nor termination of parental rights is in the child's best interests; and\n(4) the order specifies that the child continue in foster care no longer than one year.",
	"repealed": false
}