{
	"id": "346.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/346.38",
	"title": "346.38 EQUINES.",
	"text": "\"Equines\" are horses, ponies, mules, and burros.\nEquines must be provided with food of sufficient quantity and quality to allow for normal growth or the maintenance of body weight. Feed standards shall be those recommended by the National Research Council.\nEquines must be provided with clean, potable water in sufficient quantity to satisfy the animal's needs or supplied by free choice. Snow or ice is not an adequate water source.\nEquines must be provided a minimum of free choice protection or constructed shelter from adverse weather conditions, including direct rays of the sun in extreme heat or cold, wind, or precipitation. Natural or constructed shelters must be of sufficient size to provide the necessary protection. Constructed shelters must be structurally sound, free of injurious matter, maintained in good repair, and ventilated. Outside exercise paddocks for equines do not require separate constructed shelter where a shelter is accessible to the equine on adjacent or other accessible areas of the property provided that equines are not kept in outdoor exercise paddocks during adverse weather conditions.\nConstructed shelters except for tie stalls must provide space for the animal to: (1) roll with a minimum danger of being cast; or (2) easily stand, lie down, and turn around. Stalls must be cleaned and kept dry to the extent the animal is not required to lie or stand in fluids. Bedding must be provided in all stalls, kept reasonably clean, and periodically changed. The nature of the bedding must not pose a health hazard to the animal.\nEquines must be provided opportunity for periodic exercise, either through free choice or through a forced work program, unless exercise is restricted by a licensed veterinarian.\nAll equines must have their hooves properly trimmed periodically to prevent lameness.\nA vehicle used to transport an equine must have a floor capable of supporting the animal's weight safely. Floors must be of nonskid construction or of nonskid material sufficient to provide the animal with traction while in transport. A minimum of 12 inches must be allowed between the withers of the largest equine and the structure above the animal while it is in a natural standing position. Sturdy partitions must be provided at a minimum of approximately every ten feet inside the vehicle. Interior compartments of transporting vehicles must be of smooth construction with no protruding or sharp objects and must provide ventilation. Food and water must be provided in sufficient quantities to minimize stress and maintain hydration.",
	"repealed": false
}