{
	"id": "115A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.03",
	"title": "115A.03 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them, unless the context requires otherwise.\n\"Agency\" means the Pollution Control Agency.\n[Repealed, 1989 c 335 art 1 s 270]\n\"Arrange for management\" means an activity undertaken by a person that determines the ultimate disposition of solid waste that is under the control of the person, including delivery of the waste to a transfer station for transport to another solid waste management facility. Knowledge of the destination of waste by a generator is by itself insufficient for arranging for management unless the generator knows that the destination is an environmentally inferior facility as defined in this section, has the ability to redirect the waste to an environmentally superior facility and ensure its delivery to that facility, and chooses not to redirect the waste.\n\"Cities\" means statutory and home rule charter cities and towns authorized to plan under sections 462.351 to 462.364.\n\"Collection\" means the aggregation of waste from the place at which it is generated and includes all activities up to the time the waste is delivered to a waste facility.\n\"Commercial waste facility\" means a waste facility established and permitted to sell waste processing or disposal services to generators other than the owner and operator of the facility.\n\"Commissioner\" means the commissioner of the Pollution Control Agency.\n\"Construction debris\" means waste building materials, packaging, and rubble resulting from construction, remodeling, repair, and demolition of buildings and roads.\n\"Containment\" means isolating, controlling, and monitoring waste in a waste facility in order to prevent a release of waste from the facility that would have an adverse impact upon human health and the environment.\n\"Development region\" means a region designated pursuant to sections 462.381 to 462.397.\n[Repealed, 1Sp2005 c 1 art 2 s 162]\n\"Disposal\" or \"dispose\" means the discharge, deposit, injection, dumping, spilling, leaking, or placing of any waste into or on any land or water so that the waste or any constituent thereof may enter the environment or be emitted into the air, or discharged into any waters, including groundwaters.\n\"Disposal facility\" means a waste facility permitted by the agency that is designed or operated for the purpose of disposing of waste on or in the land, together with any appurtenant facilities needed to process waste for disposal or transfer to another waste facility.\nMS 2022 [Renumbered subd 10c]\n\"Environmental justice area\" means one or more census tracts in Minnesota:\n(1) in which, based on the most recent decennial census data published by the United States Census Bureau:\n(i) 40 percent or more of the population is nonwhite;\n(ii) 35 percent or more of the households have an income at or below 200 percent of the federal poverty level; or\n(iii) 40 percent or more of the population over the age of five has limited English proficiency; or\n(2) located within Indian Country, as defined under United States Code, title 18, section 1151.\n\"Environmentally inferior\" means a solid waste management method that is lower on the list of preferred waste management methods in section 115A.02 than a solid waste management method chosen by a county or, as applied to a facility, means a waste management facility that utilizes a waste management method that is lower on the list of preferred waste management methods than the waste management method chosen by a county. In addition, as applied to disposal facilities, a facility that does not meet the standards for new facilities in Code of Federal Regulations, title 40, chapters 257 and 258, is environmentally inferior to a facility that does meet these standards.\n\"Generation\" means the act or process of producing waste.\n\"Generator\" means any person who generates waste.\n\"Hazardous waste\" has the meaning given it in section 116.06, subdivision 11.\n\"Industrial waste\" means solid waste resulting from an industrial, manufacturing, service, or commercial activity that is managed as a separate waste stream.\n\"Intrinsic hazard\" of a waste means the propensity of the waste to migrate in the environment, and thereby to become exposed to the public, and the significance of the harm or damage likely to result from exposure of natural resources or the public to the waste, as a result of such inherent or induced attributes of the waste as its chemical and physical stability, solubility, bioconcentratability, toxicity, flammability, and corrosivity.\n(a) \"Intrinsic suitability\" of a land area or site means that, based on existing data on the inherent and natural attributes, physical features, and location of the land area or site, there is no known reason why the waste facility proposed to be located in the area or site cannot reasonably be expected to qualify for permits in accordance with agency rules. Agency certification of intrinsic suitability shall be based on data submitted to the agency by the proposing entity and data included by the administrative law judge in the record of any public hearing on recommended certification, and applied against criteria in agency rules and any additional criteria developed by the agency in effect at the time the proposing entity submits the site for certification.\n(b) In the event that all candidate sites selected by the board before May 3, 1984, are eliminated from further consideration and a new search for candidate sites is commenced, \"intrinsic suitability\" of a land area or site shall mean that, because of the inherent and natural attributes, physical features, and location of the land area or site, the waste facility proposed to be located in the area or site would not be likely to result in material harm to the public health and safety and natural resources and that therefore the proposed facility can reasonably be expected to qualify for permits in accordance with agency rules.\n[Repealed, 1997 c 7 art 1 s 26]\n\"Local government unit\" means cities, towns, and counties.\n\"Major appliances\" means clothes washers and dryers, dishwashers, hot water heaters, heat pumps, furnaces, garbage disposals, trash compactors, conventional and microwave ovens, ranges and stoves, air conditioners, dehumidifiers, refrigerators, and freezers.\n\"Metropolitan area\" has the meaning given it in section 473.121.\n\"Metropolitan Council\" means the council established in chapter 473.\n[Repealed, 1994 c 628 art 3 s 209]\n(a) \"Mixed municipal solid waste\" means garbage, refuse, and other solid waste from residential, commercial, industrial, and community activities that the generator of the waste aggregates for collection, except as provided in paragraph (b).\n(b) Mixed municipal solid waste does not include auto hulks, street sweepings, ash, construction debris, mining waste, sludges, tree and agricultural wastes, tires, lead acid batteries, motor and vehicle fluids and filters, and other materials collected, processed, and disposed of as separate waste streams.\n\"Natural resources\" has the meaning given it in chapter 116B.\n[Repealed, 1Sp2005 c 1 art 2 s 162]\n\"Packaging\" means a container and any appurtenant material that provide a means of transporting, marketing, protecting, or handling a product. \"Packaging\" includes pallets and packing such as blocking, bracing, cushioning, weatherproofing, strapping, coatings, closures, inks, dyes, pigments, and labels.\n\"Person\" has the meaning given it in section 116.06, but does not include the Pollution Control Agency.\n\"Political subdivision\" means any municipal corporation, governmental subdivision of the state, local government unit, special district, or local or regional board, commission, or authority authorized by law to plan or provide for waste management.\nMS 2022 [Renumbered subd 24c]\n\"Postconsumer material\" means a finished material that would normally be discarded as a solid waste having completed its life cycle as a consumer item.\n[Renumbered subd 24e]\n\"Prepared sewage sludge\" means exceptional quality sewage sludge, as defined in Minnesota Rules, part 7041.0100, subpart 20, applied to a lawn or home garden and sold or given away in a bag or other container that:\n(1) meets low limits on metal concentrations;\n(2) has been treated to ensure pathogens, pollutants, and vectors that can transport disease have been carefully managed; and\n(3) is labeled with the nutrient content.\n\"Problem material\" means a material that, when it is processed or disposed of with mixed municipal solid waste, contributes to one or more of the following results:\n(1) the release of a hazardous substance, or pollutant or contaminant, as defined in section 115B.02, subdivisions 8, 13, and 15;\n(2) pollution of water as defined in section 115.01, subdivision 13;\n(3) air pollution as defined in section 116.06, subdivision 4; or\n(4) a significant threat to the safe or efficient operation of a solid waste facility.\n\"Processing\" means the treatment of waste after collection and before disposal. Processing includes but is not limited to reduction, storage, separation, exchange, resource recovery, physical, chemical, or biological modification, and transfer from one waste facility to another.\n\"Recyclable materials\" means materials that are separated from mixed municipal solid waste for the purpose of recycling or composting, including paper, glass, plastics, metals, automobile oil, batteries, source-separated compostable materials, and sole source food waste streams that are managed through biodegradative processes. Refuse-derived fuel or other material that is destroyed by incineration is not a recyclable material.\n\"Recycling\" means the process of collecting and preparing recyclable materials and reusing the materials in their original form or using them in manufacturing processes that do not cause the destruction of recyclable materials in a manner that precludes further use.\n\"Recycling facility\" means a facility at which materials are prepared for reuse in their original form or for use in manufacturing processes that do not cause the destruction of the materials in a manner that precludes further use.\n\"Refuse-derived fuel\" means a product resulting from the processing of mixed municipal solid waste in a manner that reduces the quantity of noncombustible material present in the waste, reduces the size of waste components through shredding or other mechanical means, and produces a fuel suitable for combustion in existing or new solid fuel-fired boilers.\n\"Regional development commission\" means a commission established pursuant to sections 462.381 to 462.397.\n\"Resource conservation\" means the reduction in the use of water, energy, and raw materials.\n\"Resource recovery\" means the reclamation for sale, use, or reuse of materials, substances, energy, or other products contained within or derived from waste.\n\"Resource recovery facility\" means a waste facility established and used primarily for resource recovery, including related and appurtenant facilities such as transmission facilities and transfer stations primarily serving the resource recovery facility.\n\"Retrievable storage\" means a method of disposal whereby wastes are placed in a facility established pursuant to sections 115A.18 to 115A.30 for an indeterminate period in a manner designed to allow the removal of the waste at a later time.\n\"Sanitary district\" means a sanitary district with the authority to regulate solid waste.\n\"Sewage sludge\" means solid, semisolid, or liquid residue generated during the treatment of domestic sewage in a treatment works. It includes, but is not limited to, scum or solids removed in primary, secondary, or advanced wastewater treatment processes and a material derived from sewage sludge. Sewage sludge does not include ash generated during the firing of sewage sludge in a sewage sludge incinerator or grit and screenings generated during preliminary treatment of domestic sewage in a treatment works. Sewage sludge that is acceptable and beneficial for recycling on land as a soil conditioner and nutrient source is also known as biosolids.\n\"Sewage sludge disposal facility\" means property owned or leased by a political subdivision and used for interim or final disposal or land spreading of sewage sludge.\n\"Solid waste\" has the meaning given it in section 116.06, subdivision 22.\n\"Solid waste management district\" or \"waste district\" means a geographic area extending into two or more counties in which the management of solid waste is vested in a special district established pursuant to sections 115A.62 to 115A.72.\nMS 1994 [Renumbered subd 32c]\n\"Source-separated compostable materials\" means materials that:\n(1) are separated at the source by waste generators for the purpose of preparing them for use as compost;\n(2) are collected separately from mixed municipal solid waste, and are governed by the licensing provisions of section 115A.93;\n(3) are comprised of food wastes, fish and animal waste, plant materials, diapers, sanitary products, and paper that is not recyclable because the commissioner has determined that no other person is willing to accept the paper for recycling;\n(4) are delivered to a facility to undergo controlled microbial degradation to yield a humus-like product meeting the agency's class I or class II, or equivalent, compost standards and where process rejects do not exceed 15 percent by weight of the total material delivered to the facility; and\n(5) may be delivered to a transfer station, mixed municipal solid waste processing facility, or recycling facility only for the purposes of composting or transfer to a composting facility, unless the commissioner determines that no other person is willing to accept the materials.\nMS 1994 [Renumbered subd 32d]\n\"Source-separated recyclable materials\" means recyclable materials, including commingled recyclable materials, that are separated by the generator.\n\"Stabilization\" means a chemical or thermal process in which materials or energy are added to waste in order to reduce the possibility of migration of any hazardous constituents of the resulting stabilized waste in preparation for placement of the waste in a stabilization and containment facility.\n\"Stabilization and containment facility\" means a waste facility that is designed for stabilization and containment of waste, together with other appurtenant facilities needed to process waste for stabilization, containment, or transfer to another facility.\n\"Transfer station\" means an intermediate waste facility in which waste collected from any source is temporarily deposited to await transportation to another waste facility.\n\"Waste\" means solid waste, sewage sludge, and hazardous waste.\n\"Waste facility\" means all property, real or personal, including negative and positive easements and water and air rights, which is or may be needed or useful for the processing or disposal of waste, except property for the collection of the waste and property used primarily for the manufacture of scrap metal or paper. Waste facility includes but is not limited to transfer stations, processing facilities, and disposal sites and facilities.\n\"Waste management\" means activities which are intended to affect or control the generation of waste and activities which provide for or control the collection, processing and disposal of waste.\n\"Waste management method chosen by a county\" means:\n(1) a waste management method that is mandated for waste generated in the county by section 115A.415, 473.848, 473.849, or other state law, or by county ordinance based on the county solid waste management plan developed, adopted, and approved under section 115A.46 or 458D.05 or the county solid waste management master plan developed, adopted, and approved under section 473.803; or\n(2) a waste management facility or facilities, developed under the county solid waste management plan or master plan, to which solid waste generated in a county is directed by an ordinance developed, adopted, and approved under sections 115A.80 to 115A.893.\n\"Waste reduction\" or \"source reduction\" means an activity that prevents generation of waste or the inclusion of toxic materials in waste, including:\n(1) reusing a product in its original form;\n(2) increasing the life span of a product;\n(3) reducing material or the toxicity of material used in production or packaging; or\n(4) changing procurement, consumption, or waste generation habits to result in smaller quantities or lower toxicity of waste generated.\n\"Waste rendered nonhazardous\" means (1) waste excluded from regulation as a hazardous waste under the delisting requirements of United States Code, title 42, section 6921 and any federal and state delisting rules, and (2) other nonhazardous residual waste from the processing of hazardous waste.\n\"Waste treated seed\" means seed that is treated, as defined in section 21.81, subdivision 28, and that is withdrawn from sale or that the end user considers unusable or otherwise a waste.\n\"Yard waste\" means garden wastes, leaves, lawn cuttings, weeds, shrub and tree waste, and prunings.",
	"repealed": false
}