{
	"id": "115A.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.71",
	"title": "115A.71 BONDING POWERS.",
	"text": "A district may exercise the bonding powers provided in this section to the extent the powers are authorized by the order of the commissioner establishing the district and by its articles of incorporation.\nThe district's bonds shall be sold, issued, and secured in the manner provided in chapter 475 for revenue bonds and the district shall have the same powers and duties as a municipality and its governing body in issuing revenue bonds under that chapter. No election shall be required. The bonds may be sold at any price and at public or private sale as determined by the district and shall not be subject to any limitation as to rate.\n(a) A district may borrow money and incur indebtedness by issuing bonds and obligations which are payable solely:\n(1) from revenues, income, receipts, and profits derived by the district from its operation and management of solid waste facilities;\n(2) from the proceeds of warrants, notes, revenue bonds, debentures, or other evidences of indebtedness issued and sold by the district which are payable solely from such revenues, income, receipts, and profits;\n(3) from federal or state grants, gifts, or other moneys received by the district which are available therefor.\n(b) Every issue of revenue bonds by the district shall be payable out of any funds or revenues from any facility of the district, subject only to agreements with the holders of particular bonds or notes pledging particular revenues or funds. If any facility of the district is funded in whole or in part by Minnesota waste management bonds issued under sections 115A.58 and 115A.59, the state bonds shall take priority. The district may provide for priorities of liens in the revenues between the holders of district obligations issued at different times or under different resolutions. The district may provide for the refunding of any district obligation through the issuance of other district obligations entitled to rights and priorities similar in all respects to those held by the obligations that are refunded.",
	"repealed": false
}