{
	"id": "144.7055",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.7055",
	"title": "144.7055 STAFFING PLAN REPORTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Core staffing plan\" means the projected number of full-time equivalent nonmanagerial care staff that will be assigned in a 24-hour period to an inpatient care unit.\n(c) \"Nonmanagerial care staff\" means registered nurses, licensed practical nurses, and other health care workers, which may include but is not limited to nursing assistants, nursing aides, patient care technicians, and patient care assistants, who perform nonmanagerial direct patient care functions for more than 50 percent of their scheduled hours on a given patient care unit.\n(d) \"Inpatient care unit\" means a designated inpatient area for assigning patients and staff for which a distinct staffing plan exists and that operates 24 hours per day, seven days per week in a hospital setting. Inpatient care unit does not include any hospital-based clinic, long-term care facility, or outpatient hospital department.\n(e) \"Staffing hours per patient day\" means the number of full-time equivalent nonmanagerial care staff who will ordinarily be assigned to provide direct patient care divided by the expected average number of patients upon which such assignments are based.\n(f) \"Patient acuity tool\" means a system for measuring an individual patient's need for nursing care. This includes utilizing a professional registered nursing assessment of patient condition to assess staffing need.\n(a) The chief nursing executive or nursing designee of every reporting hospital in Minnesota under section 144.50 will develop a core staffing plan for each patient care unit.\n(b) Core staffing plans shall specify the full-time equivalent for each patient care unit for each 24-hour period.\n(c) Prior to submitting the core staffing plan, as required in subdivision 3, hospitals shall consult with representatives of the hospital medical staff, managerial and nonmanagerial care staff, and other relevant hospital personnel about the core staffing plan and the expected average number of patients upon which the staffing plan is based.\n(a) Hospitals must submit the core staffing plans to the Minnesota Hospital Association by January 1, 2014. The Minnesota Hospital Association shall include each reporting hospital's core staffing plan on the Minnesota Hospital Association's Minnesota Hospital Quality Report website by April 1, 2014. Any substantial changes to the core staffing plan shall be updated within 30 days.\n(b) The Minnesota Hospital Association shall include on its website for each reporting hospital on a quarterly basis the actual direct patient care hours per patient and per unit. Hospitals must submit the direct patient care report to the Minnesota Hospital Association by July 1, 2014, and quarterly thereafter.",
	"repealed": false
}