{
	"id": "256B.066",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.066",
	"title": "256B.066 ORTHOTIC AND PROSTHETIC DEVICES, SUPPLIES, AND SERVICES.",
	"text": "All terms used in this section have the meanings given them in section 62Q.665, subdivision 1.\n(a) Medical assistance covers orthotic and prosthetic devices, supplies, and services:\n(1) furnished under an order by a prescribing physician or licensed health care prescriber who has authority in Minnesota to prescribe orthoses and prostheses. Coverage for orthotic and prosthetic devices, supplies, accessories, and services under this clause includes those devices or device systems, supplies, accessories, and services that are customized to the enrollee's needs;\n(2) determined by the enrollee's provider to be the most appropriate model that meets the medical needs of the enrollee for purposes of performing physical activities, as applicable, including but not limited to running, biking, and swimming, and maximizing the enrollee's limb function; or\n(3) for showering or bathing.\n(b) The coverage set forth in paragraph (a) includes the repair and replacement of those orthotic and prosthetic devices, supplies, and services described therein.\n(c) Coverage of a prosthetic or orthotic benefit must not be denied for an individual with limb loss or absence that would otherwise be covered for a nondisabled person seeking medical or surgical intervention to restore or maintain the ability to perform the same physical activity.\n(d) If coverage for prosthetic or custom orthotic devices is provided, payment must be made for the replacement of a prosthetic or custom orthotic device or for the replacement of any part of the devices, without regard to useful lifetime restrictions, if an ordering health care provider determines that the provision of a replacement device, or a replacement part of a device, is necessary because:\n(1) of a change in the physiological condition of the enrollee;\n(2) of an irreparable change in the condition of the device or in a part of the device; or\n(3) the condition of the device, or the part of the device, requires repairs and the cost of the repairs would be more than 60 percent of the cost of a replacement device or of the part being replaced.\n(a) Prior authorization may be required for orthotic and prosthetic devices, supplies, and services.\n(b) A utilization review for a request for coverage of prosthetic or orthotic benefits must apply the most recent version of evidence-based treatment and fit criteria as recognized by relevant clinical specialists.\n(c) Utilization review determinations must be rendered in a nondiscriminatory manner and must not deny coverage for habilitative or rehabilitative benefits, including protheses or orthoses, solely on the basis of an enrollee's actual or perceived disability.\n(d) Evidence of coverage and any benefit denial letters must include language describing an enrollee's rights pursuant to paragraphs (b) and (c).\n(e) Confirmation from a prescribing health care provider may be required if the prosthetic or custom orthotic device or part being replaced is less than three years old.\n(a) Managed care plans and county-based purchasing plans subject to this section must ensure access to medically necessary clinical care and to prosthetic and custom orthotic devices and technology from at least two distinct prosthetic and custom orthotic providers in the plan's provider network located in Minnesota.\n(b) In the event that medically necessary covered orthoses and protheses are not available from an in-network provider, the plan must provide processes to refer an enrollee to an out-of-network provider and must fully reimburse the out-of-network provider at a mutually agreed upon rate less enrollee cost sharing determined on an in-network basis.",
	"repealed": false
}