{
	"id": "142D.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.13",
	"title": "142D.13 QUALITY RATING AND IMPROVEMENT SYSTEM.",
	"text": "A quality rating and improvement system (QRIS) framework, known as Parent Aware, is established to ensure that Minnesota's children have access to high-quality early learning and care programs in a range of settings so that they are fully ready for kindergarten.\n(a) The standards-based voluntary quality rating and improvement system includes:\n(1) effective July 1, 2026, at least a one-star rating for all programs licensed under Minnesota Rules, chapter 9502 or 9503, or Tribally licensed that do not opt out of the system under paragraph (b) and that are not:\n(i) the subject of a finding of fraud for which the program or individual is currently serving a penalty or exclusion;\n(ii) prohibited from receiving public funds under section 142A.12, regardless of whether the action is under appeal;\n(iii) under revocation, suspension, temporary immediate suspension, or decertification, or is operating under a conditional license, regardless of whether the action is under appeal; or\n(iv) the subject of suspended, denied, or terminated payments to a provider under section 142E.17, subdivision 9, paragraph (d), clause (1) or (2); 142E.51, subdivision 7, paragraph (c), clause (4); or 256.98, subdivision 1, regardless of whether the action is under appeal;\n(2) quality opportunities in order to improve the educational outcomes of children so that they are ready for school;\n(3) a framework based on the Minnesota quality rating system rating tool and a common set of child outcome and program standards informed by evaluation results;\n(4) a tool to increase the number of publicly funded and regulated early learning and care services in both public and private market programs that are high quality;\n(5) voluntary participation ensuring that if a program or provider chooses to participate, the program or provider will be rated and may receive public funding associated with the rating; and\n(6) tracking progress toward statewide access to high-quality early learning and care programs, progress toward the number of low-income children whose parents can access quality programs, and progress toward increasing the number of children who are fully prepared to enter kindergarten.\n(b) By July 1, 2026, the commissioner of children, youth, and families shall establish a process by which a program may opt out of the rating under paragraph (a), clause (1). The commissioner shall consult with Tribes to develop a process for rating Tribally licensed programs that is consistent with the goal outlined in paragraph (a), clause (1).\n(a) By February 1, 2022, the commissioner of children, youth, and families must arrange an independent evaluation of the quality rating and improvement system's effectiveness and impact on:\n(1) children's progress toward school readiness;\n(2) the quality of the early learning and care system supply and workforce;\n(3) parents' ability to access and use meaningful information about early learning and care program quality; and\n(4) providers' ability to serve children and families, including those from racially, ethnically, or culturally diverse backgrounds.\n(b) The evaluation must be performed by a staff member from another agency or a consultant. An evaluator must have experience in program evaluation and must not be regularly involved in implementing the quality rating and improvement system.\n(c) The evaluation findings, along with the commissioner's recommendations for revisions, potential future evaluations, and plans for continuous improvement, must be reported to the chairs and ranking minority members of the legislative committees with jurisdiction over early childhood programs by December 31, 2024.\n(d) At a minimum, the evaluation must:\n(1) analyze the effectiveness of the quality rating and improvement system, including but not limited to reviewing:\n(i) whether quality indicators and measures used in the quality rating and improvement system are consistent with evidence and research findings on early learning and care program quality; and\n(ii) patterns or differences in observed quality of participating early learning and care programs in comparison to programs at other quality rating and improvement system star rating levels and accounting for other factors;\n(2) perform evidence-based assessments of children's developmental gains aligned with the state early childhood indicators of progress, including in ways that are appropriate for children's linguistic and cultural backgrounds;\n(3) analyze the extent to which differences in developmental gains among children correspond to the star ratings of the early learning and care programs, providing disaggregated findings by:\n(i) children's demographic factors, including geographic area, family income level, and racial and ethnic groups;\n(ii) type of provider, including family child care providers, child care centers, Head Start and Early Head Start, and school-based early childhood providers; and\n(iii) any other categories identified by the commissioner, in consultation with the commissioners of health and education or the entity performing the evaluation;\n(4) analyze the accessibility for providers to participate in the quality rating and improvement system, including ease of application and supports for a provider to receive or improve a rating, and provide disaggregated findings by children's demographic factors and type of provider, as each is defined in clause (3);\n(5) analyze the availability of providers participating in the quality rating and improvement system to families, and provide disaggregated findings by children's demographic factors and type of provider, as each is defined in clause (3);\n(6) analyze the degree to which the quality rating and improvement system accounts for racial, cultural, linguistic, and ethnic diversity when measuring quality; and\n(7) analyze the impact of financial or administrative requirements of the quality rating and improvement system on family child care providers and child care providers, including those providers serving racially, ethnically, and culturally diverse communities.\n(e) The evaluation must include a comparison of the quality rating and improvement system with at least three other quality metric systems used in other states. The other chosen metric systems must incorporate methods of assessing and monitoring developmental and achievement benchmarks in early care and education settings to assess kindergarten readiness, including for racially, ethnically, and culturally diverse populations.\nThe Department of Children, Youth, and Families shall conduct outreach to a racially, ethnically, culturally, and geographically diverse group of early learning and care providers to identify any barriers that prevent the providers from pursuing a Parent Aware rating. The department shall summarize and submit the results of the outreach, along with a plan for reducing those barriers, to the chairs and ranking minority members of the legislative committees with jurisdiction over early learning and care programs by March 1, 2022.",
	"repealed": false
}