{
	"id": "216B.2402",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2402",
	"title": "216B.2402 DEFINITIONS.",
	"text": "For the purposes of section 216B.16, subdivision 6b, and sections 216B.2401 to 216B.241, the following terms have the meanings given them.\n\"Consumer-owned utility\" means a municipal gas utility, a municipal electric utility, or a cooperative electric association.\n\"Cumulative lifetime savings\" means the total electric energy or natural gas savings in a given year from energy conservation improvements installed in that given year and energy conservation improvements installed in previous years that are still in operation.\n\"Data mining facility\" means all buildings, structures, equipment, and installations at a single site where electricity is used primarily by computers to process transactions involving digital currency that is not issued by a central authority.\n\"Efficient fuel-switching improvement\" means a project that:\n(1) replaces a fuel used by a customer with electricity or natural gas delivered at retail by a utility subject to section 216B.2403 or 216B.241;\n(2) results in a net increase in the use of electricity or natural gas and a net decrease in source energy consumption on a fuel-neutral basis;\n(3) otherwise meets the criteria established for consumer-owned utilities in section 216B.2403, subdivision 8, and for public utilities under section 216B.241, subdivisions 11 and 12; and\n(4) requires the installation of equipment that utilizes electricity or natural gas, resulting in a reduction or elimination of the previous fuel used.\nAn efficient fuel-switching improvement is not an energy conservation improvement or energy efficiency even if the efficient fuel-switching improvement results in a net reduction in electricity or natural gas use.\n\"Energy conservation\" means an action that results in a net reduction in electricity or natural gas consumption. Energy conservation does not include an efficient fuel-switching improvement.\n\"Energy conservation improvement\" means a project that results in energy efficiency or energy conservation. Energy conservation improvement may include waste heat that is recovered and converted into electricity or used as thermal energy, but does not include electric utility infrastructure projects approved by the commission under section 216B.1636.\n\"Energy efficiency\" means measures or programs, including energy conservation measures or programs, that: (1) target consumer behavior, equipment, processes, or devices; (2) are designed to reduce the consumption of electricity or natural gas on either an absolute or per unit of production basis; and (3) do not reduce the quality or level of service provided to an energy consumer.\n\"Fuel\" means energy, including electricity, propane, natural gas, heating oil, gasoline, diesel fuel, or steam, consumed by a retail utility customer.\n\"Fuel neutral\" means an approach that compares the use of various fuels for a given end use, using a common metric.\n\"Gross annual retail energy sales\" means a utility's annual electric sales to all Minnesota retail customers, or natural gas throughput to all retail customers, including natural gas transportation customers, on a utility's distribution system in Minnesota. Gross annual retail energy sales does not include:\n(1) gas sales to:\n(i) a large energy facility;\n(ii) a large customer facility whose natural gas utility has been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (a), with respect to natural gas sales made to the large customer facility; and\n(iii) a commercial gas customer facility whose natural gas utility has been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (b), with respect to natural gas sales made to the commercial gas customer facility;\n(2) electric sales to:\n(i) a large customer facility whose electric utility has been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (a), with respect to electric sales made to the large customer facility; and\n(ii) a data mining facility, if the facility:\n(A) has provided a signed letter to the utility verifying the facility meets the definition of a data mining facility; and\n(B) imposes a peak electrical demand on a consumer-owned utility's system equal to or greater than 40 percent of the peak electrical demand of the system, measured in the same manner as the utility that serves the customer facility measures electric demand for billing purposes; or\n(3) the amount of electric sales prior to December 31, 2032, that are associated with a utility's program, rate, or tariff for electric vehicle charging based on a methodology and assumptions developed by the department in consultation with interested stakeholders no later than December 31, 2021. After December 31, 2032, incremental sales to electric vehicles must be included in calculating a public utility's gross annual retail sales.\n\"Investments and expenses of a public utility\" means the investments and expenses incurred by a public utility in connection with an energy conservation improvement.\n\"Large customer facility\" means all buildings, structures, equipment, and installations at a single site that in aggregate: (1) impose a peak electrical demand on an electric utility's system of at least 20,000 kilowatts, measured in the same way as the utility that serves the customer facility measures electric demand for billing purposes; or (2) consume at least 500,000,000 cubic feet of natural gas annually. When calculating peak electrical demand, a large customer facility may include demand offset by on-site cogeneration facilities and, if engaged in mineral extraction, may include peak energy demand from the large customer facility's mining processing operations.\n\"Large energy facility\" has the meaning given in section 216B.2421, subdivision 2, clause (1).\n\"Lifetime energy savings\" means the amount of savings a particular energy conservation improvement is projected to produce over the improvement's effective useful lifetime.\n\"Load management\" means an activity, service, or technology that changes the timing or the efficiency of a customer's use of energy that allows a utility or a customer to: (1) respond to local and regional energy system conditions; or (2) reduce peak demand for electricity or natural gas. Load management that reduces a customer's net annual energy consumption is also energy conservation.\n\"Low-income household\" means a household whose household income:\n(1) is 80 percent or less of the area median household income for the geographic area in which the low-income household is located, as calculated by the United States Department of Housing and Urban Development; or\n(2) meets the income eligibility standards, as determined by the commissioner, required for a household to receive financial assistance from a federal, state, municipal, or utility program administered or approved by the department.\n\"Low-income programs\" means energy conservation improvement and efficient fuel-switching programs that directly serve the needs of low-income households, including low-income renters.\n\"Member\" has the meaning given in section 308B.005, subdivision 15.\n\"Multifamily building\" means a residential building containing five or more dwelling units.\n\"Preweatherization measure\" means an improvement that is necessary to allow energy conservation improvements to be installed in a home.\n\"Qualifying utility\" means a utility that supplies a customer with energy that enables the customer to qualify as a large customer facility.\n\"Waste heat recovered and used as thermal energy\" means capturing heat energy that would be exhausted or dissipated to the environment from machinery, buildings, or industrial processes, and productively using the recovered thermal energy where it was captured or distributing it as thermal energy to other locations where it is used to reduce demand-side consumption of natural gas, electric energy, or both.\n\"Waste heat recovery converted into electricity\" means an energy recovery process that converts to electricity energy from the heat of exhaust stacks or pipes used for engines or manufacturing or industrial processes, or from the reduction of high pressure in water or gas pipelines, that would otherwise be lost.",
	"repealed": false
}