{
	"id": "85.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.53",
	"title": "85.53 PARKS AND TRAILS FUND.",
	"text": "The parks and trails fund is established in the Minnesota Constitution, article XI, section 15. All money earned by the parks and trails fund must be credited to the fund.\n(a) A project or program receiving funding from the parks and trails fund must meet or exceed the constitutional requirement to support parks and trails of regional or statewide significance. A project or program receiving funding from the parks and trails fund must include measurable outcomes, as defined in section 3.303, subdivision 10; a plan for measuring and evaluating the results; and an assessment of whether the funding celebrates cultural diversity or reaches diverse communities in Minnesota, including reaching low- and moderate-income households. A project or program must be consistent with current science and incorporate state-of-the-art technology, except when the project or program is a portrayal or restoration of historical significance.\n(b) Money from the parks and trails fund shall be expended to balance the benefits across all regions and residents of the state.\n(c) A state agency or other recipient of a direct appropriation from the parks and trails fund must compile and submit all information for funded projects or programs, including the proposed measurable outcomes and all other items required under section 3.303, subdivision 10, to the Legislative Coordinating Commission as soon as practicable or by January 15 of the applicable fiscal year, whichever comes first. The Legislative Coordinating Commission must post submitted information on the website required under section 3.303, subdivision 10, as soon as it becomes available.\n(d) Grants funded by the parks and trails fund must be implemented according to section 16B.98 and must account for all expenditures. Proposals must specify a process for any regranting envisioned. Priority for grant proposals must be given to proposals involving grants that will be competitively awarded.\n(e) Money from the parks and trails fund may only be spent on projects located in Minnesota.\n(f) When practicable, a direct recipient of an appropriation from the parks and trails fund shall prominently display on the recipient's website home page the legacy logo required under Laws 2009, chapter 172, article 5, section 10, as amended by Laws 2010, chapter 361, article 3, section 5, accompanied by the phrase \"Click here for more information.\" When a person clicks on the legacy logo image, the website must direct the person to a web page that includes both the contact information that a person may use to obtain additional information, as well as a link to the Legislative Coordinating Commission website required under section 3.303, subdivision 10.\n(g) Future eligibility for money from the parks and trails fund is contingent upon a state agency or other recipient satisfying all applicable requirements in this section, as well as any additional requirements contained in applicable session law. If the Office of the Legislative Auditor, in the course of an audit or investigation, publicly reports that a recipient of money from the parks and trails fund has not complied with the laws, rules, or regulations in this section or other laws applicable to the recipient, the recipient must be listed in an annual report to the legislative committees with jurisdiction over the legacy funds. The list must be publicly available. The legislative auditor shall remove a recipient from the list upon determination that the recipient is in compliance. A recipient on the list is not eligible for future funding from the parks and trails fund until the recipient demonstrates compliance to the legislative auditor.\n(h) Any state agency or organization requesting a direct appropriation from the parks and trails fund must inform the house of representatives and senate committees having jurisdiction over the parks and trails fund, at the time the request for funding is made, whether the request is supplanting or is a substitution for any previous funding that was not from a legacy fund and was used for the same purpose.\nMoney appropriated from the parks and trails fund to the Metropolitan Council shall be distributed to implementing agencies, as defined in section 473.351, subdivision 1, paragraph (a), as grants according to the following formula:\n(1) 45 percent of the money must be disbursed according to the allocation formula in section 473.351, subdivision 3, to each implementing agency;\n(2) 31.5 percent of the money must be distributed based on each implementing agency's relative share of the most recent estimate of the population of the metropolitan area;\n(3) 13.5 percent of the money must be distributed based on each implementing agency's relative share of nonlocal visits based on the most recent user visitation survey conducted by the Metropolitan Council; and\n(4) ten percent of the money must be distributed as grants to implementing agencies for land acquisition within Metropolitan Council approved regional parks and trails master plan boundaries under the council's park acquisition opportunity grant program. The Metropolitan Council must provide a match of $2 of the council's park bonds for every $3 of state funds for the park acquisition opportunity grant program.\nData collected by the projects funded with money from the parks and trails fund that have value for planning and management of natural resources, emergency preparedness, and infrastructure investments must conform to the enterprise information architecture developed by the Department of Information Technology Services. Spatial data must conform to geographic information system guidelines and standards outlined in that architecture and adopted by the Minnesota Geographic Data Clearinghouse at the Minnesota Geospatial Information Office. A description of these data that adheres to the Department of Information Technology Services geographic metadata standards must be submitted to the Minnesota Geospatial Information Office to be made available online through the clearinghouse and the data must be accessible and free to the public unless made private under chapter 13. To the extent practicable, summary data and results of projects and programs funded with money from the parks and trails fund should be readily accessible on the Internet and identified as a parks and trails fund project.\n(a) The commissioner of natural resources may convene a technical evaluation panel comprised of five members, including one technical representative from the Board of Water and Soil Resources, one technical representative from the Department of Natural Resources, one technical expert from the University of Minnesota or the Minnesota State Colleges and Universities, and two other representatives with expertise related to the project being evaluated. The commissioner may add a technical representative from a unit of federal or local government.\n(b) The members of the technical evaluation panel may not be associated with the restoration, may vary depending upon the projects being reviewed, and shall avoid any potential conflicts of interest.\n(c) Each year, the commissioner may assign a coordinator to identify a sample of up to ten habitat restoration projects completed with parks and trails funding. The coordinator shall secure the restoration plans for the projects specified and direct the technical evaluation panel to evaluate the restorations relative to the law, current science, and the stated goals and standards in the restoration plan and, when applicable, to the Board of Water and Soil Resources' Native Vegetation Establishment and Enhancement Guidelines.\n(d) The coordinator shall summarize the findings of the panel and provide a report to the chairs of the respective house of representatives and senate policy and finance committees with jurisdiction over natural resources and spending from the parks and trails fund. The report shall determine if the restorations are meeting planned goals, any problems with the implementation of restorations, and, if necessary, recommendations on improving restorations. The report shall be focused on improving future restorations.\n(e) Up to one-tenth of one percent of forecasted receipts from the parks and trails fund may be used for restoration evaluations under this section.\nIn any fiscal year, at least five percent of that year's projected tax receipts determined by the most recent forecast for the parks and trails fund must not be appropriated.\nAn implementing agency, county, or city that charges an entrance fee or requires a vehicle permit must provide free access to all its parks at least four days each calendar year in order to be eligible for money appropriated from the parks and trails fund. The implementing agency, county, or city must publicly announce the date when entrance will be free at least 30 days in advance of the date it occurs.",
	"repealed": false
}