{
	"id": "60A.952",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.952",
	"title": "60A.952 DISCLOSURE OF INFORMATION.",
	"text": "After receiving a written request from an authorized person stating that the authorized person has reason to believe that a crime or civil fraud has been committed in connection with an insurance claim, insurance transaction, payment, or application, an insurer must release to the authorized person all relevant information in the insurer's possession.\nAny insurer or insurance professional that has reasonable belief that an act of insurance fraud will be, is being, or has been committed, shall furnish and disclose all relevant information to the Commerce Fraud Bureau or to any authorized person and cooperate fully with any investigation conducted by the Commerce Fraud Bureau. Any person that has a reasonable belief that an act of insurance fraud will be, is being, or has been committed, or any person who collects, reviews, or analyzes information concerning insurance fraud may furnish and disclose any information in its possession concerning the act to the Commerce Fraud Bureau, any authorized person, or to an authorized representative of an insurer that requests the information for the purpose of detecting, prosecuting, or preventing insurance fraud. The insurer may also release relevant information to any person authorized to receive the information under section 72A.502, subdivision 2. If disclosure is made to an authorized person other than the Commerce Fraud Bureau, a copy of the disclosure must be sent to the Commerce Fraud Bureau.\nIf insurers, insurance support organizations as defined in section 72A.491, subdivision 12, agents acting on the insurers' behalf, or authorized persons release information in good faith under this section, whether orally or in writing, they are immune from any liability, civil or criminal, for the release or reporting of the information.\nIf an insurer has a reasonable or probable cause to believe that an insurance fraud has been committed in connection with an insurance claim, and has properly notified the Commerce Fraud Bureau of its suspicions according to subdivision 2, the notification tolls any applicable time period in any unfair claims practices statute or related regulations, or any action on the claim against the insurer to whom the claim had been presented for bad faith, until 30 days after determination by the Commerce Fraud Bureau and notice to the insurer that the division will not recommend action on the claim.\nThe Commerce Fraud Bureau, in cooperation with authorized insurers and insurance professionals, may establish a voluntary fund to reward persons not connected with the insurance industry who provide information or furnish evidence leading to the arrest and conviction of persons responsible for insurance fraud.",
	"repealed": false
}