{
	"id": "473H.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.15",
	"title": "473H.15 EMINENT DOMAIN ACTIONS.",
	"text": "Any agency of the state, any public benefit corporation, any local, county or regional unit of government, or any other entity possessing powers of eminent domain under chapter 117, shall follow the procedures contained in this section before (1) acquiring any land or easement having a gross area over ten acres in size within agricultural preserves; or (2) advancing a grant, loan, interest subsidy or other funds for the construction of dwellings, commercial or industrial facilities, or water or sewer facilities that could be used to serve nonfarm structures within agricultural preserves.\nAt least 60 days prior to an action described in subdivision 1, notice of intent shall be filed with the Environmental Quality Board containing information and in the manner and form required by the Environmental Quality Board. The notice of intent shall contain a report justifying the proposed action, including an evaluation of alternatives which would not require acquisition within agricultural preserves.\nThe Environmental Quality Board, in consultation with affected units of government, shall review the proposed action to determine the effect of the action on the preservation and enhancement of agriculture and agricultural resources within the preserves and the relationship to local and regional comprehensive plans.\nIf the Environmental Quality Board finds that the proposed action might have an unreasonable effect on an agricultural preserve or preserves, the Environmental Quality Board shall issue an order within the 60-day period for the party to desist from such action for an additional 60-day period.\nDuring the additional 60-day period, the Environmental Quality Board shall hold a public hearing concerning the proposed action at a place within the affected preserve or otherwise easily accessible to the preserve upon notice in a newspaper having a general circulation within the area of the preserves, and individual notice, in writing, to the municipalities whose territory encompasses the preserves, the agency, corporation or government proposing to take the action, and any public agency having the power of review of or approval of the action, in a manner conducive to the wide dissemination of the findings to the public.\nThe review process required in this section may be conducted jointly with any other environmental impact review conducted by the Environmental Quality Board.\nThe Environmental Quality Board may request the attorney general to bring an action to enjoin any agency, corporation or government from violating the provisions of this section.\nThis section shall not apply to an emergency project which is immediately necessary for the protection of life and property.\nThe Environmental Quality Board shall be empowered to suspend any eminent domain action for up to one year which it determines to be contrary to the purposes of sections 473H.02 to 473H.17 and for which it determines there are feasible and prudent alternatives which have less negative impact on the agricultural preserves.\nThe agricultural preserve designation and all benefits and limitations accruing through sections 473H.02 to 473H.17 for the preserve and the restrictive covenant for that portion of the preserve taken, shall cease on the date the final certificate is filed with the court administrator of district court in accordance with section 117.205.",
	"repealed": false
}