{
	"id": "216B.1645",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1645",
	"title": "216B.1645 POWER PURCHASE CONTRACT OR INVESTMENT.",
	"text": "Upon the petition of a public utility, the Public Utilities Commission shall approve or disapprove power purchase contracts, investments, or expenditures entered into or made by the utility to satisfy the wind and biomass mandates contained in sections 216B.169, 216B.2423, and 216B.2424, and to satisfy the renewable energy objectives and standards set forth in section 216B.1691, including reasonable investments and expenditures made to:\n(1) transmit the electricity generated from sources developed under those sections that is ultimately used to provide service to the utility's retail customers, including studies necessary to identify new transmission facilities needed to transmit electricity to Minnesota retail customers from generating facilities constructed to satisfy the renewable energy objectives and standards, provided that the costs of the studies have not been recovered previously under existing tariffs and the utility has filed an application for a certificate of need or for certification as a priority project under section 216B.2425 for the new transmission facilities identified in the studies;\n(2) provide storage facilities for renewable energy generation facilities that contribute to the reliability, efficiency, or cost-effectiveness of the renewable facilities; or\n(3) develop renewable energy sources from the account required in section 116C.779.\n(a) The following expenses are recoverable from utility ratepayers:\n(1) expenses incurred to employ local workers, as defined in section 216B.2422, subdivision 1, to construct and maintain generation facilities that supply power to the utility's customers; and\n(2) expenses incurred by the utility over the duration of an approved contract or the useful life of an investment and expenditures made pursuant to section 116C.779, provided they are not offset by utility revenues attributable to the contracts, investments, or expenditures.\n(b) Upon petition by a public utility, the commission shall approve or approve as modified a rate schedule providing for the automatic adjustment of charges to recover the expenses or costs approved by the commission under subdivision 1, which, in the case of transmission expenditures, are limited to the portion of actual transmission costs that are directly allocable to the need to transmit power from the renewable sources of energy. The commission may not approve recovery of the costs for that portion of the power generated from sources governed by this section that the utility sells into the wholesale market.\n(a) A utility may petition the commission to approve a rate schedule that provides for the automatic adjustment of charges to recover prudently incurred investments, expenses, or costs associated with facilities constructed, owned, or operated by a utility to satisfy the requirements of section 216B.1691, provided those facilities were previously approved by the commission under section 216B.2422 or 216B.243, or were determined by the commission to be reasonable and prudent under section 216B.243, subdivision 9. For facilities not subject to review by the commission under section 216B.2422 or 216B.243, a utility shall petition the commission for eligibility for cost recovery under this section prior to requesting cost recovery for the facility. The commission may approve, or approve as modified, a rate schedule that:\n(1) allows a utility to recover directly from customers on a timely basis the costs of qualifying renewable energy projects, including:\n(i) return on investment;\n(ii) depreciation;\n(iii) ongoing operation and maintenance costs;\n(iv) taxes; and\n(v) costs of transmission and other ancillary expenses directly allocable to transmitting electricity generated from a project meeting the specifications of this paragraph;\n(2) provides a current return on construction work in progress, provided that recovery of these costs from Minnesota ratepayers is not sought through any other mechanism;\n(3) allows recovery of other expenses incurred that are directly related to a renewable energy project, including expenses for energy storage, provided that the utility demonstrates to the commission's satisfaction that the expenses improve project economics, ensure project implementation, advance research and understanding of how storage devices may improve renewable energy projects, or facilitate coordination with the development of transmission necessary to transport energy produced by the project to market;\n(4) allocates recoverable costs appropriately between wholesale and retail customers;\n(5) terminates recovery when costs have been fully recovered or have otherwise been reflected in a utility's rates.\n(b) A petition filed under this subdivision must include:\n(1) a description of the facilities for which costs are to be recovered;\n(2) an implementation schedule for the facilities;\n(3) the utility's costs for the facilities;\n(4) a description of the utility's efforts to ensure that costs of the facilities are reasonable and were prudently incurred; and\n(5) a description of the benefits of the project in promoting the development of renewable energy in a manner consistent with this chapter.\nNothing in this section shall be construed to determine the manner or extent to which revenues derived from other generation facilities of the utility may be considered in determining the recovery of the approved cost or expenses associated with the mandated contracts, investments, or expenditures in the event there is retail competition for electric energy.\n(a) The commission shall approve a rate schedule providing for the automatic adjustment of charges to recover the costs or expenses of a settlement between the public utility that owns the Prairie Island nuclear generation facility and the Prairie Island Indian Community at Prairie Island, resolving outstanding disputes regarding the provisions of Laws 1994, chapter 641, article 1, section 4. The settlement must provide for annual payments, not to exceed $2,500,000 annually, by the public utility to the Prairie Island Indian Community, to be used for, among other purposes, acquiring land in Minnesota within 50 miles of the tribal community's reservation at Prairie Island to be taken into trust by the federal government for the benefit of the tribal community. The legislature acknowledges that the intent to purchase land by the tribe for relocation purposes is part of the settlement agreement and Laws 2003, First Special Session chapter 11. However, the state, through the governor, reserves the right to support or oppose any particular application to place land in trust status.\n(b) In addition to payments required under paragraph (a), the public utility that owns the Prairie Island nuclear generating facility must make the following annual payments to the Prairie Island Indian Community:\n(1) $7,500,000 for each year the Prairie Island nuclear generating facility is in licensed operation; and\n(2) $50,000 for each dry cask or container containing spent fuel that is located at the Prairie Island nuclear generating facility, whether or not the plant is in licensed operation.\n(c) The commission shall approve a rate schedule providing for the automatic adjustment of charges to retail electricity customers of the public utility that owns the Prairie Island nuclear generating facility to recover the amounts in paragraph (b), clauses (1) and (2).\n(d) Paragraphs (b) and (c) apply only if the public utility that owns the Prairie Island nuclear generation facility enters into a new or amended settlement agreement with the Prairie Island Indian Community.\n(e) Payments made under this subdivision may be used by the Prairie Island Indian Community for any purpose benefitting the Prairie Island Indian Community. Payments made under this subdivision shall constitute prudent operating expenses for the public utility that owns the Prairie Island nuclear generation facility, and shall constitute consideration for any amended settlement agreement entered into between the public utility and the Prairie Island Indian Community. This subdivision is intended to apply to any successors in interest or assignees of the Prairie Island nuclear generation facility and Prairie Island Independent Spent Fuel Storage Installation.\n(f) The commission's approval of a certificate of need under section 216B.243 allowing for the additional storage of spent nuclear fuel necessary for the extended operation of the Prairie Island nuclear plant is effective only if the governor, on behalf of the state, and the public utility operating the Prairie Island nuclear generating plant enter into an agreement binding the parties to the required payments and payment recovery terms of paragraphs (b) and (c). The Prairie Island Indian Community is an intended beneficiary of this agreement and has standing to enforce the agreement.",
	"repealed": false
}