{
	"id": "148B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.30",
	"title": "148B.30 BOARD OF MARRIAGE AND FAMILY THERAPY.",
	"text": "(a) There is created a Board of Marriage and Family Therapy that consists of seven members appointed by the governor. Four members shall be licensed, practicing marriage and family therapists, each of whom shall for at least five years immediately preceding appointment, have been actively engaged as a marriage and family therapist, rendering professional services in marriage and family therapy. One member shall be engaged in the professional teaching and research of marriage and family therapy. Two members shall be representatives of the general public who have no direct affiliation with the practice of marriage and family therapy. All members shall have been a resident of the state two years preceding their appointment. Of the first board members appointed, three shall continue in office for two years, two members for three years, and two members, including the chair, for terms of four years respectively. Their successors shall be appointed for terms of four years each, except that a person chosen to fill a vacancy shall be appointed only for the unexpired term of the board member whom the newly appointed member succeeds. Upon the expiration of a board member's term of office, the board member shall continue to serve until a successor is appointed and qualified.\n(b) At the time of their appointments, at least two members must reside outside of the seven-county metropolitan area.\n(c) At the time of their appointments, at least two members must be members of:\n(1) a community of color; or\n(2) an underrepresented community, defined as a group that is not represented in the majority with respect to race, ethnicity, national origin, sexual orientation, gender identity, or physical ability.\nMS 2018 [Repealed, 2019 c 52 s 20]\nThe board shall annually elect from its membership a chair, a vice-chair, and secretary-treasurer, and shall adopt rules to govern its proceedings. The board shall appoint and employ an executive secretary who shall not be a member of the board.\nThe membership terms, compensation, and removal of board members is governed by section 15.0575, unless superseded by this section.",
	"repealed": false
}