{
	"id": "402A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/402A.20",
	"title": "402A.20 COUNCIL.",
	"text": "(a) The State-County Results, Accountability, and Service Delivery Redesign Council is established. Appointed council members must be appointed by their respective agencies, associations, or governmental units by November 1, 2009. The council shall be cochaired by the commissioner of human services, or designee, and a county representative from paragraph (b), clause (4) or (5), appointed by the Association of Minnesota Counties. Recommendations of the council must be approved by a majority of the voting council members. The provisions of section 15.059 do not apply to this council, and this council does not expire.\n(b) The council must consist of the following members:\n(1) two legislators appointed by the speaker of the house, one from the minority and one from the majority;\n(2) two legislators appointed by the Senate Rules Committee, one from the majority and one from the minority;\n(3) the commissioner of human services, or designee, and three employees from the department;\n(4) two county commissioners appointed by the Association of Minnesota Counties;\n(5) two county representatives appointed by the Minnesota Association of County Social Service Administrators;\n(6) one representative appointed by AFSCME as a nonvoting member; and\n(7) one representative appointed by the Teamsters as a nonvoting member.\n(c) Administrative support to the council may be provided by the Association of Minnesota Counties and affiliates.\n(d) Member agencies and associations are responsible for initial and subsequent appointments to the council.\nThe council shall:\n(1) provide review of the service delivery redesign process, including proposed memoranda of understanding to establish a service delivery authority to conduct and administer experimental projects to test new methods and procedures of delivering services;\n(2) ensure the consistency of the memorandum of understanding, to the extent appropriate, with other memorandum of understanding entered into by other service delivery authorities;\n(3) review and make recommendations on applications from a service delivery authority for waivers of statutory or rule program requirements that are needed for flexibility to determine the most cost-effective means of achieving specified measurable goals in a redesign of human services delivery;\n(4) establish a process to take public input on the scope of essential services over which a service delivery authority has jurisdiction;\n(5) form work groups as necessary to carry out the duties of the council under the redesign;\n(6) serve as a forum for resolving conflicts among participating counties and tribes or between participating counties or tribes and the commissioner of human services, provided nothing in this section is intended to create a formal binding legal process;\n(7) engage in the program improvement process established in section 402A.18, subdivision 3; and\n(8) identify and recommend incentives for counties and tribes to participate in service delivery authorities.\nBy December 15, 2014, the council shall request consideration by the legislative auditor for a reevaluation under section 3.971, subdivision 7, of those aspects of the program evaluation of human services administration reported in January 2007 affected by this chapter.",
	"repealed": false
}