{
	"id": "136A.822",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.822",
	"title": "136A.822 LICENSURE.",
	"text": "A private career school must not maintain a physical presence for any program in Minnesota without first obtaining a license from the office.\nA contract entered into with a person for a program by or on behalf of a person operating a private career school with a physical presence in Minnesota to which a license has not been issued under sections 136A.821 to 136A.833, is unenforceable in any action.\nIf a contract is deemed unenforceable under subdivision 2, a private career school must refund tuition, fees, and other charges received from a student or on behalf of a student within 30 days of receiving written notification and demand for refund from the office.\nApplication for a license shall be on forms prepared and furnished by the office, and shall include the following and other information as the office may require:\n(1) the title or name of the private career school, ownership and controlling officers, members, managing employees, and director;\n(2) the specific programs which will be offered and the specific purposes of the instruction;\n(3) the place or places where the instruction will be given;\n(4) a listing of the equipment available for instruction in each program;\n(5) the maximum enrollment to be accommodated with equipment available in each specified program;\n(6) the qualifications of instructors and supervisors in each specified program;\n(7) financial documents related to the entity's and higher-level entity's most recently completed fiscal year:\n(i) annual gross revenues from all sources;\n(ii) financial statements subjected to a review-level engagement or, if requested by the office, audited financial statements;\n(iii) a school's most recent compliance audit, if applicable; and\n(iv) a current balance sheet, income statement, and adequate supporting documentation, prepared and certified by an independent public accountant or CPA;\n(8) copies of all media advertising and promotional literature and brochures or electronic display currently used or reasonably expected to be used by the private career school;\n(9) copies of all Minnesota enrollment agreement forms and contract forms and all enrollment agreement forms and contract forms used in Minnesota; and\n(10) gross income earned in the preceding year from student tuition, fees, and other required institutional charges.\nEach application shall be signed and certified to under oath by the proprietor if the applicant is a proprietorship, by the managing partner if the applicant is a partnership, or by the authorized officers of the applicant if the applicant is a corporation, association, company, firm, society or trust.\n(a) No license shall be issued to any private career school with a physical presence within the state of Minnesota for any program, unless the applicant files with the office a continuous corporate surety bond written by a company authorized to do business in Minnesota conditioned upon the faithful performance of all contracts and agreements with students made by the applicant.\n(b)(1) The amount of the surety bond shall be ten percent of the preceding year's net revenue from student tuition, fees, and other required institutional charges collected, but in no event less than $10,000, except that a private career school may deposit a greater amount at its own discretion. A private career school in each annual application for licensure must compute the amount of the surety bond and verify that the amount of the surety bond complies with this subdivision. A private career school that operates at two or more locations may combine net revenue from student tuition, fees, and other required institutional charges collected for all locations for the purpose of determining the annual surety bond requirement. The net revenue from tuition and fees used to determine the amount of the surety bond required for a private career school having a license for the sole purpose of recruiting students in Minnesota shall be only that paid to the private career school by the students recruited from Minnesota.\n(2) A person required to obtain a private career school license due to the use of \"academy,\" \"institute,\" \"college,\" or \"university\" in its name and which is also licensed by another state agency or board, except not including those schools licensed exclusively in order to participate in state grants or SELF loan financial aid programs, shall be required to provide a school bond of $10,000.\n(c) The bond shall run to the state of Minnesota and to any person who may have a cause of action against the applicant arising at any time after the bond is filed and before it is canceled for breach of any contract or agreement made by the applicant with any student. The aggregate liability of the surety for all breaches of the conditions of the bond shall not exceed the principal sum deposited by the private career school under paragraph (b). The surety of any bond may cancel it upon giving 60 days' notice in writing to the office and shall be relieved of liability for any breach of condition occurring after the effective date of cancellation.\n(d) In lieu of bond, the applicant may deposit with the commissioner of management and budget a sum equal to the amount of the required surety bond in cash, an irrevocable letter of credit issued by a financial institution equal to the amount of the required surety bond, or securities as may be legally purchased by savings banks or for trust funds in an aggregate market value equal to the amount of the required surety bond.\n(e) Failure of a private career school to post and maintain the required surety bond or deposit under paragraph (d) may result in denial, suspension, or revocation of the school's license.\nPrivate career schools located outside the state of Minnesota that have a physical presence within the state of Minnesota shall first file with the secretary of state a sworn statement designating a resident agent authorized to receive service of process. The statement shall designate the secretary of state as resident agent for service of process in the absence of a designated agent. If a private career school fails to file the statement, the secretary of state is designated as the resident agent authorized to receive service of process. The authorization shall be irrevocable as to causes of action arising out of transactions occurring prior to the filing of written notice of withdrawal from the state of Minnesota filed with the secretary of state.\nA license shall be issued if the office first determines:\n(1) that the applicant has a sound financial condition with sufficient resources available to:\n(i) meet the private career school's financial obligations;\n(ii) refund all tuition and other charges, within a reasonable period of time, in the event of dissolution of the private career school or in the event of any justifiable claims for refund against the private career school by the student body;\n(iii) provide adequate service to its students and prospective students; and\n(iv) maintain and support the private career school;\n(2) that the applicant has satisfactory facilities with sufficient tools and equipment and the necessary number of work stations to prepare adequately the students currently enrolled, and those proposed to be enrolled;\n(3) that the applicant employs a sufficient number of qualified teaching personnel to provide the educational programs contemplated;\n(4) that the private career school has an organizational framework with administrative and instructional personnel to provide the programs and services it intends to offer;\n(5) that the quality and content of each occupational course or program of study provides education and adequate preparation to enrolled students for entry level positions in the occupation for which prepared;\n(6) that the premises and conditions where the students work and study and the student living quarters which are owned, maintained, recommended, or approved by the applicant are sanitary, healthful, and safe, as evidenced by certificate of occupancy issued by the municipality or county where the private career school is physically situated, a fire inspection by the local or state fire marshal, or another verification deemed acceptable by the office;\n(7) that the contract or enrollment agreement used by the private career school complies with the provisions in section 136A.826;\n(8) that contracts and agreements do not contain a wage assignment provision or a confession of judgment clause;\n(9) that there has been no adjudication of fraud or misrepresentation in any criminal, civil, or administrative proceeding in any jurisdiction against the private career school or its owner, officers, agents, or sponsoring organization;\n(10) that the private career school or its owners, officers, agents, or sponsoring organization has not had a license revoked under section 136A.829 or its equivalent in other states or has closed the institution prior to all students, enrolled at the time of the closure, completing their program within two years of the effective date of the revocation; and\n(11) that the school includes a joint and several liability provision for torts and compliance with the requirements of sections 136A.82 to 136A.834 in any contract effective after July 1, 2026, with any individual, entity, or postsecondary school located in another state for the purpose of providing educational or training programs or awarding postsecondary credits to Minnesota residents that may be applied to a program.\nAn application for an initial license under sections 136A.821 to 136A.833 shall be accompanied by a nonrefundable application fee as provided in section 136A.824 that is sufficient to recover, but not exceed, the administrative costs of the office.\nAll licenses shall expire one year from the date issued by the office, except as provided in section 136A.823.\nBefore a license is issued to a private career school, the private career school shall furnish to the office a catalog, brochure, or electronic display including:\n(1) identifying data, such as volume number and date of publication;\n(2) name and address of the private career school and its governing body and officials;\n(3) a calendar of the private career school showing legal holidays, beginning and ending dates of each course quarter, term, or semester, and other important dates;\n(4) the private career school policy and regulations on enrollment including dates and specific entrance requirements for each program;\n(5) the private career school policy and regulations about leave, absences, class cuts, make-up work, tardiness, and interruptions for unsatisfactory attendance;\n(6) the private career school policy and regulations about standards of progress for the student including the grading system of the private career school, the minimum grades considered satisfactory, conditions for interruption for unsatisfactory grades or progress, a description of any probationary period allowed by the private career school, and conditions of reentrance for those dismissed for unsatisfactory progress;\n(7) the private career school policy and regulations about student conduct and conditions for dismissal for unsatisfactory conduct;\n(8) a detailed schedule of fees, charges for tuition, books, supplies, tools, student activities, laboratory fees, service charges, rentals, deposits, and all other charges;\n(9) the private career school policy and regulations, including an explanation of section 136A.827, about refunding tuition, fees, and other charges if the student does not enter the program, withdraws from the program, or the program is discontinued;\n(10) a description of the available facilities and equipment;\n(11) a course outline syllabus for each course offered showing course objectives, subjects or units in the course, type of work or skill to be learned, and approximate time, hours, or credits to be spent on each subject or unit;\n(12) the private career school policy and regulations about granting credit for previous education and preparation;\n(13) a notice to students relating to the transferability of any credits earned at the private career school to other institutions;\n(14) a procedure for investigating and resolving student complaints;\n(15) the name and address of the office; and\n(16) the student complaint process and rights under section 136A.8295.\nA private career school that is exclusively a distance education school is exempt from clauses (3) and (5).\n(a) Before a license is reissued to a private career school that offers, advertises or implies a placement service, the private career school shall file with the office for the past year and thereafter at reasonable intervals determined by the office, a certified copy of the private career school's placement record, containing a list of graduates, a description of their jobs, names of their employers, and other information as the office may prescribe.\n(b) Each private career school that offers a placement service shall furnish to each prospective student, upon request, prior to enrollment, written information concerning the percentage of the previous year's graduates who were placed in the occupation for which prepared or in related employment.\n(a) A private career school licensed under sections 136A.82 to 136A.834 and located in Minnesota shall maintain a permanent student record for each student for 50 years from the last date of the student's attendance. A private career school licensed under this chapter and offering distance instruction to a student located in Minnesota shall maintain a permanent record for each Minnesota student for 50 years from the last date of the student's attendance. Records include school transcripts, documents, and files containing student data about academic credits earned, courses completed, grades awarded, degrees awarded, and periods of attendance.\n(b) A private career school licensed under sections 136A.82 to 136A.834 and located in Minnesota shall maintain a permanent student record required for professional licensure in Minnesota for each student for ten years from the last date of the student's attendance or the number of years required by an institutional or programmatic accreditor, whichever is greater. A private career school licensed under this chapter and offering distance instruction to a student located in Minnesota shall maintain records required for professional licensure in Minnesota that are not included in paragraph (a) for each Minnesota student for ten years from the last date of the student's attendance or the number of years required by an institutional or programmatic accreditor, whichever is greater.\nTo preserve permanent student records, a private career school shall submit a plan that meets the following requirements:\n(1) at least one copy of the records must be held in a secure, fireproof depository;\n(2) an appropriate official must be designated to provide a student with copies of records or a transcript upon request;\n(3) an alternative method, approved by the office, of complying with clauses (1) and (2) must be established if the private career school ceases to exist; and\n(4) a continuous surety bond or irrevocable letter of credit issued by a financial institution must be filed with the office in an amount not to exceed $20,000 if the private career school has no binding agreement approved by the office, for preserving student records. The bond or irrevocable letter of credit shall run to the state of Minnesota. In the event of a school closure, the surety bond or irrevocable letter of credit must be used by the office to retrieve, recover, maintain, digitize, and destroy academic records.\nA private career school required to obtain a private career school license due to the use of \"academy,\" \"institute,\" \"college,\" or \"university\" in its name or licensed for the purpose of participating in state financial aid under chapter 136A, and which is also licensed by another state agency or board shall be required to satisfy only the requirements of subdivisions 4, clauses (1), (2), (3), (5), (7), (8), and (10); 5; 6, paragraph (b), clause (2); 8, clauses (1), (4), (7), (8), and (9); 9; 10; and 12. If a school is licensed to participate in state financial aid under this chapter, the school must follow the refund policy in section 136A.827, even if that section conflicts with the refund policy of the licensing agency or board. A distance education private career school located in another state, or a school licensed to recruit Minnesota residents for attendance at a school outside of this state, or a school licensed by another state agency as its primary licensing body, may continue to use the school's name as permitted by its home state or its primary licensing body.",
	"repealed": false
}