{
	"id": "25.341",
	"url": "https://www.revisor.mn.gov/statutes/cite/25.341",
	"title": "25.341 LICENSING.",
	"text": "Before a person may: (1) manufacture a commercial feed in the state; (2) distribute a commercial feed in or into the state; or (3) have the person's name appear on the label of a commercial feed as guarantor, the person must have a commercial feed license for each guarantor, or manufacturing or distributing facility. A person who makes only retail sales of commercial feed, guaranteed by another, is not required to obtain a license.\nA person who is required to have a commercial feed license must submit an application on a form provided or approved by the commissioner accompanied by an application fee of $75 paid to the commissioner for each location. A license is not transferable from one person to another, from one ownership to another, or from one location to another. The license year is the calendar year. A license expires on December 31 of the year for which it is issued, except that a license is valid until the issuance of the renewal license if the licensee has filed a renewal application that has been received by the commissioner on or before December 31 of the year for which the current license was issued, or postmarked on or before December 31 of the year for which the current license was issued. Any person who is required to have, but fails to obtain a license or a licensee who fails to comply with license renewal requirements, must pay a $100 late fee in addition to the license fee.\nThe commissioner may request from a licensee copies of labels and labeling in order to determine compliance with sections 25.31 to 25.43.\nThe commissioner may deny a license to a person or suspend or revoke the license of a person who is not in compliance with sections 25.31 to 25.43. The commissioner may impose conditions that limit production or distribution of a particular commercial feed on the license of a person who is not in compliance with sections 25.31 to 25.43. A license may not be made conditional, suspended, refused, or revoked unless the applicant or licensee has been given an opportunity to be heard before the commissioner in order to comply with the requirements of sections 25.31 to 25.43.",
	"repealed": false
}