{
	"id": "273.1651",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1651",
	"title": "273.1651 TAXATION AND FORFEITURE OF STOCKPILED METALLIC MINERALS MATERIAL.",
	"text": "\"Stockpiled metallic minerals material,\" for purposes of this section, means surface overburden, rock, lean ore, tailings, or other material that has been removed from the ground and deposited elsewhere on the surface in the process of iron ore, taconite, or other metallic minerals mining, or in the process of beneficiation. Stockpiled metallic minerals material does not include processed metallic minerals concentrates in the form of pellets, chips, briquettes, fines, or other form which have been prepared for or are in the process of shipment.\nThe purpose of this section is to clarify the ownership of stockpiled metallic minerals material in this state. Depending on the intent of the person who extracted the material from the ground, stockpiled metallic minerals material may or may not be owned separately and apart from the fee title to the surface of the real property. The legislature finds that the uncertainty of ownership of stockpiled metallic minerals material located on real property that becomes tax forfeited has created a burden on the public owner of the surface of the real property and an impediment to productive management or use of a public resource.\nFrom and after July 1, 1997, for purposes of taxation, the definition of \"real property,\" as contained in section 272.03, subdivision 1, includes stockpiled metallic minerals material. Nothing in this subdivision shall be construed to subject stockpiled metallic minerals material to the general property tax when the stockpiled metallic minerals material is exempt from the general property tax pursuant to section 298.015 or 298.25. If the surface of the real property forfeits for delinquent taxes, stockpiled metallic minerals material located on the real property forfeits with the surface of the property.\nStockpiled metallic minerals material located on real property that forfeited prior to July 1, 1997, or forfeits due to a judgment for delinquent taxes issued prior to July 1, 1997, shall be assessed and taxed as real property. The tax applies only to stockpiled metallic minerals material located on real property that remains in the ownership of the state or a political subdivision of the state. The tax shall be based on the market value of the rental of the property for storage of stockpiled metallic minerals material.\n(a) The tax imposed pursuant to this section shall not be imposed on the following:\n(1) stockpiled metallic minerals material valued and taxed under other laws relating to the taxation of minerals, gas, coal, oil, or other similar interests;\n(2) stockpiled metallic minerals material that is exempt from taxation pursuant to constitutional or related statutory provisions; or\n(3) stockpiled metallic minerals material that is owned by the state.\n(b) All laws for the enforcement of taxes on real property shall apply to the tax imposed pursuant to this section on stockpiled metallic minerals material.\nFor purposes of section 276.041, the owner of stockpiled metallic minerals material is a fee owner.",
	"repealed": false
}