{
	"id": "67A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/67A.14",
	"title": "67A.14 INSURABLE PROPERTY.",
	"text": "(a) Township mutual fire insurance companies may insure qualified property. Qualified property means dwellings, household goods, appurtenant structures, farm buildings, farm personal property, churches, church personal property, county fair buildings, community and township meeting halls and their usual contents.\n(b) Township mutual fire insurance companies may extend coverage to include an insured's secondary property if the township mutual fire insurance company covers qualified property belonging to the insured. Secondary property means any real or personal property that is not considered qualified property for a township mutual fire insurance company to cover under this chapter. The maximum amount of coverage that a township mutual fire insurance company may write for secondary property is 25 percent of the total limit of liability of the policy issued to an insured covering the qualified property.\n(c) A township mutual fire insurance company may insure any real or personal property, including qualified or secondary property, subject to the limitations in subdivision 1, paragraph (b), located outside the limits of the territory in which the company is authorized by its certificate or articles of incorporation to transact business, if the company is already covering qualified property belonging to the insured, inside the limits of the company's territory. For purposes of this paragraph, qualified property inside the limits of the company's territory includes qualified property outside the territory of the surviving company to a merger for the duration of the policy insuring the qualified property if the qualified property was qualified property inside the territory of a constituent company to the merger.\n(d) A township mutual fire insurance company may insure property temporarily outside of the authorized territory of the township mutual fire insurance company.\n[Repealed, 1975 c 15 s 22]\n[Repealed, 1975 c 15 s 22]\n[Repealed, 1975 c 15 s 22]\n[Repealed, 2009 c 37 art 3 s 25]\n[Repealed, 1975 c 15 s 22]\nNo township mutual fire insurance company shall insure or reinsure a single risk or hazard in a larger sum than the greater of $3,000, or one tenth of its net assets plus two tenths of a mill of its insurance in force; provided that no portion of any such risk or hazard which shall have been reinsured, as authorized by the laws of this state, shall be included in determining the limitation of risk prescribed by this subdivision.",
	"repealed": false
}