{
	"id": "89A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/89A.05",
	"title": "89A.05 TIMBER HARVESTING AND FOREST MANAGEMENT GUIDELINES.",
	"text": "The council shall coordinate the development and periodic revision of comprehensive timber harvesting and forest management guidelines based on the information derived from forest resources, practices, implementation, and effectiveness monitoring programs, and other information deemed appropriate by the council. The guidelines must address the water, air, soil, biotic, recreational, cultural, and aesthetic resources found in forest ecosystems by focusing on those impacts commonly associated with applying site-level forestry practices. The guidelines must reflect a range of practical and sound practices based on the best available scientific information, and be integrated to minimize conflicting recommendations while being easy to understand and implement. Changes to the guidelines shall be peer reviewed prior to final adoption by the council.\nBefore the implementation of timber harvesting and forest management guidelines, new site-level practices and landscape-level programs, the council shall analyze the costs and benefits of new site-level practices and landscape-level programs. When the analysis concludes that new landscape-level programs and site-level practices will result in adverse economic effects, including decreased timber supply and negative effects on tourism, opportunities to offset those effects must be explored. The council shall also:\n(1) identify and quantify forest and timberland acreages that will no longer be available for harvest; and\n(2) encourage public resource agencies to provide sustainable, predictable supplies of high-quality forest resource benefits, including timber supplies that are consistent with their multiple mandates and diverse management objectives. These benefits should be provided by public resource agencies in proportion to their forest land's capability to do so.\n[Repealed, 2014 c 289 s 70]\nThe timber harvesting and forest management guidelines are voluntary. The council must develop and periodically assess guideline implementation goals that will sustain forest resources. If the information developed as a result of forest resources, practices, implementation, and effectiveness monitoring programs conducted by the department or other information obtained by the council indicates the implementation goals for the guidelines are not being met and the council determines significant adverse impacts are occurring, the council shall recommend to the governor additional measures to address those impacts. The council must incorporate the recommendations as part of the council's biennial report required by section 89A.03, subdivision 6.\n[Repealed, 2014 c 289 s 70]",
	"repealed": false
}