{
	"id": "174.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.40",
	"title": "174.40 SAFE ROUTES TO SCHOOL PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Bond eligible cost\" means expenditures under this section for acquisition of land or permanent easements, predesign, design, preliminary and final engineering, environmental analysis, construction, and reconstruction of publicly owned infrastructure in this state with a useful life of at least ten years that provides for nonmotorized transportation to and from a school; preparation of land for which a route to school is established, including demolition of structures and remediation of any hazardous conditions on the land; and the unpaid principal on debt issued by a political subdivision for a safe routes to school project.\n(c) \"Federal program\" means the safe routes to school program under Title I, section 1404, of the Safe, Accountable, Flexible, Efficient Transportation Equity Act: A Legacy for Users (SAFETEA-LU) of 2005, Public Law 109-59.\n(d) \"School\" means a school, as defined in section 120A.22, subdivision 4, excluding a home school.\n(a) A safe routes to school program is established to provide assistance in capital investments for safe and appealing nonmotorized transportation to and from a school. The commissioner shall develop and implement the safe routes to school program as provided in this section. Financial assistance under this section is to supplement or replace aid for infrastructure projects under the federal program.\n(b) The commissioner may provide grants or other financial assistance for a safe routes to school project at the commissioner's discretion, subject to the requirements of this section.\n(a) A safe routes to school account is established in the bond proceeds fund. The account consists of state bond proceeds appropriated to the commissioner. Money in the account may only be expended on bond-eligible costs of a project receiving financial assistance as provided under this section. All uses of funds from the account must be for publicly owned property.\n(b) A safe routes to school account is established in the special revenue fund. The account consists of funds as provided by law, and any other money donated, allotted, transferred, or otherwise provided to the account. Money in the account may only be expended on a project receiving financial assistance as provided under this section.\nMinnesota Constitution, article XI, section 5, clause (a), requires that state general obligation bonds be issued to finance only the acquisition or betterment of public land, buildings, and other public improvements of a capital nature. The legislature has determined that many school transportation infrastructure projects will constitute betterments and capital improvements within the meaning of the Minnesota Constitution and capital expenditures under generally accepted accounting principles, and will be financed more efficiently and economically under this section than by direct appropriations for specific projects.\nA statutory or home rule charter city, county, town, or federally recognized Indian Tribe is eligible to receive funding under this section. A statutory or home rule charter city, county, or town is eligible to receive funding for infrastructure projects under this section only if it has adopted subdivision regulations that require safe routes to school infrastructure in developments authorized on or after June 1, 2016.\n(a) The commissioner must establish general program requirements and a competitive process for financial assistance, including but not limited to eligibility requirements for grant recipients and projects; procedures for solicitation of grants; application requirements; procedures for payment of financial assistance awards; and a schedule for application, evaluation, and award of financial assistance. The commissioner must publish the program requirements and the competitive process on the department's website.\n(b) An application must include:\n(1) a detailed and specific description of the project;\n(2) an estimate, along with necessary supporting evidence, of the total costs for the project and the allocation of identified and proposed funding sources for the project;\n(3) an assessment of the need for and benefits of the project;\n(4) a resolution adopted by the governing body of the school for which a safe routes to school grant is requested, certifying that: (i) the governing body of the school supports the project; and (ii) funds, if any, required to be supplied by the school to complete the project are available and committed;\n(5) a timeline indicating the major milestones of the project and their anticipated completion dates; and\n(6) any additional information or material the commissioner prescribes.\n(c) The commissioner shall:\n(1) publicize each solicitation for applications among all eligible recipients;\n(2) provide technical and informational assistance in creating and submitting applications; and\n(3) publish on the department's website a list of all projects that were considered for funding. The list must identify the projects that were selected and the projects that were not selected. For each project that was not selected, the commissioner must include the reason it was not selected. This clause does not apply when there is no funding from any source for the program in a fiscal year.\n(d) The commissioner of transportation shall publish and maintain a manual on the safe routes to school program that assists applicants for and recipients of financial assistance. The commissioner must publish the manual on the department's website. The manual must include a list of eligibility and general program requirements, an explanation of the application process, and a review of the criteria used to evaluate projects.\nThe commissioner shall establish criteria for evaluation of applications and selection of projects. The criteria must include:\n(1) establishment or capital improvement of transportation infrastructure that improves safety and encourages nonmotorized transportation to and from a school;\n(2) compliance with all applicable requirements for capital infrastructure projects established by the Federal Highway Administration, United States Department of Transportation, for the federal program; and\n(3) other components as determined by the commissioner.\nIf, five years after execution of a grant agreement, the commissioner determines that the grantee has not proceeded in a timely manner with implementation of the project funded, the commissioner must cancel the grant and the grantee must repay to the commissioner all grant money paid to the grantee. Section 16A.642 applies to any appropriations made from the bond proceeds fund to the commissioner under this section that have not been awarded as financial assistance.\n(a) The commissioner may not expend an appropriation from the bond proceeds fund, or provide financial assistance from such appropriations, for the purposes specified in this subdivision.\n(b) Subject to appropriations made specifically for the purposes of this subdivision, the commissioner may expend funds for noninfrastructure activities to encourage walking and bicycling to school, including:\n(1) planning activities;\n(2) public awareness campaigns and outreach to press and community leaders;\n(3) traffic education and enforcement in the vicinity of schools;\n(4) student sessions on bicycle and pedestrian safety, health, and the environment; and\n(5) financial assistance for training, volunteers, and managers of safe routes to school programs.\nBy November 1 of each odd-numbered year, the commissioner shall submit a report on the safe routes to school program to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over transportation policy and finance. The report must at a minimum:\n(1) summarize program implementation;\n(2) provide an overview of grant evaluation and criteria used in project selection;\n(3) provide a brief description of each project funded in the previous fiscal year, including the amount of money provided from each safe routes to school account under this section and the amount provided under the federal program;\n(4) summarize the status of the federal program or successor legislation; and\n(5) identify any recommendations for legislative changes, including proposals to improve program effectiveness.",
	"repealed": false
}