{
	"id": "513.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/513.41",
	"title": "513.41 DEFINITIONS.",
	"text": "As used in sections 513.41 to 513.51:\n(1) \"Affiliate\" means:\n(i) a person that directly or indirectly owns, controls, or holds with power to vote, 20 percent or more of the outstanding voting securities of the debtor, other than a person that holds the securities,\n(A) as a fiduciary or agent without sole discretionary power to vote the securities; or\n(B) solely to secure a debt, if the person has not in fact exercised the power to vote;\n(ii) a corporation 20 percent or more of whose outstanding voting securities are directly or indirectly owned, controlled, or held with power to vote, by the debtor or a person that directly or indirectly owns, controls, or holds with power to vote, 20 percent or more of the outstanding voting securities of the debtor, other than a person that holds the securities,\n(A) as a fiduciary or agent without sole discretionary power to vote the securities; or\n(B) solely to secure a debt, if the person has not in fact exercised the power to vote;\n(iii) a person whose business is operated by the debtor under a lease or other agreement, or a person substantially all of whose assets are controlled by the debtor; or\n(iv) a person that operates the debtor's business under a lease or other agreement or controls substantially all of the debtor's assets.\n(2) \"Asset\" means property of a debtor, but the term does not include:\n(i) property to the extent it is encumbered by a valid lien;\n(ii) property to the extent it is generally exempt under nonbankruptcy law; or\n(iii) an interest in property held in tenancy by the entireties to the extent it is not subject to process by a creditor holding a claim against only one tenant.\n(3) \"Claim\" means a right to payment, whether or not the right is reduced to judgment, liquidated, unliquidated, fixed, contingent, matured, unmatured, disputed, undisputed, legal, equitable, secured, or unsecured.\n(4) \"Creditor\" means a person that has a claim.\n(5) \"Debt\" means liability on a claim.\n(6) \"Debtor\" means a person that is liable on a claim.\n(7) \"Electronic\" means relating to technology having electrical, digital, magnetic, wireless, optical, electromagnetic, or similar capabilities.\n(8) \"Insider\" includes:\n(i) if the debtor is an individual,\n(A) a relative of the debtor or of a general partner of the debtor;\n(B) a partnership in which the debtor is a general partner;\n(C) a general partner in a partnership described in subitem (B); or\n(D) a corporation of which the debtor is a director, officer, or a person in control;\n(ii) if the debtor is a corporation,\n(A) a director of the debtor;\n(B) an officer of the debtor;\n(C) a person in control of the debtor;\n(D) a partnership in which the debtor is a general partner;\n(E) a general partner in a partnership described in subitem (D); or\n(F) a relative of a general partner, director, officer, or person in control of the debtor;\n(iii) if the debtor is a partnership,\n(A) a general partner in the debtor;\n(B) a relative of a general partner in, or a general partner of, or a person in control of the debtor;\n(C) another partnership in which the debtor is a general partner;\n(D) a general partner in a partnership described in subitem (C); or\n(E) a person in control of the debtor;\n(iv) an affiliate, or an insider of an affiliate as if the affiliate were the debtor; and\n(v) a managing agent of the debtor.\n(9) \"Lien\" means a charge against or an interest in property to secure payment of a debt or performance of an obligation, and includes a security interest created by agreement, a judicial lien obtained by legal or equitable process or proceedings, a common-law lien, or a statutory lien.\n(10) \"Organization\" means a person other than an individual.\n(11) \"Person\" means an individual, estate, business or nonprofit entity, public corporation, government or governmental subdivision, agency, or instrumentality, or other legal entity.\n(12) \"Property\" means anything that may be subject of ownership.\n(13) \"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n(14) \"Relative\" means an individual related by consanguinity within the third degree as determined by the common law, a spouse, or an individual related to a spouse within the third degree as so determined, and includes an individual in an adoptive relationship within the third degree.\n(15) \"Sign\" means, with present intent to authenticate or adopt a record:\n(i) to execute or adopt a tangible symbol; or\n(ii) to attach to or logically associate with the record an electronic symbol, sound, or process.\n(16) \"Transfer\" means every mode, direct or indirect, absolute or conditional, voluntary or involuntary, of disposing of or parting with an asset or an interest in an asset, and includes payment of money, release, lease, license, and creation of a lien or other encumbrance. Transfer does not include a contribution of money or an asset made to a qualified charitable or religious organization or entity unless the contribution was made within two years of commencement of an action under sections 513.41 to 513.51 against the qualified charitable or religious organization or entity and:\n(i) the debtor made the charitable contribution with actual intent to hinder, delay, or defraud any creditor of the debtor; or\n(ii) the debtor:\n(A) was insolvent at the time of the contribution or would be rendered insolvent by reason of the contribution;\n(B) was engaged or was about to engage in a business or a transaction for which the remaining assets of the debtor were unreasonably small in relation to the business or transaction; or\n(C) intended to incur, or the charitable or religious organization or entity believed or had reason to believe that the debtor would incur, debts beyond the debtor's ability to pay as the debts become due.\nA transfer of a charitable contribution to a qualified charitable or religious organization or entity is not considered a transfer covered under item (ii) if the amount of that contribution did not exceed 15 percent of the gross annual income of the debtor for the year in which the transfer of the contribution was made; or the contribution exceeded that amount but the transfer was consistent with practices of the debtor in making charitable contributions.\nTransfer does include a return on investment made by a qualified charitable or religious organization or entity. \"Qualified charitable or religious organization or entity\" means an organization or entity described in United States Code, title 26, section 170(c)(1), (2), or (3).\n(17) \"Valid lien\" means a lien that is effective against the holder of a judicial lien subsequently obtained by legal or equitable process or proceedings.",
	"repealed": false
}