{
	"id": "82.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.77",
	"title": "82.77 TABLE FUNDING.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Closing agent\" has the meaning given in section 82.55, subdivision 4.\n(c) \"Collected funds\" means funds deposited, finally settled, and credited to the closing agent's escrow account.\n(d) \"Federally insured financial institution\" means an institution in which monetary deposits are insured by the Federal Deposit Insurance Corporation or National Credit Union Administration.\n(e) \"Lender\" means a person who makes residential mortgage loans including a person who engages in table funding. \"Lender\" does not include any organization described in section 501(c)(3) or 501(c)(4) of the Internal Revenue Code of 1986, as amended, if the organization is exempt from tax under section 501(a) of the Internal Revenue Code of 1986, as amended. \"Lender\" does not include a state or any political subdivision of a state.\n(f) \"Qualified loan funds\" means funds in one of the following forms:\n(1) lawful money of the United States;\n(2) wired funds when unconditionally held by the closing agent;\n(3) cashier's checks, certified checks, bank money orders, or teller's checks issued by a federally insured financial institution and unconditionally held by the closing agent; and\n(4) United States treasury checks, Federal Reserve Bank checks, federal home loan bank checks, and state of Minnesota warrants.\n(g) \"Table funding\" means a closing or settlement at which a mortgage loan is funded by a lender by a contemporaneous advance of mortgage loan funds and an assignment of the mortgage loan to the lender advancing the funds.\n(a) A closing agent shall not make disbursements out of an escrow, security deposit, settlement, or closing account unless the funds received from the lender are collected funds or qualified loan funds.\n(b) A lender, using the closing services of a closing agent, shall at or before the time of the closing deliver loan funds to the closing agent either in the form of collected funds or qualified loan funds.",
	"repealed": false
}