{
	"id": "469.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.101",
	"title": "469.101 POWERS.",
	"text": "An economic development authority may create and define the boundaries of economic development districts at any place or places within the city, except that the district boundaries must be contiguous, and may use the powers granted in sections 469.090 to 469.108 to carry out its purposes. First the authority must hold a public hearing on the matter. At least ten days before the hearing, the authority shall publish notice of the hearing in a newspaper of general circulation in the city. Also, the authority shall find that an economic development district is proper and desirable to establish and develop within the city.\nThe economic development authority may acquire by lease, purchase, gift, devise, or condemnation proceedings the needed right, title, and interest in property to create economic development districts. It shall pay for the property out of money it receives under sections 469.090 to 469.108. It may hold and dispose of the property subject to the limits and conditions in sections 469.090 to 469.108. The title to property acquired by condemnation or purchase must be in fee simple, absolute. The authority may accept an interest in property acquired in another way subject to any condition of the grantor or donor. The condition must be consistent with the proper use of the property under sections 469.090 to 469.108. Property acquired, owned, leased, controlled, used, or occupied by the authority for any of the purposes of this section is for public governmental and municipal purposes and is exempt from taxation by the state or by its political subdivisions, except to the extent that the property is subject to the sales and use tax under chapter 297A. The exemption applies only while the authority holds property for its own purpose. The exemption is subject to the provisions of section 272.02, subdivision 39. When the property is sold it becomes subject to taxation.\nThe economic development authority may sign options to purchase, sell, or lease property.\nThe economic development authority may exercise the power of eminent domain under chapter 117, or under its city's charter to acquire property it is authorized to acquire by condemnation. The authority may acquire in this way property acquired by its owner by eminent domain or property already devoted to a public use only if its city's council approves. The authority may take possession of property to be condemned after it files a petition in condemnation proceedings describing the property. The authority may abandon the condemnation before taking possession.\nThe economic development authority may make contracts for the purpose of economic development within the powers given it in sections 469.090 to 469.108. The authority may contract or arrange with the federal government, or any of its departments, with persons, public corporations, the state, or any of its political subdivisions, commissions, or agencies, for separate or joint action, on any matter related to using the authority's powers or performing its duties. The authority may contract to purchase and sell real and personal property. An obligation or expense must not be incurred unless existing appropriations together with the reasonably expected revenue of the authority from other sources are sufficient to discharge the obligation or pay the expense when due. The state and its municipal subdivisions are not liable on the obligations.\nFor all contracts for construction, alteration, repair, or maintenance work, the authority may award contracts to the vendor offering the best value, and \"best value\" shall be defined and applied as set forth in section 16C.28, subdivisions 1, paragraph (a), clause (2), and paragraph (c), and 1b. Alternatively, the authority may award all contracts for construction, alteration, repair, or maintenance work to the lowest responsible bidder, reserving the right to reject any or all bids.\nThe economic development authority may be a limited partner in a partnership whose purpose is consistent with the authority's purpose.\nThe economic development authority may acquire rights or an easement for a term of years or perpetually for development of an economic development district.\nThe economic development authority may buy the supplies and materials it needs to carry out this section.\nThe economic development authority may accept land, money, or other assistance, whether by gift, loan or otherwise, in any form from the federal or state government, or an agency of either, or a local subdivision of state government to carry out sections 469.090 to 469.108 and to acquire and develop an economic development district and its facilities under this section.\nThe economic development authority may sell or lease land held by it for economic development in economic development districts. The authority may acquire, sell, or lease single or multiple tracts of land regardless of size, to be developed as a part of the economic development of the district under sections 469.090 to 469.108.\nThe economic development authority may apply to the board defined in United States Code, title 19, section 81a, for the right to use the powers provided in United States Code, title 19, sections 81a to 81u. If the right is granted, the authority may use the powers. One authority may apply with another authority.\nThe economic development authority may exercise powers and duties of a redevelopment agency under sections 469.152 to 469.165, for a purpose in sections 469.001 to 469.047 or 469.090 to 469.108. The authority may also use the powers and duties in sections 469.001 to 469.047 and 469.090 to 469.108 for a purpose in sections 469.152 to 469.165.\nThe authority may operate and maintain a public parking facility or other public facility to promote development in an economic development district.\nAn economic development authority may cooperate with or act as agent for the federal or the state government, or a state public body, or an agency or instrumentality of a government or a public body to carry out sections 469.090 to 469.108 or any other related federal, state, or local law in the area of economic development district improvement.\nAn authority may study and analyze economic development needs in the city, and ways to meet the needs. An authority may study the desirable patterns for land use for economic development and community growth and other factors affecting local economic development in the city and make the result of the studies available to the public and to industry in general. An authority may engage in research and disseminate information on economic development within the city.\nTo further an authorized purpose, an authority may (1) join an official, industrial, commercial, or trade association, or another organization concerned with the purpose, (2) have a reception of officials who may contribute to advancing the city and its economic development, and (3) carry out other public relations activities to promote the city and its economic development. Activities under this subdivision have a public purpose.\nAn authority may accept conveyances of land from all other public agencies, commissions, or other units of government, if the land can be properly used by the authority in an economic development district, to carry out the purposes of sections 469.090 to 469.108.\nAn authority may carry out the law on economic development districts to develop and improve the lands in an economic development district to make it suitable and available for economic development uses and purposes. An authority may fill, grade, and protect the property and do anything necessary and expedient, after acquiring the property, to make it suitable and attractive as a tract for economic development. An authority may lease some or all of its lands or property and may set up local improvement districts in all or part of an economic development district.\nAfter authorizing bonds under sections 469.102 and 469.103, an authority may borrow to provide money immediately required for the bond purpose. The loans must not exceed the amount of the bonds. The authority shall by resolution decide the terms of the loans. The loans must be evidenced by negotiable notes due in not more than 12 months from the date of the loan payable to the order of the lender or to bearer, to be repaid with interest from the proceeds of the bonds when the bonds are issued and delivered to the bond purchasers. The loan must not be obtained from any commissioner of the authority or from any corporation, association, or other institution of which an authority commissioner is a stockholder or officer.\nThe proceeds of obligations issued by an authority under section 469.103 and temporary loans obtained under subdivision 19 may be used to make or purchase loans for economic development facilities that the authority believes will require financing. To make or purchase the loans, the authority may enter into loan and related agreements, both before and after issuing the obligations, with persons, firms, public or private corporations, federal or state agencies, and governmental units under terms and conditions the authority considers appropriate. A governmental unit in the state may apply, contract for, and receive the loans. Chapter 475 does not apply to the loans.\nMS 1998 [Repealed, 2000 c 490 art 11 s 44]\nAn authority may sell, at private or public sale, at the price or prices determined by the authority, any note, mortgage, lease, sublease, lease purchase, or other instrument or obligation evidencing or securing a loan made for the purpose of economic development, job creation, redevelopment, or community revitalization by a public agency to a business, for-profit or nonprofit organization, or an individual.\nNotwithstanding any contrary law, the authority may participate with public or private corporations or other entities, whose purpose is to provide seed or venture capital to small businesses that have facilities located or to be located in the district. For that purpose the authority may use not more than ten percent of available annual net income or $1,000,000 annually, whichever is less, to invest in equities or acquire equity-type investments. These investments can be made directly in eligible corporations or entities or acquired through participation in a public or private seed or venture capital fund. The participation by the authority may not exceed in any year 25 percent of the total amount of funds provided for venture or seed capital purposes by all of the participants. The corporation, entity, or fund shall report in writing each six months to the commissioners of the authority all investments and other action taken by it since the last report. Funds contributed to the corporation or entity must be invested pro rata with each contributor of capital taking proportional risks on each investment. As used in this subdivision, the term \"small business\" has the meaning given it in section 645.445, subdivision 2.",
	"repealed": false
}