{
	"id": "394.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.27",
	"title": "394.27 CREATION AND DUTIES OF BOARD OF ADJUSTMENT.",
	"text": "Whenever a board of county commissioners shall have adopted official controls it shall at the same time as the adoption of such controls create a board of adjustment by ordinance.\nThe board of adjustment shall consist of at least three but not more than seven members, including at least one member from the unincorporated area of the county, whose appointment, term of office, or removal from the board shall be as provided in the ordinance creating the board of adjustment; provided that no elected officer of the county nor any employee of the board of commissioners shall serve as a member of the board of adjustment and that one member of such board of adjustment shall also be a member of any planning commission appointed under the provisions of sections 394.21 to 394.37. In an ordinance creating a three-member board of adjustment, provision may be made for one alternate member. The alternate board member shall, when directed by the chair, attend all meetings of the board and participate fully in its activities but shall not vote on any issue unless authorized to do so by the chair. The chair shall authorize the alternate board member to vote on an issue when a regular member is absent, physically incapacitated, abstains because of a possible conflict of interest, or is prohibited by law from voting on that issue. Any question of whether a particular issue involves a conflict of interest sufficient to disqualify a regular board member from voting thereon shall be decided by majority vote of all regular board members except the member who is being challenged. In the ordinance establishing the board of adjustment provision may be made for removal of any member for nonperformance of duty or misconduct in office and for the filling of vacancies for any unexpired term. The regular and alternate members of such board of adjustment may be paid compensation in an amount determined by the county board and may be paid their necessary expenses in attending meetings of the board and in the conduct of the business of the board.\nThe board of adjustment shall elect a chair and vice-chair from among its members and shall appoint a secretary who need not be a member of a board. It shall adopt rules for the transaction of its business and shall keep a public record of its transaction, findings, and determinations.\nThe meetings of the board of adjustment shall be held at the call of the chair and at such other times as the board in its rules of procedure may specify.\nThe board of adjustment shall have the authority to order the issuance of variances, hear and decide appeals from and review any order, requirement, decision, or determination made by any administrative official charged with enforcing any ordinance adopted pursuant to the provision of sections 394.21 to 394.37, order the issuance of permits for buildings in areas designated for future public use on an official map, and perform such other duties as required by the official controls. Such appeal may be taken by any person aggrieved or by any officer, department, board or bureau of a town, municipality, county, or state. In exercising its powers under this subdivision, the board of adjustment shall take into consideration the town board's recommendation when the board of adjustment's decision directly affects land within the town.\nAn appeal from any order, requirement, decision, or determination of any administrative official shall be taken in such time as shall be prescribed by the ordinance creating the board of adjustment by filing with the board of adjustment a notice of appeal specifying the grounds thereof. The board of adjustment shall fix a reasonable time for the hearing of the appeal and give due notice thereof to the appellant and the officer from whom the appeal is taken and to the public and decide the same within a reasonable time which shall be defined in the ordinance establishing the board of adjustment. An appeal stays all proceedings in furtherance of the action appealed from unless the board of adjustment to whom the appeal is taken certifies that by reason of the facts stated in the certificate a stay would cause imminent peril to life or property. The board of adjustment may reverse or affirm wholly or partly, or may modify the order, requirement, decision, or determination appealed from and to that end shall have all the powers of the officer from whom the appeal was taken and may direct the issuance of a permit. The reasons for the board's decision shall be stated in writing.\nThe board of adjustment shall have the exclusive power to order the issuance of variances from the requirements of any official control including restrictions placed on nonconformities. Variances shall only be permitted when they are in harmony with the general purposes and intent of the official control and when the variances are consistent with the comprehensive plan. Variances may be granted when the applicant for the variance establishes that there are practical difficulties in complying with the official control. \"Practical difficulties,\" as used in connection with the granting of a variance, means that the property owner proposes to use the property in a reasonable manner not permitted by an official control; the plight of the landowner is due to circumstances unique to the property not created by the landowner; and the variance, if granted, will not alter the essential character of the locality. Economic considerations alone do not constitute practical difficulties. Practical difficulties include, but are not limited to, inadequate access to direct sunlight for solar energy systems. Variances shall be granted for earth sheltered construction as defined in section 216C.06, subdivision 14, when in harmony with the official controls. No variance may be granted that would allow any use that is not allowed in the zoning district in which the subject property is located. The board of adjustment may impose conditions in the granting of variances. A condition must be directly related to and must bear a rough proportionality to the impact created by the variance.\nA certified copy of any order issued by the board of adjustment acting upon an appeal from an order, requirement, decision or determination by an administrative official, or a request for a variance, shall be recorded with the county recorder or registrar of titles. The order issued by the board of adjustment shall include the legal description of the property involved. The board by ordinance shall designate the county official or employee responsible for meeting the requirements of this subdivision.\nAll decisions by the board of adjustment in granting variances or in hearing appeals from any administrative order, requirement, decision, or determination shall be final except that any aggrieved person or persons, or any department, board or commission of the jurisdiction or of the state shall have the right to appeal within 30 days, after receipt of notice of the decision, to the district court in the county in which the land is located on questions of law and fact.",
	"repealed": false
}