{
	"id": "15B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/15B.03",
	"title": "15B.03 CAPITOL AREA ARCHITECTURAL AND PLANNING BOARD.",
	"text": "(a) The Capitol Area Architectural and Planning Board, called the board or the CAAPB in this chapter, has 12 members.\n(b) The lieutenant governor is a member.\n(c) The governor must appoint four members.\n(d) The mayor of St. Paul must appoint three members with the advice and consent of the city council. One of the mayor's appointees must be a resident of the planning council district that includes the Capitol Area.\n(e) The speaker of the house must appoint two members of the house of representatives and the president of the senate must appoint two senators.\n(f) Each appointee must qualify by taking the oath of office.\n(g) A quorum of the board is six members.\nThe membership terms, compensation, and removal of board members and filling of vacancies on the board are governed by section 15.0575.\n(a) The lieutenant governor is the chair of the board.\n(b) The attorney general is the legal advisor to the board.\n(c) The board may elect a vice-chair. The vice-chair may preside at meetings in the absence of the lieutenant governor.\n(d) The board may elect any other officers that it considers necessary to carry out its duties.\n(a) The chair of the board must appoint an executive secretary to serve the board. The chair must consult with the board before making an appointment. The executive secretary serves in the unclassified service.\n(b) The board may employ any other officers and employees it considers necessary. Those employed under this paragraph are in the state classified civil service.\n(c) The board may contract for professional and other similar services on the terms it considers desirable.\nThe board must meet at the call of the chair and may meet at other times that it sets.\nThe board may adopt rules under chapter 14, the Administrative Procedure Act, that it believes are needed and reasonable to accomplish the purposes of this chapter.\n(a) Except as provided in paragraph (b), the state must pay the administrative and planning expenses of the board.\n(b) The administrative and planning expenses of the board for federally funded capital expenditures must be reimbursed to the state from the federal money as soon as it is received.",
	"repealed": false
}