{
	"id": "424A.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.092",
	"title": "424A.092 RELIEF ASSOCIATIONS PAYING LUMP-SUM SERVICE PENSIONS.",
	"text": "This section shall apply to any firefighters relief association specified in section 424A.091, subdivision 1, which pays a lump-sum service pension, but which does not pay a monthly service pension, to a retiring firefighter when at least the minimum requirements for entitlement to a service pension specified in section 424A.02 or any applicable special legislation and the articles of incorporation or bylaws of the relief association have been met. Each firefighters relief association to which this section applies shall determine the accrued liability of the special fund of the relief association in accordance with subdivisions 2 and 2a, if applicable, and the financial requirements of the relief association and the minimum obligation of the municipality in accordance with the procedure set forth in subdivision 3.\n(a) Beginning with the calculation performed in 2021 for the 2022 calendar year, each firefighters relief association which pays a lump-sum service pension shall determine the accrued liability of the special fund of the firefighters relief association relative to each active member of the relief association, calculated using the applicable appendix to the standards for actuarial work established by the Legislative Commission on Pensions and Retirement under section 3.85, subdivision 10.\n(b) For calendar years before 2022, each firefighters relief association shall determine the accrued liability of the special fund of the firefighters relief association relative to each active member of the relief association, calculated individually using the following table:\nAs set forth in the table the accrued liability for each member of the relief association corresponds to the cumulative years of active service to the credit of the member. The accrued liability of the special fund for each active member is determined by multiplying the accrued liability from the chart by the ratio of the lump-sum service pension amount currently provided for in the bylaws of the relief association to a service pension of $100 per year of service.\n(c) If a member has fractional service as of December 31, the figure for service credit to be used for the determination of accrued liability pursuant to this section shall be rounded to the nearest full year of service credit. The total accrued liability of the special fund as of December 31 shall be the sum of the accrued liability attributable to each active member of the relief association.\n(d) To the extent that the state auditor considers it to be necessary or practical, the state auditor may specify and issue procedures, forms, or mathematical tables for use in performing the calculations of the accrued liability for deferred members pursuant to this subdivision.\n(a) Each firefighters relief association which pays a lump-sum service pension in installment payments to a retired firefighter pursuant to section 424A.02, subdivision 8, shall determine the accrued liability of the special fund of the firefighters relief association relative to each retired member receiving a lump-sum service pension in installment payments calculated individually as the sum of each future installment payment discounted at an interest rate of five percent, compounded annually, from the date the installment payment is scheduled to be paid to December 31. If the bylaws of the relief association provide for the payment of interest on unpaid installments, the amount of interest, projected to December 31, shall be added to the accrued liability attributable to each retired member. The sum of the accrued liability attributable to each retired member of the relief association receiving a lump-sum service pension in installment payments shall be the total additional accrued liability of the special fund of the relief association as of December 31, and shall be added to the accrued liability of the special fund of the relief association calculated pursuant to subdivision 2 for purposes of calculating the financial requirements of the relief association and the minimum obligation of the municipality pursuant to subdivision 3.\n(b) To the extent that the state auditor deems it to be necessary or practical, the state auditor may specify and issue procedures, forms, or mathematical tables for use in performing the calculations required pursuant to this subdivision.\n(a) During the month of July, the officers of the relief association shall determine the overall funding balance of the special fund for the current calendar year, the financial requirements of the special fund for the following calendar year and the minimum obligation of the municipality with respect to the special fund for the following calendar year in accordance with the requirements of this subdivision.\n(b) The overall funding balance of the special fund for the current calendar year must be determined in the following manner:\n(1) The total accrued liability of the special fund for all active and deferred members of the relief association as of December 31 of the current year must be calculated under subdivisions 2 and 2a, if applicable.\n(2) The total present assets of the special fund projected to December 31 of the current year, including receipts by and disbursements from the special fund anticipated to occur on or before December 31, must be calculated. To the extent possible, for those assets for which a market value is readily ascertainable, the current market value as of the date of the calculation for those assets must be utilized in making this calculation. For any asset for which no market value is readily ascertainable, the cost value or the book value, whichever is applicable, must be utilized in making this calculation.\n(3) The amount of the total present assets of the special fund calculated under clause (2) must be subtracted from the amount of the total accrued liability of the special fund calculated under clause (1). If the amount of total present assets exceeds the amount of the total accrued liability, then the special fund is considered to have a surplus over full funding. If the amount of the total present assets is less than the amount of the total accrued liability, then the special fund is considered to have a deficit from full funding. If the amount of total present assets is equal to the amount of the total accrued liability, then the special fund is considered to be fully funded.\n(c) The financial requirements of the special fund for the following calendar year must be determined in the following manner:\n(1) The total accrued liability of the special fund for all active and deferred members of the relief association as of December 31 of the calendar year next following the current calendar year must be calculated under subdivisions 2 and 2a, if applicable.\n(2) The increase in the total accrued liability of the special fund for the following calendar year over the total accrued liability of the special fund for the current year must be calculated.\n(3) The amount of anticipated future administrative expenses of the special fund must be calculated by multiplying the dollar amount of the administrative expenses of the special fund for the most recent prior calendar year by the factor of 1.035.\n(4) If the special fund is fully funded, the financial requirements of the special fund for the following calendar year are the total of the amounts calculated under clauses (2) and (3).\n(5) If the special fund has a deficit from full funding, the financial requirements of the special fund for the following calendar year are the financial requirements of the special fund calculated as though the special fund were fully funded under clause (4) plus an amount equal to one-tenth of the original amount of the deficit from full funding of the special fund as determined under clause (2) resulting either from an increase in the amount of the service pension occurring in the last ten years or from a net annual investment loss occurring during the last ten years until each increase in the deficit from full funding is fully retired. The annual amortization contribution under this clause may not exceed the amount of the deficit from full funding.\n(6) If the special fund has a surplus over full funding, the financial requirements of the special fund for the following calendar year are the financial requirements of the special fund calculated as though the special fund were fully funded under clause (4) reduced by an amount equal to one-tenth of the amount of the surplus over full funding of the special fund.\n(d) The minimum obligation of the municipality with respect to the special fund is the financial requirements of the special fund reduced by the amount of any fire state aid and police and firefighter retirement supplemental state aid payable under chapter 477B and section 423A.022 reasonably anticipated to be received by the municipality for transmittal to the special fund during the following calendar year, an amount of interest on the assets of the special fund projected to the beginning of the following calendar year calculated at the rate of five percent per annum, and the amount of any contributions to the special fund required by the relief association bylaws from the active members of the relief association reasonably anticipated to be received during the following calendar year. A reasonable amount of anticipated fire state aid is an amount that does not exceed the fire state aid actually received in the prior year multiplied by the factor 1.035.\n(a) The officers of the relief association shall certify the financial requirements of the special fund of the relief association and the minimum obligation of the municipality with respect to the special fund of the relief association as determined under subdivision 3 on or before August 1 of each year. The certification must be made to the entity that is responsible for satisfying the minimum obligation with respect to the special fund of the relief association. If the responsible entity is a joint powers entity, the certification must be made in the manner specified in the joint powers agreement, or if the joint powers agreement is silent on this point, the certification must be made to the chair of the joint powers board.\n(b) The financial requirements of the relief association and the minimum municipal obligation must be included in the financial report or financial statement under section 424A.014. The schedule forms related to the determination of the financial requirements must be filed with the state auditor by March 31, annually, if the relief association is required to file a financial statement under section 424A.014, subdivision 2, or by June 30, annually, if the relief association is required to file a financial report and audit under section 424A.014, subdivision 1.\n(c) The municipality shall provide for at least the minimum obligation of the municipality with respect to the special fund of the relief association by tax levy or from any other source of public revenue.\n(d) The municipality may levy taxes for the payment of the minimum municipal obligation without any limitation as to rate or amount and irrespective of any limitations imposed by other provisions of law upon the rate or amount of taxation until the balance of the special fund or any fund of the relief association has attained a specified level. In addition, any taxes levied under this section must not cause the amount or rate of any other taxes levied in that year or to be levied in a subsequent year by the municipality which are subject to a limitation as to rate or amount to be reduced.\n(e) If the municipality does not include the full amount of the minimum municipal obligations in its levy for any year, the officers of the relief association shall certify that amount to the county auditor, who shall spread a levy in the amount of the certified minimum municipal obligation on the taxable property of the municipality.\n(f) If the state auditor determines that a municipal contribution actually made in a plan year was insufficient under section 424A.091, subdivision 3, paragraph (c), clause (5), the state auditor may request a copy of the certifications under this subdivision from the relief association or from the city. The relief association or the city, whichever applies, must provide the certifications within 14 days of the date of the request from the state auditor.\nAll investment income earned on the assets of the special fund of the relief association shall be credited to the special fund. Investment income earned or anticipated to be earned in a calendar year in excess of the assumed rate specified in subdivision 3, clause (3) shall not be included in the calculations of the financial requirements of the special fund of the relief association or the minimum obligation of the municipality with respect to the special fund of the relief association for that calendar year.\n(a) The board of trustees of a relief association may adopt an amendment to the articles of incorporation or bylaws that increases the coverage, service pensions, or retirement benefits provided by the relief association only after preparing an estimate of the expected change to the accrued liability and the overall funding balance of the special fund resulting from the amendment.\n(b) For purposes of this subdivision, \"overall funding balance\" means the amount of the surplus or deficit calculated under subdivision 3, paragraph (b). \"Accrued liability\" means the amount calculated under subdivision 2 or 2a, as applicable. \"Estimate\" means the estimate required in paragraph (a).\n(c) If the special fund of a relief association to which this section applies has a deficit from full funding under subdivision 3, paragraph (b), clause (3), or if the municipality has a minimum obligation under subdivision 3, paragraph (d), any amendment to the articles of incorporation or bylaws adopted by the board of trustees that increases the coverage, service pensions, or retirement benefits provided by the relief association is not effective until it is ratified by the governing body of the affiliated municipality or independent nonprofit firefighting corporation, as applicable. The governing body may ratify the amendment only if the relief association has delivered to the governing body the estimate described in paragraphs (a) and (b), certified by an officer of the relief association.\n(d) If the special fund of a relief association to which this section applies is fully funded or has a surplus over full funding under subdivision 3, paragraph (b), clause (3), and if the municipality does not have a minimum obligation under subdivision 3, paragraph (d), to the special fund under this section, the relief association may adopt an amendment to the articles of incorporation or bylaws that increases the coverage, service pensions, or retirement benefits provided by the relief association. The amendment is effective if the municipality ratifies the amendment or, in the absence of municipal ratification, the amendment satisfies paragraph (e).\n(e) An amendment satisfies this paragraph if the estimate described in paragraphs (a) and (b) demonstrates that the amendment will not cause:\n(1) the amount of the resulting increase in the accrued liability of the special fund to exceed 90 percent of the amount of the surplus over full funding reported in the prior year;\n(2) an increase in the minimum obligation of the municipality for the upcoming calendar year under subdivision 3, paragraph (d); and\n(3) the special fund of the relief association to have a deficit from full funding under subdivision 3, paragraph (c), clause (5), on the day immediately following the adoption of the amendment.\n(f) If a relief association amends the articles of incorporation or bylaws without municipal ratification under this subdivision and, subsequent to the amendment, the minimum obligation of the municipality under subdivision 3, paragraph (d), increases, the provision that was implemented without municipal ratification is no longer effective on July 31. Any service pensions or retirement benefits payable after that date may be paid only in accordance with the articles of incorporation or bylaws as amended with municipal ratification.",
	"repealed": false
}