{
	"id": "148E.180",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.180",
	"title": "148E.180 FEE AMOUNTS.",
	"text": "Nonrefundable application fees for licensure may not exceed the following amounts but may be adjusted lower by board action:\n(1) for a licensed social worker, $75;\n(2) for a licensed graduate social worker, $75;\n(3) for a licensed independent social worker, $75;\n(4) for a licensed independent clinical social worker, $75;\n(5) for a temporary license, $50; and\n(6) for a license by endorsement, $115.\nThe fee for criminal background checks is the fee charged by the Bureau of Criminal Apprehension. The criminal background check fee must be included with the application fee as required according to section 148E.055.\nNonrefundable license fees may not exceed the following amounts but may be adjusted lower by board action:\n(1) for a licensed social worker, $115;\n(2) for a licensed graduate social worker, $210;\n(3) for a licensed independent social worker, $305;\n(4) for a licensed independent clinical social worker, $335;\n(5) for an emeritus inactive license, $65;\n(6) for an emeritus active license, one-half of the renewal fee specified in subdivision 3; and\n(7) for a temporary leave fee, the same as the renewal fee specified in subdivision 3.\nIf the licensee's initial license term is less or more than 24 months, the required license fees must be prorated proportionately.\nNonrefundable renewal fees for licensure may not exceed the following amounts but may be adjusted lower by board action:\n(1) for a licensed social worker, $115;\n(2) for a licensed graduate social worker, $210;\n(3) for a licensed independent social worker, $305; and\n(4) for a licensed independent clinical social worker, $335.\nContinuing education provider fees are the following nonrefundable amounts:\n(1) for a provider who offers programs totaling one to eight clock hours in a one-year period according to section 148E.145, $50;\n(2) for a provider who offers programs totaling nine to 16 clock hours in a one-year period according to section 148E.145, $100;\n(3) for a provider who offers programs totaling 17 to 32 clock hours in a one-year period according to section 148E.145, $200;\n(4) for a provider who offers programs totaling 33 to 48 clock hours in a one-year period according to section 148E.145, $400; and\n(5) for a provider who offers programs totaling 49 or more clock hours in a one-year period according to section 148E.145, $600.\nLate fees are the following nonrefundable amounts:\n(1) renewal late fee, one-fourth of the renewal fee specified in subdivision 3;\n(2) supervision plan late fee, $40; and\n(3) license late fee, $100 plus the prorated share of the license fee specified in subdivision 2 for the number of months during which the individual practiced social work without a license.\n(a) The nonrefundable fee for a license card as specified in section 148E.095 is $10.\n(b) The nonrefundable fee for a license wall certificate as specified in section 148E.095 is $30.\nReactivation fees are the following nonrefundable amounts:\n(1) reactivation from a temporary leave or emeritus status, the prorated share of the renewal fee specified in subdivision 3; and\n(2) reactivation of an expired license, 1-1/2 times the renewal fees specified in subdivision 3.",
	"repealed": false
}