{
	"id": "403.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.07",
	"title": "403.07 STANDARDS ESTABLISHED; DATA PRIVACY.",
	"text": "The commissioner shall establish and adopt in accordance with chapter 14, rules for the administration of this chapter and for the development of 911 systems in the state including:\n(1) design standards for 911 systems incorporating the standards adopted pursuant to subdivision 2 for the seven-county metropolitan area; and\n(2) a procedure for determining and evaluating requests for variations from the established design standards.\nThe Metropolitan Emergency Services Board shall establish and adopt design standards for the metropolitan area 911 system and transmit them to the commissioner for incorporation into the rules adopted pursuant to this section.\nIn 911 systems that have been approved by the commissioner for a local location identification database, each wire-line telecommunications service provider shall provide current customer names, service addresses, and telephone numbers to each public safety answering point within the 911 system and shall update the information according to a schedule prescribed by the county 911 plan. Information provided under this subdivision must be provided in accordance with the transactional record disclosure requirements of the federal Communications Act of 1934, United States Code, title 47, section 222, subsection (g).\n(a) Names, addresses, and telephone numbers provided to a 911 system under subdivision 3 are private data and may be used only:\n(1) to identify the location or identity, or both, of a person calling a 911 public safety answering point; or\n(2) by a public safety answering point to notify the public of an emergency.\nThe information furnished under subdivision 3 may not be used or disclosed by 911 system agencies, their agents, or their employees for any other purpose except under a court order.\n(b) For purposes of this subdivision, \"emergency\" means a situation in which property or human life is in jeopardy and the prompt notification of the public by the public safety answering point is essential.\n(a) A wire-line telecommunications service provider, its employees, or its agents are not liable to any person who uses enhanced 911 telecommunications service for release of subscriber information required under this chapter to any public safety answering point.\n(b) A wire-line telecommunications service provider is not liable to any person for the good-faith release to emergency communications personnel of information not in the public record, including, but not limited to, nonpublished or nonlisted telephone numbers.\n(c) A wire-line telecommunications service provider, its employees, or its agents are not liable to any person for civil damages resulting from or caused by any act or omission in the development, design, installation, operation, maintenance, performance, or provision of enhanced 911 telecommunications service, except for willful or wanton misconduct.\n(d) A multiline telephone system manufacturer, provider, or operator is not liable for any civil damages or penalties as a result of any act or omission, except willful or wanton misconduct, in connection with developing, designing, installing, maintaining, performing, provisioning, adopting, operating, or implementing any plan or system required by section 403.15.\n(e) A telecommunications service provider that participates in or cooperates with the public safety answering point in notifying the public of an emergency, as authorized under subdivision 4, is immune from liability arising out of the notification except for willful or wanton misconduct.",
	"repealed": false
}