{
	"id": "524.6-213",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.6-213",
	"title": "524.6-213 FORMS.",
	"text": "Deposits made using a form of account containing the following language signed by the depositor shall be conclusive evidence of the intent of the depositor, in the absence of fraud or misrepresentation, subject, nevertheless, to other disposition made by will as provided in section 524.6-204, clause (d), to establish a survivorship account:\n(a) \"I (we) direct that the balance remaining in this account shall be PAYABLE ON DEATH (of the survivor of us) to:\nDated: .................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................... \"\n(b) \"I (we) intend and agree that the balance in this account, upon the death of any party to this account, shall belong to the surviving party, or if there are two or more surviving parties, they shall take as JOINT TENANTS.\nDated: .................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................... \"\nWhere no rights of survivorship are intended and the account is one to be established for convenience only between a depositor and an agent, the following language is recommended for use, and when so used, the account shall be construed as a matter of law to be an account subject to a power of attorney with no survivorship rights, the form to read as follows:\n\"I ......................... (grantor of power), hereby constitute and appoint ......................... (grantee of power), as my attorney-in-fact, to deposit or withdraw funds held in ............... .......... (name of bank), in account No. .................\nDated:\nAcknowledgment: In the presence of ........................... (an authorized person), ............................ (name of financial institution).\"\nThe power so granted is subject to the provisions of sections 508.72, 508A.72, and 523.01 to 523.24.\nA contract of deposit that contains provisions in substantially the following form establishes the type of account provided, and the account is governed by the provisions of this part applicable to an account of that type:\nUNIFORM SINGLE- OR MULTIPLE-PARTY ACCOUNT FORM\nA contract of deposit that does not contain provisions in substantially the form provided in subdivision 3 is governed by the provisions of this part applicable to the type of account that most nearly conforms to the depositor's intent.",
	"repealed": false
}