{
	"id": "458A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.32",
	"title": "458A.32 UP TO 40-YEAR REVENUE BONDS WITHOUT ELECTION.",
	"text": "Notwithstanding any limitations imposed by law or by the charter of the city of Duluth, the authority shall have the power to issue negotiable revenue bonds for any one or more of its purposes. Revenue bonds under this section shall be issued in such amounts, times, and series as the authority shall determine by resolution, upon approval and ratification of the city council of the city of Duluth, evidenced by resolution; and shall mature within 40 years from their date. No election shall be necessary to authorize the issuance of revenue bonds as herein provided for. Except as otherwise provided by this section, the maturities, any right of prior redemption, execution, paying agency, provision for interest, and other terms of the bonds, shall be subject to the provisions of sections 475.54 to 475.56.\nRevenue bonds issued under this section shall not constitute a debt of the city of Duluth, and no tax levy may be compelled for their payment, but they shall be payable only from the revenues of the transit system or part thereof pledged by the authority and the city council to payment of principal thereof and interest thereon; and they shall so recite. At or before the issuance of revenue bonds, the authority, by resolution, and upon approval and ratification by the city council, shall pledge and appropriate to the payment of principal and interest the net revenues of the transit system, or some part thereof, not to include the proceeds of any tax levy, after provision for reasonable and necessary expenses of operation and maintenance, as described and defined in the authorizing resolution.\nBy the authorizing resolution, the authority may provide covenants for the protection of the bondholders relating to disposition of bond proceeds and revenues; reserves and investment thereof; construction, acquisition, repair, replacement, operation and insurance of the public transit system facilities; accounting and reports; issuance of parity or subordinate lien bonds; rates and charges to be established or maintained; competing public transit systems; and such other covenants as the authority shall find to be usual and reasonably necessary for the protection of transit revenue bondholders. Among other covenants, the authority is authorized to covenant on behalf of the city of Duluth that no franchise, license, or permit shall be granted for any public transit system or part thereof which would compete with the public transit system or part thereof, the revenues of which are pledged. The authority may also define the event or events of default and other requisites for suit by bondholders or their representatives, conditions of bond registration or replacement, and conditions upon which any covenant may be amended. Any terms, covenants, or conditions of revenue bonds to be provided by resolution of the authority may be set forth in a trust indenture with a corporation having trust powers appointed by the authority, with the approval of the city council, to represent and act for bondholders, and to hold and disburse pledged revenues, and to perform such other duties as may be provided in the trust indenture; but no such trust indenture shall confer or authorize any mortgage lien on the real or operating properties or general funds of the authority.\nRevenue bonds of the authority shall be deemed and treated as instrumentalities of a public government agency.",
	"repealed": false
}