{
	"id": "290.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.05",
	"title": "290.05 EXEMPT INDIVIDUALS, ORGANIZATIONS, ESTATES, TRUSTS.",
	"text": "The following corporations, individuals, estates, trusts, and organizations shall be exempted from taxation under this chapter, provided that every such person or corporation claiming exemption under this chapter, in whole or in part, must establish to the satisfaction of the commissioner the taxable status of any income or activity:\n(a) corporations, individuals, estates, and trusts engaged in the business of mining or producing iron ore and mining, producing, or refining other ores, metals, and minerals, the mining, production, or refining of which is subject to the occupation tax imposed by section 298.01; but if any such corporation, individual, estate, or trust engages in any other business or activity or has income from any property not used in such business it shall be subject to this tax computed on the net income from such property or such other business or activity. Royalty shall not be considered as income from the business of mining or producing iron ore within the meaning of this section;\n(b) the United States of America, the state of Minnesota or any political subdivision of either agencies or instrumentalities, whether engaged in the discharge of governmental or proprietary functions; and\n(c) any insurance company, other than a disqualified captive insurance company.\nExcept as provided in subdivisions 1 and 3, organizations, including specifically nonprofit health service plan corporations, as defined in chapter 62C, are subject to taxation under this chapter unless they are exempt from income taxation pursuant to Subchapter F of the Internal Revenue Code.\n(a) An organization exempt from taxation under subdivision 2 shall, nevertheless, be subject to tax under this chapter to the extent provided in the following provisions of the Internal Revenue Code:\n(1) section 527 (dealing with political organizations);\n(2) section 528 (dealing with certain homeowners associations);\n(3) sections 511 to 515 (dealing with unrelated business income);\n(4) section 521 (dealing with farmers' cooperatives); and\n(5) section 6033(e)(2) (dealing with lobbying expense); but notwithstanding this subdivision, shall be considered an organization exempt from income tax for the purposes of any law which refers to organizations exempt from income taxes.\n(b) The tax shall be imposed on the taxable income of political organizations or homeowner associations or the unrelated business taxable income, as defined in section 512 of the Internal Revenue Code, of organizations defined in section 511 of the Internal Revenue Code, provided that the tax is not imposed on:\n(1) advertising revenues from a newspaper published by an organization described in section 501(c)(4) of the Internal Revenue Code;\n(2) revenues from lawful gambling authorized under chapter 349 that are expended for purposes that qualify for the deduction for charitable contributions under section 170 of the Internal Revenue Code, disregarding the limitation under section 170(b)(2), but only to the extent the contributions are not deductible in computing federal taxable income; or\n(3) amounts included in unrelated business taxable income under section 512(a)(7) of the Internal Revenue Code.\nThe tax shall be at the corporate rates. The tax shall only be imposed on income and deductions assignable to this state under sections 290.17 to 290.20. To the extent deducted in computing federal taxable income, the deductions contained in section 290.21 shall not be allowed in computing Minnesota taxable net income.\n(c) The tax shall be imposed on organizations subject to federal tax under section 6033(e)(2) of the Internal Revenue Code, in an amount equal to the corporate tax rate multiplied by the amount of lobbying expenses taxed under section 6033(e)(2) which are attributable to lobbying the Minnesota state government.\n(d) In calculating unrelated business taxable income under section 512 of the Internal Revenue Code, the amount of any net operating loss deduction claimed under section 172 of the Internal Revenue Code is an addition. Taxpayers making an addition under this paragraph may deduct a net operating loss for the taxable year in the same manner as a corporation under section 290.095, in a form and manner prescribed by the commissioner, and may calculate the loss without the application of the limitation provided for under section 512(a)(6) of the Internal Revenue Code.\n(a) If the Internal Revenue Service revokes, cancels or suspends, in whole or part, the exempt status of any corporation, individual, estate, trust or organization, or if the amount of gross income, deductions, credits, items of tax preference or taxable income is changed or corrected by either the taxpayer or the Internal Revenue Service, or if the taxpayer consents to any extension of time for assessment of federal income taxes, the corporation, individual, estate, trust or organization shall notify the commissioner in writing of the action within 90 days after that date.\n(b) The periods of limitations contained in section 289A.42, subdivision 2, apply when there has been any action referred to in paragraph (a), notwithstanding any period of limitations to the contrary.\n[Repealed, 1990 c 480 art 1 s 45]\n[Repealed, 1994 c 587 art 1 s 25]\n[Repealed, 1989 c 184 art 1 s 20]\nThe commissioner may examine or investigate an entity claiming exemption under this section and subpart F of the Internal Revenue Code. The commissioner may revoke the exemption under this section for violations of federal law that would permit the commissioner of internal revenue or the secretary of the treasury to revoke the exemption under federal law, regardless of whether such action has been taken under federal law. A revocation under this subdivision is subject to administrative review under section 270C.35.",
	"repealed": false
}