{
	"id": "356.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.47",
	"title": "356.47 DISPOSITION OF AMOUNT IN EXCESS OF REEMPLOYED ANNUITANT EARNINGS LIMITATIONS.",
	"text": "(a) This section applies to the balance of annual retirement annuities on the amount of retirement annuity reductions after reemployed annuitant earnings limitations for retirement plans governed by section 352.115, subdivision 10; 353.37; or 354.44, subdivision 5.\n(b) This section also applies to the balance of annual retirement annuities on the amount of retirement annuity reductions under section 354A.31, subdivision 3, for members of the St. Paul Teachers Retirement Fund Association whose effective date of retirement is before July 1, 2013.\nThe chief administrative officer of each retirement plan shall keep records for each reemployed annuitant of the amount of the annuity reduction. This amount must be reported to each member at least once each year.\n(a) Beginning one year after the reemployment withholding period ends relating to the reemployment that gave rise to the limitation, and the filing of a written application, the retired member is entitled to the payment, in a lump sum, of the value of the person's amount under subdivision 2, plus annual compound interest. For the general state employees retirement plan, the correctional state employees retirement plan, the general employees retirement plan of the Public Employees Retirement Association, the public employees police and fire retirement plan, the local government correctional employees retirement plan, and the teachers retirement plan, the annual interest rate is six percent from the date on which the amount was deducted from the retirement annuity to the date of payment or until January 1, 2011, whichever is earlier, and no interest after January 1, 2011. For the St. Paul Teachers Retirement Fund Association, the annual interest is the rate of six percent from the date that the amount was deducted from the retirement annuity to the date of payment or June 30, 2011, whichever is earlier, and with no interest accrual after June 30, 2011.\n(b) The written application must be on a form prescribed by the chief administrative officer of the applicable retirement plan.\n(c) If the retired member dies before the payment provided for in paragraph (a) is made, the amount is payable, upon written application, to the deceased person's surviving spouse, or if none, to the deceased person's designated beneficiary, or if none, to the deceased person's estate.\n(d) If the amount under subdivision 2 is an eligible rollover distribution as defined in section 356.633, subdivision 1, paragraph (d), the applicable retirement plan shall provide notice and an election:\n(1) to the member regarding the member's right to elect a direct rollover under section 356.633, subdivisions 1 and 2, in lieu of a direct payment; or\n(2) if paragraph (c) applies and the amount is to be paid to a person who is a distributee as defined in section 356.633, subdivision 1, paragraph (b), to the distributee regarding the distributee's right to elect a direct rollover under section 356.633, subdivisions 1 and 2, in lieu of a direct payment.",
	"repealed": false
}