{
	"id": "10A.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.025",
	"title": "10A.025 FILING REQUIREMENTS.",
	"text": "If a scheduled filing date under this chapter falls on a Saturday, Sunday, or legal holiday, the filing date is the next regular business day.\n(a) A report or statement required to be filed under this chapter may be filed electronically. The board shall adopt rules to regulate electronic filing and to ensure that the electronic filing process is secure.\n(b) A document filed by facsimile transmission or electronic filing system has the same force and effect as filing an original paper document.\n(c) In order to provide a secure environment for the submission of electronic files, the board must require that a filer use a personal identification code when submitting an electronic file. The board may also request the filer to provide a valid email address in order to receive confirmation and verification messages from the board.\n(d) After an electronic file is processed by the board, the information contained in the electronic file becomes the property of the state subject to the terms of the Data Practices Act under chapter 13.\n(e) In the case of a filing by facsimile transmission, the filer must retain the original of the filed document and a record of the date and time of the transmission. If an electronic filing system is used to submit an electronic file to the board, the filer must retain as documentation the database and information on which the electronic submission of data is based. The database and records are subject to audit as provided in this chapter.\n(f) Within five days of a request by the board, any person filing a document by facsimile transmission or electronic filing system shall refile the document by one of the other filing methods provided in Minnesota Rules, part 4501.0500, subpart 1.\n(g) Technical problems that prevent the successful submission of a facsimile transmission or electronic file do not relieve the filer of the responsibility of meeting the requirements of this chapter. An audit trail that demonstrates that the facsimile transmission or electronic file was successfully submitted in a timely fashion may be used by the board to waive late filing fees.\nA filing with the board is complete upon:\n(1) receipt in the board office of the document being filed, bearing the original signature of the person responsible for filing the document;\n(2) receipt of a facsimile transmission of the document, subject to subdivision 1a;\n(3) the postmark date of a first class or certified mailing of the document being filed, properly addressed to the board at its current address; or\n(4) the successful submission of an electronic file to the board.\n(a) A report or statement required to be filed under this chapter must be signed and certified as true by the individual required to file the report. The signature may be an electronic signature consisting of a password assigned by the board.\n(b) An individual shall not sign and certify to be true a report or statement knowing it contains false information or knowing it omits required information.\n(c) An individual shall not knowingly provide false or incomplete information to a treasurer with the intent that the treasurer will rely on that information in signing and certifying to be true a report or statement.\n(d) A person who violates paragraph (b) or (c) is subject to a civil penalty imposed by the board of up to $3,000. A violation of paragraph (b) or (c) is a gross misdemeanor.\n(e) The board may impose an additional civil penalty of up to $3,000 on the principal campaign committee or candidate, party unit, political committee, or association that has a political fund that is affiliated with an individual who violated paragraph (b) or (c).\n(a) A person required to file a report or statement or who has accepted record-keeping responsibility for the filer must maintain records on the matters required to be reported, including vouchers, canceled checks, bills, invoices, worksheets, and receipts, that will provide in sufficient detail the necessary information from which the filed reports and statements may be verified, explained, clarified, and checked for accuracy and completeness. The person must keep the records available for audit, inspection, or examination by the board or its authorized representatives for four years from the date of filing of the reports or statements or of changes or corrections to them.\n(b) The board may impose a civil penalty of up to $3,000 on a person who knowingly violates this subdivision. The board may impose a separate civil penalty of up to $3,000 on the principal campaign committee or candidate, party unit, political committee, or association that has a political fund that is affiliated with an individual who violated this subdivision.\n(c) A knowing violation of this subdivision is a misdemeanor.\nMaterial changes in information previously submitted and corrections to a report or statement must be reported in writing to the board within ten days following the date of the event prompting the change or the date upon which the person filing became aware of the inaccuracy. The change or correction must identify the form and the paragraph containing the information to be changed or corrected. A request from the board to a lobbyist to provide more detailed information about a specific subject of interest disclosed on a lobbyist disbursement report is a change or correction governed by this subdivision.\nA person who willfully fails to report a material change or correction is subject to a civil penalty imposed by the board of up to $3,000. A willful violation of this subdivision is a gross misdemeanor.\nThe board must send a written notice to any individual who fails to file a report required by this subdivision. If the individual fails to file the required report within ten business days after the notice was sent, the board may impose a late filing fee of $25 per day up to $1,000 starting on the 11th day after the notice was sent. The board may send an additional notice by certified mail to an individual who fails to file a report within ten business days after the first notice was sent by the board. The certified notice must state that if the individual does not file the requested report within ten business days after the certified notice was sent, the individual may be subject to a civil penalty for failure to file a report. An individual who fails to file a report required by this subdivision within ten business days after the certified notice was sent by the board is subject to a civil penalty imposed by the board of up to $1,000.\nAn individual or association required to file a report under this chapter must provide information requested by the board to reconcile discrepancies between the report and reports filed by other individuals or associations. The board's request for information must be in writing. If the individual or association fails to provide the requested information within ten business days after the request was sent, the board may impose a late filing fee of $25 per day up to $1,000.\nThe board may send notice by certified mail to an individual or association that has not timely responded to the board's written request for reconciliation information. The certified notice must state that if the individual or association does not respond to the board's request for information within ten business days after the certified notice was sent, the individual or association may be subject to a civil penalty for failure to provide information to the board. An individual or association that does not provide the requested information within ten business days after the certified notice was sent is subject to a civil penalty imposed by the board of up to $1,000.\nA person who willfully fails to cooperate with the board to reconcile a report discrepancy is subject to a civil penalty imposed by the board of up to $3,000.",
	"repealed": false
}