{
	"id": "502.851",
	"url": "https://www.revisor.mn.gov/statutes/cite/502.851",
	"title": "502.851 TRUST DECANTING.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Appointed trust\" means an irrevocable trust which receives principal from an invaded trust under subdivision 3 or 4, including another trust created by the settlor of the invaded trust, under the terms of the invaded trust or any other trust instrument, or by the trustees, in that capacity, of the invaded trust. For purposes of creating another trust, any requirement that a trust instrument be signed by the settlor shall be deemed satisfied by the signature of the trustee of the appointed trust.\n(c) \"Authorized trustee\" means, as to an invaded trust, any trustee or trustees with authority to pay trust principal to or for one or more current beneficiaries other than a trustee who is the settlor, or a beneficiary to whom income or principal must be paid currently or in the future, or who is or will become eligible to receive a distribution of income or principal in the discretion of the trustee, other than by the exercise of a power of appointment held in a nonfiduciary capacity.\n(d) \"Current beneficiary\" or \"beneficiaries\" means the person or persons, or as to a class, any person or persons who are or will become members of that class, to whom the trustees may distribute principal at the time of the exercise of the power, provided that the interest of a beneficiary to whom income, but not principal, may be distributed at the discretion of the trustee of the invaded trust, may be continued in the appointed trust.\n(e) \"Invade\" means the power to pay directly to the beneficiary of a trust or make application for the benefit of the beneficiary.\n(f) \"Invaded trust\" means any existing irrevocable inter vivos or testamentary trust whose principal is appointed under subdivision 3 or 4.\n(g) \"Person or persons interested in the invaded trust\" means all qualified beneficiaries as defined in section 501C.0103, paragraph (m).\n(h) \"Principal\" includes the income of the trust at the time of the exercise of the power that is not currently required to be distributed, including accrued and accumulated income.\n(i) \"Unlimited discretion\" means the unlimited power to distribute principal. A power to distribute principal that includes words such as best interests, welfare, comfort, or happiness shall not be considered a limitation of the power to distribute principal.\nAn exercise of a power of appointment is not void if the exercise is:\n(1) more extensive than was authorized but is valid to the extent authorized by the instrument creating its power; or\n(2) less extensive than authorized by the instrument creating the power, unless the donor has manifested a contrary intention.\n(a) An authorized trustee with unlimited discretion to invade trust principal may appoint part or all of the principal to a trustee of an appointed trust for, and only for the benefit of, one, more than one, or all of the current beneficiaries of the invaded trust, to the exclusion of any one or more of the current beneficiaries. The successor and remainder beneficiaries of the appointed trust may be none, one, more than one, or all of the successor and remainder beneficiaries of the invaded trust.\n(b) An authorized trustee exercising the power under paragraph (a) may grant a discretionary power of appointment in the appointed trust to one or more of the current beneficiaries of the invaded trust, provided that the beneficiary granted a power to appoint may receive principal outright under the terms of the invaded trust.\n(c) If the authorized trustee grants a power of appointment, the class of permissible appointees in favor of whom the beneficiary may exercise the power of appointment granted in the appointed trust may be broader or otherwise different from the current, successor, and remainder beneficiaries of the invaded trust.\n(d) If the beneficiary or beneficiaries of the invaded trust are described by a class, the beneficiary or beneficiaries of the appointed trust may include present or future members of the class.\n(a) An authorized trustee with the power to invade trust principal but without unlimited discretion may appoint part or all of the principal of the trust to a trustee of an appointed trust, provided that the current beneficiaries of the appointed trust shall be the same as the current beneficiaries of the invaded trust and the successor and remainder beneficiaries shall be the same as the successor and remainder beneficiaries of the invaded trust.\n(b) If the authorized trustee exercises the power under this subdivision, the appointed trust shall include the same language authorizing the trustee to distribute the income or invade the principal of the appointed trust as in the invaded trust.\n(c) If the authorized trustee exercises the power under this subdivision to extend the term of the appointed trust beyond the term of the invaded trust, for any period after the invaded trust would have otherwise terminated under the provisions of the invaded trust, the appointed trust, in addition to the language required to be included in the appointed trust pursuant to paragraph (b), may also include language providing the trustee with unlimited discretion to invade the principal of the appointed trust during this extended term.\n(d) If the beneficiary or beneficiaries of the invaded trust are described by a class, the beneficiary or beneficiaries of the appointed trust shall include present or future members of the class.\n(e) If the authorized trustee exercises the power under this subdivision and if the invaded trust grants a power of appointment to a beneficiary of the trust, the appointed trust shall grant the power of appointment in the appointed trust and the class of permissible appointees shall be the same as in the invaded trust.\nAn exercise of the power to invade trust principal under subdivision 3 or 4 shall be considered the exercise of a special power of appointment.\nThe appointed trust to which an authorized trustee appoints the assets of the invaded trust may have a term that is longer than the term set forth in the invaded trust, including, but not limited to, a term measured by the lifetime of a current beneficiary.\nIf an authorized trustee has unlimited discretion to invade the principal of a trust, and the same trustee or another trustee has the power to invade principal under the trust instrument and that power is not subject to unlimited discretion, the authorized trustee having unlimited discretion may exercise the power of appointment under subdivision 3.\nAn authorized trustee may exercise the power to appoint in favor of an appointed trust under subdivision 3 or 4 whether or not there is a current need to invade principal under the terms of the invaded trust.\nAn authorized trustee exercising the power under this section has a fiduciary duty to exercise the power in the best interests of one or more proper objects of the exercise of the power and as a prudent person would exercise the power under the prevailing circumstances.\nUnless the authorized trustee provides otherwise:\n(1) the appointment of all the assets comprising the principal of the invaded trust to an appointed trust shall include subsequently discovered assets of the invaded trust and undistributed principal of the invaded trust acquired after the appointment to the appointed trust; and\n(2) the appointment of part but not all of the assets comprising the principal of the invaded trust to an appointed trust shall not include subsequently discovered assets belonging to the invaded trust and principal paid to or acquired by the invaded trust after the appointment to the appointed trust. These assets shall remain the assets of the invaded trust.\n(a) The exercise of the power to appoint to an appointed trust under subdivision 3 or 4 must be evidenced by an instrument in writing, signed, dated, and acknowledged by the authorized trustee. The exercise of the power shall be effective 60 days after the date of delivery of notice as specified in paragraph (c), unless each person entitled to notice agrees in writing to an earlier effective date or waives in writing the right to object to the exercise of the power.\n(b) An authorized trustee may exercise the power authorized by subdivision 3 or 4 without the consent of the settlor or the persons interested in the invaded trust and without court approval, provided that the authorized trustee may seek court approval for the exercise with notice to all persons interested in the invaded trust.\n(c) A copy of the instrument exercising the power, a copy of the appointed trust, and a copy of the invaded trust shall be delivered to:\n(1) any person having the right, pursuant to the terms of the invaded trust, to remove or replace the authorized trustee exercising the power under subdivision 3 or 4; and\n(2) all persons interested in the invaded trust.\n(d) Notice of an exercise of the power must be given in the same manner as provided in section 501C.0109.\n(e) The instrument exercising the power shall state whether the appointment is of all the assets comprising the principal of the invaded trust or only a part of the assets comprising the principal of the invaded trust and, if a part, the approximate percentage of the value of the principal of the invaded trust that is subject to the appointment.\n(f) A person entitled to notice may object to the authorized trustee's exercise of the power under this section by serving a written notice of objection upon the authorized trustee prior to the effective date of the exercise of the power. The failure to object shall not constitute a consent.\n(g) If the authorized trustee does not receive a written objection to the proposed exercise from a person entitled to notice within the applicable period, the authorized trustee is not liable to any person who received the required notice for the exercise of the power.\n(h) If the authorized trustee receives a written objection within the applicable period, either the authorized trustee or any person entitled to notice may petition the court to have the proposed exercise of a power performed as proposed, performed with modifications, or denied. In a proceeding, a person objecting to the proposed exercise has the burden of proof as to whether the authorized trustee's proposed exercise should not be performed. A person who has not objected is not estopped from opposing the proposed exercise in the proceeding. If the authorized trustee decides not to implement the proposed exercise, the trustee shall notify all persons entitled to notice of the decision not to exercise the power and the reasons for the decision, and the authorized trustee's decision not to implement the proposed exercise does not itself give rise to liability to any person interested in the invaded trust. A person entitled to notice may petition the court to have the exercise of a power performed and has the burden of proof as to whether it should be performed.\n(i) A copy of the instrument exercising the power and a copy of each of the invaded trust and the appointed trust shall be filed with records of the appointed trust and the invaded trust.\nThis section shall not be construed to abridge the right of any trustee to appoint property in further trust that arises under the terms of the governing instrument of a trust or under any other provision of law or under common law, or as directed by any court having jurisdiction over the trust.\nNothing in this section is intended to create or imply a duty to exercise a power to invade principal, and no inference of impropriety shall be made as a result of an authorized trustee not exercising the power conferred under subdivision 3 or 4.\nA power authorized by subdivision 3 or 4 may be exercised, subject to the provisions of subdivision 9, unless expressly prohibited by the terms of the governing instrument, but a general prohibition of the amendment or revocation of the invaded trust or a provision that constitutes a spendthrift clause shall not preclude the exercise of a power under subdivision 3 or 4.\nAn authorized trustee may not exercise a power authorized by subdivision 3 or 4 to effect any of the following:\n(1) to reduce, limit, or modify any beneficiary's current right to a mandatory distribution of income or principal, a mandatory annuity or unitrust interest, a current right to withdraw a percentage of the value of the trust, or a current right to withdraw a specified dollar amount; provided, however, and subject to the other limitations in this section, an authorized trustee may exercise a power authorized by subdivision 3 or 4 to appoint to an appointed trust that is a supplemental needs trust that conforms to the provisions of section 501C.1205;\n(2) notwithstanding section 501C.1008, paragraph (b), to decrease or indemnify against a trustee's liability or exonerate a trustee from liability for failure to exercise reasonable care, diligence, and prudence;\n(3) to alter or eliminate a provision granting another person the right to remove or replace the authorized trustee exercising the power under subdivision 3 or 4, unless notice has been provided to the persons under subdivision 11, paragraph (c), or approval is granted by a court having jurisdiction over the trust;\n(4) to make a binding and conclusive fixation of the value of any asset for purposes of distribution, allocation, or otherwise;\n(5) to extend the term of the appointed trust beyond any permissible period of the rule against perpetuities of the invaded trust, and any exercise of the power which extends the term of the appointed trust beyond the permissible period of the rule against perpetuities of the invaded trust shall void the entire exercise of the power; or\n(6) to jeopardize:\n(i) the deduction or exclusion originally claimed with respect to any contribution to the invaded trust that qualified for the annual exclusion under section 2503(b) of the Internal Revenue Code; the marital deduction under section 2056(a) or 2523(a) of the Internal Revenue Code; or the charitable deduction under section 170(a), 642(c), 2055(a), or 2522(a) of the Internal Revenue Code;\n(ii) the qualification of a transfer as a direct skip under section 2642(c) of the Internal Revenue Code; or\n(iii) any other specific tax benefit for which a contribution originally qualified for income, gift, estate, or generation-skipping transfer purposes under the Internal Revenue Code.\nFor the purposes of this section:\n(1) Unless a court otherwise directs, an authorized trustee may not exercise a power authorized by subdivision 3 or 4 to change the provisions regarding the determination of the compensation of any trustee. The commissions or other compensation payable to the trustees of the invaded trust may continue to be paid to the trustees of the appointed trust during the term of the appointed trust and shall be determined in the same manner as in the invaded trust.\n(2) No trustee shall receive any paying commission or other compensation for appointing of property from the invaded trust to an appointed trust pursuant to subdivision 3 or 4.\nUnless the invaded trust expressly provides otherwise, this section applies to any trust governed by the laws of this state, including a trust whose governing law has been changed to the laws of this state.",
	"repealed": false
}