{
	"id": "412.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.151",
	"title": "412.151 DUTIES OF CLERK.",
	"text": "The clerk shall give the required notice of each regular and special election, record the proceedings thereof, notify officials of their election or appointment to office, certify to the county auditor all appointments and the results of all city elections. The clerk shall keep (1) a minute book, noting therein all proceedings of the council; (2) an ordinance book to record at length all ordinances passed by the council; and (3) an account book to enter all money transactions of the city including the dates and amounts of all receipts and the person from whom the money was received and all orders drawn upon the treasurer with their payee and object. Ordinances, resolutions, and claims considered by the council need not be given in full in the minute book if they appear in other permanent records of the clerk and can be accurately identified from the description given in the minutes. The clerk shall act as the clerk and bookkeeper of the city, shall be the custodian of its seal and records, shall sign its official papers, shall post and publish such notices, ordinances and resolutions as may be required and shall perform such other appropriate duties as may be imposed by the council. For certified copies, and for filing and entering, when required, papers not relating to city business, the clerk shall receive the fees allowed by law to town clerks; but the council may require the clerk to pay such fees into the city treasury. With the consent of the council, the clerk may appoint a deputy for whose acts the clerk shall be responsible and whom the clerk may remove at pleasure. In case of the clerk's absence from the city or disability, the council may appoint a deputy clerk, if there is none, to serve during such absence or disability. The deputy may discharge any of the duties of the clerk, except that deputy shall not be a member of the council.\nThe council by ordinance may delegate all or part of the clerk's bookkeeping duties to another officer or employee. The officer or employee who by ordinance is made responsible for the clerk's bookkeeping duties shall furnish a fidelity bond conditioned for the faithful exercise of duties. The council may provide for the payment from city funds of the premium on the official bond. If the bookkeeping functions of the clerk are delegated to the city treasurer, the council shall provide for an annual audit of the city's financial affairs in accordance with the minimum procedures prescribed by the state auditor. A copy of the ordinance shall be provided to the state auditor.",
	"repealed": false
}