{
	"id": "60A.0783",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.0783",
	"title": "60A.0783 INSURABLE INTEREST REQUIRED.",
	"text": "A person may not procure or cause to be procured or effected a policy upon the life of another individual unless the benefits under the policy are payable to the insured, the personal representatives of the insured's estate, or to a person having, at the time the policy is issued, an insurable interest in the individual insured.\nInsurable interest, with reference to insurance on the life of another, includes only the following interests.\n(a) An individual has an insurable interest in the life of another person to whom the individual is closely related by blood or by law and in whom the individual has a substantial interest engendered by love and affection.\n(b) An individual has an insurable interest in the life of another person if such individual has a lawful and substantial interest in the continued life of the individual insured, as distinguished from an interest that would arise only by or would be enhanced in value by the death of the individual insured.\n(c) An individual party to a contract for the purchase or sale of an interest in any business entity and, if applicable, a trust or the trustee of a trust of which the individual is a settlor, has an insurable interest in the life of each other individual party to the contract, but only for the purpose of carrying out the intent and purpose of the contract.\n(d) A trust, or the trustee of a trust, has an insurable interest in the life of an individual insured under a life insurance policy owned by the trust, or the trustee of the trust acting in a fiduciary capacity, if the insured is the settlor of the trust; an individual closely related by blood or law to the settlor; or an individual in whom the settlor otherwise has an insurable interest if, in each of the situations described in this paragraph, the life insurance proceeds are primarily for the benefit of trust beneficiaries having an insurable interest in the life of the insured and the trust is not used, directly or indirectly, as part of or in furtherance of an act, practice, or arrangement that is otherwise prohibited by sections 60A.078 to 60A.0789.\n(e) A guardian, trustee, or other fiduciary, acting in a fiduciary capacity, has an insurable interest in the life of any person for whose benefit the fiduciary holds property, and in the life of any other individual in whose life the person has an insurable interest so long as the life insurance proceeds are used primarily for the benefit of persons having an insurable interest in the life of the insured and the guardianship or fiduciary relationship is not used, directly or indirectly, as part of or in furtherance of an act, practice, or arrangement that is otherwise prohibited by sections 60A.078 to 60A.0789.\n(f) An organization in section 170(c) of the United States Internal Revenue Code of 1986, as amended through December 31, 2008, has an insurable interest in the life of any person who consents in writing to the organization's ownership or purchase of that insurance.\n(g) A trustee, sponsor, or custodian of assets held in any plan governed by the Employee Retirement Income Security Act of 1974, United States Code, title 29, section 1001, et seq., or in any other retirement or employee benefit plan, has an insurable interest in the life of any participant in the plan provided consent is obtained in writing from the participant before the insurance is purchased. An employer, trustee, sponsor, or custodian may not retaliate or take adverse action against any participant who does not consent to the issuance of insurance on the participant's life.\n(h) A business entity has an insurable interest in the life of any of the owners, directors, officers, partners, and managers of the business entity or any affiliate or subsidiary of the business entity, or key employees or key persons of the business entity or affiliate or subsidiary, provided consent is obtained in writing from key employees or persons before the insurance is purchased. The business entity or affiliate or subsidiary may not retaliate or take adverse action against any key employee or person who does not consent to the issuance of insurance on the key employee or key person's life. For purposes of this subdivision, a \"key employee\" or \"key person\" means an individual whose position or compensation is described in section 101(j)(2)(A)(ii) of the Internal Revenue Code of 1986, as amended through December 31, 2008.\n(i) A financial institution or other person to whom a debt is owed, whether for the purposes of premium financing or otherwise, has an insurable interest in the life of the borrower limited to the amount of debt owed plus reasonable interest and service charges.\nAn individual has an insurable interest in the individual's own life and an individual of competent legal capacity that procures or effects a policy on the individual's own life may designate any person as the beneficiary, provided the policy is not part of or in furtherance of an act, practice, or arrangement that is otherwise prohibited by sections 60A.078 to 60A.0789.\nAn insurer is entitled to rely upon all reasonable statements, declarations, and representations made by an applicant for life insurance relative to the existence of an insurable interest; and no insurer shall incur legal liability, except as set forth in the policy, by virtue of untrue statements, declarations, or representations so relied upon in good faith by the insurer.\nA policy upon the life of an individual, other than a policy of noncontributory group life insurance, may not be effectuated unless, on or before the time the policy is effectuated, the individual insured, having legal capacity to contract, applies for or consents in writing to the policy and its terms. Consent may be given by another in the following cases:\n(1) a parent or a person having legal custody of a minor may consent to the issuance of a policy on a dependent child;\n(2) a court-appointed guardian of a person may consent to the issuance of a policy on the person under guardianship;\n(3) a court-appointed conservator of a person's estate may consent to the issuance of a policy on the person whose estate is under conservatorship;\n(4) an attorney-in-fact may consent to the issuance of a policy on the person that appointed the attorney-in-fact for the limited purpose of replacing one or more policies with one or more new policies, provided the aggregate amount of life insurance on the person as the result of the replacement remains the same or decreases;\n(5) a trustee of a revocable trust may consent to the issuance of a policy on the life of a settlor of the trust; and\n(6) a court of general jurisdiction may give consent to the issuance of a policy upon a showing of facts the court considers sufficient to justify the issuance of the policy.",
	"repealed": false
}