{
	"id": "192.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.056",
	"title": "192.056 PROTECTION OF RESERVIST-OWNED BUSINESS DURING ACTIVE SERVICE.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Active service\" has the meaning given in section 190.05, subdivision 5.\n(c) \"Business\" means a business wholly owned by a qualified service member, or jointly by the member and the member's spouse, irrespective of whether the business is a sole proprietorship, corporation, limited liability company, partnership, limited partnership, or other type of business entity.\n(d) \"Qualified service member\" means a Minnesota resident who is serving honorably as a member of the Minnesota National Guard or any other military reserve unit of the United States armed forces who has been ordered into active service for a period of 60 days or longer.\n(a) Notwithstanding any other law or rule to the contrary, the business of a qualified service member may be exempted from civil court proceedings for part or all of the period of the member's active military service and for up to 60 days thereafter, as provided in this section.\n(b) If the business of a qualified service member is a defendant in a civil action, the court may, on its own motion, grant a stay in the proceedings for a minimum of 60 days. The court, on its own motion, may renew the stay as the court considers appropriate. If the qualified service member petitions the court in any manner for a stay, the court must grant a stay for a minimum of 60 days, provided that:\n(1) the service member submits to the court a letter or other communication setting forth facts stating the manner in which current military duty requirements materially affect the service member's ability to appear or otherwise participate in the proceedings, and stating a date when the service member will be available to appear or otherwise participate in the proceedings; and\n(2) the service member submits a letter or other communication from the service member's commanding officer stating that the service member's current military duty prevents appearance and that military leave is not authorized for the service member at the time of the letter.\n(c) A service member's communication with the court requesting a stay does not constitute an appearance for jurisdictional purposes and does not constitute a waiver of any substantive or procedural defense, including a defense relating to lack of personal jurisdiction.\n(d) A qualified service member who is granted a stay in the action or proceedings against the member's business may in any manner request from the court an additional stay, which the court may grant if the service member can show to the satisfaction of the court that the member's military requirements affect the member's ability to appear. However, the court is not obligated to grant the additional stay. If the court refuses to grant an additional stay, the court must provide the service member with information enabling the service member to acquire qualified legal counsel, at the service member's discretion, for defending the action.\n(e) If a default judgment is entered in a civil action against the business of a qualified service member during the service member's period of active military service, or within 60 days following termination of or release from the active military service, the court entering the judgment must, upon application by or on behalf of the service member, reopen the judgment for the purpose of allowing the member to defend the action if it appears that:\n(1) the service member was materially affected by reason of that military service in making a defense to the action; and\n(2) the service member has a meritorious or legal defense to the action or some part of it.",
	"repealed": false
}