{
	"id": "419.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/419.07",
	"title": "419.07 OFFICERS DISCHARGED ONLY AFTER HEARING.",
	"text": "No officer or employee other than a peace officer, after six months' continuous employment, shall be removed or discharged except for cause upon written charges and after an opportunity to be heard in defense of the charges as in this chapter hereinafter provided. No newly appointed peace officer after satisfactory completion of the basic peace officers training course pursuant to sections 626.843 to 626.852 and after a period of no longer than 12 months continuous employment thereafter, shall be removed or discharged except for cause upon written charges and after an opportunity to be heard in defense of the charges as in this chapter hereinafter provided. Such charges shall be investigated by or before such civil service commission. The finding and decision of such commission shall be forthwith certified to the chief or other appointed or superior officer, and will be forthwith enforced by such officer. Nothing in this chapter shall limit the power of any officer to suspend a subordinate for a reasonable period not exceeding 60 days for the purpose of discipline, or pending investigation of charges when the officer deems such suspension advisable. The commission, in any city of the second class situate in two or more counties, may, by resolution adopted by unanimous vote, incorporate in the civil service rules a rule fixing the term of the office of chief of the department at six years from the date of appointment and thereafter the office of chief shall be open to competitive examination for all members of the department qualified to take such examinations. In the event of a new appointment being made to the office of chief as a result of competitive examination, the retiring chief shall be assigned a grade and class in the department as may be determined by the commission. Provided that the limitation of the term of chief as herein provided for shall not affect any person permanently holding the office of chief at the time of the passage of Laws 1947, Chapter 522; provided further that the provisions of this section shall not apply to persons referred to in Minnesota Statutes 1969, Section 299D.03.",
	"repealed": false
}