{
	"id": "609.3232",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.3232",
	"title": "609.3232 PROTECTIVE ORDER AUTHORIZED; PROCEDURES; PENALTIES.",
	"text": "Any parent or guardian who knows or has reason to believe that a person, while acting as other than a prostitute or patron, is inducing, coercing, soliciting, or promoting the prostitution of the parent or guardian's minor child, or is offering or providing food, shelter, or other subsistence for the purpose of enabling the parent or guardian's minor child to engage in prostitution, may seek an order for protection in the manner provided in this section.\nAn application for relief under this section shall be filed in the juvenile court. Actions under this section shall be given docket priority by the court.\nA petition for relief shall allege the existence of a circumstance or circumstances described in subdivision 1, and shall be accompanied by an affidavit made under oath stating the specific facts and circumstances from which relief is sought. The court shall provide simplified forms and clerical assistance to help with the writing and filing of a petition under this section.\n(a) Upon receipt of the petition, the court shall order a hearing which shall be held no later than 14 days from the date of the order. Personal service shall be made upon the respondent not less than five days before the hearing. In the event that personal service cannot be completed in time to give the respondent the minimum notice required under this paragraph, the court may set a new hearing date.\n(b) Notwithstanding the provisions of paragraph (a), service may be made by one week published notice, as provided under section 645.11, provided the petitioner files with the court an affidavit stating that an attempt at personal service made by a sheriff was unsuccessful because the respondent is avoiding service by concealment or otherwise, and that a copy of the petition and notice of hearing has been mailed to the respondent at the respondent's residence or that the residence is not known to the petitioner. Service under this paragraph is complete seven days after publication. The court shall set a new hearing date if necessary to allow the respondent the five-day minimum notice required under paragraph (a).\nUpon notice and hearing, the court may order the respondent to return the minor child to the residence of the child's parents or guardian, and may order that the respondent cease and desist from committing further acts described in subdivision 1 and cease to have further contact with the minor child. Any relief granted by the court in the order for protection shall be for a fixed period of time determined by the court.\nAny order issued under this section shall be served personally on the respondent. Upon the request of the petitioner, the court shall order the sheriff to assist in the execution or service of the order for protection.\n(a) A violation of an order for protection shall constitute contempt of court and be subject to the penalties provided under chapter 588.\n(b) Any person who willfully fails to return a minor child as required by an order for protection issued under this section commits an act which manifests an intent substantially to deprive the parent or guardian of custodial rights within the meaning of section 609.26, clause (3).",
	"repealed": false
}