{
	"id": "202A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/202A.13",
	"title": "202A.13 COMMITTEES, CONVENTIONS.",
	"text": "The rules of each major political party shall provide that for each congressional district and at least 45 counties or legislative districts a convention shall be held at least once every state general election year. Each major political party shall also provide for each congressional district and at least 45 counties or legislative districts an executive committee consisting of a chair and such other officers as may be necessary. The party rules may provide for only one executive committee and one convention where any county and congressional district have the same territorial limits.\nA delegate or alternate who is deaf, deafblind, or hard-of-hearing who needs interpreter services at a county, legislative district, congressional district, or state convention shall so notify the executive committee of the major political party unit whose convention the delegate or alternate plans to attend. Written notice must be given by certified mail or electronic mail to the executive committee at least 30 days before the convention date. The major political party, not later than 14 days before the convention date, shall secure the services of one or more interpreters if available and shall assume responsibility for the cost of the services. The state central committee of the major political party shall determine the process for reimbursing interpreters.\nA visually impaired delegate or alternate to a county, legislative district, congressional district, or state convention may notify the executive committee of the major political party unit that the delegate or alternate requires convention materials in audio tape, Braille, or large print format. Upon receiving the request, the executive committee shall provide all official written convention materials as soon as they are available, so that the visually impaired individual may have them converted to audio tape, Braille, or large print format, prior to the convention.",
	"repealed": false
}