{
	"id": "518A.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.67",
	"title": "518A.67 MOTOR VEHICLE LIEN.",
	"text": "(a) Upon motion of an obligee, if a court finds that the obligor is a debtor for a judgment debt resulting from nonpayment of court-ordered child support or maintenance payments, or both, in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments, the court shall order the commissioner of public safety to enter a lien in the name of the obligee or in the name of the state of Minnesota, as appropriate, in accordance with section 168A.05, subdivision 8, unless the court finds that the obligor is in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority. The court's order must be stayed for 90 days in order to allow the obligor to execute a written payment agreement pursuant to section 518A.69, which shall be approved by either the court or the public authority responsible for child support enforcement. If the obligor has not executed or is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority within the 90-day period, the court's order becomes effective and the commissioner of public safety shall record the lien on any motor vehicle certificate of title subsequently issued in the name of the obligor. The remedy under this section is in addition to any other enforcement remedy available to the court.\n(b) If a public authority responsible for child support enforcement determines that the obligor is a debtor for judgment debt resulting from nonpayment of court-ordered child support or maintenance payments, or both, in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments, the public authority shall direct the commissioner of public safety to enter a lien in the name of the obligee or in the name of the state of Minnesota, as appropriate, under section 168A.05, subdivision 8, on any motor vehicle certificate of title subsequently issued in the name of the obligor unless the public authority determines that the obligor is in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority. The remedy under this section is in addition to any other enforcement remedy available to the public agency.\n(c) At least 90 days prior to notifying the commissioner of public safety pursuant to paragraph (b), the public authority must mail a written notice to the obligor at the obligor's last known address, that it intends to record a lien on any motor vehicle certificate of title subsequently issued in the name of the obligor and that the obligor must request a hearing within 30 days in order to contest the action. If the obligor makes a written request for a hearing within 30 days of the date of the notice, a court hearing must be held. Notwithstanding any law to the contrary, the obligor must be served with 14 days' notice in writing specifying the time and place of the hearing and the allegations against the obligor. The notice may be served personally or by mail. If the public authority does not receive a request for a hearing within 30 days of the date of the notice and the obligor does not execute or is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the public authority within 90 days of the date of the notice, the public authority shall direct the commissioner of public safety to record the lien under paragraph (b).\n(d) At a hearing requested by the obligor under paragraph (c), and on finding that the obligor is in arrears in court-ordered child support or maintenance payments or both in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments, the district court or child support magistrate shall order the commissioner of public safety to record the lien unless the court or child support magistrate determines that the obligor has executed and is in compliance with a written payment agreement pursuant to section 518A.69 that is determined to be acceptable by the court, a child support magistrate, or the public authority.\n(e) An obligor may provide proof to the court or the public authority responsible for child support enforcement that the obligor is in compliance with all written payment agreements pursuant to section 518A.69 or that the value of the motor vehicle is less than the exemption provided under section 550.37. Within 15 days of the receipt of that proof, the court or public authority shall either execute a release of security interest under section 168A.20, subdivision 4, and mail or deliver the release to the owner or other authorized person or shall direct the commissioner of public safety not to enter a lien on any motor vehicle certificate of title subsequently issued in the name of the obligor in instances where a lien has not yet been entered.\n(f) Any lien recorded against a motor vehicle certificate of title under this section and section 168A.05, subdivision 8, attaches only to the nonexempt value of the motor vehicle as determined in accordance with section 550.37. The value of a motor vehicle must be determined in accordance with the retail value described in the N.A.D.A. Official Used Car Guide, Midwest Edition, for the current year, or in accordance with the purchase price as defined in section 297B.01, subdivision 14.",
	"repealed": false
}