{
	"id": "484.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.87",
	"title": "484.87 PLEADING, PRACTICE, PROCEDURE, AND FORMS IN CRIMINAL PROCEEDINGS.",
	"text": "In any prosecution brought in a district court in which conviction of the defendant for the offense charged could result in imprisonment, the defendant has the right to a jury trial.\nIn the counties of Hennepin and Ramsey, except as otherwise provided in this subdivision and section 388.051, subdivision 2, the attorney of the municipality in which the violation is alleged to have occurred has charge of the prosecution of all violations of the state laws, including violations which are gross misdemeanors, and municipal charter provisions, ordinances, rules, and regulations triable in the district court, and shall prepare complaints for the violations. The county attorney has charge of the prosecution of a violation triable in district court and shall prepare a complaint for the violation:\n(1) if the county attorney is specifically designated by law as the prosecutor for the particular violation charged; or\n(2) if the alleged violation is of state law and is alleged to have occurred in a municipality or other subdivision of government whose population according to the most recent federal decennial census is less than 2,500 and whose governing body, or the town board in the case of a town, has accepted this clause by majority vote, and if the defendant is cited or arrested by a member of the staff of the sheriff of Hennepin County or by a member of the State Patrol.\nClause (2) shall not apply to a municipality or other subdivision of government whose population according to the most recent federal decennial census is 2,500 or more, regardless of whether or not it has previously accepted clause (2).\nExcept as provided in subdivision 2 and as otherwise provided by law, violations of state law that are petty misdemeanors or misdemeanors must be prosecuted by the attorney of the statutory or home rule charter city where the violation is alleged to have occurred, if the city has a population greater than 600. If a city has a population of 600 or less, it may, by resolution of the city council, and with the approval of the board of county commissioners, give the duty to the county attorney. In cities of the first, second, and third class, gross misdemeanor violations of sections 609.52, 609.535, 609.595, 609.631, and 609.821 must be prosecuted by the attorney of the city where the violation is alleged to have occurred. The statutory or home rule charter city may enter into an agreement with the county board and the county attorney to provide prosecution services for any criminal offense. All other petty misdemeanors, misdemeanors, and gross misdemeanors must be prosecuted by the county attorney of the county in which the alleged violation occurred. All violations of a municipal ordinance, charter provision, rule, or regulation must be prosecuted by the attorney for the governmental unit that promulgated the municipal ordinance, charter provision, rule, or regulation, regardless of its population, or by the county attorney with whom it has contracted to prosecute these matters.\nIn the counties of Anoka, Carver, Dakota, Scott, and Washington, violations of state law that are petty misdemeanors, misdemeanors, or gross misdemeanors except as provided in section 388.051, subdivision 2, must be prosecuted by the attorney of the statutory or home rule charter city where the violation is alleged to have occurred. The statutory or home rule charter city may enter into an agreement with the county board and the county attorney to provide prosecution services for any criminal offense. All other petty misdemeanors, misdemeanors, or gross misdemeanors must be prosecuted by the county attorney of the county in which the alleged violation occurred. All violations of a municipal ordinance, charter provision, rule, or regulation must be prosecuted by the attorney for the governmental unit that promulgated the municipal ordinance, charter provision, rule, or regulation or by the county attorney with whom it has contracted to prosecute these matters.\nIn an action or proceeding charging a violation of an ordinance of any subdivision of government in Hennepin County, if such ordinance is the same or substantially the same as a state law, the provisions of section 611.02 shall apply.\nAn attorney for a statutory or home rule charter city in the metropolitan area, as defined in section 473.121, subdivision 2, may request, and the attorney general may provide, assistance in prosecuting nonfelony violations of section 609.66, subdivision 1; 609.666; 624.713, subdivision 2; 624.7131, subdivision 11; 624.7132, subdivision 15; 624.714, subdivision 1a or 10; 624.7162, subdivision 3; or 624.7181, subdivision 2.",
	"repealed": false
}