{
	"id": "68A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/68A.03",
	"title": "68A.03 RESERVES.",
	"text": "After January 1, 2001, the financial condition of an insurer doing business under this chapter must be determined by applying the general provisions of the insurance code requiring the establishment of reserves sufficient to cover all known and unknown liabilities including allocated and unallocated loss adjustment expense, except that a title insurer shall also establish and maintain the reserves required by this section.\nA title insurer shall establish and maintain a known claim reserve in an amount estimated to be sufficient to cover all unpaid losses, claims, and allocated loss adjustment expenses arising under title insurance policies, guaranteed certificates of title, guaranteed searches, and guaranteed abstracts of title and all unpaid losses, claims, and allocated loss adjustment expenses for which the title insurer may be liable, and for which the insurer has received notice by or on behalf of the insured, holder of a guarantee, or escrow or security depositor.\n(a) A title insurer shall establish and maintain a statutory premium reserve consisting of:\n(1) the amount of statutory premium reserve required by the laws of the domiciliary state of the insurer if the insurer is a foreign or non-U.S. title insurer; or\n(2) if the insurer is a domestic title insurer of this state, a statutory or unearned premium reserve consisting of:\n(i) the amount of the statutory or unearned premium or reinsurance reserve legally held on January 1, 2004, which balance must be released according to the law in effect at the time the sums were added to the reserve, all as set forth in section 68A.02; and\n(ii) after January 1, 2004, and until December 31, 2009, a sum equal to a minimum of eight percent of the total of subitems (A) and (B). After January 1, 2010, a sum equal to a minimum of 6.5 percent of the total of subitems (A) and (B):\n(A) direct risk premiums written; and\n(B) premiums for reinsurance assumed, plus other income, less premiums for reinsurance ceded as set forth in schedule P of the title insurer's most recent annual statement filed with the commissioner.\n(b) The aggregate of the amounts set aside in this reserve in any calendar year pursuant to paragraph (a), clause (2), item (ii), must be released from the reserve and restored to net profits over a period of 20 years at an amortization rate not to exceed the following formula: 35 percent of the aggregate sum on July 1 of the year next succeeding the year of addition; 15 percent of the aggregate sum on July 1 of each of the succeeding two years; ten percent of the aggregate sum on July 1 of the next succeeding year; three percent of the aggregate sum on July 1 of each of the next three succeeding years; two percent of the aggregate sum on July 1 of each of the next three succeeding years; and one percent of the aggregate sum on July 1 of each of the next succeeding ten years.\n(c) The insurer shall calculate an adjusted statutory or unearned premium reserve as of the year of first application of paragraph (a), clause (2), item (ii). The adjusted reserve must be calculated as if paragraph (a), clause (2), item (ii), had been in effect for all years beginning 20 years before the year of first application of paragraph (a), clause (2), item (ii). For purposes of this calculation, the balance of the reserve as of that date is considered to be zero. If the adjusted reserve so calculated exceeds the aggregate amount set aside for statutory or unearned premiums in the insurer's most recent annual statement filed with the commissioner, the insurer shall, out of total charges for policies of title insurance, increase its statutory or unearned premium reserve by an amount equal to one-sixth of that excess in each of the succeeding six years, beginning with the calendar year that includes the year of first application of paragraph (a), clause (2), item (ii), until the entire excess has been added.\n(d) The aggregate of the amounts set aside in this reserve in any calendar year as adjustments to the insurer's statutory or unearned premium reserve pursuant to paragraph (c) must be released from the reserve and restored to net profits, or equity if the additions required by paragraph (c) reduced equity directly, over a period not exceeding ten years pursuant to the following table:\n*The calendar year following the year of first application of paragraphs (a), clause (2), item (ii), (b), and (c).\n(e) A supplemental reserve must be established consisting of any other reserves necessary, when taken in combination with the reserves required by this section and section 68A.02, to cover the company's liabilities with respect to all losses, claims, and loss adjusted expenses.\n(f) Each title insurer subject to the provisions of this chapter shall file with its annual statement, required under section 60A.13, subdivision 1, a certification by a member in good standing of the American Academy of Actuaries. The actuarial certification required of a title insurer must conform to the National Association of Insurance Commissioners' annual statement instructions for title insurers.",
	"repealed": false
}