{
	"id": "327.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.30",
	"title": "327.30 SACRED COMMUNITIES AND MICRO-UNIT DWELLINGS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Chronically homeless\" means an individual who:\n(1) is homeless and lives or resides in a place not meant for human habitation, a safe haven, or in an emergency shelter;\n(2) has been homeless and living or residing in a place not meant for human habitation, a safe haven, or in an emergency shelter continuously for at least one year or on at least four separate occasions in the last three years; and\n(3) has an adult head of household, or a minor head-of-household if no adult is present in the household, with a diagnosable substance use disorder, serious mental illness, developmental disability, post-traumatic stress disorder, cognitive impairments resulting from a brain injury, or chronic physical illness or disability, including the co-occurrence of two or more of those conditions.\n(c) \"Designated volunteers\" means persons who have not experienced homelessness and have been approved by the religious institution to live in a sacred community as their sole form of housing.\n(d) \"Extremely low income\" means an income that is equal to or less than 30 percent of the area median income, adjusted for family size, as estimated by the Department of Housing and Urban Development.\n(e) \"Micro unit\" means a mobile residential dwelling providing permanent housing within a sacred community that meets the requirements of subdivision 4.\n(f) \"Religious institution\" means a church, synagogue, mosque, or other religious organization organized under chapter 315.\n(g) \"Sacred community\" means a residential settlement established on or contiguous to the grounds of a religious institution's primary worship location primarily for the purpose of providing permanent housing for chronically homeless persons, extremely low-income persons, and designated volunteers that meets the requirements of subdivision 3.\nReligious institutions are authorized to provide permanent housing to people who are chronically homeless, extremely low-income, or designated volunteers, in sacred communities composed of micro units subject to the provisions of this section. Each religious institution that has sited a sacred community must annually certify to the local unit of government that it has complied with the eligibility requirements for residents of a sacred community in this section.\n(a) A sacred community must provide residents of micro units access to water and electric utilities either by connecting the micro units to the utilities that are serving the principal building on the lot or by other comparable means, or by providing the residents access to permanent common kitchen facilities and common facilities for toilet, bathing, and laundry with the number and type of fixtures required for an R-2 boarding house under Minnesota Rules, part 1305.2902. Any units that are plumbed shall not be included in determining the minimum number of fixtures required for the common facilities.\n(b) A sacred community under this section must:\n(1) be appropriately insured;\n(2) have between one-third and 40 percent of the micro units occupied by designated volunteers; and\n(3) provide the municipality with a written plan approved by the religious institution's governing board that outlines:\n(i) disposal of water and sewage from micro units if not plumbed;\n(ii) septic tank drainage if plumbed units are not hooked up to the primary worship location's system;\n(iii) adequate parking, lighting, and access to units by emergency vehicles;\n(iv) protocols for security and addressing conduct within the settlement; and\n(v) safety protocols for severe weather.\n(c) Unless the municipality has designated sacred communities meeting the requirements of this section as permitted uses, a sacred community meeting the requirements of this section shall be approved and regulated as a conditional use without the application of additional standards not included in this section. When approved, additional permitting is not required for individual micro units.\n(d) Sacred communities are subject to the laws governing landlords and tenants under chapter 504B.\n(a) In order to be eligible to be placed within a sacred community, a micro unit must be built to the requirements of the American National Standards Institute (ANSI) Code 119.5, which includes standards for heating, electrical systems, and fire and life safety. A micro unit must also meet the following technical requirements:\n(1) be no more than 400 gross square feet;\n(2) be built on a permanent chassis and anchored to pin foundations with engineered fasteners;\n(3) have exterior materials that are compatible in composition, appearance, and durability to the exterior materials used in standard residential construction;\n(4) have a minimum insulation rating of R-20 in walls, R-30 in floors, and R-38 in ceilings, as well as residential grade insulated doors and windows;\n(5) have a dry, compostable, or plumbed toilet or other system meeting the requirements of the Minnesota Pollution Control Agency, Chapters 7035, 7040, 7049, and 7080, or other applicable rules;\n(6) have either an electrical system that meets NFPA 70 NEC, section 551 or 552 as applicable or a low voltage electrical system that meets ANSI/RVIA Low Voltage Standard, current edition;\n(7) have minimum wall framing with two inch by four inch wood or metal studs with framing of 16 inches to 24 inches on center, or the equivalent in structural insulated panels, with a floor load of 40 pounds per square foot and a roof live load of 42 pounds per square foot; and\n(8) have smoke and carbon monoxide detectors installed.\n(b) All micro units, including their anchoring, must be inspected and certified for compliance with these requirements by a licensed Minnesota professional engineer or qualified third-party inspector for ANSI compliance accredited pursuant to either the American Society for Testing and Materials Appendix E541 or ISO/IEC 17020.\n(c) Micro units that connect to utilities such as water, sewer, gas, or electric, must obtain any permits or inspections required by the municipality or utility company for that connection.\n(d) Micro units must comply with municipal setback requirements established by ordinance for manufactured homes. If a municipality does not have such an ordinance, micro units must be set back on all sides by at least ten feet.",
	"repealed": false
}