{
	"id": "402A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/402A.18",
	"title": "402A.18 COMMISSIONER POWER TO REMEDY FAILURE TO MEET PERFORMANCE OUTCOMES.",
	"text": "If the commissioner determines that a county or service delivery authority is deficient in achieving minimum performance thresholds for a specific essential human services program, the commissioner may impose the following remedies and adjust state and federal program allocations accordingly:\n(1) voluntary incorporation of the administration and operation of the specific essential human services program with an existing service delivery authority or another county. A service delivery authority or county incorporating an underperforming county shall not be financially liable for the costs associated with remedying performance outcome deficiencies;\n(2) mandatory incorporation of the administration and operation of the specific essential human services program with an existing service delivery authority or another county. A service delivery authority or county incorporating an underperforming county shall not be financially liable for the costs associated with remedying performance outcome deficiencies; or\n(3) transfer of authority for program administration and operation of the specific essential human services program to the commissioner.\nIf the commissioner determines that a county or service delivery authority is deficient in achieving minimum performance thresholds for more than one-half of the defined essential human services programs, the commissioner may impose the following remedies:\n(1) voluntary incorporation of the administration and operation of essential human services programs with an existing service delivery authority or another county. A service delivery authority or county incorporating an underperforming county shall not be financially liable for the costs associated with remedying performance outcome deficiencies;\n(2) mandatory incorporation of the administration and operation of essential human services programs with an existing service delivery authority or another county. A service delivery authority or county incorporating an underperforming county shall not be financially liable for the costs associated with remedying performance outcome deficiencies; or\n(3) transfer of authority for administration and operation of essential human services programs to the commissioner.\nA county subject to remedies under subdivision 1 or 2 shall provide to the entity assuming administration of the essential human services program or programs the amount of nonfederal and nonstate funding needed to remedy performance outcome deficiencies.\n(a) The commissioner shall notify a county or service delivery authority that it must submit a performance improvement plan if:\n(1) the county or service delivery authority does not meet the minimum performance threshold for a measure; or\n(2) the county or service delivery authority has a performance disparity for a racial or ethnic subgroup, even if the county or service delivery authority met the threshold for the overall population. The council shall make recommendations on performance disparities, and the commissioner shall make the final determination.\n(b) When the department determines that a county or service delivery authority does not meet the minimum performance threshold for a given measure, the commissioner must advise the county or service delivery authority that fiscal penalties may result if the performance does not improve. The department must offer technical assistance to the county or service delivery authority. Within 30 days of the initial advisement from the department, the county or service delivery authority may claim and the department may approve an extenuating circumstance that relieves the county or service delivery authority of any further remedy. If a county or service delivery authority has a small number of participants in an essential human services program such that reliable measurement is not possible, the commissioner may approve extenuating circumstances.\n(c) If there are no extenuating circumstances, the county or service delivery authority must submit a performance improvement plan to the commissioner within 60 days of the initial advisement from the department. The term of the performance improvement plan must be two years, starting with the date the plan is approved by the commissioner. This plan must include a target level for improvement for each measure that did not meet the minimum performance threshold. The commissioner must approve the performance improvement plan within 60 days of submittal.\n(d) The department must monitor the performance improvement plan for two years. After two years, if the county or service delivery authority meets the minimum performance threshold, there is no further remedy. If the county or service delivery authority fails to meet the minimum performance threshold, but meets the improvement target in the performance improvement plan, the county or service delivery authority shall modify the performance improvement plan for further improvement and the department shall continue to monitor the plan.\n(e) If, after two years of monitoring, the county or service delivery authority fails to meet both the minimum performance threshold and the improvement target identified in the performance improvement plan, the next step of the remedies process shall be invoked by the commissioner. This phase of the remedies process may include:\n(1) fiscal penalties for the county or service delivery authority that do not exceed one percent of the county's human services expenditures and that are negotiated in the performance improvement plan, based on what is needed to improve outcomes. Counties or service delivery authorities must reinvest the amount of the fiscal penalty into the essential human services program that was underperforming. A county or service delivery authority shall not be required to pay more than three fiscal penalties in a year; and\n(2) the department's provision of technical assistance to the county or service delivery authority that is targeted to address the specific performance issues.\nThe commissioner shall continue monitoring the performance improvement plan for a third year.\n(f) If, after the third year of monitoring, the county or service delivery authority meets the minimum performance threshold, there is no further remedy. If the county or service delivery authority fails to meet the minimum performance threshold, but meets the improvement target for the performance improvement plan, the county or service delivery authority shall modify the performance improvement plan for further improvement and the department shall continue to monitor the plan.\n(g) If, after the third year of monitoring, the county or service delivery authority fails to meet the minimum performance threshold and the improvement target identified in the performance improvement plan, the Human Services Performance Council shall review the situation and recommend a course of action to the commissioner.\n(h) If the commissioner has determined that a program has a balanced set of program measures and a county or service delivery authority is subject to fiscal penalties for more than one-half of the measures for that program, the commissioner may apply further remedies as described in subdivisions 1 and 2.",
	"repealed": false
}