{
	"id": "160.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.85",
	"title": "160.85 AUTHORITY FOR TOLL FACILITY.",
	"text": "A road authority may solicit or accept proposals from and enter into development agreements with private operators for developing, financing, designing, constructing, improving, rehabilitating, owning, and operating toll facilities wholly or partly within the road authority's jurisdiction. If a road authority solicits toll facility proposals, it must publish a notice of solicitation in the State Register.\nPrivate operators are authorized to develop, finance, design, construct, improve, rehabilitate, own, and operate toll facilities subject to the terms of sections 160.84 to 160.92. Private operators may mortgage, grant security interests in, and pledge their interests in: (1) toll facilities and their components; (2) development, lease, management, toll concessions, and other related agreements; and (3) income, profits, and proceeds of the toll facility.\nNo road authority and private operator may execute a development agreement without the approval of the final agreement by the commissioner. A road authority and private operator in the metropolitan area must obtain the approvals required in sections 161.162 to 161.167 and 473.166. Except as otherwise provided in sections 161.162 to 161.167, the governing body of a county or municipality through which a facility passes may veto the project within 30 days of approval by the commissioner.\nBefore approving or denying a development agreement, the commissioner shall hold a public information meeting in any municipality or county in which any portion of the proposed toll facility runs. The commissioner shall determine the time and place of the information meeting.\n(a) A development agreement for toll facilities may provide for any mode of ownership or operation approved by the road authority, including ownership by the private operator with or without reversion of title, operation of the facilities under leases or management contracts, toll concessions, or BOT or BTO facilities.\n(b) A development agreement may permit the private operator to assemble funds from any available source and to incorporate an existing road or highway, bridge, and approach structures, and related improvements, into the toll facility. The agreement must provide the terms and conditions of the incorporation.\n(c) A development agreement may include grants of title, easements, rights-of-way, and leasehold estates necessary to the toll facility.\n(d) A development agreement may authorize the private operator to charge variable rate tolls based on time of day, vehicle characteristics, or other factors approved by the road authority.\n(e) A development agreement may provide for maintenance, snow removal, and police standards that exceed the standards of the road authority for facilities of the same functional classification.\n(f) A development agreement may include authorization by the road authority to the private operator to exercise powers possessed by the road authority for similar facilities.\nA private operator may acquire right-of-way by donation, lease, or purchase. A road authority may acquire right-of-way by eminent domain and may donate, sell, or lease a right-of-way to a private operator.\nNo toll facility may be used for any purpose other than the purposes specified in the development agreement for the term of the agreement.\nA development agreement that requires transfer or reversion of a toll facility to a road authority must provide the terms and conditions of the transfer or reversion. The facility shall meet at least the maintenance standards of the road authority for facilities of the same functional classification during the term of the agreement.\nA private operator must have environmental, navigational, design, or safety approvals as if the toll facility were constructed or operated by a road authority.",
	"repealed": false
}