{
	"id": "58A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/58A.02",
	"title": "58A.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the definitions in subdivisions 2 to 15 have the meanings given them.\n\"Depository institution\" has the meaning given in United States Code, title 12, section 1813, and includes a credit union.\n\"Federal banking agencies\" means the Board of Governors of the Federal Reserve System, the comptroller of the currency, the director of the Office of Thrift Supervision, the National Credit Union Administration, and the Federal Deposit Insurance Corporation.\n\"Immediate family member\" means a spouse, child, sibling, a parent, grandparent, or grandchild. This includes stepparents, stepchildren, stepsiblings, and adoptive relationships.\n\"Individual\" means a natural person.\n\"Loan processor or underwriter\" means an individual who performs clerical or support duties as an employee at the direction of and subject to the supervision and instruction of a person licensed or exempt from licensing under chapter 58. For purposes of this subdivision, the term \"clerical or support duties\" may include after the receipt of an application:\n(1) the receipt, collection, distribution, and analysis of information common for the processing or underwriting of a residential mortgage loan; and\n(2) communicating with a consumer to obtain the information necessary for the processing or underwriting of a loan, to the extent that the communication does not include offering or negotiating loan rates or terms, or counseling consumers about residential mortgage loan rates or terms.\n\"Mortgage loan originator\":\n(1) means an individual who for compensation or gain or in the expectation of compensation or gain:\n(i) takes a residential mortgage loan application; or\n(ii) offers or negotiates terms of a residential mortgage loan;\n(2) does not include an individual engaged solely as a loan processor or underwriter except as otherwise provided in section 58A.03, subdivision 3;\n(3) does not include a person or entity that only performs real estate brokerage activities and is licensed or registered according to Minnesota law, unless the person or entity is compensated by a lender, a mortgage broker, or other mortgage loan originator or by an agent of the lender, mortgage broker, or other mortgage loan originator;\n(4) does not include a person or entity solely involved in extensions of credit relating to timeshare plans, as that term is defined in United States Code, title 11, section 101(53D); and\n(5) does not include a person who merely assists, without advising, the consumer in locating or understanding a loan application, and does not do anything that would be considered to be acting as a mortgage loan originator under federal or state laws. This clause is subject to final approval by the United States Department of Housing and Urban Development, and is severable to the extent that the department determines that it is not compliant with federal law.\n\"Nationwide Multistate Licensing System and Registry\" means a mortgage licensing system developed and maintained by the Conference of State Bank Supervisors and the American Association of Residential Mortgage Regulators for the licensing and registration of licensed mortgage loan originators.\n\"Nontraditional mortgage product\" means a mortgage product other than a 30-year fixed rate mortgage loan.\n\"Offers or negotiates terms of a residential mortgage loan for compensation or gain\" means an individual:\n(1)(i) presents for acceptance by a borrower or prospective borrower residential mortgage loan terms;\n(ii) communicates directly or indirectly with a borrower or prospective borrower for the purpose of reaching an understanding about prospective residential mortgage loan terms; or\n(iii) recommends, refers, or steers a borrower to a particular lender or set of residential mortgage loan terms, in accordance with a duty to or incentive from any person other than the borrower or prospective borrower; and\n(2) receives or expects to receive payment of money or anything of value in connection with the activities described in clause (1) or as a result of any residential mortgage loan terms entered into as a result of such activities.\nThis subdivision is subject to final approval by the United States Department of Housing and Urban Development, and is severable to the extent that the department determines that it is not compliant with federal law.\n\"Person\" means a natural person, corporation, company, limited liability company, partnership, or association.\n\"Real estate brokerage activity\" means an activity that involves offering or providing real estate brokerage services to the public, including:\n(1) acting as a real estate agent or real estate broker for a buyer, seller, lessor, or lessee of real property;\n(2) bringing together parties interested in the sale, purchase, lease, rental, or exchange of real property;\n(3) negotiating, on behalf of a party, a portion of a contract relating to the sale, purchase, lease, rental, or exchange of real property other than in connection with providing financing with respect to the transaction;\n(4) engaging in an activity for which a person engaged in the activity is required to be registered or licensed as a real estate agent or real estate broker under any applicable law; and\n(5) offering to engage in any activity, or act in any capacity, described in clause (1), (2), (3), or (4).\n\"Registered mortgage loan originator\" means an individual who:\n(1) meets the definition of mortgage loan originator and is an employee of:\n(i) a depository institution;\n(ii) a subsidiary that is owned and controlled by a depository institution and regulated by a federal banking agency; or\n(iii) an institution regulated by the Farm Credit Administration; and\n(2) is registered with, and maintains a unique identifier through, the Nationwide Multistate Licensing System and Registry.\n\"Residential mortgage loan\" means a loan primarily for personal, family, or household use that is secured by a mortgage, deed of trust, or other equivalent consensual security interest on a dwelling, as defined in United States Code, title 15, section 1602(w), or residential real estate upon which a dwelling is constructed or intended to be constructed.\n\"Residential real estate\" means real property located in Minnesota, upon which a dwelling is constructed or is intended to be constructed.\n\"Takes a residential mortgage loan application\" means the individual receives a residential mortgage loan application for the purpose of deciding, or influencing or soliciting the decision of another, whether to extend an offer of residential mortgage loan terms to a borrower or prospective borrower, or to accept the terms offered by a borrower or prospective borrower in response to a solicitation, whether the application is received directly or indirectly from the borrower or prospective borrower. This subdivision is subject to final approval by the United States Department of Housing and Urban Development, and is severable to the extent that the department determines that it is not compliant with federal law.\n\"Unique identifier\" means a number or other identifier assigned by protocols established by the Nationwide Multistate Licensing System and Registry.",
	"repealed": false
}