{
	"id": "462A.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.39",
	"title": "462A.39 WORKFORCE HOUSING DEVELOPMENT PROGRAM.",
	"text": "The commissioner of Minnesota housing finance shall establish a workforce housing development program to award grants or deferred loans to eligible project areas to be used for qualified expenditures. Grants or deferred loans authorized under this section may be made without limitations relating to the maximum incomes of the renters.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Eligible project area\" means a home rule charter or statutory city located outside of a metropolitan county as defined in section 473.121, subdivision 4; federally recognized Tribal reservations; or an area served by a joint county-city economic development authority.\n(c) \"Joint county-city economic development authority\" means an economic development authority formed under Laws 1988, chapter 516, section 1, as a joint partnership between a city and county and excluding those established by the county only.\n(d) \"Market rate residential rental properties\" means properties that are rented at market value, including new modular homes, new manufactured homes, and new manufactured homes on leased land or in a manufactured home park, and may include rental developments that have a portion of income-restricted units.\n(e) \"Qualified expenditure\" means expenditures for market rate residential rental properties including acquisition of property; construction of improvements; and provisions of loans or subsidies, grants, interest rate subsidies, public infrastructure, and related financing costs.\nThe commissioner shall develop forms and procedures for soliciting and reviewing application for grants or deferred loans under this section. At a minimum, a city must include in its application a resolution of its governing body certifying that the matching amount as required under this section is available and committed.\n(a) The commissioner must not award a grant or deferred loans to an eligible project area under this section until the following determinations are made:\n(1) the average vacancy rate for rental housing located in the eligible project area, and in any other city located within 15 miles or less of the boundaries of the area, has been five percent or less for at least the prior two-year period;\n(2) one or more businesses located in the eligible project area, or within 25 miles of the area, that employs a minimum of 20 full-time equivalent employees in aggregate have provided a written statement to the eligible project area indicating that the lack of available rental housing has impeded their ability to recruit and hire employees; and\n(3) the eligible project area has certified that the grants or deferred loans will be used for qualified expenditures for the development of rental housing to serve employees of businesses located in the eligible project area or surrounding area.\n(b) Preference for grants or deferred loans awarded under this section shall be given to eligible project areas with less than 30,000 people.\n(c) Among comparable proposals, preference must be given to projects with a higher proportion of units that are not income-restricted.\nThe amount of a grant or deferred loans may not exceed 50 percent of the rental housing development project cost. The commissioner shall not award a grant or deferred loans to an eligible project area without certification by the eligible project area that the amount of the grant or deferred loans shall be matched by a local unit of government, business, nonprofit organization, or federally recognized Tribe, with $1 for every $2 provided in grant or deferred loans funds.\nBeginning January 15, 2018, the commissioner must annually submit a report to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over taxes and workforce development specifying the projects that received grants or deferred loans under this section and the specific purposes for which the grant funds were used.",
	"repealed": false
}