{
	"id": "60A.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.161",
	"title": "60A.161 INSURER DOMESTICATION AND CONVERSION.",
	"text": "Any insurer that is organized under the laws of any other state and is admitted to do business in this state for the purpose of writing insurance may become a domestic insurer of this state by complying with all of the requirements of law relative to the organization and licensing of a domestic insurer of the same type and by designating its principal place of business at a place in this state. The domestic insurer will be entitled to like certificates and licenses to transact business in this state and is subject to the authority and jurisdiction of this state.\nA domestic insurer of this state may, upon the approval of the commissioner, transfer its domicile to any other state in which it is admitted to transact the business of insurance, and upon the transfer shall cease to be a domestic insurer and shall be admitted to this state if qualified as a foreign insurer. The commissioner shall approve any proposed transfer unless the commissioner determines that the transfer is not in the interest of the policyholders of this state.\nThe certificate of authority, agents appointments and licenses, rates, policy forms, and other items which the commissioner of commerce allows, in the commissioner's discretion, which are in existence at the time any insurer licensed to transact the business of insurance in this state transfers its corporate domicile to this or any other state by redomestication, merger, consolidation, or any other lawful method shall continue in full force and effect upon such transfer if such insurer remains duly qualified to transact the business of insurance in this state. All outstanding policies of any transferring insurer remain in full force and effect and need not be endorsed as to the new name of the company or its new location unless so ordered by the commissioner. However, every transferring insurer shall notify the commissioner of the details of the proposed transfer and shall file promptly resulting amendments to corporate documents filed or required to be filed with the commissioner.\nThe commissioner of commerce may adopt rules to carry out the purposes of this section.",
	"repealed": false
}