{
	"id": "61A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.14",
	"title": "61A.14 COMPANIES ENTITLED TO ISSUE CONTRACTS; ACCOUNTS; INVESTMENTS.",
	"text": "Any domestic life insurance company may, by or pursuant to resolution of its governing body, establish and operate one or more separate accounts and issue contracts on a variable basis, subject to the provisions of sections 61A.13 to 61A.21.\nExcept as may be otherwise specifically provided by the contract concerned, all amounts received by a life insurance company in connection with any contract on a variable basis shall be allocated to the appropriate separate account. The income, if any, and gains or losses, realized or unrealized on each such account may be credited to or charged against the amount allocated to such account in accordance with such contract, without regard to the other income, gains, or losses of the company.\nExcept as hereinafter provided, amounts allocated to any separate account and accumulations thereon may be invested and reinvested without regard to any requirements or limitations prescribed by the laws of this state governing the investments of life insurance companies; provided, that to the extent that the company's reserve liability with regard to (a) benefits guaranteed as to amount and duration, and (b) funds guaranteed as to principal amount or stated rate of interest is maintained in any separate account, a portion of the assets of such separate account at least equal to such reserve liability shall be, except as the commissioner may otherwise approve, invested in accordance with the laws of this state governing the investments of life insurance companies and shall be segregated from the other assets in the separate account.\nFor purposes of determining whether the capital, surplus and other funds of a domestic life insurance company, other than assets held in a separate account pursuant to this section, are invested in accordance with sections 61A.28 to 61A.31, and 60L.01 to 60L.15, assets held by the company in a separate account in accordance with this section shall be disregarded.\nThe assets held in a separate account pursuant to this section shall be owned by the company, and the company shall not be, nor hold itself out to be, a trustee with respect to such amounts. If and to the extent so provided under the applicable contracts or as required pursuant to the Federal Investment Company Act of 1940 that portion of the assets of any such separate account equal to reserves and other contract liabilities with respect to such account shall not be chargeable with liabilities arising out of any other business the company may conduct, but shall be held and applied exclusively for the benefit of the holders of those contracts on a variable basis for which the separate account has been established, provided, however, that the assets shall always be at least equal to the reserves and other contract liabilities with respect to such account.\nTo the extent such company deems it necessary to comply with any applicable federal or state laws, such company, with respect to any separate account, including without limitation any separate account which is a management investment company or a unit investment trust, may provide for persons having an interest therein appropriate voting and other rights and special procedures for the conduct of the business of such account, including without limitation special rights and procedures relating to investment policy, investment advisory services, selection of independent public accountants, and the selection of a committee, the members of which need not be otherwise affiliated with such company, to manage the business of such account.\nUnless otherwise approved by the commissioner, assets allocated to a separate account shall be valued at their market value on the date of valuation, or if there is no readily available market, then as provided under the terms of the contract or the rules or other written agreement applicable to such separate account; provided, that unless otherwise approved by the commissioner, a portion of the assets of such separate account equal to the company's reserve liability with regard to the guaranteed benefits and funds referred to in clauses (a) and (b) of subdivision 3, if any, shall be valued in accordance with the rules otherwise applicable to the company's assets.\nNo sale, exchange or other transfer of assets may be made by a company between any of its separate accounts or between any other investment account and one or more of its separate accounts unless, (a) in case of a transfer into a separate account, such transfer is made solely to establish the account or to support the contractual obligations of the company with respect to the separate account to which the transfer is made, or (b) in case of a transfer from a separate account, such transfer would not cause the remaining assets of the account to become less than the reserves and other contract liabilities with respect to such separate account. Such transfer, whether into or from a separate account, shall be made by a transfer of cash, or by a transfer of securities having a readily determinable market value, provided that such transfer of securities is approved by the commissioner. The commissioner may approve other transfers among such accounts if, in the commissioner's opinion, such transfers would not be inequitable. Where a company transfers assets into a separate account for the purpose of establishing such account, such transfer shall be in the form of cash and, except as the commissioner may otherwise approve, shall be made only from its surplus, provided that not more than five percent of its surplus may be so invested in such accounts.\nA domestic life insurance company having a separate account or accounts pursuant to this section in connection with variable contracts or other separate account products may indemnify a person who is serving or has served as a member of the managing committee of that separate account, and may purchase and maintain insurance for that purpose, in accordance with section 302A.521.",
	"repealed": false
}