{
	"id": "518.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.091",
	"title": "518.091 SUMMONS; TEMPORARY RESTRAINING PROVISIONS; NOTICE REGARDING PARENT EDUCATION PROGRAM REQUIREMENTS.",
	"text": "(a) Every summons must include the notice in this subdivision.\nNOTICE OF TEMPORARY RESTRAINING AND ALTERNATIVE DISPUTE\nRESOLUTION PROVISIONS\nUNDER MINNESOTA LAW, SERVICE OF THIS SUMMONS MAKES THE FOLLOWING REQUIREMENTS APPLY TO BOTH PARTIES TO THIS ACTION, UNLESS THEY ARE MODIFIED BY THE COURT OR THE PROCEEDING IS DISMISSED:\n(1) NEITHER PARTY MAY DISPOSE OF ANY ASSETS EXCEPT (i) FOR THE NECESSITIES OF LIFE OR FOR THE NECESSARY GENERATION OF INCOME OR PRESERVATION OF ASSETS, (ii) BY AN AGREEMENT IN WRITING, OR (iii) FOR RETAINING COUNSEL TO CARRY ON OR TO CONTEST THIS PROCEEDING;\n(2) NEITHER PARTY MAY HARASS THE OTHER PARTY; AND\n(3) ALL CURRENTLY AVAILABLE INSURANCE COVERAGE MUST BE MAINTAINED AND CONTINUED WITHOUT CHANGE IN COVERAGE OR BENEFICIARY DESIGNATION.\nIF YOU VIOLATE ANY OF THESE PROVISIONS, YOU WILL BE SUBJECT TO SANCTIONS BY THE COURT.\n(4) PARTIES TO A MARRIAGE DISSOLUTION PROCEEDING ARE ENCOURAGED TO ATTEMPT ALTERNATIVE DISPUTE RESOLUTION PURSUANT TO MINNESOTA LAW. ALTERNATIVE DISPUTE RESOLUTION INCLUDES MEDIATION, ARBITRATION, AND OTHER PROCESSES AS SET FORTH IN THE DISTRICT COURT RULES. YOU MAY CONTACT THE COURT ADMINISTRATOR ABOUT RESOURCES IN YOUR AREA. IF YOU CANNOT PAY FOR MEDIATION OR ALTERNATIVE DISPUTE RESOLUTION, IN SOME COUNTIES, ASSISTANCE MAY BE AVAILABLE TO YOU THROUGH A NONPROFIT PROVIDER OR A COURT PROGRAM. IF YOU ARE A VICTIM OF DOMESTIC ABUSE OR THREATS OF ABUSE AS DEFINED IN MINNESOTA STATUTES, CHAPTER 518B, YOU ARE NOT REQUIRED TO TRY MEDIATION AND YOU WILL NOT BE PENALIZED BY THE COURT IN LATER PROCEEDINGS.\n(b) Upon service of the summons, the restraining provisions contained in the notice apply by operation of law upon both parties until modified by further order of the court or dismissal of the proceeding, unless more than one year has passed since the last document was filed with the court.\nEvery summons involving custody or parenting time of a minor child must include the notice in this subdivision.\nNOTICE OF PARENT EDUCATION PROGRAM REQUIREMENTS\nUNDER MINNESOTA STATUTES, SECTION 518.157, IN A CONTESTED PROCEEDING INVOLVING CUSTODY OR PARENTING TIME OF A MINOR CHILD, THE PARTIES MUST BEGIN PARTICIPATION IN A PARENT EDUCATION PROGRAM THAT MEETS MINIMUM STANDARDS PROMULGATED BY THE MINNESOTA SUPREME COURT WITHIN 30 DAYS AFTER THE FIRST FILING WITH THE COURT. IN SOME DISTRICTS, PARENTING EDUCATION MAY BE REQUIRED IN ALL CUSTODY OR PARENTING PROCEEDINGS. YOU MAY CONTACT THE DISTRICT COURT ADMINISTRATOR FOR ADDITIONAL INFORMATION REGARDING THIS REQUIREMENT AND THE AVAILABILITY OF PARENT EDUCATION PROGRAMS.",
	"repealed": false
}