{
	"id": "18B.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.32",
	"title": "18B.32 STRUCTURAL PEST CONTROL LICENSE.",
	"text": "(a) A person may not engage in structural pest control applications:\n(1) for hire without a structural pest control license;\n(2) as a sole proprietorship, company, partnership, or corporation unless the person is or employs a licensed master in structural pest control operations; and\n(3) unless the person is 18 years of age or older.\n(b) A structural pest control licensee must have a valid license identification card to purchase a restricted use pesticide or apply pesticides for hire and must display it upon demand by an authorized representative of the commissioner or a law enforcement officer. The license identification card must contain information required by the commissioner.\n(a) A structural pest control license:\n(1) expires on December 31 of the year for which the license is issued;\n(2) is not transferable; and\n(3) must be prominently displayed to the public in the structural pest controller's place of business.\n(b) The commissioner shall establish categories of master, journeyman, and fumigator for a person to be licensed under a structural pest control license.\n(a) A person must apply to the commissioner for a structural pest control license on forms and in the manner required by the commissioner. The commissioner shall require the applicant to pass a written, closed-book, monitored examination or oral examination, or both. The commissioner shall establish the examination procedure, including the phases and contents of the examination.\n(b) The commissioner may license a person as a master under a structural pest control license if the person has the necessary qualifications through knowledge and experience to properly plan, determine, and supervise the selection and application of pesticides in structural pest control. To demonstrate the qualifications and become licensed as a master under a structural pest control license, a person must:\n(1) pass a closed-book test administered by the commissioner;\n(2) have direct experience as a licensed journeyman under a structural pest control license for at least two years by this state or a state with equivalent certification requirements or as a full-time licensed master in another state with equivalent certification requirements; and\n(3) show practical knowledge and field experience under clause (2) in the actual selection and application of pesticides under varying conditions.\n(c) The commissioner may license a person as a journeyman under a structural pest control license if the person:\n(1) has the necessary qualifications in the practical selection and application of pesticides;\n(2) has passed a closed-book examination given by the commissioner; and\n(3) is engaged as an employee of or is working under the direction of a person licensed as a master under a structural pest control license.\n(d) The commissioner may license a person as a fumigator under a structural pest control license if the person:\n(1) has knowledge of the practical selection and application of fumigants;\n(2) has passed a closed-book examination given by the commissioner; and\n(3) is licensed by the commissioner as a master or journeyman under a structural pest control license.\n(a) An applicator may apply to renew a structural pest control applicator license on or before the expiration of an existing license subject to reexamination, attendance at a recertification workshop approved by the commissioner, or other requirements imposed by the commissioner to provide the applicator with information regarding changing technology and to help assure a continuing level of competency and ability to use pesticides safely and properly. A recertification workshop must meet or exceed the competency standards in Code of Federal Regulations, title 40, part 171. Competency standards for a recertification workshop must be published on the Department of Agriculture website. If the commissioner requires an applicator to attend a recertification workshop and the applicator fails to attend the workshop, the commissioner may require the applicator to pass a reexamination. The commissioner may require an additional demonstration of applicator qualification if the applicator has had a license suspended or revoked or has otherwise had a history of violations of this chapter.\n(b) If an applicator fails to renew a structural pest control license within three months of its expiration, the applicator must obtain a structural pest control license subject to the requirements, procedures, and fees required for an initial license.\n(a) The commissioner may suspend or revoke a structural pest control license if an applicator fails to provide proof of financial responsibility upon the commissioner's request. Financial responsibility may be demonstrated by:\n(1) proof of net assets equal to or greater than $50,000; or\n(2) a performance bond or insurance of a kind and in an amount determined by the commissioner.\n(b) The bond or insurance must cover a period of time at least equal to the term of the applicator's license. The commissioner must immediately suspend the license of an applicator who fails to maintain the required bond or insurance. The performance bond or insurance policy must contain a provision requiring the insurance or bonding company to notify the commissioner by ten days before the effective date of cancellation, termination, or any other change of the bond or insurance. If there is recovery against the bond or insurance, additional coverage must be secured by the applicator to maintain financial responsibility equal to the original amount required.\n(c) An employee of a licensed person is not required to maintain an insurance policy or bond during the time the employer is maintaining the required insurance or bond.\n(d) Applications for reinstatement of a license suspended under the provisions of this section must be accompanied by proof of satisfaction of judgments previously rendered.\n(a) An applicant for a structural pest control license for a business must pay a nonrefundable application fee of $200. An employee of a licensed business must pay a nonrefundable application fee of $50 for an individual structural pest control license.\n(b) An application received after expiration of the structural pest control license is subject to a penalty fee of 50 percent of the application fee.\n(c) An applicant that meets renewal requirements by reexamination instead of attending workshops must pay the equivalent workshop fee for the reexamination as determined by the commissioner.",
	"repealed": false
}