{
	"id": "103E.812",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.812",
	"title": "103E.812 TRANSFER OF ALL OR PART OF DRAINAGE SYSTEM.",
	"text": "After the period originally fixed or subsequently extended to pay the assessment of the drainage lien expires, all or part of a drainage system may be transferred from the jurisdiction of the drainage authority to a water management authority as provided in this section.\n(a) For drainage systems outside of the seven-county metropolitan area, and outside of the municipal boundaries of a statutory or home rule charter city, a petition must be signed by at least 51 percent of the owners of property assessed for the construction of the drainage system, or portion of the drainage system proposed to be transferred, or by the owners of not less than 51 percent of the area of the property assessed for the drainage system, or portion of the drainage system sought to be transferred. The water management authority to which the drainage system is to be transferred must join the petition.\n(b) For drainage systems wholly or partially within the municipal boundaries of a statutory or home rule charter city, the city may petition for transfer if the drainage system or portion of the drainage system proposed to be transferred lies within the boundaries of the city. The water management authority to which the drainage system is to be transferred must join the petition.\n(c) For drainage systems within the seven-county metropolitan area and within the jurisdictional boundaries of an existing water management authority, the water management authority may petition for transfer if the drainage system or portion of the drainage system proposed to be transferred lies within the boundaries of the water management authority.\n(d) For the purpose of the petition, the county is the resident owner of all tax-forfeited property held by the state, under chapter 282, and assessed benefits for the drainage system, and the board may execute the petition for the county as an owner. This paragraph does not apply to lands acquired by the state under chapter 84A.\n(a) The petition must designate the drainage system, or portion thereof, proposed to be transferred and show that the transfer is necessary for the orderly management of storm, surface, or floodwaters, including management for water quality purposes.\n(b) The petition must indicate the impact, if any, that the transfer will have on properties utilizing the drainage system for an outlet or otherwise benefiting from the existence of the drainage system.\n(c) The petition must include an engineering report, prepared by the transferee water management authority, establishing, for the record, the nature and extent of the drainage easement occupied by the drainage system, and the as-constructed, or subsequently improved, depth, grade, and hydraulic capacity of the drainage system.\n(a) If the drainage system is administered by a county or joint county drainage authority and if all property assessed for benefits in the drainage system is in one county, the petition must be filed with the auditor unless the petition is signed by the board, in which case the petition must be made to the district court of the county where the drainage system is located and filed with the court administrator. If the board, acting as the drainage authority, is also the petitioning water management authority, the petition must be made to the district court of the county where the drainage system is located and filed with the court administrator. If property assessed for benefits is in two or more counties, the petition must be filed with the auditor or court administrator of either (1) the county where the portion of the drainage system sought to be transferred exists; (2) the county not petitioning for the transfer; or (3) the county where the majority of the drainage system sought to be transferred exists.\n(b) If the drainage system is administered by the board of managers of a watershed district, the petition must be filed with the secretary of the watershed district. If the watershed district is also the petitioning water management authority, the petition must be filed with the court administrator consistent with the criteria in paragraph (a), clauses (1) to (3).\n(c) When the petition is filed, the drainage authority in consultation with the auditor or secretary, or the court administrator with the approval of the court, shall set a time and location for a hearing on the petition. The auditor, secretary, or court administrator shall give notice by mail and publication of the time and location of the transfer hearing to all persons interested. The notice shall include a description of the property owner's right to object under subdivision 5. The drainage authority or the district court where the petition is properly filed has jurisdiction of the petition.\n(a) At the hearing, the drainage authority or court shall examine the petition and determine whether it is sufficient and shall hear all interested parties.\n(b) If a property owner assessed benefits for the drainage system appears and makes a written objection to the transfer of the drainage system, the drainage authority or court shall appoint a technical panel to examine the drainage system, the property, and the proposed transfer and report to the drainage authority or court. The hearing must be adjourned to make the examination and report and a date must be set to reconvene. The technical panel shall consist, at a minimum, of a representative of the drainage authority, a representative of the commissioner, a representative of the soil and water conservation district, a representative of the Board of Water and Soil Resources, and a viewer. The technical panel shall proceed to examine the drainage system, the property, and the property owner's objections to the proposed transfer of the system and report as soon as possible to the drainage authority or court with the merits of the objections. The technical panel shall also determine the extent to which the transfer of the drainage system will damage or take property. Nongovernment employee members of the technical panel must be compensated in the same manner as viewers under section 103E.645, subdivision 3.\n(c) The Board of Water and Soil Resources and the commissioner, if requested by the drainage authority or court, shall provide any technical assistance, including engineering, surveys, hydrologic analyses, or water quality studies as requested by the drainage authority or court.\n(d) When the hearing is reconvened, the drainage authority or court shall consider the technical panel's report and all evidence offered. If the drainage authority or court determines that storm, surface, or floodwaters along the drainage system or within the benefited area of the drainage system, could be better managed by a water management authority, it shall authorize the transfer of the drainage system.\nCosts, including engineering and attorney's fees, related to the proceedings to transfer a drainage system must be paid by the proposed transferee water management authority. If the drainage authority or court orders that the drainage authority should not be transferred, the drainage authority shall reimburse the water management authority from the drainage system account for the reasonable value of engineering work conducted as part of the transfer proceedings.\n(a) Any proceeding to transfer all or part of a drainage system to a water management authority must guarantee that all rights to an outlet are preserved for property assessed for benefits on the transferred drainage system of at least equal hydraulic efficiency as the rights to an outlet that existed on the date of transfer.\n(b) The transfer of a drainage system to a water management authority is not a compromise of any property right held by an owner of assessed property on the transferred drainage system.\n(c) A water management authority shall compensate any owner of property assessed for benefits on the transferred drainage system for the loss or impairment of any drainage rights occurring after transfer of the drainage system.\n(a) Except as provided in this section, after transfer of a drainage system, or any part thereof, to a water management authority, the drainage system ceases to be subject to regulation under this chapter except that if only a portion of a drainage system is transferred, the water management authority may be assessed for improvements under section 103E.215 or repairs under sections 103E.701 to 103E.711 in the manner provided under sections 103E.315 and 103E.601 to 103E.615. The water management authority may manage water within its jurisdictional boundaries according to whatever law controls the function of the water management authority. The transferred drainage system shall become a work and a responsibility of the transferee water management authority. All responsibility of the drainage authority for the transferred drainage system ends.\n(b) Activities conducted in the transferred drainage system must continue to be eligible for all exemptions and exceptions available for activities conducted in public drainage systems under sections 103G.2241 and 103G.245.\nThis section does not amend, supersede, or repeal any existing law providing for the transfer of a drainage system under this chapter, chapter 103D, or other law, but is supplementary to those laws.",
	"repealed": false
}