{
	"id": "502.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/502.82",
	"title": "502.82 VARIETIES OF POWER.",
	"text": "This chapter applies to powers of appointment. A power of appointment, as the term is used in this chapter, is an authority created or reserved by a donor having property subject to the donor's disposition, enabling the donee to designate, within the limits that may be prescribed by the donor, the appointees of the property, the shares, or the manner in which the property shall be received.\n(a) A power of appointment is:\n(1) general or special; and\n(2) exclusive or nonexclusive.\n(b) A power of appointment is general to the extent that it is exercisable wholly in favor of the donee, the donee's estate, the donee's creditors, or the creditors of the donee's estate.\n(c) All other powers of appointment are special.\n(d) A special power of appointment is exclusive if it may be exercised in favor of one or more of the appointees to the exclusion of the others.\n(e) A special power of appointment is nonexclusive if it must be exercised in favor of all the appointees.\n(a) A power of appointment, as to the time of its exercise, may be presently exercisable, testamentary, or postponed.\n(b) A power of appointment is presently exercisable if it may be exercised by the donee, during the donee's lifetime or by the donee's written will, at any time after its creation, and does not include a postponed power as described in paragraph (d).\n(c) A power of appointment is testamentary if it is exercisable only by a written will of the donee.\n(d) A power of appointment is postponed if it is exercisable by the donee only after the expiration of a stated time or after the occurrence or nonoccurrence of a specified event.\n(a) A power of appointment is either imperative or discretionary.\n(b) A power of appointment is imperative if the instrument creating the power imposes on the donee a duty to exercise it, and the power may be imperative even though it is exclusive.\n(c) A power of appointment is discretionary if the donee is authorized to exercise or not to exercise it.",
	"repealed": false
}