{
	"id": "290.0671",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0671",
	"title": "290.0671 MINNESOTA WORKING FAMILY CREDIT.",
	"text": "(a) An individual who is a resident of Minnesota is allowed a credit against the tax imposed by this chapter equal to a percentage of earned income. To receive a credit, a taxpayer must be eligible for a credit under section 32 of the Internal Revenue Code, except that:\n(1) a taxpayer with no qualifying children who has attained the age of 19, but not attained age 65 before the close of the taxable year and is otherwise eligible for a credit under section 32 of the Internal Revenue Code may also receive a credit;\n(2) a taxpayer who is otherwise eligible for a credit under section 32 of the Internal Revenue Code remains eligible for the credit even if the taxpayer's earned income or adjusted gross income exceeds the income limitation under section 32 of the Internal Revenue Code; and\n(3) section 32(m) of the Internal Revenue Code does not apply.\n(b) A taxpayer's working family credit equals four percent of the first $8,750 of earned income.\n(c) The credit under this section is increased by:\n(1) $925 for a taxpayer with one qualifying older child;\n(2) $2,100 for a taxpayer with two qualifying older children; or\n(3) $2,500 for a taxpayer with three or more qualifying older children.\n(d) The credit under this section is phased out jointly with the credit under section 290.0661, subdivision 4. For a taxpayer with one or more qualifying older children who did not qualify for the credit under section 290.0661, the phaseout rate equals nine percent.\n(e) For a person who was a resident for the entire tax year and has earned income not subject to tax under this chapter, the credit must be allocated based on the ratio of federal adjusted gross income reduced by the earned income not subject to tax under this chapter over federal adjusted gross income. For purposes of this paragraph, the following clauses are not considered \"earned income not subject to tax under this chapter\":\n(1) the subtractions for military pay under section 290.0132, subdivisions 11 and 12;\n(2) the exclusion of combat pay under section 112 of the Internal Revenue Code; and\n(3) income derived from an Indian reservation by an enrolled member of the reservation while living on the reservation.\nFor purposes of this section, \"qualifying older child\" means a qualifying child, as defined in section 32(c) of the Internal Revenue Code, that attained at least the age of 18 in the taxable year. For the purposes of determining a qualifying older child, section 32(m) of the Internal Revenue Code does not apply.\nThe credit allowed by this section shall be known as the \"Minnesota working family credit.\"\n[Repealed, 2003 c 127 art 3 s 24]\nIf the amount of credit which the claimant is eligible to receive under this section exceeds the claimant's tax liability under this chapter, the commissioner shall refund the excess to the claimant.\nMS 2022 [Repealed by amendment, 2023 c 64 art 1 s 36]\nAn amount sufficient to pay the refunds required by this section is appropriated to the commissioner from the general fund.\nMS 2018 [Repealed, 1Sp2019 c 6 art 2 s 27]\nThe commissioner shall annually adjust the earned income amounts used to calculate the credit and the qualifying older child amounts in subdivision 1 as provided in section 270C.22. The statutory year is taxable year 2023.",
	"repealed": false
}