{
	"id": "428B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/428B.04",
	"title": "428B.04 MODIFICATION OF ORDINANCE.",
	"text": "Upon written request of the tourism improvement association, the governing body of a municipality may adopt an ordinance to modify the district after conducting a public hearing on the proposed modifications. If the modification includes a change to the rate, method, and basis of imposing the service charge or the expansion of the tourism improvement district's geographic boundaries, a petition as described in section 428B.07 must be submitted by impacted business owners to initiate proceedings for modification.\nA municipality must provide notice of the hearing by publication in at least two issues of the municipality's official newspaper. The two publications must be two weeks apart and the municipality must hold a hearing at least three days after the last publication. Not less than ten days before the hearing, the municipality must mail, or deliver by electronic means, notice to the business owner of each business subject to the service charge by the tourism improvement district. The notice must include:\n(1) a map showing the boundaries of the district and any proposed changes to the boundaries of the district;\n(2) the time and place of the hearing;\n(3) a statement that all interested persons will be given an opportunity to be heard at the hearing regarding the proposed service charge; and\n(4) a brief description of the proposed modification to the ordinance.\nAt the hearing regarding modification to the ordinance, business owners and persons affected by the proposed modification may testify on issues relevant to the proposed modification. Within six months after the conclusion of the hearing, the municipality may adopt the ordinance modifying the district by a vote of the majority of the governing body in accordance with the request for modification by the tourism improvement association and as described in the notice.\nIf the modification of the ordinance includes the expansion of the tourism improvement district's geographic boundaries, the ordinance modifying the district may be adopted after following the notice and veto requirements in section 428B.08; however, a successful objection will be determined based on a majority of business owners who will pay the service charge in the expanded area of the district. For all other modifications, the ordinance modifying the district may be adopted following the notice and veto requirements in section 428B.08.",
	"repealed": false
}