{
	"id": "245D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.02",
	"title": "245D.02 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them in this section.\n\"Annual\" and \"annually\" have the meaning given in section 245A.02, subdivision 2b.\n\"Authorized representative\" means a parent, family member, advocate, or other adult authorized by the person or the person's legal representative, to serve as a representative in connection with the provision of services licensed under this chapter. This authorization must be in writing or by another method that clearly indicates the person's free choice. The authorized representative must have no financial interest in the provision of any services included in the person's service delivery plan and must be capable of providing the support necessary to assist the person in the use of home and community-based services licensed under this chapter.\n\"Aversive procedure\" means the application of an aversive stimulus contingent upon the occurrence of a behavior for the purposes of reducing or eliminating the behavior.\n\"Aversive stimulus\" means an object, event, or situation that is presented immediately following a behavior in an attempt to suppress the behavior. Typically, an aversive stimulus is unpleasant and penalizes or confines.\n\"Case manager\" means the individual designated to provide waiver case management services, care coordination, or long-term care consultation, as specified in chapter 256S and sections 256B.0913, 256B.092, and 256B.49, or successor provisions. For purposes of this chapter, \"case manager\" includes case management services as defined in Minnesota Rules, part 9520.0902, subpart 3.\n\"Certification\" means the commissioner's written authorization for a license holder to provide specialized services based on certification standards in section 245D.33. The term certification and its derivatives have the same meaning and may be substituted for the term licensure and its derivatives in this chapter and chapter 245A.\n\"Chemical restraint\" means the administration of a drug or medication to control the person's behavior or restrict the person's freedom of movement and is not a standard treatment or dosage for the person's medical or psychological condition.\n\"Commissioner\" means the commissioner of the Department of Human Services or the commissioner's designated representative.\n\"Community residential setting\" means a residential program as identified in section 245A.11, subdivision 8, where residential supports and services identified in section 245D.03, subdivision 1, paragraph (c), clause (3), items (i) and (ii), are provided and the license holder is the owner, lessor, or tenant of the facility licensed according to this chapter, and the license holder does not reside in the facility.\n\"Support plan\" has the meaning given in sections 256B.0913, subdivision 8; 256B.092, subdivision 1b; 256B.49, subdivision 15; and 256S.10, or successor provisions. For purposes of this chapter, \"support plan\" includes the individual program plan or individual treatment plan as defined in Minnesota Rules, part 9520.0510, subpart 12.\n\"Support plan addendum\" means the documentation that this chapter requires of the license holder for each person receiving services.\n\"Corporate foster care\" means a child foster residence setting licensed according to Minnesota Rules, parts 2960.3000 to 2960.3340, or an adult foster care home licensed according to Minnesota Rules, parts 9555.5105 to 9555.6265, where the license holder does not live in the home.\n\"Cultural competence\" or \"culturally competent\" means the ability and the will to respond to the unique needs of a person that arise from the person's culture and the ability to use the person's culture as a resource or tool to assist with the intervention and help meet the person's needs.\n\"Day services facility\" means a facility licensed according to this chapter at which persons receive day services licensed under this chapter from the license holder's direct support staff for a cumulative total of more than 30 days within any 12-month period and the license holder is the owner, lessor, or tenant of the facility.\n\"Department\" means the Department of Human Services.\n\"Deprivation procedure\" means the removal of a positive reinforcer following a response resulting in, or intended to result in, a decrease in the frequency, duration, or intensity of that response. Oftentimes the positive reinforcer available is goods, services, or activities to which the person is normally entitled. The removal is often in the form of a delay or postponement of the positive reinforcer.\n\"Direct contact\" has the meaning given in section 245C.02, subdivision 11, and is used interchangeably with the term \"direct support service.\"\n\"Direct support staff\" or \"staff\" means employees of the license holder who have direct contact with persons served by the program and includes temporary staff or subcontractors, regardless of employer, providing program services for hire under the control of the license holder who have direct contact with persons served by the program.\n\"Drug\" has the meaning given in section 151.01, subdivision 5.\n\"Emergency\" means any event that affects the ordinary daily operation of the program including, but not limited to, fires, severe weather, natural disasters, power failures, or other events that threaten the immediate health and safety of a person receiving services and that require calling 911, emergency evacuation, moving to an emergency shelter, or temporary closure or relocation of the program to another facility or service site for more than 24 hours.\n\"Emergency use of manual restraint\" means using a manual restraint when a person poses an imminent risk of physical harm to self or others and is the least restrictive intervention that would achieve safety. Property damage, verbal aggression, or a person's refusal to receive or participate in treatment or programming on their own do not constitute an emergency.\n\"Expanded support team\" means the members of the support team defined in subdivision 34 and a licensed health or mental health professional or other licensed, certified, or qualified professionals or consultants working with the person and included in the team at the request of the person or the person's legal representative.\n\"Family foster care\" means a child foster family setting licensed according to Minnesota Rules, parts 2960.3000 to 2960.3340, or an adult foster care home licensed according to Minnesota Rules, parts 9555.5105 to 9555.6265, where the license holder lives in the home.\n\"Health services\" means any service or treatment consistent with the physical and mental health needs of the person, such as medication administration and monitoring, medical, dental, nutritional, health monitoring, wellness education, and exercise.\n\"Home and community-based services\" means the services identified in section 245D.03, subdivision 1, and as defined in:\n(1) the federally approved waiver plans governed by United States Code, title 42, sections 1396 et seq., including the waivers for persons with disabilities under section 256B.49, subdivision 11, including the brain injury (BI) waiver plan; the community alternative care (CAC) waiver plan; the community access for disability inclusion (CADI) waiver plan; the developmental disabilities (DD) waiver plan under section 256B.092, subdivision 5; the elderly waiver (EW) plan under section 256S.01, subdivision 1; or successor plans respective to each waiver; or\n(2) the alternative care (AC) program under section 256B.0913.\n\"Incident\" means an occurrence which involves a person and requires the program to make a response that is not a part of the program's ordinary provision of services to that person, and includes:\n(1) serious injury of a person as determined by section 245.91, subdivision 6;\n(2) a person's death;\n(3) any medical emergency, unexpected serious illness, or significant unexpected change in an illness or medical condition of a person that requires the program to call 911; physician, advanced practice registered nurse, or physician assistant treatment; or hospitalization;\n(4) any mental health crisis that requires the program to call 911, a mental health crisis intervention team, or a similar mental health response team or service when available and appropriate;\n(5) an act or situation involving a person that requires the program to call 911, law enforcement, or the fire department;\n(6) a person's unauthorized or unexplained absence from a program;\n(7) conduct by a person receiving services against another person receiving services that:\n(i) is so severe, pervasive, or objectively offensive that it substantially interferes with a person's opportunities to participate in or receive service or support;\n(ii) places the person in actual and reasonable fear of harm;\n(iii) places the person in actual and reasonable fear of damage to property of the person; or\n(iv) substantially disrupts the orderly operation of the program;\n(8) any sexual activity between persons receiving services involving force or coercion as defined under section 609.341, subdivisions 3 and 14;\n(9) any emergency use of manual restraint as identified in section 245D.061 or successor provisions; or\n(10) a report of alleged or suspected child or vulnerable adult maltreatment under section 626.557 or chapter 260E.\n\"Intermediate care facility for persons with developmental disabilities\" or \"ICF/DD\" means a residential program licensed to serve four or more persons with developmental disabilities under section 252.28 and chapter 245A and licensed as a supervised living facility under chapter 144, which together are certified by the Department of Health as an intermediate care facility for persons with developmental disabilities.\n\"Least restrictive alternative\" means the alternative method for providing supports and services that is the least intrusive and most normalized given the level of supervision and protection required for the person. This level of supervision and protection allows risk taking to the extent that there is no reasonable likelihood that serious harm will happen to the person or others.\n\"Legal representative\" means the parent of a person who is under 18 years of age, a court-appointed guardian, or other representative with legal authority to make decisions about services for a person. Other representatives with legal authority to make decisions include but are not limited to a health care agent or an attorney-in-fact authorized through a health care directive or power of attorney.\n\"License\" has the meaning given in section 245A.02, subdivision 8.\n\"Licensed health professional\" means a person licensed in Minnesota to practice those professions described in section 214.01, subdivision 2.\n\"License holder\" has the meaning given in section 245A.02, subdivision 9.\n\"Manual restraint\" means physical intervention intended to hold a person immobile or limit a person's voluntary movement by using body contact as the only source of physical restraint.\n(a) \"Mechanical restraint\" means the use of devices, materials, or equipment attached or adjacent to the person's body, or the use of practices that are intended to restrict freedom of movement or normal access to one's body or body parts, or limits a person's voluntary movement or holds a person immobile as an intervention precipitated by a person's behavior. The term applies to the use of mechanical restraint used to prevent injury with persons who engage in self-injurious behaviors, such as head-banging, gouging, or other actions resulting in tissue damage that have caused or could cause medical problems resulting from the self-injury.\n(b) Mechanical restraint does not include the following:\n(1) devices worn by the person that trigger electronic alarms to warn staff that a person is leaving a room or area, which do not, in and of themselves, restrict freedom of movement; or\n(2) the use of adaptive aids or equipment or orthotic devices ordered by a health care professional used to treat or manage a medical condition.\n\"Medication\" means a prescription drug or over-the-counter drug. For purposes of this chapter, \"medication\" includes dietary supplements.\n[Repealed by amendment, 2013 c 108 art 8 s 22]\n[Repealed by amendment, 2013 c 108 art 8 s 22]\n[Repealed by amendment, 2013 c 108 art 8 s 22]\n\"Mental health crisis intervention team\" means a mental health crisis response provider as identified in section 256B.0624.\n\"Most integrated setting\" means a setting that enables individuals with disabilities to interact with nondisabled persons to the fullest extent possible.\n\"Over-the-counter drug\" means a drug that is not required by federal law to bear the statement \"Caution: Federal law prohibits dispensing without prescription.\"\n\"Outcome\" means the behavior, action, or status attained by the person that can be observed, measured, and determined reliable and valid.\n\"Person\" has the meaning given in section 245A.02, subdivision 11.\n\"Person with a disability\" means a person determined to have a disability by the commissioner's state medical review team as identified in section 256B.055, subdivision 7, the Social Security Administration, or the person is determined to have a developmental disability or a related condition as defined in Minnesota Rules, part 9525.0016, subpart 2, items A to E.\n\"Physician\" means a person who is licensed under chapter 147.\n\"Positive support transition plan\" means the plan required in section 245D.06, subdivision 8, to be developed by the expanded support team to implement positive support strategies to:\n(1) eliminate the use of prohibited procedures as identified in section 245D.06, subdivision 5;\n(2) avoid the emergency use of manual restraint as identified in section 245D.061; and\n(3) prevent the person from physically harming self or others.\n\"Prescriber\" means a person who is authorized under section 148.235; 151.01, subdivision 23; or 151.37 to prescribe drugs.\n\"Prescription drug\" has the meaning given in section 151.01, subdivision 16.\n\"Program\" means either the nonresidential or residential program as defined in section 245A.02, subdivisions 10 and 14.\n\"Psychotropic medication\" means any medication prescribed to treat the symptoms of mental illness that affect thought processes, mood, sleep, or behavior. The major classes of psychotropic medication are antipsychotic (neuroleptic), antidepressant, antianxiety, mood stabilizers, anticonvulsants, and stimulants and nonstimulants for the treatment of attention deficit/hyperactivity disorder. Other miscellaneous medications are considered to be a psychotropic medication when they are specifically prescribed to treat a mental illness or to control or alter behavior.\n\"Restraint\" means manual restraint as defined in subdivision 15a or mechanical restraint as defined in subdivision 15b, or any other form of restraint that results in limiting of the free and normal movement of body or limbs.\n\"Seclusion\" means: (1) removing a person involuntarily to a room from which exit is prohibited by a staff person or a mechanism such as a lock, a device, or an object positioned to hold the door closed or otherwise prevent the person from leaving the room; or (2) otherwise involuntarily removing or separating a person from an area, activity, situation, or social contact with others and blocking or preventing the person's return.\n\"Self-determination\" means the person makes decisions independently, plans for the person's own future, determines how money is spent for the person's supports, and takes responsibility for making these decisions. If a person has a legal representative, the legal representative's decision-making authority is limited to the scope of authority granted by the court or allowed in the document authorizing the legal representative to act.\n\"Semi-independent living services\" has the meaning given in section 252.275.\n\"Service\" means care, training, supervision, counseling, consultation, or medication assistance assigned to the license holder in the support plan.\n[Repealed by amendment, 2013 c 108 art 8 s 22]\n\"Service site\" means the location where the service is provided to the person, including, but not limited to, a facility licensed according to chapter 245A; a location where the license holder is the owner, lessor, or tenant; a person's own home; or a community-based location.\n\"Sexual violence\" means the use of sexual actions or words that are unwanted or harmful to another person.\n[Repealed by amendment, 2013 c 108 art 8 s 22]\n\"Supervised living facility\" has the meaning given in Minnesota Rules, part 4665.0100, subpart 10.\n(a) \"Supervision\" means:\n(1) oversight by direct support staff as specified in the person's support plan or support plan addendum and awareness of the person's needs and activities;\n(2) responding to situations that present a serious risk to the health, safety, or rights of the person while services are being provided; and\n(3) the presence of direct support staff at a service site while services are being provided, unless a determination has been made and documented in the person's support plan or support plan addendum that the person does not require the presence of direct support staff while services are being provided.\n(b) For the purposes of this definition, \"while services are being provided,\" means any period of time during which the license holder will seek reimbursement for services.\n\"Support team\" means the service planning team identified in section 256B.49, subdivision 15; the interdisciplinary team identified in Minnesota Rules, part 9525.0004, subpart 14; or the case management team as defined in Minnesota Rules, part 9520.0902, subpart 6.\n\"Time out\" means the involuntary removal of a person for a period of time to a designated area from which the person is not prevented from leaving. For the purpose of this chapter, \"time out\" does not mean voluntary removal or self-removal for the purpose of calming, prevention of escalation, or de-escalation of behavior; nor does it mean taking a brief break or rest from an activity for the purpose of providing the person an opportunity to regain self-control.\n[Repealed by amendment, 2013 c 108 art 8 s 22]\n\"Treatment\" means the provision of care, other than medications, ordered or prescribed by a licensed health or mental health professional, provided to a person to cure, rehabilitate, or ease symptoms.\n\"Unlicensed staff\" means individuals not otherwise licensed or certified by a governmental health board or agency.\n\"Volunteer\" means an individual who, under the direction of the license holder, provides direct services without pay to a person served by the license holder.\n\"Working day\" means Monday, Tuesday, Wednesday, Thursday, or Friday, excluding any legal holiday.",
	"repealed": false
}