{
	"id": "270C.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.92",
	"title": "270C.92 IMPROPER OR NEGLIGENT ADMINISTRATION OF PROPERTY TAX LAWS.",
	"text": "The commissioner shall receive complaints and examine all cases where it is alleged that property subject to taxation has not been assessed or has been fraudulently or for any reason improperly or unequally assessed, or the law in any manner evaded or violated, and cause to be instituted such proceedings as will remedy improper or negligent administration of the property tax laws.\nIn administering the property tax laws, the commissioner shall raise or lower the market value of any real or personal property, including the power to raise or lower the market value of the real or personal property of any person; provided, that before any such assessment against the property of any person is so raised, notice of an intention to raise such market value and of the time and place at which a hearing thereon will be held shall be given to such person, by mail, addressed to the person at the place of residence listed upon the assessment book, at least five days before the day of such hearing.\nAll relevant and material evidence concerning the market value of the real or personal property shall be submitted at the hearing, and the hearing shall not be a \"contested case\" within the meaning of section 14.02, subdivision 3. The person notified of the hearing, or any other person having an interest in the property, may present evidence and argument bearing upon the market value of the property.\nA property owner, other than a public utility or mining company, for which the original assessments are determined by the commissioner, may not appear before the commissioner for the purposes provided in subdivision 1 or 2 unless a timely appearance in person, by counsel, or by written communication has been made before the county board of equalization as provided in section 274.13, to appeal the assessment of the property, or that the property owner can establish not receiving notice of market value at least five days before the local board of review meeting.\nThe commissioner may refuse to hear an appeal that is within the jurisdiction of the Small Claims Division of the Tax Court as stated in section 271.21, subdivision 2. The property owner shall be notified by the commissioner of the right to appeal to the Small Claims Division whenever an appeal to the commissioner is denied.",
	"repealed": false
}