{
	"id": "290A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/290A.04",
	"title": "290A.04 REFUND ALLOWABLE.",
	"text": "A refund shall be allowed each claimant in the amount that property taxes payable exceed the percentage of the household income of the claimant specified in subdivision 2 in the year for which the taxes were levied as specified in subdivision 2. If the amount of property taxes payable is equal to or less than the percentage of the household income of the claimant specified in subdivision 2 in the year for which the taxes were levied, the claimant shall not be eligible for a state refund pursuant to this section.\nA claimant whose property taxes payable are in excess of the percentage of the household income stated below shall pay an amount equal to the percent of income shown for the appropriate household income level along with the percent to be paid by the claimant of the remaining amount of property taxes payable. The state refund equals the amount of property taxes payable that remain, up to the state refund amount shown below.\nThe payment made to a claimant shall be the amount of the state refund calculated under this subdivision. No payment is allowed if the claimant's household income is $135,410 or more.\nMS 2022 [Repealed, 2023 c 64 art 7 s 31]\nMS 1984 [Repealed, 1Sp1985 c 14 art 5 s 7]\nThe commissioner may reconstruct the tables in subdivision 2 for homeowners to reflect the elimination of the homestead credit beginning for claims based on taxes payable in 1990.\n[Repealed, 1983 c 15 s 33]\n[Repealed, 1983 c 15 s 33]\n[Repealed, 1987 c 268 art 3 s 13]\n[Repealed, 1Sp1986 c 1 art 3 s 21]\n[Repealed, 1987 c 268 art 3 s 13]\n(a) If the gross property taxes payable on a homestead increase more than 12 percent over the property taxes payable in the prior year on the same property that is owned and occupied by the same owner on January 2 of both years, and the amount of that increase is $100 or more, a claimant who is a homeowner shall be allowed an additional refund equal to 60 percent of the amount of the increase over the greater of 12 percent of the prior year's property taxes payable or $100. This subdivision shall not apply to any increase in the gross property taxes payable attributable to improvements made to the homestead after the assessment date for the prior year's taxes.\nThe maximum refund allowed under this subdivision is $1,000.\n(b) For purposes of this subdivision \"gross property taxes payable\" means property taxes payable determined without regard to the refund allowed under this subdivision.\n(c) In addition to the other proofs required by this chapter, each claimant under this subdivision shall file with the property tax refund return a copy of the property tax statement for taxes payable in the preceding year or other documents required by the commissioner.\n(d) Upon request, the appropriate county official shall make available the names and addresses of the property taxpayers who may be eligible for the additional property tax refund under this section. The information shall be provided electronically. The county may recover its costs by charging the person requesting the information the reasonable cost for preparing the data. The information may not be used for any purpose other than for notifying the homeowner of potential eligibility and assisting the homeowner, without charge, in preparing a refund claim.\n[Repealed, 1995 c 264 art 15 s 6]\n[Repealed, 1Sp2001 c 5 art 7 s 66]\nThe commissioner of revenue shall construct and make available to taxpayers a comprehensive table showing the property taxes to be paid and refund allowed at various levels of income and assessment. The table shall follow the schedule of income percentages, maximums and other provisions specified in subdivision 2, except that the commissioner may graduate the transition between income brackets. All refunds shall be computed in accordance with tables prepared and issued by the commissioner of revenue.\nThe commissioner shall include on the form an appropriate space or method for the claimant to identify if the property taxes paid are for a manufactured home, as defined in section 273.125, subdivision 8, paragraph (c), or a park trailer taxed as a manufactured home under section 168.012, subdivision 9.\nThe commissioner shall annually adjust the dollar amounts of the income thresholds and the maximum refunds under subdivision 2 as provided in section 270C.22. The statutory year is 2023.\n[See Note.]\nA claimant is allowed to make a claim for refund under this chapter in addition to any credit the claimant is eligible for under section 290.0693.\n[Renumbered subd 4]",
	"repealed": false
}