{
	"id": "103D.745",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.745",
	"title": "103D.745 FINAL HEARING.",
	"text": "(a) At the time and place specified in the final hearing notice, the managers must hear all parties interested for and against the establishment of the proposed project and confirm the engineer's report and the appraisers' report.\n(b) Questions about the proposed project including jurisdiction, sufficiency of the petition or resolution, practicability, and necessity shall be determined by evidence presented at the hearing. Findings made by the managers before the final hearing are not conclusive but are subject to further investigation, consideration, and determination at the final hearing.\n(a) The managers may order and direct the modification of:\n(1) the engineer's report within the scope of the watershed management plan for the watershed district;\n(2) the assessment of benefits and damages; and\n(3) amendment or change of the list of property reported as assessable for construction or implementation and maintenance.\n(b) If the amended engineer's report and appraisers' report includes property not included in the original reports, the managers shall adjourn the hearing and have an amended notice published and mailed with the proper reference to all property as amended by the managers.\n(a) The managers shall make findings, order and direct construction or implementation of the project, and confirm the engineer's report and the findings of the appraisers and the appraisers' report if, at the end of the final hearing, the managers find that the project will:\n(1) be conducive to public health;\n(2) promote the general welfare;\n(3) be in compliance with this chapter; and\n(4) for each property to be assessed, result in benefits that will be greater than the cost to be assessed.\n(b) The order may authorize the construction or implementation of the project as a whole or authorize different parts of the project to be constructed separately.\n(c) The managers shall order the engineer to proceed with making the necessary surveys and preparing plans and specifications that are needed to construct the project and report the results of the surveys and plans to the managers.\nThe final hearing shall be recessed until the engineer's report and the bids are received. The hearing may be recessed to allow compliance with section 103D.801 if it becomes applicable.",
	"repealed": false
}