{
	"id": "216C.2641",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.2641",
	"title": "216C.2641 WEATHERIZATION TRAINING GRANT PROGRAM.",
	"text": "The commissioner of commerce must establish a weatherization training grant program to award grants to train workers for careers in the weatherization industry.\n(a) The commissioner must award grants through a competitive grant process.\n(b) An eligible entity under paragraph (c) seeking a grant under this section must submit a written application to the commissioner using a form developed by the commissioner.\n(c) The commissioner may award grants under this section only to:\n(1) a nonprofit organization exempt from taxation under section 501(c)(3) of the United States Internal Revenue Code;\n(2) a labor organization, as defined in section 179.01, subdivision 6; or\n(3) a job training center or educational institution that the commissioner of commerce determines has the ability to train workers for weatherization careers.\n(d) Grant funds must be used to pay costs associated with training workers for careers in the weatherization industry, including related supplies, materials, instruction, and infrastructure.\n(e) When awarding grants under this section, the commissioner must give priority to applications that provide the highest quality training to prepare trainees for weatherization employment opportunities that meet technical standards and certifications developed by the Building Performance Institute, Inc., or the Standard Work Specifications developed by the United States Department of Energy for the federal Weatherization Assistance Program.\nBy January 15, 2025, and each January 15 thereafter, the commissioner must submit a report to the chairs and ranking minority members of the senate and house of representatives committees with jurisdiction over energy policy. The report must detail the use of grant funds under this section, including data on the number of trainees trained and the career progress of trainees supported by prior grants.",
	"repealed": false
}