{
	"id": "125A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.08",
	"title": "125A.08 INDIVIDUALIZED EDUCATION PROGRAMS.",
	"text": "(a) At the beginning of each school year, each school district shall have in effect, for each child with a disability, an individualized education program.\n(b) As defined in this section, every district must ensure the following:\n(1) all students with disabilities are provided the special instruction and services which are appropriate to their needs. Where the individualized education program team has determined appropriate goals and objectives based on the student's needs, including the extent to which the student can be included in the least restrictive environment, and where there are essentially equivalent and effective instruction, related services, or assistive technology devices available to meet the student's needs, cost to the district may be among the factors considered by the team in choosing how to provide the appropriate services, instruction, or devices that are to be made part of the student's individualized education program. The individualized education program team shall consider and may authorize services covered by medical assistance according to section 256B.0625, subdivision 26. Before a school district evaluation team makes a determination of other health disability under Minnesota Rules, part 3525.1335, subparts 1 and 2, item A, subitem (1), the evaluation team must seek written documentation of the student's medically diagnosed chronic or acute health condition signed by a licensed physician or a licensed health care provider acting within the scope of the provider's practice. The student's needs and the special education instruction and services to be provided must be agreed upon through the development of an individualized education program. The program must address the student's need to develop skills to live and work as independently as possible within the community. The individualized education program team must consider positive behavioral interventions, strategies, and supports that address behavior needs for children. During grade 9, the program must address the student's needs for transition from secondary services to postsecondary education and training, employment, community participation, recreation, and leisure and home living. In developing the program, districts must inform parents of the full range of transitional goals and related services that should be considered. The program must include a statement of the needed transition services, including a statement of the interagency responsibilities or linkages or both before secondary services are concluded. If the individualized education program meets the plan components in section 120B.125, the individualized education program satisfies the requirement and no additional transition plan is needed;\n(2) children with a disability under age five and their families are provided special instruction and services appropriate to the child's level of functioning and needs;\n(3) children with a disability and their parents or guardians are guaranteed procedural safeguards and the right to participate in decisions involving identification, assessment including assistive technology assessment, and educational placement of children with a disability;\n(4) eligibility and needs of children with a disability are determined by an initial evaluation or reevaluation, which may be completed using existing data under United States Code, title 20, section 33, et seq.;\n(5) to the maximum extent appropriate, children with a disability, including those in public or private institutions or other care facilities, are educated with children who are not disabled, and that special classes, separate schooling, or other removal of children with a disability from the regular educational environment occurs only when and to the extent that the nature or severity of the disability is such that education in regular classes with the use of supplementary services cannot be achieved satisfactorily;\n(6) in accordance with recognized professional standards, testing and evaluation materials, and procedures used for the purposes of classification and placement of children with a disability are selected and administered so as not to be racially or culturally discriminatory; and\n(7) the rights of the child are protected when the parents or guardians are not known or not available, or the child is a ward of the state.\nFor all paraprofessionals employed to work in programs whose role in part is to provide direct support to students with disabilities, the school board in each district shall ensure that:\n(1) before or beginning at the time of employment, each paraprofessional must develop sufficient knowledge and skills in emergency procedures, building orientation, roles and responsibilities, confidentiality, vulnerability, and reportability, among other things, to begin meeting the needs, especially disability-specific and behavioral needs, of the students with whom the paraprofessional works;\n(2) within five days of beginning to work alone with an individual student with a disability, the assigned paraprofessional must be either given paid time, or time during the school day, to review a student's individualized education program or be briefed on the student's specific needs by appropriate staff;\n(3) annual training opportunities are required to enable the paraprofessional to continue to further develop the knowledge and skills that are specific to the students with whom the paraprofessional works, including understanding disabilities, the unique and individual needs of each student according to the student's disability and how the disability affects the student's education and behavior, following lesson plans, and implementing follow-up instructional procedures and activities; and\n(4) a districtwide process obligates each paraprofessional to work under the ongoing direction of a licensed teacher and, where appropriate and possible, the supervision of a school nurse.\nA school district may conduct a functional behavior assessment as defined in Minnesota Rules, part 3525.0210, subpart 22, as a stand-alone evaluation without conducting a comprehensive evaluation of the student in accordance with prior written notice provisions in section 125A.091, subdivision 3a. A parent or guardian may request that a school district conduct a comprehensive evaluation of the parent's or guardian's student.\nA school district may conduct an assessment for developmental adapted physical education, as defined in Minnesota Rules, part 3525.1352, as a stand-alone evaluation without conducting a comprehensive evaluation of the student in accordance with prior written notice provisions in section 125A.091, subdivision 3a. A parent or guardian may request that a school district conduct a comprehensive evaluation of the parent's or guardian's student.",
	"repealed": false
}