{
	"id": "103F.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.111",
	"title": "103F.111 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 103F.111 to 103F.165.\n\"Commissioner\" means the commissioner of natural resources.\n\"Flood fringe\" means the portion of the floodplain outside of the floodway.\n\"Floodplain\" means the areas adjoining a watercourse or water basin that have been or may be covered by a regional flood.\n\"Floodway\" means the channel of the watercourse, the bed of water basins, and those portions of the adjoining floodplains that are reasonably required to carry and discharge floodwater and provide water storage during a regional flood.\n\"Local governmental unit\" means a county, statutory or home rule charter city, town, watershed district, or lake improvement district.\n\"Mitigation\" means the act of alleviating the effects of floods and flooding by moderating or reducing the severe damages resulting from floods through structural and nonstructural flood management measures.\n\"Mitigation measures\" means structural or nonstructural flood management measures, or both.\n\"Nonstructural flood management measures\" means actions in floodplains designed to reduce the damaging effects of floods on existing and potential users of floodplains, without physically altering the flood behavior. Nonstructural flood management measures include:\n(1) public acquisition of floodplain lands;\n(2) relocation of public and private structures and facilities;\n(3) floodproofing of public and private facilities;\n(4) installation and operation of flood warning systems and evacuation procedures;\n(5) adoption and enforcement of land use control ordinances and building codes;\n(6) installation of signs and other notifications in regional flood areas; and\n(7) provision of flood insurance and public education.\n\"Regional flood\" means a flood that is representative of large floods known to have occurred generally in the state and reasonably characteristic of what can be expected to occur on an average frequency in the magnitude of a 100-year recurrence interval.\n\"Structural flood management measures\" means physical actions taken to modify the behavior and extent of floods and flooding, including the construction of dams, dikes, levees, flood bypass channels, floodwater storage and retardation structures, and water level control structures, excluding deepening or straightening of existing stream channels.\n\"Water basin\" has the meaning given it by section 103G.005, subdivision 16.",
	"repealed": false
}