{
	"id": "383A.288",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.288",
	"title": "383A.288 COMPETITIVE EXAMINATIONS.",
	"text": "Entrance to the classified service shall be through successful competition in an examination and certification and appointment from an eligible list except as provided in this section.\nAll examinations for positions in the classified service shall be job related, nondiscriminatory, and designed to fairly assess ability to perform the duties of the class for which the examination is given. The examination may consist of, but shall not be limited to, one or more of the following:\n(a) written subjective or objective tests;\n(b) physical tests;\n(c) practical or demonstration tests;\n(d) evaluation of training and experience;\n(e) oral subjective or objective tests in the form of question and answer;\n(f) interviews; or\n(g) a supervisory evaluation of job performance.\n(a) Competitive open examinations shall, upon public notice, be open to all applicants who meet reasonable job-related requirements fixed by the Human Resources Department.\n(b) Employees in the classified service with permanent tenure who pass an open competitive examination shall have added to their final examination score one point for each year of permanent tenure up to a maximum of ten points. This credit shall not be used for examinations for supervisory positions. During the term of any joint powers agreement between the city of Saint Paul and Ramsey County joining a city of Saint Paul department or program and a Ramsey County department or program into a combined department or program under the direction of Ramsey County, Ramsey County may allow classified employees of the affected city of Saint Paul department, who pass an open competitive examination to have added to their final examination score one point for each year of permanent tenure in the classified service of the city of Saint Paul, up to a maximum of ten points, in open competitive examinations to fill vacancies in county positions only in the combined department or program.\nCompetitive promotional examinations shall be open only to permanent and probationary employees of the classified service. The Human Resources Department may limit competition to employees of one or more departments, or to employees meeting specified employment requirements. During the term of any joint powers agreement between the city of Saint Paul and Ramsey County joining a city of Saint Paul department or program and a Ramsey County department or program into a combined department or program under the direction of Ramsey County, Ramsey County may allow classified employees of the city of Saint Paul department or program and classified employees of the Ramsey County department or program, so combined, to be considered as employees of the classified service of a single Ramsey County department for the purpose of this subdivision.\nThe human resources director shall establish a procedure and a definition of the criteria for the selection and referral of qualified applicants to fill positions in routine service classifications involving unskilled tasks. Applicants to fill vacancies in the classifications shall be exempt from ranking and certification. The director shall refer all qualified applicants to the appointing authority having vacancies in the appropriate classifications.\nThe human resources director shall establish criteria for the designation of positions in the classified service as managerial positions where the duties involve significant discretion and substantial involvement in the development, interpretation, and implementation of departmental and county policy. The human resources director shall designate those classified positions that meet these criteria in consultation with interested parties, including bargaining units certified pursuant to chapter 179A representing Ramsey County employees. Classified positions, so designated, shall be exempt from the examination and certification requirements of this section, and the provisions of section 383A.289, and shall be filled by means of an open application and screening process.\nUp to a total of five full-time positions within Ramsey County may be selected for inclusion for a supported work program for people with disabilities who require the continued support of a job coach. A full-time position may be shared by up to three persons with disabilities and a job coach. The job coach is not a Ramsey County employee within the scope of section 383A.281, subdivision 17, or section 179A.03, subdivision 14, unless the job coach holds another position within the scope of section 383A.281, subdivision 17, or section 179A.03, subdivision 14. Any position filled pursuant to this subdivision is exempt from the requirements of subdivision 1.",
	"repealed": false
}