{
	"id": "53C.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.06",
	"title": "53C.06 VEHICLE CONDITIONAL SALES INSTALLMENT CONTRACT; EXAMINATION, SPECIAL INVESTIGATION, COST ASSESSMENT.",
	"text": "(a) For the purpose of discovering violations of sections 53C.01 to 53C.14 or securing information lawfully required by the commissioner hereunder, the commissioner may, at any time, either personally or by a person or persons duly designated by the commissioner, investigate the conditional sales contracts and business related to the conditional sales contracts and examine the books, accounts, records, and files used therein, of every licensee, assignee of the licensee, and of every person who shall be engaged in the business of a sales finance company, including the retail seller and assignee of the retail seller, whether the person shall act as principal or agent, or under or without the authority of sections 53C.01 to 53C.14. For that purpose, the commissioner and the commissioner's duly designated representative shall have free access to the offices and places of business, books, accounts, papers, records, files, safes, and vaults of all these persons. The commissioner and all persons duly designated by the commissioner shall have authority to require the attendance of and to examine, under oath, all persons whomsoever whose testimony the commissioner may require relative to the conditional sales contract or the business or to the subject matter of any examination, investigation, or hearing.\n(b) The commissioner may make an examination of the affairs, business, office, and records of licensees, and of other persons subject to examination under this section, as often as considered necessary. The commissioner may assess a fee covering the necessary costs of an examination or special investigation under this section, section 53C.04, or reports filed under section 53C.07. The fee is payable to the commissioner on the commissioner's request for payment. The commissioner may maintain an action for the recovery of the costs in any court of competent jurisdiction.",
	"repealed": false
}