{
	"id": "115B.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.18",
	"title": "115B.18 FAILURE TO TAKE REQUESTED ACTIONS; CIVIL PENALTIES; ACTION TO COMPEL PERFORMANCE; INJUNCTIVE RELIEF.",
	"text": "(a) Any person responsible for a release or threatened release from a facility of a pollutant or contaminant which presents an imminent and substantial danger to the public health or welfare or the environment or for a release or threatened release of a hazardous substance from a facility shall forfeit and pay to the state a civil penalty in an amount to be determined by the court of not more than $20,000 per day for each day that the person fails to take reasonable and necessary response actions or to make reasonable progress in completing response actions requested as provided in subdivision 3.\n(b) The penalty provided under this subdivision may be recovered by an action brought by the attorney general in the name of the state in connection with an action to recover expenses of the agency under section 115B.17, subdivision 6, or by a separate action in the District Court of Ramsey County. All penalties recovered under this subdivision shall be deposited in the remediation fund.\nWhen any person who is responsible for a release or threatened release from a facility of a pollutant or contaminant which presents an imminent and substantial danger to the public health or welfare or the environment or for a release or threatened release of a hazardous substance from a facility, fails to take response actions or to make reasonable progress in completing response actions requested as provided in subdivision 3, the attorney general may bring an action in the name of the state to compel performance of the requested response actions. If any person having any right, title, or interest in and to the real property where the facility is located or where response actions are proposed to be taken is not a person responsible for the release or threatened release, the person may be joined as an indispensable party in an action to compel performance in order to assure that the requested response actions can be taken on that property by the responsible parties.\nA request for emergency removal action shall be made by the commissioner of the Pollution Control Agency. Other requests for response actions shall be made by the agency. A request shall be in writing, shall state the action requested, the reasons for the action, and a reasonable time by which the action must be begun and completed taking into account the urgency of the action for protection of the public health or welfare or the environment.\nThe release or threatened release of a hazardous substance, or a pollutant or contaminant, shall constitute a public nuisance and may be enjoined in an action, in the name of the state, brought by the attorney general.",
	"repealed": false
}