{
	"id": "123B.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.70",
	"title": "123B.70 SCHOOL DISTRICT CONSTRUCTION.",
	"text": "(a) In determining whether to give a school facility a positive, negative, or unfavorable review and comment, the commissioner must evaluate the proposals for facilities using the information provided under section 123B.71, subdivision 9.\n(b) In the case of a proposal for a new school, the local school board retains the authority to determine the minimum acreage needed to accommodate the school and related facilities. The commissioner may evaluate the proposals but must not issue a negative or unfavorable review and comment under this section for a school facility solely based on too little acreage of the proposed school site.\n(c) In the case of a proposal to renovate an existing school, the local school board retains the authority to determine whether to renovate an existing school or to build a new school regardless of the acreage of the current school site or the cost of the renovation relative to the cost of building a new school. The commissioner's evaluation of whether to replace a facility must not be solely based upon the ratio of renovation costs to replacement costs.\nIf the commissioner submits a positive review and comment for a proposal according to section 123B.71, the school board may proceed with the construction according to the requirements of applicable laws.\n(a) If the commissioner submits a negative review and comment for a proposal according to section 123B.71, the following steps must be taken:\n(1) the commissioner must notify the school board of the proposed negative review and comment and schedule a public meeting within 60 days of the notification within that school district to discuss the proposed negative review and comment on the school facility; and\n(2) the school board shall appoint an advisory task force of up to five members to advise the school board and the commissioner on the advantages, disadvantages, and alternatives to the proposed facility at the public meeting. One member of the advisory task force must also be a member of the county facilities group.\n(b) After attending the public meeting, the commissioner shall reconsider the proposal. If the commissioner submits a negative review and comment, the school board may appeal that decision under chapter 14.\n(c) A school board may not proceed with construction if the commissioner's negative review and comment is upheld or if the commissioner's negative review and comment is not appealed.\nIf the commissioner submits an unfavorable review and comment for a proposal under section 123B.71, the school board, by resolution of the board, must reconsider construction. If, upon reconsideration, the school board decides to proceed with construction, it may initiate proceedings for issuing bonds to finance construction under chapter 475. Unless 60 percent of the voters at the election approve of issuing the obligations, the board is not authorized to issue the obligations.",
	"repealed": false
}