{
	"id": "116L.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.04",
	"title": "116L.04 PARTNERSHIP POWER.",
	"text": "(a) The partnership program may provide grants-in-aid to educational or other nonprofit educational institutions using the following guidelines:\n(1) the educational or other nonprofit educational institution is a provider of training within the state in either the public or private sector;\n(2) the program involves skills training that is an area of employment need; and\n(3) preference will be given to educational or other nonprofit training institutions which serve economically disadvantaged people, minorities, or those who are victims of economic dislocation and to businesses located in rural areas.\n(b) A single grant to any one institution shall not exceed $400,000. A portion of a grant may be used for preemployment training.\n(c) Each institution must provide for the dissemination of summary results of a grant-funded project, including, but not limited to, information about curriculum and all supporting materials developed in conjunction with the grant. Results of projects developed by any Minnesota State Colleges and Universities system institution must be disseminated throughout the system.\nThe pathways program may provide grants-in-aid for developing programs which assist in the transition of persons from welfare to work and assist individuals at or below 200 percent of the federal poverty guidelines. The program is to be operated by the board. The board shall consult and coordinate with program administrators at the Department of Employment and Economic Development to design and provide services for temporary assistance for needy families recipients.\nPathways grants-in-aid may be awarded to educational or other nonprofit training institutions or to workforce development intermediaries for education and training programs and services supporting education and training programs that serve eligible recipients.\nPreference shall be given to projects that:\n(1) provide employment with benefits paid to employees;\n(2) provide employment where there are defined career paths for trainees;\n(3) pilot the development of an educational pathway that can be used on a continuing basis for transitioning persons from welfare to work; and\n(4) demonstrate the active participation of Department of Employment and Economic Development workforce centers, Minnesota State College and University institutions and other educational institutions, and local welfare agencies.\nPathways projects must demonstrate the active involvement and financial commitment of a participating business. Pathways projects must be matched with cash or in-kind contributions on at least a one-half-to-one ratio by a participating business.\nA single grant to any one institution shall not exceed $400,000. A portion of a grant may be used for preemployment training.\nThe board may collect and disseminate information concerning areas of projected employment need. The board may also prepare and publish studies, organize conferences, and conduct special projects which will increase knowledge and communication in the areas of employment need, skills training, and education.\n[Repealed, 1987 c 403 art 2 s 164]\n[Repealed, 2004 c 257 s 12]",
	"repealed": false
}