{
	"id": "123B.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.62",
	"title": "123B.62 BONDS FOR CERTAIN CAPITAL FACILITIES.",
	"text": "(a) In addition to other bonding authority, with approval of the commissioner, a district may issue general obligation bonds for certain capital projects under this section. The bonds must be used only to make capital improvements including:\n(1) under section 126C.10, subdivision 14, total operating capital revenue uses specified in clauses (4), (6), (7), (8), (9), and (10);\n(2) the cost of energy modifications;\n(3) improving disability accessibility to school buildings;\n(4) bringing school buildings into compliance with life and safety codes and fire codes; and\n(5) modifying buildings and equipment for security.\n(b) Before a district issues bonds under this subdivision, it must publish notice of the intended projects, the amount of the bond issue, and the total amount of district indebtedness.\n(c) A bond issue tentatively authorized by the board under this subdivision becomes finally authorized unless a petition signed by more than 15 percent of the registered voters of the district is filed with the school board within 30 days of the board's adoption of a resolution stating the board's intention to issue bonds. The percentage is to be determined with reference to the number of registered voters in the district on the last day before the petition is filed with the board. The petition must call for a referendum on the question of whether to issue the bonds for the projects under this section. The approval of 50 percent plus one of those voting on the question is required to pass a referendum authorized by this section.\n(d) The bonds must be paid off within 15 years of issuance. The bonds must be issued in compliance with chapter 475, except as otherwise provided in this section. A tax levy must be made for the payment of principal and interest on the bonds in accordance with section 475.61. The sum of the tax levies under this section and section 123B.61 for each year must not exceed the limit specified in section 123B.61. The levy for each year must be reduced as provided in section 123B.61. A district using an excess amount in the debt redemption fund to retire the bonds shall report the amount used for this purpose to the commissioner by July 15 of the following fiscal year. A district having an outstanding capital loan under section 126C.69 must not use an excess amount in the debt redemption fund to retire the bonds.\n(e) Notwithstanding paragraph (d), bonds issued by a district within the first five years following voter approval of a combination according to section 123A.37, subdivision 2, must be paid off within 20 years of issuance. All the other provisions and limitation of paragraph (d) apply.",
	"repealed": false
}