{
	"id": "144E.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.42",
	"title": "144E.42 COOPER/SAMS VOLUNTEER AMBULANCE TRUST; TRUST ACCOUNT.",
	"text": "There is established the Cooper/Sams volunteer ambulance trust.\n(a) There is established in the general fund the Cooper/Sams volunteer ambulance trust account and the Cooper/Sams volunteer ambulance award and account.\n(b) The trust account must be credited with:\n(1) general fund appropriations for that purpose;\n(2) transfers from the Cooper/Sams volunteer ambulance award and account; and\n(3) investment earnings on those accumulated proceeds. The assets and income of the trust account must be held and managed by the commissioner of management and budget and the State Board of Investment for the benefit of the state of Minnesota and its general creditors.\n(c) The Cooper/Sams volunteer ambulance account must be credited with transfers from the excess police state-aid holding account established in section 477C.03, subdivision 4, any per-year-of-service allocation under section 144E.45, subdivision 2, paragraph (c), that was not made for an individual, and investment earnings on those accumulated proceeds. The Cooper/Sams volunteer ambulance account must be managed by the commissioner of management and budget and the State Board of Investment. From the Cooper/Sams volunteer ambulance account to the trust account there must be transferred to the Cooper/Sams volunteer ambulance trust account, as the Cooper/Sams volunteer ambulance account balance permits, the following amounts:\n(1) an amount equal to any general fund appropriation to the Cooper/Sams volunteer ambulance trust account for that fiscal year; and\n(2) an amount equal to the percentage of the remaining balance in the account after the deduction of the amount under clause (1), as specified for the applicable fiscal year:\nThe state of Minnesota intends that this program, trust, and trust account not constitute a separate fund for any legal purpose, including the federal Internal Revenue Code, as amended, and the federal Employee Retirement Income Security Act of 1974, as amended. Qualified ambulance service personnel have only an unsecured promise of the state of Minnesota to pay a longevity award upon meeting entitlement requirements set forth in section 144E.46, and qualified ambulance service personnel meeting those entitlement requirements have the status of general unsecured creditors with respect to the Cooper/Sams volunteer ambulance award, if and when awarded.",
	"repealed": false
}