{
	"id": "331A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/331A.05",
	"title": "331A.05 FORM OF PUBLIC NOTICES.",
	"text": "All public notices shall be printed or otherwise disseminated in the English language.\nUnless otherwise specified by law, or by order of a court, publication of a public notice shall be as follows:\n(a) the notice shall be published once;\n(b) if the notice is intended to inform the public about a future event, the last publication shall occur not more than 30 days and not less than seven days before the event;\n(c) if the notice is intended to inform the public about a past action or event, the last publication shall occur not more than 45 days after occurrence of the action or event.\nExcept as otherwise directed by a particular statute requiring publication of a public notice or by order of a court, a public notice shall be printed in a type face no smaller than six point with a lowercase alphabet of at least 90 points. Larger type faces may be used.\nEvery public notice shall include a bold face title or caption in a body type no smaller than brevier or eight point referring to the content of the notice. Larger type faces may be used.\nThe governing body of a political subdivision may, to better inform the public, increase the frequency of publication of a public notice beyond the minimum required by a particular statute. It may use forms and styles for the notice as it deems appropriate, including the use of display advertisements and graphics. In addition to publication in the newspaper required to be designated under section 331A.04, it may publish or disseminate the notice in other newspapers and by means of standard and electronic mail. Regardless of whether a particular statute specifies \"legal notice,\" \"public notice,\" \"notice,\" or uses similar terms, the governing body may use whatever form for the published notice that it deems appropriate in order to adequately inform the public, subject to the requirements of sections 331A.01 to 331A.11. Nothing in the foregoing provisions of this subdivision shall require the governing body of a political subdivision to use the options described.\nNothing in this section shall invalidate or affect any statutory or charter provision imposing additional or special qualifications for publication of particular notices or proceedings.\nIf through no fault of the political subdivision, an error occurs in the publication of a public notice, the error shall have no effect on the validity of the event, action, or proceeding to which the public notice relates. In cases where the error is the fault of the newspaper, the political subdivision shall not be charged for the publication.\nIf a political subdivision elects to publish a summary of the political subdivision's financial statement or proceedings as authorized by other law, it must include with the published summary a notice stating that a copy of the full version of the financial statement or proceedings other than attachments to the minutes is available without cost at the offices of the political subdivision or by means of standard or electronic mail.",
	"repealed": false
}