{
	"id": "204C.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.15",
	"title": "204C.15 ASSISTANCE TO VOTERS.",
	"text": "A voter who claims a need for assistance because of inability to read English or physical inability to mark a ballot may obtain the aid of two election judges who are members of different major political parties. The election judges shall mark the ballots as directed by the voter and in as secret a manner as circumstances permit. A voter in need of assistance may alternatively obtain the assistance of any individual the voter chooses. Only the following persons may not provide assistance to a voter: the voter's employer, an agent of the voter's employer, or an officer or agent of the voter's union. The person who assists the voter shall, unaccompanied by an election judge, retire with that voter to a booth and mark the ballot as directed by the voter. Before the ballots are deposited, the voter may show them privately to an election judge to ascertain that they are marked as the voter directed. An election judge or other individual assisting a voter shall not in any manner request, persuade, induce, or attempt to persuade or induce the voter to vote for any particular political party or candidate. The election judges or other individuals who assist the voter shall not reveal to anyone the name of any candidate for whom the voter has voted or anything that took place while assisting the voter.\nAn individual who is unable to enter a polling place where paper ballots or an electronic voting system are used may register and vote without leaving a motor vehicle. Two election judges who are members of different major political parties shall assist the voter to register and to complete a voter's certificate and shall provide the necessary ballots. The voter may request additional assistance in marking ballots as provided in subdivision 1.\n[Repealed, 1Sp2001 c 10 art 18 s 44]\nIn all polling places two election judges shall assist a disabled voter to enter the polling place and go through the registration and voting lines. The voter may also request the assistance of election judges or any other individual in marking ballots, as provided in subdivision 1.",
	"repealed": false
}