{
	"id": "144G.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.70",
	"title": "144G.70 SERVICES.",
	"text": "An assisted living facility may not accept a person as a resident unless the facility has staff, sufficient in qualifications, competency, and numbers, to adequately provide the services agreed to in the assisted living contract.\n(a) Residents who are not receiving any assisted living services shall not be required to undergo an initial nursing assessment.\n(b) An assisted living facility shall conduct a nursing assessment by a registered nurse of the physical and cognitive needs of the prospective resident and propose a temporary service plan prior to the date on which a prospective resident executes a contract with a facility or the date on which a prospective resident moves in, whichever is earlier. If necessitated by either the geographic distance between the prospective resident and the facility, or urgent or unexpected circumstances, the assessment may be conducted using telecommunication methods based on practice standards that meet the resident's needs and reflect person-centered planning and care delivery.\n(c) Resident reassessment and monitoring must be conducted no more than 14 calendar days after initiation of services. Ongoing resident reassessment and monitoring must be conducted as needed based on changes in the needs of the resident and cannot exceed 90 calendar days from the last date of the assessment.\n(d) For residents only receiving assisted living services specified in section 144G.08, subdivision 9, clauses (1) to (5), the facility shall complete an individualized initial review of the resident's needs and preferences. The initial review must be completed within 30 calendar days of the start of services. Resident monitoring and review must be conducted as needed based on changes in the needs of the resident and cannot exceed 90 calendar days from the date of the last review.\n(e) A facility must inform the prospective resident of the availability of and contact information for long-term care consultation services under section 256B.0911, prior to the date on which a prospective resident executes a contract with a facility or the date on which a prospective resident moves in, whichever is earlier.\nWhen a facility initiates services and the individualized assessment required in subdivision 2 has not been completed, the facility must complete a temporary plan and agreement with the resident for services. A temporary service plan shall not be effective for more than 72 hours.\n(a) No later than 14 calendar days after the date that services are first provided, an assisted living facility shall finalize a current written service plan.\n(b) The service plan and any revisions must include a signature or other authentication by the facility and by the resident documenting agreement on the services to be provided. The service plan must be revised, if needed, based on resident reassessment under subdivision 2. The facility must provide information to the resident about changes to the facility's fee for services and how to contact the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities.\n(c) The facility must implement and provide all services required by the current service plan.\n(d) The service plan and the revised service plan must be entered into the resident record, including notice of a change in a resident's fees when applicable.\n(e) Staff providing services must be informed of the current written service plan.\n(f) The service plan must include:\n(1) a description of the services to be provided, the fees for services, and the frequency of each service, according to the resident's current assessment and resident preferences;\n(2) the identification of staff or categories of staff who will provide the services;\n(3) the schedule and methods of monitoring assessments of the resident;\n(4) the schedule and methods of monitoring staff providing services; and\n(5) a contingency plan that includes:\n(i) the action to be taken if the scheduled service cannot be provided;\n(ii) information and a method to contact the facility;\n(iii) the names and contact information of persons the resident wishes to have notified in an emergency or if there is a significant adverse change in the resident's condition, including identification of and information as to who has authority to sign for the resident in an emergency; and\n(iv) the circumstances in which emergency medical services are not to be summoned consistent with chapters 145B and 145C, and declarations made by the resident under those chapters.\nIf a facility reasonably believes that a resident is in need of another medical or health service, including a licensed health professional, or social service provider, the facility shall:\n(1) determine the resident's preferences with respect to obtaining the service; and\n(2) inform the resident of the resources available, if known, to assist the resident in obtaining services.\nAssisted living facilities may exercise the authority and are subject to the protections in section 152.34.\n(a) If a resident, family member, or other caregiver of the resident requests that a staff member or other agent of the facility discontinue a life-sustaining treatment, the staff member or agent receiving the request:\n(1) shall take no action to discontinue the treatment; and\n(2) shall promptly inform the supervisor or other agent of the facility of the resident's request.\n(b) Upon being informed of a request for discontinuance of treatment, the facility shall promptly:\n(1) inform the resident that the request will be made known to the physician, advanced practice registered nurse, or physician assistant who ordered the resident's treatment;\n(2) inform the physician, advanced practice registered nurse, or physician assistant of the resident's request; and\n(3) work with the resident and the resident's physician, advanced practice registered nurse, or physician assistant to comply with chapter 145C.\n(c) This section does not require the facility to discontinue treatment, except as may be required by law or court order.\n(d) This section does not diminish the rights of residents to control their treatments, refuse services, or terminate their relationships with the facility.\n(e) This section shall be construed in a manner consistent with chapter 145B or 145C, whichever applies, and declarations made by residents under those chapters.",
	"repealed": false
}