{
	"id": "424A.003",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.003",
	"title": "424A.003 CERTIFICATION OF SERVICE CREDIT.",
	"text": "(a) When a municipal fire department, a joint powers fire department, or an independent nonprofit firefighting corporation is directly associated with a firefighters relief association, the fire chief shall certify annually by March 31 the service credit for the previous calendar year of each volunteer firefighter and paid on-call firefighter rendering active service with the fire department.\n(b) The certification shall be made to an officer of the relief association's board of trustees and to the municipal clerk or clerk-treasurer of the largest municipality in population served by the associated fire department.\n(c) The fire chief shall notify each volunteer firefighter and paid on-call firefighter rendering active service with the fire department of the amount of service credit rendered by the firefighter for the previous calendar year. Upon request, the fire chief shall provide the firefighter with a written explanation and documentation to support the determination of service credit. The service credit notification and a description of the process and deadlines for the firefighter to challenge the fire chief's determination of service credit must be provided to the firefighter at least 21 days prior to its certification to the relief association and municipality. If the service credit amount is challenged, the fire chief shall accept and consider any additional pertinent information and shall make a final determination of service credit.\n(d) The service credit certification must be expressed as the number of completed months of the previous year during which an active volunteer firefighter or paid on-call firefighter rendered at least the minimum level of duties as specified and required by the fire department under the rules, regulations, and policies applicable to the fire department. No more than one year of service credit may be certified for a calendar year.\n(e) If a volunteer firefighter or paid on-call firefighter who is a member of the relief association leaves active firefighting service to render active military service that is required to be governed by the federal Uniformed Services Employment and Reemployment Rights Act, as amended, the firefighter must be certified as providing service credit for the period of the military service, up to the applicable limit of the federal Uniformed Services Employment and Reemployment Rights Act. If the volunteer firefighter or paid on-call firefighter does not return from the military service in compliance with the federal Uniformed Services Employment and Reemployment Rights Act, the service credits applicable to that military service credit period are forfeited and canceled at the end of the calendar year in which the time limit set by federal law occurs.",
	"repealed": false
}