{
	"id": "116J.423",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.423",
	"title": "116J.423 MINNESOTA 21ST CENTURY FUND.",
	"text": "The Minnesota 21st century fund is created as a separate account in the treasury. Money in the account is appropriated to the commissioner of employment and economic development for the purposes of this section. All money earned by the account, loan repayments of principal and interest, and earnings on investments must be credited to the account. For the purpose of this section, \"fund\" means the Minnesota 21st century fund. The commissioner shall operate the account as a revolving account.\nThe commissioner shall use money in the fund to make loans, including forgivable loans, equity investments, or grants for infrastructure in mineral, steel, or any other industry processing, production, manufacturing, or technology project that would enhance the economic diversification and that is located within the taconite assistance area as defined under section 273.1341. The commissioner must, prior to making any loans or equity investments and after consultation with industry and public officials, develop a strategy for making loans, equity investments, or grants for infrastructure that assists the taconite assistance area in retaining and enhancing its economic competitiveness. Money in the fund may also be used to pay for the costs of carrying out the commissioner's due diligence duties under this section.\nNotwithstanding subdivision 2, the commissioner may use money in the fund to make grants to a municipality or county, or to a county regional rail authority as appropriate, for public infrastructure needed to support an eligible project under this section. Grant money may be used by the municipality, county, or regional rail authority to acquire right-of-way and mitigate loss of wetlands and runoff of stormwater; to predesign, design, construct, and equip roads and rail lines; and, in cooperation with municipal utilities, to predesign, design, construct, and equip natural gas pipelines, electric infrastructure, water supply systems, and wastewater collection and treatment systems. Grants made under this subdivision are available until expended.\nThe commissioner, prior to making a commitment for a loan or equity investment must, at a minimum, conduct due diligence research regarding the proposed loan or equity investment, including contracting with professionals as needed to assist in the due diligence.\nThe commissioner may make conditional commitments for loans or equity investments but disbursements of funds pursuant to a commitment may not be made until commitments for the remainder of a project's funding are made that are satisfactory to the commissioner and disbursements made from the other commitments sufficient to protect the interests of the state in its loan or investment.\nThe commissioner may provide loans or equity investments that match, in a proportion determined by the commissioner, an investment made by the owner of a facility.",
	"repealed": false
}