{
	"id": "216B.687",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.687",
	"title": "216B.687 MERCURY EMISSIONS REDUCTION IMPLEMENTATION, OPERATION.",
	"text": "The agency shall establish the mercury emissions reduction for each targeted unit included in a plan approved under section 216B.685, or where applicable, for each targeted and supplemental unit included in a plan approved under section 216B.6851.\n(a) Except as required by federal regulation, any mercury reduction incorporated into the permit for a targeted unit as established under a plan approved under section 216B.685, or where applicable, for each targeted and supplemental unit included in a plan approved under section 216B.6851, must be a state-only condition of the permit and will not be enforced by the agency during the start-up period.\n(b) After the start-up period ends, the Pollution Control Agency shall incorporate into the permit the mercury reduction reasonably expected to be achieved at each unit or facility as an enforceable state-only reduction. For a qualifying facility with multiple units that has one or more units included in approved plans, the agency may establish the mercury emissions reduction for the facility covering all targeted and supplemental units at that facility after the start-up periods for all units have concluded, and the actual mercury emissions for the units have been determined. In setting the reduction, the agency shall give due consideration to the results of monitoring before implementation of the plan, the results of monitoring during the start-up period, and any factors that may impact the performance of the unit for the next five years.\nThe agency shall revise the unit's air permit every five years to ensure optimal mercury emissions reduction by equipment installed under an approved plan, in light of technical and operational advances made since the date of plan approval. In revising the unit's air permit, the agency may recommend, but shall not require, additional investments in pollution control equipment, or the removal of equipment installed pursuant to an approved plan. The utility may seek commission review of the costs associated with a permit requirement or request for equipment optimization proposed by the agency and, if review is requested, the revision is not effective until approved by the commission. The commission shall approve the revision unless the utility or other party shows that it will impose excessive consumer costs.",
	"repealed": false
}