{
	"id": "289A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.12",
	"title": "289A.12 FILING REQUIREMENTS FOR INFORMATION RETURNS AND REPORTS.",
	"text": "[Repealed, 1992 c 511 art 7 s 26]\nThe commissioner may by notice and demand require a bank maintaining a common trust fund to file with the commissioner a return for a taxable year, stating specifically with respect to the fund, the items of gross income and deductions provided by section 290.281, subdivision 1. The return must include the names and addresses of the participants entitled to share the net income if distributed and the amount of the proportionate share of each participant.\n(a) Partnerships must file a return with the commissioner for each taxable year. The return must conform to the requirements of section 290.311, and must include the names and addresses of the partners entitled to a distributive share in their taxable net income, gain, loss, or credit, and the amount of the distributive share to which each is entitled. A partnership required to file a return for a partnership taxable year must furnish a copy of the information required to be shown on the return to a person who is a partner at any time during the taxable year, on or before the day on which the return for the taxable year was filed.\n(b) The fiduciary of an estate or trust making the return required to be filed under section 289A.08, subdivision 2, for a taxable year must give a beneficiary who receives a distribution from the estate or trust with respect to the taxable year or to whom any item with respect to the taxable year is allocated, a statement containing the information required to be shown on the return, on or before the date on which the return was filed.\n(c) An S corporation must file a return with the commissioner for a taxable year during which an election under section 290.9725 is in effect, stating specifically the names and addresses of the persons owning stock in the corporation at any time during the taxable year, the number of shares of stock owned by a shareholder at all times during the taxable year, the shareholder's pro rata share of each item of the corporation for the taxable year, and other information the commissioner requires. An S corporation required to file a return under this paragraph for any taxable year must furnish a copy of the information shown on the return to the person who is a shareholder at any time during the taxable year, on or before the day on which the return for the taxable year was filed.\n(d) The partnership or S corporation return must be signed by someone designated by the partnership or S corporation.\n(a) The commissioner may by notice and demand require to the extent required by section 6041 of the Internal Revenue Code, a person, corporation, or cooperative, the state of Minnesota and its political subdivisions, and a city, county, and school district in Minnesota, making payments in the regular course of a trade or business during the taxable year to any person or corporation of $600 or more on account of rents or royalties, or of $10 or more on account of interest, or $10 or more on account of dividends or patronage dividends, or $600 or more on account of either wages, salaries, commissions, fees, prizes, awards, pensions, annuities, or any other fixed or determinable gains, profits or income, not otherwise reportable under section 289A.09, subdivision 2, or on account of earnings of $10 or more distributed to its members by savings associations or credit unions chartered under the laws of this state or the United States, (1) to file with the commissioner a return (except in cases where a valid agreement to participate in the combined federal and state information reporting system has been entered into, and the return is filed only with the commissioner of internal revenue under the applicable filing and informational reporting requirements of the Internal Revenue Code) with respect to the payments in excess of the amounts named, giving the names and addresses of the persons to whom the payments were made, the amounts paid to each, and (2) to make a return with respect to the total number of payments and total amount of payments, for each category of income named, which were in excess of the amounts named. This subdivision does not apply to the payment of interest or dividends to a person who was a nonresident of Minnesota for the entire year.\n(b) For payments for which a return is covered by paragraph (a), regardless of whether the commissioner has required filing under paragraph (a), the payor must file a copy of the return with the commissioner if:\n(1) the return is for a payment made to a Minnesota resident, to a recipient with a Minnesota address, or for activity occurring in the state of Minnesota; and\n(2) the payment is for wages, salaries, or other compensation for services provided. The commissioner may require this information to be filed in electronic or another form that the commissioner determines is appropriate, notwithstanding the provisions of paragraph (c).\n(c) A person, corporation, or cooperative required to file returns under this subdivision must file the returns on magnetic media if magnetic media was used to satisfy the federal reporting requirement under section 6011(e) of the Internal Revenue Code, unless the person establishes to the satisfaction of the commissioner that compliance with this requirement would be an undue hardship.\nThe commissioner may, within 30 days after notice and demand, require a person doing business as a broker to give the commissioner the names and addresses of customers for whom they have transacted business, and the details regarding gross proceeds and other information concerning the transactions as will enable the commissioner to determine whether the income tax due on profits or gains of those customers has been paid. The provisions of section 6045 of the Internal Revenue Code which define terms and require that a statement be furnished to the customer apply.\nThe commissioner may, within 30 days after notice and demand, require a person acting as agent for another to make a return furnishing the information reasonably necessary to properly assess and collect the tax imposed by chapter 290 upon the person for whom the agent acts.\nThe commissioner may by notice and demand require a person or corporation required to make a return under section 6039C (relating to information return on a foreign person holding a United States real property interest) of the Internal Revenue Code to make a similar return for the commissioner for foreign persons holding a Minnesota real property interest.\nThe commissioner may by notice and demand require a person who makes payments of unemployment benefits totaling $10 or more to any individual during a calendar year and who is required to make and file a return under section 6050B of the Internal Revenue Code to file a copy of the return with the commissioner.\nThe commissioner may by notice and demand require a person who is required to make a return under section 6041A (relating to information returns regarding payments of remuneration for services and direct sales) of the Internal Revenue Code to file a copy of the return containing the information required under that section with the commissioner. The provisions of that section govern the requirements of a statement that must be given to persons with respect to whom information is required to be given.\nThe commissioner may by notice and demand require the appropriate federal official who is required to make a return under section 6050F (relating to Social Security benefits) of the Internal Revenue Code to file a copy of the return containing the information required under that section with the commissioner.\nThe commissioner may by notice and demand require the trustee of an individual retirement account and the issuer of an endowment contract or an individual retirement annuity who is required to make a report under section 408(i) of the Internal Revenue Code to file with the commissioner a copy of that report containing the information required under that subsection. The provisions of that subsection govern when the reports are to be filed and the requirements of a statement that must be given to persons with respect to whom information must be given.\nA person who can be required to file a return with the commissioner under subdivisions 4 to 10 must furnish to a person whose name is set forth in the return a written statement showing the name and address of the person making the return, and the aggregate amount of payments to the person shown on the return.\nThis written statement must be given to the person on or before January 31 of the year following the calendar year for which the return was made.\nAn individual with respect to whom a return, statement, or other document is required under this section to be made by another person must furnish to that person the individual's Social Security account number. A person required under this section to make a return, statement, or other document with respect to another person who is an individual must request from that individual and must include in the return, statement, or other document the individual's Social Security account number. A return of an estate or trust with respect to its liability for tax, and any statement or other document in its support, is considered a return, statement, or other document with respect to the individual beneficiary of the estate or trust; otherwise, a return of an individual with respect to the individual's liability for tax, or any statement or other document in its support, is not considered a return, statement, or other document with respect to another person.\n(a) A regulated investment company paying $10 or more in exempt-interest dividends to an individual who is a resident of Minnesota, or any person receiving $10 or more of exempt interest or exempt-interest dividends and paying as nominee to an individual who is a resident of Minnesota, must make a return indicating the amount of the exempt interest or exempt-interest dividends, the name, address, and Social Security number of the recipient, and any other information that the commissioner specifies. The return must be provided to the recipient by February 15 of the year following the year of the payment. The return provided to the recipient must include a clear statement, in the form prescribed by the commissioner, that the exempt interest or exempt-interest dividends must be included in the computation of Minnesota taxable income. By June 1 of each year, the payer must file a copy of the return with the commissioner.\n(b) For purposes of this subdivision, the following definitions apply.\n(1) \"Exempt-interest dividends\" mean exempt-interest dividends as defined in section 852(b)(5) of the Internal Revenue Code, but does not include the portion of exempt-interest dividends that are not required to be added to federal adjusted gross income under section 290.0131, subdivision 2, paragraph (b).\n(2) \"Regulated investment company\" means regulated investment company as defined in section 851(a) of the Internal Revenue Code or a fund of the regulated investment company as defined in section 851(g) of the Internal Revenue Code.\n(3) \"Exempt interest\" means income on obligations of any state other than Minnesota, or a political or governmental subdivision, municipality, or governmental agency or instrumentality of any state other than Minnesota, and exempt from federal income taxes under the Internal Revenue Code or any other federal statute.\n(a) By October 15 of each year, every qualified business, as defined under section 469.310, subdivision 11, must file with the commissioner, on a form prescribed by the commissioner, a report listing the tax benefits under section 469.315 received by the business for the previous year.\n(b) The commissioner shall send notice to each business that fails to timely submit the report required under paragraph (a). The notice shall demand that the business submit the report within 60 days. Where good cause exists, the commissioner may extend the period for submitting the report as long as a request for extension is filed by the business before the expiration of the 60-day period. The commissioner shall notify the commissioner of employment and economic development and the appropriate job opportunity subzone administrator whenever notice is sent to a business under this paragraph.\n(c) A business that fails to submit the report as required under paragraph (b) is no longer a qualified business under section 469.310, subdivision 11, and is subject to the repayment provisions of section 469.319.\nThe commissioner may by notice and demand require a qualified intermediary to file a return relating to transactions for which the intermediary acted to facilitate exchanges under section 1031 of the Internal Revenue Code. The return must include the name, address, and state or federal tax identification number or Social Security number of each of the parties to the exchange, information relating to the property subject to the exchange, and any other information required by the commissioner.\n(a) A third-party payer of sick pay benefits who withholds income tax from the sick pay of an employee as agent for the employer of the employee, and who remits that withholding tax to the commissioner must file an annual report on a form prescribed by the commissioner. The report must include the name and tax identification number of each employer for whom the payer has made sick pay payments and the name, Social Security number, amount of sick pay paid, and amount of tax withheld for each employee.\n(b) The report must be filed with the commissioner on or before February 28 of the year following the year in which the sick pay benefits were paid.\n(c) The report required by this subdivision does not need to be filed if the third-party payer, rather than the employer, has provided to the employee the annual statement required under section 289A.09, subdivision 2, that includes the sick pay benefits paid and the tax withheld.\nA qualified heir, as defined in section 291.03, subdivision 8, paragraph (c), must file two returns with the commissioner attesting that no disposition or cessation as provided by section 291.03, subdivision 11, paragraph (a), occurred. The first return must be filed no earlier than 24 months and no later than 26 months after the decedent's death. The second return must be filed no earlier than 36 months and no later than 39 months after the decedent's death.",
	"repealed": false
}