{
	"id": "297F.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.20",
	"title": "297F.20 CRIMINAL PENALTIES.",
	"text": "(a) A person or consumer required to file a return, report, or other document with the commissioner who fails to do so is guilty of a misdemeanor.\n(b) A person or consumer required to pay or to collect and remit a tax under this chapter, who fails to do so when required, is guilty of a misdemeanor.\n(a) A person or consumer required to file a return, report, or other document with the commissioner, who knowingly, rather than accidentally, inadvertently, or negligently, fails to file it when required, is guilty of a gross misdemeanor.\n(b) A person or consumer required to pay or to collect and remit a tax under this chapter, who knowingly, rather than accidentally, inadvertently, or negligently, fails to file it when required, is guilty of a gross misdemeanor.\n(a) A person or consumer who files with the commissioner a return, report, or other document, or who maintains or provides invoices subject to review by the commissioner under this chapter, known by the person or consumer to be fraudulent or false concerning a material matter, is guilty of a felony.\n(b) A person or consumer who knowingly aids or assists in, or advises in the preparation or presentation of a return, report, invoice, or other document that is fraudulent or false concerning a material matter, whether or not the falsity or fraud is committed with the knowledge or consent of the person or consumer authorized or required to present the return, report, invoice, or other document, is guilty of a felony.\nAny person who makes, alters, forges, or counterfeits a stamp, or who possesses an altered, forged, or counterfeit stamp is guilty of a felony.\n(a) Except as provided in paragraph (b), whenever a package of cigarettes is found in the place of business or in the possession of any person without a proper stamp affixed as required by this chapter, it is presumed that those cigarettes are kept there or held by that person illegally.\n(b) This presumption does not apply to:\n(1) cigarettes in the place of business or in the possession of a licensed distributor;\n(2) cigarettes in the possession of a common carrier or sleeping car company engaged in interstate commerce;\n(3) cigarettes held in a public warehouse of first destination in this state, in the unbroken, original shipping containers, subject to delivery or shipping instructions from the manufacturer or a distributor;\n(4) cigarettes in the possession of a person other than a distributor in quantities of 200 cigarettes or less, when those cigarettes have had the individual packages or seals broken, and when they are intended for personal use and not to be sold or offered for sale;\n(5) cigarettes sold under circumstances in which the tax cannot legally be imposed because of the laws or Constitution of the United States.\n(a) A person, other than a licensed distributor or a consumer, who possesses, receives, or transports fewer than 5,000 unstamped cigarettes, or up to $350 worth of untaxed tobacco products is guilty of a misdemeanor.\n(b) A person, other than a licensed distributor or a consumer, who possesses, receives, or transports 5,000 or more, but fewer than 20,001 unstamped cigarettes, or more than $350 but less than $1,400 worth of untaxed tobacco products is guilty of a gross misdemeanor.\n(c) A person, other than a licensed distributor or a consumer, who possesses, receives, or transports more than 20,000 unstamped cigarettes, or $1,400 or more worth of untaxed tobacco products is guilty of a felony.\n(d) For purposes of this subdivision, an individual in possession of more than 4,999 unstamped cigarettes, or more than $350 worth of untaxed tobacco products, is presumed not to be a consumer.\n(a) A retailer doing business off of an Indian reservation who sells or offers to sell more than 200 but fewer than 5,000 cigarettes with Indian stamps is guilty of a misdemeanor.\n(b) A retailer doing business off of an Indian reservation who sells or offers to sell 5,000 or more, but fewer than 20,001 cigarettes with Indian stamps is guilty of a gross misdemeanor.\n(c) A retailer doing business off of an Indian reservation who sells or offers to sell more than 20,000 cigarettes with Indian stamps is guilty of a felony.\nA person selling cigarettes or tobacco products after the person's license has been revoked is guilty of a felony.\n(a) No retailer or subjobber shall purchase cigarettes or tobacco products from any person who is not licensed under section 297F.03 as a licensed distributor or subjobber.\n(b) A retailer or subjobber who purchases from an unlicensed seller fewer than 5,000 cigarettes or up to $350 worth of tobacco products is guilty of a misdemeanor.\n(c) A retailer or subjobber who purchases from an unlicensed seller 5,000 or more, but fewer than 20,001 cigarettes or more than $350 but less than $1,400 worth of tobacco products is guilty of a gross misdemeanor.\n(d) A retailer or subjobber who purchases from an unlicensed seller more than 20,000 cigarettes or $1,400 or more worth of tobacco products is guilty of a felony.\nCriminal penalties imposed by this section are in addition to any civil penalties imposed by this chapter.\nNotwithstanding section 628.26, or any other provision of the criminal laws of this state, an indictment may be found and filed, or a complaint filed, upon a criminal offense named in this section, in the proper court within six years after the offense is committed.\nA violation of this chapter unless otherwise specified is a misdemeanor.",
	"repealed": false
}