{
	"id": "142B.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.12",
	"title": "142B.12 FEES.",
	"text": "(a) Unless exempt under paragraph (b), the commissioner shall charge a fee for evaluation of applications and inspection of programs that are licensed under this chapter.\n(b) Except as provided under subdivision 2, no application or license fee shall be charged for child foster care or family and group family child care.\n(a) A county agency may charge a license fee to an applicant or license holder not to exceed $50 for a one-year license or $100 for a two-year license.\n(b) Counties may allow providers to pay the applicant fee in paragraph (a) on an installment basis for up to one year. If the provider is receiving child care assistance payments from the state, the provider may have the fee under paragraph (a) deducted from the child care assistance payments for up to one year and the state shall reimburse the county for the county fees collected in this manner.\n(a) For fees required under subdivision 1, an applicant for an initial license issued by the commissioner shall submit a $500 application fee with each new application required under this subdivision. The application fee shall not be prorated, is nonrefundable, and is in lieu of the annual license fee that expires on December 31. The commissioner shall not process an application until the application fee is paid.\n(b) An applicant shall apply for a license to provide services at a specific location, except an applicant for a license for a private agency to provide foster care or adoption services under Minnesota Rules, parts 9545.0755 to 9545.0845, shall submit a single application to provide services statewide.\n(a) Child care centers shall pay an annual nonrefundable license fee based on the following schedule:\n(b) A private agency licensed to provide foster care and adoption services under Minnesota Rules, parts 9545.0755 to 9545.0845, shall pay an annual nonrefundable license fee of $875.\nThe commissioner shall not issue or reissue a license until the license fee is paid. The commissioner shall send a bill for the license fee to the billing address identified by the license holder. If the license holder does not submit the license fee payment by the due date, the commissioner shall send the license holder a past due notice. If the license holder fails to pay the license fee by the due date on the past due notice, the commissioner shall send a final notice to the license holder informing the license holder that the program license will expire on December 31 unless the license fee is paid before December 31. If a license expires, the program is no longer licensed and, unless exempt from licensure under section 142B.05, subdivision 2, must not operate after the expiration date. After a license expires, if the former license holder wishes to provide licensed services, the former license holder must submit a new license application and application fee under subdivision 3.\nNotwithstanding section 16A.1285, subdivision 2, related to activities for which the commissioner charges a fee, the commissioner must plan to fully recover direct expenditures for licensing activities under this chapter over a five-year period. The commissioner may have anticipated expenditures in excess of anticipated revenues in a biennium by using surplus revenues accumulated in previous bienniums.\nA children, youth, and families licensing account is created in the state government special revenue fund. Fees collected under subdivisions 3 and 4 must be deposited in the children, youth, and families licensing account and are annually appropriated to the commissioner for licensing activities authorized under this chapter.\nThe commissioner shall not reissue a license until the license holder has paid all outstanding debts related to a licensing fine or settlement agreement for which payment is delinquent. If the payment is past due, the commissioner shall send a past due notice informing the license holder that the program license will expire on December 31 unless the outstanding debt is paid before December 31. If a license expires, the program is no longer licensed and must not operate after the expiration date. After a license expires, if the former license holder wishes to provide licensed services, the former license holder must submit a new license application and application fee under subdivision 3.",
	"repealed": false
}