{
	"id": "148B.371",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.371",
	"title": "148B.371 COMPLAINTS; INVESTIGATION HEARINGS.",
	"text": "In all matters relating to the board's lawful regulatory activities, the board may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary materials. Any person failing or refusing to appear to testify regarding any matter about which the person may be lawfully questioned or failing to produce any papers, books, records, documents, or other evidentiary materials in the matter to be heard, after having been required by order of the board or by a subpoena of the board to do so may, upon application to the district court in any district, be ordered to comply with the subpoena or order. Any board member may administer oaths to witnesses or take their affirmation. Depositions may be taken within or without the state in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process or paper may be served upon a person it names anywhere within the state by any officer authorized to serve subpoenas or other process or paper in civil actions in the same manner as prescribed by law for service of process issued out of the district court of this state.\nThe board shall maintain any records, other than client records, obtained as part of an investigation as investigative data under section 13.41. Client records are classified as private under chapter 13 and must be protected as such in the records of the board and in administrative or judicial proceedings unless the client authorizes the board in writing to make public the identity of the client or a portion or all of the client's records.\nIf the board has probable cause to believe that an applicant or licensee has engaged in conduct prohibited by section 214.10, or statute or rule enforced by the board, the board may issue an order directing the applicant or licensee to submit to a mental or physical examination or substance use disorder evaluation. For the purpose of this section, every applicant or licensee is considered to have consented to submit to a mental or physical examination or substance use disorder evaluation when ordered to do so in writing by the board and to have waived all objections to the admissibility of the examiner's or evaluator's testimony or reports on the grounds that the testimony or reports constitute a privileged communication.\n(a) Failure to submit to an examination or evaluation when ordered, unless the failure was due to circumstances beyond the control of the applicant or licensee, constitutes an admission that the applicant or licensee violated section 214.10, or statute or rule enforced by the board, based on the factual specifications in the examination or evaluation order, and may result in an application being denied or a default and final disciplinary order being entered after a contested case hearing. The only issues to be determined at the hearing are whether the designated board member had probable cause to issue the examination or evaluation order and whether the failure to submit was due to circumstances beyond the control of the applicant or licensee. Neither the record of a proceeding under this subdivision nor the orders entered by the board are admissible, subject to subpoena, or to be used against the applicant or licensee in a proceeding in which the board is not a party or decision maker.\n(b) Information obtained under this subdivision is classified as private under chapter 13 and the orders issued by the board as the result of an applicant or licensee to submit to an examination or evaluation are classified as public.\nIn addition to ordering a physical or mental examination or substance use disorder evaluation and notwithstanding section 13.384, 144.651, 595.02, or any other law limiting access to medical or other health records, the board may obtain data and health records relating to an applicant or licensee without the applicant's or licensee's consent if the board has probable cause to believe that an applicant or licensee has engaged in conduct prohibited by section 214.10, or statute or rule enforced by the board. An applicant, licensee, insurance company, health care facility, provider as defined in section 144.291, subdivision 2, paragraph (i), or government agency shall comply with any written request of the board under this subdivision and is not liable in any action for damages for releasing the data requested by the board if the data are released in accordance with a written request made under this subdivision, unless the information is false and the person or entity giving the information knew or had reason to know that the information was false. Information on individuals obtained under this section is investigative data under section 13.41.\nIn addition to any other remedy provided by law, the board may, acting through its designated board member and without a hearing, temporarily suspend the right of a licensee to practice if the board member finds that the licensee has violated a statute or rule that the board is empowered to enforce and that continued practice by the licensee would create a serious risk of harm to others. The suspension is in effect upon service of a written order on the licensee specifying the statute or rule violated. The order remains in effect until the board issues a final order in the matter after a hearing or upon agreement between the board and the licensee. Service of the order is effective if the order is served on the licensee or counsel of record personally or by first class mail to the most recent address provided to the board for the licensee or the counsel of record. Within ten days of service of the order, the board shall hold a hearing before its own members on the sole issue of whether there is a reasonable basis to continue, modify, or lift the suspension. Evidence presented by the board or licensee may be in affidavit form only. The licensee or the counsel of record may appear for oral argument. Within five working days after the hearing, the board shall issue its order and, if the suspension is continued, schedule a contested case hearing within 45 days after issuance of the order. The administrative law judge shall issue a report within 30 days after closing of the contested case hearing record. The board shall issue a final order within 30 days after receipt of that report.\nThe right to practice is automatically suspended if (1) a guardian of a licensee is appointed by order of a court under sections 524.5-101 to 524.5-502, or (2) the licensee is committed by order of a court pursuant to chapter 253B. The right to practice remains suspended until the licensee is restored to capacity by a court and, upon petition by the licensee, the suspension is terminated by the board after a hearing or upon agreement between the board and the licensee. In its discretion, the board may restore and reissue permission to provide services, but as a condition of the permission may impose a disciplinary or corrective measure that it might originally have imposed.\n(a) The board may in its own name issue a cease and desist order to stop a person from engaging in an unauthorized practice or violating or threatening to violate a statute, rule, or order which the board has issued or is empowered to enforce. The cease and desist order must state the reason for its issuance and give notice of the person's right to request a hearing under sections 14.57 to 14.62. If, within 15 days of service of the order, the subject of the order fails to request a hearing in writing, the order is the final order of the board and is not reviewable by a court or agency.\n(b) A hearing must be initiated by the board not later than 30 days from the date of the board's receipt of a written hearing request. Within 30 days of receipt of the administrative law judge's report, the board shall issue a final order modifying, vacating, or making permanent the cease and desist order as the facts require. The final order remains in effect until modified or vacated by the board.\n(c) When a request for a stay accompanies a timely hearing request, the board may, in its discretion, grant the stay. If the board does not grant a requested stay, it shall refer the request to the Office of Administrative Hearings within three working days of receipt of the request. Within ten days after receiving the request from the board, an administrative law judge shall issue a recommendation to grant or deny the stay. The board shall grant or deny the stay within five days of receiving the administrative law judge's recommendation.\n(d) In the event of noncompliance with a cease and desist order, the board may institute a proceeding in Ramsey County District Court to obtain injunctive relief or other appropriate relief, including a civil penalty payable to the board not exceeding $10,000 for each separate violation.\nIn addition to any other remedy provided by law, including the issuance of a cease and desist order under subdivision 1, the board may in its own name bring an action in Ramsey County District Court for injunctive relief to restrain any unauthorized practice or violation or threatened violation of any statute, rule, or order which the board is empowered to regulate, enforce, or issue. A temporary restraining order must be granted in the proceeding if continued activity by a licensee would create a serious risk of harm to others. The board need not show irreparable harm.\nThe issuance of a cease and desist order or injunctive relief granted under this section does not relieve a licensee from criminal prosecution by a competent authority or from disciplinary action by the board. Nothing in this section limits the board's authority to seek injunctive relief under section 214.11.",
	"repealed": false
}