{
	"id": "62A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.04",
	"title": "62A.04 STANDARD PROVISIONS.",
	"text": "(a) Any reference to \"standard provisions\" which may appear in other sections and which refer to accident and sickness or accident and health insurance shall hereinafter be construed as referring to accident and sickness policy provisions.\n(b) Notwithstanding paragraph (a), the following do not apply to health plans:\n(1) subdivision 2, clauses (5) to (10) and (12);\n(2) subdivision 3, clauses (1) and (3) to (7); and\n(3) subdivisions 6 and 10.\nExcept as provided in subdivision 4 each such policy delivered or issued for delivery to any person in this state shall contain the provisions specified in this subdivision in the words in which the same appear in this section. The insurer may, at its option, substitute for one or more of such provisions corresponding provisions of different wording approved by the commissioner which are in each instance not less favorable in any respect to the insured or the beneficiary. Such provisions shall be preceded individually by the caption appearing in this subdivision or, at the option of the insurer, by such appropriate individual or group captions or subcaptions as the commissioner may approve.\n(1) A provision as follows:\nENTIRE CONTRACT; CHANGES: This policy, including the endorsements and the attached papers, if any, constitutes the entire contract of insurance. No change in this policy shall be valid until approved by an executive officer of the insurer and unless such approval be endorsed hereon or attached hereto. No agent has authority to change this policy or to waive any of its provisions.\n(2) A provision as follows:\nTIME LIMIT ON CERTAIN DEFENSES: (a) After two years from the date of issue of this policy no misstatements, except fraudulent misstatements, made by the applicant in the application for such policy shall be used to void the policy or to deny a claim for loss incurred or disability (as defined in the policy) commencing after the expiration of such two year period.\nThe foregoing policy provision shall not be so construed as to affect any legal requirement for avoidance of a policy or denial of a claim during such initial two year period, nor to limit the application of clauses (1), (2), (3), (4) and (5), in the event of misstatement with respect to age or occupation or other insurance. A policy which the insured has the right to continue in force subject to its terms by the timely payment of premium (1) until at least age 50 or, (2) in the case of a policy issued after age 44, for at least five years from its date of issue, may contain in lieu of the foregoing the following provisions (from which the clause in parentheses may be omitted at the insurer's option) under the caption \"INCONTESTABLE\":\nAfter this policy has been in force for a period of two years during the lifetime of the insured (excluding any period during which the insured is disabled), it shall become incontestable as to the statements contained in the application.\n(b) No claim for loss incurred or disability (as defined in the policy) commencing after two years from the date of issue of this policy shall be reduced or denied on the ground that a disease or physical condition not excluded from coverage by name or specific description effective on the date of loss had existed prior to the effective date of coverage of this policy.\n(3)(a) Except as required for qualified health plans sold through MNsure to individuals receiving advance payments of the premium tax credit, a provision as follows:\nGRACE PERIOD: A grace period of ..... (insert a number not less than \"7\" for weekly premium policies, \"10\" for monthly premium policies and \"31\" for all other policies) days will be granted for the payment of each premium falling due after the first premium, during which grace period the policy shall continue in force.\nA policy which contains a cancellation provision may add, at the end of the above provision,\nsubject to the right of the insurer to cancel in accordance with the cancellation provision hereof.\nA policy in which the insurer reserves the right to refuse any renewal shall have, at the beginning of the above provision,\nUnless not less than five days prior to the premium due date the insurer has delivered to the insured or has mailed to the insured's last address as shown by the records of the insurer written notice of its intention not to renew this policy beyond the period for which the premium has been accepted.\n(b) For qualified health plans sold through MNsure to individuals receiving advance payments of the premium tax credit, a grace period provision must be included that complies with the Affordable Care Act and is no less restrictive than the grace period required by the Affordable Care Act.\n(4) A provision as follows:\nREINSTATEMENT: If any renewal premium be not paid within the time granted the insured for payment, a subsequent acceptance of premium by the insurer or by any agent duly authorized by the insurer to accept such premium, without requiring in connection therewith an application for reinstatement, shall reinstate the policy. If the insurer or such agent requires an application for reinstatement and issues a conditional receipt for the premium tendered, the policy will be reinstated upon approval of such application by the insurer or, lacking such approval, upon the forty-fifth day following the date of such conditional receipt unless the insurer has previously notified the insured in writing of its disapproval of such application. For health plans described in section 62A.011, subdivision 3, clause (10), an insurer must accept payment of a renewal premium and reinstate the policy, if the insured applies for reinstatement no later than 60 days after the due date for the premium payment, unless:\n(1) the insured has in the interim left the state or the insurer's service area; or\n(2) the insured has applied for reinstatement on two or more prior occasions.\nThe reinstated policy shall cover only loss resulting from such accidental injury as may be sustained after the date of reinstatement and loss due to such sickness as may begin more than ten days after such date. In all other respects the insured and insurer shall have the same rights thereunder as they had under the policy immediately before the due date of the defaulted premium, subject to any provisions endorsed hereon or attached hereto in connection with the reinstatement. Any premium accepted in connection with a reinstatement shall be applied to a period for which premium has not been previously paid, but not to any period more than 60 days prior to the date of reinstatement. The last sentence of the above provision may be omitted from any policy which the insured has the right to continue in force subject to its terms by the timely payment of premiums (1) until at least age 50, or, (2) in the case of a policy issued after age 44, for at least five years from its date of issue.\n(5) A provision as follows:\nNOTICE OF CLAIM: Written notice of claim must be given to the insurer within 20 days after the occurrence or commencement of any loss covered by the policy, or as soon thereafter as is reasonably possible. Notice given by or on behalf of the insured or the beneficiary to the insurer at ..... (insert the location of such office as the insurer may designate for the purpose), or to any authorized agent of the insurer, with information sufficient to identify the insured, shall be deemed notice to the insurer.\nIn a policy providing a loss-of-time benefit which may be payable for at least two years, an insurer may at its option insert the following between the first and second sentences of the above provision:\nSubject to the qualifications set forth below, if the insured suffers loss of time on account of disability for which indemnity may be payable for at least two years, the insured shall, at least once in every six months after having given notice of claim, give to the insurer notice of continuance of said disability, except in the event of legal incapacity. The period of six months following any filing of proof by the insured or any payment by the insurer on account of such claim or any denial of liability in whole or in part by the insurer shall be excluded in applying this provision. Delay in the giving of such notice shall not impair the insured's right to any indemnity which would otherwise have accrued during the period of six months preceding the date on which such notice is actually given.\n(6) A provision as follows:\nCLAIM FORMS: The insurer, upon receipt of a notice of claim, will furnish to the claimant such forms as are usually furnished by it for filing proofs of loss. If such forms are not furnished within 15 days after the giving of such notice the claimant shall be deemed to have complied with the requirements of this policy as to proof of loss upon submitting, within the time fixed in the policy for filing proofs of loss, written proof covering the occurrence, the character and the extent of the loss for which claim is made.\n(7) A provision as follows:\nPROOFS OF LOSS: Written proof of loss must be furnished to the insurer at its said office in case of claim for loss for which this policy provides any periodic payment contingent upon continuing loss within 90 days after the termination of the period for which the insurer is liable and in case of claim for any other loss within 90 days after the date of such loss. Failure to furnish such proof within the time required shall not invalidate nor reduce any claim if it was not reasonably possible to give proof within such time, provided such proof is furnished as soon as reasonably possible and in no event, except in the absence of legal capacity, later than one year from the time proof is otherwise required.\n(8) A provision as follows:\nTIME OF PAYMENT OF CLAIMS: Indemnities payable under this policy for any loss other than loss for which this policy provides periodic payment will be paid immediately upon receipt of due written proof of such loss. Subject to due written proof of loss, all accrued indemnities for loss for which this policy provides periodic payment will be paid ..... (insert period for payment which must not be less frequently than monthly) and any balance remaining unpaid upon the termination of liability will be paid immediately upon receipt of due written proof.\n(9) A provision as follows:\nPAYMENT OF CLAIMS: Indemnity for loss of life will be payable in accordance with the beneficiary designation and the provisions respecting such payment which may be prescribed herein and effective at the time of payment. If no such designation or provision is then effective, such indemnity shall be payable to the estate of the insured. Any other accrued indemnities unpaid at the insured's death may, at the option of the insurer, be paid either to such beneficiary or to such estate. All other indemnities will be payable to the insured.\nThe following provisions, or either of them, may be included with the foregoing provision at the option of the insurer:\nIf any indemnity of this policy shall be payable to the estate of the insured, or to an insured or beneficiary who is a minor or otherwise not competent to give a valid release, the insurer may pay such indemnity, up to an amount not exceeding $..... (insert an amount which shall not exceed $1,000), to any relative by blood or connection by marriage of the insured or beneficiary who is deemed by the insurer to be equitably entitled thereto. Any payment made by the insurer in good faith pursuant to this provision shall fully discharge the insurer to the extent of such payment.\nSubject to any written direction of the insured in the application or otherwise all or a portion of any indemnities provided by this policy on account of hospital, nursing, medical, or surgical services may, at the insurer's option and unless the insured requests otherwise in writing not later than the time of filing proofs of such loss, be paid directly to the hospital or person rendering such services; but it is not required that the service be rendered by a particular hospital or person.\n(10) A provision as follows:\nPHYSICAL EXAMINATIONS AND AUTOPSY: The insurer at its own expense shall have the right and opportunity to examine the person of the insured when and as often as it may reasonably require during the pendency of a claim hereunder and to make an autopsy in case of death where it is not forbidden by law.\n(11) A provision as follows:\nLEGAL ACTIONS: No action at law or in equity shall be brought to recover on this policy prior to the expiration of 60 days after written proof of loss has been furnished in accordance with the requirements of this policy. No such action shall be brought after the expiration of three years after the time written proof of loss is required to be furnished.\n(12) A provision as follows:\nCHANGE OF BENEFICIARY: Unless the insured makes an irrevocable designation of beneficiary, the right to change of beneficiary is reserved to the insured and the consent of the beneficiary or beneficiaries shall not be requisite to surrender or assignment of this policy or to any change of beneficiary or beneficiaries, or to any other changes in this policy. The first clause of this provision, relating to the irrevocable designation of beneficiary, may be omitted at the insurer's option.\nExcept as provided in subdivision 4, no such policy delivered or issued for delivery to any person in this state shall contain provisions respecting the matters set forth below unless such provisions are in the words in which the same appear in this section. The insurer may, at its option, use in lieu of any such provision a corresponding provision of different wording approved by the commissioner which is not less favorable in any respect to the insured or the beneficiary. Any such provision contained in the policy shall be preceded individually by the appropriate caption appearing in this subdivision or, at the option of the insurer, by such appropriate individual or group captions or subcaptions as the commissioner may approve.\n(1) A provision as follows:\nCHANGE OF OCCUPATION: If the insured be injured or contract sickness after having changed occupations to one classified by the insurer as more hazardous than that stated in this policy or while doing for compensation anything pertaining to an occupation so classified, the insurer will pay only such portion of the indemnities provided in this policy as the premiums paid would have purchased at the rates and within the limits fixed by the insurer for such more hazardous occupation. If the insured changes occupations to one classified by the insurer as less hazardous than that stated in this policy, the insurer, upon receipt of proof of such change of occupation will reduce the premium rate accordingly, and will return the excess pro rata unearned premium from the date of change of occupation or from the policy anniversary date immediately preceding receipt of such proof, whichever is the more recent. In applying this provision, the classification of occupational risk and the premium rates shall be such as have been last filed by the insurer prior to the occurrence of the loss for which the insurer is liable or prior to date of proof of change in occupation with the state official having supervision of insurance in the state where the insured resided at the time this policy was issued; but if such filing was not required, then the classification of occupational risk and the premium rates shall be those last made effective by the insurer in such state prior to the occurrence of the loss or prior to the date of proof of change of occupation.\n(2) A provision as follows:\nMISSTATEMENT OF AGE: If the age of the insured has been misstated, all amounts payable under this policy shall be such as the premium paid would have purchased at the correct age.\n(3) A provision as follows:\nOTHER INSURANCE IN THIS INSURER: If an accident or sickness or accident and sickness policy or policies previously issued by the insurer to the insured be in force concurrently herewith, making the aggregate indemnity for ..... (insert type of coverage or coverages) in excess of $..... (insert maximum limit of indemnity or indemnities) the excess insurance shall be void and all premiums paid for such excess shall be returned to the insured or to the insured's estate, or, in lieu thereof:\nInsurance effective at any one time on the insured under a like policy or policies in this insurer is limited to the one such policy elected by the insured, or the insured's beneficiary or estate, as the case may be, and the insurer will return all premiums paid for all other such policies.\n(4) A provision as follows:\nINSURANCE WITH OTHER INSURERS: If there be other valid coverage, not with this insurer, providing benefits for the same loss on a provision of service basis or on an expense incurred basis and of which this insurer has not been given written notice prior to the occurrence or commencement of loss, the only liability under any expense incurred coverage of this policy shall be for such proportion of the loss as the amount which would otherwise have been payable hereunder plus the total of the like amounts under all such other valid coverages for the same loss of which this insurer had notice bears to the total like amounts under all valid coverages for such loss, and for the return of such portion of the premiums paid as shall exceed the pro rata portion for the amount so determined. For the purpose of applying this provision when other coverage is on a provision of service basis, the \"like amount\" of such other coverage shall be taken as the amount which the services rendered would have cost in the absence of such coverage.\nIf the foregoing policy provision is included in a policy which also contains the next following policy provision there shall be added to the caption of the foregoing provision the phrase \"EXPENSE INCURRED BENEFITS.\" The insurer may, at its option, include in this provision a definition of \"other valid coverage,\" approved as to form by the commissioner, which definition shall be limited in subject matter to coverage provided by organizations subject to regulation by insurance law or by insurance authorities of this or any other state of the United States or any province of Canada, and by hospital or medical service organizations, and to any other coverage the inclusion of which may be approved by the commissioner. In the absence of such definition such term shall not include group insurance, automobile medical payments insurance, or coverage provided by hospital or medical service organizations or by union welfare plans or employer or employee benefit organizations. For the purpose of applying the foregoing policy provision with respect to any insured, any amount of benefit provided for such insured pursuant to any compulsory benefit statute (including any workers' compensation or employer's liability statute) whether provided by a governmental agency or otherwise shall in all cases be deemed to be \"other valid coverage\" of which the insurer has had notice. In applying the foregoing policy provision no third-party liability coverage shall be included as \"other valid coverage.\"\n(5) A provision as follows:\nINSURANCE WITH OTHER INSURERS: If there be other valid coverage, not with this insurer, providing benefits for the same loss on other than an expense incurred basis and of which this insurer has not been given written notice prior to the occurrence or commencement of loss, the only liability for such benefits under this policy shall be for such proportion of the indemnities otherwise provided hereunder for such loss as the like indemnities of which the insurer had notice (including the indemnities under this policy) bear to the total amount of all like indemnities for such loss, and for the return of such portion of the premium paid as shall exceed the pro rata portion for the indemnities thus determined.\nIf the foregoing policy provision is included in a policy which also contains the next preceding policy provision there shall be added to the caption of the foregoing provision the phrase -- \"OTHER BENEFITS.\" The insurer may, at its option, include in this provision a definition of \"other valid coverage,\" approved as to form by the commissioner, which definition shall be limited in subject matter to coverage provided by organizations subject to regulation by insurance law or by insurance authorities of this or any other state of the United States or any province of Canada, and to any other coverage the inclusion of which may be approved by the commissioner. In the absence of such definition such term shall not include group insurance, or benefits provided by union welfare plans or by employer or employee benefit organizations. For the purpose of applying the foregoing policy provision with respect to any insured, any amount of benefit provided for such insured pursuant to any compulsory benefit statute (including any workers' compensation or employer's liability statute) whether provided by a governmental agency or otherwise shall in all cases be deemed to be \"other valid coverage\" of which the insurer has had notice. In applying the foregoing policy provision no third-party liability coverage shall be included as \"other valid coverage.\"\n(6) A provision as follows:\nRELATION OF EARNINGS TO INSURANCE: If the total monthly amount of loss of time benefits promised for the same loss under all valid loss of time coverage upon the insured, whether payable on a weekly or monthly basis, shall exceed the monthly earnings of the insured at the time disability commenced or the insured's average monthly earnings for the period of two years immediately preceding a disability for which claim is made, whichever is the greater, the insurer will be liable only for such proportionate amount of such benefits under this policy as the amount of such monthly earnings or such average monthly earnings of the insured bears to the total amount of monthly benefits for the same loss under all such coverage upon the insured at the time such disability commences and for the return of such part of the premiums paid during such two years as shall exceed the pro rata amount of the premiums for the benefits actually paid hereunder; but this shall not operate to reduce the total monthly amount of benefits payable under all such coverage upon the insured below the sum of $200 or the sum of the monthly benefits specified in such coverages, whichever is the lesser, nor shall it operate to reduce benefits other than those payable for loss of time.\nThe foregoing policy provision may be inserted only in a policy which the insured has the right to continue in force subject to its terms by the timely payment of premiums (1) until at least age 50, or, (2) in the case of a policy issued after age 44, for at least five years from its date of issue. The insurer may, at its option, include in this provision a definition of \"valid loss of time coverage,\" approved as to form by the commissioner, which definition shall be limited in subject matter to coverage provided by governmental agencies or by organizations subject to regulation by insurance law or by insurance authorities of this or any other state of the United States or any province of Canada, or to any other coverage the inclusion of which may be approved by the commissioner or any combination of such coverages. In the absence of such definition such term shall not include any coverage provided for such insured pursuant to any compulsory benefit statute (including any workers' compensation or employer's liability statute), or benefits provided by union welfare plans or by employer or employee benefit organizations.\n(7) A provision as follows:\nUNPAID PREMIUM: Upon the payment of a claim under this policy, any premium then due and unpaid or covered by any note or written order may be deducted therefrom.\n(8) A provision as follows:\nCANCELLATION: The insurer may cancel this policy at any time by written notice delivered to the insured or mailed to the insured's last address as shown by the records of the insurer, stating when, not less than five days thereafter, such cancellation shall be effective; and after the policy has been continued beyond its original term the insured may cancel this policy at any time by written notice delivered or mailed to the insurer, effective upon receipt or on such later date as may be specified in such notice. In the event of cancellation, the insurer will return promptly the unearned portion of any premium paid. Regardless of whether it is the insurer or the insured who cancels, the earned premium shall be computed pro rata, unless the mode of payment is monthly or less, or if the unearned amount is for less than one month. Cancellation shall be without prejudice to any claim originating prior to the effective date of cancellation.\n(9) A provision as follows:\nCONFORMITY WITH STATE STATUTES: Any provision of this policy which, on its effective date, is in conflict with the statutes of the state in which the insured resides on such date is hereby amended to conform to the minimum requirements of such statutes.\n(10) A provision as follows:\nILLEGAL OCCUPATION: The insurer shall not be liable for any loss to which a contributing cause was the insured's commission of or attempt to commit a felony or to which a contributing cause was the insured's being engaged in an illegal occupation.\n(11) A provision as follows:\nNARCOTICS: The insurer shall not be liable for any loss sustained or contracted in consequence of the insured's being under the influence of any narcotic unless administered on the advice of a physician.\nIf any provision of this section is in whole or in part inapplicable to or inconsistent with the coverage provided by a particular form of policy the insurer, with the approval of the commissioner, shall omit from such policy any inapplicable provision or part of a provision, and shall modify any inconsistent provision or part of the provision in such manner as to make the provision as contained in the policy consistent with the coverage provided by the policy.\nThe provisions which are the subject of subdivisions 2 and 3, or any corresponding provisions which are used in lieu thereof in accordance with subdivisions 2 and 3, shall be printed in the consecutive order of the provisions in subdivisions 2 and 3 or, at the option of the insurer, any such provision may appear as a unit in any part of the policy, with other provisions to which it may be logically related, provided the resulting policy shall not be in whole or in part unintelligible, uncertain, ambiguous, abstruse, or likely to mislead a person to whom the policy is offered, delivered or issued.\nThe word \"insured,\" as used in sections 62A.01 to 62A.09, shall not be construed as preventing a person other than the insured with a proper insurable interest from making application for and owning a policy covering the insured or from being entitled under such a policy to any indemnities, benefits and rights provided therein.\nAny policy of a foreign or alien insurer, when delivered or issued for delivery to any person in this state, may contain any provision which is not less favorable to the insured or the beneficiary than the provisions of sections 62A.01 to 62A.09 hereof, and which is prescribed or required by the law of the state under which the insurer is organized.\nAny policy of a domestic insurer may, when issued for delivery in any other state or country, contain any provision permitted or required by the laws of such other state or country.\nThe commissioner may make such reasonable rules concerning the procedure for the filing or submission of policies subject to sections 62A.01 to 62A.09, as are necessary, proper or advisable to the administration of sections 62A.01 to 62A.09. This provision shall not abridge any other authority granted the commissioner by law.\nA policy of accident and sickness insurance as defined in section 62A.01 may contain or may be amended by rider to provide for a return of premium benefit so long as:\n(1) the return of premium benefit is not applicable until the policy has been in force for five years;\n(2) the return of premium benefit is not reduced by an amount greater than the aggregate of any claims paid under the policy;\n(3) the return of premium benefit is not included in or used with a policy with benefits that are reduced based on an insured's age;\n(4) the return of premium benefit is not payable in lieu of benefits at the option of the insurer;\n(5) the insurer demonstrates that the reserve basis for such benefit is adequate; and\n(6) the cost of the benefit is disclosed to the insured and the insured is given the option of the coverage.",
	"repealed": false
}