{
	"id": "473J.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.25",
	"title": "473J.25 METROPOLITAN SPORTS FACILITIES COMMISSION ASSETS; LIABILITIES TO AUTHORITY.",
	"text": "The Metropolitan Sports Facilities Commission shall pay the operating expenses of the authority including salaries, compensation, and other personnel, office, equipment, consultant, and any other costs, until the commission is abolished pursuant to subdivision 3.\nBy August 12, 2012, the Metropolitan Sports Facilities Commission shall pay its outstanding obligations, settle its accounts, and transfer its remaining assets, liabilities, and obligations to the authority, for its purposes.\nUpon transfer to the authority of all remaining assets, liabilities, and obligations of the Metropolitan Sports Facilities Commission, in subdivision 2, the Metropolitan Sports Facilities Commission is abolished. When the remaining assets, liabilities, and obligations of the Metropolitan Sports Facilities Commission have been transferred to the authority and the commission has been abolished, the powers and duties of the commission under sections 473.551 to 473.599, and any other law shall devolve upon the authority, in addition to the powers and duties of the authority under chapter 473J, until the first NFL home game is played at the stadium.\nUpon transfer of ownership all persons employed by the Metropolitan Sports Facilities Commission shall be transferred to the Minnesota Sports Facilities Authority without loss of right or privilege. Nothing in this section shall be construed to give any such person the right or privilege to continue in the same level or classification of employment previously held. The Minnesota Sports Facilities Authority may assign any such person to an employment level and classification which it deems appropriate and desirable in accordance with its personnel code.\nThe Metropolitan Sports Facilities Commission shall submit a technical bill to the 2013 legislature making any cross-reference, grammatical, or other conforming changes necessary as a result of Laws 2012, chapter 299. This bill shall be submitted by February 12, 2013.",
	"repealed": false
}