{
	"id": "256B.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.055",
	"title": "256B.055 ELIGIBILITY CATEGORIES.",
	"text": "Medical assistance may be paid for a child eligible for or receiving adoption assistance payments under title IV-E of the Social Security Act, United States Code, title 42, sections 670 to 676, and to any child who is not title IV-E eligible but who was determined eligible for adoption assistance under sections 142A.60 to 142A.612 or 259A.10, subdivision 2, and has a special need for medical or rehabilitative care.\nMedical assistance may be paid for a child eligible for or receiving foster care maintenance payments under Title IV-E of the Social Security Act, United States Code, title 42, sections 670 to 676, and for a child who is not eligible for Title IV-E of the Social Security Act but who is placed in foster care as determined by Minnesota Statutes or receiving kinship assistance under sections 142A.60 to 142A.612.\n[Repealed, 2013 c 108 art 1 s 68]\nMedical assistance may be paid for a person who is a child under the age of 19; the parent or stepparent of a child under the age of 19, including a pregnant woman; or a caretaker relative of a child under the age of 19.\nMedical assistance may be paid for a person who is receiving public assistance under the Minnesota supplemental aid program.\n[Repealed, 2013 c 108 art 1 s 68]\nMedical assistance may be paid for a pregnant woman who meets the other eligibility criteria of this section and whose unborn child would be eligible as a needy child under subdivision 10 if born and living with the woman. In accordance with Code of Federal Regulations, title 42, section 435.956, the commissioner must accept self-attestation of pregnancy unless the agency has information that is not reasonably compatible with such attestation. For purposes of this subdivision, a woman is considered pregnant for 12 months postpartum.\n(a) Medical assistance may be paid for a person who meets the categorical eligibility requirements of the Supplemental Security Income program or, who would meet those requirements except for excess income or assets, and who meets the other eligibility requirements of this section.\n(b) Following a determination that the applicant is not aged or blind and does not meet any other category of eligibility for medical assistance and has not been determined disabled by the Social Security Administration, applicants under this subdivision shall be referred to the commissioner's state medical review team for a determination of disability.\nMedical assistance may be paid for a person who is under age 18 and who meets income and asset eligibility requirements of the Supplemental Security Income program if the person was receiving Supplemental Security Income payments on the date of enactment of section 211(a) of Public Law 104-193, the Personal Responsibility and Work Opportunity Act of 1996, and the person would have continued to receive the payments except for the change in the childhood disability criteria in section 211(a) of Public Law 104-193.\n[Repealed, 1990 c 568 art 3 s 104]\nMedical assistance may be paid for a person who is under 21 years of age and in need of medical care that neither the person nor the person's relatives responsible under sections 256B.01 to 256B.26 are financially able to provide.\nMedical assistance may be paid for an infant less than one year of age, whose mother was eligible for and receiving medical assistance at the time of birth or who is less than two years of age and is in a family with countable income that is equal to or less than the income standard established under section 256B.057, subdivision 1.\n[Repealed, 1Sp2003 c 14 art 12 s 101]\n[Repealed, 2013 c 108 art 1 s 68]\nMedical assistance may be paid for a person who is residing in a hospital for treatment of mental disease or tuberculosis and is 65 years of age or older and without means sufficient to pay the per capita hospital charge.\n(a) A person is eligible for medical assistance if the person is under age 19 and qualifies as a disabled individual under United States Code, title 42, section 1382c(a), and would be eligible for medical assistance under the state plan if residing in a medical institution, and the child requires a level of care provided in a hospital, nursing facility, or intermediate care facility for persons with developmental disabilities, for whom home care is appropriate, provided that the cost to medical assistance under this section is not more than the amount that medical assistance would pay for if the child resides in an institution. After the child is determined to be eligible under this section, the commissioner shall review the child's disability under United States Code, title 42, section 1382c(a) and level of care defined under this section no more often than annually and may elect, based on the recommendation of health care professionals under contract with the state medical review team, to extend the review of disability and level of care up to a maximum of four years. The commissioner's decision on the frequency of continuing review of disability and level of care is not subject to administrative appeal under section 256.045. The county agency shall send a notice of disability review to the enrollee six months prior to the date the recertification of disability is due. Nothing in this subdivision shall be construed as affecting other redeterminations of medical assistance eligibility under this chapter and annual cost-effective reviews under this section.\n(b) For purposes of this subdivision, \"hospital\" means an institution as defined in section 144.696, subdivision 3, 144.55, subdivision 3, or Minnesota Rules, part 4640.3600, and licensed pursuant to sections 144.50 to 144.58. For purposes of this subdivision, a child requires a level of care provided in a hospital if the child is determined by the commissioner to need an extensive array of health services, including mental health services, for an undetermined period of time, whose health condition requires frequent monitoring and treatment by a health care professional or by a person supervised by a health care professional, who would reside in a hospital or require frequent hospitalization if these services were not provided, and the daily care needs are more complex than a nursing facility level of care.\nA child with serious emotional disturbance requires a level of care provided in a hospital if the commissioner determines that the individual requires 24-hour supervision because the person exhibits recurrent or frequent suicidal or homicidal ideation or behavior, recurrent or frequent psychosomatic disorders or somatopsychic disorders that may become life threatening, recurrent or frequent severe socially unacceptable behavior associated with psychiatric disorder, ongoing and chronic psychosis or severe, ongoing and chronic developmental problems requiring continuous skilled observation, or severe disabling symptoms for which office-centered outpatient treatment is not adequate, and which overall severely impact the individual's ability to function.\n(c) For purposes of this subdivision, \"nursing facility\" means a facility which provides nursing care as defined in section 144A.01, subdivision 5, licensed pursuant to sections 144A.02 to 144A.10, which is appropriate if a person is in active restorative treatment; is in need of special treatments provided or supervised by a licensed nurse; or has unpredictable episodes of active disease processes requiring immediate judgment by a licensed nurse. For purposes of this subdivision, a child requires the level of care provided in a nursing facility if the child is determined by the commissioner to meet the requirements of the preadmission screening assessment document under section 256B.0911, adjusted to address age-appropriate standards for children age 18 and under.\n(d) For purposes of this subdivision, \"intermediate care facility for persons with developmental disabilities\" or \"ICF/DD\" means a program licensed to provide services to persons with developmental disabilities under section 252.28, and chapter 245A, and a physical plant licensed as a supervised living facility under chapter 144, which together are certified by the Minnesota Department of Health as meeting the standards in Code of Federal Regulations, title 42, part 483, for an intermediate care facility which provides services for persons with developmental disabilities who require 24-hour supervision and active treatment for medical, behavioral, or habilitation needs. For purposes of this subdivision, a child requires a level of care provided in an ICF/DD if the commissioner finds that the child has a developmental disability in accordance with section 256B.092, is in need of a 24-hour plan of care and active treatment similar to persons with developmental disabilities, and there is a reasonable indication that the child will need ICF/DD services.\n(e) For purposes of this subdivision, a person requires the level of care provided in a nursing facility if the person requires 24-hour monitoring or supervision and a plan of mental health treatment because of specific symptoms or functional impairments associated with a serious mental illness or disorder diagnosis, which meet severity criteria for mental health established by the commissioner and published in March 1997 as the Minnesota Mental Health Level of Care for Children and Adolescents with Severe Emotional Disorders.\n(f) The determination of the level of care needed by the child shall be made by the commissioner based on information supplied to the commissioner by (1) the parent or guardian, (2) the child's physician or physicians, advanced practice registered nurse or advanced practice registered nurses, or physician assistant or physician assistants, and (3) other professionals as requested by the commissioner. The commissioner shall establish a screening team to conduct the level of care determinations according to this subdivision.\n(g) If a child meets the conditions in paragraph (b), (c), (d), or (e), the commissioner must assess the case to determine whether:\n(1) the child qualifies as a disabled individual under United States Code, title 42, section 1382c(a), and would be eligible for medical assistance if residing in a medical institution; and\n(2) the cost of medical assistance services for the child, if eligible under this subdivision, would not be more than the cost to medical assistance if the child resides in a medical institution to be determined as follows:\n(i) for a child who requires a level of care provided in an ICF/DD, the cost of care for the child in an institution shall be determined using the average payment rate established for the regional treatment centers that are certified as ICF's/DD;\n(ii) for a child who requires a level of care provided in an inpatient hospital setting according to paragraph (b), cost-effectiveness shall be determined according to Minnesota Rules, part 9505.3520, items F and G; and\n(iii) for a child who requires a level of care provided in a nursing facility according to paragraph (c) or (e), cost-effectiveness shall be determined according to Minnesota Rules, part 9505.3040, except that the nursing facility average rate shall be adjusted to reflect rates which would be paid for children under age 16. The commissioner may authorize an amount up to the amount medical assistance would pay for a child referred to the commissioner by the preadmission screening team under section 256B.0911.\nBeginning October 1, 2003, persons who would be eligible for medical assistance under this chapter but for residing in a facility that is determined by the commissioner or the federal Centers for Medicare and Medicaid Services to be an institution for mental diseases are eligible for medical assistance without federal financial participation, except that coverage shall not include payment for a nursing facility determined to be an institution for mental diseases.\n(a) Medical assistance may be paid for an inmate of a correctional facility who is conditionally released as authorized under section 241.26, 244.065, or 631.425, if the individual does not require the security of a public detention facility and is housed in a halfway house or community correction center, or under house arrest and monitored by electronic surveillance in a residence approved by the commissioner of corrections, and if the individual meets the other eligibility requirements of this chapter.\n(b) An individual who is enrolled in medical assistance, and who is charged with a crime and incarcerated for less than 12 months shall be suspended from eligibility at the time of incarceration until the individual is released. Upon release, medical assistance eligibility is reinstated without reapplication using a reinstatement process and form, if the individual is otherwise eligible.\n(c) An individual, regardless of age, who is considered an inmate of a public institution as defined in Code of Federal Regulations, title 42, section 435.1010, and who meets the eligibility requirements in section 256B.056, is not eligible for medical assistance, except for covered services received while an inpatient in a medical institution as defined in Code of Federal Regulations, title 42, section 435.1010. Security issues, including costs, related to the inpatient treatment of an inmate are the responsibility of the entity with jurisdiction over the inmate.\nMedical assistance may be paid for a person who is:\n(1) at least age 21 and under age 65;\n(2) not pregnant;\n(3) not entitled to Medicare Part A or enrolled in Medicare Part B under Title XVIII of the Social Security Act;\n(4) not otherwise eligible under subdivision 7 as a person who meets the categorical eligibility requirements of the Supplemental Security Income program;\n(5) not enrolled under subdivision 7 as a person who would meet the categorical eligibility requirements of the Supplemental Security Income program except for excess income or assets; and\n(6) not described in another subdivision of this section.\nMedical assistance may be paid for children who are 19 to 20 years of age.\n(a) Medical assistance may be paid for a person under 26 years of age who was in foster care under the commissioner's responsibility on the date of attaining 18, 19, or 20 years of age, and who was enrolled in medical assistance under the state plan or a waiver of the plan while in foster care, in accordance with section 2004 of the Affordable Care Act.\n(b) Medical assistance may be paid for a person under 26 years of age who was in foster care and enrolled in any state's Medicaid program as provided by Public Law 115-271, section 1002.\n(c) The commissioner shall seek federal waiver approval under United States Code, title 42, section 1315, to include youth who were in a state's foster care program and who turned age 18 prior to January 1, 2023, without regard to potential eligibility under a Medicaid mandatory group.",
	"repealed": false
}