{
	"id": "473.384",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.384",
	"title": "473.384 CONTRACTS.",
	"text": "The council shall make contracts with eligible recipients for financial assistance to transit service within the metropolitan area. The council may not give financial assistance to another transit provider without first having executed a contract. The provisions of this section do not apply to contracts made under sections 473.386 and 473.388.\nTo be eligible to receive financial assistance by contract under this section a recipient must be:\n(a) a county, statutory or home rule charter city or town or combination thereof, or public authority organized and existing pursuant to chapter 398A, providing financial assistance to or providing or operating public transit; or\n(b) a private provider of public transit.\nThe council shall establish procedures and standards for review and approval of applications for financial assistance under this section. An applicant must provide the council with the financial and other information the council requires to carry out its duties. The council may specify procedures, including public hearing requirements, to be followed by applicants that are cities, towns, or counties or combinations thereof in conducting transit studies and formulating service plans under subdivisions 4 and 5.\nThe council shall require that prior to applying for financial assistance by contract under clause (a) of subdivision 2, the applicant must prepare and submit a transit study which includes the following elements:\n(a) a determination of existing and future transit needs within the area to be served, and an assessment of the adequacy of existing service to meet the needs;\n(b) an assessment of the level and type of service required to meet unmet needs;\n(c) an assessment of existing and future resources available for the financing of transit service; and\n(d) the type or types of any new government arrangements or agreements needed to provide adequate service.\nThe transit study for any applicant may be done by the council.\nThe council shall, before making a contract with an eligible recipient, require the submission of a service plan which includes the following elements:\n(a) a description of the service proposed for financial assistance, including vehicles, routes, and schedules;\n(b) an assessment of the extent to which the proposed service meets the needs as determined by the transit study;\n(c) a description of the contract administration and review process if the operation of the proposed service is to be done by a private contractor;\n(d) a description of the amount required to establish and operate the proposed service and the proposed sources of the required amount including operating revenue, other local sources, and assistance from the council and from federal sources;\n(e) the fare structure of the proposed service; and\n(f) projections of usage of the system.\nThe council may specify procedures, including public hearing requirements, to be followed by applicants that are cities, towns, or counties or combinations thereof in conducting transit studies and formulating service plans.\nThe council shall provide financial assistance to recipients who were receiving assistance by contract with the commissioner of transportation under Minnesota Statutes 1982, section 174.24, subdivision 3, on July 1, 1984, so that the percentage of total operating cost, as defined by the council, paid by the recipient from all local sources of revenue, including operating revenue, does not exceed the percentage for the recipient's classification as determined by the commissioner of transportation under the commissioner's final contract with the recipient. The remainder of the total operating cost must be paid by the council less all assistance received by the recipient for that purpose from any federal source.\nIf a recipient informs the council in writing prior to the distribution of financial assistance for any year that paying its designated percentage of total operating cost from local sources will cause undue hardship, the council may adjust the percentage as it deems equitable. If for any year the funds available to the council are insufficient to allow the council to pay its share of total operating cost for those recipients, the council shall reduce its share in each classification to the extent necessary.\nPrior to entering into a contract for operating assistance with a recipient, the council shall evaluate the effect, if any, of the contract on the ridership, routes, schedules, fares, and staffing levels of the existing and proposed service provided by the council. The council may enter into the contract only if it determines that the service to be assisted under the contract will not impose an undue hardship on the ridership or financial condition of the council's transit operations. The requirements of this subdivision do not apply to contracts for assistance to recipients who, as part of a negotiated cost-sharing arrangement with the council, pay a substantial part of the cost of services that directly benefit the recipient as an institution or organization.\nIn executing and administering contracts for paratransit projects, the council has the powers and duties given to the commissioner of transportation in section 174.255, subdivisions 1 and 2, relating to disability accessibility and insurance coverage. The provisions of section 174.255, subdivision 3, apply to paratransit projects which receive assistance by contract with the council.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]",
	"repealed": false
}