{
	"id": "62A.0411",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.0411",
	"title": "62A.0411 MATERNITY CARE.",
	"text": "Every health plan must provide coverage of a minimum of 48 hours of inpatient care following a vaginal delivery and a minimum of 96 hours of inpatient care following a caesarean section for a mother and her newborn. The health plan shall not provide any compensation or other nonmedical remuneration to encourage a mother and newborn to leave inpatient care before the duration minimums specified in this section.\n(a) If a health care provider acting within the provider's scope of practice recommends that either the mother or newborn be transferred to a different medical facility, every health plan must provide the coverage required under subdivision 1 for the mother, newborn, and newborn siblings at both medical facilities. The coverage required under this subdivision includes but is not limited to expenses related to transferring all individuals from one medical facility to a different medical facility.\n(b) The coverage required under this subdivision must be provided without cost sharing, including but not limited to deductible, co-pay, or coinsurance. The coverage required under this paragraph must be provided without any limitation that is not generally applicable to other coverages under the plan.\n(c) Notwithstanding paragraph (b), a health plan that is a high-deductible health plan in conjunction with a health savings account must include cost-sharing for the coverage required under this subdivision at the minimum level necessary to preserve the enrollee's ability to make tax-exempt contributions and withdrawals from the health savings account as provided in section 223 of the Internal Revenue Code of 1986.\n(a) The health plan must also provide coverage for postdelivery outpatient care to a mother and her newborn if the duration of inpatient care is less than the minimums provided in this section.\n(b) Postdelivery care consists of a minimum of one home visit by a registered nurse. Services provided by the registered nurse include, but are not limited to, parent education, assistance and training in breast and bottle feeding, and conducting any necessary and appropriate clinical tests. The home visit must be conducted within four days following the discharge of the mother and her child.\nFor purposes of this section, \"health plan\" has the meaning given in section 62Q.01, subdivision 3, and county-based purchasing plans.",
	"repealed": false
}