{
	"id": "88.6435",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.6435",
	"title": "88.6435 DECORATIVE MATERIALS; BUYERS.",
	"text": "MS 2018 [Repealed by amendment, 1Sp2019 c 4 art 3 s 38]\n(a) A person must have a buyer's license for decorative materials to:\n(1) buy more than 100 pounds of decorative boughs in any calendar year;\n(2) buy more than 50 spruce stems or branches greater than six inches in length in any calendar year; or\n(3) buy more than 50 birch stems or branches greater than one-inch large-end diameter in any calendar year.\n(b) The annual fee for a buyer's license for decorative materials for a resident or nonresident is $25.\n(a) When buying or otherwise receiving decorative materials, a person licensed under this section must record:\n(1) the seller's name and address;\n(2) the form of written consent; and\n(3) the government permit number or legal description or property tax identification number of the land from which the decorative materials were obtained.\n(b) The information under paragraph (a) must be recorded on a form furnished or otherwise approved by the commissioner of natural resources and must be exhibited to an officer upon request.\n(c) A licensed buyer may not purchase decorative materials if the seller fails to exhibit the written consent required under section 88.642, subdivision 1. Decorative materials must conform to standards specified in the written consent.\n(d) Records must be maintained from July 1 until June 30 of the following calendar year and must be open to inspection to an officer during reasonable hours.\n(e) Customer name and address records created and maintained by licensees under this section are classified as private or nonpublic government data.\n(a) The commissioner may deny, modify, suspend, or revoke a license issued under this section for cause, including for falsifying records required under this section or for violating sections 88.641 to 88.648.\n(b) A person convicted of two or more violations of sections 88.641 to 88.648 within three years may not obtain a buyer's license for decorative materials for three years after the date of the last conviction.\n(a) The special forest products account is established in the state treasury in the natural resources fund.\n(b) Fees for licenses issued under this section must be deposited in the state treasury and credited to the special forest products account and, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, are annually appropriated to the commissioner of natural resources for costs associated with special forest product information and education programs for harvesters and buyers.",
	"repealed": false
}