{
	"id": "150A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.13",
	"title": "150A.13 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of a licensee unable to practice with reasonable skill and safety by reason of illness, use of alcohol, drugs, chemicals, or any other materials, or as a result of any mental, physical, or psychological condition may report the licensee to the board.\nA hospital, clinic, or other health care institution or organization located in this state shall report to the board any action taken by the agency, institution, or organization or any of its administrators or dental or other committees to revoke, suspend, restrict, or condition a licensee's privilege to practice or treat patients or clients in the institution, or as part of the organization, any denial of privileges, or any other disciplinary action against a licensee described under subdivision 1. The institution or organization shall also report the resignation of any licensees prior to the conclusion of any disciplinary action proceeding against a licensee described under subdivision 1.\nA state or local dental society or professional dental association shall report to the board any termination, revocation, or suspension of membership or any other disciplinary action taken against a licensee. If the society or association has received a complaint against a licensee described under subdivision 1, on which it has not taken any disciplinary action, the society or association shall report the complaint and the reason why it has not taken action on it or shall direct the complainant to the board. This subdivision does not apply to a society or association when it performs peer review functions as an agent of an outside entity, organization, or system.\n(a) A licensed health professional shall report to the board personal knowledge of any conduct by any person who the licensed health professional reasonably believes is a licensee described under subdivision 1.\n(b) Notwithstanding paragraph (a), a licensed health professional shall report to the board knowledge of any actions which institutions must report under subdivision 2.\n(a) Four times each year as prescribed by the board, each insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to licensees, shall submit to the board a report concerning the licensees against whom malpractice settlements or awards have been made to the plaintiff. The report must contain at least the following information:\n(1) the total number of malpractice settlements or awards made;\n(2) the date the malpractice settlements or awards were made;\n(3) the allegations contained in the claim or complaint leading to the settlements or awards made;\n(4) the dollar amount of each malpractice settlement or award;\n(5) the regular address of the practice of the licensee against whom an award was made or with whom a settlement was made; and\n(6) the name of the licensee against whom an award was made or with whom a settlement was made.\n(b) A dental clinic, hospital, political subdivision, or other entity which makes professional liability insurance payments on behalf of licensees shall submit to the board a report concerning malpractice settlements or awards paid on behalf of licensees, and any settlements or awards paid by a clinic, hospital, political subdivision, or other entity on its own behalf because of care rendered by licensees. This requirement excludes forgiveness of bills. The report shall be made to the board within 30 days of payment of all or part of any settlement or award.\nThe court administrator of district court or any other court of competent jurisdiction shall report to the board any judgment or other determination of the court that adjudges or includes a finding that a licensee has a mental illness, is unable to practice with reasonable skill and safety due to a mental condition, is guilty of a felony, is guilty of a violation of federal or state narcotics laws or controlled substances act, or is guilty of an abuse or fraud under Medicare or Medicaid; or that appoints a guardian of the licensee pursuant to sections 524.5-101 to 524.5-502, or commits a licensee pursuant to chapter 253B.\nA licensee shall report to the board any personal action that would require that a report be filed by any person, health care facility, business, or organization pursuant to subdivisions 2 to 6.\nReports required by subdivisions 2 to 7 must be submitted not later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to assure prompt and accurate reporting.\nThe board may issue subpoenas for the production of any reports required by subdivisions 2 to 7 or any related documents.\nAny person, institution, insurer, or organization that fails to report as required under subdivisions 2 to 6 shall be subject to civil penalties for failing to report as required by law.",
	"repealed": false
}