{
	"id": "160.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.22",
	"title": "160.22 TREES.",
	"text": "Road authorities may plant and tend trees and shrubs along highways in rural areas in a manner so as to protect the highways from drifting snow. In like manner, with the written consent of the abutting landowner, trees and shrubs may be planted and tended outside the limits of the highways.\nThe trees and shrubs shall not thereafter be removed without the consent of the road authority.\nThe road authorities may acquire by purchase, gift, or condemnation all trees and hedges within the limits of a highway. Thereafter if the road authority determines that the trees and hedges acquired within the limits of a highway under its jurisdiction interfere with the safety and convenience of public travel thereon, or interfere with the construction, reconstruction, or maintenance thereof, it may cut and remove the trees and hedges without notice, and may dispose of the trees and hedges in such manner as it deems proper.\nWhen the trees and hedges have not been acquired, the road authority may cut and remove trees and hedges from within the limits of highways under its jurisdiction when the road authority determines that the trees and hedges interfere with the maintenance or reconstruction of the highway or interfere with the safety and convenience of public travel thereon.\nPrior to ordering the cutting and removal of trees and hedges not acquired, the road authority shall fix a time and place of hearing in the county where the lands are located to consider the cutting and removal of such trees and hedges. The owners of the abutting land shall be given written notice of the hearing at least ten days prior to the date fixed therefor. At the hearing the abutting owners shall be given the opportunity to be heard.\nAfter the hearing the road authority shall serve notice upon the abutting owners of its determination as to the trees and hedges. A copy of the order or resolution shall be attached to the notice.\nAny abutting owner may, within 30 days from the receipt of the notice required in subdivision 6, appeal to the district court from the determination by filing with the court administrator a notice of appeal, together with a bond of not less than $500, approved by the court, conditioned to pay all costs arising from the appeal in case the determination of the road authority is sustained. The notice of appeal shall state the grounds thereof and a copy shall be forwarded to the road authority. The appeal shall be entered upon the court calendar for trial at the next general term of court, and either party shall be entitled to a jury trial.\nFor purposes of this section, \"tree\" means a tree or woody perennial shrub or vine which is at least six inches in diameter, as measured at a point two feet from the ground, and \"hedge\" means any planted and maintained hedge within the right-of-way.\nUpon written notice of a determination to cut and remove the trees and hedges, the road authority may proceed to cut and remove the same. The timber and wood so cut and removed shall belong to the abutting owners, and the road authority shall cause the wood and timber to be placed upon the abutting owner's property adjacent to the highway, doing no unnecessary damage to such property. In case the abutting owner notifies the road authority that the owner does not want the timber or wood, the road authority shall dispose of the wood and timber in such manner as it deems proper.\nNo person shall cut or remove trees or hedges acquired by the road authority unless the road authority shall have first consented to the cutting or removal.\nTrees, hedges and other shrubs or plants within the limits of any town road and not acquired by the town as provided in subdivision 3, may be cut and removed without regard to the provisions of subdivisions 5 and 6 when they interfere with the maintenance or reconstruction of the road or with the safety and convenience of the public; provided that the town gives written notice to the abutting owner of its intention to cut and remove 14 days before taking such action and the abutting owner does not request a hearing during that period. The notice shall plainly advise the abutting owner of the right to a hearing. If the abutting owner requests a hearing within the time required the town shall proceed in accordance with subdivisions 5 and 6, and this subdivision shall not apply. The timber and wood cut pursuant to this subdivision shall be disposed of in accordance with subdivision 8.\nThe town road authority may cut and remove trees and hedges within the limits of a town road that is dedicated by plat. The cutting and removing is not subject to this section. The timber or wood that is cut belongs to the town road authority and may be disposed of as the town road authority considers proper without any notice that is otherwise required by this section.",
	"repealed": false
}