{
	"id": "256B.097",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.097",
	"title": "256B.097 REGIONAL AND SYSTEMS IMPROVEMENT FOR MINNESOTANS WHO HAVE DISABILITIES.",
	"text": "MS 2020 [Repealed, 1Sp2021 c 7 art 13 s 79]\nMS 2020 [Repealed, 1Sp2021 c 7 art 13 s 79]\nMS 2020 [Repealed, 1Sp2021 c 7 art 13 s 79]\nMS 2020 [Repealed, 1Sp2021 c 7 art 13 s 79]\nMS 2020 [Repealed, 1Sp2021 c 7 art 13 s 79]\nMS 2020 [Repealed, 1Sp2021 c 7 art 13 s 79]\nThe commissioner of human services shall maintain the regional quality councils initially established under Minnesota Statutes 2020, section 256B.097, subdivision 4. The regional quality councils shall:\n(1) support efforts and initiatives that drive overall systems and social change to promote inclusion of people who have disabilities in the state of Minnesota;\n(2) improve person-centered outcomes in disability services; and\n(3) identify or enhance quality of life indicators for people who have disabilities.\n(a) Regional quality councils shall be comprised of key stakeholders including, but not limited to:\n(1) individuals who have disabilities;\n(2) family members of people who have disabilities;\n(3) disability service providers;\n(4) disability advocacy groups;\n(5) lead agency staff; and\n(6) staff of state agencies with jurisdiction over special education and disability services.\n(b) Membership in a regional quality council must be representative of the communities in which the council operates, with an emphasis on individuals with lived experience from diverse racial and cultural backgrounds.\n(c) Each regional quality council may hire staff to perform the duties assigned in subdivision 9.\n(a) Each regional quality council shall:\n(1) identify issues and barriers that impede Minnesotans who have disabilities from optimizing choice of home and community-based services;\n(2) promote informed decision-making, autonomy, and self-direction;\n(3) analyze and review quality outcomes and critical incident data, and immediately report incidents of life safety concerns to the Department of Human Services Licensing Division;\n(4) inform a comprehensive system for effective incident reporting, investigation, analysis, and follow-up;\n(5) collaborate on projects and initiatives to advance priorities shared with state agencies, lead agencies, educational institutions, advocacy organizations, community partners, and other entities engaged in disability service improvements;\n(6) establish partnerships and working relationships with individuals and groups in the regions;\n(7) identify and implement regional and statewide quality improvement projects;\n(8) transform systems and drive social change in alignment with the disability rights and disability justice movements identified by leaders who have disabilities;\n(9) provide information and training programs for persons who have disabilities and their families and legal representatives on formal and informal support options and quality expectations;\n(10) make recommendations to state agencies and other key decision-makers regarding disability services and supports;\n(11) submit every two years a report to legislative committees with jurisdiction over disability services on the status, outcomes, improvement priorities, and activities in the region;\n(12) support people by advocating to resolve complaints between the counties, providers, persons receiving services, and their families and legal representatives; and\n(13) recruit, train, and assign duties to regional quality council teams, including council members, interns, and volunteers, taking into account the skills necessary for the team members to be successful in this work.\n(b) Each regional quality council may engage in quality improvement initiatives related to, but not limited to:\n(1) the home and community-based services waiver programs for persons with developmental disabilities under section 256B.092, subdivision 4, or section 256B.49, including brain injuries and services for those persons who qualify for nursing facility level of care or hospital facility level of care and any other services licensed under chapter 245D;\n(2) home care services under section 256B.0651;\n(3) family support grants under section 252.32;\n(4) consumer support grants under section 256.476;\n(5) semi-independent living services under section 252.275; and\n(6) services provided through an intermediate care facility for persons with developmental disabilities.\n(c) Each regional quality council's work must be informed and directed by the needs and desires of persons who have disabilities in the region in which the council operates.\n(a) A member of a regional quality council who does not receive a salary or wages from an employer may be paid a per diem and reimbursed for expenses related to the member's participation in efforts and initiatives described in subdivision 9 in the same manner and in an amount not to exceed the amount authorized by the commissioner's plan adopted under section 43A.18, subdivision 2.\n(b) Regional quality councils may charge fees for their services.",
	"repealed": false
}