{
	"id": "161.1419",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.1419",
	"title": "161.1419 MISSISSIPPI RIVER PARKWAY COMMISSION.",
	"text": "It is declared to be the policy of the state and to be in the best public interest for the promotion of public safety, recreation, travel, trade, and the general welfare of the people to cooperate with the federal government and with the interstate Mississippi River Parkway Planning Commission. To carry out such policy and to aid in the promotion and securement of a scenic parkway and highway for the state of Minnesota and to aid in securing the location of federal parks within Minnesota a Mississippi River Parkway Commission is created. Such commission shall also work toward the planning, construction, maintenance, and improvement of the Great River Road or Mississippi River Parkway which is to follow generally the course of the Mississippi River and extend from Canada to the Gulf of Mexico.\n(a) The commission shall be composed of 15 members of whom:\n(1) one shall be appointed by the commissioner of transportation;\n(2) one shall be appointed by the commissioner of natural resources;\n(3) one shall be appointed by the director of Explore Minnesota Tourism;\n(4) one shall be appointed by the commissioner of agriculture;\n(5) one shall be appointed by the director of the Minnesota Historical Society;\n(6) two shall be members of the senate to be appointed by the Committee on Committees;\n(7) two shall be members of the house of representatives to be appointed by the speaker;\n(8) one shall be the secretary appointed pursuant to subdivision 3; and\n(9) five shall be citizen members appointed to staggered four-year terms by the commission after receiving recommendations from five citizen committees established by the members appointed under clauses (1) to (8), with each citizen committee established within and representing each of the following geographic segments along the Mississippi River:\n(i) Lake Itasca to but not including the city of Grand Rapids;\n(ii) Grand Rapids to but not including the city of Brainerd;\n(iii) Brainerd to but not including the city of Elk River;\n(iv) Elk River to but not including the city of Hastings; and\n(v) Hastings to the Iowa border.\nEach citizen member shall be a resident of the geographic segment that the member represents.\n(b) The members of the commission appointed in paragraph (a), clauses (1) to (8), shall serve for a term expiring at the close of each regular session of the legislature and until their successors are appointed.\n(c) Successor members shall be appointed by the same appointing authorities. Members may be reappointed. Any vacancy shall be filled by the appointing authority. The commissioner of transportation, the commissioner of natural resources, and the director of the Minnesota Historical Society shall be ex officio members, and shall be in addition to the 15 members heretofore provided for. Immediately upon making the appointments to the commission the appointing authorities shall so notify the Mississippi River Parkway Commission, hereinafter called the National Commission, giving the names and addresses of the members so appointed.\nThe commission may hold meetings and hearings at such time and places as it may designate to accomplish the purposes set forth in this section. It shall select a chair, a vice-chair, and such other officers from its membership as it deems necessary. The commission shall appoint a secretary who shall also serve as a commission member.\nThe commission may accept gifts of money, property, or services; may apply for and accept grants from the United States, the state, a subdivision of the state, or a person for any of its purposes; may enter into an agreement required in connection with it; and may hold, use, and dispose of the money, property, or services in accordance with the terms of the gift, grant, or agreement relating to it. The commission may also make grants, gifts, and bequests of money, property, or services and enter into contracts to carry out the same. The gift acceptance procedures of sections 16A.013 to 16A.016 do not apply to this section.\nCompensation of legislative members of the commission is as provided in section 3.101. Compensation of the remaining members is as provided in section 15.0575. The commission may purchase supplies, employ part-time or full-time employees, and do all things reasonably necessary and convenient in carrying out the purposes of this section.\nThe commissioner of transportation shall designate one employee of the Department of Transportation who is an engineer or who has engineering experience and the commissioner of natural resources shall appoint one staff member who shall advise with and assist the commission in carrying out its functions and duties.\nThe commission shall be an affiliate of the National Commission and as a member of the National Commission may pay an annual fee for its equal share of the planning program of the National Commission.\nThe commission may review the programs of the various interstate compacts, studies, planning groups and commissions involved in water and land use activities along the Mississippi River in Minnesota.\nMS 2018 [Repealed, 1Sp2019 c 3 art 3 s 140]",
	"repealed": false
}