{
	"id": "174.525",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.525",
	"title": "174.525 TRANSPORTATION LOAN PILOT PROGRAM.",
	"text": "(a) The commissioner of transportation may conduct a pilot program to apply for and receive financial assistance under the Transportation Infrastructure Finance and Innovation Act of 1998 (TIFIA), United States Code, title 23, chapter 6, or through other federal transportation loan, grant, or credit assistance programs. The assistance may include but is not limited to loans, loan guarantees, and lines of credit.\n(b) The commissioner may enter into agreements to repay the financial assistance as provided in this section, with the approval of the commissioner of management and budget.\n(c) The pilot program under this section is available for a project in Nicollet County to expand a trunk highway from two lanes to four lanes and that was the subject of an Infrastructure for Rebuilding America (INFRA) grant application submitted by the commissioner of transportation to the United States Department of Transportation on February 24, 2020.\nA loan entered into by the commissioners of transportation and management and budget pursuant to subdivision 1 and any interest thereon shall be payable solely from and secured by the revenues appropriated and transferred to the federal transportation loan account established for this purpose in subdivision 4 and investment income thereon and any reserve established for the loan. The loan is not public debt, and the full faith, credit, and taxing powers of the state are not pledged for its payment. The loan and the interest thereon shall not be paid, directly or indirectly, in whole or in part, from a tax of statewide application on any class of property, income, transaction, or privilege.\n(a) During any fiscal year in which a loan under this section is being applied for or is entered into and remains outstanding, the commissioner of transportation must deposit all fees collected from the permits issued under section 169.86, subdivision 5, excluding the fee under section 169.86, subdivision 5, paragraph (i), into the federal transportation loan account under subdivision 4.\n(b) During any fiscal year in which paragraph (a) does not apply, the commissioner of transportation must deposit all fees collected from the permits issued under section 169.86, subdivision 5, into the trunk highway fund.\n(a) A federal transportation loan account is established in the special revenue fund. The account consists of revenue as provided in subdivision 3, and any other money donated, allotted, transferred, or otherwise provided to the account. The account is administered by the commissioner of management and budget.\n(b) Money in the federal transportation loan account, including any investment income, is irrevocably appropriated to the commissioner of management and budget for the payment of the principal and interest on a loan authorized under this section when due, costs of issuance, any reserve, refinancing costs, and necessary administrative expenses associated with the loan. The commissioner of management and budget must consult with the commissioner of transportation regarding expenditures under this paragraph.\n(c) In each fiscal year, the commissioner of management and budget must transfer money in the federal transportation loan account to the trunk highway fund if the commissioners of transportation and management and budget determine that the money is not necessary for the purposes specified in paragraph (b).\n(a) The commissioners of transportation and management and budget may, for and on behalf of the state, enter into such covenants and agreements not inconsistent with this section as may be necessary or desirable to facilitate the execution and delivery of a loan agreement authorized under subdivision 1, on terms favorable to the state, including but not limited to covenants and agreements relating to the payment of and security for the loan agreement and disclosure of information required by the federal government and federal and state securities laws.\n(b) Such covenants and agreements of the commissioners of transportation and management and budget constitute an enforceable contract of the state, and the state shall pledge and agree with the holders of any loan agreement that the state will not limit or alter the rights vested in the commissioners of transportation and management and budget to fulfill the terms of any such covenants or agreements made with the holders of the loan agreement or in any way impair the rights and remedies of the holders until the loan agreement, together with the interest thereon, with interest on any unpaid installments of interest, and all costs and expenses in connection with any action or proceeding by or on behalf of such holders, are fully met and discharged. The commissioners of transportation and management and budget are authorized to include this pledge and agreement of the state in any covenant or agreement with the holders of such loan agreement.\n(c) Such covenants may also include covenants to seek increased fees under section 169.86, subdivision 5, so long as any loan agreement issued pursuant to this section is outstanding.\n(d) A loan entered into pursuant to this section must be treated like certificates of indebtedness under sections 16A.672 and 16A.675.\nSubdivision 3 does not apply to any permit described in section 169.86, subdivision 5, that is determined by the attorney general or a court of competent jurisdiction to be a tax, provided that nothing in section 645.44, subdivision 19, prevents a deposit under subdivision 3.\nThe waiver of immunity by the state provided for by section 3.751, subdivision 1, applies to the loan, any certificates of indebtedness, and any ancillary contracts to which the commissioners of transportation and management and budget are parties under this section.\n(a) Upon completion of the transportation project under the pilot program, the commissioner of transportation must submit a report on the pilot program to the chairs and ranking minority members of the legislative committees having jurisdiction over transportation policy and finance. At a minimum, the report must: describe the transportation project undertaken and each financing mechanism utilized; analyze the effectiveness of each financing mechanism; evaluate the costs, risks, and benefits of additional participation in federal financial assistance programs; and provide any recommendations for related legislative changes.\n(b) Annually by December 1, the commissioners of transportation and management and budget must submit a report on the loan entered into pursuant to this section to the chairs and ranking minority members of the legislative committees having jurisdiction over transportation policy and finance. The report must include the following information for the previous fiscal year:\n(1) the amount of funds deposited into the federal transportation loan account and the source of the funds;\n(2) the amount of funds transferred to the trunk highway fund and the date of the transfer;\n(3) the amount in the account at the close of the most recent fiscal year;\n(4) the amount and timing of payments made on the loan entered into pursuant to this section; and\n(5) the amount held in reserve in the account.\nThe report must also include a recommendation of the necessary reserve amount for the current fiscal year and for the next fiscal year. A report is only required under this paragraph if a loan entered into pursuant to this section was outstanding in the previous fiscal year.",
	"repealed": false
}