{
	"id": "144.2252",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.2252",
	"title": "144.2252 ACCESS TO ORIGINAL BIRTH RECORD AFTER ADOPTION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Person related to the adopted person\" means:\n(1) the spouse, child, or grandchild of an adopted person, if the spouse, child, or grandchild is at least 18 years of age; or\n(2) the legal representative of an adopted person.\nThe definition under this paragraph only applies when the adopted person is deceased.\n(c) \"Original birth record\" means a copy of the original birth record for a person who is born in Minnesota and whose original birth record was sealed and replaced by a replacement birth record after the state registrar received a certified copy of an order, decree, or certificate of adoption.\n(a) The state registrar must provide to an adopted person who is 18 years of age or older or a person related to the adopted person a copy of the adopted person's original birth record and any evidence of the adoption previously filed with the state registrar. To receive a copy of an original birth record under this subdivision, the adopted person or person related to the adopted person must make the request to the state registrar in writing. The copy of the original birth record must clearly indicate that it may not be used for identification purposes. All procedures, fees, and waiting periods applicable to a nonadopted person's request for a copy of a birth record apply in the same manner as requests made under this section.\n(b) If a contact preference form is attached to the original birth record as authorized under section 144.2253, the state registrar must provide a copy of the contact preference form along with the copy of the adopted person's original birth record.\n(c) The state registrar shall provide a transcript of an adopted person's original birth record to an authorized representative of a federally recognized American Indian Tribe for the sole purpose of determining the adopted person's eligibility for enrollment or membership. Information contained in the birth record may not be used to provide the adopted person information about the person's birth parents, except as provided in this section or section 259.83.\n(d) For a replacement birth record issued under section 144.218, the adopted person or a person related to the adopted person may obtain from the state registrar copies of the order or decree of adoption, certificate of adoption, or decree issued under section 259.60, as filed with the state registrar.\n(e) The state registrar may request assistance from the commissioner of children, youth, and families if needed to discharge duties under this section, as authorized under section 259.79.\nNotwithstanding section 144.218, a person adopted as an adult may access the person's birth records that existed before the person's adult adoption. Access to the existing birth records shall be the same access that was permitted prior to the adult adoption.",
	"repealed": false
}