{
	"id": "62E.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.14",
	"title": "62E.14 ENROLLMENT BY AN ELIGIBLE PERSON.",
	"text": "The comprehensive health insurance plan shall be open for enrollment by eligible persons. An eligible person shall enroll by submission of an application to the writing carrier. The application must provide the following:\n(a) name, address, age, list of residences for the immediately preceding six months and length of time at current residence of the applicant;\n(b) name, address, and age of spouse and children if any, if they are to be insured;\n(c) evidence of rejection, a requirement of restrictive riders, a rate up, or a preexisting conditions limitation on a qualified plan, the effect of which is to substantially reduce coverage from that received by a person considered a standard risk, by at least one association member within six months of the date of the application, or other eligibility requirements adopted by rule by the commissioner which are not inconsistent with this chapter and which evidence that a person is unable to obtain coverage substantially similar to that which may be obtained by a person who is considered a standard risk;\n(d) if the applicant has been terminated from individual health coverage which does not provide replacement coverage, evidence that no replacement coverage that meets the requirements of section 62D.121 was offered, and evidence of termination of individual health coverage by an insurer, nonprofit health service plan corporation, or health maintenance organization, provided that the contract or policy has been terminated for reasons other than (1) failure to pay the charge for health care coverage; (2) failure to make co-payments required by the health care plan; (3) enrollee moving out of the area served; or (4) a materially false statement or misrepresentation by the enrollee in the application for the terminated contract or policy; and\n(e) a designation of the coverage desired.\nAn eligible person may not purchase more than one policy from the state plan. Upon ceasing to be a resident of Minnesota a person is no longer eligible to purchase or renew coverage under the state plan, except as required by state or federal law with respect to renewal of Medicare supplement coverage.\nWithin 30 days of receipt of the application described in subdivision 1, the writing carrier shall either reject the application for failing to comply with the requirements in subdivision 1 or forward the eligible person a notice of acceptance and billing information. If the applicant otherwise complies with the requirements of sections 62E.01 to 62E.19, insurance shall be effective immediately upon receipt of the first month's state plan premium, and shall be retroactive to the date the application was received by the writing carrier, unless a different effective date is provided in this section.\nA person who obtains coverage pursuant to this section is not covered for any preexisting condition during the first six months of coverage under the state plan if the person was diagnosed or treated for that condition during the 90 days immediately preceding the date the application was received by the writing carrier, except as provided under subdivisions 3a, 4, 4a, 4b, 4c, 4d, 4e, 5, 6, and 7 and section 62E.18.\nA person may enroll in the comprehensive health plan with a waiver of the preexisting condition limitation described in section 62E.14, subdivision 3, provided that the person meets the following requirements:\n(1) group coverage was provided through a rehabilitation facility defined in section 268A.01, subdivision 6, and coverage was terminated;\n(2) all other eligibility requirements for enrollment in the comprehensive health plan are met; and\n(3) the person submitted an application that was received by the writing carrier no later than 90 days after termination of previous coverage.\nNotwithstanding the above, any Minnesota resident holder of a policy or certificate of Medicare supplement coverages pursuant to sections 62A.315 and 62A.316, or Medicare supplement plans previously approved by the commissioner, may enroll in the comprehensive health insurance plan as described in section 62E.07, with a waiver of the preexisting condition as described in subdivision 3, without interruption in coverage, provided that the policy or certificate has been terminated by the insurer for reasons other than nonpayment of premium and, provided further that the option to enroll in the plan is exercised through submitting an application received by the writing carrier no later than 90 days after termination of the existing contract or certificate.\nCoverage in the state plan for purposes of this section shall be effective on the date of termination upon receipt of the proper application by the writing carrier and payment of the required premium. The application must include evidence of termination of the existing policy or certificate.\nA person may enroll in the comprehensive health plan with a waiver of the preexisting condition limitation described in subdivision 3, provided that the following requirements are met:\n(1) the person is a Minnesota resident eligible to enroll in the comprehensive health plan;\n(2) the person:\n(a) would be eligible for continuation under federal or state law if continuation coverage were available or were required to be available;\n(b) would be eligible for continuation under clause (a) except that the person was exercising continuation rights and the continuation period required under federal or state law has expired; or\n(c) is eligible for continuation of health coverage under federal or state law;\n(3) continuation coverage is not available; and\n(4) the person's application for coverage is received by the writing carrier no later than 90 days after termination of prior coverage from a policy or plan.\nCoverage in the comprehensive health plan is effective on the date of termination of prior coverage. The availability of conversion rights does not affect a person's rights under this subdivision.\nA person who was covered by a retiree health care plan may enroll in the comprehensive health plan with a waiver of the preexisting condition limitation described in subdivision 3, provided that the following requirements are met:\n(1) the person is a Minnesota resident eligible to enroll in the comprehensive health plan;\n(2) the person was covered by a retiree health care plan from an employer and the coverage is no longer available to the person; and\n(3) the person's application for coverage is received by the writing carrier no later than 90 days after termination of prior coverage.\nCoverage in the comprehensive health plan is effective on the date of termination of prior coverage. The availability of conversion rights does not affect a person's rights under this section.\n(a) A Minnesota resident may enroll in the comprehensive health plan with a waiver of the preexisting condition limitation described in subdivision 3 if that persons's application for coverage is received by the writing carrier no later than 90 days after termination of prior coverage and if the termination is for reasons other than fraud or nonpayment of premiums.\nFor purposes of this paragraph, termination of prior coverage includes exceeding the maximum lifetime benefit of existing coverage.\nCoverage in the comprehensive health plan is effective on the date of termination of prior coverage. The availability of conversion rights does not affect a person's rights under this paragraph.\nThis section does not apply to prior coverage provided under policies designed primarily to provide coverage payable on a per diem, fixed indemnity, or nonexpense incurred basis, or policies providing only accident coverage.\n(b) An eligible individual, as defined under the Health Insurance Portability and Accountability Act (HIPAA), United States Code, chapter 42, section 300gg-41(b), may enroll in the comprehensive health insurance plan with a waiver of the preexisting condition limitation described in subdivision 3 and a waiver of the evidence of rejection or similar events described in subdivision 1, clause (c). The eligible individual must apply for enrollment under this paragraph by submitting a substantially complete application that is received by the writing carrier no later than 63 days after termination of prior coverage, and coverage under the comprehensive health insurance plan is effective as of the date of receipt of the complete application. The six-month durational residency requirement provided in section 62E.02, subdivision 13, does not apply with respect to eligibility for enrollment under this paragraph, but the applicant must be a Minnesota resident as of the date that the application was received by the writing carrier. A person's eligibility to enroll under this paragraph does not affect the person's eligibility to enroll under any other provision.\n(c) A qualifying individual, as defined in the Internal Revenue Code of 1986, section 35(e)(2)(B), who is eligible under the federal Trade Act of 2002 for the Health Coverage Tax Credit (HCTC) for health insurance costs under the Internal Revenue Code of 1986, section 35, may enroll in the comprehensive health insurance plan with a waiver of the preexisting condition limitation described in subdivision 3, and without presenting evidence of rejection or similar requirements described in subdivision 1, paragraph (c). The six-month durational residency requirement provided in section 62E.02, subdivision 13, does not apply with respect to eligibility for enrollment under this paragraph, but the applicant must be a Minnesota resident as of the date of application. A person's eligibility to enroll under this paragraph does not affect the person's eligibility to enroll under any other provision. This paragraph is intended solely to meet the minimum requirements necessary to qualify the comprehensive health insurance plan as qualified health coverage under the Internal Revenue Code of 1986, section 35(e)(2).\nA Minnesota resident who is otherwise eligible may enroll in the comprehensive health insurance plan with a waiver of the preexisting condition limitation described in subdivision 3, if that person submits an application for coverage that is received by the writing carrier no later than 90 days after termination of prior coverage due to the insolvency of the insurer.\nCoverage in the comprehensive insurance plan is effective on the date of termination of prior coverage. The availability of conversion rights does not affect a person's rights under this subdivision.\nA person may enroll in the comprehensive plan with a waiver of the preexisting condition limitation in subdivision 3, provided that:\n(1) the person was formerly enrolled in the medical assistance or MinnesotaCare program;\n(2) the person is a Minnesota resident; and\n(3) the person submits an application for coverage that is received by the writing carrier no later than 90 days after termination from medical assistance or MinnesotaCare program.\nA person may enroll in the comprehensive plan, with a waiver of preexisting condition limitation in subdivision 3, if the following requirements are met:\n(1) the person was formerly enrolled in a community-based health care coverage program under section 62Q.80;\n(2) the person is a Minnesota resident; and\n(3) the person submits an application for coverage that is received by the writing carrier no later than 90 days after coverage under the community-based health care program is terminated. For purposes of this clause, termination of coverage includes exceeding the maximum lifetime or annual benefit on existing coverage, or moving out of an area served by the program.\nA person may enroll in the comprehensive plan with a waiver of the preexisting condition limitation in subdivision 3 if the person is eligible for the healthy Minnesota contribution program, and has been denied coverage. The six-month durational residency requirement specified in section 62E.02, subdivision 13, does not apply to individuals enrolled in the healthy Minnesota contribution program.\nAn employee who is voluntarily or involuntarily terminated or laid off from employment and unable to exercise the option to continue coverage under section 62A.17, and who is a Minnesota resident and who is otherwise eligible, may enroll in the comprehensive health insurance plan, by submitting an application that is received by the writing carrier no later than 90 days after termination or layoff, with a waiver of the preexisting condition limitation set forth in subdivision 3.\nA Minnesota resident who holds an individual health maintenance contract, individual nonprofit health service corporation contract, or an individual insurance policy previously approved by the commissioners of health or commerce, may enroll in the comprehensive health insurance plan with a waiver of the preexisting condition as described in subdivision 3, without interruption in coverage, provided (1) no replacement coverage that meets the requirements of section 62D.121 was offered by the contributing member, and (2) the policy or contract has been terminated for reasons other than (a) nonpayment of premium; (b) failure to make co-payments required by the health care plan; (c) moving out of the area served; or (d) a materially false statement or misrepresentation by the enrollee in the application for the terminated policy or contract; and, provided further, that the option to enroll in the plan is exercised by submitting an application that is received by the writing carrier no later than 90 days after termination of the existing policy or contract.\nCoverage allowed under this section is effective when the contract or policy is terminated and the enrollee has submitted the proper application that is received within the time period stated in this subdivision and paid the required premium or fee.\nExpenses incurred from the preexisting conditions of individuals enrolled in the state plan under this subdivision must be paid by the contributing member canceling coverage as set forth in section 62E.11, subdivision 10.\nThe application must include evidence of termination of the existing policy or certificate as required in subdivision 1.\n(a) A Minnesota resident who is covered by a conversion policy or contract of health coverage may enroll in the comprehensive health plan with a waiver of the preexisting condition limitation in subdivision 3 and a waiver of the evidence of rejection in subdivision 1, paragraph (c), at any time for any reason by submitting an application that is received by the writing carrier during the term of coverage.\n(b) A Minnesota resident who was covered by a conversion policy or contract of health coverage may enroll in the comprehensive health plan with a waiver of the preexisting condition limitation in subdivision 3 and a waiver of the evidence of rejection in subdivision 1, paragraph (c), if that person applies for coverage by submitting an application that is received by the writing carrier no later than 90 days after termination of the conversion policy or contract coverage regardless of: (1) the reasons for the termination; or (2) the party terminating coverage.\n(c) Coverage under this subdivision is effective upon termination of prior coverage if the enrollee has submitted a completed application that is received within the time period stated in paragraph (a) or (b), whichever applies, and paid the required premium or fee.",
	"repealed": false
}