{
	"id": "473.123",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.123",
	"title": "473.123 METROPOLITAN COUNCIL.",
	"text": "A Metropolitan Council with jurisdiction in the metropolitan area is established as a public corporation and political subdivision of the state. It shall be under the supervision and control of 17 members, all of whom shall be residents of the metropolitan area.\nMS 1982 [Repealed, 1983 c 16 s 15]\nFollowing each apportionment of council districts, as provided under subdivision 3a, council members must be appointed from newly drawn districts as provided in subdivision 3a. Each council member, other than the chair, must reside in the council district represented. Each council district must be represented by one member of the council. The terms of members end with the term of the governor, except that all terms expire on the effective date of the next apportionment. A member serves at the pleasure of the governor. A member shall continue to serve the member's district until a successor is appointed and qualified; except that, following each apportionment, the member shall continue to serve at large until the governor appoints 16 council members, one from each of the newly drawn council districts as provided under subdivision 3a, to serve terms as provided under this section. The appointment to the council must be made by the first Monday in March of the year in which the term ends.\n(a) Sixteen members must be appointed by the governor from districts defined by this section. Each council member must reside in the council district represented. Each council district must be represented by one member of the council.\n(b) In addition to the notice required by section 15.0597, subdivision 4, notice of vacancies and expiration of terms must be published in newspapers of general circulation in the metropolitan area and the appropriate districts. The governing bodies of the statutory and home rule charter cities, counties, and towns having territory in the district for which a member is to be appointed must be notified in writing. The notices must describe the appointments process and invite participation and recommendations on the appointment.\n(c) The governor shall create a nominating committee, composed of seven metropolitan citizens appointed by the governor, to nominate persons for appointment to the council from districts. Three of the committee members must be local elected officials. Following the submission of applications as provided under section 15.0597, subdivision 5, the nominating committee shall conduct public meetings, after appropriate notice, to accept statements from or on behalf of persons who have applied or been nominated for appointment and to allow consultation with and secure the advice of the public and local elected officials. The committee shall hold the meeting on each appointment in the district or in a reasonably convenient and accessible location in the part of the metropolitan area in which the district is located. The committee may consolidate meetings. Following the meetings, the committee shall submit to the governor a list of nominees for each appointment. The governor is not required to appoint from the list.\n(d) Before making an appointment, the governor shall consult with all members of the legislature from the council district for which the member is to be appointed.\n(e) Appointments to the council are subject to the advice and consent of the senate as provided in section 15.066.\n(f) Members of the council must be appointed to reflect fairly the various demographic, political, and other interests in the metropolitan area and the districts.\n(g) Members of the council must be persons knowledgeable about urban and metropolitan affairs.\n(h) Any vacancy in the office of a council member shall immediately be filled for the unexpired term. In filling a vacancy, the governor may forgo the requirements of paragraph (c) if the governor has made appointments in full compliance with the requirements of this subdivision within the preceding 12 months.\nThe legislature shall redraw the boundaries of the council districts after each decennial federal census so that each district has substantially equal population. Redistricting is effective in the year ending in the numeral \"3.\" Within 60 days after a redistricting plan takes effect, the governor shall appoint members from the newly drawn districts to serve terms as provided under subdivision 2a.\nMS 1992 [Repealed, 1993 c 314 s 7]\nMS 2002 [Repealed, 1Sp2003 c 16 s 11]\nMS 2012 [Repealed, 2013 c 66 s 3]\nMS 2022 [Repealed, 2023 c 42 s 3]\nMetropolitan Council plan MC2023-2, on file with the Geographical Information Systems Office of the Legislative Coordinating Commission and published on its website on March 21, 2023, is adopted and constitutes the redistricting plan required by subdivision 3a. The boundaries of each Metropolitan Council district are as described in that plan.\n(a) The chair of the Metropolitan Council shall be appointed by the governor as the 17th voting member thereof by and with the advice and consent of the senate to serve at the pleasure of the governor to represent the metropolitan area at large. Senate confirmation shall be as provided by section 15.066.\nThe chair of the Metropolitan Council shall, if present, preside at meetings of the council, have the primary responsibility for meeting with local elected officials, serve as the principal legislative liaison, present to the governor and the legislature, after council approval, the council's plans for regional governance and operations, serve as the principal spokesperson of the council, and perform other duties assigned by the council or by law.\n(b) The Metropolitan Council shall elect other officers as it deems necessary for the conduct of its affairs for a one-year term. A secretary and treasurer need not be members of the Metropolitan Council. Meeting times and places shall be fixed by the Metropolitan Council and special meetings may be called by a majority of the members of the Metropolitan Council or by the chair. The chair and each Metropolitan Council member shall be reimbursed for actual and necessary expenses.\n(c) Each member of the council shall attend and participate in council meetings and meet regularly with local elected officials and legislative members from the council member's district. Each council member shall serve on at least one division committee for transportation, environment, or community development.\n(d) In the performance of its duties the Metropolitan Council may adopt policies and procedures governing its operation, establish committees, and, when specifically authorized by law, make appointments to other governmental agencies and districts.\nMS 1992 [Repealed, 1994 c 628 art 1 s 10]\nMS 1992 [Repealed, 1994 c 628 art 1 s 10]\nMS 2013 Supp [Repealed, 2014 c 271 art 3 s 22]\nThe council may appoint a general counsel to serve at the pleasure of the council.",
	"repealed": false
}