{
	"id": "79A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.02",
	"title": "79A.02 SELF-INSURERS' ADVISORY COMMITTEE.",
	"text": "For the purposes of assisting the commissioner, there is established a Workers' Compensation Self-insurers' Advisory Committee of five members that are employers authorized to self-insure in Minnesota. Three of the members and three alternates shall be elected by the self-insurers' security fund board of trustees and two members and two alternates shall be appointed by the commissioner.\nAt the request of the commissioner, the committee shall meet and shall advise the commissioner with respect to whether or not an applicant to become a private self-insurer in the state of Minnesota has met the statutory requirements to self-insure. The Department of Commerce may furnish the committee with any financial data which it has, but a member of the advisory committee who may have a conflict of interest in reviewing the financial data shall not have access to the data nor participate in the discussions concerning the applicant. Financial data received from the commissioner is nonpublic data. The committee shall advise the commissioner if it has any information that any private self-insurer may become insolvent.\n(a) The self-insurers' security fund may retain a certified public accountant to perform services for, and report directly to, the commissioner of commerce. When requested by the Workers' Compensation Self-Insurers' Advisory Committee, the certified public accountant shall review an application to self-insure, including the applicant's financial data. The certified public accountant shall provide a report to the commissioner of commerce indicating whether that applicant has met the requirements of section 79A.03, subdivisions 2 and 3. Additionally, the certified public accountant shall provide advice and counsel to the commissioner about relevant facts regarding that applicant's financial condition.\n(b) If the report of the certified public accountant is used by the commissioner as the basis for the commissioner's determination regarding the applicant's self-insurance status, the certified public accountant shall be made available to the commissioner for any hearings or other proceedings arising from that determination.\n(c) The commissioner shall provide the advisory committee with the summary report by the certified public accountant and any financial data in possession of the Department of Commerce that is otherwise available to the public.\nThe cost of the review shall be the obligation of the self-insurer's security fund.\nAfter each fifth anniversary from the date each individual and group self-insurer becomes certified to self-insure, the committee shall review all relevant financial data filed with the Department of Commerce that is otherwise available to the public and make a recommendation to the commissioner about whether each self-insurer's certificate should be revoked. For group self-insurers who have been in existence for five years or more and have been granted renewal authority, a level of funding in the common claims fund must be maintained at not less than the greater of either: (1) one year's claim losses paid in the most recent year; or (2) one-third of the security deposit posted with the Department of Commerce according to section 79A.04, subdivision 2.",
	"repealed": false
}