{
	"id": "165.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/165.03",
	"title": "165.03 STRENGTH OF BRIDGE; INSPECTION.",
	"text": "Each bridge, including a privately owned bridge, must conform to the strength, width, clearance, and safety standards imposed by the commissioner for the connecting highway or street. This subdivision applies to a bridge that is constructed after August 1, 1989, on any public highway or street. The bridge must have sufficient strength to support with safety the maximum vehicle weights allowed under sections 169.822 to 169.829 and must have the minimum width specified in section 165.04, subdivision 3.\n(a) Each bridge must be inspected annually, unless a longer interval not to exceed 24 months for bridges or 48 months for bridges classified as culverts is authorized by the commissioner. The commissioner's authorization must be based on factors including, but not limited to, the age and condition of the bridge, the rate of deterioration of the bridge, the type of structure, the susceptibility of the bridge to failure, and the characteristics of traffic on the bridge. The commissioner may require interim inspections at intervals of less than one year on bridges that are posted, bridges subjected to extreme scour conditions, bridges subject to significant substructure movement or settlement, and for other reasons as specified or inferred in the AASHTO manual.\n(b) Additional requirements apply to structures meeting the NBIS definition of a bridge:\n(1) Underwater structural elements must be inspected at regular intervals not to exceed 60 months. The commissioner may require inspections at intervals of less than 60 months on certain underwater structural elements based on factors including, but not limited to, construction material, environment, age, scour characteristics, the condition ratings from past inspections, and any known deficiencies.\n(2) Fracture critical members, or FCMs, must receive a hands-on fracture critical inspection at intervals not to exceed 24 months. The commissioner may require inspections at intervals of less than 24 months on certain FCMs based on factors including, but not limited to, age, traffic characteristics, and any known deficiencies.\n(3) The commissioner may establish criteria to determine the level and frequency of these inspections. If warranted by special circumstances, the commissioner retains the authority to determine the inspection type and required inspection frequency for any bridge on the state inventory.\n(c) The thoroughness of each inspection depends on such factors as age, traffic characteristics, state of maintenance, and known deficiencies. The evaluation of these factors is the responsibility of the engineer assigned the responsibility for inspection as defined by the commissioner of transportation.\n(a) The commissioner of transportation will adopt the National Bridge Inspection Standards (NBIS) established by the Federal Highway Administration in Code of Federal Regulations, title 23, part 650, subpart C, or its successor documents, for structures meeting the NBIS definition of a bridge. The commissioner shall establish inspection and inventory standards for structures defined as bridges by section 165.01, subdivision 3.\n(b) The commissioner of transportation shall adopt official inventory and bridge inspection report forms for use in making bridge inspections by the owners or highway authorities specified by this subdivision. Inspections must be made at regular intervals, not to exceed the intervals outlined in subdivision 1a, by the following owner or official:\n(1) the commissioner of transportation for all bridges located wholly or partially within or over the right-of-way of a state trunk highway;\n(2) the county highway engineer for all bridges located wholly or partially within or over the right-of-way of any county or town road, or any street within a municipality that does not have a city engineer regularly employed;\n(3) the city engineer for all bridges located wholly or partially within or over the right-of-way of any street located within or along municipal limits;\n(4) the commissioner of transportation in case of a toll bridge that is used by the general public and that is not inspected and certified under subdivision 6; provided, that the commissioner of transportation may assess the owner for the costs of the inspection;\n(5) the owner of a bridge over a public highway or street or that carries a roadway designated for public use by a public authority, if not required to be inventoried and inspected under clause (1), (2), (3), or (4).\n(c) The commissioner of transportation shall prescribe the inspection and inventory procedures required to administer the bridge inspection program in Minnesota and has the authority to establish and publish standards that describe the inspection and inventory requirements to ensure compliance with paragraph (a). The owner or highway authority shall inspect and inventory in accordance with these standards and furnish the commissioner with such data as may be necessary to maintain a central inventory.\nThe county engineer shall maintain a complete inventory record of all bridges as set forth in subdivision 2, paragraph (b), clause (2), with the inspection reports thereof, and shall certify annually to the commissioner, as prescribed by the commissioner, that inspections have been made at regular intervals, not to exceed the intervals outlined in subdivision 1a. A report of the inspections must be filed annually, on or before February 15 of each year, with the county auditor or town clerk, or the governing body of the municipality. The report must identify any deficiency requiring action, including the legal posting of load limits or the need to have a load rating analysis performed, on any bridge or structure that is found to be understrength or unsafe. The report may also contain other recommendations for improving the safety of understrength or unsafe bridges.\nThe city engineer shall maintain a complete inventory record of all bridges as set forth in subdivision 2, paragraph (b), clause (3), with the inspection reports thereof, and shall certify annually to the commissioner, as prescribed by the commissioner, that inspections have been made at regular intervals, not to exceed the intervals outlined in subdivision 1a. A report of the inspections must be filed annually, on or before February 15 of each year, with the governing body of the municipality. The report must contain recommendations for the correction of or legal posting of load limits on any bridge or structure that is found to be understrength or unsafe.\nAgreements may be made among the various units of governments, or between governmental units and qualified engineering personnel to carry out the responsibilities for the bridge inspections and reports, as established by subdivision 2.\nThe owner of a toll bridge and the owner of a bridge described in subdivision 2, paragraph (b), clause (5), shall certify to the commissioner, as prescribed by the commissioner, that inspections of the bridge or culvert have been made at regular intervals, not to exceed the intervals outlined in subdivision 1a. The certification must be accompanied by a report of the inspection. The report must contain recommendations for the correction of or legal posting of load limitations if the bridge is found to be understrength or unsafe.\n(a) The term \"posting\" means the placement of regulatory signs at a bridge indicating the safe load carrying capacity of the bridge.\n(b) Each structure required to be inspected under subdivision 2, paragraph (a), must be load rated to determine its safe load carrying capacity, and this rating must be reported on a structure inventory sheet form provided by the commissioner of transportation. A structure must be rerated when it is determined that a significant change has occurred in the condition of the structure or due to additional dead load placed on the structure since the last load rating. Load ratings must be reviewed and the structure rerated if necessary when the allowable legal load using the structure is increased. Changes in the load rating of a bridge must be indicated on the structure inventory sheet form.\n(c) If it is determined that the maximum legal load under state law exceeds the load permitted on the structure under the operating rating stress level assigned, the bridge must be posted. Posting signs adopted by the commissioner shall be used for the posting. The owner or highway authority shall post the bridge in accordance with the posted load assigned by the commissioner.\n(a) Notwithstanding subdivision 2, the commissioners of transportation and natural resources shall negotiate a memorandum of understanding that governs the inspection of bridges owned, operated, or maintained by the commissioner of natural resources.\n(b) The memorandum of understanding must provide for:\n(1) the inspection and inventory of bridges subject to federal law or regulations;\n(2) the frequency of inspection of bridges described in subdivision 1a; and\n(3) who may perform inspections required under the memorandum of understanding.\nBy February 1 of each odd-numbered year, the commissioner shall submit a report electronically to the members of the senate and house of representatives committees with jurisdiction over transportation policy and finance concerning quality assurance for bridge inspections. At a minimum, the report must:\n(1) summarize the bridge inspection quality assurance and quality control procedures used in Minnesota;\n(2) identify any substantive changes to quality assurance and quality control procedures made in the previous two years;\n(3) summarize and provide a briefing on findings from bridge inspection quality reviews performed in the previous two years;\n(4) identify actions taken and planned in response to findings from bridge inspection quality reviews performed in the previous two years;\n(5) summarize the results of any bridge inspection compliance review by the Federal Highway Administration; and\n(6) identify actions in response to the Federal Highway Administration compliance review taken by the department in order to reach full compliance.",
	"repealed": false
}