{
	"id": "216B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.02",
	"title": "216B.02 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Commission\" means the Public Utilities Commission.\n\"Commissioner\" means the commissioner of the Minnesota Department of Commerce.\n\"Corporation\" means a private corporation, a public corporation, a municipality, an association, a cooperative whether incorporated or not, a joint stock association, a business trust, or any political subdivision or agency.\n\"Department\" means the Department of Commerce of the state of Minnesota.\n\"Municipality\" means any city however organized.\n\"Person\" means a natural person, a partnership, or two or more persons having a joint or common interest, and a corporation as hereinbefore defined.\n\"Propane\" means a gas made of primarily propane and butane, and stored in liquid form in pressurized tanks.\n\"Propane storage facility\" means a facility designed to store or capable of storing propane in liquid form in pressurized tanks.\n\"Public utility\" means persons, corporations, or other legal entities, their lessees, trustees, and receivers, now or hereafter operating, maintaining, or controlling in this state equipment or facilities for furnishing at retail natural, manufactured, or mixed gas or electric service to or for the public or engaged in the production and retail sale thereof but does not include (1) a municipality or a cooperative electric association, organized under the provisions of chapter 308A, producing or furnishing natural, manufactured, or mixed gas or electric service; (2) a retail seller of compressed natural gas used as a vehicular fuel which purchases the gas from a public utility; or (3) a retail seller of electricity used to recharge a battery that powers an electric vehicle, as defined in section 169.011, subdivision 26a, and that is not otherwise a public utility under this chapter. Except as otherwise provided, the provisions of this chapter shall not be applicable to any sale of natural, manufactured, or mixed gas or electricity by a public utility to another public utility for resale. In addition, the provisions of this chapter shall not apply to a public utility whose total natural gas business consists of supplying natural, manufactured, or mixed gas to not more than 650 customers within a city pursuant to a franchise granted by the city, provided a resolution of the city council requesting exemption from regulation is filed with the commission. The city council may rescind the resolution requesting exemption at any time, and, upon the filing of the rescinding resolution with the commission, the provisions of this chapter shall apply to the public utility. No person shall be deemed to be a public utility if it furnishes its services only to tenants or cooperative or condominium owners in buildings owned, leased, or operated by such person. No person shall be deemed to be a public utility if it furnishes service to occupants of a manufactured home or trailer park owned, leased, or operated by such person. No person shall be deemed to be a public utility if it produces or furnishes service to less than 25 persons.\n\"Rate\" means every compensation, charge, fare, toll, tariff, rental, and classification, or any of them, demanded, observed, charged, or collected by any public utility for any service and any rules, practices, or contracts affecting any such compensation, charge, fare, toll, rental, tariff, or classification.\n\"Service\" means natural, manufactured, or mixed gas and electricity; the installation, removal, or repair of equipment or facilities for delivering or measuring such gas and electricity.\n\"Submetering\" means measuring, by a building's owner, through mechanical or electronic devices, the use of electricity by occupants in multiple-unit residential or commercial buildings to fairly apportion the entire electrical costs for the building among its occupants.\n\"Synthetic gas\" means flammable gas created from (1) gaseous, liquid, or solid hydrocarbons, or (2) other organic or inorganic matter. Synthetic gas includes hydrogen or methane produced through processing, but does not include propane.\n[Renumbered subd 1a]\n[Renumbered subd 2a]\n[Renumbered subd 2b]\n\"Transmission company\" means persons, corporations, or other legal entities and their lessees, trustees, and receivers, engaged in the business of owning, operating, maintaining, or controlling in this state equipment or facilities for furnishing electric transmission service in Minnesota, but does not include public utilities, municipal electric utilities, municipal power agencies, cooperative electric associations, or generation and transmission cooperative power associations.",
	"repealed": false
}