{
	"id": "147D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/147D.01",
	"title": "147D.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Advisory council\" means the Advisory Council of Traditional Midwifery established under section 147D.25.\n\"Approved education program\" means a university, college, or other education program leading to eligibility for certification in midwifery that is approved or accredited by the Midwifery Education and Accreditation Council (MEAC) or its successor, or a national accrediting organization recommended by the advisory council and approved by the board.\n\"Board\" means the Board of Medical Practice.\n\"Contact hour\" means 50 consecutive minutes, excluding coffee breaks, registration, meals without a speaker, and social activities, of a board-approved learning experience either through an instructional session or clinical practice.\n\"Credential\" means a license, permit, certification, registration, or other evidence of qualification or authorization to engage in the practice of traditional midwifery in this state or any other state.\n\"Credentialing examination\" means an examination administered by the North American Registry of Midwives (NARM) or its successor, or other national testing organization recommended by the advisory council and approved by the board for credentialing as a licensed traditional midwife. A credentialing examination must include a written examination and a skills assessment.\n\"Normal pregnancy\" means a pregnancy that is progressing and proceeding spontaneously without the need for medical intervention or the use of instruments and where spontaneous onset of labor occurs between 37 and 42 weeks.\n\"Traditional midwifery services\" means the assessment and care of a woman and newborn during pregnancy, labor, birth, and the postpartum period outside a hospital.\n\"Transfer of care\" means transferring, during the course of pregnancy, the responsibility of providing services to a client from the traditional midwife to a licensed health care provider.\n\"Transport\" means the transferring during labor, birth, or the postpartum period of the client to a hospital.",
	"repealed": false
}