{
	"id": "169.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.045",
	"title": "169.045 SPECIAL VEHICLE USE ON ROADWAY.",
	"text": "The governing body of any county, home rule charter or statutory city, or town may by ordinance authorize the operation of motorized golf carts, all-terrain vehicles, utility task vehicles, or mini trucks, on designated roadways or portions thereof under its jurisdiction. Authorization to operate a motorized golf cart, all-terrain vehicle, utility task vehicle, or mini truck is by permit only. For purposes of this section:\n(1) an all-terrain vehicle has the meaning given in section 84.92;\n(2) a mini truck has the meaning given in section 169.011, subdivision 40a; and\n(3) a utility task vehicle means a side-by-side, four-wheel drive, off-road vehicle that has four wheels, is propelled by an internal combustion engine with a piston displacement capacity of 1,200 cubic centimeters or less, and has a total dry weight of 1,800 but less than 2,600 pounds.\nThe ordinance shall designate the roadways, prescribe the form of the application for the permit, require evidence of insurance complying with the provisions of section 65B.48, subdivision 5 and may prescribe conditions, not inconsistent with the provisions of this section, under which a permit may be granted. Permits may be granted for a period not to exceed three years, and may be renewed. A permit may be revoked at any time if there is evidence that the permittee cannot safely operate the motorized golf cart, all-terrain vehicle, utility task vehicle, or mini truck on the designated roadways. The ordinance may require, as a condition to obtaining a permit, that the applicant submit a certificate signed by a physician that the applicant is able to safely operate a motorized golf cart, all-terrain vehicle, utility task vehicle, or mini truck on the roadways designated.\nMotorized golf carts, all-terrain vehicles, and utility task vehicles may only be operated on designated roadways from sunrise to sunset, unless equipped with original equipment headlights, taillights, and rear-facing brake lights. They shall not be operated in inclement weather, except during emergency conditions as provided in the ordinance, or when visibility is impaired by weather, smoke, fog or other conditions, or at any time when there is insufficient visibility to clearly see persons and vehicles on the roadway at a distance of 500 feet.\nMotorized golf carts shall display the slow-moving vehicle emblem provided for in section 169.522, when operated on designated roadways.\nThe operator, under permit, of a motorized golf cart, all-terrain vehicle, utility task vehicle, or mini truck may cross any street or highway intersecting a designated roadway.\nEvery person operating a motorized golf cart, all-terrain vehicle, utility task vehicle, or mini truck under permit on designated roadways has all the rights and duties applicable to the driver of any other vehicle under the provisions of this chapter, except when those provisions cannot reasonably be applied to motorized golf carts, all-terrain vehicles, utility task vehicles, or mini trucks and except as otherwise specifically provided in subdivision 7.\nThe provisions of chapter 171 are applicable to persons operating mini trucks, but are not applicable to persons operating motorized golf carts, utility task vehicles, or all-terrain vehicles under permit on designated roadways pursuant to this section. Except for the requirements of section 169.70, the provisions of this chapter relating to equipment on vehicles are not applicable to motorized golf carts, utility task vehicles, or all-terrain vehicles operating, under permit, on designated roadways.\nNotwithstanding sections 169.48 to 169.68, or any other law, a mini truck may be operated under permit on designated roadways if it is equipped with:\n(1) at least two headlamps;\n(2) at least two taillamps;\n(3) front and rear turn-signal lamps;\n(4) an exterior mirror mounted on the driver's side of the vehicle and either (i) an exterior mirror mounted on the passenger's side of the vehicle or (ii) an interior mirror;\n(5) a windshield;\n(6) a seat belt for the driver and front passenger; and\n(7) a parking brake.\nIn the event persons operating a motorized golf cart, utility task vehicle, all-terrain vehicle, or mini truck under this section cannot obtain liability insurance in the private market, that person may purchase automobile insurance, including no-fault coverage, from the Minnesota Automobile Insurance Plan under sections 65B.01 to 65B.12, at a rate to be determined by the commissioner of commerce.",
	"repealed": false
}