{
	"id": "270C.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.36",
	"title": "270C.36 JEOPARDY ASSESSMENT AND COLLECTION.",
	"text": "If the commissioner has reasonable grounds to believe that a taxpayer is about to leave, or take property from, this state with the purpose of evading a tax, or that the collection of the tax will be jeopardized by delays incident to other methods of collection, the commissioner may immediately declare the taxpayer's reporting period to be at an end and assess the tax due by issuing an order under section 270C.33, subdivision 4. The commissioner may make the assessment on the basis of knowledge or information available to the commissioner, and notwithstanding the prohibition against collection under section 270C.33, subdivision 5, demand immediate payment of the amount due shown in the assessment.\nNotwithstanding the prohibition against collection in section 270C.33, subdivision 5, and the notice provisions in section 270C.67, subdivision 3, if the commissioner has reason to believe that collection of a tax is in jeopardy, notice and demand for immediate payment of the tax may be made. If the tax is not paid, the commissioner may proceed to collect by levy or by filing a lien under section 270C.63. For this purpose, \"tax\" includes any penalty, interest, and costs, properly payable.\nWithin five days after a jeopardy assessment or jeopardy collection is made to assess or collect a tax, the commissioner shall provide the taxpayer with a written statement of the information relied on in making the assessment or levy. Within 30 days after the written statement is provided or, if not provided, within 35 days after the assessment or levy, the taxpayer may request the commissioner to review the action taken. After a request for review, the commissioner shall determine whether the assessment or levy is reasonable and whether the amount assessed or demanded as a result of the action is appropriate under the circumstances.\nA determination by the commissioner under subdivision 3 is appealable to the Tax Court in the manner provided by law, and the appeal must be expeditiously heard by the court. If the court determines that the making of the assessment or levy is unreasonable, or that the amount assessed or demanded is inappropriate, the court may order the commissioner to release the levy, abate the assessment, redetermine in whole or in part the amount assessed or demanded, or take other action. A determination by the court under this subdivision is final and may not be appealed by either party.\nIn a proceeding under subdivision 4, the burden of proving that the assessment or collection of the tax was jeopardized by delay is on the commissioner. Regarding the issue of whether the amount assessed or demanded as a result of the action is appropriate, the commissioner shall provide a written statement explaining the basis for determining the amount, and the burden is on the taxpayer to show that the statement is incorrect or invalid.\nIt is not a defense to an assessment or demand made under this section that the tax period has not terminated, that the time otherwise allowed by law to file a return has not expired, that the notices otherwise required by law for making an assessment or demand have not been given, or that the time otherwise allowed by law to appeal or pay the tax has not expired.",
	"repealed": false
}