{
	"id": "308B.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.611",
	"title": "308B.611 NATURE OF A MEMBERSHIP INTEREST AND STATEMENT OF INTEREST OWNED.",
	"text": "A membership interest is personal property. A member has no interest in specific cooperative property. All property of the cooperative is property of the cooperative itself.\nAt the request of any member, the cooperative shall state in writing the particular membership interest owned by that member as of the date the cooperative makes the statement. The statement must describe the member's rights to vote, if any, to share in profits and losses, and to share in distributions, restrictions on assignments of financial rights under section 308B.605, subdivision 3, or voting rights under section 308B.555 then in effect, as well as any assignment of the member's rights then in effect other than a security interest.\nAll the membership interests of a cooperative must:\n(1) be of one class, without series, unless the articles or bylaws establish or authorize the board to establish more than one class or series within classes;\n(2) be ordinary patron membership interests and if authorized nonpatron membership interest subject to this chapter entitled to vote as provided in section 308B.555, and have equal rights and preferences in all matters not otherwise provided for by the board and to the extent that the articles or bylaws have fixed the relative rights and preferences of different classes and series; and\n(3) share profits and losses and are entitled to distributions as provided in sections 308B.721 and 308B.725.\nOn application to a court of competent jurisdiction by any judgment creditor of a member, the court may charge a member's or an assignee's financial rights with payment of the unsatisfied amount of the judgment with interest. To the extent so charged, the judgment creditor has only the rights of an assignee of a member's financial rights under section 308B.605. This chapter does not deprive any member or assignee of financial rights of the benefit of any exemption laws applicable to the membership interest. This section is the sole and exclusive remedy of a judgment creditor with respect to the judgment debtor's membership interest.\n(a) Subject to any restrictions in the articles or bylaws, the power granted in this subdivision may be exercised by a resolution or resolutions establishing a class or series, setting forth the designation of the class or series, and fixing the relative rights and preferences of the class or series. Any of the rights and preferences of a class or series established in the articles, bylaws, or by resolution of the board:\n(1) may be made dependent upon facts ascertainable outside the articles or bylaws or outside the resolution or resolutions establishing the class or series, if the manner in which the facts operate upon the rights and preferences of the class or series is clearly and expressly set forth in the articles or bylaws or in the resolution or resolutions establishing the class or series; and\n(2) may include by reference some or all of the terms of any agreements, contracts, or other arrangements entered into by the cooperative in connection with the establishment of the class or series if the cooperative retains at its principal executive office a copy of the agreements, contracts, or other arrangements or the portions will be included by reference.\n(b) A statement setting forth the name of the cooperative and the text of the resolution and certifying the adoption of the resolution and the date of adoption must be given to the members before the acceptance of any contributions for which the resolution creates rights or preferences not set forth in the articles or bylaws. Where the members have received notice of the creation of membership interests with rights or preferences not set forth in the articles or bylaws before the acceptance of the contributions with respect to the membership interests, the statement may be filed any time within one year after the acceptance of the contributions. The resolution is effective three days after delivery to the members is deemed effective by the board, or, if the statement is not required to be given to the members before the acceptance of contributions, on the date of its adoption by the directors.\nWithout limiting the authority granted in this section, a cooperative may have membership interests of a class or series:\n(1) subject to the right of the cooperative to redeem any of those membership interests at the price fixed for their redemption by the articles or bylaws or by the board;\n(2) entitling the members to cumulative, partially cumulative, or noncumulative distributions;\n(3) having preference over any class or series of membership interests for the payment of distributions of any or all kinds;\n(4) convertible into membership interests of any other class or any series of the same or another class; or\n(5) having full, partial, or no voting rights, except as provided in section 308B.555.\nFor the purpose of any law relating to security interests, membership interests, governance or voting rights, and financial rights are each to be characterized as provided in section 336.8-103, paragraph (c).\n(a) If a member who is an individual dies or a court of competent jurisdiction adjudges the member to be incompetent to manage the member's person or property, or an order for relief under the bankruptcy code is entered with respect to the member, the member's executor, administrator, guardian, conservator, trustee, or other legal representative may exercise all of the member's rights for the purpose of settling the estate or administering the member's property. If a member is a business entity, trust, or other entity and is dissolved, terminated, or placed by a court in receivership or bankruptcy, the powers of that member may be exercised by its legal representative or successor.\n(b) If an event referred to in paragraph (a) causes the termination of a member's membership interest and the termination does not result in dissolution, then subject to the articles and bylaws:\n(1) as provided in section 308B.605, the terminated member's interest will be considered to be merely that of an assignee of the financial rights owned before the termination of membership; and\n(2) the rights to be exercised by the legal representative of the terminated member will be limited accordingly.\nA subscriber for membership interests or a member of a cooperative is under no obligation to the cooperative or its creditors with respect to the membership interests subscribed for or owned, except to pay to the cooperative the full consideration for which the membership interests are issued or to be issued.",
	"repealed": false
}