{
	"id": "32D.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/32D.13",
	"title": "32D.13 MILK QUALITY STANDARDS.",
	"text": "Milk shall not be visibly adulterated, or have any objectionable odor, or be abnormal in appearance or consistency.\n(a) The bacterial count of Grade A raw milk from producers must not exceed 100,000 bacteria per milliliter prior to commingling with other producer milk.\n(b) After commingling with other producer milk, the bacteria count must not exceed 300,000 per milliliter prior to pasteurization.\n(a) The bacterial count of Grade A pasteurized milk and fluid milk products, at any time after pasteurization until delivery, must not exceed 20,000 bacteria per milliliter.\n(b) The coliform count of Grade A pasteurized milk and fluid milk products must not exceed ten bacteria per milliliter except that bulk tank transport shipments must not exceed 100 per milliliter.\nThe bacterial count of raw milk other than Grade A from producers must not exceed 500,000 bacteria per milliliter prior to commingling with other producer milk.\nThe bacterial count of pasteurized milk other than Grade A pasteurized milk, at any time after pasteurization until delivery, must not exceed 20,000 bacteria per milliliter.\nBacterial count standards do not apply to sour cream, cultured buttermilk, and other cultured fluid milk products.\nThe commissioner may prescribe standards and rules adopted in accordance with law more stringent than those imposed by this section.\n(a) The somatic cell count, as determined by a direct microscopic somatic cell count or an electronic somatic cell count, must not exceed 750,000 cells per milliliter for Grade A raw milk and raw milk other than Grade A. Notwithstanding any federal standard, the somatic cell count of goat milk must not exceed 1,500,000 cells per milliliter.\n(b) The commissioner may prescribe standards and rules adopted in accordance with law more stringent than those imposed by this subdivision.\nIf milk is received or collected from a dairy farm more than two hours after the most recent milking, the temperature of the milk shall not exceed 45 degrees Fahrenheit (7 degrees Celsius). If the milk consists of a blend of milk from two or more milkings, and the milk is received or collected less than two hours after the most recent milking, the blend temperature shall not exceed 50 degrees Fahrenheit (10 degrees Celsius).\nA dairy plant is not required to reject milk shipments in response to a violation of subdivisions 2 to 9 unless the commissioner suspends or revokes the dairy plant permit or milk producer's Grade A permit or manufacturing grade certification.\n(a) A milk hauler must not pick up milk from a farm that has a bulk tank that is not in proper working order.\n(b) Milk must not be stored for longer than 72 hours at a farm before the milk is picked up by a milk hauler for transport to a plant. The commissioner or an agent of the commissioner may waive the 72-hour time limit in the case of hardship, emergency, or natural disaster.",
	"repealed": false
}