{
	"id": "122A.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.415",
	"title": "122A.415 ALTERNATIVE COMPENSATION REVENUE.",
	"text": "(a) A school district, intermediate school district, cooperative unit as defined in section 123A.24, subdivision 2, school site, or charter school that meets the conditions of section 122A.414 and submits an application approved by the commissioner is eligible for alternative teacher compensation revenue.\n(b) For school district and intermediate school district applications, the commissioner must consider only those applications to participate that are submitted jointly by a district and the exclusive representative of the teachers. The application must contain an alternative teacher professional pay system agreement that:\n(1) implements an alternative teacher professional pay system consistent with section 122A.414; and\n(2) is negotiated and adopted according to the Public Employment Labor Relations Act under chapter 179A, except that notwithstanding section 179A.20, subdivision 3, a district may enter into a contract for a term of two or four years.\nAlternative teacher compensation revenue for a qualifying school district or site in which the school board and the exclusive representative of the teachers agree to place teachers in the district or at the site on the alternative teacher professional pay system equals $260 times the number of pupils enrolled at the district or site on October 1 of the previous fiscal year. Alternative teacher compensation revenue for a qualifying intermediate school district or cooperative must be calculated under subdivision 4, paragraph (b).\n(c) For a newly combined or consolidated district, the revenue shall be computed using the sum of pupils enrolled on October 1 of the previous year in the districts entering into the combination or consolidation. The commissioner may adjust the revenue computed for a site using prior year data to reflect changes attributable to school closings, school openings, or grade level reconfigurations between the prior year and the current year.\n(d) The revenue is available only to school districts, intermediate school districts, cooperatives, school sites, and charter schools that fully implement an alternative teacher professional pay system by October 1 of the current school year.\n[Repealed, 1Sp2005 c 5 art 1 s 55]\n(a) Districts, intermediate school districts, cooperatives, school sites, or charter schools with approved applications must receive alternative compensation revenue for each school year that the district, intermediate school district, cooperative, school site, or charter school implements an alternative teacher professional pay system under this subdivision and section 122A.414. A qualifying district, intermediate school district, cooperative, school site, or charter school that received alternative teacher compensation aid for the previous fiscal year must receive at least an amount of alternative teacher compensation revenue equal to the lesser of the amount it received for the previous fiscal year or the amount it qualifies for under subdivision 1 for the current fiscal year if the district, intermediate school district, cooperative, school site, or charter school submits a timely application and the commissioner determines that the district, intermediate school district, cooperative, school site, or charter school continues to implement an alternative teacher professional pay system, consistent with its application under this section.\n(b) The commissioner shall approve applications that comply with subdivision 1, and section 122A.414, subdivisions 2, paragraph (b), and 2a, if the applicant is a charter school or cooperative, in the order in which they are received, select applicants that qualify for this program, notify school districts, intermediate school districts, cooperatives, school sites, and charter schools about the program, develop and disseminate application materials, and carry out other activities needed to implement this section.\n(a) The basic alternative teacher compensation aid for a school with a plan approved under section 122A.414, subdivision 2b, equals 65 percent of the alternative teacher compensation revenue under subdivision 1. The basic alternative teacher compensation aid for a charter school with a plan approved under section 122A.414, subdivisions 2a and 2b, equals $260 times the number of pupils enrolled in the school on October 1 of the previous year, or on October 1 of the current year for a charter school in the first year of operation, times the ratio of the sum of the alternative teacher compensation aid and alternative teacher compensation levy for all participating school districts to the maximum alternative teacher compensation revenue for those districts under subdivision 1.\n(b) Notwithstanding paragraph (a) and subdivision 1, the state total basic alternative teacher compensation aid entitlement must not exceed $88,118,000 for fiscal year 2023; $88,461,000 for fiscal year 2024; $88,961,000 for fiscal year 2025; and $89,486,000 for fiscal year 2026 and later. The commissioner must limit the amount of alternative teacher compensation aid approved under this section so as not to exceed these limits by not approving new participants or by prorating the aid among participating districts, intermediate school districts, school sites, and charter schools. The commissioner may also reallocate a portion of the allowable aid for the biennium from the second year to the first year to meet the needs of approved participants.\n(c) Basic alternative teacher compensation aid for an intermediate district or other cooperative unit equals $3,000 times the number of licensed teachers employed by the intermediate district or cooperative unit on October 1 of the previous school year.\nThe alternative teacher compensation levy for a district receiving basic alternative teacher compensation aid equals the product of (1) the difference between the district's alternative teacher compensation revenue and the district's basic alternative teacher compensation aid, times (2) the lesser of one or the ratio of the district's adjusted net tax capacity per adjusted pupil unit to $6,100.\n(a) A district's alternative teacher compensation equalization aid equals the district's alternative teacher compensation revenue minus the district's basic alternative teacher compensation aid minus the district's alternative teacher compensation levy. If a district does not levy the entire amount permitted, the alternative teacher compensation equalization aid must be reduced in proportion to the actual amount levied.\n(b) A district's alternative teacher compensation aid equals the sum of the district's basic alternative teacher compensation aid and the district's alternative teacher compensation equalization aid.\nRevenue received under this section must be reserved and used only for the programs authorized under section 122A.414.",
	"repealed": false
}