{
	"id": "383A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.03",
	"title": "383A.03 TAXATION.",
	"text": "(a) Operations. Ramsey County may levy, annually, a tax for the operation and maintenance of Saint Paul-Ramsey Hospital, and for its construction as provided in Laws 1957, chapter 938.\n(b) Bonds. Ramsey County may levy annually upon all taxable property in the county the ad valorem tax that is necessary to pay the interest on bonds for the construction of Saint Paul-Ramsey Hospital as it accrues and to pay the principal thereof in full at maturity. The Board of County Commissioners of Ramsey County shall levy a tax for this purpose.\n(c) Financing. Notwithstanding any law to the contrary, Ramsey County may provide all funds, except those required for the purpose of funding prior construction indebtedness which shall be as heretofore provided, that it approves pursuant to requests duly submitted to it by the Ramsey County Hospital and Sanitarium Commission. Ramsey County may also provide emergency funds for the commission for the purpose of operating facilities when operational income is insufficient to meet operational expenses.\nRamsey County may levy, annually, a tax for the operation and maintenance of detention and correction facilities.\nRamsey County shall levy a tax sufficient to pay the principal and interest on the bonds issued for the park and open space system as they become due.\nRamsey County may levy, annually, a tax on all taxable property in the county for the acquisition and construction of nine artificial ice arenas and a golf course, to pay the interest on the bonds as it accrues and to pay the principal thereof in full at maturity, and to provide for the operation of these facilities. The board of county commissioners shall levy a tax for this purpose.\nRamsey County may levy, annually, a tax to operate and maintain Aldrich Arena.\n(a) Ramsey County may levy a tax and appropriate money in the amount it finds appropriate to support educational, artistic and scientific interests inside the county of Ramsey.\n(b) Upon appropriation and establishment of an account pursuant to statute, Ramsey County may distribute the appropriation authorized herein, in the proportion and in the amount as it decides, to an existing Minnesota nonprofit corporation organized to further the arts and sciences in Ramsey County, which corporation is authorized by its articles of incorporation to use and distribute its income and property exclusively for charitable, educational, scientific and literary purposes, and no substantial part of the activities of which consists of carrying on propaganda and otherwise attempting to influence legislation.\n(c) To qualify as a recipient for assistance under the provisions of this subdivision, a Minnesota nonprofit corporation must possess and file with the county auditor an income tax-exempt certificate from the state of Minnesota and the United States, which certificate indicates the tax-exempt status of the corporation.\n(d) The county board shall provide, by rule, for reasonable regulations that it considers proper to control the expenditure of the appropriations made under this subdivision. It may require the reports and controls that are reasonably necessary to insure the protection of the public interest in the expenditure of the funds appropriated.\nRamsey County shall include in its annual levy of county taxes the amount that is necessary for health department purposes. The amount so levied for the health department shall only be expended for the operation and maintenance of the department.\nRamsey County may levy a tax upon all taxable property in the county for the purpose of providing to each employee, including an elected official, who retires, or to the surviving spouse of such an employee, insurance protection, in the amount that the county considers proper, providing medical and surgical benefits and hospitalization benefits, for the employee and dependent spouse, subject to the limitations as to premium amounts as hereinafter set forth.",
	"repealed": false
}