{
	"id": "169.871",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.871",
	"title": "169.871 EXCESS WEIGHT; CIVIL PENALTY.",
	"text": "(a) The owner or lessee of a vehicle that is operated with a gross weight in excess of a weight limit imposed under sections 169.823 to 169.8295, 169.84 to 169.851, and 169.87 or a shipper who ships or tenders goods for shipment in a single truck or combination vehicle that exceeds a weight limit imposed under sections 169.823 to 169.8295, 169.84 to 169.851, and 169.87 is liable for a civil penalty as follows:\n(1) if the total gross excess weight is not more than 1,000 pounds, one cent per pound for each pound in excess of the legal limit;\n(2) if the total gross excess weight is more than 1,000 pounds but not more than 3,000 pounds, $10 plus five cents per pound for each pound in excess of 1,000 pounds;\n(3) if the total gross excess weight is more than 3,000 pounds but not more than 5,000 pounds, $110 plus ten cents per pound for each pound in excess of 3,000 pounds;\n(4) if the total gross excess weight is more than 5,000 pounds but not more than 7,000 pounds, $310 plus 15 cents per pound for each pound in excess of 5,000 pounds;\n(5) if the total gross excess weight is more than 7,000 pounds, $610 plus 20 cents per pound for each pound in excess of 7,000 pounds.\n(b) Notwithstanding any other law to the contrary, if a person found guilty of a violation of a weight limit imposed under this section or sections 169.823 to 169.8295, 169.84 to 169.851, or 169.87 is also found by the court to have knowingly and contemporaneously attempted to evade a fixed weigh station or to otherwise avoid weighing by means of stationary scales under section 169.85 or other law, the court must impose a penalty of twice the amount otherwise authorized under paragraph (a).\n(c) Any penalty imposed upon a defendant under this subdivision must not exceed the penalty prescribed by this subdivision. Any fine paid by the defendant in a criminal overweight action that arose from the same overweight violation is applied toward payment of the civil penalty under this subdivision. A peace officer or Department of Public Safety employee described in section 299D.06 who cites a driver for a violation of the weight limitations established by sections 169.81 to 169.851 and 169.87 must give written notice to the driver that the driver or another may also be liable for the civil penalties provided herein in the same or separate proceedings.\n(d) A penalty imposed upon the owner or lessee of a vehicle that is based on violations identified by the use of shippers' weight records under section 169.872 must not exceed an aggregate of $10,000.\n(a) The owner or lessee of a vehicle that is operated with a gross weight in excess of an adjusted weight limit and a shipper who ships or tenders goods for shipment in a single truck or combination vehicle that exceeds an adjusted weight limit is liable for a civil penalty. The civil penalty is the greater of (1) as calculated at a rate of five cents per pound for each pound in excess of the highest weight allowed by the permit or under section 169.826, subdivision 1, or (2) $100.\n(b) Any penalty imposed upon a defendant under this subdivision shall not exceed the penalty prescribed by this subdivision. Any fine paid by the defendant in a criminal overweight action that arose from the same overweight violation may not be applied toward payment of the civil penalty under this subdivision. A peace officer or Department of Public Safety employee described in section 299D.06 who cites a driver for a violation of the adjusted weight limit shall give written notice to the driver that the driver or another may also be liable for the civil penalty provided in this subdivision in the same or separate proceedings.\n(c) For purposes of this subdivision, \"adjusted weight limit\" means a weight limit (1) imposed by a permit issued under this chapter, or (2) imposed under section 169.826, subdivision 1.\nNotwithstanding subdivision 1, paragraph (a), clauses (1) to (5), a civil penalty under subdivision 1 for a violation in a motor vehicle in the course of a first haul as defined in section 168.013, subdivision 3, paragraph (d), clause (3), of a weight limit imposed under sections 169.823 to 169.829, 169.84 to 169.851, and 169.87 that is not preceded by two or more violations of the gross weight limits in those sections in that motor vehicle within the previous 12 months, may not exceed $150.\nThe district court may hear, try and determine actions commenced under this section. Trials under this section shall be to the court, sitting without a jury. Trials to the court under this section shall, if possible, be conducted at the same time as pretrial motions or trials in the criminal prosecution under sections 169.81 to 169.87, if any, subject to the agreement of the defendant.\nNotwithstanding the provisions of section 8.01, county or city attorneys may appear in civil actions commenced under this section at the request of the attorney general.\nCivil actions under this section may be commenced in any county in which the vehicle was loaded, unloaded or operated in violation of subdivision 1 unless there is agreement that the action may be tried in another county or municipality.\nAny penalty imposed and fines collected pursuant to this section shall be disposed of as provided in section 299D.03, subdivision 5, with the following exceptions:\n(a) If the violation occurs in the county, and the county attorney appears in the action, the remaining five-eighths shall be credited to the highway user tax distribution fund.\n(b) If the violation occurs within the municipality, and the city attorney appears in the action, the remaining one-third shall be paid to the highway user tax distribution fund.\n(c) Except as provided in paragraph (d), when the attorney general appears in the action, all penalties imposed and fines collected shall be credited to the highway user tax distribution fund.\n(d) If the violation occurs in Hennepin County, and the arrest or apprehension is made by the county sheriff, three-eighths of the civil penalty shall be credited to the general revenue fund of the county and the remaining five-eighths shall be credited to the highway user tax distribution fund.\nThe prevailing party in any action commenced under this section shall be entitled to reasonable costs incurred in the action.\n(a) The penalty imposed by subdivision 1 shall not be imposed on a shipper who in good faith ships goods or tenders goods for shipment in a vehicle that does not exceed the maximum gross weight for which the truck is licensed under section 168.013, subdivision 1e.\n(b) For purposes of this section, \"good faith\" means that (1) the vehicle is licensed pursuant to section 168.013, subdivision 1e, (2) the operator of the vehicle is not under the control of the shipper, (3) the operator has requested that the vehicle be loaded to the maximum gross weight for which the vehicle is licensed, and (4) the road leading from the shipper's immediate place of shipment may be legally used for the allowed gross weight of the vehicle with its legally maximum load.",
	"repealed": false
}