{
	"id": "352.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.91",
	"title": "352.91 COVERED CORRECTIONAL SERVICE.",
	"text": "\"Covered correctional service\" means service performed by a state employee, as defined in section 352.01, employed at a state correctional facility, the state-operated forensic services program, or the Minnesota Sex Offender Program as:\n(1) a corrections officer 1;\n(2) a corrections officer 2;\n(3) a corrections officer 3;\n(4) a corrections officer supervisor;\n(5) a corrections lieutenant;\n(6) a corrections captain;\n(7) a security counselor;\n(8) a security counselor lead; or\n(9) a corrections canine officer.\n\"Covered correctional service\" also means service rendered at any time by state employees as maintenance personnel, correctional industry personnel, or members of trades certified by the commissioner of management and budget to the executive director as being engaged for at least 75 percent of the employee's working time in the rehabilitation, treatment, custody, or supervision of inmates at a Minnesota correctional facility, or of patients in the state-operated forensic services program or the Minnesota Sex Offender Program.\n\"Covered correctional service\" also means service rendered by a state employee as a special teacher employed by the Department of Corrections or by Direct Care and Treatment at a security unit, provided that at least 75 percent of the employee's working time is spent in direct contact with inmates or patients and the fact of this direct contact is certified to the executive director by the appropriate commissioner or executive board, unless the person elects to retain the current retirement coverage under Laws 1996, chapter 408, article 8, section 21.\n[Repealed, 1996 c 408 art 8 s 29]\n[Repealed, 2015 c 68 art 13 s 65]\n[Repealed, 2015 c 68 art 13 s 65]\n(a) \"Covered correctional service\" means service by a state employee in one of the employment positions at a correctional facility, in the state-operated forensic services program, or in the Minnesota Sex Offender Program that are specified in paragraph (b) if at least 75 percent of the employee's working time is spent in direct contact with inmates or patients and the fact of this direct contact is certified to the executive director by the appropriate commissioner or executive board.\n(b) The employment positions are as follows:\n(1) registered nurse - senior;\n(2) registered nurse;\n(3) registered nurse - principal;\n(4) licensed practical nurse;\n(5) registered nurse advance practice; and\n(6) psychiatric advance practice registered nurse.\n(a) \"Covered correctional service\" means service by a state employee in one of the employment positions at a correctional facility or in the state-operated forensic services program specified in paragraph (b) if at least 75 percent of the employee's working time is spent in direct contact with inmates or patients and the fact of this direct contact is certified to the executive director by the appropriate commissioner or executive board.\n(b) The employment positions are:\n(1) automotive mechanic;\n(2) baker;\n(3) central services administrative specialist, intermediate;\n(4) central services administrative specialist, principal;\n(5) chaplain;\n(6) chief cook;\n(7) clinical program therapist 1;\n(8) clinical program therapist 2;\n(9) clinical program therapist 3;\n(10) clinical program therapist 4;\n(11) cook;\n(12) cook coordinator;\n(13) corrections inmate program coordinator;\n(14) corrections transitions program coordinator;\n(15) corrections security caseworker;\n(16) corrections security caseworker career;\n(17) corrections teaching assistant;\n(18) delivery van driver;\n(19) dentist;\n(20) electrician supervisor;\n(21) general maintenance worker lead;\n(22) general repair worker;\n(23) library/information research services specialist;\n(24) library/information research services specialist senior;\n(25) library technician;\n(26) painter lead;\n(27) plant maintenance engineer lead;\n(28) plumber supervisor;\n(29) psychologist 1;\n(30) psychologist 3;\n(31) recreation therapist;\n(32) recreation therapist coordinator;\n(33) recreation program assistant;\n(34) recreation therapist senior;\n(35) sports medicine specialist;\n(36) work therapy assistant;\n(37) work therapy program coordinator; and\n(38) work therapy technician.\n(a) \"Covered correctional service\" means service by a state employee in one of the employment positions with the Minnesota Specialty Health System-Cambridge specified in paragraph (b) if at least 75 percent of the employee's working time is spent in direct contact with patients who are in the Minnesota Specialty Health System-Cambridge and if service in such a position is certified to the executive director by the Direct Care and Treatment executive board.\n(b) The employment positions are:\n(1) behavior analyst 1;\n(2) behavior analyst 2;\n(3) behavior analyst 3;\n(4) group supervisor;\n(5) group supervisor assistant;\n(6) human services support specialist;\n(7) residential program lead;\n(8) psychologist 2;\n(9) recreation program assistant;\n(10) recreation therapist senior;\n(11) registered nurse senior;\n(12) skills development specialist;\n(13) social worker senior;\n(14) social worker specialist; and\n(15) speech pathology specialist.\n(c) A Department of Human Services or Direct Care and Treatment employee who was employed at the Minnesota Specialty Health System-Cambridge immediately preceding the 2014 conversion to the community-based homes and was in covered correctional service at the time of the transition shall continue to be covered by the correctional employees retirement plan while employed by and without a break in service with the Department of Human Services or Direct Care and Treatment in the direct care and treatment of patients.\n(a) \"Covered correctional service\" means service by a state employee in one of the employment positions specified in paragraph (b) in the state-operated forensic services program or the Minnesota Sex Offender Program if at least 75 percent of the employee's working time is spent in direct contact with patients and the determination of this direct contact is certified to the executive director by the commissioner of human services or Direct Care and Treatment executive board.\n(b) The employment positions are:\n(1) baker;\n(2) behavior analyst 2;\n(3) behavior analyst 3;\n(4) certified occupational therapy assistant 1;\n(5) certified occupational therapy assistant 2;\n(6) client advocate;\n(7) clinical program therapist 2;\n(8) clinical program therapist 3;\n(9) clinical program therapist 4;\n(10) cook;\n(11) culinary supervisor;\n(12) customer services specialist principal;\n(13) dental assistant registered;\n(14) dental hygienist;\n(15) food service worker;\n(16) food services supervisor;\n(17) group supervisor;\n(18) group supervisor assistant;\n(19) human services support specialist;\n(20) licensed alcohol and drug counselor;\n(21) licensed practical nurse;\n(22) management analyst 3;\n(23) music therapist;\n(24) occupational therapist;\n(25) occupational therapist, senior;\n(26) physical therapist;\n(27) psychologist 1;\n(28) psychologist 2;\n(29) psychologist 3;\n(30) recreation program assistant;\n(31) recreation therapist lead;\n(32) recreation therapist senior;\n(33) rehabilitation counselor senior;\n(34) residential program lead;\n(35) security supervisor;\n(36) skills development specialist;\n(37) social worker senior;\n(38) social worker specialist;\n(39) social worker specialist, senior;\n(40) special education program assistant;\n(41) speech pathology clinician;\n(42) substance use disorder counselor senior;\n(43) work therapy assistant; and\n(44) work therapy program coordinator.\n(a) \"Covered correctional service\" means service by a state employee in one of the employment positions specified in paragraph (b) if at least 75 percent of the employee's working time is spent in direct contact with inmates and the determination of this direct contact is certified to the executive director by the commissioner of corrections.\n(b) The qualifying employment positions are:\n(1) corrections discipline unit supervisor;\n(2) dental assistant registered;\n(3) dental hygienist;\n(4) food service supervisor;\n(5) medical assistant, certified;\n(6) psychologist 2; and\n(7) sentencing to service crew leader involved with the inmate community work crew program.\n(a) If the occupational title of a state employee covered by the Minnesota correctional employees retirement plan changes from the applicable title listed in subdivision 1, 2, 2a, 3c, 3d, 3e, 3f, or 3g, qualification for coverage by the correctional state employees retirement plan continues until the July 1 next following the title change if the commissioner of management and budget certifies to the executive director of the Minnesota State Retirement System and to the executive director of the Legislative Commission on Pensions and Retirement that the duties, requirements, and responsibilities of the new occupational title are substantially identical to the duties, requirements, and responsibilities of the prior occupational title.\n(b) If the commissioner of management and budget does not certify a new occupational title under paragraph (a), eligibility for future correctional state employees retirement coverage terminates as of the start of the first payroll period next following the effective date of the occupational title change.\n(c) For consideration by the Legislative Commission on Pensions and Retirement during the legislative session next following an occupational title change involving a state employee in covered correctional service, the commissioner of management and budget shall submit the applicable draft proposed legislation reflecting the occupational title change covered by this section.\nIf a new correctional facility is established, a state employee rendering covered correctional service immediately before the transfer remains eligible for coverage by the correctional state employees retirement plan for future state employment at the new facility if the person is employed in the same occupational title at the new facility. The eligibility for future coverage continues until the July 1 next following the effective date of the establishment of the new facility.\nFor purposes of this section, \"state-operated forensic services program\" means the Minnesota Security Hospital, the forensic nursing home, the forensic transition service, and the competency restoration program.\n[Repealed, 2000 c 461 art 6 s 6]\n(a) The Department of Corrections and Direct Care and Treatment must establish a procedure for evaluating periodic requests by department and agency employees for qualification for recommendation by the commissioner or executive board for inclusion of the employment position in the correctional facility or Direct Care and Treatment facility in the correctional retirement plan and for periodically determining employment positions that no longer qualify for continued correctional retirement plan coverage.\n(b) The procedure must provide for an evaluation of the extent of the employee's working time spent in direct contact with patients or inmates, the extent of the physical hazard that the employee is routinely subjected to in the course of employment, and the extent of intervention routinely expected of the employee in the event of a facility incident. The percentage of routine direct contact with inmates or patients may not be less than 75 percent.\n(c) The applicable commissioner or executive board shall notify the employee of the determination of the appropriateness of recommending the employment position for inclusion in the correctional retirement plan, if the evaluation procedure results in a finding that the employee:\n(1) routinely spends 75 percent of the employee's time in direct contact with inmates or patients; and\n(2) is regularly engaged in the rehabilitation, treatment, custody, or supervision of inmates or patients.\n(d) After providing the affected employee an opportunity to dispute or clarify any evaluation determinations, if the commissioner or executive board determines that the employment position is appropriate for inclusion in the correctional retirement plan, the commissioner or executive board shall forward that recommendation and supporting documentation to the chair of the Legislative Commission on Pensions and Retirement, the chair of the State and Local Governmental Operations Committee of the senate, the chair of the Governmental Operations and Veterans Affairs Policy Committee of the house of representatives, and the executive director of the Legislative Commission on Pensions and Retirement in the form of the appropriate proposed legislation. The recommendation must be forwarded to the legislature before January 15 for the recommendation to be considered in that year's legislative session.\n(a) The commissioner of corrections shall appoint a standing review committee to review and determine positions that should be included in legislative requests for correctional employees retirement plan coverage under subdivision 4a.\n(b) Periodically, the Department of Corrections will convene meetings of the review committee. The review committee must review all requests and the supporting documentation for coverage by the correctional employees retirement plan and must determine which classes or positions meet the statutory requirements for coverage. The review committee also must determine if incumbents of and recent retirees from classes or positions determined for inclusion in correctional employees retirement plan coverage have prior Department of Corrections employment which also qualified as correctional service and which should be transferred from the general state employees retirement plan to the plan and the initial date for each potential service credit transfer.\n(c) The review committee must evaluate and determine the eligibility date for initial plan participation and all periods of eligibility in the correctional employees retirement plan.\n(d) The department must provide a notice of each determination and of the employee's right to appeal from the review committee to each employee who requested inclusion. Appeals must be filed with the agency human resource manager within 30 days of the date of the notice of determination.\n(e) The commissioner of corrections shall appoint a standing appeals committee to hear appeals of determinations for coverage. The appeal committee must include relevant department employees and employee representatives. Appeal committee determinations are final.\n(f) All positions approved for inclusion must be forwarded to the commissioner of corrections for the preparation of legislation to implement the coverage change and submission. The commissioner will submit a written recommendation documenting classes or positions that should or should not be covered by the correctional employees retirement plan. Documentation of each request and the final determination must be retained in the Department of Corrections' Office of Human Resource Management.\n(a) The Direct Care and Treatment executive board shall appoint a standing review committee to review and determine classifications or positions that may be included in legislative requests for correctional state employees retirement plan coverage under subdivision 4a.\n(b) The agency's human resources director shall convene a meeting of the review committee only at the request of a labor organization or a member of the agency's management team.\n(c) The review committee must review all requests and the supporting documentation for coverage by the correctional state employees retirement plan and must make a recommendation to the executive board regarding which classifications or positions meet the statutory requirements for coverage. The review committee must also make a recommendation to the executive board regarding classifications or positions that no longer meet the statutory requirement for coverage by the correctional state employees retirement plan and removal of the classification or position from the applicable statute.\n(d) The agency's human resources director must provide a notice of each determination and of the employee's right to appeal the determination. Appeals must be filed with the agency's human resources director within 30 days of the date of the notice of determination.\n(e) The Direct Care and Treatment executive board shall review appeals of determinations for coverage. The executive board's determinations are final.\n(f) All classifications or positions recommended by the review committee for inclusion in or exclusion from the correctional state employees retirement plan must be forwarded to the Direct Care and Treatment executive board for the preparation of legislation to implement the coverage change and submission. If the executive board determines that the employment position is appropriate for inclusion in or exclusion from the correctional state employees retirement plan, the executive board shall submit a written recommendation documenting classifications or positions that should or should not be covered by the correctional state employees retirement plan. The agency's human resources director must retain the documentation of each request and the final determination.\n[Repealed, 2010 c 359 art 2 s 19]\nIf erroneous employee deductions and employer contributions are caused by an error in plan coverage involving the correctional state employees retirement plan and any other plan specified in section 356.637, that section applies.",
	"repealed": false
}