{
	"id": "126C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.10",
	"title": "126C.10 GENERAL EDUCATION REVENUE.",
	"text": "The general education revenue for each district equals the sum of the district's basic revenue, extended time revenue, gifted and talented revenue, declining enrollment revenue, local optional revenue, small schools revenue, basic skills revenue, secondary sparsity revenue, elementary sparsity revenue, transportation sparsity revenue, total operating capital revenue, equity revenue, pension adjustment revenue, and transition revenue.\n(a) The basic revenue for each district equals the formula allowance times the adjusted pupil units for the school year. The formula allowance for fiscal year 2023 is $6,863. The formula allowance for fiscal year 2024 is $7,138. The formula allowance for fiscal year 2025 is $7,281.\n(b) The formula allowance for fiscal year 2026 and later must be rounded to the nearest whole dollar and equals the formula allowance for the previous fiscal year times the greater of:\n(1) 1.02; or\n(2) one plus the rate of change in inflation calculated in paragraph (c) but not to exceed 1.03.\n(c) In January of the calendar year in which the formula allowance begins, the commissioner of education must calculate the rate of change in inflation equal to the change in the Consumer Price Index for all urban consumers as published by the Bureau of Labor Statistics of the Department of Labor for the average of the fourth calendar quarter of the second prior fiscal year compared to the average of the fourth calendar quarter of the immediately prior fiscal year.\n(d) The commissioner must publish the formula allowance by the end of February of each year.\n(e) It is the policy and purpose of the legislature to fund its public schools consistent with its constitutional obligations. To this purpose, the legislature may enact additional increases in the general education basic formula allowance.\n(a) A school district's extended time allowance equals $5,117 for fiscal year 2023 and later.\n(b) A school district's extended time revenue is equal to the product of the extended time allowance in paragraph (a) and the sum of the adjusted pupil units of the district for each pupil in average daily membership in excess of 1.0 and less than 1.2 according to section 126C.05, subdivision 8.\n(c) Extended time revenue for pupils placed in an on-site education program at the Prairie Lakes Education Center or the Lake Park School, located within the borders of Independent School District No. 347, Willmar, for instruction provided after the end of the preceding regular school year and before the beginning of the following regular school year equals membership hours divided by the minimum annual instructional hours in section 126C.05, subdivision 15, not to exceed 0.20, times the pupil unit weighting in section 126C.05, subdivision 1, times the extended time allowance in paragraph (a).\n(d) A school district qualifies for extended time revenue for instruction provided after the end of the preceding regular school year and before the beginning of the following regular school year for (1) every pupil attending a day treatment program, and (2) every pupil placed in a children's residential facility, whether the education services are provided on-site or off-site. Extended time revenue under this paragraph equals total membership hours in summer instruction divided by the minimum annual instructional hours in section 126C.05, subdivision 15, not to exceed 0.20, times the pupil unit weighting in section 126C.05, subdivision 1, times the extended time allowance.\n(e) For purposes of this subdivision, \"children's residential facility\" means a residential facility for children, including a psychiatric residential treatment facility, licensed by the Department of Human Services or the Department of Corrections and subject to Minnesota Rules, chapter 2960, or an inpatient hospitalization that includes mental health services.\n(f) For purposes of this subdivision, \"day treatment program\" means:\n(1) a site-based structured mental health program consisting of psychotherapy for three or more individuals and individual or group skills training provided by a team, under the treatment supervision of a mental health professional; or\n(2) any other day treatment program designated by the commissioner of education consistent with the Minnesota Automated Reporting Student System manual, procedure 27.\n(g) A school district's extended time revenue may be used for extended day programs, extended week programs, summer school, vacation break academies such as spring break academies and summer term academies, and other programming authorized under the learning year program.\nGifted and talented revenue for each district equals the district's adjusted pupil units for that school year times $13. A school district must reserve gifted and talented revenue and, consistent with section 120B.15, must spend the revenue only to:\n(1) identify gifted and talented students;\n(2) provide education programs for gifted and talented students; or\n(3) provide staff development to prepare teachers to best meet the unique needs of gifted and talented students.\n(a) A school district, not including a charter school, is eligible for small schools revenue equal to the greater of the calculation under paragraph (b) or (d).\n(b) The product of:\n(1) $544;\n(2) the district's adjusted pupil units for that year; and\n(3) the greater of zero or the ratio of (i) 960 less the district's adjusted pupil units for that year, to (ii) 960.\n(c) For the purpose of revenue calculated under paragraph (d), \"district\" includes a qualifying high school under subdivision 6 that is located in a district with at least two high schools.\n(d) The product of:\n(1) $544;\n(2) the district's adjusted pupil units for that year; and\n(3) the greater of zero or the ratio of (i) 960 less the district's adjusted pupil units for that year, to (ii) 960.\nA school district's declining enrollment revenue equals the greater of zero or the product of: (1) 28 percent of the formula allowance for that year; and (2) the difference between the adjusted pupil units for the preceding year and the adjusted pupil units for the current year.\n(a) Local optional revenue for a school district equals the sum of the district's first tier local optional revenue and second tier local optional revenue. A district's first tier local optional revenue equals $300 times the adjusted pupil units of the district for that school year. A district's second tier local optional revenue equals $424 times the adjusted pupil units of the district for that school year.\n(b) A district's local optional levy equals the sum of the first tier local optional levy and the second tier local optional levy.\n(c) A district's first tier local optional levy equals the district's first tier local optional revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $880,000.\n(d) For fiscal year 2023, a district's second tier local optional levy equals the district's second tier local optional revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $548,842. For fiscal year 2024, a district's second tier local optional levy equals the district's second tier local optional revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $510,000. For fiscal year 2025, a district's second tier local optional levy equals the district's second tier local optional revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $626,450. For fiscal year 2026, a district's second tier local optional levy equals the district's second tier local optional revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $642,038. For fiscal year 2027 and later, a district's second tier local optional levy equals the district's second tier local optional revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $671,345.\n(e) The local optional levy must be spread on referendum market value. A district may levy less than the permitted amount.\n(f) A district's local optional aid equals its local optional revenue minus its local optional levy. If a district's actual levy for first or second tier local optional revenue is less than its maximum levy limit for that tier, its aid must be proportionately reduced.\n(a) A district's compensatory revenue equals the sum of its compensatory revenue for each building in the district and the amounts designated under Laws 2015, First Special Session chapter 3, article 2, section 70, subdivision 8, for fiscal year 2017. Revenue shall be paid to the district and must be allocated according to section 126C.15, subdivision 2.\n(b) For fiscal years 2024 and 2025, the compensatory education revenue for each building in the district equals the formula allowance minus $839 times the compensation revenue pupil units computed according to section 126C.05, subdivision 3.\n(c) For fiscal year 2026 and later, the compensatory education revenue for each building in the district equals its compensatory pupils multiplied by the building compensatory allowance.\n(d) When the district contracting with an alternative program under section 124D.69 changes prior to the start of a school year, the compensatory revenue generated by pupils attending the program shall be paid to the district contracting with the alternative program for the current school year, and shall not be paid to the district contracting with the alternative program for the prior school year.\n(e) When the fiscal agent district for an area learning center changes prior to the start of a school year, the compensatory revenue shall be paid to the fiscal agent district for the current school year, and shall not be paid to the fiscal agent district for the prior school year.\n(f) Notwithstanding paragraph (c), for fiscal year 2026, if the sum of the amounts calculated under paragraph (c) is less than $838,947,000, the commissioner must proportionately increase the revenue to each building until the total statewide revenue calculated for each building equals $838,947,000.\n(g) Notwithstanding paragraph (c), for fiscal year 2027 and later, if the sum of the amounts calculated under paragraph (c) is less than $857,152,000, the commissioner must proportionately increase the revenue to each building until the total statewide revenue calculated for each building equals $857,152,000.\nThe definitions in this subdivision apply only to subdivisions 3, 3b, and 3c.\n(a) \"Building compensatory allowance\" means a building concentration factor multiplied by the statewide compensatory allowance.\n(b) \"Building concentration factor\" means the ratio of a building's compensatory pupils to the number of pupils enrolled in the building on October 1 of the previous fiscal year.\n(c) \"Compensatory pupils\" means the sum of the number of pupils enrolled in a building eligible to receive free meals pursuant to subdivision 3b plus one-half of the pupils eligible to receive reduced-priced meals pursuant to subdivision 3b on October 1 of the previous fiscal year.\n(d) \"Statewide compensatory allowance\" means the amount calculated pursuant to subdivision 3c.\n(e) Notwithstanding paragraphs (b) and (c), for voluntary prekindergarten programs under section 142D.08, charter schools, and contracted alternative programs in the first year of operation, the building concentration factor and compensatory pupils must be computed using data for the current fiscal year. If the voluntary prekindergarten program, charter school, or contracted alternative program begins operation after October 1, the building concentration factor and compensatory pupils must be computed based on pupils enrolled on an alternate date determined by the commissioner and the compensatory pupils must be prorated based on the ratio of the number of days of student instruction to 170 days.\nBeginning October 1, 2024, the commissioner shall determine the number of children eligible by means of direct certification to receive either a free or reduced-price meal on October 1 each year. Children enrolled in a building on October 1 and determined to be eligible by means of direct certification to receive free or reduced-price meals by December 15 of that school year shall be counted as eligible on October 1 for purposes of subdivision 3. The commissioner must use federal definitions for these purposes. The commissioner may adopt reporting guidelines to assure accuracy of data counts and eligibility. Districts must use any guidelines adopted by the commissioner.\nFor fiscal year 2026, the statewide compensatory allowance is $6,734. For fiscal year 2027 and later, the statewide compensatory allowance equals the statewide compensatory allowance in effect for the prior fiscal year times the ratio of the formula allowance under section 126C.10, subdivision 2, for the current fiscal year to the formula allowance under section 126C.10, subdivision 2, for the prior fiscal year, rounded to the nearest whole dollar.\nA school district's basic skills revenue equals the sum of:\n(1) compensatory revenue under subdivision 3; and\n(2) English learner revenue under section 124D.65, subdivisions 5 and 5a.\n[Repealed, 1Sp2011 c 11 art 1 s 37]\nThe definitions in this subdivision apply only to subdivisions 7 and 8.\n(a) \"High school\" means a public secondary school, except a charter school under chapter 124E, that has pupils enrolled in at least the 10th, 11th, and 12th grades. If there is no high school in the district and the school is at least 19 miles from the next nearest school, the commissioner must designate one school in the district as a high school for the purposes of this section.\n(b) \"Secondary average daily membership\" means, for a district that has only one high school, the average daily membership of pupils served in grades 7 through 12. For a district that has more than one high school, \"secondary average daily membership\" for each high school means the product of the average daily membership of pupils served in grades 7 through 12 in the high school, times the ratio of six to the number of grades in the high school.\n(c) \"Attendance area\" means the total surface area of the district, in square miles, divided by the number of high schools in the district. For a district that does not operate a high school and is less than 19 miles from the nearest operating high school, the attendance area equals zero.\n(d) \"Isolation index\" for a high school means the square root of 55 percent of the attendance area plus the distance in miles, according to the usually traveled routes, between the high school and the nearest high school. For a district in which there is located land defined in section 84A.01, 84A.20, or 84A.31, the distance in miles is the sum of:\n(1) the square root of one-half of the attendance area; and\n(2) the distance from the border of the district to the nearest high school.\n(e) \"Qualifying high school\" means a high school that has an isolation index greater than 23 and that has secondary average daily membership of less than 400.\n(f) \"Qualifying elementary school\" means a public elementary school, except a charter school under chapter 124E, that is located 19 miles or more from the nearest elementary school or from the nearest elementary school within the district and, in either case, has an elementary average daily membership of an average of 20 or fewer per grade.\n(g) \"Elementary average daily membership\" means, for a district that has only one elementary school, the average daily membership of pupils served in kindergarten through grade 6. For a district that has more than one elementary school, \"average daily membership\" for each school means the average daily membership of pupils served in kindergarten through grade 6 multiplied by the ratio of seven to the number of grades in the elementary school.\n(a) A district's secondary sparsity revenue for a school year equals the sum of the results of the following calculation for each qualifying high school in the district:\n(1) the formula allowance for the school year minus $530, multiplied by\n(2) the secondary average daily membership of pupils served in the high school, multiplied by\n(3) the quotient obtained by dividing 400 minus the secondary average daily membership by 400 plus the secondary daily membership, multiplied by\n(4) the lesser of 1.5 or the quotient obtained by dividing the isolation index minus 23 by ten.\n(b) A newly formed district that is the result of districts combining under the cooperation and combination program or consolidating under section 123A.48 must receive secondary sparsity revenue equal to the greater of: (1) the amount calculated under paragraph (a) for the combined district; or (2) the sum of the amounts of secondary sparsity revenue the former districts had in the year prior to consolidation, increased for any subsequent changes in the secondary sparsity formula.\nA district's elementary sparsity revenue equals the sum of the following amounts for each qualifying elementary school in the district:\n(1) the formula allowance for the year minus $530, multiplied by\n(2) the elementary average daily membership of pupils served in the school, multiplied by\n(3) the quotient obtained by dividing 140 minus the elementary average daily membership by 140 plus the average daily membership.\nA school district that closes a school facility or whose sparsity revenue is reduced by a school closure in another district is eligible for elementary and secondary sparsity revenue equal to the greater of the amounts calculated under subdivisions 6, 7, and 8 or the total amount of sparsity revenue for the previous fiscal year if the school board of the district has adopted a written resolution stating that the district intends to close the school facility, but cannot proceed with the closure without the adjustment to sparsity revenue authorized by this subdivision. The written resolution must be approved by the board and filed with the commissioner of education prior to the start of the fiscal year for which aid under this subdivision is first requested. A school district whose sparsity revenue is affected by a closure in another district is not required to adopt a written resolution under this section.\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a)]\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a)]\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a)]\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a); 1Sp2001 c 6 art 1 s 55 subd 1]\n(a) Total operating capital revenue for a district equals the sum of:\n(1) $79 times the adjusted pupil units for the school year;\n(2) the product of $109, the district's maintenance cost index, and its adjusted pupil units for the school year plus the amount computed under paragraph (c); and\n(3) $2 times the adjusted pupil units of the school district for the school year for the purposes of supplying menstrual products under subdivision 14, clause (26), and opiate antagonists under subdivision 14, clause (27).\n(b) The revenue under this subdivision must be placed in a reserved account in the general fund and may only be used according to subdivision 14.\n(c) The revenue under paragraph (a), clause (2), for a district that operates a program under section 124D.128, is increased by an amount equal to $31 times the number of adjusted pupil units served at the site where the program is implemented.\n(a) To obtain operating capital revenue, a district may levy an amount not more than the product of its operating capital equalization revenue for the fiscal year times the lesser of one or the ratio of its adjusted net tax capacity per adjusted pupil unit to the operating capital equalizing factor. The operating capital equalizing factor equals $22,912 for fiscal year 2024, $23,138 for fiscal year 2025, and $22,912 for fiscal year 2026 and later.\n(b) A district's operating capital equalization revenue equals the district's total operating capital revenue under subdivision 13, calculated without the amount under subdivision 13, paragraph (a), clause (3).\nA district's operating capital aid equals its operating capital revenue minus its operating capital levy times the ratio of the actual amount levied to the permitted levy.\nTotal operating capital revenue may be used only for the following purposes:\n(1) to acquire land for school purposes;\n(2) to acquire or construct buildings for school purposes;\n(3) to rent or lease buildings, including the costs of building repair or improvement that are part of a lease agreement;\n(4) to improve and repair school sites and buildings, and equip or reequip school buildings with permanent attached fixtures, including library media centers and gender-neutral single-user restrooms, locker room privacy stalls, or other spaces with privacy features, including single-user shower stalls, changing stalls, or other single-user facilities;\n(5) for a surplus school building that is used substantially for a public nonschool purpose;\n(6) to eliminate barriers or increase access to school buildings by individuals with a disability;\n(7) to bring school buildings into compliance with the State Fire Code adopted according to chapter 299F;\n(8) to remove asbestos from school buildings, encapsulate asbestos, or make asbestos-related repairs;\n(9) to clean up and dispose of polychlorinated biphenyls found in school buildings;\n(10) to clean up, remove, dispose of, and make repairs related to storing heating fuel or transportation fuels such as alcohol, gasoline, fuel oil, and special fuel, as defined in section 296A.01;\n(11) for energy audits for school buildings and to modify buildings if the audit indicates the cost of the modification can be recovered within ten years;\n(12) to improve buildings that are leased according to section 123B.51, subdivision 4;\n(13) to pay special assessments levied against school property but not to pay assessments for service charges;\n(14) to pay principal and interest on state loans for energy conservation according to section 216C.37 or loans made under the Douglas J. Johnson Economic Protection Trust Fund Act according to sections 298.292 to 298.297;\n(15) to purchase or lease interactive telecommunications equipment;\n(16) by board resolution, to transfer money into the debt redemption fund to: (i) pay the amounts needed to meet, when due, principal and interest payments on certain obligations issued according to chapter 475; or (ii) pay principal and interest on debt service loans or capital loans according to section 126C.70;\n(17) to pay operating capital-related assessments of any entity formed under a cooperative agreement between two or more districts;\n(18) to purchase or lease computers and related hardware, software, and annual licensing fees, copying machines, telecommunications equipment, and other noninstructional equipment;\n(19) to purchase or lease assistive technology or equipment for instructional programs;\n(20) to purchase textbooks as defined in section 123B.41, subdivision 2;\n(21) to purchase new and replacement library media resources or technology;\n(22) to lease or purchase vehicles;\n(23) to purchase or lease telecommunications equipment, computers, and related equipment for integrated information management systems for:\n(i) managing and reporting learner outcome information for all students under a results-oriented graduation rule;\n(ii) managing student assessment, services, and achievement information required for students with individualized education programs; and\n(iii) other classroom information management needs;\n(24) to pay personnel costs directly related to the acquisition, operation, and maintenance of telecommunications systems, computers, related equipment, and network and applications software;\n(25) to pay the costs directly associated with closing a school facility, including moving and storage costs;\n(26) to pay the costs of supplies and equipment necessary to provide access to menstrual products at no charge to students in restrooms and as otherwise needed in school facilities; and\n(27) to pay the costs of the opiate antagonists required under section 121A.224.\nExcept as otherwise prohibited by law, a district may spend general fund money for capital purposes.\n(a) A district's maintenance cost index is equal to the ratio of:\n(1) the total weighted square footage for all eligible district-owned facilities; and\n(2) the total unweighted square footage of these facilities.\n(b) The department shall determine a district's maintenance cost index annually. Eligible district-owned facilities must include only instructional or administrative square footage owned by the district. The commissioner may adjust the age of a building or addition for major renovation projects.\n(c) The square footage weighting factor for each original building or addition equals the lesser of:\n(1) one plus the ratio of the age in years to 100; or\n(2) 1.5.\n(d) The weighted square footage for each original building or addition equals the product of the unweighted square footage times the square footage weighting factor.\nThe definitions in this subdivision apply to subdivision 18.\n(a) \"Sparsity index\" for a district means the greater of .2 or the ratio of the square mile area of the district to the resident pupil units of the district.\n(b) \"Density index\" for a district means the ratio of the square mile area of the district to the resident pupil units of the district. However, the density index for a district cannot be greater than .2 or less than .005.\n(a) A district's transportation sparsity allowance equals the greater of zero or the result of the following computation:\n(i) Multiply the formula allowance according to subdivision 2, by .141.\n(ii) Multiply the result in clause (i) by the district's sparsity index raised to the 26/100 power.\n(iii) Multiply the result in clause (ii) by the district's density index raised to the 13/100 power.\n(iv) Multiply the formula allowance according to subdivision 2, by .0466.\n(v) Subtract the result in clause (iv) from the result in clause (iii).\n(b) Transportation sparsity revenue is equal to the transportation sparsity allowance times the adjusted pupil units.\n(a) An independent, common, or special school district's transportation sparsity revenue under subdivision 18 is increased by the greater of zero or 35 percent of the difference between:\n(1) the lesser of the district's total cost for regular and excess pupil transportation under section 123B.92, subdivision 1, paragraph (b), including depreciation, for the previous fiscal year or 105 percent of the district's total cost for the second previous fiscal year; and\n(2) the sum of:\n(i) 4.66 percent of the district's basic revenue for the previous fiscal year;\n(ii) transportation sparsity revenue under subdivision 18 for the previous fiscal year;\n(iii) the district's charter school transportation adjustment for the previous fiscal year;\n(iv) the district's reimbursement for transportation provided under section 123B.92, subdivision 1, paragraph (b), clause (1), item (vi); and\n(v) the district's area learning center transportation aid under section 123B.92, subdivision 11.\n(b) A charter school's pupil transportation adjustment equals the school district per pupil unit adjustment under paragraph (a).\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a)]\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a)]\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a)]\n[Repealed, 1Sp2001 c 5 art 2 s 30 para (a)]\n[Repealed, 1Sp2001 c 6 art 1 s 55 subd 1]\n(a) A school district qualifies for equity revenue if:\n(1) the school district's adjusted pupil unit amount of basic revenue, transition revenue, first tier local optional revenue, and referendum revenue is less than the value of the school district at or immediately above the 95th percentile of school districts in its equity region for those revenue categories; and\n(2) the school district's administrative offices are not located in a city of the first class on July 1, 1999.\n(b) Equity revenue equals the product of (1) the district's adjusted pupil units for that year; times (2) the sum of (i) $14, plus (ii) $80, times the school district's equity index computed under subdivision 27.\n(c) A school district's equity revenue is increased by the greater of zero or an amount equal to the district's adjusted pupil units times the difference between ten percent of the statewide average amount of referendum revenue and first tier local optional revenue per adjusted pupil unit for that year and the sum of the district's referendum revenue and first tier local optional revenue per adjusted pupil unit. A school district's revenue under this paragraph must not exceed $100,000 for that year.\n(d) A school district's equity revenue for a school district located in the metro equity region equals the amount computed in paragraphs (b) and (c) multiplied by 1.25.\n(e) For fiscal year 2020 and later for a school district not included in paragraph (d), a district's equity revenue equals the amount computed in paragraphs (b) and (c) multiplied by 1.25.\n(f) A school district's additional equity revenue equals $50 times its adjusted pupil units.\nThe regional equity gap equals the difference between the value of the school district at or immediately above the fifth percentile of adjusted general revenue per adjusted pupil unit and the value of the school district at or immediately above the 95th percentile of adjusted general revenue per adjusted pupil unit.\nA district's equity gap equals the greater of zero or the difference between the district's adjusted general revenue and the value of the school district at or immediately above the regional 95th percentile of adjusted general revenue per adjusted pupil unit.\nA district's equity index equals the ratio of the sum of the district equity gap amount to the regional equity gap amount.\nFor the purposes of computing equity revenue under subdivision 24, a district with its administrative office located in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington County on January 1, 2012, is part of the metro equity region. All other districts are part of the rural equity region.\nTo obtain equity revenue for fiscal year 2015 and later, a district may levy an amount not more than the product of its equity revenue for the fiscal year times the lesser of one or the ratio of its referendum market value per resident pupil unit to $510,000.\nA district's equity aid equals its equity revenue minus its equity levy times the ratio of the actual amount levied to the permitted levy.\n(a) A district's transition allowance equals the sum of the transition revenue the district would have received for fiscal year 2015 under Minnesota Statutes 2012, section 126C.10, subdivisions 31, 31a, and 31c, and the greater of zero or the difference between:\n(1) the sum of:\n(i) the general education revenue the district would have received for fiscal year 2015 according to Minnesota Statutes 2012, section 126C.10;\n(ii) the integration revenue the district received for fiscal year 2013 under Minnesota Statutes 2012, section 124D.86;\n(iii) the pension adjustment the district would have received for fiscal year 2015 under Minnesota Statutes 2012, section 127A.50;\n(iv) the special education aid the district would have received for fiscal year 2015 under Minnesota Statutes 2012, section 125A.76; and\n(v) the special education excess cost aid the district would have received for fiscal year 2015 under Minnesota Statutes 2012, section 125A.79; and\n(2) the sum of the district's:\n(i) general education revenue for fiscal year 2015 excluding transition revenue under this section;\n(ii) achievement and integration revenue for fiscal year 2015 under section 124D.862;\n(iii) special education aid for fiscal year 2015 under section 125A.76; and\n(iv) alternative teacher compensation revenue for fiscal year 2015 under section 122A.415,\ndivided by the number of adjusted pupil units for fiscal year 2015.\n(b) A district's transition revenue for fiscal year 2015 and later equals the product of the district's transition allowance times the district's adjusted pupil units.\nMS 2012 [Repealed, 2013 c 116 art 1 s 59]\nMS 2012 [Repealed, 2013 c 116 art 1 s 59]\nMS 2012 [Repealed, 2013 c 116 art 1 s 59]\nTo obtain transition revenue for fiscal year 2015 and later, a district may levy an amount not more than the product of its transition revenue for the fiscal year times the lesser of one or the ratio of its referendum market value per resident pupil unit to $510,000.\n(a) For fiscal year 2004, a district's transition aid equals its transition revenue.\n(b) For fiscal year 2005 and later, a district's transition aid equals its transition revenue minus its transition levy times the ratio of the actual amount levied to the permitted levy.\nMS 2012 [Repealed, 2013 c 116 art 1 s 59]\nMS 2012 [Repealed, 2013 c 116 art 1 s 59]\nMS 2012 [Repealed, 2013 c 116 art 1 s 59]\n(a) A school district's pension adjustment revenue equals the sum of:\n(1) the greater of zero or the product of:\n(i) the difference between the district's adjustment under Minnesota Statutes 2012, section 127A.50, subdivision 1, for fiscal year 2014 per adjusted pupil unit and the state average adjustment under Minnesota Statutes 2012, section 127A.50, subdivision 1, for fiscal year 2014 per adjusted pupil unit; and\n(ii) the district's adjusted pupil units for the fiscal year; and\n(2) the product of the salaries paid to district employees who were members of the Teachers Retirement Association and the St. Paul Teachers' Retirement Fund Association for the prior fiscal year and the district's pension adjustment rate for the fiscal year. The pension adjustment rate for Independent School District No. 625, St. Paul, equals 2.3 percent for fiscal year 2023, 2.5 percent for fiscal year 2024 and fiscal year 2025, and 3.25 percent for fiscal year 2026 and later. The pension adjustment rate for all other districts equals 1.05 percent for fiscal year 2023, 1.25 percent for fiscal year 2024 and fiscal year 2025, and 2.0 percent for fiscal year 2026 and later.\n(b) For fiscal year 2025, the state total pension adjustment revenue under paragraph (a), clause (2), must not exceed the amount calculated under paragraph (a), clause (2), for fiscal year 2024. The commissioner must prorate the pension adjustment revenue under paragraph (a), clause (2), so as not to exceed the maximum.\n(c) For fiscal year 2026 and fiscal year 2027, the state total pension adjustment revenue under paragraph (a), clause (2), must not be prorated.\n(d) For fiscal year 2028 and later, the state total pension adjustment revenue under paragraph (a), clause (2), must not exceed the amount calculated under paragraph (a), clause (2), for fiscal year 2027. The commissioner must prorate the pension adjustment revenue under paragraph (a), clause (2), so as not to exceed the maximum.\n(e) Notwithstanding section 123A.26, subdivision 1, a cooperative unit, as defined in section 123A.24, subdivision 2, qualifies for pension adjustment revenue under paragraph (a), clause (2), as if it was a district, and the aid generated by the cooperative unit shall be paid to the cooperative unit.",
	"repealed": false
}