{
	"id": "383B.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.34",
	"title": "383B.34 CLASSIFICATION OF EMPLOYEES.",
	"text": "The director shall be responsible for the classification of each position in the county service. This duty shall extend to all positions held by members of the classified service under sections 383B.26 to 383B.42. A title shall be established for each class. The classifications, when approved by the board and the county board, shall take effect immediately.\nThe director shall allocate positions in the classified service to one of the classes within the classification plan.\n(a) When a position is established, the appointing authority shall notify the director who shall allocate that position to a class which will become effective immediately. The appointing authority may request reconsideration from the director in accordance with the rules of the board. The director shall notify the appointing authority of any final action.\n(b) Whenever a position appears to be improperly allocated, the director shall, with or without the written request of a permanent employee or an appointing authority, investigate the position. Following that investigation the director may either reallocate the position or deny the request for reallocation. Notice of the action shall be given to the appointing authority and the affected employee. Unless otherwise provided in the notice, the decision of the director shall be immediately effective. The appointing authority or the affected employee may file a request for reconsideration with the director in accordance with the rules of the board. In all cases the burden of proof shall be upon the person requesting the reallocation.\n(c) Except as provided the incumbent of a position which has been reallocated shall continue in the position only if the incumbent is eligible for and actually appointed to the position of the new class in accordance with the rules of the board governing promotion, transfers and demotion. If the incumbent is ineligible to continue in the position and the incumbent is not transferred, promoted or demoted, the layoff provisions of sections 383B.26 to 383B.42 shall apply. Personnel changes required by the reallocation of positions shall be completed in accordance with the rules of the board. Any permanent or probationary employee whose position is reallocated may compete, if qualified as defined in the minimum qualifications for the class specification, in an examination held to fill the reallocated position as provided in the rules of the board and shall be considered for appointment if the employee passes the examination.\n(d) When a position is reallocated to a class in a lower salary range, the director may give consideration to the employee's service, qualifications, or other considerations in determining whether the employee shall continue at the same rate of pay. Thereafter, as long as the employee remains in the same position, no salary increase shall be granted until the salary range of the class exceeds the employee's present salary.\n(e) The board shall review an allocation upon the written request of the appointing authority or affected employee on the grounds that the action of the director was not in accordance with sections 383B.26 to 383B.42.\nThe director shall submit the record upon which the action was taken. Thereafter the board may sustain, reverse, or modify the action of the director, or request further evidence from the parties. The appointing authority, subject to county board approval, or any employee may petition the district court for a review and determination of any alleged arbitrary or capricious action on the part of the Human Resources Board involving allocation.",
	"repealed": false
}