{
	"id": "299F.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.46",
	"title": "299F.46 HOTEL INSPECTIONS.",
	"text": "(a) It shall be the duty of the commissioner of public safety to inspect, or cause to be inspected, at least once every three years, every hotel in this state; and, for that purpose, the commissioner, or the commissioner's deputies or designated alternates or agents, shall have the right to enter or have access thereto at any reasonable hour; and, when, upon such inspection, it shall be found that the hotel so inspected does not conform to or is not being operated in accordance with the provisions of sections 157.011 and 157.15 to 157.22, in so far as the same relate to fire prevention or fire protection of hotels, or the rules promulgated thereunder, or is being maintained or operated in such manner as to violate the Minnesota State Fire Code promulgated pursuant to section 326B.02, subdivision 6, 299F.51, or any other law of this state relating to fire prevention and fire protection of hotels, the commissioner and the deputies or designated alternates or agents shall report such a situation to the hotel inspector who shall proceed as provided for in chapter 157.\n(b) The word \"hotel\", as used in this subdivision, has the meaning given in section 299F.391.\n(a) The commissioner of public safety may enter into an agreement with any county, two or more contiguous counties, or city or other municipality, hereafter called the designated agent, under which agreement the designated agent may agree to perform all or part of the inspection duties authorized in subdivision 1. The agreement shall also set forth criteria by which the commissioner will determine that performance by the designated agent complies with state standards and is sufficient to replace inspection by the commissioner. The agreement may specify minimum staff requirements and qualifications and provide for termination procedures if the commissioner finds that the designated agent fails to comply with the terms and requirements of the agreement.\n(b) No designated agent may perform any inspection duties pursuant to the agreement in any territory outside its jurisdiction.\n(c) The scope of the agreement shall be limited to duties and responsibilities agreed upon by the parties and may provide a basis for automatic renewal and provisions for notice of intent to terminate by either party.\n(d) During the life of the agreement the commissioner shall not perform any inspection which the designated agent is required to perform under the agreement, except for inspection necessary to determine compliance with the agreement and this section. The commissioner shall consult with, advise and assist a designated agent in the performance of its duties under the agreement.\n(e) No agreement shall be effective to transfer any tort liability attributable to any inspection or lack of inspection from the state of Minnesota to the local unit contracting to perform the inspection.\n(a) For each hotel required to have a fire inspection according to subdivision 1, the commissioner of public safety may charge each hotel a triennial inspection fee of $435 and a per-room charge of $5 for one to 18 units, $6 for 19 to 35 units, $7 for 36 to 100 units, and $8 for 100 or more units. The fee includes one follow-up inspection. The commissioner shall charge each resort a triennial inspection fee of $435 and a per room charge of $5 for one to ten units, $6 for 11 to 25 units, and $7 for 26 or more units.\n(b) The commissioner shall charge a fee of $225 for each additional follow-up inspection for hotels and resorts, conducted in each three-year cycle that is necessary to bring the hotel or resort into compliance with the State Fire Code.\n(c) Nothing in this subdivision prevents the designated agent from continuing to charge an inspection fee or from establishing a new inspection fee.\n(d) Hotels and motels with fewer than 35 rooms and resorts classified as 1c under section 273.13 are exempt from the fee requirements of this subdivision.\nMoney received by the State Fire Marshal Division for this program must be deposited in the state treasury and credited to a state fire marshal hotel inspection dedicated account in the special revenue fund. All money in the state fire marshal hotel inspection dedicated account is annually appropriated to the commissioner of public safety to operate and administer this program.",
	"repealed": false
}