{
	"id": "626.8476",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8476",
	"title": "626.8476 CONFIDENTIAL INFORMANTS; REQUIRED POLICY AND TRAINING.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Confidential informant\" means a person who cooperates with a law enforcement agency confidentially in order to protect the person or the agency's intelligence gathering or investigative efforts and:\n(1) seeks to avoid arrest or prosecution for a crime, mitigate punishment for a crime in which a sentence will be or has been imposed, or receive a monetary or other benefit; and\n(2) is able, by reason of the person's familiarity or close association with suspected criminals, to:\n(i) make a controlled buy or controlled sale of contraband, controlled substances, or other items that are material to a criminal investigation;\n(ii) supply regular or constant information about suspected or actual criminal activities to a law enforcement agency; or\n(iii) otherwise provide information important to ongoing criminal intelligence gathering or criminal investigative efforts.\n(c) \"Controlled buy\" means the purchase of contraband, controlled substances, or other items that are material to a criminal investigation from a target offender that is initiated, managed, overseen, or participated in by law enforcement personnel with the knowledge of a confidential informant.\n(d) \"Controlled sale\" means the sale of contraband, controlled substances, or other items that are material to a criminal investigation to a target offender that is initiated, managed, overseen, or participated in by law enforcement personnel with the knowledge of a confidential informant.\n(e) \"Mental harm\" means a psychological injury that is not necessarily permanent but results in visibly demonstrable manifestations of a disorder of thought or mood that impairs a person's judgment or behavior.\n(f) \"Target offender\" means the person suspected by law enforcement personnel to be implicated in criminal acts by the activities of a confidential informant.\n(a) By January 1, 2022, the board shall adopt a model policy addressing the use of confidential informants by law enforcement. The model policy must establish policies and procedures for the recruitment, control, and use of confidential informants. In developing the policy, the board shall consult with representatives of the Bureau of Criminal Apprehension, Minnesota Police Chiefs Association, Minnesota Sheriffs' Association, Minnesota Police and Peace Officers Association, Minnesota County Attorneys Association, treatment centers for substance abuse, and mental health organizations. The model policy must include, at a minimum, the following:\n(1) information that the law enforcement agency shall maintain about each confidential informant that must include, at a minimum, an emergency contact for the informant in the event of the informant's physical or mental harm or death;\n(2) a process to advise a confidential informant of conditions, restrictions, and procedures associated with participating in the agency's investigative or intelligence gathering activities;\n(3) procedures for compensation to an informant that is commensurate with the value of the services and information provided and based on the level of the targeted offender, the amount of any seizure, and the significance of contributions made by the informant;\n(4) designated supervisory or command-level review and oversight in the use of a confidential informant;\n(5) limits or restrictions on off-duty association or social relationships by law enforcement agency personnel with a confidential informant;\n(6) limits or restrictions on the potential exclusion of an informant from engaging in a controlled buy or sale of a controlled substance if the informant is known by the law enforcement agency to: (i) be receiving in-patient or out-patient treatment administered by a licensed service provider for substance abuse; (ii) be participating in a treatment-based drug court program; or (iii) have experienced a drug overdose within the past year;\n(7) exclusion of an informant under the age of 18 years from participating in a controlled buy or sale of a controlled substance without the written consent of a parent or legal guardian, except that the informant may provide confidential information to a law enforcement agency;\n(8) consideration of an informant's diagnosis of mental illness, substance abuse, or disability, and history of mental illness, substance abuse, or disability;\n(9) guidelines for the law enforcement agency to consider if the agency decides to establish a procedure to request an advocate from the county social services agency for an informant if the informant is an addict in recovery or possesses a physical or mental infirmity or other physical, mental, or emotional dysfunction that impairs the informant's ability to understand instructions and make informed decisions, where the agency determines this process does not place the informant in any danger;\n(10) guidelines for the law enforcement agency to use to encourage prospective and current confidential informants who are known to be substance abusers or to be at risk for substance abuse to seek prevention or treatment services;\n(11) reasonable protective measures for a confidential informant when law enforcement knows or should have known of a risk or threat of harm to a person serving as a confidential informant and the risk or threat of harm is a result of the informant's service to the law enforcement agency;\n(12) guidelines for the training and briefing of a confidential informant;\n(13) reasonable procedures to help protect the identity of a confidential informant during the time the person is acting as an informant;\n(14) procedures to deactivate a confidential informant that maintain the safety and anonymity of the informant;\n(15) optional procedures that the law enforcement agency may adopt relating to deactivated confidential informants to offer and provide assistance to them with physical, mental, or emotional health services;\n(16) a process to evaluate and report the criminal history and propensity for violence of any target offenders; and\n(17) guidelines for a written agreement between the confidential informant and the law enforcement agency that take into consideration, at a minimum, an informant's physical or mental infirmity or other physical, mental, or emotional dysfunction that impairs the informant's ability to knowingly contract or otherwise protect the informant's self-interest.\n(b) The board shall annually review and, as necessary, revise the model confidential informant policy in collaboration with representatives from the organizations listed under paragraph (a).\n(a) The chief law enforcement officer of every state and local law enforcement agency must establish and enforce a written policy governing the use of confidential informants. The policy must be identical or, at a minimum, substantially similar to the new or revised model policy adopted by the board under subdivision 2.\n(b) Every state and local law enforcement agency must certify annually to the board that it has adopted a written policy in compliance with the board's model confidential informant policy.\n(c) The board shall assist the chief law enforcement officer of each state and local law enforcement agency in developing and implementing confidential informant policies under this subdivision.\nThe chief law enforcement officer of every state and local law enforcement agency shall provide in-service training in the recruitment, control, and use of confidential informants to every peace officer and part-time peace officer employed by the agency who the chief law enforcement officer determines is involved in working with confidential informants given the officer's responsibilities. The training shall comply with learning objectives based on the policies and procedures of the model policy developed and approved by the board.\nThe board has the authority to inspect state and local agency policies to ensure compliance with this section. The board may conduct the inspection based upon a complaint it receives about a particular agency or through a random selection process.\nThe board may impose licensing sanctions and seek injunctive relief under section 214.11 for failure to comply with the requirements of this section.",
	"repealed": false
}