{
	"id": "115A.1441",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1441",
	"title": "115A.1441 DEFINITIONS.",
	"text": "For the purposes of sections 115A.144 to 115A.1463, the terms in this section have the meanings given.\n\"Advisory board\" or \"board\" means the Producer Responsibility Advisory Board established under section 115A.1444.\n\"Brand\" means a name, symbol, word, or mark that identifies a product and attributes the product and its components, including packaging, to the brand owner.\n\"Brand owner\" means a person that owns or licenses a brand or that otherwise has rights to market a product under the brand, whether or not the brand's trademark is registered.\n\"Collection rate\" means the amount of a covered material by covered materials type collected by service providers and transported for recycling or composting divided by the total amount of the type of a covered material by covered materials type sold or distributed into the state by the relevant unit of measurement established in section 115A.1451.\n\"Compostable material\" means a covered material that:\n(1) meets, and is labeled to reflect that it meets, the American Society for Testing and Materials Standard Specification for Labeling of Plastics Designed to be Aerobically Composted in Municipal or Industrial Facilities (D6400) or its successor;\n(2) meets, and is labeled to reflect that it meets, the American Society for Testing and Materials Standard Specification for Labeling of End Items that Incorporate Plastics and Polymers as Coatings or Additives with Paper and Other Substrates Designed to be Aerobically Composted in Municipal or Industrial Facilities (D6868) or its successor;\n(3) is comprised of only wood without any coatings or additives; or\n(4) is comprised of only paper without any coatings or additives.\n\"Composting\" means the controlled microbial degradation of source-separated compostable materials to yield a humus-like product.\n\"Composting rate\" means the amount of compostable covered material that is managed through composting, divided by the total amount of compostable covered material sold or distributed into the state by the relevant unit of measurement established in section 115A.1451.\n\"Covered entity\" means a person or location that receives covered services for covered materials in accordance with the requirements of sections 115A.144 to 115A.1463, including:\n(1) a single-family residence;\n(2) a multifamily residence;\n(3) a school as defined in sections 120A.22, subdivision 4, and 136A.62, subdivision 3, clauses (1) and (2); a nonpublic school as defined in section 123B.41, subdivision 9; postsecondary educational systems as defined in section 142E.01, subdivision 20; a provider as defined in section 142E.01, subdivision 20; and any other location where education or child care is provided;\n(4) a nonprofit corporation with annual revenue of less than $35,000,000; and\n(5) a state agency, political subdivision, public area, public entity as defined in section 115A.151, or other governmental unit.\n\"Covered material\" means packaging and paper products introduced. Covered material does not include exempt materials.\n\"Covered materials type\" means a singular and specific type of covered material, such as paper, plastic, metal, or glass, that:\n(1) can be categorized based on distinguishing chemical or physical properties, including properties that allow a covered materials type to be aggregated into a discrete commodity category for purposes of reuse, recycling, or composting; and\n(2) is based on similar uses in the form of a product or package.\n\"Covered services\" means collecting, transferring, transporting, sorting, processing, recovering, preparing, or otherwise managing for purposes of waste reduction, reuse, recycling, or composting. Covered services does not mean any management method according to section 115A.02, paragraph (b), clauses (4) to (6).\n\"De minimis producer\" means a person that in their most recent fiscal year:\n(1) introduced less than one ton of covered material into this state; or\n(2) earned global gross revenues of less than $2,000,000.\n\"Drop-off collection site\" means a physical location where covered materials are accepted from the public and that is open a minimum of 12 hours weekly throughout the year.\n\"Environmental impact\" means the impact of a covered material on human health and the environment from extraction and processing of the raw materials composing the material through manufacturing; distribution; use; recovery for reuse, recycling, or composting; and final disposal.\n\"Exempt materials\" means materials, or any portion of materials, that:\n(1) are packaging for infant formula, as defined in United States Code, title 21, section 321(z);\n(2) are packaging for medical food, as defined in United States Code, title 21, section 360ee(b)(3);\n(3) are packaging for a fortified oral nutritional supplement used by persons who require supplemental or sole source nutrition to meet nutritional needs due to special dietary needs directly related to cancer, chronic kidney disease, diabetes, malnutrition, or failure to thrive, as those terms are defined by the International Classification of Diseases, Tenth Revision;\n(4) are packaging for a product regulated as a drug or medical device by the United States Food and Drug Administration, including associated components and consumable medical equipment;\n(5) are packaging for a medical equipment or product used in medical settings that is regulated by the United States Food and Drug Administration, including associated components and consumable medical equipment;\n(6) are drugs, biological products, parasiticides, medical devices, or in vitro diagnostics that are used to treat, or that are administered to, animals and are regulated by the United States Food and Drug Administration under the Federal Food, Drug, and Cosmetic Act, United States Code, title 21, section 301 et seq., by the United States Department of Agriculture under the federal Virus-Serum-Toxin Act, United States Code, title 21, section 151 et seq.;\n(7) are packaging for products regulated by the United States Environmental Protection Agency under the Federal Insecticide, Fungicide, and Rodenticide Act, United States Code, title 7, section 136 et seq.;\n(8) are packaging used to contain liquefied petroleum gas and are designed to be refilled;\n(9) are paper products used for a newspaper's print publications, including supplements or enclosures, that include content derived from primary sources related to news and current events;\n(10) are paper products used for a magazine's print publication that has a circulation of less than 95,000 and that primarily includes content derived from primary sources related to news and current events;\n(11) are packaging used to contain hazardous or flammable products regulated by the 2012 federal Occupational Safety and Health Administration Hazard Communication Standard, Code of Federal Regulations, title 29, section 1910.1200, that prevent the packaging from being waste reduced or made reusable, recyclable, or compostable, as determined by the commissioner;\n(12) are packaging that is being collected and properly managed through a paint stewardship plan approved under section 115A.1415;\n(13) are exempt materials, as determined by the commissioner under section 115A.1453, subdivision 6; or\n(14) are covered materials that:\n(i) a producer distributes to another producer;\n(ii) are subsequently used to contain a product, and the product is distributed to a commercial or business entity for the production of another product; and\n(iii) are not introduced to a person other than the commercial or business entity that first received the product used for the production of another product.\n\"Food packaging\" has the meaning given in section 325F.075.\n\"Independent auditor\" means an independent and actively licensed certified public accountant that is:\n(1) retained by a producer responsibility organization;\n(2) not otherwise employed by or affiliated with a producer responsibility organization; and\n(3) qualified to conduct an audit under state law.\n\"Infrastructure investment\" means an investment by a producer responsibility organization that funds or reimburses a person for:\n(1) equipment or facilities in which covered materials are prepared for reuse, recycling, or composting;\n(2) equipment or facilities used for waste reduction, reuse, recycling, or composting of covered materials; or\n(3) the expansion or strengthening of demand for and use of covered materials by responsible markets in the state or region.\n\"Introduce\" means to sell, offer for sale, distribute, or use to ship a product within or into this state.\n\"Living wage\" means the minimum hourly wage necessary to allow a person working 40 hours per week to afford basic needs.\n\"Needs assessment\" means an assessment conducted according to section 115A.1450, subdivision 4. Except where the context requires otherwise, needs assessment means the most recently completed needs assessment.\n\"Packaging\" has the meaning given in section 115A.03 and includes food packaging. Packaging does not include exempt materials.\n\"Paper product\" means a product made primarily from wood pulp or other cellulosic fibers but does not include bound books or products that recycling or composting facilities will not accept because of the unsafe or unsanitary nature of the paper product. Paper product does not include exempt materials.\n\"Postconsumer recycled content\" means the amount of postconsumer material used by a producer in the production of a covered materials type, divided by the total amount of that covered materials type used for products sold or distributed by the producer in that same calendar year.\n(a) \"Producer\" means the following person responsible for compliance with requirements under sections 115A.144 to 115A.1463 for a covered material introduced:\n(1) for items sold in or with packaging at a physical retail location in this state:\n(i) if the item is sold in or with packaging under the brand of the item manufacturer or is sold in packaging that lacks identification of a brand, the producer is the person that manufactures the item;\n(ii) if there is no person to which item (i) applies, the producer is the person that is licensed to manufacture and sell or offer for sale to consumers in this state an item with packaging under the brand or trademark of another manufacturer or person;\n(iii) if there is no person to which item (i) or (ii) applies, the producer is the brand owner of the item;\n(iv) if there is no person described in item (i), (ii), or (iii) within the United States, the producer is the person who is the importer of record for the item into the United States for use in a commercial enterprise that sells, offers for sale, or distributes the item in this state; or\n(v) if there is no person described in items (i) to (iv), the producer is the person that first distributes the item in or into this state;\n(2) for items sold or distributed in packaging in or into this state via e-commerce, remote sale, or distribution:\n(i) for packaging used to directly protect or contain the item, the producer of the packaging is the same as the producer identified under clause (1); and\n(ii) for packaging used to ship the item to a consumer, the producer of the packaging is the person that packages the item to be shipped to the consumer;\n(3) for packaging that is a covered material and is not included in clauses (1) and (2), the producer of the packaging is the person that first distributes the item in or into this state;\n(4) for paper products that are magazines, catalogs, telephone directories, or similar publications, the producer is the publisher;\n(5) for paper products not described in clause (4):\n(i) if the paper product is sold under the manufacturer's own brand, the producer is the person that manufactures the paper product;\n(ii) if there is no person to which item (i) applies, the producer is the person that is the owner or licensee of a brand or trademark under which the paper product is used in a commercial enterprise, sold, offered for sale, or distributed in or into this state, whether or not the trademark is registered in this state;\n(iii) if there is no person to which item (i) or (ii) applies, the producer is the brand owner of the paper product;\n(iv) if there is no person described in item (i), (ii), or (iii) within the United States, the producer is the person that imports the paper product into the United States for use in a commercial enterprise that sells, offers for sale, or distributes the paper product in this state; or\n(v) if there is no person described in items (i) to (iv), the producer is the person that first distributes the paper product in or into this state; and\n(6) a person is the producer of a covered material sold, offered for sale, or distributed in or into this state, as defined in clauses (1) to (5), except:\n(i) where another person has mutually signed an agreement with a producer as defined in clauses (1) to (5) that contractually assigns responsibility to the person as the producer, and the person has joined a registered producer responsibility organization as the responsible producer for that covered material under sections 115A.144 to 115A.1463. In the event that another person is assigned responsibility as the producer under this subdivision, the producer under clauses (1) to (5) must provide written certification of that contractual agreement to the producer responsibility organization; and\n(ii) if the producer described in clauses (1) to (5) is a business operated wholly or in part as a franchise, the producer is the franchisor if that franchisor has franchisees that have a commercial presence within the state.\n(b) \"Producer\" does not include:\n(1) a state, a federal or state agency, a political subdivision, or other governmental unit;\n(2) a registered 501(c)(3) charitable organization or 501(c)(4) social welfare organization;\n(3) a de minimis producer;\n(4) a mill that uses any virgin wood fiber in the products it produces; or\n(5) a paper mill that produces container board derived from 100 percent postconsumer recycled content and nonpostconsumer recycled content.\n\"Producer responsibility organization\" means a nonprofit corporation that is tax exempt under chapter 501(c)(3) of the federal Internal Revenue Code and that is created by a group of producers to implement activities under sections 115A.144 to 115A.1463.\n\"Recycling\" has the meaning given in section 115A.03 except that recycling does not include reuse or composting, as defined in sections 115A.144 to 115A.1463.\n\"Recycling rate\" means the amount of recyclable covered material, in aggregate or by individual covered materials type, recycled in a calendar year divided by the total amount of recyclable covered materials sold or distributed into the state by the relevant unit of measurement established in section 115A.1451.\n\"Refill\" means the continued use of a covered material by a consumer through a system that is:\n(1) intentionally designed and marketed for repeated filling of a covered material to reduce demand for new production of the covered material;\n(2) supported by adequate logistics and infrastructure to provide convenient access for consumers; and\n(3) compliant with all applicable federal, state, and local statutes, rules, ordinances, and other laws governing health and safety.\n\"Responsible market\" means a materials market that:\n(1) reuses, recycles, composts, or otherwise recovers materials and disposes of contaminants in a manner that protects the environment and minimizes risks to public health and worker health and safety;\n(2) complies with all applicable federal, state, and local statutes, rules, ordinances, and other laws governing environmental, health, safety, and financial responsibility;\n(3) possesses all requisite licenses and permits required by a federal or state agency or political subdivision;\n(4) if the market operates in the state, manages waste according to the waste management goal and priority order of waste management practices stated in section 115A.02; and\n(5) minimizes adverse impacts to environmental justice areas, as defined in section 115A.03.\n\"Return rate\" means the amount of reusable covered material in aggregate or by individual covered materials type, collected for reuse by a producer or service provider in a calendar year, divided by the total amount of reusable covered materials sold or distributed into the state by the relevant unit of measurement established in section 115A.1451.\n\"Reusable\" means capable of reuse.\n\"Reuse\" means the return of a covered material to the marketplace and the continued use of the covered material by a producer or service provider when the covered material is:\n(1) intentionally designed and marketed to be used multiple times for its original intended purpose without a change in form;\n(2) designed for durability and maintenance to extend its useful life and reduce demand for new production of the covered material;\n(3) supported by adequate logistics and infrastructure at a retail location, by a service provider, or on behalf of or by a producer, that provides convenient access for consumers; and\n(4) compliant with all applicable federal, state, and local statutes, rules, ordinances, and other laws governing health and safety.\n\"Reuse rate\" means the share of units of a reusable covered material sold or distributed into the state in a calendar year that are demonstrated and deemed reusable in accordance with an approved stewardship plan under section 115A.1451.\n\"Service provider\" means an entity that provides covered services for covered materials. A political subdivision that provides or that contracts or otherwise arranges with another party to provide covered services for covered materials within its jurisdiction may be a service provider regardless of whether it provided, contracted for, or otherwise arranged for similar services before the approval of the applicable stewardship plan.\n\"Third-party certification\" means certification by an accredited independent organization that a standard or process required by sections 115A.144 to 115A.1463, or by a stewardship plan approved under sections 115A.144 to 115A.1463, has been achieved.\n\"This act\" means sections 115A.144 to 115A.1463.\n\"Toxic substance\" means hazardous waste, a problem material, a chemical or chemical class regulated under section 115A.965, 116.943, 325F.075, or 325F.172 to 325F.179, or a chemical of high concern identified under section 116.9402.\n\"Waste reduction\" or \"source reduction\" has the meaning given in section 115A.03, except that waste reduction or source reduction does not include reuse, but does include refill, as defined in sections 115A.144 to 115A.1463.",
	"repealed": false
}