{
	"id": "222.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/222.025",
	"title": "222.025 RIGHT-OF-WAY, EASEMENT, PROCEDURE.",
	"text": "Any railroad company desiring a right-of-way over any state-owned land, except tax-forfeited land, may make application therefor to the state agency charged by law with jurisdiction over such land. The application shall be in such form as the state agency to which application must be made prescribes. If such agency, with the approval of the commissioner of administration of the state of Minnesota, determines that it is in the public interest that the right-of-way be granted, the governor shall execute and deliver to such railroad company an instrument in writing conveying an easement for right-of-way purposes over the land designated by such agency, with the approval of said commissioner of administration. Said easement shall continue so long as the land which is subject thereto shall be occupied by the railroad company for railroad purposes. Every such easement shall reserve to the state all minerals and mineral rights of whatever nature, with the right to enter upon said land to explore for such minerals at any time, and the right to enter upon said land to mine and remove the same upon six months' written notice from the state to the railroad company, provided, however, that the state agency shall negotiate for a new location for said railroad right-of-way, if needed by the railroad, over state land and when a new location has been procured, the railroad company shall promptly move to the new location. If such written notice is given, the railroad company shall, without any cost or obligation to the state, remove its railway and other structures from the land for which the easement was given; and all property, of whatever nature, not removed by said railroad company within said six-month period shall become, upon the expiration of said period, the absolute property of the state. Upon the expiration of said period, all right, title, and interest of the railroad company in and to such easement shall terminate and revert to the state without the doing of any act by the state except the giving of the aforesaid notice. If such easement ceases to be used by the railroad company for railroad purposes, the interest of the railroad company also shall terminate and revert to the state, without the doing of any act by the state. As the consideration for the granting of such easement by the state, the railroad company shall pay to the commissioner of management and budget the fair market value of the land which is subject to the easement, or that amount which is fixed by the constitution and laws of this state as the minimum price for the sale of such land, whichever is greater. No instrument conveying such easement shall be executed by the governor until said amount has been paid to the state. The fair market value shall be determined by the appraisal of the state agency charged by law with jurisdiction over said land, and shall be subject to the approval of said commissioner of administration.\nAll sums paid to the state under subdivision 1 shall be credited by the commissioner of management and budget to the proper fund to which the land belongs.",
	"repealed": false
}