{
	"id": "147F.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/147F.07",
	"title": "147F.07 LICENSURE REQUIREMENTS.",
	"text": "To be eligible for licensure, an applicant, with the exception of those seeking licensure by reciprocity under subdivision 2, must submit to the board:\n(1) a completed application on forms provided by the board along with all fees required under section 147F.17. The applicant must include:\n(i) the applicant's name, Social Security number, home address and telephone number, and business address and telephone number if currently employed;\n(ii) the name and location of the genetic counseling or medical program the applicant completed;\n(iii) a list of degrees received from other educational institutions;\n(iv) a description of the applicant's professional training;\n(v) a list of registrations, certifications, and licenses held in other jurisdictions;\n(vi) a description of any other jurisdiction's refusal to credential the applicant;\n(vii) a description of all professional disciplinary actions initiated against the applicant in any jurisdiction; and\n(viii) any history of drug or alcohol abuse, and any misdemeanor, gross misdemeanor, or felony conviction;\n(2) evidence of graduation from an education program accredited by the ACGC or its predecessor or successor organization;\n(3) a verified copy of a valid and current certification issued by the ABGC or ABMG as a certified genetic counselor, or by the ABMG as a certified medical geneticist;\n(4) additional information as requested by the board, including any additional information necessary to ensure that the applicant is able to practice with reasonable skill and safety to the public;\n(5) a signed statement verifying that the information in the application is true and correct to the best of the applicant's knowledge and belief; and\n(6) a signed waiver authorizing the board to obtain access to the applicant's records in this or any other state in which the applicant completed an educational program or engaged in the practice of genetic counseling.\nTo be eligible for licensure by reciprocity, the applicant must hold a current genetic counselor or medical geneticist registration or license in another state, the District of Columbia, or a territory of the United States, whose standards for registration or licensure are at least equivalent to those of Minnesota, and must:\n(1) submit the application materials and fees as required by subdivision 1, clauses (1), (2), and (4) to (6);\n(2) provide a verified copy from the appropriate government body of a current registration or license for the practice of genetic counseling in another jurisdiction that has initial registration or licensing requirements equivalent to or higher than the requirements in subdivision 1; and\n(3) provide letters of verification from the appropriate government body in each jurisdiction in which the applicant holds a registration or license. Each letter must state the applicant's name, date of birth, registration or license number, date of issuance, a statement regarding disciplinary actions, if any, taken against the applicant, and the terms under which the registration or license was issued.\nMS 2016 [Expired, 2016 c 189 art 21 s 4]\nA genetic counselor license shall be valid for one year from the date of issuance.\n(a) To be eligible for license renewal, a licensed genetic counselor must submit to the board:\n(1) a renewal application on a form provided by the board;\n(2) the renewal fee required under section 147F.17;\n(3) evidence of compliance with the continuing education requirements in section 147F.11; and\n(4) any additional information requested by the board.\n(b) A licensee must maintain a correct mailing address with the board for receiving board communications, notices, and license renewal documents. Placing the license renewal application in first-class United States mail, addressed to the licensee at the licensee's last known address with postage prepaid, constitutes valid service. Failure to receive the renewal documents does not relieve a licensee of the obligation to comply with this section.\n(c) The name of a licensee who does not return a complete license renewal application, annual license fee, or late application fee, as applicable, within the time period required by this section shall be removed from the list of individuals authorized to practice during the current renewal period. If the licensee's license is reinstated, the licensee's name shall be placed on the list of individuals authorized to practice.\nFor any individual whose licensure status has lapsed for two years or less, to regain licensure status, the individual must:\n(1) apply for license renewal according to subdivision 5;\n(2) document compliance with the continuing education requirements of section 147F.11 since the licensed genetic counselor's initial licensure or last renewal; and\n(3) submit the fees required under section 147F.17 for the period not licensed, including the fee for late renewal.\n(a) A licensee whose license has lapsed under subdivision 6 before January 1, 2020, and who seeks to regain licensed status after January 1, 2020, shall be treated as a first-time licensee only for purposes of establishing a license renewal schedule, and shall not be subject to the license cycle conversion provisions in section 147F.19.\n(b) This subdivision expires July 1, 2022.",
	"repealed": false
}