{
	"id": "142E.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.01",
	"title": "142E.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the following terms have the meanings given.\n\"Child care fund applicants\" means all parents; stepparents; legal guardians; eligible relative caregivers; relative custodians who accepted a transfer of permanent legal and physical custody of a child under section 260C.515, subdivision 4, or similar permanency disposition in Tribal code; successor custodians or guardians as established by section 142A.605, subdivision 10; or foster parents providing care to a child placed in a family foster home under section 260C.007, subdivision 16b. Applicants must be members of the family and reside in the household that applies for child care assistance under the child care fund.\n\"Application\" means the submission to a county agency, by or on behalf of a family, of a completed, signed, and dated:\n(1) child care assistance universal application form; or\n(2) child care addendum form in combination with a combined application form for MFIP or Supplemental Nutrition Assistance Program (SNAP) benefits.\n[See Note.]\n\"Child\" means a person 12 years old or younger, or a person age 13 or 14 who is disabled, as defined in section 125A.02.\n\"Child care\" means the care of a child by someone other than a parent; stepparent; legal guardian; eligible relative caregiver; relative custodian who accepted a transfer of permanent legal and physical custody of a child under section 260C.515, subdivision 4, or similar permanency disposition in Tribal code; successor custodian or guardian as established according to section 142A.605, subdivision 10; foster parent providing care to a child placed in a family foster home under section 260C.007, subdivision 16b; or spouse of any of the foregoing in or outside the child's own home for gain or otherwise, on a regular basis, for any part of a 24-hour day.\n\"Child care fund\" means a program under this chapter providing:\n(1) financial assistance for child care to parents engaged in employment, job search, or education and training leading to employment, or an at-home infant child care subsidy; and\n(2) grants to develop, expand, and improve the access and availability of child care services statewide.\n\"Child care services\" means the provision of child care as defined in subdivision 5.\n\"Commissioner\" means the commissioner of children, youth, and families.\n\"County board\" means the board of county commissioners in each county.\n\"Department\" means the Department of Children, Youth, and Families.\n\"Diversionary work program\" means the program established under section 142G.90.\n[See Note.]\n\"Education program\" means remedial or basic education or English as a second language instruction, a program leading to a commissioner of education-selected high school equivalency certification or high school diploma, postsecondary programs excluding postbaccalaureate programs, and other education and training needs as documented in an employment plan, as defined in subdivision 13. The employment plan must outline education and training needs of a recipient, meet state requirements for employment plans, meet the requirements of this chapter, and Minnesota Rules, parts 3400.0010 to 3400.0230, and meet the requirements of programs that provide federal reimbursement for child care services.\n\"Employment plan\" means employment of recipients financially eligible for child care assistance, or other work activities defined under section 142G.50, approved in an employability development, job search support plan, or employment plan that is developed by the county agency, if it is acting as an employment and training service provider, or by an employment and training service provider certified by the commissioner of employment and economic development or an individual designated by the county to provide employment and training services. The plans and designation of a service provider must meet the requirements of this chapter and chapter 142G or 256K, Minnesota Rules, parts 3400.0010 to 3400.0230, and other programs that provide federal reimbursement for child care services.\n\"Family\" means parents; stepparents; guardians and their spouses; other eligible relative caregivers and their spouses; relative custodians who accepted a transfer of permanent legal and physical custody of a child under section 260C.515, subdivision 4, or similar permanency disposition in Tribal code, and their spouses; successor custodians or guardians as established by section 142A.605, subdivision 10, and their spouses; foster parents providing care to a child placed in a family foster home under section 260C.007, subdivision 16b, and their spouses; and the blood-related dependent children and adoptive siblings under the age of 18 years living in the same home as any of the above. Family includes children temporarily absent from the household in settings such as schools, foster care, and residential treatment facilities and adults temporarily absent from the household in settings such as schools, military service, or rehabilitation programs. An adult family member who is not in an authorized activity under this chapter may be temporarily absent for up to 60 days. When a minor parent or parents and his, her, or their child or children are living with other relatives, and the minor parent or parents apply for a child care subsidy, \"family\" means only the minor parent or parents and their child or children. An adult age 18 or older who meets this definition of family and is a full-time high school or postsecondary student may be considered a dependent member of the family unit if 50 percent or more of the adult's support is provided by the parents; stepparents; guardians and their spouses; relative custodians who accepted a transfer of permanent legal and physical custody of a child under section 260C.515, subdivision 4, or similar permanency disposition in Tribal code, and their spouses; successor custodians or guardians as established by section 142A.605, subdivision 10, and their spouses; foster parents providing care to a child placed in a family foster home under section 260C.007, subdivision 16b, and their spouses; or eligible relative caregivers and their spouses residing in the same household.\n\"Family stabilization services\" means the services under section 142G.75.\n\"Homeless\" means a self-declared housing status as defined in the McKinney-Vento Homeless Assistance Act and United States Code, title 42, section 11302, paragraph (a).\n\"Human services board\" means a board established under section 402.02, Laws 1974, chapter 293, or Laws 1976, chapter 340.\n\"Income\" means earned income as defined under section 256P.01, subdivision 3; unearned income as defined under section 256P.01, subdivision 8; income under Minnesota Rules, part 3400.0170; and public assistance cash benefits, including the Minnesota family investment program, work benefit, Minnesota supplemental aid, general assistance, refugee cash assistance, at-home infant child care subsidy payments, and child support and maintenance distributed to the family under section 518A.81, subdivision 2a.\nThe following are deducted from income: funds used to pay for health insurance premiums for family members, and child or spousal support paid to or on behalf of a person or persons who live outside of the household. Income sources not included in this subdivision; section 256P.06, subdivision 3; and Minnesota Rules, part 3400.0170, are not counted as income.\n[See Note.]\n\"Legal nonlicensed child care provider\" means: (1) a child care provider who is excluded from licensing requirements under section 142B.05, subdivision 2; or (2) a child care provider authorized to provide care in a child's home under section 142E.10, subdivision 14, provided the provider only cares for related children, children from a single, unrelated family, or both related children and children from a single, unrelated family.\n\"MFIP\" means the Minnesota family investment program, the state's TANF program under Public Law 104-193, Title I, and includes the MFIP program under chapter 142G and tribal contracts under section 142A.03, subdivision 2, or 142E.02, subdivision 2.\n\"Postsecondary educational systems\" means the University of Minnesota Board of Regents and the Board of Trustees of the Minnesota State Colleges and Universities.\n\"Provider\" means:\n(1) an individual or child care center or facility licensed to provide child care under chapter 142B when operating within the terms of the license;\n(2) a license-exempt center required to be certified under chapter 142C;\n(3) an individual or child care center or facility that: (i) holds a valid child care license issued by another state or a tribe; (ii) provides child care services in the licensing state or in the area under the licensing tribe's jurisdiction; and (iii) is in compliance with federal health and safety requirements as certified by the licensing state or tribe, or as determined by receipt of child care development block grant funds in the licensing state;\n(4) a legal nonlicensed child care provider as defined under section 142E.01, subdivision 19, providing legal child care services. A legal nonlicensed child care provider must be at least 18 years of age, and not a member of the MFIP assistance unit or a member of the family receiving child care assistance to be authorized under this chapter; or\n(5) an individual or child care center or facility that is operated under the jurisdiction of the federal government.\n\"Recoupment of overpayments\" means the reduction of child care assistance payments to an eligible family or a child care provider in order to correct an overpayment of child care assistance.\n\"Registration\" means the process used by the commissioner to determine whether the provider selected by a family applying for or receiving child care assistance to care for that family's children meets the requirements necessary for payment of child care assistance for care provided by that provider. The commissioner shall create a process for statewide registration by April 28, 2025.\n[See Note.]\n\"Service period\" means the biweekly period used by the child care assistance program for billing and payment purposes.\n\"Student parent\" means a person who is:\n(1) under 21 years of age and has a child;\n(2) pursuing a high school diploma or commissioner of education-selected high school equivalency certification;\n(3) residing within a county that has a basic sliding fee waiting list under section 119B.03, subdivision 4; and\n(4) not an MFIP participant.\n\"Transition year extension families\" means families who have completed their transition year of child care assistance under this subdivision and who are eligible for, but on a waiting list for, services under section 142E.04. For purposes of sections 142E.04, subdivision 3, and 142E.08, subdivision 1, clause (2), families participating in extended transition year shall not be considered transition year families. Notwithstanding Minnesota Rules, parts 3400.0040, subpart 10, and 3400.0090, subpart 2, transition year extension child care may be used to support employment, approved education or training programs, or a job search that meets the requirements of section 142E.12 for the length of time necessary for families to be moved from the basic sliding fee waiting list into the basic sliding fee program.\n\"Transition year families\" means families who have received MFIP assistance, who were eligible to receive MFIP assistance after choosing to discontinue receipt of the cash portion of MFIP assistance under section 142G.21, subdivision 12, or who have received DWP assistance under section 142G.90 for at least one of the last six months before losing eligibility for MFIP or DWP. Notwithstanding Minnesota Rules, parts 3400.0040, subpart 10, and 3400.0090, subpart 2, transition year child care may be used to support employment, approved education or training programs, or job search that meets the requirements of section 142E.12. Transition year child care is not available to families who have been disqualified from MFIP or DWP due to fraud.",
	"repealed": false
}