{
	"id": "325G.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.051",
	"title": "325G.051 SURCHARGES ON CREDIT CARDS.",
	"text": "(a) A seller or lessor of goods or services doing business in Minnesota may impose a surcharge on transactions in Minnesota with a customer who elects to use a credit or charge card in lieu of payment by cash, check, or similar means, provided:\n(1) if the sale or lease of goods or services is processed in person, the seller or lessor informs the customer of the surcharge both orally at the time of sale and by a sign conspicuously posted on the seller's or lessor's premises;\n(2) if the sale or lease of goods or services is processed through a website or mobile device, the seller or lessor informs the customer of the surcharge by conspicuously posting a surcharge notice during the sale, at the point of sale, on the customer order summary, or on the checkout page of the website;\n(3) if the sale or lease of services is processed over the telephone, the seller or lessor informs the customer of the surcharge orally; and\n(4) the surcharge does not exceed five percent of the purchase price.\n(b) A seller or lessor of goods or services that establishes and is responsible for the seller or lessor's own customer credit or charge card may not impose a surcharge on a customer who elects to use that credit or charge card in lieu of payment by cash, check, or similar means.\n(c) For purposes of this section \"surcharge\" means a fee or charge imposed by a seller or lessor upon a customer that increases the price of goods or services to the customer because the customer uses a credit or charge card to purchase or lease the goods or services. The term does not include a discount offered by a seller or lessor to a customer who makes payment for goods or services by cash, check, or similar means not involving a credit or charge card if the discount is offered to all prospective customers and its availability is clearly and conspicuously disclosed to all prospective customers.\n(d) This subdivision applies to an agent of a seller or lessor.\nA seller who violates this section is subject to a civil penalty of not more than $500 and shall refund the surcharge to each buyer.",
	"repealed": false
}