{
	"id": "611A.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.81",
	"title": "611A.81 CAUSE OF ACTION FOR COERCION FOR USE IN PROSTITUTION.",
	"text": "(a) An individual has a cause of action against a person who:\n(1) coerced the individual into prostitution;\n(2) coerced the individual to remain in prostitution;\n(3) used coercion to collect or receive any of the individual's earnings derived from prostitution; or\n(4) hired, offered to hire, or agreed to hire the individual to engage in prostitution, knowing or having reason to believe that the individual was coerced into or coerced to remain in prostitution by another person.\nFor purposes of clauses (1) and (2), money payment by a patron, as defined in section 609.321, subdivision 4, is not coercion under section 611A.80, subdivision 2, clause (5) or (11), or exploiting needs for food or shelter under section 611A.80, subdivision 2, clause (23).\nClause (3) does not apply to minor children who are dependent on the individual and who may have benefited from or been supported by the individual's earnings derived from prostitution.\n(b) An individual has a cause of action against a person who did the following while the individual was a minor:\n(1) solicited or induced the individual to practice prostitution;\n(2) promoted the prostitution of the individual;\n(3) collected or received the individual's earnings derived from prostitution; or\n(4) hired, offered to hire, or agreed to hire the individual to engage in prostitution.\nMistake as to age is not a defense to an action under this paragraph.\nA person against whom a cause of action may be maintained under subdivision 1 is liable for the following damages that resulted from the plaintiff's being used in prostitution or to which the plaintiff's use in prostitution proximately contributed:\n(1) economic loss, including damage, destruction, or loss of use of personal property; loss of past or future income or earning capacity; and income, profits, or money owed to the plaintiff from contracts with the person; and\n(2) damages for death as may be allowed under section 573.02, personal injury, disease, and mental and emotional harm, including medical, rehabilitation, and burial expenses; and pain and suffering, including physical impairment.",
	"repealed": false
}