{
	"id": "142G.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.79",
	"title": "142G.79 COUNTY PERFORMANCE MANAGEMENT.",
	"text": "The commissioner shall report monthly to each county the following caseload information:\n(1) total number of cases receiving MFIP, and subtotals of cases with one eligible parent, two eligible parents, and an eligible caregiver who is not a parent;\n(2) total number of child only assistance cases;\n(3) total number of eligible adults and children receiving an MFIP grant, and subtotals for cases with one eligible parent, two eligible parents, an eligible caregiver who is not a parent, and child only cases;\n(4) number of cases with an exemption from the 60-month time limit based on a family violence waiver;\n(5) number of MFIP cases with work hours, and subtotals for cases with one eligible parent, two eligible parents, and an eligible caregiver who is not a parent;\n(6) number of employed MFIP cases, and subtotals for cases with one eligible parent, two eligible parents, and an eligible caregiver who is not a parent;\n(7) average monthly gross earnings, and averages for subgroups of cases with one eligible parent, two eligible parents, and an eligible caregiver who is not a parent;\n(8) number of employed cases receiving only the food portion of assistance;\n(9) number of parents or caregivers exempt from work activity requirements, with subtotals for each exemption type; and\n(10) number of cases with a sanction, with subtotals by level of sanction for cases with one eligible parent, two eligible parents, and an eligible caregiver who is not a parent.\n(a) The commissioner shall report quarterly to all counties on each county's performance on the following measures:\n(1) percent of MFIP caseload working in paid employment;\n(2) percent of MFIP caseload receiving only the food portion of assistance;\n(3) number of MFIP cases that have left assistance;\n(4) median placement wage rate;\n(5) caseload by months of TANF assistance;\n(6) percent of MFIP cases off cash assistance or working 30 or more hours per week at one-year, two-year, and three-year follow-up points from a baseline quarter. This measure is called the self-support index. The commissioner shall report quarterly an expected range of performance for each county, county grouping, and tribe on the self-support index. The expected range shall be derived by a statistical methodology developed by the commissioner in consultation with the counties and tribes. The statistical methodology shall control differences across counties in economic conditions and demographics of the MFIP case load; and\n(7) the TANF work participation rate, defined as the participation requirements specified under Public Law 109-171, the Deficit Reduction Act of 2005.\n(b) The commissioner shall not apply the limits on vocational educational training and education activities under Code of Federal Regulations, title 45, section 261.33(c), when determining TANF work participation rates for individual counties under this subdivision.\n[See Note.]\n(a) If sanctions occur for failure to meet the performance standards specified in title 1 of Public Law 104-193 of the Personal Responsibility and Work Opportunity Act of 1996, and under Public Law 109-171, the Deficit Reduction Act of 2005, the state shall pay 88 percent of the sanction. The remaining 12 percent of the sanction will be paid by the counties. The county portion of the sanction will be distributed across all counties in proportion to each county's percentage of the MFIP average monthly caseload during the period for which the sanction was applied.\n(b) If a county fails to meet the performance standards specified in title 1 of Public Law 104-193 of the Personal Responsibility and Work Opportunity Act of 1996, and Public Law 109-171, the Deficit Reduction Act of 2005, for any year, the commissioner shall work with counties to organize a joint state-county technical assistance team to work with the county. The commissioner shall coordinate any technical assistance with other departments and agencies including the Departments of Employment and Economic Development and Education as necessary to achieve the purpose of this paragraph.\n(c) For state performance measures, a low-performing county is one that:\n(1) performs below the bottom of their expected range for the measure in subdivision 2, clause (6), in an annualized measurement reported in October of each year; or\n(2) performs below 40 percent for the measure in subdivision 2, clause (7), as averaged across the four quarterly measurements for the year, or the ten counties with the lowest rates if more than ten are below 40 percent.\n(d) Low-performing counties under paragraph (c) must engage in corrective action planning as defined by the commissioner. The commissioner may coordinate technical assistance as specified in paragraph (b) for low-performing counties under paragraph (c).",
	"repealed": false
}