{
	"id": "103E.505",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.505",
	"title": "103E.505 AWARDING CONSTRUCTION CONTRACT.",
	"text": "Thirty days after the order establishing a drainage project is filed, the auditor and the drainage authority or, for a joint county drainage project, a majority of the auditors of the affected counties shall proceed to award the contract to construct the drainage project.\nIf an appeal regarding the determination of benefits and damages is made within 30 days after the order establishing the drainage project has been filed, a contract may not be awarded until the appeal has been determined, unless the drainage authority orders the contract awarded. The auditor of an affected county or an interested person may request the drainage authority to make the order. If the request is not made by an affected auditor, the auditors of affected counties must be given notice five days before the hearing on the request.\nThe auditor of an affected county shall give notice of the awarding of the contract by publication in a newspaper in the county. The notice must state the time and location for awarding the contract. For a joint county drainage project the auditors shall award the contract at the office of the auditor where the proceedings are pending. If the estimated cost of construction is more than $25,000, the auditor must also place a notice in a drainage construction trade newspaper. The trade newspaper notice must state:\n(1) the time and location for awarding the contract;\n(2) the approximate amount of work and its estimated cost;\n(3) that bids may be for the work as one job, or in sections, or separately, for bridges, ditches and open work, tile, or tile construction work, if required or advisable;\n(4) that each bid must be accompanied by a certified check or a bond furnished by an approved surety corporation payable to the auditors of affected counties for ten percent of the bid, as security that the bidder will enter into a contract and give a bond as required by section 103E.501; and\n(5) that the drainage authority reserves the right to reject any and all bids.\nThe engineer shall attend the meeting to award the contract. A bid may not be accepted without the engineer's approval of the bidder's compliance with plans and specifications.\nThe contract may be awarded in one job, in sections, or separately for labor and material and may be let to the lowest responsible bidder. Alternatively, the contract may be awarded to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nBids that in the aggregate exceed the total estimated cost of construction by more than 30 percent may not be accepted.\nThe chair of the drainage authority and the auditor of each affected county shall contract, in the names of their respective counties, to construct the drainage project in the time and manner and according to the plans and specifications and the contract provisions in this chapter.\nIf any of the drainage work is to be done by the United States or its agencies, a notice of awarding that contract does not need to be published and a contract for that construction is not necessary. Affected municipalities may contract or arrange with the United States or its agencies for cooperation or assistance in constructing, maintaining, and operating the drainage project and system, for control of waters in the district, or for making a survey and investigation or reports on the drainage project or system. The municipalities may provide required guaranty and protection to the United States or its agencies.",
	"repealed": false
}