{
	"id": "192A.353",
	"url": "https://www.revisor.mn.gov/statutes/cite/192A.353",
	"title": "192A.353 APPEAL BY STATE.",
	"text": "(a) In a trial by court-martial in which a punitive discharge may be adjudged, the state may appeal the following, other than a finding of not guilty with respect to the charge or specification by the members of the court-martial, or by a judge in a bench trial so long as it is not made in reconsideration:\n(1) an order or ruling of the military judge that terminates the proceedings with respect to a charge or specification;\n(2) an order or ruling that excludes evidence that is substantial proof of a fact material in the proceeding;\n(3) an order or ruling that directs the disclosure of classified information;\n(4) an order or ruling that imposes sanctions for nondisclosure of classified information;\n(5) a refusal of the military judge to issue a protective order sought by the state to prevent the disclosure of classified information; and\n(6) a refusal by the military judge to enforce an order described in clause (5) that has previously been issued by the appropriate authority.\n(b) An appeal of an order or ruling may not be taken unless the trial counsel provides the military judge with written notice of appeal from the order or ruling within 72 hours of the order or ruling. The notice shall include a certification by the trial counsel that the appeal is not taken for the purpose of delay and, if the order or ruling appealed is one which excludes evidence, that the evidence excluded is substantial proof of a fact material in the proceeding.\n(c) An appeal under this section shall be diligently prosecuted as provided by law.\nAn appeal under this section shall proceed as prescribed in section 192A.371. In ruling on an appeal under this section, that court may act only with respect to matters of law.\nAny period of delay resulting from an appeal under this section shall be excluded in deciding any issue regarding denial of a speedy trial unless an appropriate authority determines that the appeal was filed solely for the purpose of delay with the knowledge that it was totally frivolous and without merit.",
	"repealed": false
}