{
	"id": "611A.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.27",
	"title": "611A.27 VICTIM RIGHTS TO SEXUAL ASSAULT EVIDENCE INFORMATION.",
	"text": "(a) Upon written request from the victim or victim's designee as described in subdivision 2, the investigating law enforcement agency shall release the following active investigative data, as defined in section 13.82, subdivision 7, to a victim of sexual assault about a submitted sexual assault examination kit, as defined in section 299C.106, subdivision 1, paragraph (g):\n(1) the date that a sexual assault examination kit was submitted to a forensic laboratory, as defined in section 299C.157, subdivision 1, clause (2), and the date that the agency received notice of the results of that testing; and\n(2) whether a DNA profile was obtained from the testing.\n(b) The agency may refuse the request under paragraph (a) if the release of that data will interfere with the investigation.\nNo later than January 1, 2019, each law enforcement agency shall adopt policies and procedures subject to section 13.82, subdivision 7, to provide investigative data under this section that includes but is not limited to the following requirements:\n(1) agency identification of a representative or representatives to respond to requests for data from sexual assault victims and to serve as a liaison between the agency and the forensic laboratory;\n(2) agency response to inquiries within 30 days of receipt, unless the agency declines to provide the information under subdivision 1, paragraph (b);\n(3) the sexual assault victim can designate another person to request information on the victim's behalf by providing written authorization to the agency except that an agency can decline to provide the information under subdivision 1, paragraph (b); and\n(4) agency development of a procedure that allows a sexual assault victim to contact the agency representative to request that a restricted kit as defined in section 299C.106, subdivision 1, paragraph (e), be reclassified as an unrestricted kit as defined in section 299C.106, subdivision 1, paragraph (h), if the restricted kit is in the possession of the agency.",
	"repealed": false
}