{
	"id": "103G.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.801",
	"title": "103G.801 GREAT LAKES -- ST. LAWRENCE RIVER BASIN WATER RESOURCES COMPACT.",
	"text": "The Great Lakes -- St. Lawrence River Basin Water Resources Compact is enacted into law and entered into with all jurisdictions legally joining therein in the form substantially as follows:\nARTICLE 1\nSHORT TITLE, DEFINITIONS, PURPOSES AND DURATION\nSection 1.1. Short title.\nThis act shall be known and may be cited as the \"Great Lakes -- St. Lawrence River Basin Water Resources Compact.\"\nSection 1.2. Definitions.\nFor the purposes of this compact, and of any supplemental or concurring legislation enacted pursuant thereto, except as may be otherwise required by the context:\n\"Adaptive management\" means a water resources management system that provides a systematic process for evaluation, monitoring and learning from the outcomes of operational programs and adjustment of policies, plans and programs based on experience and the evolution of scientific knowledge concerning water resources and water dependent natural resources.\n\"Agreement\" means the Great Lakes -- St. Lawrence River Basin Sustainable Water Resources Agreement.\n\"Applicant\" means a person who is required to submit a proposal that is subject to management and regulation under this compact. \"Application\" has a corresponding meaning.\n\"Basin\" or \"Great Lakes -- St. Lawrence River basin\" means the watershed of the Great Lakes and the St. Lawrence River upstream from Trois-Rivieres, Quebec within the jurisdiction of the parties.\n\"Basin ecosystem\" or \"Great Lakes -- St. Lawrence River basin ecosystem\" means the interacting components of air, land, water and living organisms, including humankind, within the basin.\n\"Community within a straddling county\" means any incorporated city, town or the equivalent thereof, that is located outside the basin but wholly within a county that lies partly within the basin and that is not a straddling community.\n\"Compact\" means this compact.\n\"Consumptive use\" means that portion of the water withdrawn or withheld from the basin that is lost or otherwise not returned to the basin due to evaporation, incorporation into products, or other processes.\n\"Council\" means the Great Lakes -- St. Lawrence River Basin Water Resources Council, created by this compact.\n\"Council review\" means the collective review by the council members as described in Article 4 of this compact.\n\"County\" means the largest territorial division for local government in a state. The county boundaries shall be defined as those boundaries that exist as of December 13, 2005.\n\"Cumulative impacts\" mean the impact on the basin ecosystem that results from incremental effects of all aspects of a withdrawal, diversion or consumptive use in addition to other past, present, and reasonably foreseeable future withdrawals, diversions and consumptive uses regardless of who undertakes the other withdrawals, diversions and consumptive uses. Cumulative impacts can result from individually minor but collectively significant withdrawals, diversions and consumptive uses taking place over a period of time.\n\"Decision-making standard\" means the decision-making standard established by Section 4.11 for proposals subject to management and regulation in Section 4.10.\n\"Diversion\" means a transfer of water from the basin into another watershed, or from the watershed of one of the Great Lakes into that of another by any means of transfer, including but not limited to a pipeline, canal, tunnel, aqueduct, channel, modification of the direction of a water course, a tanker ship, tanker truck or rail tanker but does not apply to water that is used in the basin or a Great Lake watershed to manufacture or produce a product that is then transferred out of the basin or watershed. \"Divert\" has a corresponding meaning.\n\"Environmentally sound and economically feasible water conservation measures\" mean those measures, methods, technologies or practices for efficient water use and for reduction of water loss and waste or for reducing a withdrawal, consumptive use or diversion that (i) are environmentally sound, (ii) reflect best practices applicable to the water use sector, (iii) are technically feasible and available, (iv) are economically feasible and cost effective based on an analysis that considers direct and avoided economic and environmental costs and (v) consider the particular facilities and processes involved, taking into account the environmental impact, age of equipment and facilities involved, the processes employed, energy impacts and other appropriate factors.\n\"Exception\" means a transfer of water that is excepted under Section 4.9 from the prohibition against diversions in Section 4.8.\n\"Exception standard\" means the standard for exceptions established in Section 4.9.4.\n\"Intra-basin transfer\" means the transfer of water from the watershed of one of the Great Lakes into the watershed of another Great Lake.\n\"Measures\" means any legislation, law, regulation, directive, requirement, guideline, program, policy, administrative practice or other procedure.\n\"New or increased diversion\" means a new diversion, an increase in an existing diversion, or the alteration of an existing withdrawal so that it becomes a diversion.\n\"New or increased withdrawal or consumptive use\" means a new withdrawal or consumptive use or an increase in an existing withdrawal or consumptive use.\n\"Originating party\" means the party within whose jurisdiction an application or registration is made or required.\n\"Party\" means a state party to this compact.\n\"Person\" means a human being or a legal person, including a government or a non-governmental organization, including any scientific, professional, business, non-profit, or public interest organization or association that is neither affiliated with, nor under the direction of a government.\n\"Product\" means something produced in the basin by human or mechanical effort or through agricultural processes and used in manufacturing, commercial or other processes or intended for intermediate or end use consumers. (i) Water used as part of the packaging of a product shall be considered to be part of the product. (ii) Other than water used as part of the packaging of a product, water that is used primarily to transport materials in or out of the basin is not a product or part of a product. (iii) Except as provided in (i) above, water which is transferred as part of a public or private supply is not a product or part of a product. (iv) Water in its natural state such as in lakes, rivers, reservoirs, aquifers, or water basins is not a product.\n\"Proposal\" means a withdrawal, diversion or consumptive use of water that is subject to this compact.\n\"Province\" means Ontario or Quebec.\n\"Public water supply purposes\" means water distributed to the public through a physically connected system of treatment, storage and distribution facilities serving a group of largely residential customers that may also serve industrial, commercial, and other institutional operators. Water withdrawn directly from the basin and not through such a system shall not be considered to be used for public water supply purposes.\n\"Regional body\" means the members of the council and the premiers of Ontario and Quebec or their designee as established by the agreement.\n\"Regional review\" means the collective review by the regional body as described in Article 4 of this compact.\n\"Source watershed\" means the watershed from which a withdrawal originates. If water is withdrawn directly from a Great Lake or from the St. Lawrence River, then the source watershed shall be considered to be the watershed of that Great Lake or the watershed of the St. Lawrence River, respectively. If water is withdrawn from the watershed of a stream that is a direct tributary to a Great Lake or a direct tributary to the St. Lawrence River, then the source watershed shall be considered to be the watershed of that Great Lake or the watershed of the St. Lawrence River, respectively, with a preference to the direct tributary stream watershed from which it was withdrawn.\n\"Standard of review and decision\" means the exception standard, decision-making standard and reviews as outlined in Article 4 of this compact.\n\"State\" means one of the states of Illinois, Indiana, Michigan, Minnesota, New York, Ohio or Wisconsin or the Commonwealth of Pennsylvania.\n\"Straddling community\" means any incorporated city, town or the equivalent thereof, wholly within any county that lies partly or completely within the basin, whose corporate boundary existing as of the effective date of this compact, is partly within the basin or partly within two Great Lakes watersheds.\n\"Technical review\" means a detailed review conducted to determine whether or not a proposal that requires regional review under this compact meets the standard of review and decision following procedures and guidelines as set out in this compact.\n\"Water\" means ground or surface water contained within the basin.\n\"Water dependent natural resources\" means the interacting components of land, water and living organisms affected by the waters of the basin.\n\"Waters of the basin\" or \"basin water\" means the Great Lakes and all streams, rivers, lakes, connecting channels and other bodies of water, including tributary groundwater, within the basin.\n\"Withdrawal\" means the taking of water from surface water or groundwater. \"Withdraw\" has a corresponding meaning.\nSection 1.3. Findings and purposes.\nThe legislative bodies of the respective parties hereby find and declare:\n1. Findings:\na. the waters of the basin are precious public natural resources shared and held in trust by the states;\nb. the waters of the basin are interconnected and part of a single hydrologic system;\nc. the waters of the basin can concurrently serve multiple uses. Such multiple uses include municipal, public, industrial, commercial, agriculture, mining, navigation, energy development and production, recreation, the subsistence, economic and cultural activities of native peoples, water quality maintenance, and the maintenance of fish and wildlife habitat and a balanced ecosystem. And, other purposes are encouraged, recognizing that such uses are interdependent and must be balanced;\nd. future diversions and consumptive uses of basin water resources have the potential to significantly impact the environment, economy and welfare of the Great Lakes -- St. Lawrence River region;\ne. continued sustainable, accessible and adequate water supplies for the people and economy of the basin are of vital importance; and\nf. the parties have a shared duty to protect, conserve, restore, improve and manage the renewable but finite waters of the basin for the use, benefit and enjoyment of all their citizens, including generations yet to come. The most effective means of protecting, conserving, restoring, improving and managing the basin waters is through the joint pursuit of unified and cooperative principles, policies and programs mutually agreed upon, enacted and adhered to by all parties.\n2. Purposes:\na. to act together to protect, conserve, restore, improve and effectively manage the waters and water dependent natural resources of the basin under appropriate arrangements for intergovernmental cooperation and consultation because current lack of full scientific certainty should not be used as a reason for postponing measures to protect the basin ecosystem;\nb. to remove causes of present and future controversies;\nc. to provide for cooperative planning and action by the parties with respect to such water resources;\nd. to facilitate consistent approaches to water management across the basin while retaining state management authority over water management decisions within the basin;\ne. to facilitate the exchange of data, strengthen the scientific information base upon which decisions are made and engage in consultation on the potential effects of proposed withdrawals and losses on the waters and water dependent natural resources of the basin;\nf. to prevent significant adverse impacts of withdrawals and losses on the basin's ecosystems and watersheds;\ng. to promote interstate and state-provincial comity; and\nh. to promote an adaptive management approach to the conservation and management of basin water resources, which recognizes, considers and provides adjustments for the uncertainties in, and evolution of, scientific knowledge concerning the basin's waters and water dependent natural resources.\nSection 1.4. Science.\n1. The parties commit to provide leadership for the development of a collaborative strategy with other regional partners to strengthen the scientific basis for sound water management decision making under this compact.\n2. The strategy shall guide the collection and application of scientific information to support:\na. an improved understanding of the individual and cumulative impacts of withdrawals from various locations and water sources on the basin ecosystem and to develop a mechanism by which impacts of withdrawals may be assessed;\nb. the periodic assessment of cumulative impacts of withdrawals, diversions and consumptive uses on a Great Lake and St. Lawrence River watershed basis;\nc. improved scientific understanding of the waters of the basin;\nd. improved understanding of the role of groundwater in basin water resources management; and\ne. the development, transfer and application of science and research related to water conservation and water use efficiency.\nARTICLE 2\nORGANIZATION\nSection 2.1. Council created.\nThe Great Lakes -- St. Lawrence River Basin Water Resources Council is hereby created as a body politic and corporate, with succession for the duration of this compact, as an agency and instrumentality of the governments of the respective parties.\nSection 2.2. Council membership.\nThe council shall consist of the governors of the parties, ex officio.\nSection 2.3. Alternates.\nEach member of the council shall appoint at least one alternate who may act in his or her place and stead, with authority to attend all meetings of the council and with power to vote in the absence of the member. Unless otherwise provided by law of the party for which he or she is appointed, each alternate shall serve during the term of the member appointing him or her, subject to removal at the pleasure of the member. In the event of a vacancy in the office of alternate, it shall be filled in the same manner as an original appointment for the unexpired term only.\nSection 2.4. Voting.\n1. Each member is entitled to one vote on all matters that may come before the council.\n2. Unless otherwise stated, the rule of decision shall be by a simple majority.\n3. The council shall annually adopt a budget for each fiscal year and the amount required to balance the budget shall be apportioned equitably among the parties by unanimous vote of the council. The appropriation of such amounts shall be subject to such review and approval as may be required by the budgetary processes of the respective parties.\n4. The participation of council members from a majority of the parties shall constitute a quorum for the transaction of business at any meeting of the council.\nSection 2.5. Organization and procedure.\nThe council shall provide for its own organization and procedure, and may adopt rules and regulations governing its meetings and transactions, as well as the procedures and timeline for submission, review and consideration of proposals that come before the council for its review and action. The council shall organize, annually, by the election of a chair and vice chair from among its members. Each member may appoint an advisor, who may attend all meetings of the council and its committees, but shall not have voting power. The council may employ or appoint professional and administrative personnel, including an executive director, as it may deem advisable, to carry out the purposes of this compact.\nSection 2.6. Use of existing offices and agencies.\nIt is the policy of the parties to preserve and utilize the functions, powers and duties of existing offices and agencies of government to the extent consistent with this compact. Further, the council shall promote and aid the coordination of the activities and programs of the parties concerned with water resources management in the basin. To this end, but without limitation, the council may:\n1. advise, consult, contract, assist or otherwise cooperate with any and all such agencies;\n2. employ any other agency or instrumentality of any of the parties for any purpose; and\n3. develop and adopt plans consistent with the water resources plans of the parties.\nSection 2.7. Jurisdiction.\nThe council shall have, exercise and discharge its functions, powers and duties within the limits of the basin. Outside the basin, it may act in its discretion, but only to the extent such action may be necessary or convenient to effectuate or implement its powers or responsibilities within the basin and subject to the consent of the jurisdiction wherein it proposes to act.\nSection 2.8. Status, immunities and privileges.\n1. The council, its members and personnel in their official capacity and when engaged directly in the affairs of the council, its property and its assets, wherever located and by whomsoever held, shall enjoy the same immunity from suit and every form of judicial process as is enjoyed by the parties, except to the extent that the council may expressly waive its immunity for the purposes of any proceedings or by the terms of any contract.\n2. The property and assets of the council, wherever located and by whomsoever held, shall be considered public property and shall be immune from search, requisition, confiscation, expropriation or any other form of taking or foreclosure by executive or legislative action.\n3. The council, its property and its assets, income and the operations it carries out pursuant to this compact shall be immune from all taxation by or under the authority of any of the parties or any political subdivision thereof; provided, however, that in lieu of property taxes the council may make reasonable payments to local taxing districts in annual amounts which shall approximate the taxes lawfully assessed upon similar property.\nSection 2.9. Advisory committees.\nThe council may constitute and empower advisory committees, which may be comprised of representatives of the public and of federal, state, tribal, county and local governments, water resources agencies, water-using industries and sectors, water-interest groups and academic experts in related fields.\nARTICLE 3\nGENERAL POWERS AND DUTIES\nSection 3.1. General.\nThe waters and water dependent natural resources of the basin are subject to the sovereign right and responsibilities of the parties, and it is the purpose of this compact to provide for joint exercise of such powers of sovereignty by the council in the common interests of the people of the region, in the manner and to the extent provided in this compact. The council and the parties shall use the standard of review and decision and procedures contained in or adopted pursuant to this compact as the means to exercise their authority under this compact.\nThe council may revise the standard of review and decision, after consultation with the provinces and upon unanimous vote of all council members, by regulation duly adopted in accordance with Section 3.3 of this compact and in accordance with each party's respective statutory authorities and applicable procedures.\nThe council shall identify priorities and develop plans and policies relating to basin water resources. It shall adopt and promote uniform and coordinated policies for water resources conservation and management in the basin.\nSection 3.2. Council powers.\nThe council may: plan; conduct research and collect, compile, analyze, interpret, report and disseminate data on water resources and uses; forecast water levels; conduct investigations; institute court actions; design, acquire, construct, reconstruct, own, operate, maintain, control, sell and convey real and personal property and any interest therein as it may deem necessary, useful or convenient to carry out the purposes of this compact; make contracts; receive and accept such payments, appropriations, grants, gifts, loans, advances and other funds, properties and services as may be transferred or made available to it by any party or by any other public or private agency, corporation or individual; and, exercise such other and different powers as may be delegated to it by this compact or otherwise pursuant to law, and have and exercise all powers necessary or convenient to carry out its express powers or which may be reasonably implied therefrom.\nSection 3.3. Rules and regulations.\n1. The council may promulgate and enforce such rules and regulations as may be necessary for the implementation and enforcement of this compact. The council may adopt by regulation, after public notice and public hearing, reasonable application fees with respect to those proposals for exceptions that are subject to council review under Section 4.9. Any rule or regulation of the council, other than one which deals solely with the internal management of the council or its property, shall be adopted only after public notice and hearing.\n2. Each party, in accordance with its respective statutory authorities and applicable procedures, may adopt and enforce rules and regulations to implement and enforce this compact and the programs adopted by such party to carry out the management programs contemplated by this compact.\nSection 3.4. Program review and findings.\n1. Each party shall submit a report to the council and the regional body detailing its water management and conservation and efficiency programs that implement this compact. The report shall set out the manner in which water withdrawals are managed by sector, water source, quantity or any other means, and how the provisions of the standard of review and decision and conservation and efficiency programs are implemented. The first report shall be provided by each party one year from the effective date of this compact and thereafter every five years.\n2. The council, in cooperation with the provinces, shall review its water management and conservation and efficiency programs and those of the parties that are established in this compact and make findings on whether the water management program provisions in this compact are being met, and if not, recommend options to assist the parties in meeting the provisions of this compact. Such review shall take place:\na. 30 days after the first report is submitted by all parties; and\nb. every five years after the effective date of this compact; and\nc. at any other time at the request of one of the parties.\n3. As one of its duties and responsibilities, the council may recommend a range of approaches to the parties with respect to the development, enhancement and application of water management and conservation and efficiency programs to implement the standard of review and decision reflecting improved scientific understanding of the waters of the basin, including groundwater, and the impacts of withdrawals on the basin ecosystem.\nARTICLE 4\nWATER MANAGEMENT AND REGULATION\nSection 4.1. Water resources inventory, registration and reporting.\n1. Within five years of the effective date of this compact, each party shall develop and maintain a water resources inventory for the collection, interpretation, storage, retrieval exchange, and dissemination of information concerning the water resources of the party, including, but not limited to, information on the location, type, quantity, and use of those resources and the location, type, and quantity of withdrawals, diversions and consumptive uses. To the extent feasible, the water resources inventory shall be developed in cooperation with local, state, federal, tribal and other private agencies and entities, as well as the council. Each party's agencies shall cooperate with that party in the development and maintenance of the inventory.\n2. The council shall assist each party to develop a common base of data regarding the management of the water resources of the basin and to establish systematic arrangements for the exchange of those data with other states and provinces.\n3. To develop and maintain a compatible base of water use information, within five years of the effective date of this compact any person who withdraws water in an amount of 100,000 gallons per day or greater average in any 30-day period (including consumptive uses) from all sources, or diverts water of any amount, shall register the withdrawal or diversion by a date set by the council unless the person has previously registered in accordance with an existing state program. The person shall register the withdrawal or diversion with the originating party using a form prescribed by the originating party that shall include, at a minimum and without limitation: the name and address of the registrant and date of registration; the locations and sources of the withdrawal or diversion; the capacity of the withdrawal or diversion per day and the amount withdrawn or diverted from each source; the uses made of the water; places of use and places of discharge; and, such other information as the originating party may require. All registrations shall include an estimate of the volume of the withdrawal or diversion in terms of gallons per day average in any 30-day period.\n4. All registrants shall annually report the monthly volumes of the withdrawal, consumptive use and diversion in gallons to the originating party and any other information requested by the originating party.\n5. Each party shall annually report the information gathered pursuant to this section to a Great Lakes -- St. Lawrence River water use database repository and aggregated information shall be made publicly available, consistent with the confidentiality requirements in Section 8.3.\n6. Information gathered by the parties pursuant to this section shall be used to improve the sources and applications of scientific information regarding the waters of the basin and the impacts of the withdrawals and diversions from various locations and water sources on the basin ecosystem, and to better understand the role of groundwater in the basin. The council and the parties shall coordinate the collection and application of scientific information to further develop a mechanism by which individual and cumulative impacts of withdrawals, consumptive uses and diversions shall be assessed.\nSection 4.2. Water conservation and efficiency programs.\n1. The council commits to identify, in cooperation with the provinces, basin-wide water conservation and efficiency objectives to assist the parties in developing their water conservation and efficiency program. These objectives are based on the goals of:\na. ensuring improvement of the waters and water dependent natural resources;\nb. protecting and restoring the hydrologic and ecosystem integrity of the basin;\nc. retaining the quantity of surface water and groundwater in the basin;\nd. ensuring sustainable use of waters of the basin; and\ne. promoting the efficiency of use and reducing losses and waste of water.\n2. Within two years of the effective date of this compact, each party shall develop its own water conservation and efficiency goals and objectives consistent with the basin-wide goals and objectives, and shall develop and implement a water conservation and efficiency program, either voluntary or mandatory, within its jurisdiction based on the party's goals and objectives. Each party shall annually assess its programs in meeting the party's goals and objectives, report to the council and the regional body and make this annual assessment available to the public.\n3. Beginning five years after the effective date of this compact, and every five years thereafter, the council, in cooperation with the provinces, shall review and modify as appropriate the basin-wide objectives, and the parties shall have regard for any such modifications in implementing their programs. This assessment will be based on examining new technologies, new patterns of water use, new resource demands and threats, and cumulative impact assessment under Section 4.15.\n4. Within two years of the effective date of this compact, the parties commit to promote environmentally sound and economically feasible water conservation measures such as:\na. measures that promote efficient use of water;\nb. identification and sharing of best management practices and state of the art conservation and efficiency technologies;\nc. application of sound planning principles;\nd. demand-side and supply-side measures or incentives; and\ne. development, transfer and application of science and research.\n5. Each party shall implement in accordance with paragraph 2 above a voluntary or mandatory water conservation program for all, including existing, basin water users. Conservation programs need to adjust to new demands and the potential impacts of cumulative effects and climate.\nSection 4.3. Party powers and duties.\n1. Each party, within its jurisdiction, shall manage and regulate new or increased withdrawals, consumptive uses and diversions, including exceptions, in accordance with this compact.\n2. Each party shall require an applicant to submit an application in such manner and with such accompanying information as the party shall prescribe.\n3. No party may approve a proposal if the party determines that the proposal is inconsistent with this compact or the standard of review and decision or any implementing rules or regulations promulgated thereunder. The party may approve, approve with modifications or disapprove any proposal depending on the proposal's consistency with this compact and the standard of review and decision.\n4. Each party shall monitor the implementation of any approved proposal to ensure consistency with the approval and may take all necessary enforcement actions.\n5. No party shall approve a proposal subject to council or regional review, or both, pursuant to this compact unless it shall have been first submitted to and reviewed by either the council or regional body, or both, and approved by the council, as applicable. Sufficient opportunity shall be provided for comment on the proposal's consistency with this compact and the standard of review and decision. All such comments shall become part of the party's formal record of decision, and the party shall take into consideration any such comments received.\nSection 4.4. Requirement for originating party approval.\nNo proposal subject to management and regulation under this compact shall hereafter be undertaken by any person unless it shall have been approved by the originating party.\nSection 4.5. Regional review.\n1. General.\na. It is the intention of the parties to participate in regional review of proposals with the provinces, as described in this compact and the agreement.\nb. Unless the applicant or the originating party otherwise requests, it shall be the goal of the regional body to conclude its review no later than 90 days after notice under Section 4.5.2 of such proposal is received from the originating party.\nc. Proposals for exceptions subject to regional review shall be submitted by the originating party to the regional body for regional review, and where applicable, to the council for concurrent review.\nd. The parties agree that the protection of the integrity of the Great Lakes -- St. Lawrence River basin ecosystem shall be the overarching principle for reviewing proposals subject to regional review, recognizing uncertainties with respect to demands that may be placed on basin water, including groundwater, levels and flows of the Great Lakes and the St. Lawrence River, future changes in environmental conditions, the reliability of existing data and the extent to which diversions may harm the integrity of the basin ecosystem.\ne. The originating party shall have lead responsibility for coordinating information for resolution of issues related to evaluation of a proposal, and shall consult with the applicant throughout the regional review process.\nf. A majority of the members of the regional body may request regional review of a regionally significant or potentially precedent setting proposal. Such regional review must be conducted, to the extent possible, within the time frames set forth in this section. Any such regional review shall be undertaken only after consulting the applicant.\n2. Notice from originating party to the regional body.\na. The originating party shall determine if a proposal is subject to regional review. If so, the originating party shall provide timely notice to the regional body and the public.\nb. Such notice shall not be given unless and until all information, documents and the originating party's technical review needed to evaluate whether the proposal meets the standard of review and decision have been provided.\nc. An originating party may:\ni. provide notice to the regional body of an application, even if notification is not required; or\nii. request regional review of an application, even if regional review is not required. Any such regional review shall be undertaken only after consulting the applicant.\nd. An originating party may provide preliminary notice of a potential proposal.\n3. Public participation.\na. To ensure adequate public participation, the regional body shall adopt procedures for the review of proposals that are subject to regional review in accordance with this article.\nb. The regional body shall provide notice to the public of a proposal undergoing regional review. Such notice shall indicate that the public has an opportunity to comment in writing to the regional body on whether the proposal meets the standard of review and decision.\nc. The regional body shall hold a public meeting in the state or province of the originating party in order to receive public comment on the issue of whether the proposal under consideration meets the standard of review and decision.\nd. The regional body shall consider the comments received before issuing a declaration of finding.\ne. The regional body shall forward the comments it receives to the originating party.\n4. Technical review.\na. The originating party shall provide the regional body with its technical review of the proposal under consideration.\nb. The originating party's technical review shall thoroughly analyze the proposal and provide an evaluation of the proposal sufficient for a determination of whether the proposal meets the standard of review and decision.\nc. Any member of the regional body may conduct their own technical review of any proposal subject to regional review.\nd. At the request of the majority of its members, the regional body shall make such arrangements as it considers appropriate for an independent technical review of a proposal.\ne. All parties shall exercise their best efforts to ensure that a technical review undertaken under Sections 4.5.4.c and 4.5.4.d does not unnecessarily delay the decision by the originating party on the application. Unless the applicant or the originating party otherwise requests, all technical reviews shall be completed no later than 60 days after the date the notice of the proposal was given to the regional body.\n5. Declaration of finding.\na. The regional body shall meet to consider a proposal. The applicant shall be provided with an opportunity to present the proposal to the regional body at such time.\nb. The regional body, having considered the notice, the originating party's technical review, any other independent technical review that is made, any comments or objections including the analysis of comments made by the public, first nations and federally recognized tribes, and any other information that is provided under this compact shall issue a declaration of finding that the proposal under consideration:\ni. meets the standard of review and decision;\nii. does not meet the standard of review and decision; or\niii. would meet the standard of review and decision if certain conditions were met.\nc. An originating party may decline to participate in a declaration of finding made by the regional body.\nd. The parties recognize and affirm that it is preferable for all members of the regional body to agree whether the proposal meets the standard of review and decision.\ne. If the members of the regional body who participate in the declaration of finding all agree, they shall issue a written declaration of finding with consensus.\nf. In the event that the members cannot agree, the regional body shall make every reasonable effort to achieve consensus within 25 days.\ng. Should consensus not be achieved, the regional body may issue a declaration of finding that presents different points of view and indicates each party's conclusions.\nh. The regional body shall release the declarations of finding to the public.\ni. The originating party and the council shall consider the declaration of finding before making a decision on the proposal.\nSection 4.6. Proposals subject to prior notice.\n1. Beginning no later than five years of the effective date of this compact, the originating party shall provide all parties and the provinces with detailed and timely notice and an opportunity to comment within 90 days on any proposal for a new or increased consumptive use of five million gallons per day or greater average in any 90-day period. Comments shall address whether or not the proposal is consistent with the standard of review and decision. The originating party shall provide a response to any such comment received from another party.\n2. A party may provide notice, an opportunity to comment and a response to comments even if this is not required under paragraph 1 of this section. Any provision of such notice and opportunity to comment shall be undertaken only after consulting the applicant.\nSection 4.7. Council actions.\n1. Proposals for exceptions subject to council review shall be submitted by the originating party to the council for council review, and where applicable, to the regional body for concurrent review.\n2. The council shall review and take action on proposals in accordance with this compact and the standard of review and decision. The council shall not take action on a proposal subject to regional review pursuant to this compact unless the proposal shall have been first submitted to and reviewed by the regional body. The council shall consider any findings resulting from such review.\nSection 4.8. Prohibition of new or increased diversions.\nAll new or increased diversions are prohibited, except as provided for in this article.\nSection 4.9. Exceptions to the prohibition of diversions.\n1. Straddling communities. A proposal to transfer water to an area within a straddling community but outside the basin or outside the source Great Lake watershed shall be excepted from the prohibition against diversions and be managed and regulated by the originating party provided that, regardless of the volume of water transferred, all the water so transferred shall be used solely for public water supply purposes within the straddling community, and:\na. all water withdrawn from the basin shall be returned, either naturally or after use, to the source watershed less an allowance for consumptive use. No surface water or groundwater from outside the basin may be used to satisfy any portion of this criterion except if it:\ni. is part of a water supply or wastewater treatment system that combines water from inside and outside of the basin;\nii. is treated to meet applicable water quality discharge standards and to prevent the introduction of invasive species into the basin;\niii. maximizes the portion of water returned to the source watershed as basin water and minimizes the surface water or groundwater from outside the basin;\nb. if the proposal results from a new or increased withdrawal of 100,000 gallons per day or greater average over any 90-day period, the proposal shall also meet the exception standard;\nc. if the proposal results in a new or increased consumptive use of five million gallons per day or greater average over any 90-day period, the proposal shall also undergo regional review.\n2. Intra-basin transfer. A proposal for an intra-basin transfer that would be considered a diversion under this compact, and not already excepted pursuant to paragraph 1 of this section, shall be excepted from the prohibition against diversions, provided that:\na. If the proposal results from a new or increased withdrawal less than 100,000 gallons per day average over any 90-day period, the proposal shall be subject to management and regulation at the discretion of the originating party.\nb. If the proposal results from a new or increased withdrawal of 100,000 gallons per day or greater average over any 90-day period and if the consumptive use resulting from the withdrawal is less than five million gallons per day average over any 90-day period:\ni. the proposal shall meet the exception standard and be subject to management and regulation by the originating party, except that the water may be returned to another Great Lake watershed rather than the source watershed;\nii. the applicant shall demonstrate that there is no feasible, cost effective, and environmentally sound water supply alternative within the Great Lake watershed to which the water will be transferred, including conservation of existing water supplies; and\niii. the originating party shall provide notice to the other parties prior to making any decision with respect to the proposal.\nc. If the proposal results in a new or increased consumptive use of five million gallons per day or greater average over any 90-day period:\ni. the proposal shall be subject to management and regulation by the originating party and shall meet the exception standard, ensuring that water withdrawn shall be returned to the source watershed;\nii. the applicant shall demonstrate that there is no feasible, cost effective, and environmentally sound water supply alternative within the Great Lake watershed to which the water will be transferred, including conservation of existing water supplies;\niii. the proposal undergoes regional review; and\niv. the proposal is approved by the council. Council approval shall be given unless one or more council members vote to disapprove.\n3. Straddling counties. A proposal to transfer water to a community within a straddling county that would be considered a diversion under this compact shall be excepted from the prohibition against diversions, provided that it satisfies all of the following conditions:\na. the water shall be used solely for the public water supply purposes of the community within a straddling county that is without adequate supplies of potable water;\nb. the proposal meets the exception standard, maximizing the portion of water returned to the source watershed as basin water and minimizing the surface water or groundwater from outside the basin;\nc. the proposal shall be subject to management and regulation by the originating party, regardless of its size;\nd. there is no reasonable water supply alternative within the basin in which the community is located, including conservation of existing water supplies;\ne. caution shall be used in determining whether or not the proposal meets the conditions for this exception. This exception should not be authorized unless it can be shown that it will not endanger the integrity of the basin ecosystem;\nf. the proposal undergoes regional review; and\ng. the proposal is approved by the council. Council approval shall be given unless one or more council members vote to disapprove.\nA proposal must satisfy all of the conditions listed above. Further, substantive consideration will also be given to whether or not the proposal can provide sufficient scientifically based evidence that the existing water supply is derived from groundwater that is hydrologically interconnected to waters of the basin.\n4. Exception standard. Proposals subject to management and regulation in this section shall be declared to meet this exception standard and may be approved as appropriate only when the following criteria are met:\na. the need for all or part of the proposed exception cannot be reasonably avoided through the efficient use and conservation of existing water supplies;\nb. the exception will be limited to quantities that are considered reasonable for the purposes for which it is proposed;\nc. all water withdrawn shall be returned, either naturally or after use, to the source watershed less an allowance for consumptive use. No surface water or groundwater from outside the basin may be used to satisfy any portion of this criterion except if it:\ni. is part of a water supply or wastewater treatment system that combines water from inside and outside of the basin;\nii. is treated to meet applicable water quality discharge standards and to prevent the introduction of invasive species into the basin;\nd. the exception will be implemented so as to ensure that it will result in no significant individual or cumulative adverse impacts to the quantity or quality of the waters and water dependent natural resources of the basin with consideration given to the potential cumulative impacts of any precedent-setting consequences associated with the proposal;\ne. the exception will be implemented so as to incorporate environmentally sound and economically feasible water conservation measures to minimize water withdrawals or consumptive use;\nf. the exception will be implemented so as to ensure that it is in compliance with all applicable municipal, state, and federal laws as well as regional interstate and international agreements, including the Boundary Waters Treaty of 1909; and\ng. all other applicable criteria in Section 4.9 have also been met.\nSection 4.10. Management and regulation of new or increased withdrawals and consumptive uses.\n1. Within five years of the effective date of this compact, each party shall create a program for the management and regulation of new or increased withdrawals and consumptive uses by adopting and implementing measures consistent with the decision-making standard. Each party, through a considered process, shall set and may modify threshold levels for the regulation of new or increased withdrawals in order to assure an effective and efficient water management program that will ensure that uses overall are reasonable, that withdrawals overall will not result in significant impacts to the waters and water dependent natural resources of the basin, determined on the basis of significant impacts to the physical, chemical, and biological integrity of source watersheds, and that all other objectives of the compact are achieved. Each party may determine the scope and thresholds of its program, including which new or increased withdrawals and consumptive uses will be subject to the program.\n2. Any party that fails to set threshold levels that comply with Section 4.10.1 any time before ten years after the effective date of this compact shall apply a threshold level for management and regulation of all new or increased withdrawals of 100,000 gallons per day or greater average in any 90-day period.\n3. The parties intend programs for new or increased withdrawals and consumptive uses to evolve as may be necessary to protect basin waters. Pursuant to Section 3.4, the council, in cooperation with the provinces, shall periodically assess the water management programs of the parties. Such assessments may produce recommendations for the strengthening of the programs, including without limitation, establishing lower thresholds for management and regulation in accordance with the decision-making standard.\nSection 4.11. Decision-making standard.\nProposals subject to management and regulation in Section 4.10 shall be declared to meet this decision-making standard and may be approved as appropriate only when the following criteria are met:\n1. all water withdrawn shall be returned, either naturally or after use, to the source watershed less an allowance for consumptive use;\n2. the withdrawal or consumptive use will be implemented so as to ensure that the proposal will result in no significant individual or cumulative adverse impacts to the quantity or quality of the waters and water dependent natural resources and the applicable source watershed;\n3. the withdrawal or consumptive use will be implemented so as to incorporate environmentally sound and economically feasible water conservation measures;\n4. the withdrawal or consumptive use will be implemented so as to ensure that it is in compliance with all applicable municipal, state, and federal laws as well as regional interstate and international agreements, including the Boundary Waters Treaty of 1909;\n5. the proposed use is reasonable, based upon a consideration of the following factors:\na. whether the proposed withdrawal or consumptive use is planned in a fashion that provides for efficient use of the water, and will avoid or minimize the waste of water;\nb. if the proposal is for an increased withdrawal or consumptive use, whether efficient use is made of existing water supplies;\nc. the balance between economic development, social development, and environmental protection of the proposed withdrawal and use and other existing or planned withdrawals and water uses sharing the water source;\nd. the supply potential of the water source, considering quantity, quality, and reliability and safe yield of hydrologically interconnected water sources;\ne. the probable degree and duration of any adverse impacts caused or expected to be caused by the proposed withdrawal and use under foreseeable conditions, to other lawful consumptive or nonconsumptive uses of water or to the quantity or quality of the waters and water dependent natural resources of the basin, and the proposed plans and arrangements for avoidance or mitigation of such impacts; and\nf. if a proposal includes restoration of hydrologic conditions and functions of the source watershed, the party may consider that.\nSection 4.12. Applicability.\n1. Minimum standard. This standard of review and decision shall be used as a minimum standard. Parties may impose a more restrictive decision-making standard for withdrawals under their authority. It is also acknowledged that although a proposal meets the standard of review and decision it may not be approved under the laws of the originating party that has implemented more restrictive measures.\n2. Baseline.\na. To establish a baseline for determining a new or increased diversion, consumptive use or withdrawal, each party shall develop either or both of the following lists for their jurisdiction:\ni. a list of existing withdrawal approvals as of the effective date of the compact;\nii. a list of the capacity of existing systems as of the effective date of this compact. The capacity of the existing systems should be presented in terms of withdrawal capacity, treatment capacity, distribution capacity, or other capacity limiting factors. The capacity of the existing systems must represent the state of the systems. Existing capacity determinations shall be based upon approval limits or the most restrictive capacity information.\nb. For all purposes of this compact, volumes of diversions, consumptive uses, or withdrawals of water set forth in the list(s) prepared by each party in accordance with this section, shall constitute the baseline volume.\nc. The list(s) shall be furnished to the regional body and the council within one year of the effective date of this compact.\n3. Timing of additional applications. Applications for new or increased withdrawals, consumptive uses or exceptions shall be considered cumulatively within ten years of any application.\n4. Change of ownership. Unless a new owner proposes a project that shall result in a proposal for a new or increased diversion or consumptive use subject to regional review or council approval, the change of ownership in and of itself shall not require regional review or council approval.\n5. Groundwater. The basin surface water divide shall be used for the purpose of managing and regulating new or increased diversions, consumptive uses or withdrawals of surface water and groundwater.\n6. Withdrawal systems. The total volume of surface water and groundwater resources that supply a common distribution system shall determine the volume of a withdrawal, consumptive use or diversion.\n7. Connecting channels. The watershed of each Great Lake shall include its upstream and downstream connecting channels.\n8. Transmission in water lines. Transmission of water within a line that extends outside the basin as it conveys water from one point to another within the basin shall not be considered a diversion if none of the water is used outside the basin.\n9. Hydrologic units. The Lake Michigan and Lake Huron watersheds shall be considered to be a single hydrologic unit and watershed.\n10. Bulk water transfer. A proposal to withdraw water and to remove it from the basin in any container greater than 5.7 gallons shall be treated under this compact in the same manner as a proposal for a diversion. Each party shall have the discretion, within its jurisdiction, to determine the treatment of proposals to withdraw water and to remove it from the basin in any container of 5.7 gallons or less.\nSection 4.13. Exemptions.\nWithdrawals from the basin for the following purposes are exempt from the requirements of Article 4.\n1. To supply vehicles, including vessels and aircraft, whether for the needs of the persons or animals being transported or for ballast or other needs related to the operation of the vehicles.\n2. To use in a noncommercial project on a short-term basis for firefighting, humanitarian, or emergency response purposes.\nSection 4.14. U. S. Supreme Court decree: Wisconsin et al. v. Illinois et al.\n1. Notwithstanding any terms of this compact to the contrary, with the exception of paragraph 5 of this section, current, new, or increased withdrawals, consumptive uses, and diversions of basin water by the state of Illinois shall be governed by the terms of the United States Supreme Court decree in Wisconsin et al. v. Illinois et al. and shall not be subject to the terms of this compact nor any rules or regulations promulgated pursuant to this compact. This means that, with the exception of paragraph 5 of this section, for purposes of this compact, current, new, or increased withdrawals, consumptive uses, and diversions of basin water within the state of Illinois shall be allowed unless prohibited by the terms of the United States Supreme Court decree in Wisconsin et al. v. Illinois et al.\n2. The parties acknowledge that the United States Supreme Court decree in Wisconsin et al. v. Illinois et al. shall continue in full force and effect, that this compact shall not modify any terms thereof, and that this compact shall grant the parties no additional rights, obligations, remedies, or defenses thereto. The parties specifically acknowledge that this compact shall not prohibit or limit the state of Illinois in any manner from seeking additional basin water as allowed under the terms of the United States Supreme Court decree in Wisconsin et al. v. Illinois et al., any other party from objecting to any request by the state of Illinois for additional basin water under the terms of said decree, or any party from seeking any other type of modification to said decree. If an application is made by any party to the Supreme Court of the United States to modify said decree, the parties to this compact who are also parties to the decree shall seek formal input from the Canadian provinces of Ontario and Quebec, with respect to the proposed modification, use best efforts to facilitate the appropriate participation of said provinces in the proceedings to modify the decree, and shall not unreasonably impede or restrict such participation.\n3. With the exception of paragraph 5 of this section, because current, new, or increased withdrawals, consumptive uses, and diversions of basin water by the state of Illinois are not subject to the terms of this compact, the state of Illinois is prohibited from using any term of this compact, including Section 4.9, to seek new or increased withdrawals, consumptive uses, or diversions of basin water.\n4. With the exception of paragraph 5 of this section, because Sections 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 4.10, 4.11, 4.12 (paragraphs 1, 2, 3, 4, 6 and 10 only), and 4.13 of this compact all relate to current, new, or increased withdrawals, consumptive uses, and diversions of basin waters, said provisions do not apply to the state of Illinois. All other provisions of this compact not listed in the preceding sentence shall apply to the state of Illinois, including the water conservation programs provision of Section 4.2.\n5. In the event of a proposal for a diversion of basin water for use outside the territorial boundaries of the parties to this compact, decisions by the state of Illinois regarding such a proposal would be subject to all terms of this compact, except paragraphs 1, 3 and 4 of this section.\n6. For purposes of the state of Illinois' participation in this compact, the entirety of this Section 4.14 is necessary for the continued implementation of this compact and, if severed, this compact shall no longer be binding on or enforceable by or against the state of Illinois.\nSection 4.15. Assessment of cumulative impacts.\n1. The parties in cooperation with the provinces shall collectively conduct within the basin, on a lake watershed and St. Lawrence River basin basis, a periodic assessment of the cumulative impacts of withdrawals, diversions, and consumptive uses from the waters of the basin, every five years or each time the incremental basin water losses reach 50 million gallons per day average in any 90-day period in excess of the quantity at the time of the most recent assessment, whichever comes first, or at the request of one or more of the parties. The assessment shall form the basis for a review of the standard of review and decision, council and party regulations and their application. This assessment shall:\na. utilize the most current and appropriate guidelines for such a review, which may include but not be limited to Council on Environmental Quality and Environment Canada guidelines;\nb. give substantive consideration to climate change or other significant threats to basin waters and take into account the current state of scientific knowledge, or uncertainty, and appropriate measures to exercise caution in cases of uncertainty if serious damage may result; and\nc. consider adaptive management principles and approaches, recognizing, considering, and providing adjustments for the uncertainties in, and evolution of, science concerning the basin's water resources, watersheds and ecosystems, including potential changes to basin-wide processes, such as lake level cycles and climate.\n2. The parties have the responsibility of conducting this cumulative impact assessment. Applicants are not required to participate in this assessment.\n3. Unless required by other statutes, applicants are not required to conduct a separate cumulative impact assessment in connection with an application but shall submit information about the potential impacts of a proposal to the quantity or quality of the waters and water dependent natural resources of the applicable source watershed. An applicant may, however, provide an analysis of how their proposal meets the no significant adverse cumulative impact provision of the standard of review and decision.\nARTICLE 5\nTRIBAL CONSULTATION\nSection 5.1. Consultation with tribes.\n1. In addition to all other opportunities to comment pursuant to Section 6.2, appropriate consultations shall occur with federally recognized tribes in the originating party for all proposals subject to council or regional review pursuant to this compact. Such consultations shall be organized in the manner suitable to the individual proposal and the laws and policies of the originating party.\n2. All federally recognized tribes within the basin shall receive reasonable notice indicating that they have an opportunity to comment in writing to the council or the regional body, or both, and other relevant organizations on whether the proposal meets the requirements of the standard of review and decision when a proposal is subject to regional review or council approval. Any notice from the council shall inform the tribes of any meeting or hearing that is to be held under Section 6.2 and invite them to attend. The parties and the council shall consider the comments received under this section before approving, approving with modifications, or disapproving any proposal subject to council or regional review.\n3. In addition to the specific consultation mechanisms described above, the council shall seek to establish mutually agreed-upon mechanisms or processes to facilitate dialogue with, and input from, federally recognized tribes on matters to be dealt with by the council; and, the council shall seek to establish mechanisms and processes with federally recognized tribes designed to facilitate ongoing scientific and technical interaction and data exchange regarding matters falling within the scope of this compact. This may include participation of tribal representatives on advisory committees established under this compact or such other processes that are mutually agreed upon with federally recognized tribes individually or through duly-authorized intertribal agencies or bodies.\nARTICLE 6\nPUBLIC PARTICIPATION\nSection 6.1. Meetings, public hearings and records.\n1. The parties recognize the importance and necessity of public participation in promoting management of the water resources of the basin. Consequently, all meetings of the council shall be open to the public, except with respect to issues of personnel.\n2. The minutes of the council shall be a public record open to inspection at its offices during regular business hours.\nSection 6.2. Public participation.\nIt is the intent of the council to conduct public participation processes concurrently and jointly with processes undertaken by the parties and through regional review. To ensure adequate public participation, each party or the council shall ensure procedures for the review of proposals subject to the standard of review and decision consistent with the following requirements:\n1. Provide public notification of receipt of all applications and a reasonable opportunity for the public to submit comments before applications are acted upon.\n2. Assure public accessibility to all documents relevant to an application, including public comment received.\n3. Provide guidance on standards for determining whether to conduct a public meeting or hearing for an application, time and place of such a meeting(s) or hearing(s), and procedures for conducting of the same.\n4. Provide the record of decision for public inspection including comments, objections, responses and approvals, approvals with conditions, and disapprovals.\nARTICLE 7\nDISPUTE RESOLUTION AND ENFORCEMENT\nSection 7.1. Good faith implementation.\nEach of the parties pledges to support implementation of all provisions of this compact, and covenants that its officers and agencies shall not hinder, impair, or prevent any other party carrying out any provision of this compact.\nSection 7.2. Alternative dispute resolution.\n1. Desiring that this compact be carried out in full, the parties agree that disputes between the parties regarding interpretation, application, and implementation of this compact shall be settled by alternative dispute resolution.\n2. The council, in consultation with the provinces, shall provide by rule procedures for the resolution of disputes pursuant to this section.\nSection 7.3. Enforcement.\n1. Any person aggrieved by any action taken by the council pursuant to the authorities contained in this compact shall be entitled to a hearing before the council. Any person aggrieved by a party action shall be entitled to a hearing pursuant to the relevant party's administrative procedures and laws. After exhaustion of such administrative remedies, (i) any aggrieved person shall have the right to judicial review of a council action in the United States District Courts for the District of Columbia or the district court in which the council maintains offices, provided such action is commenced within 90 days; and (ii) any aggrieved person shall have the right to judicial review of a party's action in the relevant party's court of competent jurisdiction, provided that an action or proceeding for such review is commenced within the time frames provided for by the party's law. For purposes of this paragraph, a state or province is deemed to be an aggrieved person with respect to any party action pursuant to this compact.\n2. a. Any party or the council may initiate actions to compel compliance with the provisions of this compact, and the rules and regulations promulgated hereunder by the council. Jurisdiction over such actions is granted to the court of the relevant party, as well as the United States District Courts for the District of Columbia and the district court in which the council maintains offices. The remedies available to any such court shall include, but not be limited to, equitable relief and civil penalties.\nb. Each party may issue orders within its respective jurisdiction and may initiate actions to compel compliance with the provisions of its respective statutes and regulations adopted to implement the authorities contemplated by this compact in accordance with the provisions of the laws adopted in each party's jurisdiction.\n3. Any aggrieved person, party or the council may commence a civil action in the relevant party's courts and administrative systems to compel any person to comply with this compact should any such person, without approval having been given, undertake a new or increased withdrawal, consumptive use or diversion that is prohibited or subject to approval pursuant to this compact.\na. No action under this subsection may be commenced if:\ni. the originating party or council approval for the new or increased withdrawal, consumptive use, or diversion has been granted; or\nii. the originating party or council has found that the new or increased withdrawal, consumptive use, or diversion is not subject to approval pursuant to this compact.\nb. No action under this subsection may be commenced unless:\ni. a person commencing such action has first given 60 days prior notice to the originating party, the council and person alleged to be in noncompliance; and\nii. neither the originating party nor the council has commenced and is diligently prosecuting appropriate enforcement actions to compel compliance with this compact.\nThe available remedies shall include equitable relief, and the prevailing or substantially prevailing party may recover the costs of litigation, including reasonable attorney and expert witness fees, whenever the court determines that such an award is appropriate.\n4. Each of the parties may adopt provisions providing additional enforcement mechanisms and remedies including equitable relief and civil penalties applicable within its jurisdiction to assist in the implementation of this compact.\nARTICLE 8\nADDITIONAL PROVISIONS\nSection 8.1. Effect on existing rights.\n1. Nothing in this compact shall be construed to affect, limit, diminish or impair any rights validly established and existing as of the effective date of this compact under state or federal law governing the withdrawal of waters of the basin.\n2. Nothing contained in this compact shall be construed as affecting or intending to affect or in any way to interfere with the law of the respective parties relating to common law water rights.\n3. Nothing in this compact is intended to abrogate or derogate from treaty rights or rights held by any tribe recognized by the federal government of the United States based upon its status as a tribe recognized by the federal government of the United States.\n4. An approval by a party or the council under this compact does not give any property rights, nor any exclusive privileges, nor shall it be construed to grant or confer any right, title, easement, or interest in, to or over any land belonging to or held in trust by a party; neither does it authorize any injury to private property or invasion of private rights, nor infringement of federal, state, or local laws or regulations; nor does it obviate the necessity of obtaining federal assent when necessary.\nSection 8.2. Relationship to agreements concluded by the United States of America.\n1. Nothing in this compact is intended to provide nor shall be construed to provide, directly or indirectly, to any person any right, claim, or remedy under any treaty or international agreement, nor is it intended to derogate any right, claim, or remedy that already exists under any treaty or international agreement.\n2. Nothing in this compact is intended to infringe nor shall be construed to infringe upon the treaty power of the United States of America, nor shall any term hereof be construed to alter or amend any treaty or term thereof that has been or may hereafter be executed by the United States of America.\n3. Nothing in this compact is intended to affect nor shall be construed to affect the application of the Boundary Waters Treaty of 1909 whose requirements continue to apply in addition to the requirements of this compact.\nSection 8.3. Confidentiality.\n1. Nothing in this compact requires a party to breach confidentiality obligations or requirements prohibiting disclosure, or to compromise security of commercially sensitive or proprietary information.\n2. A party may take measures, including, but not limited to, deletion and redaction, deemed necessary to protect any confidential, proprietary, or commercially sensitive information when distributing information to other parties. The party shall summarize or paraphrase any such information in a manner sufficient for the council to exercise its authorities contained in this compact.\nSection 8.4. Additional laws.\nNothing in this compact shall be construed to repeal, modify, or qualify the authority of any party to enact any legislation or enforce any additional conditions and restrictions regarding the management and regulation of waters within its jurisdiction.\nSection 8.5. Amendments and supplements.\nThe provisions of this compact shall remain in full force and effect until amended by action of the governing bodies of the parties and consented to and approved by any other necessary authority in the same manner as this compact is required to be ratified to become effective.\nSection 8.6. Severability.\nShould a court of competent jurisdiction hold any part of this compact to be void or unenforceable, it shall be considered severable from those portions of the compact capable of continued implementation in the absence of the voided provisions. All other provisions capable of continued implementation shall continue in full force and effect.\nSection 8.7. Duration of compact and termination.\nOnce effective, the compact shall continue in force and remain binding upon each and every party unless terminated.\nThis compact may be terminated at any time by a majority vote of the parties. In the event of such termination, all rights established under it shall continue unimpaired.\nARTICLE 9\nEFFECTUATION\nSection 9.1. Repealer.\nAll acts and parts of acts inconsistent with this act are to the extent of such inconsistency hereby repealed.\nSection 9.2. Effectuation by chief executive.\nThe governor is authorized to take such action as may be necessary and proper in his or her discretion to effectuate the compact and the initial organization and operation thereunder.\nSection 9.3. Entire agreement.\nThe parties consider this compact to be complete and an integral whole. Each provision of this compact is considered material to the entire compact, and failure to implement or adhere to any provision may be considered a material breach. Unless otherwise noted in this compact, any change or amendment made to the compact by any party in its implementing legislation or by the United States Congress when giving its consent to this compact is not considered effective unless concurred in by all parties.\nSection 9.4. Effective date and execution.\nThis compact shall become binding and effective when ratified through concurring legislation by the states of Illinois, Indiana, Michigan, Minnesota, New York, Ohio and Wisconsin and the Commonwealth of Pennsylvania and consented to by the Congress of the United States. This compact shall be signed and sealed in nine identical original copies by the respective chief executives of the signatory parties. One such copy shall be filed with the secretary of state of each of the signatory parties or in accordance with the laws of the state in which the filing is made, and one copy shall be filed and retained in the archives of the council upon its organization. The signatures shall be affixed and attested under the following form:\nIn witness whereof, and in evidence of the adoption and enactment into law of this compact by the legislatures of the signatory parties and consent by the Congress of the United States, the respective governors do hereby, in accordance with the authority conferred by law, sign this compact in nine duplicate original copies, attested by the respective secretaries of state, and have caused the seals of the respective states to be hereunto affixed this ....... day of (month), (year).",
	"repealed": false
}