{
	"id": "626.8482",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8482",
	"title": "626.8482 SCHOOL RESOURCE OFFICERS; DUTIES; TRAINING; MODEL POLICY.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"School\" means an elementary school, middle school, or secondary school, as defined in section 120A.05, subdivisions 9, 11, and 13.\n(c) \"School resource officer\" means a peace officer who is assigned to work in an elementary school, middle school, or secondary school during the regular instructional school day as one of the officer's regular responsibilities through the terms of a contract entered between the peace officer's employer and the designated school district or charter school.\n(a) A school resource officer's contractual duties with a school district or charter school shall include:\n(1) fostering a positive school climate through relationship building and open communication;\n(2) protecting students, staff, and visitors to the school grounds from criminal activity;\n(3) serving as a liaison from law enforcement to school officials;\n(4) providing advice on safety drills;\n(5) identifying vulnerabilities in school facilities and safety protocols;\n(6) educating and advising students and staff on law enforcement topics; and\n(7) enforcement of criminal laws.\n(b) A school district or charter school may contract with a school resource officer's employer for the officer to perform additional duties to those described in paragraph (a).\n(c) A school resource officer must not use force or the authority of their office solely to enforce school rules or policies or participate in the enforcement of discipline for violations of school rules.\n(d) Nothing in this subdivision limits any other duty or responsibility imposed on peace officers; limits the expectation that peace officers will exercise professional judgment and discretion to protect the health, safety, and general welfare of the public when carrying out their duties; or creates a duty for school resource officers to protect students, staff, or others on school grounds that is different from the duty to protect the public as a whole.\n(a) Except as provided for in paragraphs (b) to (d), beginning September 1, 2025, a peace officer assigned to serve as a school resource officer must complete a training course that provides instruction on the learning objectives identified in subdivision 4 prior to assuming the duties of a school resource officer.\n(b) A peace officer who has completed either the School Safety Center standardized Basic School Resource Officer Training or the National School Resource Officer Basic School Resource Officer course prior to September 1, 2025, must complete the training mandated under paragraph (a) before June 1, 2027. A peace officer covered under this paragraph may complete a supplemental training course approved by the board pursuant to subdivision 4, paragraph (b), to satisfy the training requirement.\n(c) If an officer's employer is unable to provide the required training course to the officer prior to the officer assuming the duties of a school resource officer, the officer must complete the required training within six months of assuming the duties of a school resource officer. The officer is not required to perform the duties described in subdivision 2, paragraph (a), clause (4) or (5), until the officer has completed the required training course. The officer must review any policy adopted by the officer's employer pursuant to subdivision 6 before assuming the other duties of a school resource officer and must comply with that policy.\n(d) An officer who is serving as a substitute school resource officer for fewer than 60 student contact days within a school year is not obligated to complete the required training or perform the duties described in subdivision 2, paragraph (a), clause (4) or (5), but must review and comply with any policy adopted pursuant to subdivision 6 by the law enforcement agency that employs the substitute school resource officer.\n(e) For each school resource officer employed by an agency, the chief law enforcement officer must maintain a copy of the most recent training certificate issued to the officer for completion of the training mandated under this section.\n(a) By January 15, 2025, the Board of Peace Officer Standards and Training, in consultation with the Department of Public Safety's School Safety Center, shall prepare learning objectives for training courses to instruct peace officers in serving as a school resource officer. At a minimum, the learning objectives must ensure officers receive training on:\n(1) the juvenile justice system;\n(2) legal standards for peace officers to use force to detain or arrest students in schools;\n(3) legal standards for school employees and contractors to use force to detain, discipline, and arrest students in school;\n(4) de-escalation techniques and using the least restrictive physical intervention strategies for handling conflicts in schools;\n(5) responding to persons experiencing a mental health crisis in a school setting, with an emphasis placed on juveniles;\n(6) understanding and working with students with disabilities and students receiving special education services;\n(7) juvenile brain development, including limitations on impulse control;\n(8) the impact of childhood trauma on juvenile behavior;\n(9) responding to threats of violence against students and schools;\n(10) detecting juvenile exploitation;\n(11) investigating crimes committed in schools, including student and parental rights;\n(12) identifying vulnerabilities in school facilities and safety protocols;\n(13) mandated safety drills and best practices in conducting safety drills; and\n(14) the topics identified in section 626.8469, subdivision 1, as they pertain to juveniles or students.\n(b) The Board of Peace Officer Standards and Training may also approve supplemental training courses that are offered by providers who have trained school resource officers in the state prior to development of the learning objectives required under paragraph (a). At a minimum, an approved supplemental course must provide instruction on each of the board's learning objectives that were not covered in the provider's existing school resource officer course curriculum.\n(a) By December 31, 2024, the Board of Peace Officer Standards and Training shall develop a model school resource officer policy. In developing the policy, the board must convene a group consisting of representatives from the Department of Public Safety's School Safety Center, the Minnesota School Boards Association, the Minnesota Association of Secondary School Principals, Education Minnesota, the Minnesota Sheriffs' Association, the Minnesota Chiefs of Police Association, the Minnesota Police and Peace Officers Association, the Minnesota Juvenile Officers Association, the National Association of School Resource Officers, Solutions Not Suspensions, the Minnesota Youth Council, the Minnesota Council on Disability, and one community organization supporting the rights of students receiving special education services. The group must meet at least three times to discuss the topics identified in paragraph (b), address any related issues, and provide advice and direction regarding development of the model policy.\n(b) The model policy must cover, at a minimum, the following:\n(1) issues to be addressed in a school resource officer contract, including but not limited to the use of plain clothes, modified uniforms, and other changes to school resource officer attire in order to foster a positive school climate, facilitate the establishment of positive relationships with students, and promote open communication;\n(2) considerations for the proper use of force on school grounds, including:\n(i) the prohibitions on choke holds and other restraints established in section 609.06, subdivision 3;\n(ii) the prohibition on using force or the authority of the peace officer's office solely to enforce school rules or policies or participating in the enforcement of discipline for violations of school rules;\n(iii) the use of de-escalation techniques and other alternatives to higher levels of force that are appropriate with juveniles and students in a school setting;\n(iv) response tactics and strategies that minimize the use and duration of prone restraint, as defined in section 121A.58, and other physical holds of students; and\n(v) the duty to render reasonably prompt care, consistent with the officer's training, to a person who an officer physically holds or restrains;\n(3) alternative procedures that can be used to de-escalate conflicts in schools and students and others in crisis;\n(4) proper procedures and limitations placed on school districts and charter schools to ensure school resource officers are being utilized appropriately and not for school disciplinary purposes;\n(5) considerations to build constructive police relationships with students, administrators, and educational staff;\n(6) proper procedures for protecting student data; and\n(7) how soon after completing the training required under subdivision 3 that a school resource officer must complete a refresher course that covers the learning objectives established in subdivision 4.\nBy September 1, 2025, each law enforcement agency with a school resource officer program shall develop, adopt, and implement a written policy regarding school resource officers that is identical or, at a minimum, substantially similar to the model policy adopted by the board under subdivision 5.\nThe board may impose licensing sanctions and seek injunctive relief under section 214.11 for failure to comply with the requirements of this section.",
	"repealed": false
}