{
	"id": "116L.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.98",
	"title": "116L.98 WORKFORCE PROGRAM OUTCOMES.",
	"text": "The commissioner shall develop and implement a uniform outcome measurement and reporting system for adult workforce-related programs funded in whole or in part by state funds. For the purpose of this section, \"workforce-related programs\" means all education and training programs administered by the commissioner and includes programs and services administered by the commissioner and provided to individuals enrolled in adult basic education under section 124D.52 and the Minnesota family investment program under chapter 142G.\n(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Credential\" means postsecondary degrees, diplomas, licenses, and certificates awarded in recognition of an individual's attainment of measurable technical or occupational skills necessary to obtain employment or advance with an occupation. This definition does not include certificates awarded by workforce investment boards or work-readiness certificates.\n(c) \"Exit\" means to have not received service under a workforce program for 90 consecutive calendar days. The exit date is the last date of service.\n(d) \"Net impact\" means the use of matched control groups and regression analysis to estimate the impacts attributable to program participation net of other factors, including observable personal characteristics and economic conditions.\n(e) \"Pre-enrollment\" means the period of time before an individual was enrolled in a workforce program.\n(a) By December 31 of each even-numbered year, the commissioner must report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over economic development and workforce policy and finance the following information separately for each of the previous two fiscal or calendar years, for each program subject to the requirements of subdivision 1:\n(1) the total number of participants enrolled;\n(2) the median pre-enrollment wages based on participant wages for the second through the fifth calendar quarters immediately preceding the quarter of enrollment excluding those with zero income;\n(3) the total number of participants with zero income in the second through fifth calendar quarters immediately preceding the quarter of enrollment;\n(4) the total number of participants enrolled in training;\n(5) the total number of participants enrolled in training by occupational group;\n(6) the total number of participants that exited the program and the average enrollment duration of participants that have exited the program during the year;\n(7) the total number of exited participants who completed training;\n(8) the total number of exited participants who attained a credential;\n(9) the total number of participants employed during three consecutive quarters immediately following the quarter of exit, by industry;\n(10) the median wages of participants employed during three consecutive quarters immediately following the quarter of exit;\n(11) the total number of participants employed during eight consecutive quarters immediately following the quarter of exit, by industry;\n(12) the median wages of participants employed during eight consecutive quarters immediately following the quarter of exit;\n(13) the total cost of the program;\n(14) the total cost of the program per participant;\n(15) the cost per credential received by a participant; and\n(16) the administrative cost of the program.\n(b) The report to the legislature must contain participant information by education level, race and ethnicity, gender, and geography, and a comparison of exited participants who completed training and those who did not.\n(c) The requirements of this section apply to programs administered directly by the commissioner or administered by other organizations under a grant made by the department.\n(a) A recipient of a future or past grant or direct appropriation made by or through the department must report data to the commissioner by September 1 of each even-numbered year on each of the items in subdivision 3 for each program it administers except wages and number employed, which the department shall provide. The data must be in a format prescribed by the commissioner.\n(b) Beginning July 1, 2014, the commissioner shall provide notice to grant applicants and recipients regarding the data collection and reporting requirements under this subdivision and must provide technical assistance to applicants and recipients to assist in complying with the requirements of this subdivision.\n(a) The information collected and reported under subdivisions 3 and 4 shall be made available on the department's website.\n(b) The commissioner must provide analysis of the data required under subdivision 3.\n(c) The analysis under paragraph (b) must also include an executive summary of program outcomes, including but not limited to enrollment, training, credentials, pre- and post-program employment and wages, and a comparison of program outcomes by participant characteristics.\n(d) The data required in the comparative analysis under paragraph (c) must be presented in both written and graphic format.\n(a) A program that is a recipient of public funds and subject to the requirements of this section as of May 1, 2014, is not eligible for additional state appropriations for any fiscal year beginning after June 30, 2015, unless all of the reporting requirements under subdivision 4 have been satisfied.\n(b) A program with an initial request for funds on or after July 1, 2014, may be considered for receipt of public funds for the first two fiscal years only if a plan that demonstrates how the data collection and reporting requirements under subdivision 4 will be met has been submitted and approved by the commissioner. Any subsequent request for funds after an initial request is subject to the requirements of paragraph (a).\n(a) By January 15, 2015, the commissioner must report to the committees of the house of representatives and the senate having jurisdiction over economic development and workforce policy and finance on the results of the net impact pilot project already underway as of the date of enactment of this section.\n(b) The commissioner shall contract with an independent entity to conduct an ongoing net impact analysis of the programs included in the net impact pilot project under paragraph (a), career pathways programs, and any other programs deemed appropriate by the commissioner. The net impact methodology used by the independent entity under this paragraph must be based on the methodology and evaluation design used in the net impact pilot project under paragraph (a).\n(c) By January 15, 2017, and every four years thereafter, the commissioner must report to the committees of the house of representatives and the senate having jurisdiction over economic development and workforce policy and finance the following information for each program subject to paragraph (b):\n(1) the net impact of workforce services on individual employment, earnings, and public benefit usage outcomes; and\n(2) a cost-benefit analysis for understanding the monetary impacts of workforce services from the participant and taxpayer points of view.\nThe report under this paragraph must be made available to the public in an electronic format on the Department of Employment and Economic Development's website.\n(d) The department is authorized to create and maintain data-sharing agreements with other departments, including corrections, human services, and any other department that are necessary to complete the analysis. The department shall supply the information collected for use by the independent entity conducting net impact analysis pursuant to the data practices requirements under chapters 13, 13A, 13B, and 13C.",
	"repealed": false
}