{
	"id": "144A.753",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.753",
	"title": "144A.753 LICENSURE.",
	"text": "(a) A hospice provider may not operate in the state without a valid license issued by the commissioner.\n(b) Within ten days after receiving an application for a license, the commissioner shall acknowledge receipt of the application in writing. The acknowledgment must indicate whether the application appears to be complete or whether additional information is required before the application is considered complete. Within 90 days after receiving a complete application, the commissioner shall either grant or deny the license. If an applicant is not granted or denied a license within 90 days after submitting a complete application, the license must be deemed granted. An applicant whose license has been deemed granted must provide written notice to the commissioner before providing hospice care.\n(c) Each application for a hospice provider license, or for a renewal of a license, shall be accompanied by a fee as follows:\n(1) for revenues no more than $25,000, $125;\n(2) for revenues greater than $25,000 and no more than $100,000, $312.50;\n(3) for revenues greater than $100,000 and no more than $250,000, $625;\n(4) for revenues greater than $250,000 and no more than $350,000, $937.50;\n(5) for revenues greater than $350,000 and no more than $450,000, $1,250;\n(6) for revenues greater than $450,000 and no more than $550,000, $1,562.50;\n(7) for revenues greater than $550,000 and no more than $650,000, $1,875;\n(8) for revenues greater than $650,000 and no more than $750,000, $2,187.50;\n(9) for revenues greater then $750,000 and no more than $850,000, $2,500;\n(10) for revenues greater than $850,000 and no more than $950,000, $2,812.50;\n(11) for revenues greater than $950,000 and no more than $1,100,000, $3,125;\n(12) for revenues greater than $1,100,000 and no more than $1,275,000, $3,750;\n(13) for revenues greater than $1,275,000 and no more than $1,500,000, $4,375; and\n(14) for revenues greater than $1,500,000, $5,000.\nThe commissioner shall license hospice providers using the authorities under sections 144A.75 to 144A.755. To receive a license, a hospice provider must:\n(1) provide centrally coordinated core services in the home and inpatient settings and make other services available, which may be provided by employees or contracted staff;\n(2) require that the medical components of the hospice care program be under the direction of a licensed physician who serves as medical director;\n(3) require that the palliative care provided to a hospice patient be under the direction of a licensed physician;\n(4) utilize an interdisciplinary team that meets regularly to develop, implement, and evaluate the hospice provider's plan of care for each hospice patient and the patient's family. Within 48 hours of admission, a licensee must enter a written service agreement with the patient or the patient's responsible person describing the cost of services. Services are provided in accordance to the plan of care developed by the interdisciplinary team. Changes in the services provided which do not cause a change in fees do not require a written modification of the service plan agreed to by the patient or the patient's responsible person;\n(5) provide accessible hospice care, 24 hours a day, seven days a week;\n(6) utilize an ongoing system of quality assurance;\n(7) require that volunteer services be provided by individuals who have completed a hospice volunteer training program and are trained to provide the services required;\n(8) provide a planned program of supportive services and bereavement counseling available to patients and families during hospice care and the bereavement period following the death of the hospice patient; and\n(9) require that inpatient services be provided directly or by arrangement in a licensed hospital or nursing home or residential hospice.\nA hospice provider may not operate in the state or use the words \"hospice,\" \"hospice care,\" \"hospice care program,\" or \"hospice provider\" without a valid license issued by the commissioner. St. Anne Hospice in Winona County may continue to use the name \"hospice.\"\n(a) A hospice provider must establish and maintain a comprehensive tuberculosis infection control program according to the most current tuberculosis infection control guidelines issued by the United States Centers for Disease Control and Prevention (CDC), Division of Tuberculosis Elimination, as published in CDC's Morbidity and Mortality Weekly Report (MMWR). This program must include a tuberculosis infection control plan that covers all paid and unpaid employees, contractors, students, and volunteers. For residential hospice facilities, the tuberculosis infection control plan must cover each hospice patient. The Department of Health shall provide technical assistance regarding implementation of the guidelines.\n(b) Written compliance with this subdivision must be maintained by the hospice provider.",
	"repealed": false
}