{
	"id": "325D.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/325D.44",
	"title": "325D.44 DECEPTIVE TRADE PRACTICES.",
	"text": "A person engages in a deceptive trade practice when, in the course of business, vocation, or occupation, the person:\n(1) passes off goods or services as those of another;\n(2) causes likelihood of confusion or of misunderstanding as to the source, sponsorship, approval, or certification of goods or services;\n(3) causes likelihood of confusion or of misunderstanding as to affiliation, connection, or association with, or certification by, another;\n(4) uses deceptive representations or designations of geographic origin in connection with goods or services;\n(5) represents that goods or services have sponsorship, approval, characteristics, ingredients, uses, benefits, or quantities that they do not have or that a person has a sponsorship, approval, status, affiliation, or connection that the person does not have;\n(6) represents that goods are original or new if they are deteriorated, altered, reconditioned, reclaimed, used, or secondhand;\n(7) represents that goods or services are of a particular standard, quality, or grade, or that goods are of a particular style or model, if they are of another;\n(8) disparages the goods, services, or business of another by false or misleading representation of fact;\n(9) advertises goods or services with intent not to sell them as advertised;\n(10) advertises goods or services with intent not to supply reasonably expectable public demand, unless the advertisement discloses a limitation of quantity;\n(11) makes false or misleading statements of fact concerning the reasons for, existence of, or amounts of price reductions;\n(12) in attempting to collect delinquent accounts, implies or suggests that health care services will be withheld in an emergency situation;\n(13) engages in (i) unfair methods of competition, or (ii) unfair or unconscionable acts or practices; or\n(14) engages in any other conduct which similarly creates a likelihood of confusion or of misunderstanding.\n(a) A person engages in a deceptive trade practice when, in the course of business, vocation, or occupation, the person advertises, displays, or offers a price for goods or services that does not include all mandatory fees or surcharges. If the person that disseminates an advertisement is independent of the advertiser, the person is not liable for the content of the advertisement.\n(b) For purposes of this subdivision, \"mandatory fee\" includes but is not limited to a fee or surcharge that:\n(1) must be paid in order to purchase the goods or services being advertised;\n(2) is not reasonably avoidable by the consumer; or\n(3) a reasonable person would expect to be included in the purchase of the goods or services being advertised.\nFor the purposes of this subdivision, mandatory fee does not include taxes imposed by a government entity on the sale, use, purchase, receipt, or delivery of the goods or services.\n(c) A delivery platform is compliant with this subdivision if the platform satisfies all of the following requirements:\n(1) at the point when a consumer views and selects either a vendor or items for purchase, a delivery platform must display in a clear and conspicuous manner that an additional flat fee or percentage is charged. The disclosure must include the additional fee or percentage amount; and\n(2) after a consumer selects items for purchase, but prior to checkout, a delivery platform must display a subtotal page that itemizes the price of the menu items and the additional fee that is included in the total cost.\n(d) A person may charge a reasonable postage or shipping fee that is actually incurred by a consumer who has purchased a good that requires shipping.\n(e) Nothing in this subdivision prevents a person from offering goods or services at a discounted price from the advertised, displayed, or offered price.\n(f) A person offering goods or services in an auction where consumers can place bids on the goods or services and the total cost is indeterminable is compliant with this subdivision if the person discloses in a clear and conspicuous manner any mandatory fees associated with the transaction and that the total cost of the goods or services may vary.\n(g) A person offering services where the total cost of a service is determined by consumer selections and preferences, or where the total cost of the service relates to distance or time, is compliant with this subdivision if the person discloses in a clear and conspicuous manner (1) the factors that determine the total price, (2) any mandatory fees associated with the transaction, and (3) that the total cost of the services may vary.\n(h) A food or beverage service establishment, including a hotel, is compliant with this subdivision if, in every offer or advertisement for the purchase of a good or service that includes pricing information, the total price of the good or service being offered or advertised includes a clear and conspicuous disclosure of the percentage of any automatic and mandatory gratuities charged.\n(i) A person is compliant with this subdivision if the person providing broadband Internet access service on its own or as part of a bundle is compliant with the broadband consumer label requirements under Code of Federal Regulations, title 47, section 8.1(a).\n(j) A person is compliant with this subdivision if the person is compliant with the pricing requirements under United States Code, title 47, section 552.\n(k) This subdivision is enforceable unless preempted by federal law.\n[See Note.]\nSubdivision 1a does not apply to the following:\n(1) fees authorized by law related to the purchase or lease of a motor vehicle that are charged by a motor vehicle dealer, as defined by section 168.27, subdivision 1, paragraph (f);\n(2) any business or the business' affiliate where either the business or the affiliate is regulated by the Minnesota Public Utilities Commission; or\n(3) any fees, surcharges, or other costs associated with settlement services, as defined in the Real Estate Settlement Procedures Act, United States Code, title 12, section 2602(3). This clause does not apply to real estate broker commissions and fees.\n[See Note.]\n(a) In order to prevail in an action under sections 325D.43 to 325D.48, a complainant need not prove competition between the parties or actual confusion or misunderstanding.\n(b) For purposes of subdivision 1, clause (13), the standard of proof provided under section 325F.69, subdivision 8, applies.\nThis section does not affect unfair, deceptive, or misleading trade practices otherwise actionable at common law or under other statutes of this state.",
	"repealed": false
}