{
	"id": "148E.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.195",
	"title": "148E.195 REPRESENTATIONS TO CLIENTS AND PUBLIC.",
	"text": "(a) A social worker must conspicuously display at the social worker's places of practice, or make available as a handout for all clients, information that the client has the right to:\n(1) be informed of the social worker's license status, education, training, and experience;\n(2) examine public data on the social worker maintained by the board;\n(3) report a complaint about the social worker's practice to the board; and\n(4) be informed of the board's mailing address, email address, website address, and telephone number.\n(b) A social worker must conspicuously display the social worker's wall certificate at the social worker's places of practice and office locations. Additional wall certificates may be requested according to section 148E.095.\nMS 2014 [Expired, 2012 c 197 art 1 s 16]\nEffective July 1, 2016:\n(a) No applicant or other individual may be represented to the public by any title incorporating the words \"social work\" or \"social worker\" unless the individual is employed by a county or holds a license according to this chapter.\n(b) In all professional use of a social worker's name, the social worker must use the license designation \"LSW\" or \"licensed social worker\" for a licensed social worker, \"LGSW\" or \"licensed graduate social worker\" for a licensed graduate social worker, \"LISW\" or \"licensed independent social worker\" for a licensed independent social worker, or \"LICSW\" or \"licensed independent clinical social worker\" for a licensed independent clinical social worker.\n(c) Public statements or advertisements must not be untruthful, misleading, false, fraudulent, deceptive, or potentially exploitative of clients, former clients, interns, students, supervisees, or the public.\n(d) A social worker must not:\n(1) use licensure status as a claim, promise, or guarantee of successful service;\n(2) obtain a license by cheating or employing fraud or deception;\n(3) make false statements or misrepresentations to the board or in materials submitted to the board; or\n(4) engage in conduct that has the potential to deceive or defraud a social work client, intern, student, supervisee, or the public.\n(a) A social worker must provide accurate and factual information concerning the social worker's credentials, education, training, and experience when the information is requested by clients, potential clients, or other persons or organizations.\n(b) A social worker must not misrepresent directly or by implication the social worker's license, degree, professional certifications, affiliations, or other professional qualifications in any oral or written communications to clients, potential clients, or other persons or organizations. A social worker must take reasonable steps to prevent such misrepresentations by other social workers.\n(c) A social worker must not hold out as a person licensed as a social worker without having a social work license according to sections 148E.055 and 148E.060.\n(d) A social worker must not misrepresent directly or by implication (1) affiliations with institutions or organizations, or (2) purposes or characteristics of institutions or organizations with which the social worker is or has been affiliated.",
	"repealed": false
}