{
	"id": "473.408",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.408",
	"title": "473.408 FARE POLICY.",
	"text": "MS 2004 [Repealed, 1Sp2005 c 6 art 3 s 108]\n(a) Fares and fare collection systems shall be established and administered to accomplish the following purposes:\n(1) to encourage and increase transit and paratransit ridership with an emphasis on regular ridership;\n(2) to restrain increases in the average operating subsidy per passenger;\n(3) to ensure that no riders on any route pay more in fares than the average cost of providing the service on that route;\n(4) to ensure that operating revenues are proportioned to the cost of providing the service so as to reduce any disparity in the subsidy per passenger on routes in the transit system; and\n(5) to implement the social fares as set forth in subdivision 2b.\n(b) The plan must contain a statement of the policies that will govern the imposition of user charges for various types of transit service and the policies that will govern decisions by the council to change fare policy.\nThe council shall establish and enforce uniform fare policies for regular route transit in the metropolitan area. The policies must be consistent with the requirements of this section and the council's transportation policy plan. The council and other operators shall charge a base fare and any surcharges for peak hours and distance of service in accordance with the council's fares policies. The council shall approve all fare schedules.\nFor the purposes of raising revenue for improving public safety on transit vehicles and at transit hubs or stops, the council shall review and may adjust its social fares as they relate to passengers under the age of 18 during high crime times provided that the increased revenues are dedicated to improving the safety of all passengers.\nMS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nMS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nMS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nThe council and other operators may charge a reduced fare for service on any route providing circulation service in a downtown area or community activity center. The council and other operators shall not contribute more than 50 percent of the operating deficit of any such route that is confined to a downtown area or community activity center. The boundaries of service districts eligible for reduced fares under this subdivision must be approved by the council.\nThe council may establish transit fare programs and passes that are consistent with the fare policy purposes stated in subdivision 2, including but not limited to:\n(1) discount pass programs for public and private employers, public and private organizations, and school districts; and\n(2) special pass programs for demonstration projects or special events.\nMS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nMS 2022 [Repealed, 2023 c 68 art 5 s 55]\nMS 2022 [Repealed, 2023 c 68 art 5 s 55]\nMS 2022 [Repealed, 2023 c 68 art 5 s 55]\nMS 2022 [Repealed, 2023 c 68 art 5 s 55]\n(a) On and after July 1, 2009, the council shall provide regular route transit, as defined in section 473.385, subdivision 1, free of charge for veterans, as defined in section 197.447, certified as disabled. For purposes of this section, \"certified as disabled\" means certified in writing by the United States Department of Veterans Affairs or the state commissioner of veterans affairs as having a permanent service-connected disability.\n(b) The requirements under this subdivision apply to operators of regular route transit (1) receiving financial assistance under section 473.388, or (2) operating under section 473.405, subdivision 12.",
	"repealed": false
}