{
	"id": "142B.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.41",
	"title": "142B.41 SPECIAL CONDITIONS FOR NONRESIDENTIAL PROGRAMS.",
	"text": "A licensed nonresidential program with a licensed capacity of 12 or fewer persons and a group family day care facility licensed under Minnesota Rules, parts 9502.0315 to 9502.0445, to serve 14 or fewer children shall be considered a permitted single-family residential use of property for the purposes of zoning and other land use regulations.\nExcept as otherwise provided in subdivision 1 or in a town, municipal, or county regulation, a licensed nonresidential program with a licensed capacity of 13 to 16 persons shall be considered a permitted multifamily residential use of property for purposes of zoning. A town, municipal, or county zoning authority may require a conditional use or special use permit in order to assure proper maintenance and operation of the program. Conditions imposed on the nonresidential program must not be more restrictive than those imposed on other conditional uses or special uses of residential property in the same zones unless the additional conditions are necessary to protect the health and safety of the persons being served by the nonresidential program. Nothing in this chapter shall be construed to exclude or prohibit nonresidential programs from single-family zones if otherwise permitted by local zoning regulations.\nUntil such time as the commissioner adopts appropriate rules for conditional licenses, no license holder or applicant for a family or group family day care license is required to spend more than $100 to meet fire safety rules in excess of those required to meet Group \"R\" occupancies under the Uniform Building Code, chapter 12, as incorporated by reference in Minnesota Rules, part 1305.0100.\nWhen the commissioner determines that an applicant or license holder of a family or group family day care license would be required to spend over $100 for physical changes to ensure fire safety, the commissioner may issue a conditional license when all of the following conditions have been met:\n(a) The commissioner shall notify the license holder or applicant in writing of the fire safety deficiencies.\n(b) The commissioner shall notify the license holder or applicant in writing of alternative compliance standards that would correct deficiencies, if available.\n(c) The license holder or applicant agrees in writing to notify each parent, on a form prescribed by the commissioner that requires the signature of the parent, of the fire safety deficiencies, and the existence of the conditional license.\n(a) Nonresidential child care programs serving 14 or fewer children that are conducted at a location other than the license holder's own residence shall be licensed under this section and the rules governing family child care or group family child care if:\n(1) the license holder is the primary provider of care and the nonresidential child care program is conducted in a dwelling that is located on a residential lot;\n(2) the license holder is an employer who may or may not be the primary provider of care, and the purpose for the child care program is to provide child care services to children of the license holder's employees;\n(3) the license holder is a church or religious organization;\n(4) the license holder is a community collaborative child care provider. For purposes of this subdivision, a community collaborative child care provider is a provider participating in a cooperative agreement with a community action agency as defined in section 142F.301;\n(5) the license holder is a not-for-profit agency that provides child care in a dwelling located on a residential lot and the license holder maintains two or more contracts with community employers or other community organizations to provide child care services. The county licensing agency may grant a capacity variance to a license holder licensed under this clause to exceed the licensed capacity of 14 children by no more than five children during transition periods related to the work schedules of parents, if the license holder meets the following requirements:\n(i) the program does not exceed a capacity of 14 children more than a cumulative total of four hours per day;\n(ii) the program meets a one to seven staff-to-child ratio during the variance period;\n(iii) all employees receive at least an extra four hours of training per year than required in the rules governing family child care each year;\n(iv) the facility has square footage required per child under Minnesota Rules, part 9502.0425;\n(v) the program is in compliance with local zoning regulations;\n(vi) the program is in compliance with the applicable fire code as follows:\n(A) if the program serves more than five children older than 2-1/2 years of age, but no more than five children 2-1/2 years of age or less, the applicable fire code is educational occupancy, as provided in Group E Occupancy under the Minnesota State Fire Code 2020, Section 202; or\n(B) if the program serves more than five children 2-1/2 years of age or less, the applicable fire code is Group I-4 Occupancy, as provided in the Minnesota State Fire Code 2020, Section 202, unless the rooms in which the children 2-1/2 years of age or younger are cared for are located on a level of exit discharge and each of these child care rooms has an exit door directly to the exterior, then the applicable fire code is Group E Occupancy, as provided in the Minnesota State Fire Code 2020, Section 202; and\n(vii) any age and capacity limitations required by the fire code inspection and square footage determinations shall be printed on the license; or\n(6) the license holder is the primary provider of care and has located the licensed child care program in a commercial space, if the license holder meets the following requirements:\n(i) the program is in compliance with local zoning regulations;\n(ii) the program is in compliance with the applicable fire code as follows:\n(A) if the program serves more than five children older than 2-1/2 years of age, but no more than five children 2-1/2 years of age or less, the applicable fire code is educational occupancy, as provided in Group E Occupancy under the Minnesota State Fire Code 2020, Section 202; or\n(B) if the program serves more than five children 2-1/2 years of age or less, the applicable fire code is Group I-4 Occupancy, as provided under the Minnesota State Fire Code 2020, Section 202, unless the rooms in which the children 2-1/2 years of age or younger are cared for are located on a level of exit discharge and each of these child care rooms has an exit door directly to the exterior, then the applicable fire code is Group E Occupancy, as provided in the Minnesota State Fire Code 2020, Section 202;\n(iii) any age and capacity limitations required by the fire code inspection and square footage determinations are printed on the license; and\n(iv) the license holder prominently displays the license issued by the commissioner which contains the statement \"This special family child care provider is not licensed as a child care center.\"\n(b) Notwithstanding Minnesota Rules, part 9502.0335, subpart 12, the commissioner may issue up to four licenses to an organization licensed under paragraph (a), clause (2), (3), or (5). Each license must have its own primary provider of care as required under paragraph (d). Each license must operate as a distinct and separate program in compliance with all applicable laws and regulations.\n(c) For licenses issued under paragraph (a), clause (2), (3), (4), (5), or (6), the commissioner may approve up to four licenses at the same location or under one contiguous roof if each license holder is able to demonstrate compliance with all applicable rules and laws. Each licensed program must operate as a distinct program and within the capacity, age, and ratio distributions of each license.\n(d) For a license issued under paragraph (a), clause (2), (3), or (5), the license holder must designate a person to be the primary provider of care at the licensed location on a form and in a manner prescribed by the commissioner. The license holder shall notify the commissioner in writing before there is a change of the person designated to be the primary provider of care. The primary provider of care:\n(1) must be the person who will be the provider of care at the program and present during the hours of operation;\n(2) must operate the program in compliance with applicable laws and regulations under this chapter and Minnesota Rules, chapter 9502;\n(3) is considered a child care background study subject as defined in section 245C.02, subdivision 6a, and must comply with background study requirements in chapter 245C;\n(4) must complete the training that is required of license holders in section 142B.70; and\n(5) is authorized to communicate with the county licensing agency and the department on matters related to licensing.\n(e) For any license issued under this subdivision, the license holder must ensure that any other caregiver, substitute, or helper who assists in the care of children meets the training requirements in section 142B.70 and background study requirements under chapter 245C.\nA group family day care program licensed as a class D specialized infant and toddler group family day care under Minnesota Rules, part 9502.0367, may operate as a class B specialized infant and toddler family day care program on days when only one caregiver is present.\n(a) Except as expressly set forth in this subdivision, drop-in and school age child care programs must be licensed as a drop-in or school age program under the rules governing child care programs operated in a center.\n(b) Drop-in and school age child care programs are exempt from the following Minnesota Rules:\n(1) part 9503.0040;\n(2) part 9503.0045, subpart 1, items F and G;\n(3) part 9503.0050, subpart 6, except for children less than 2-1/2 years old;\n(4) one-half the requirements of part 9503.0060, subpart 4, item A, subitems (2), (5), and (8), subpart 5, item A, subitems (2), (3), and (7), and subpart 6, item A, subitems (3) and (6);\n(5) part 9503.0070; and\n(6) part 9503.0090, subpart 2.\n(c) A drop-in and school age child care program must be operated under the supervision of a person qualified as a director and a teacher.\n(d) A drop-in and school age child care program must have at least two persons on staff whenever the program is operating, except that the commissioner may permit variances from this requirement under specified circumstances for parent cooperative programs, as long as all other staff-to-child ratios are met.\n(e) Whenever the total number of children present to be cared for at a drop-in child care center is more than 20, children that are younger than age 2-1/2 must be in a separate group. This group may contain children up to 60 months old. This group must be cared for in an area that is physically separated from older children.\n(f) A drop-in child care program must maintain a minimum staff ratio for children age 2-1/2 or greater of one staff person for each ten children. A school age child care program must maintain a minimum staff ratio of one staff person for every 15 children.\n(g) If the drop-in child care program has additional staff who are on call as a mandatory condition of their employment, the minimum child-to-staff ratio may be exceeded only for children age 2-1/2 or greater, by a maximum of four children, for no more than 20 minutes while additional staff are in transit.\n(h) In a drop-in child care program, the minimum staff-to-child ratio for infants up to 16 months of age is one staff person for every four infants. The minimum staff-to-child ratio for children age 17 months to 30 months is one staff for every seven children.\n(i) In drop-in care programs that serve both infants and older children, children up to age 2-1/2 may be supervised by assistant teachers, as long as other staff are present in appropriate ratios.\n(j) The minimum staff distribution pattern for a drop-in child care program serving children age 2-1/2 or greater and a school age child care program serving school age children is: the first staff member must be a teacher; the second, third, and fourth staff members must have at least the qualifications of a child care aide; the fifth staff member must have at least the qualifications of an assistant teacher; the sixth, seventh, and eighth staff members must have at least the qualifications of a child care aide; and the ninth staff person must have at least the qualifications of an assistant teacher.\n(k) A drop-in child care program may care for siblings 16 months or older together in any group. For purposes of this subdivision, sibling is defined as sister or brother, half sister or half brother, or stepsister or stepbrother.\n(l) The commissioner may grant a variance to any of the requirements in paragraphs (a) to (k), as long as the health and safety of the persons served by the program are not affected. The request for a variance shall comply with the provisions in section 142B.10, subdivision 16.\n(a) An individual employed as an aide at a child care center may work with children without being directly supervised for an amount of time that does not exceed 25 percent of the child care center's daily hours if:\n(1) a teacher is in the facility;\n(2) the individual is at least 20 years old; and\n(3) the individual has at least 4,160 hours of child care experience as a staff member in a licensed child care center or as the license holder of a family day care home, 120 days of which must be in the employment of the current company.\n(b) A child care center that uses experienced aides under this subdivision must notify parents or guardians by posting the notification in each classroom that uses experienced aides, identifying which staff member is the experienced aide. Records of experienced aide usage must be kept on site and given to the commissioner upon request.\n(c) A child care center may not use the experienced aide provision for one year following two determined experienced aide violations within a one-year period.\n(d) A child care center may use one experienced aide per every four full-time child care classroom staff.\nA portable wading pool as defined in section 144.1222 may not be used by a child at a family day care or group family day care home or at a home at which child care services are provided under section 142B.05, subdivision 2, paragraph (a), clause (2), unless the parent or legal guardian of the child has provided written consent. The written consent shall include a statement that the parent or legal guardian has received and read material provided by the Department of Health to the Department of Children, Youth, and Families for distribution to all family day care or group family day care homes and the general public on the human services Internet website related to the risk of disease transmission as well as other health risks associated with the use of portable wading pools.\n(a) This subdivision governs swimming pools located at family day care or group family day care homes licensed under Minnesota Rules, chapter 9502. This subdivision does not apply to portable wading pools or whirlpools located at family day care or group family day care homes licensed under Minnesota Rules, chapter 9502. For a provider to be eligible to allow a child cared for at the family day care or group family day care home to use the swimming pool located at the home, the provider must not have had a licensing sanction under section 142B.18 or a correction order or conditional license under section 142B.16 relating to the supervision or health and safety of children during the prior 24 months, and must satisfy the following requirements:\n(1) notify the county agency before initial use of the swimming pool and annually, thereafter;\n(2) obtain written consent from a child's parent or legal guardian allowing the child to use the swimming pool and renew the parent or legal guardian's written consent at least annually. The written consent must include a statement that the parent or legal guardian has received and read materials provided by the Department of Health to the Department of Children, Youth, and Families for distribution to all family day care or group family day care homes and the general public on the human services Internet website related to the risk of disease transmission as well as other health risks associated with swimming pools. The written consent must also include a statement that the Department of Health, Department of Children, Youth, and Families, and county agency will not monitor or inspect the provider's swimming pool to ensure compliance with the requirements in this subdivision;\n(3) enter into a written contract with a child's parent or legal guardian and renew the written contract annually. The terms of the written contract must specify that the provider agrees to perform all of the requirements in this subdivision;\n(4) attend and successfully complete a swimming pool operator training course once every five years. Acceptable training courses are:\n(i) the National Swimming Pool Foundation Certified Pool Operator course;\n(ii) the National Spa and Pool Institute Tech I and Tech II courses (both required); or\n(iii) the National Recreation and Park Association Aquatic Facility Operator course;\n(5) require a caregiver trained in first aid and adult and child cardiopulmonary resuscitation to supervise and be present at the swimming pool with any children in the pool;\n(6) toilet all potty-trained children before they enter the swimming pool;\n(7) require all children who are not potty-trained to wear swim diapers while in the swimming pool;\n(8) if fecal material enters the swimming pool water, add three times the normal shock treatment to the pool water to raise the chlorine level to at least 20 parts per million, and close the pool to swimming for the 24 hours following the entrance of fecal material into the water or until the water pH and disinfectant concentration levels have returned to the standards specified in clause (10), whichever is later;\n(9) prevent any person from entering the swimming pool who has an open wound or any person who has or is suspected of having a communicable disease;\n(10) maintain the swimming pool water at a pH of not less than 7.2 and not more than 8.0, maintain the disinfectant concentration between two and five parts per million for chlorine or between 2.3 and 4.5 parts per million for bromine, and maintain a daily record of the swimming pool's operation with pH and disinfectant concentration readings on days when children cared for at the family day care or group family day care home are present;\n(11) have a disinfectant feeder or feeders;\n(12) have a recirculation system that will clarify and disinfect the swimming pool volume of water in ten hours or less;\n(13) maintain the swimming pool's water clarity so that an object on the pool floor at the pool's deepest point is easily visible;\n(14) comply with the provisions of the Abigail Taylor Pool Safety Act in section 144.1222, subdivisions 1c and 1d;\n(15) have in place and enforce written safety rules and swimming pool policies;\n(16) have in place at all times a safety rope that divides the shallow and deep portions of the swimming pool;\n(17) satisfy any existing local ordinances regarding swimming pool installation, decks, and fencing;\n(18) maintain a water temperature of not more than 104 degrees Fahrenheit and not less than 70 degrees Fahrenheit; and\n(19) for lifesaving equipment, have a United States Coast Guard-approved life ring attached to a rope, an exit ladder, and a shepherd's hook available at all times to the caregiver supervising the swimming pool.\nThe requirements of clauses (5), (16), and (18) only apply at times when children cared for at the family day care or group family day care home are present.\n(b) A violation of paragraph (a), clauses (1) to (3), is grounds for a sanction under section 142B.18 or a correction order or conditional license under section 142B.16.\n(c) If a provider under this subdivision receives a licensing sanction under section 142B.18 or a correction order or a conditional license under section 142B.16 relating to the supervision or health and safety of children, the provider is prohibited from allowing a child cared for at the family day care or group family day care home to continue to use the swimming pool located at the home.\n(a) A child care center licensed under this chapter and according to Minnesota Rules, chapter 9503, must maintain documentation of actual attendance for each child receiving care for which the license holder is reimbursed by a governmental program. The records must be accessible to the commissioner during the program's hours of operation, they must be completed on the actual day of attendance, and they must include:\n(1) the first and last name of the child;\n(2) the time of day that the child was dropped off; and\n(3) the time of day that the child was picked up.\n(b) A family child care provider licensed under this chapter and according to Minnesota Rules, chapter 9502, must maintain documentation of actual attendance for each child receiving care for which the license holder is reimbursed for the care of that child by a governmental program. The records must be accessible to the commissioner during the program's hours of operation, they must be completed on the actual day of attendance, and they must include:\n(1) the first and last name of the child;\n(2) the time of day that the child was dropped off; and\n(3) the time of day that the child was picked up.\nAn enrolled child's parent or legal guardian must be allowed access to the parent's or legal guardian's child at any time while the child is in care.\nNotwithstanding any law to the contrary, when a licensed child care center provides transportation for children or contracts to provide transportation for children, a person who has a current, valid driver's license appropriate to the vehicle driven may transport the child.\nNotwithstanding any law to the contrary, a licensed child care center may provide drinking water to a child in a reusable water bottle or reusable cup if the center develops and ensures implementation of a written policy that at a minimum includes the following procedures:\n(1) each day the water bottle or cup is used, the child care center cleans and sanitizes the water bottle or cup using procedures that comply with the Food Code under Minnesota Rules, chapter 4626, or allows the child's parent or legal guardian to bring the water bottle or cup home to be cleaned and sanitized each day the water bottle or cup is used;\n(2) a water bottle or cup is assigned to a specific child and labeled with the child's first and last name;\n(3) water bottles and cups are stored in a manner that reduces the risk of a child using the wrong water bottle or cup; and\n(4) a water bottle or cup is used only for water.",
	"repealed": false
}