{
	"id": "18H.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.13",
	"title": "18H.13 SHIPMENT OF NURSERY STOCK INTO MINNESOTA.",
	"text": "Proof of valid nursery certification and origin of all nursery stock must accompany any shipment. It is the shared responsibility of both the consignee and consignor to examine all shipments for the presence of current and applicable nursery stock certifications for all plant material from all sources of stock in each shipment.\nAn entity residing outside the state may distribute nursery stock in Minnesota if:\n(1) the entity is duly certified under the nursery laws of the state where the nursery stock originates and the laws of that state are essentially equivalent to the laws of Minnesota as determined by the commissioner; and\n(2) the entity complies with this chapter and the rules governing nursery stock distributed in Minnesota.\nThe commissioner may cooperate with and enter into reciprocal agreements with other states regarding licensing and movement of nursery stock. Reciprocal agreements with other states do not prevent the commissioner from prohibiting the distribution in Minnesota of any nursery stock that fails to meet minimum criteria for nursery stock of Minnesota certified live plant dealers. An official directory of certified nurseries and related nursery industry businesses from other states is acceptable in lieu of individual nursery certificates.\nAn entity receiving a shipment of nursery stock from a foreign country that has not been inspected and released by the United States Department of Agriculture at the port of entry must notify the commissioner of the arrival of the shipment, its contents, and the name of the consignor. The entity must hold the shipment unopened until inspected or released by the commissioner.\nAn entity who acts as the representative of a transportation company, private carrier, commercial shipper, common carrier, express parcel carrier, or other transportation entity, and receives, ships, or otherwise distributes a carload, box, container, or any package of plants, plant materials, or nursery stock, that does not have all required certificates attached as required or fails to immediately notify the commissioner is in violation of this chapter.",
	"repealed": false
}