{
	"id": "260.755",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.755",
	"title": "260.755 DEFINITIONS.",
	"text": "As used in sections 260.751 to 260.835, the following terms have the meanings given them.\n(a) \"Active efforts\" means a rigorous and concerted level of effort to preserve the Indian child's family that is ongoing throughout the involvement of the child-placing agency or the petitioner with the Indian child. Active efforts require the engagement of the Indian child, the Indian child's parents, the Indian custodian, the extended family, and the Tribe in using the prevailing social and cultural values, conditions, and way of life of the Indian child's Tribe to: (1) preserve the Indian child's family; (2) prevent placement of an Indian child; (3) if placement occurs, to return the Indian child to the Indian child's family at the earliest possible time; and (4) where a permanent change in parental rights or custody is necessary, ensure the Indian child retains meaningful connections to the Indian child's family, extended family, and Tribe.\n(b) Active efforts for all Indian child placements includes this section and sections 260.012 and 260.762 and require a higher standard than reasonable efforts as defined in section 260.012 to preserve the family, prevent breakup of the family, and reunify the family. Active efforts are required for all Indian child placement proceedings and for all voluntary Indian child placements that involve a child-placing agency regardless of whether the reasonable efforts would have been relieved under section 260.012.\n\"Administrative review\" means review under section 260C.203.\n\"Best interests of an Indian child\" means compliance with the federal Indian Child Welfare Act and the Minnesota Indian Family Preservation Act to preserve and maintain an Indian child's family. The best interests of an Indian child support the Indian child's sense of belonging to family, extended family, and Tribe. The best interests of an Indian child are interwoven with the best interests of the Indian child's Tribe.\n(a) \"Child placement proceeding\" includes a judicial proceeding which could result in:\n(1) \"adoptive placement,\" meaning the permanent placement of an Indian child for adoption, including an action resulting in a final decree of adoption;\n(2) \"involuntary foster care placement,\" meaning an action removing an Indian child from the child's parents or Indian custodian for temporary placement in a foster home, institution, or the home of a guardian. The parent or Indian custodian cannot have the Indian child returned upon demand, but parental rights have not been terminated;\n(3) \"preadoptive placement,\" meaning the temporary placement of an Indian child in a foster home or institution after the termination of parental rights, before or instead of adoptive placement; or\n(4) \"termination of parental rights,\" meaning an action resulting in the termination of the parent-child relationship under section 260C.301.\n(b) The term child placement proceeding is a domestic relations proceeding that includes all placements where Indian children are placed away from the care, custody, and control of their parent or parents or Indian custodian that do not implicate custody between the parents. Child placement proceeding also includes any placement based upon juvenile status offenses but does not include a placement based upon an act which if committed by an adult would be deemed a crime, or upon an award of custody in a divorce proceeding to one of the parents.\n\"Child-placing agency\" means a public, private, or nonprofit legal entity: (1) providing assistance to an Indian child and the Indian child's parents or Indian custodian; or (2) placing an Indian child in foster care or for adoption on a voluntary or involuntary basis.\n\"Child placement\" means placement of an Indian child on a voluntary or involuntary basis in foster care, preadoptive placement, or adoption by a child-placing agency, parent, parents, Indian custodian, or individual.\n\"Commissioner\" means the commissioner of children, youth, and families.\n\"Custody\" means the physical or legal custody, or both, of an Indian child under any applicable Tribal law, Tribal custom, or state law. A party may demonstrate the existence of custody by looking to Tribal law, Tribal custom, or state law.\n\"Demand\" means a written and notarized statement signed by a parent or Indian custodian of an Indian child which requests the return of the Indian child who has been voluntarily placed in foster care.\n\"Emergency proceeding\" means and includes any court action that involves an emergency removal or emergency placement of an Indian child.\n\"Extended family member\" is as defined by the law or custom of the Indian child's Tribe or, in the absence of any law or custom of the Tribe, is a person who has reached the age of 18 and who is the Indian child's grandparent, aunt or uncle, brother or sister, brother-in-law or sister-in-law, niece or nephew, first or second cousin, or stepparent. For the purposes of provision of active efforts and foster care and permanency placement decisions, the legal parent, guardian, or custodian of the Indian child's sibling is not an extended family member or relative of an Indian child unless they are independently related to the Indian child or recognized by the Indian child's Tribe as an extended family member.\n\"Family-based services\" means intensive family-centered services to families primarily in their own home and for a limited time.\n\"Imminent physical damage or harm\" means that a child is threatened with immediate and present conditions that are life threatening or likely to result in abandonment, sexual abuse, or serious physical injury.\n\"Indian\" means a person who is a member of an Indian tribe or an Alaskan native and a member of a regional corporation as defined in section 7 of the Alaska Native Claims Settlement Act, United States Code, title 43, section 1606.\n\"Indian child\" means an unmarried person who is under age 18 and is:\n(1) a member of an Indian tribe; or\n(2) eligible for membership in an Indian tribe.\nA determination by a tribe that a child is a member of the Indian tribe or is eligible for membership in the Indian tribe is conclusive. For purposes of this chapter and chapters 256N, 260C, and 260D, Indian child also includes an unmarried person who satisfies either clause (1) or (2), is under age 21, and is in foster care pursuant to section 260C.451.\n\"Indian child's tribe\" means the Indian tribe in which an Indian child is a member or eligible for membership. In the case of an Indian child who is a member of or eligible for membership in more than one tribe, the Indian child's tribe is the tribe with which the Indian child has the most significant contacts. If that tribe does not express an interest in the outcome of the actions taken under sections 260.751 to 260.835 with respect to the child, any other tribe in which the child is eligible for membership that expresses an interest in the outcome may act as the Indian child's tribe.\n\"Indian custodian\" means an Indian person who has legal custody of an Indian child under tribal law or custom or under state law, or to whom temporary physical care, custody, and control has been transferred by the parent of the child.\n\"Indian organization\" means an organization providing child welfare services that is legally incorporated as a nonprofit organization, is registered with the secretary of state, and is governed by a board of directors having at least a majority of Indian directors.\n\"Indian tribe\" means an Indian tribe, band, nation, or other organized group or community of Indians recognized as eligible for the services provided to Indians by the secretary because of their status as Indians, including any Native group under the Alaska Native Claims Settlement Act, United States Code, title 43, section 1602.\nMS 2022 [Repealed, 2024 c 115 art 17 s 56]\n\"Parent\" means the biological parent of an Indian child or any person who has lawfully adopted an Indian child, including a person who has adopted an Indian child by Tribal law or custom. Parent includes a father as defined by Tribal law or custom. Parent does not include an unmarried father whose paternity has not been acknowledged or established. Paternity has been acknowledged when an unmarried father takes any action to hold himself out as the biological father of an Indian child.\n\"Permanency planning\" means the systematic process of carrying out, within a short time, a set of goal-oriented activities designed to help children live in families that offer continuity of relationships with nurturing parents or caretakers, and the opportunity to establish lifetime relationships.\n\"Petitioner\" means one or more individuals other than a parent or Indian custodian who has filed a petition or motion seeking a grant of temporary or permanent guardianship, custody, or adoption of an Indian child.\n\"Placement prevention and family reunification services\" means services designed to help children remain with their families or to reunite children with their parents.\n\"Public act\" means an act of legislation by a political body affecting the public as a whole.\nMS 2022 [Repealed, 2023 c 16 s 39]\n\"Qualified expert witness\" means an individual who meets the criteria in section 260.771, subdivision 6, paragraph (d), and provides testimony as required by the Indian Child Welfare Act of 1978, United States Code, title 25, section 1912, and the Minnesota Indian Family Preservation Act, regarding child placement or permanency proceedings relating to an Indian child.\n\"Reservation\" means Indian country as defined in United States Code, title 18, section 1151, and any lands which are either held by the United States in trust for the benefit of an Indian tribe or individual, or held by an Indian tribe or individual subject to a restriction by the United States against alienation.\n\"Secretary\" means the secretary of the United States Department of the Interior.\n\"Tribal court\" means a court with jurisdiction over child custody proceedings and which is either a court of Indian offenses, a court established and operated under the code or custom of an Indian Tribe, or any other administrative body of a Tribe which is vested with authority over child custody proceedings.\n\"Tribal representative\" means a representative designated by and acting on behalf of a Tribe in connection with an Indian child placement proceeding as defined in subdivision 3. It is not required that the designated representative be an attorney to represent the Tribe in these matters. An individual appearing as a Tribal representative on behalf of a Tribe and participating in a court proceeding under this chapter is not engaged in the unauthorized practice of law.\n\"Tribal social services agency\" means the unit under authority of the governing body of the Indian tribe which is responsible for human services.\n\"Voluntary foster care placement\" means a decision in which there has been participation by a child-placing agency resulting in the temporary placement of an Indian child away from the home of the Indian child's parents or Indian custodian in a foster home, institution, or the home of a guardian, and the parent or Indian custodian may have the Indian child returned upon demand.",
	"repealed": false
}