{
	"id": "524.2-120",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-120",
	"title": "524.2-120 CHILD CONCEIVED BY ASSISTED REPRODUCTION.",
	"text": "A parent-child relationship does not exist between a child of assisted reproduction and a third-party donor.\nA parent-child relationship exists between a child of assisted reproduction and the child's birth mother.\nExcept as otherwise provided in subdivision 9, a parent-child relationship exists between a child of assisted reproduction and the husband of the child's birth mother if the husband provided the sperm that the birth mother used during his lifetime for assisted reproduction.\nAn official birth record identifying a man as the other parent of a child of assisted reproduction presumptively establishes a parent-child relationship between the child and that man.\nExcept as otherwise provided in subdivisions 6, 8, and 9, and unless a parent-child relationship is established under subdivision 4, a parent-child relationship is presumed to exist between a child of assisted reproduction and a man who consented to assisted reproduction by the birth mother with intent to be treated as the other parent of the child. Consent to assisted reproduction by the birth mother with intent to be treated as the other parent of the child is established if the man:\n(1) before or after the child's birth, signed a record that, considering all the facts and circumstances, evidences the man's consent; or\n(2) in the absence of a signed record under clause (1):\n(i) functioned as the other parent of the child no later than two years after the child's birth; or\n(ii) intended to function as the other parent of the child no later than two years after the child's birth but was prevented from carrying out that intent by death, incapacity, or other circumstances, if that intent is established by clear and convincing evidence.\nFor the purpose of subdivision 5, clause (1), neither a man who signed a record more than two years after the birth of the child, nor a relative of that man who is not also a relative of the birth mother, inherits from or through the child unless the man functioned as a parent of the child before the child reached 18 years of age.\n(a) Paragraphs (b) and (c) apply to subdivision 5, clause (2).\n(b) If the birth mother is married and no divorce proceeding is pending, in the absence of clear and convincing evidence to the contrary, her spouse satisfies subdivision 5, clause (2), item (i) or (ii).\n(c) If the birth mother is a surviving spouse and at her deceased spouse's death no divorce proceeding was pending, in the absence of clear and convincing evidence to the contrary, her deceased spouse satisfies subdivision 5, clause (2), item (ii).\nIf a married couple is divorced before placement of eggs, sperm, or embryos, a child resulting from the assisted reproduction is not a child of the birth mother's former spouse, unless the former spouse consented in a record or such consent is established by clear and convincing evidence that if assisted reproduction were to occur after divorce, the child would be treated as the former spouse's child.\nIf, in a record or through clear and convincing evidence, a man withdraws consent to assisted reproduction before placement of eggs, sperm, or embryos, a child resulting from the assisted reproduction is not a child of that man, unless the man subsequently satisfies subdivision 4 or 5.\nNotwithstanding any other provision of this section and subject to section 524.2-108, a parent-child relationship does not exist between a child of assisted reproduction and another person unless the child of assisted reproduction is in gestation prior to the death of such person.",
	"repealed": false
}