{
	"id": "124E.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.11",
	"title": "124E.11 ADMISSION REQUIREMENTS AND ENROLLMENT.",
	"text": "(a) A charter school, including its preschool or prekindergarten program established under section 124E.06, subdivision 3, paragraph (b), may limit admission to:\n(1) pupils within an age group or grade level;\n(2) pupils who are eligible to participate in the graduation incentives program under section 124D.68; or\n(3) residents of a specific geographic area in which the school is located when the majority of students served by the school are members of underserved populations.\n(b) A charter school, including its preschool or prekindergarten program established under section 124E.06, subdivision 3, paragraph (b), must enroll an eligible pupil who submits a timely application, unless the number of applications exceeds the capacity of a program, class, grade level, or building. In this case, pupils must be accepted by lot. The charter school must develop and publish, including on its website, a lottery policy and process that it must use when accepting pupils by lot.\n(c) Admission to a charter school must be free to any eligible pupil who resides within the state. A charter school must give enrollment preference to a Minnesota resident pupil over pupils that do not reside in Minnesota. A charter school must require a pupil who does not reside in Minnesota to annually apply to enroll in accordance with paragraphs (a) to (f). A charter school must give enrollment preference to a sibling of an enrolled pupil and to a foster child of that pupil's parents and may give preference for enrolling children of the school's staff before accepting other pupils by lot. A staff member eligible for an enrollment preference for their child, including a foster child, must be an individual employed at the school whose employment is stipulated in advance to total at least 480 hours in a school calendar year. A charter school that is located in Duluth township in St. Louis County and admits students in kindergarten through grade 6 must give enrollment preference to students residing within a five-mile radius of the school and to the siblings of enrolled children.\n(d) A person may not be admitted to a charter school: (1) as a kindergarten pupil, unless the pupil is at least five years of age on September 1 of the calendar year in which the school year for which the pupil seeks admission commences; or (2) as a first grade student, unless the pupil is at least six years of age on September 1 of the calendar year in which the school year for which the pupil seeks admission commences or has completed kindergarten; except that a charter school may establish and publish on its website a policy for admission of selected pupils at an earlier age, consistent with the enrollment process in paragraphs (b) and (c).\n(e) Except as permitted in paragraphs (d) and (i), a charter school, including its preschool or prekindergarten program established under section 124E.06, subdivision 3, paragraph (b), may not limit admission to pupils on the basis of intellectual ability, measures of achievement or aptitude, or athletic ability and may not establish any criteria or requirements for admission that are inconsistent with this section.\n(f) The charter school or any agent of the school must not distribute any services or goods, payments, or other incentives of value to students, parents, or guardians as an inducement, term, or condition of enrolling a student in a charter school.\n(g) Once a student who resides in Minnesota is enrolled in the school in kindergarten through grade 12, or in the school's free preschool or prekindergarten program under section 124E.06, subdivision 3, paragraph (b), the student is considered enrolled in the school until the student formally withdraws, the school receives a request for the transfer of educational records from another school, the school receives a written election by the parent or legal guardian of the student withdrawing the student, or the student is expelled under the Pupil Fair Dismissal Act in sections 121A.40 to 121A.56.\n(h) A charter school with at least 90 percent of enrolled students who are eligible for special education services and have a primary disability of deaf or hard-of-hearing may enroll prekindergarten pupils with a disability under section 126C.05, subdivision 1, paragraph (a), and must comply with the federal Individuals with Disabilities Education Act under Code of Federal Regulations, title 34, section 300.324, subsection (2), clause (iv).\n(i) A charter school serving at least 90 percent of enrolled students who are eligible for special education services and have a primary disability of deaf, deafblind, or hard-of-hearing may give enrollment preference to students who are eligible for special education services and have a primary disability of deaf, deafblind, or hard-of-hearing. The charter school may not limit admission based on the student's eligibility for additional special education services.",
	"repealed": false
}