{
	"id": "270C.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.37",
	"title": "270C.37 TAXPAYER ASSISTANCE ORDERS; TAXPAYER'S RIGHTS ADVOCATE.",
	"text": "On application filed by a taxpayer with the Department of Revenue taxpayer's rights advocate, in the form, manner, and in the time prescribed by the commissioner, and after thorough investigation, the taxpayer's rights advocate may issue a taxpayer assistance order if, in the determination of the taxpayer's rights advocate, the manner in which a law administered by the commissioner is being carried out is creating or will create an unjust and inequitable result for the taxpayer.\nA taxpayer assistance order may require the department within a specified time period to release property of the taxpayer levied on, cease any action, take any action as permitted by law, or refrain from taking any action to enforce a law administered by the commissioner against the taxpayer, until the issue or issues giving rise to the order have been resolved.\nA taxpayer assistance order issued by the taxpayer's rights advocate under this section may be modified or rescinded by the commissioner.\nThe running of the period of limitation with respect to an action described in subdivision 2 is suspended from the date of the taxpayer assistance order until the expiration date of the order or, if modified, the expiration date of the modified order or, if rescinded, the date of the rescission.\nThis section does not prevent the taxpayer's rights advocate from taking action in the absence of an application under subdivision 1.\nFor purposes of this section, the term \"taxpayer's rights advocate\" includes a designee of the taxpayer's rights advocate. The taxpayer's rights advocate shall represent the interests of taxpayers who have grievances against the department in connection with an audit or collection activity, and shall report directly to the commissioner. A determination of the taxpayer's rights advocate under this section to issue or to not issue a taxpayer assistance order is final and cannot be appealed to the Tax Court or any other court.",
	"repealed": false
}