{
	"id": "144.999",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.999",
	"title": "144.999 EPINEPHRINE AUTO-INJECTOR.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Administer\" means the direct application of an epinephrine auto-injector to the body of an individual.\n(c) \"Authorized entity\" means entities that fall in the categories of recreation camps, colleges and universities, preschools and daycares, and any other category of entities or organizations that the commissioner authorizes to obtain and administer epinephrine auto-injectors without a prescription. This definition does not include a school covered under section 121A.2207.\n(d) \"Authorized individual\" means an individual who has successfully completed the training program under subdivision 5.\n(e) \"Commissioner\" means the commissioner of health.\n(f) \"Epinephrine auto-injector\" means a single-use device used for the automatic injection of a premeasured dose of epinephrine into the human body or another epinephrine delivery system approved by the United States Food and Drug Administration for public use.\n(g) \"Provide\" means to supply one or more epinephrine auto-injectors to an individual or the individual's parent, legal guardian, or caretaker.\nThe commissioner may identify additional categories of entities or organizations to be authorized entities if the commissioner determines that individuals may come in contact with allergens capable of causing anaphylaxis. Beginning July 1, 2016, the commissioner may annually review the categories of authorized entities and may authorize additional categories of authorized entities as the commissioner deems appropriate. The commissioner may contract with a vendor to perform the review and identification of authorized entities.\n(a) Notwithstanding section 151.37, an authorized entity or authorized individual may obtain and possess epinephrine auto-injectors to be provided or administered to an individual if, in good faith, an owner, manager, employee, or agent of an authorized entity or authorized individual believes that the individual is experiencing anaphylaxis regardless of whether the individual has a prescription for an epinephrine auto-injector. The administration of an epinephrine auto-injector in accordance with this section is not the practice of medicine.\n(b) An authorized entity or authorized individual may obtain epinephrine auto-injectors from pharmacies licensed as wholesale drug distributors pursuant to section 151.47. Prior to obtaining an epinephrine auto-injector, an owner, manager, or authorized agent of the entity or authorized individual must present to the pharmacy a valid certificate of training obtained pursuant to subdivision 5.\n(c) An authorized entity shall store epinephrine auto-injectors in a location readily accessible in an emergency and in accordance with the epinephrine auto-injector's instructions for use and any additional requirements that may be established by the commissioner. An authorized entity shall designate employees or agents who have completed the training program required under subdivision 5 to be responsible for the storage, maintenance, and control of epinephrine auto-injectors obtained and possessed by the authorized entity. The authorized individual shall be responsible for the storage, maintenance, and control of epinephrine auto-injectors obtained and possessed by the authorized individual.\n(a) An owner, manager, employee, or agent of an authorized entity or an authorized individual who has completed the training required under subdivision 5 may:\n(1) provide an epinephrine auto-injector for immediate administration to an individual or the individual's parent, legal guardian, or caregiver if the owner, manager, employee, agent, or the authorized individual believes, in good faith, the individual is experiencing anaphylaxis, regardless of whether the individual has a prescription for an epinephrine auto-injector or has previously been diagnosed with an allergy; or\n(2) administer an epinephrine auto-injector to an individual who the owner, manager, employee, agent, or authorized individual believes, in good faith, is experiencing anaphylaxis, regardless of whether the individual has a prescription for an epinephrine auto-injector or has previously been diagnosed with an allergy.\n(b) Nothing in this section shall be construed to require any authorized entity or authorized individual to maintain a stock of epinephrine auto-injectors.\n(c) The possession and administration of an epinephrine auto-injector at a public school shall be determined by the school district in accordance with sections 121A.2205 to 121A.2207.\n(a) In order to use an epinephrine auto-injector as authorized under subdivision 4, an individual must complete, every two years, an anaphylaxis training program conducted by a nationally recognized organization experienced in training laypersons in emergency health treatment, a statewide organization with experience providing training on allergies and anaphylaxis under the supervision of board-certified allergy medical advisors, or an entity or individual approved by the commissioner to provide an anaphylaxis training program. The commissioner may approve specific entities or individuals to conduct the training program or may approve categories of entities or individuals to conduct the training program. Training may be conducted online or in person and, at a minimum, must cover:\n(1) how to recognize signs and symptoms of severe allergic reactions, including anaphylaxis;\n(2) standards and procedures for the storage and administration of an epinephrine auto-injector; and\n(3) emergency follow-up procedures.\n(b) The entity or individual conducting the training shall issue a certificate to each person who successfully completes the anaphylaxis training program. The commissioner may develop, approve, and disseminate a standard certificate of completion. The certificate of completion shall be valid for two years from the date issued.\nAny act or omission taken pursuant to this section by any of the following entities or individuals shall be considered emergency care, advice, or assistance under section 604A.01: (1) an authorized entity that possesses and makes available epinephrine auto-injectors and its employees or agents; (2) an authorized individual who possesses, makes available, and administers epinephrine auto-injectors; (3) a pharmacy or manufacturer that dispenses epinephrine auto-injectors to an authorized entity or authorized individual; or (4) an individual or entity that conducts the training described in subdivision 5.",
	"repealed": false
}