{
	"id": "171.0705",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.0705",
	"title": "171.0705 DRIVER'S MANUAL.",
	"text": "(a) The commissioner shall include in each subsequent edition of the driver's manual published by the department a chapter relating to:\n(1) the effect of alcohol consumption on highway safety and on the ability of drivers to safely operate motor vehicles;\n(2) a summary of the laws of Minnesota on operating a motor vehicle while under the influence of alcohol or a controlled substance; and\n(3) the legal penalties and financial consequences resulting from violations of laws prohibiting the operation of a motor vehicle while under the influence of alcohol or drugs.\n(b) This chapter shall also include information on the dangers of driving at alcohol concentration levels below the legal limit for alcohol concentration, and specifically state that:\n(1) there is no \"safe\" level or amount of alcohol that an individual can assume will not impair one's driving performance or increase the risk of a crash;\n(2) a driver may be convicted of driving while impaired whether or not the driver's alcohol concentration exceeds the legal limit for alcohol concentration; and\n(3) a person under the legal drinking age may be convicted of illegally consuming alcohol if found to have consumed any amount of alcohol, and if that person was driving during or after the consumption of alcohol is subject to driver's license suspension.\nThe commissioner must include in the driver's manual published by the department a section relating to vulnerable road users and motorcyclists or operators of two- or three-wheeled vehicles that, at a minimum, includes:\n(1) bicycle traffic laws, including any changes in the law which affect bicycle traffic;\n(2) traffic laws related to pedestrians and pedestrian safety; and\n(3) traffic laws related to motorcycles, autocycles, motorized bicycles, motorized foot scooters, and electric personal assistive mobility devices.\nThe commissioner shall include in each edition of the driver's manual published by the department a section that includes up-to-date lifesaving information on carbon monoxide poisoning.\nThe commissioner shall include in each edition of the driver's manual published by the department a section relating to the circumstances under which a driver must stop to yield the right-of-way to a pedestrian in a crosswalk and the penalties for failure to yield.\nThe commissioner shall include in each edition of the driver's manual published by the department instructions relating to circumstances under which a driver of a motor vehicle should drive in the right-hand lane of a highway that is divided into more than one lane in the same direction of travel.\nThe commissioner shall include in each edition of the driver's manual published by the department a section relating to the criminal sanctions and forfeiture provisions applicable to persons who flee a peace officer in a motor vehicle.\nThe commissioner shall include in each edition of the driver's manual published by the department a section that includes information on awareness and safe interaction with commercial motor vehicle traffic.\nThe commissioner shall include in each edition of the driver's manual published by the department a section that includes information on the shortage of organs and tissues for transplant, basic facts about donation, use of the driver's license as an indication of donation intent, and the importance of informing family members of the driver's decision.\nThe commissioner shall include in each edition of the driver's manual published by the department a section relating to safe operation of vehicles at railroad grade crossings.\nThe commissioner shall include in each edition of the driver's manual a section relating to pupil transportation safety laws.\nThe commissioner must publish the driver's manual and study support materials for the written exam and skills exam. The study support materials must focus on the subjects and skills that are most commonly failed by exam takers. The commissioner must ensure that the driver's manual and study support materials are easily located and are available for no cost.",
	"repealed": false
}