{
	"id": "204B.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.16",
	"title": "204B.16 POLLING PLACES; DESIGNATION.",
	"text": "(a) By December 31 of each year, the governing body of each municipality and of each county with precincts in unorganized territory must designate by ordinance or resolution any changes to a polling place location. A polling place must be maintained unless changed in accordance with this paragraph, or:\n(1) pursuant to section 204B.175;\n(2) because a polling place has become unavailable;\n(3) because a township designates one location for all state, county, and federal elections and one location for all township only elections; or\n(4) pursuant to section 204B.14, subdivision 3.\n(b) Polling places must be designated and ballots must be distributed so that no one is required to go to more than one polling place to vote in a school district and municipal election held on the same day. The polling place for a precinct in a city or in a school district located in whole or in part in the metropolitan area defined by section 200.02, subdivision 24, shall be located within the boundaries of the precinct or within one mile of one of those boundaries unless a single polling place is designated for a city pursuant to section 204B.14, subdivision 2, or a school district pursuant to section 205A.11. The polling place for a precinct in unorganized territory may be located outside the precinct at a place which is convenient to the voters of the precinct. If no suitable place is available within a town or within a school district located outside the metropolitan area defined by section 200.02, subdivision 24, then the polling place for a town or school district may be located outside the town or school district within five miles of one of the boundaries of the town or school district.\nIf the location of a polling place has been changed, the governing body establishing the polling place shall send to every affected household with at least one registered voter in the precinct a nonforwardable mailed notice stating the location of the new polling place at least 25 days before the next election. The secretary of state shall prepare a sample of this notice. A notice that is returned as undeliverable must be forwarded immediately to the county auditor. This subdivision does not apply to a polling place location that is changed on election day under section 204B.175.\n[Repealed, 1994 c 607 s 7]\nThe designation of a polling place pursuant to this section shall remain effective until a different polling place is designated for that precinct. No designation of a new or different polling place shall become effective less than 90 days prior to an election, including school district elections or referenda, and no polling place changes may occur during the period between the state primary and the state general election, except that a new polling place may be designated to replace a polling place that has become unavailable for use.\nNo polling place shall be designated in any place where intoxicating liquors or nonintoxicating malt beverages are served or in any adjoining room. No polling place shall be designated in any place in which substantial compliance with the requirements of this chapter cannot be attained.\nEach polling place shall be accessible to and usable by elderly individuals and individuals with disabilities. A polling place is deemed to be accessible and usable if it complies with the standards in paragraphs (a) to (f).\n(a) At least one set of doors must have a minimum width of 32 inches if the doors must be used to enter or leave the polling place.\n(b) Any curb adjacent to the main entrance to a polling place must have curb cuts or temporary ramps. Where the main entrance is not the accessible entrance, any curb adjacent to the accessible entrance must also have curb cuts or temporary ramps.\n(c) Where the main entrance is not the accessible entrance, a sign shall be posted at the main entrance giving directions to the accessible entrance.\n(d) At least one set of stairs must have a temporary handrail and ramp if stairs must be used to enter or leave the polling place.\n(e) No barrier in the polling place may impede the path of persons with disabilities to the voting booth.\n(f) At least one parking space for persons with disabilities, which may be temporarily so designated by the municipality for the day of the election, must be available near the accessible entrance.\nThe doorway, handrails, ramps, and disabled parking provided pursuant to this subdivision must conform to the standards specified in the State Building Code for accessibility by persons with disabilities.\nA governing body shall designate as polling places only those places which meet the standards prescribed in this subdivision unless no available place within a precinct is accessible or can be made accessible.\nEvery statutory city, home rule charter city, county, town, school district, and other public agency, including the University of Minnesota and other public colleges and universities, shall make their facilities, including parking, available for the holding of city, county, school district, state, and federal elections, subject to the approval of the local election official. A charge for the use of the facilities may be imposed in an amount that does not exceed the lowest amount charged to any public or private group.\nThe facilities provided in accordance with subdivision 6 shall be sufficient in size to accommodate all election activities and the requirements of subdivision 5. The space must be separated from other activities within the building. The local election official may approve space in two connecting rooms for registration and balloting activities. Except in the event of an emergency making the approved space unusable, the public facility may not move the election from the space approved by the local election official without prior approval. In addition to the requirements of subdivision 5, the public facility must make remaining parking spaces not in use for regularly scheduled activities available for voters.",
	"repealed": false
}