{
	"id": "136F.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.38",
	"title": "136F.38 WORKFORCE DEVELOPMENT SCHOLARSHIPS.",
	"text": "The board shall develop a scholarship program to incentivize new students and students returning from the workforce to enter high-demand occupations upon graduation.\nThe program shall award scholarships at the beginning of an academic term, in the amount of $2,500, to be distributed evenly between two terms.\n(a) Scholarships shall be awarded only to a student eligible for resident tuition, as defined in section 135A.043, who is enrolled in any of the following programs of study or certification: (1) advanced manufacturing; (2) agriculture; (3) health care services; (4) information technology; (5) early childhood; (6) transportation; (7) construction; (8) education; (9) public safety; (10) energy; or (11) a program of study under paragraph (b).\n(b) Each institution may add one additional area of study or certification, based on a workforce shortage for full-time employment requiring postsecondary education that is unique to the institution's specific region, as reported in the most recent Department of Employment and Economic Development job vacancy survey data for the economic development region in which the institution is located. A workforce shortage area is one in which the job vacancy rate for full-time employment in a specific occupation in a region is higher than the state average vacancy rate for that same occupation. The institution may change the area of study or certification based on new data once every two years.\n(c) The student must be enrolled for at least nine credits in a two-year college in the Minnesota State Colleges and Universities system to be eligible for first- and second-year scholarships.\n(d) The student is eligible for a one-year transfer scholarship if the student transfers from a two-year college after two or more terms, and the student is enrolled for at least nine credits in a four-year university in the Minnesota State Colleges and Universities system.\nA student who has received a scholarship may apply again but total lifetime awards are not to exceed $7,500 per student. Students may only be awarded a second scholarship upon completion of two academic terms. Students may be awarded a third scholarship if the student transfers to a corresponding program at a Minnesota state university.\n(a) The board shall establish an application process and other guidelines for implementing this program.\n(b) The board shall give preference to students in financial need.\nBeginning in 2020, and each year thereafter, the board shall withhold ten percent of the appropriation. The withheld funds must be distributed in the following year to institutions that successfully leverage private matching funds from local businesses, resulting in additional scholarships by partnering with the local business community.\nThe board must submit an annual report by February 1 of each year about the scholarship awards to the chairs and ranking minority members of the senate and house of representatives committees with jurisdiction over higher education finance and policy. The first report is due no later than February 1, 2019. The annual report shall describe the following:\n(1) the number of students receiving a scholarship at each two-year college and each university during the previous fiscal year;\n(2) the number of scholarships awarded for each program of study or certification described in subdivision 3, paragraph (a);\n(3) the number of scholarship recipients who completed a program of study or certification described in subdivision 3, paragraph (a);\n(4) the number of scholarship recipients who secured employment by their graduation date and those who secured employment within three months of their graduation date;\n(5) a list of the institutions that received funding under subdivision 5a, the amount of funding each institution received, and whether all withheld funds were distributed;\n(6) a list of occupations scholarship recipients are entering; and\n(7) the number of students who were denied a scholarship.",
	"repealed": false
}