{
	"id": "144A.752",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.752",
	"title": "144A.752 REGULATION OF HOSPICE CARE.",
	"text": "The commissioner shall adopt rules for the regulation of hospice providers according to sections 144A.75 to 144A.755. The rules shall include the following:\n(1) provisions to ensure, to the extent possible, the health, safety, well-being, and appropriate treatment of persons who receive hospice care;\n(2) requirements that hospice providers furnish the commissioner with specified information necessary to implement sections 144A.75 to 144A.755;\n(3) standards of training of hospice provider personnel;\n(4) standards for medication management, which may vary according to the nature of the hospice care provided, the setting in which the hospice care is provided, or the status of the patient;\n(5) standards for hospice patient and hospice patient's family evaluation or assessment, which may vary according to the nature of the hospice care provided or the status of the patient; and\n(6) requirements for the involvement of a patient's physician, advanced practice registered nurse, or physician assistant; documentation of physicians', advanced practice registered nurses', or physician assistants' orders, if required, and the patient's hospice plan of care; and maintenance of accurate, current clinical records.\n(a) The commissioner shall:\n(1) evaluate, monitor, and license hospice providers according to sections 144A.75 to 144A.755;\n(2) inspect the office and records of a hospice provider during regular business hours without advance notice to the hospice provider;\n(3) with the consent of the patient, visit the home where services are being provided;\n(4) issue correction orders and assess civil penalties according to section 144.653, subdivisions 5 to 8, for violations of sections 144A.75 to 144A.755 or rules adopted thereunder; and\n(5) take other action reasonably required to accomplish the purposes of sections 144A.75 to 144A.755.\n(b) In the exercise of the authority granted under this section, the commissioner shall comply with the applicable requirements of the Government Data Practices Act, the Administrative Procedure Act, and other applicable law.\nIn the exercise of the authority granted under sections 144A.75 to 144A.755, the commissioner shall not duplicate or replace standards and requirements imposed under another regulatory program of the state. The commissioner shall not impose additional training or education requirements upon members of a licensed or registered occupation or profession, except as necessary to address or prevent problems that are unique to the delivery of hospice care or to enforce and protect the rights of patients listed under section 144A.751. The commissioner shall not require a hospice care provider certified under the Medicare program and surveyed and enforced by the Minnesota Department of Health, to comply with a rule adopted under this section if the hospice provider is required to comply with any equivalent federal law or regulation relating to the same subject matter. The commissioner shall specify in the rules those provisions that are not applicable to certified hospice providers.\nCertification by the federal Medicare program must not be a requirement of Medicaid payment for room and board services delivered in a residential hospice facility.",
	"repealed": false
}