{
	"id": "256C.233",
	"url": "https://www.revisor.mn.gov/statutes/cite/256C.233",
	"title": "256C.233 DUTIES OF STATE AGENCIES.",
	"text": "The commissioners of commerce, education, employment and economic development, and health shall partner with the commissioner of human services on the interagency activities of the Deaf, DeafBlind, and Hard of Hearing State Services Division. This division provides services for persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing through a statewide network of programs, services, and supports. This division also advocates on behalf of and provides information and training about how to best serve persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing. The commissioner of human services shall coordinate the work of the interagency partners, receive legislative appropriations for the division, and provide grants through the division for programs, services, and supports for persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing in identified areas of need such as deafblind services, family services, interpreting services, and mental health services.\nThe Deaf, DeafBlind, and Hard of Hearing State Services Division shall:\n(1) establish and maintain a statewide network of regional culturally and linguistically affirmative services for Minnesotans who are deaf, Minnesotans who are deafblind, and Minnesotans who are hard-of-hearing;\n(2) work across divisions within the Department of Human Services, as well as with other agencies and counties, to ensure that there is an understanding of:\n(i) the communication access challenges faced by persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing;\n(ii) the best practices for accommodating and addressing communication access challenges; and\n(iii) the legal requirements for providing access to and effective communication with persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing;\n(3) assess the supply and demand statewide for interpreting services and real-time captioning services, implement strategies to provide greater access to these services in areas without sufficient supply, and partner with interpreting service providers and real-time captioning service providers across the state;\n(4) maintain a statewide information resource that includes contact information and professional certifications of interpreting service providers and real-time captioning service providers;\n(5) provide culturally and linguistically affirmative mental health services to persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing who:\n(i) use a visual language such as American Sign Language, another sign language, or a tactile form of a visual language; or\n(ii) otherwise need culturally and linguistically affirmative mental health services;\n(6) research and develop best practices and recommendations for emerging issues; and\n(7) provide as much information as practicable on the division's stand-alone website in American Sign Language.\nThe commissioner of health shall establish standards for screening for hearing loss with special emphasis on screening of persons from birth through school age and persons over age 65.\n[Repealed, 1Sp2017 c 6 art 1 s 54]",
	"repealed": false
}