{
	"id": "181.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.03",
	"title": "181.03 CERTAIN ACTS RELATING TO PAYMENT OF WAGES UNLAWFUL.",
	"text": "An employer may not, directly or indirectly and with intent to defraud:\n(1) cause any employee to give a receipt for wages for a greater amount than that actually paid to the employee for services rendered;\n(2) directly or indirectly demand or receive from any employee any rebate or refund from the wages owed the employee under contract of employment with the employer; or\n(3) in any manner make or attempt to make it appear that the wages paid to any employee were greater than the amount actually paid to the employee.\nExcept as otherwise provided in section 181.13, an employer or a person, firm, corporation, or association may not alter the method of payment, timing of payment, or procedures for payment of commissions earned through the last day of employment after the employee has resigned or been terminated if the result is to delay or reduce the amount of payment.\nAn employer who violates this section is liable in a civil action brought by the employee for twice the amount in dispute.\nThe use of an enforcement provision in this section shall not preclude the use of any other enforcement provision provided by law.\nNothing in this section shall be construed to limit the application of other state or federal laws.\nAn employer shall not discharge, discipline, penalize, interfere with, threaten, restrain, coerce, or otherwise retaliate or discriminate against an employee for asserting rights or remedies under this section, sections 177.21 to 177.44, 181.01 to 181.723, or 181.79, including, but not limited to, filing a complaint with the department or telling the employer of the employee's intention to file a complaint. In addition to any other remedies provided by law, an employer who violates this subdivision is liable for a civil penalty of not less than $700 nor more than $3,000 per violation.",
	"repealed": false
}