{
	"id": "626.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.085",
	"title": "626.085 SEARCH WARRANT REQUIRED FOR ELECTRONIC COMMUNICATION INFORMATION.",
	"text": "As used in this section, the following terms have the meanings given them:\n(1) \"electronic communication\" means the transfer of signs, signals, writings, images, sounds, data, or intelligence of any nature in whole or in part by a wire, radio, electromagnetic, photoelectric, or photo-optical system;\n(2) \"electronic communication information\" means any information about an electronic communication or the use of an electronic communication service, limited to the contents of electronic communications and precise or approximate location of the sender or recipients at any point during the communication;\n(3) \"electronic communication service\" has the meaning given in section 626A.01, subdivision 17; and\n(4) \"government entity\" has the meaning given in section 626A.42, subdivision 1, paragraph (d).\n(a) Except as provided in paragraph (b), a government entity must obtain a search warrant to require disclosure of electronic communication information.\n(b) A government entity may request disclosure of electronic communication information without a search warrant if the agency has valid consent from one authorized to give it, or exigent circumstances exist where there is a danger to the life or physical safety of an individual.\nA government entity accessing electronic communication information under subdivision 2 must provide notice to the subject of the information consistent with the requirements of subdivision 4 and section 626.16.\n(a) Within a reasonable time but not later than 90 days after the court unseals the search warrant under this subdivision, the issuing or denying judge shall cause to be served on the persons named in the warrant and the application an inventory which shall include notice of:\n(1) the issuance of the warrant or the application;\n(2) the date of issuance and the period of authorized, approved, or disapproved collection of electronic communication information, or the denial of the application; and\n(3) whether electronic communication information was or was not collected during the period.\n(b) A search warrant authorizing collection of electronic communication information must direct that:\n(1) the warrant be sealed for a period of 90 days or until the objective of the warrant has been accomplished, whichever is shorter; and\n(2) the warrant be filed with the court administrator within ten days of the expiration of the warrant.\n(c) The prosecutor may request that the search warrant, supporting affidavits, and any order granting the request not be filed. An order must be issued granting the request in whole or in part if, from affidavits, sworn testimony, or other evidence, the court finds reasonable grounds exist to believe that filing the warrant may cause the search or a related search to be unsuccessful, create a substantial risk of injury to an innocent person, or severely hamper an ongoing investigation.\n(d) The search warrant must direct that following the commencement of any criminal proceeding utilizing evidence obtained in or as a result of the search, the supporting application or affidavit must be filed either immediately or at any other time as the court directs. Until the filing, the documents and materials ordered withheld from filing must be retained by the judge or the judge's designee.\n(a) At the same time as notice is provided according to the requirements of subdivision 4, the issuing or denying judge shall report to the state court administrator:\n(1) that a warrant was applied for under this section;\n(2) whether the warrant was granted as applied for, was modified, or was denied;\n(3) the period of collection of electronic communication information authorized by the warrant, and the number and duration of any extensions of the warrant;\n(4) the offense specified in the warrant or application or extension of a warrant; and\n(5) the identity of the applying investigative or peace officer and agency making the application and the person authorizing the application.\n(b) On or before November 15 of each even-numbered year, the state court administrator shall transmit to the legislature a report concerning: (1) all warrants authorizing the collection of electronic communication information during the two previous calendar years; and (2) all applications that were denied during the two previous calendar years. Each report shall include a summary and analysis of the data required to be filed under this section. The report is public and must be available for public inspection at the Legislative Reference Library and the state court administrator's office and website.\n(c) Nothing in this section prohibits or restricts a service provider from producing an annual report summarizing the demands or requests it receives under this section.",
	"repealed": false
}