{
	"id": "368.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/368.85",
	"title": "368.85 FIRE PROTECTION.",
	"text": "A town may, by resolution adopted by the town board and approved by a majority of the electors residing within the territory affected, establish a special fire protection district within the town in the following manner. The town board shall adopt a resolution particularly describing the territory, district or area which shall constitute a special fire protection district and be entitled to receive fire protection to be paid for from the taxation of the property within the district. Each district shall consist of contiguous and compact territory and be constituted so that at least 25 percent of the total net tax capacity of taxable real property in it consists of property classified as homestead property and buildings or other structures.\nThe resolution shall provide for the submission of the question whether the special fire protection district shall be established to the voters residing within the proposed district at the next annual town meeting or at a special town meeting which the town board may call for that purpose. The notice of the annual or special meeting shall contain a notice that the question will be submitted to the electors residing in the proposed district and a statement that all cost of fire protection for the district will be borne by a tax on the property in it. The meeting shall be held at the usual place of holding town meetings.\nFor the election the town board shall provide a separate ballot box where the electors residing within the proposed district shall deposit their ballots. Only electors residing in the proposed district may vote on the question.\nThe town board shall provide ballots which shall read \"Shall the territory described in the resolution adopted by the town board on the ......... day of............., ......., constitute a special fire protection district?\" The question shall be followed with a line with the word \"Yes\" and an oval or similar target shape after it and another line with the word \"No\" and an oval or similar target shape after it. The voters shall indicate their choice by placing a mark in one of the target shapes, and a direction to so indicate their choice shall be printed on the ballot.\nThe votes cast at the special election in the special ballot box shall be counted and canvassed by the town board or by the judges presiding at the election. If the proposition receives a majority of the votes cast by the electors residing within the proposed district, that result shall be recorded in the minutes of the meeting, and the territory described in the town board's resolution shall then be a special fire protection district.\nThe town board shall annually levy a tax in an amount necessary on the net tax capacity of all property located within the district to provide fire protection for it. The tax, with a certified copy of the resolution establishing the district, shall be certified by the town board to the county auditor who shall spread the tax against the property located within the district. The tax shall be collected as other taxes.\nWhen the tax is collected, it shall be paid to the town and disbursed upon the order of the town board to provide fire protection in the district. The town board may order the money, or part of it, to be paid to a municipality or volunteer fire department which agrees to furnish and has its fire department headquarters located so as to be able to conveniently furnish fire protection to the property within the district.\nMore than one special fire protection district may be established in a town. Districts shall be designated by consecutive numbers in the order of their establishment.\nA special fire protection district may be dissolved in the following manner. The town board may submit the question of dissolution of a district at any annual town meeting. It must submit that question at the next annual town meeting on the signed petition of electors residing in the district equal in number to at least one-half of the number of landowners in the district according to the tax record in the county auditor's office filed with the town clerk not less than 45 days before the annual meeting. Notice that the question will be submitted shall be posted by the town clerk in three public places within the special district not less than two weeks before the annual meeting at which it will be submitted. Only voters residing in the district shall vote on the question of dissolution. A separate ballot box shall be provided for votes on the question. The town board shall provide ballots for the question of dissolution which shall be in the same form as provided in subdivision 4 except that the question shall be \"Shall Special Fire Protection District No. ..... be dissolved?\". If a majority vote of those voting on the question vote in the affirmative, the district shall be dissolved. In that event the results of the election shall be certified by the chair of the town board to the county auditor. There shall be no further special levy for fire protection in the district, but dissolution shall not relieve the property in the special district from any taxes levied under this section before dissolution.",
	"repealed": false
}