{
	"id": "353D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/353D.02",
	"title": "353D.02 ELECTION OF COVERAGE.",
	"text": "Eligible elected or appointed local government officials may elect to participate in the defined contribution plan within the first 30 days of being elected or appointed to public office by filing a membership application on a form prescribed by the executive director of the association authorizing contributions to be deducted from the official's salary. Participation begins on the first day of the pay period for which the contributions were deducted or, if pay period coverage dates are not provided, the date on which the membership application or contributions are received in the office of the association, whichever is received first, provided further that the membership application is received by the association within 60 days of the receipt of the contributions. An election to participate in the plan is irrevocable.\nEligible physicians may elect to participate in the defined contribution plan within the first 30 days of commencing employment with a government subdivision under section 353.01, subdivision 6, by filing a membership application on a form prescribed by the executive director of the association authorizing contributions to be deducted from the physician's salary. Participation begins on the first day of the pay period for which the contributions were deducted. An election to participate in the defined contribution plan is irrevocable.\nEach public ambulance service with eligible personnel may elect to participate in the plan. If a service elects to participate, its eligible personnel may elect to participate or decline to participate. An individual's election must be made within 30 days of the service's election to participate or within 30 days of the date on which the individual began employment with the service or began to provide service for it, whichever date is later. An election by a service or an individual is irrevocable.\nThe municipality or county, as applicable, associated with a rescue squad under section 353D.01, subdivision 2, paragraph (a), clause (4), may elect to participate in the plan. If the municipality or county, as applicable, elects to participate, the eligible personnel may elect to participate or decline to participate. An eligible individual's election must be made within 30 days of the service's election to participate or within 30 days of the date on which the individual first began employment with the rescue squad, whichever is later. Elections under this subdivision by a government unit or individual are irrevocable. The municipality or county, as applicable, must specify by resolution eligibility requirements for rescue squad personnel which must be satisfied if the individual is to be authorized to make the election under this subdivision.\nEmployees of the Port Authority of the city of St. Paul who do not elect to participate in the general employees retirement plan may elect within the first 30 days of commencing employment to participate in the plan by filing a membership application on a form prescribed by the executive director of the association authorizing contributions to be deducted from the employee's salary. Participation begins on the first day of the pay period for which the contributions were deducted or, if pay period coverage dates are not provided, the date on which the membership application or the contributions are received in the office of the association, whichever is received first, if the membership application is received by the association within 60 days of the receipt of the contributions. An election to participate in the plan is irrevocable.\nCity managers who elected to be excluded from the general employees retirement plan of the Public Employees Retirement Association under section 353.028, and who elected to participate in the plan under section 353.028, subdivision 3, paragraph (b), must file that election with the executive director within the first 30 days of commencing employment. Participation begins on the first day of the pay period next following the date of the coverage election. An election to participate by a city manager is irrevocable.\nVolunteer or on-call firefighters who are serving as members of a municipal fire department or an independent nonprofit firefighting corporation and who are not covered for that firefighting service by the public employees police and fire retirement plan under sections 353.63 to 353.68, by a firefighters relief association under chapter 424A, or by the statewide volunteer firefighter retirement plan under chapter 353G may elect to participate in the plan within the first 30 days of commencing service. An eligible firefighter's election is irrevocable. No employer contribution is payable by the fire department or the firefighting corporation unless the municipal governing body or the firefighting corporation governing body, whichever applies, ratifies the election.\nNotwithstanding any other provisions under this section, an election under this section is available to eligible participants only within the first 30 days of commencing employment or service with the governmental subdivision. If the eligible participant has previously been or is currently in a position covered by any retirement plan administered by the association to which the governmental subdivision contributed or by any supplemental pension or deferred compensation plan under section 356.24 sponsored by the governmental subdivision, then the eligible participant must not receive an election.",
	"repealed": false
}