{
	"id": "257.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.34",
	"title": "257.34 DECLARATION OF PARENTAGE.",
	"text": "The mother and father of a child born to a mother who was not married to the child's father when the child was conceived nor when the child was born may, in a writing signed by both of them before a notary public, declare and acknowledge under oath that they are the biological parents of the child. The declaration may provide that any such child born to the mother at any time before or up to ten months after the date of execution of the declaration is the biological child of the signatories. Execution of the declaration shall:\n(a) have the same consequences as an acknowledgment by the signatories of parentage of the child for the purposes of sections 62A.041 and 62C.14, subdivision 5a;\n(b) be conclusive evidence that the signatories are parents of the child for the purposes of sections 176.111, 197.75, and 197.752;\n(c) create a presumption that the signatory is the biological father of the child for the purposes of sections 257.51 to 257.74;\n(d) when timely filed with the Department of Health as provided in section 259.52, qualify as an affidavit stating the intention of the signatories to retain parental rights as provided in section 259.52 if it contains the information required by section 259.52 or rules promulgated thereunder;\n(e) have the same consequences as a writing declaring paternity of the child for the purposes of section 524.2-109; and\n(f) be conclusive evidence that the signatories are parents of the child for the purposes of chapter 573.\n[Repealed, 1987 c 403 art 3 s 98]\nThe declaration authorized by subdivision 1 shall not affect the rights or duties arising out of a parent-child relationship of any person not a signatory to the declaration claiming to be the parent of the child nor shall the declaration impair any rights of the child arising out of a parent-child relationship against any person not a signatory to the declaration.\nNo acknowledgment of parentage shall be entered into on or after August 1, 1995, under this section. The mother and father of a child born to a mother who was not married to the child's father when the child was conceived nor when the child was born may before, on, or after August 1, 1995, sign a recognition of parentage under section 257.75.",
	"repealed": false
}