{
	"id": "62Q.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.01",
	"title": "62Q.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given.\n\"Affordable Care Act\" means the Affordable Care Act as defined in section 62A.011, subdivision 1a.\n\"Bona fide association\" means an association that meets all of the following criteria:\n(1) serves a single profession that requires a significant amount of education, training, or experience, or a license or certificate from a state authority to practice that profession;\n(2) has been actively in existence for five years;\n(3) has a constitution and bylaws or other analogous governing documents;\n(4) has been formed and maintained in good faith for purposes other than obtaining insurance;\n(5) is not owned or controlled by a health plan company or affiliated with a health plan company;\n(6) does not condition membership in the association on any health status-related factor;\n(7) has at least 1,000 members if it is a national association, 500 members if it is a state association, or 200 members if it is a local association;\n(8) all members and dependents of members are eligible for coverage regardless of any health status-related factor;\n(9) does not make health plans offered through the association available other than in connection with a member of the association;\n(10) is governed by a board of directors and sponsors an annual meeting of its members; and\n(11) produces only market association memberships, accepts applications for membership, or signs up members in the professional association where the subject individuals are actively engaged in, or directly related to, the profession represented by the association.\n\"Commissioner\" means the commissioner of health for purposes of regulating health maintenance organizations, and community integrated service networks, or the commissioner of commerce for purposes of regulating all other health plan companies. For all other purposes, \"commissioner\" means the commissioner of health.\nMS 2012 [Renumbered subd 2b]\n\"Dependent child to the limiting age\" or \"dependent children to the limiting age\" means those individuals who are eligible and covered as a dependent child under the terms of a health plan who have not yet attained 26 years of age. A health plan company must not deny or restrict eligibility for a dependent child to the limiting age based on financial dependency, residency, marital status, or student status. For coverage under plans offered by the Minnesota Comprehensive Health Association, dependent to the limiting age means dependent as defined in section 62A.302, subdivision 3. Notwithstanding the provisions in this subdivision, a health plan may include:\n(1) eligibility requirements regarding the absence of other health plan coverage as permitted by the Affordable Care Act for grandfathered plan coverage; or\n(2) an age greater than 26 in its policy, contract, or certificate of coverage.\n\"Enrollee\" means a natural person covered by a health plan and includes an insured, policyholder, subscriber, contract holder, member, covered person, or certificate holder.\n\"Grandfathered plan\" means a health plan as defined in section 62A.011, subdivision 1b.\n\"Group health plan\" means a group health plan as defined in section 62A.011, subdivision 1c.\n\"Health plan\" means a health plan as defined in section 62A.011 or a policy, contract, or certificate issued by a community integrated service network.\n\"Health plan company\" means:\n(1) a health carrier as defined under section 62A.011, subdivision 2; or\n(2) a community integrated service network as defined under section 62N.02, subdivision 4a.\n\"High deductible health plans\" means those health coverage plans issued by a health plan company as defined under the provisions of sections 220 and 223 of the Internal Revenue Code of 1986, and implementing regulations.\n\"Individual health plan\" means an individual health plan as defined in section 62A.011, subdivision 4.\n\"Life-threatening condition\" means a disease or condition from which the likelihood of death is probable unless the course of the disease or condition is interrupted.\n\"Managed care organization\" means: (1) a health maintenance organization operating under chapter 62D; (2) a community integrated service network as defined under section 62N.02, subdivision 4a; or (3) an insurance company licensed under chapter 60A, nonprofit health service plan corporation operating under chapter 62C, fraternal benefit society operating under chapter 64B, or any other health plan company, to the extent that it covers health care services delivered to Minnesota residents through a preferred provider organization or a network of selected providers.\n\"Medicare-related coverage\" means a policy, contract, or certificate issued as a supplement to Medicare, regulated under sections 62A.3099 to 62A.44, including Medicare select coverage; policies, contracts, or certificates that supplement Medicare issued by health maintenance organizations; or policies, contracts, or certificates governed by sections 1833 (known as \"cost\" or \"HCPP\" contracts), 1851 to 1859 (Medicare Advantage), 1860D (Medicare Part D), or 1876 (known as \"TEFRA\" or \"risk\" contracts) of the federal Social Security Act, United States Code, title 42, section 1395, et seq., as amended; or Section 4001 of the Balanced Budget Act of 1997 (BBA)(Public Law 105-33), Sections 1851 to 1859 of the Social Security Act establishing Part C of the Medicare program, known as the \"Medicare Advantage program.\"\n\"Nonquantitative treatment limitations\" or \"NQTLs\" means processes, strategies, or evidentiary standards, or other factors that are not expressed numerically, but otherwise limit the scope or duration of benefits for treatment. NQTLs include but are not limited to:\n(1) medical management standards limiting or excluding benefits based on (i) medical necessity or medical appropriateness, or (ii) whether the treatment is experimental or investigative;\n(2) formulary design for prescription drugs;\n(3) health plans with multiple network tiers;\n(4) criteria and parameters for provider inclusion in provider networks, including credentialing standards and reimbursement rates;\n(5) health plan methods for determining usual, customary, and reasonable charges;\n(6) fail-first or step therapy protocols;\n(7) exclusions based on failure to complete a course of treatment;\n(8) restrictions based on geographic location, facility type, provider specialty, and other criteria that limit the scope or duration of benefits for services provided under the health plan;\n(9) in-network and out-of-network geographic limitations;\n(10) standards for providing access to out-of-network providers;\n(11) limitations on inpatient services for situations where the enrollee is a threat to self or others;\n(12) exclusions for court-ordered and involuntary holds;\n(13) experimental treatment limitations;\n(14) service coding;\n(15) exclusions for services provided by clinical social workers; and\n(16) provider reimbursement rates, including rates of reimbursement for mental health and substance use disorder services in primary care.\n\"No Surprises Act\" means Division BB of the Consolidated Appropriations Act, 2021, which amended Title XXVII of the Public Health Service Act, Public Law 116-260, and any amendments to and any federal guidance or regulations issued under this act.\n\"Primary care provider\" means a health care professional who specializes in the practice of family medicine, general internal medicine, obstetrics and gynecology, or general pediatrics and is a licensed physician, a licensed and certified advanced practice registered nurse, or a licensed physician assistant.",
	"repealed": false
}