{
	"id": "103D.271",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.271",
	"title": "103D.271 PROCEDURE FOR TERMINATING WATERSHED DISTRICT.",
	"text": "A watershed district may be terminated under this section and a watershed district entirely within the metropolitan area may also be terminated under sections 103B.221 and 103B.225.\nProceedings for the termination of a watershed district may only be initiated by filing a termination petition with the board.\nThe board may not accept a termination petition within five years from the date of a watershed district's establishment. The board may not make determinations or accept termination petitions for watershed districts more than once in five years.\n(a) The termination petition must be signed by at least 25 percent of the resident owners residing in the watershed district. The termination petition must state that the existence of the watershed district does not benefit the public welfare and public interest and the watershed district is not needed to accomplish the purposes of this chapter.\n(b) The petitioners must file a copy of the termination petition with the auditors of the counties affected by the watershed district. The original termination petition with a statement signed for delivery or receipt of each of the termination petitions submitted to the auditors of counties affected by the watershed district must be filed with the board.\nAn auditor who receives a termination petition must determine from the tax records whether the petitioners are resident owners within the watershed district. The auditor must certify the number of petitioners that are resident owners and file the certification with the board.\n[Repealed, 2006 c 281 art 3 s 20]\nWhen the board determines a termination petition has been filed that meets the requirements of subdivisions 4 and 5, the board must, by order within 35 days of its determination, set a time and location within the watershed district for a termination hearing or, if publicly accessible facilities are not available within the watershed district, at the nearest suitable publicly accessible facility. The board must have each manager of the watershed district personally served with a copy of the order.\n(a) The board must give notice of the termination hearing by publication in a legal newspaper that is published in counties affected by the watershed district. The last publication must occur at least ten days before the termination hearing.\n(b) The board must give notice of the termination hearing by mail to the auditors of counties and to the chief executive officials of municipalities affected by the watershed district.\n(c) The notice must include:\n(1) a statement that a termination petition has been filed with the board and auditors of the counties affected by the watershed district;\n(2) a general description of why the watershed district is to be terminated;\n(3) a general description of the property within the watershed district;\n(4) the date, time, and location of the hearing; and\n(5) a statement that all persons affected by or interested in the watershed district may attend and give statements at the termination hearing.\nThe board must allow all persons affected by or interested in the watershed district to make oral and written statements at the termination hearing. The board may continue the termination hearing.\n(a) If, after the termination hearing, the board determines that the existence of the watershed district does not benefit the public welfare and public interest and the watershed district is not needed to accomplish the purpose of this chapter, the board must issue a termination order.\n(b) The termination order must include findings that support termination of the watershed district and a statement that the watershed district is terminated.\n(c) The board must file a certified copy of the termination order with the secretary of state.\n(d) A watershed district ceases to be a political subdivision and ceases to exist when a termination order for the watershed district is filed with the secretary of state.",
	"repealed": false
}