{
	"id": "256R.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.12",
	"title": "256R.12 COST ALLOCATION.",
	"text": "All costs that can be directly identified with a specific nursing facility that is a related organization to the central, affiliated, or corporate office, or that is controlled by the central, affiliated, or corporate office under a management agreement, must be allocated to that nursing facility.\nAll costs that can be directly identified with any other activity or function not described in subdivision 1 must be allocated to that activity or function.\n(a) Costs that have not been directly identified must be allocated to nursing facilities on a basis designed to equitably allocate the costs to the nursing facilities or activities receiving the benefits of the costs. This allocation must be made in a manner reasonably related to the services received by the nursing facilities. Where practical and the amounts are material, these costs must be allocated on a functional basis. The functions, or cost centers used to allocate central office costs, and the unit bases used to allocate the costs, including those central office costs allocated according to subdivision 4, must be used consistently from one central office accounting period to another.\n(b) If the central office wishes to change its allocation bases and believes the change will result in more appropriate and more accurate allocations, the central office must make a written request, with its justification, to the commissioner for approval of the change no later than 120 days after the beginning of the central office accounting period to which the change is to apply. The commissioner's approval of a central office request must be furnished to the central office in writing. Where the commissioner approves the central office request, the change must be applied to the accounting period for which the request was made, and to all subsequent central office accounting periods unless the commissioner approves a subsequent request for change by the central office. The effective date of the change will be the beginning of the accounting period for which the request was made.\n(a) After the costs that can be directly identified according to subdivisions 1 and 2 have been allocated, the remaining central, affiliated, or corporate office costs must be allocated between the nursing facility operations and the other activities or facilities unrelated to the nursing facility operations based on the ratio of total operating costs. However, in the event that these remaining costs are partially attributable to the start-up of home and community-based services intended to fill a gap identified by the local agency, the facility may assign these remaining costs to the appropriate cost category of the facility for a period not to exceed two years.\n(b) For purposes of allocating these remaining central, affiliated, or corporate office costs, the numerator for the allocation ratio is determined as follows:\n(1) for nursing facilities that are related organizations or are controlled by a central, affiliated, or corporate office under a management agreement, the numerator of the allocation ratio is equal to the sum of the total operating costs incurred by each related organization or controlled nursing facility;\n(2) for a central, affiliated, or corporate office providing goods or services to related organizations that are not nursing facilities, the numerator of the allocation ratio is equal to the sum of the total operating costs incurred by the nonnursing facility related organizations;\n(3) for a central, affiliated, or corporate office providing goods or services to unrelated nursing facilities under a consulting agreement, the numerator of the allocation ratio is equal to the greater of directly identified central, affiliated, or corporate costs or the contracted amount; or\n(4) for business activities that involve the providing of goods or services to unrelated parties which are not nursing facilities, the numerator of the allocation ratio is equal to the greater of directly identified costs or revenues generated by the activity or function.\n(c) The denominator for the allocation ratio is the sum of the numerators in paragraph (b), clauses (1) to (4).\n(a) Nursing operations that have nursing facilities in Minnesota and comparable facilities outside of Minnesota must allocate the nursing operation's central, affiliated, or corporate office costs identified in subdivision 4 to Minnesota, based on the ratio of the sum of the nursing operation's resident days in Minnesota nursing facilities to the sum of the nursing operation's resident days in all its facilities.\n(b) The Minnesota nursing operation's central, affiliated, or corporate office costs identified in paragraph (a) must be allocated to each Minnesota nursing facility on the basis of resident days.\n(a) Costs applicable to services, capital assets, and supplies directly or indirectly furnished to the nursing facility by any related organization are includable in the allowable cost of the nursing facility at the purchase price paid by the related organization for capital assets or supplies and at the cost incurred by the related organization for the provision of services to the nursing facility if these prices or costs do not exceed the price of comparable services, capital assets, or supplies that could be purchased elsewhere. For this purpose, the related organization's costs must not include an amount for markup or profit.\n(b) If the related organization in the normal course of business sells services, capital assets, or supplies to nonrelated organizations, the cost to the nursing facility is the nonrelated organization's price provided that sales to nonrelated organizations constitute at least 50 percent of total annual sales of similar services, capital assets, or supplies.\n(c) The cost of ownership of a capital asset used by the nursing facility must be included in the allowable cost of the nursing facility even though it is owned by a related organization.\nThis section does not apply to payment rates determined under sections 245A.12, 245A.13, and 256R.52, except that any additional directly identified costs associated with the Department of Human Services' or the Department of Health's managing agent under a receivership agreement must be allocated to the facility under receivership, and are nonallowable costs to the managing agent on the facility's cost reports.\n(a) To ensure the avoidance of double payments as required by section 256R.54, the direct and indirect reporting period costs of providing residents of nursing facilities that are not hospital attached with therapy services that are billed separately from the nursing facility payment rate or according to Minnesota Rules, parts 9505.0170 to 9505.0475, must be determined and deducted from the appropriate cost categories of the annual cost report according to paragraphs (b) to (g).\n(b) The costs of wages and salaries for employees providing or participating in providing and consultants providing services shall be allocated to the therapy service based on direct identification.\n(c) The costs of fringe benefits and payroll taxes relating to the costs in paragraph (b) must be allocated to the therapy service based on direct identification or the ratio of total costs in paragraph (b) to the sum of total allowable salaries and the costs in paragraph (b).\n(d) The costs of housekeeping, plant operations and maintenance, real estate taxes, special assessments, and insurance, other than the amounts classified as a fringe benefit, must be allocated to the therapy service based on the ratio of service area square footage to total facility square footage.\n(e) The costs of bookkeeping and medical records must be allocated to the therapy service either by the method in paragraph (f) or based on direct identification. Direct identification may be used if adequate documentation is provided to, and accepted by, the commissioner.\n(f) The costs of administrators, bookkeeping, and medical records salaries, except as provided in paragraph (e), must be allocated to the therapy service based on the ratio of the total costs in paragraphs (b) to (e) to the sum of total allowable nursing facility costs and the costs in paragraphs (b) to (e).\n(g) The cost of property must be allocated to the therapy service and removed from the nursing facility's property-related payment rate, based on the ratio of service area square footage to total facility square footage multiplied by the property-related payment rate.\nTo ensure the avoidance of double payments as required by section 256R.54, the direct and indirect reporting period costs of providing therapy services to residents of a hospital-attached nursing facility, when the services are billed separately from the nursing facility's payment rate or according to Minnesota Rules, parts 9505.0170 to 9505.0475, must be determined and deducted from the appropriate cost categories of the annual cost report based on the Medicare step-down as prepared in accordance with instructions provided by the commissioner.\nFor the rate year beginning on July 1, 1998, a group of nursing facilities related by common ownership that self-insures group health, dental, or life insurance may allocate its directly identified costs of self-insuring its Minnesota nursing facility workers among those nursing facilities in the group that are reimbursed under this chapter. The method of cost allocation shall be based on the ratio of each nursing facility's total allowable salaries and wages to that of the nursing facility group's total allowable salaries and wages, then similarly allocated within each nursing facility's operating cost categories. The costs associated with the administration of the group's self-insurance plan must remain classified in the nursing facility's administrative cost category. A written request of the nursing facility group's election to use this alternate method of allocation of self-insurance costs must be received by the commissioner no later than May 1, 1998, to take effect July 1, 1998, or those self-insurance costs shall continue to be allocated under the existing cost allocation methods. Once a nursing facility group elects this method of cost allocation for its group health, dental, or life insurance self-insurance costs, it shall remain in effect until such time as the group no longer self-insures these costs.",
	"repealed": false
}