{
	"id": "326A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.03",
	"title": "326A.03 CERTIFIED PUBLIC ACCOUNTANT QUALIFICATIONS.",
	"text": "The certificate of certified public accountant shall be granted to persons of good moral character who meet the education, experience, and examination requirements of this section and rules adopted under it and who apply under section 326A.04.\nGood moral character for purposes of this chapter means the propensity to provide professional services in a fair, honest, and trustworthy manner and a lack of a history of dishonest or felonious acts. The board may refuse to grant a certificate on the ground of failure to satisfy this requirement only if there is a substantial connection between the lack of good moral character of the applicant and the professional responsibilities of a licensee and if the finding by the board of lack of good moral character is supported by clear and convincing evidence. When an applicant is found to be unqualified for a certificate because of a lack of good moral character, the board shall furnish the applicant a statement containing the findings of the board, a complete record of the evidence upon which the determination was based, and a notice of the applicant's right of appeal.\n[Repealed, 2013 c 85 art 5 s 50]\nOn or after July 1, 2006, the examination must be administered by the board only to a candidate who has a baccalaureate or higher degree, with a major in accounting or a major in business with accounting emphasis, or an equivalent education, from a college or university that is fully accredited by a recognized accrediting agency listed with the United States Department of Education or an equivalent accrediting association.\nNotwithstanding any contrary provision in this section, the board may adopt rules to permit a person under certain circumstances:\n(1) to apply for the examination within 180 days prior to the person's anticipated completion of the education requirements; and\n(2) to take all or a part of the examination within 90 days of the anticipated completion of the education requirements. No credit shall be given for any part of the examination taken before completion of the education requirements in subdivision 3 unless:\n(i) the education requirements in subdivision 3 and adopted rule requirements are met within 120 days after taking any part of the examination; and\n(ii) documentation of completion of education requirements is received by the board within 150 days of the person taking any part of the examination.\n(a) The examination required to be passed as a condition for the granting of a certificate must be held as often as convenient, in the opinion of the board, and must test the applicant's knowledge of the subjects of accounting and auditing, and other related subjects that the board may specify by rule, including but not limited to business law and taxation. The time for holding the examination must be determined by the board and may be changed from time to time. The board shall prescribe by rule the methods of applying for and conducting the examination, including methods for grading and determining a passing grade required of an applicant for a certificate. However, the board shall to the extent possible ensure that the examination itself, grading of the examination, and the passing grades, are uniform with those applicable in all other states. The board may make such use of all or any part of the Uniform Certified Public Accountant Examination and Advisory Grading Service of the American Institute of Certified Public Accountants and may contract with third parties to perform administrative services with respect to the examination that it considers appropriate to assist it in performing its duties under this paragraph.\n(b) The board may charge, or provide for a third party administering the examination to charge, each applicant a fee.\n[Repealed, 2013 c 85 art 5 s 50]\n(a) On or after July 1, 2006, a person who has passed the examination required in this section must be granted a certificate as a certified public accountant provided: (1) the person certifies to the board that the person has completed at least 150 semester or 225 quarter hours at a college or university that is fully accredited by a recognized accrediting agency listed with the United States Department of Education, or an equivalent accrediting association, and has completed at least one year of experience of the type specified in paragraph (b); (2) the board verifies the certifications; and (3) the person complies with requirements for initial issuance of the certificate as a certified public accountant as prescribed by the board by rule.\n(b) An applicant for initial issuance of a certificate under this subdivision shall show that the applicant has had one year of experience. Acceptable experience includes providing any type of service or advice involving the use of accounting, attest, compilation, management advisory, financial advisory, tax, or consulting skills, as verified by a licensee and meeting requirements prescribed by the board by rule. Acceptable experience may be gained through employment in government, industry, academia, or public practice. Experience as an auditor in the Office of the Legislative Auditor or State Auditor, as verified by a licensee, shall be acceptable experience.\nThe board, in consultation with the University of Minnesota, the Minnesota State Colleges and Universities, private colleges, and private career schools regulated under sections 136A.82 to 136A.834, shall establish criteria to assess equivalent education for purposes of subdivision 3.\n[Repealed, 2013 c 85 art 5 s 50]",
	"repealed": false
}