{
	"id": "61A.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.092",
	"title": "61A.092 CONTINUATION OF COVERAGE FOR LIFE INSURANCE.",
	"text": "Every group insurance policy issued or renewed within this state after August 1, 1987, providing coverage for life insurance benefits shall contain a provision that permits covered employees who are voluntarily or involuntarily terminated or laid off from their employment, if the policy remains in force for any active employee of the employer, to elect to continue the coverage for themselves and their dependents.\nAn employee is considered to be laid off from employment if there is a reduction in hours to the point where the employee is no longer eligible for coverage under the group life insurance policy. Termination does not include discharge for gross misconduct.\nEvery covered employee electing to continue coverage shall pay the employee's former employer, on a monthly basis, the cost of the continued coverage. In no event shall the amount of premium charged exceed 102 percent of the cost to the plan for such period of coverage for other similarly situated employees with respect to whom neither termination nor layoff has occurred, without respect to whether such cost is paid by the employer or employee. The employee is eligible to continue the coverage until the employee obtains coverage under another group policy, or for a period of 18 months after the termination or layoff from employment, whichever is shorter.\nUpon termination of or layoff from employment of a covered employee, the employer shall inform the employee within 14 days after termination or layoff of:\n(1) the employee's right to elect to continue the coverage;\n(2) the amount the employee must pay monthly to the employer to retain the coverage;\n(3) the manner in which and the office of the employer to which the payment to the employer must be made; and\n(4) the time by which the payments to the employer must be made to retain coverage.\nThe employee has 60 days within which to elect coverage. The 60-day period shall begin to run on the date coverage would otherwise terminate or on the date upon which notice of the right to coverage is received, whichever is later.\nIf the covered employee or covered dependent dies during the 60-day election period and before the covered employee makes an election to continue or reject continuation, then the covered employee will be considered to have elected continuation of coverage. The beneficiary previously selected by the former employee or covered dependent would then be entitled to a death benefit equal to the amount of insurance that could have been continued less any unpaid premium owing as of the date of death.\nNotice must be in writing and sent by first class mail to the employee's last known address which the employee has provided to the employer.\nA notice in substantially the following form is sufficient: \"As a terminated or laid off employee, the law authorizes you to maintain your group insurance benefits, in an amount equal to the amount of insurance in effect on the date you terminated or were laid off from employment, for a period of up to 18 months. To do so, you must notify your former employer within 60 days of your receipt of this notice that you intend to retain this coverage and must make a monthly payment of $............ at ............. by the ............. of each month.\"\nIf the employer fails to notify a covered employee of the options set forth in subdivision 3, or if after timely receipt of the monthly payment from a covered employee the employer fails to make the payment to the insurer, with the result that the employee's coverage is terminated, the employer is still liable for the employee's coverage to the same extent as the insurer would be if the coverage were still in effect.\nA group insurance policy that provides posttermination or layoff coverage as required by this section must also include a provision allowing a covered employee, surviving spouse, or dependent at the expiration of the posttermination or layoff coverage provided by subdivision 2 to obtain from the insurer offering the group policy, at the employee's, spouse's, or dependent's option and expense, without further evidence of insurability and without interruption of coverage, an individual policy of insurance contract providing the same or substantially similar benefits.\nA policy providing reduced benefits at a reduced premium rate may be accepted by the employee, the spouse, or a dependent in lieu of the coverage otherwise required by this subdivision.\nThis section applies to a policy, certificate of insurance, or similar evidence of coverage issued to a Minnesota resident or issued to provide coverage to a Minnesota resident. This section does not apply to: (1) a certificate of insurance or similar evidence of coverage that meets the conditions of section 61A.093, subdivision 2; or (2) a group life insurance policy that contains a provision permitting the certificate holder, upon termination or layoff from employment, to retain the coverage provided under the employer's group policy or another group policy offered by the insurer by paying premiums directly to the insurer, provided that the employer shall give the employee notice of the employee's and each related certificate holder's right to continue the insurance by paying premiums directly to the insurer. The insurer may reserve the right to increase premium rates after the first 18 months of continued coverage provided for under clause (2). A related certificate holder is an insured spouse or dependent child of the employee. Upon termination of this group policy or at the option of the insured who has continued coverage under clause (2), each covered employee, spouse, and dependent child is entitled to have issued to them a life conversion policy as prescribed in section 61A.09, subdivision 1, paragraph (h).",
	"repealed": false
}