{
	"id": "41B.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.056",
	"title": "41B.056 PILOT AGRICULTURAL MICROLOAN PROGRAM.",
	"text": "The authority shall establish and implement a pilot agricultural microloan program to help finance the production of specialty crops or eligible livestock. The authority may contract with an intermediary to provide an efficient delivery system for this program.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Intermediary\" means any lending institution or other organization of a for-profit or nonprofit nature that is in good standing with the state of Minnesota that has the appropriate business structure and trained personnel suitable to providing efficient disbursement of loan funds and the servicing and collection of loans.\n(c) \"Specialty crops\" means agricultural crops, such as annuals, flowers, perennials, and other horticultural products, that are intensively cultivated.\n(d) \"Eligible livestock\" means beef cattle, dairy cattle, swine, poultry, goats, mules, farmed Cervidae, Ratitae, bison, sheep, horses, and llamas.\nTo be eligible for this program a borrower must:\n(1) be a legal resident of Minnesota;\n(2) either:\n(i) be a member of a protected group as defined in section 43A.02, subdivision 33; or\n(ii) be a qualified noncitizen as defined in section 256B.06, subdivision 4, paragraph (b);\n(3) be or plan to become a grower of specialty crops or eligible livestock;\n(4) market or contract to market the specialty crops or eligible livestock; and\n(5) demonstrate an ability to repay the loan.\n(a) The authority may disburse loans through an intermediary to farmers who are eligible under subdivision 3. The total accumulative loan principal must not exceed $20,000 per loan.\n(b) Refinancing an existing debt is not an eligible purpose.\n(c) The loan may be disbursed over a period not to exceed six years.\n(d) A borrower may receive loans, depending on the availability of funds, up to 70 percent of the estimated value of the crop or livestock.\n(e) Security for the loan must be a personal note executed by the borrower and any other security required by the intermediary or the authority.\n(f) The authority may prescribe forms and establish an application process for applicants to apply for a loan.\n(g) The interest payable on loans for the pilot agricultural microloan program must be at a rate determined by the authority.\n(h) Loans under this program will be made using money in the revolving loan account established under section 41B.06.\n(i) Repayments of financial assistance under this section, including principal and interest, must be deposited into the revolving loan account established under section 41B.06.",
	"repealed": false
}