{
	"id": "353.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.03",
	"title": "353.03 BOARD OF TRUSTEES.",
	"text": "(a) The management of the Public Employees Retirement Association is vested in an 11-member board of trustees consisting of ten members and the state auditor. The state auditor may designate a deputy auditor with expertise in pension matters as the auditor's representative on the board. The governor shall appoint five trustees to four-year terms, one of whom shall be designated to represent school boards, one to represent cities, one to represent counties, one who is a retired annuitant, and one who is a public member knowledgeable in pension matters. The membership of the association, including recipients of retirement annuities and disability and survivor benefits, shall elect five trustees for terms of four years, one of whom must be a member of the police and fire fund and one of whom must be a former member who met the definition of public employee under section 353.01, subdivisions 2 and 2a, for at least five years prior to terminating membership and who is receiving a retirement annuity or a member who receives a disability benefit. Terms expire on January 31 of the fourth year, and positions are vacant until newly elected members are seated. Except as provided in this subdivision, trustees elected by the membership of the association must be public employees and members of the association.\n(b) For seven days beginning October 1 of each year preceding a year in which an election is held, the association shall accept filings of candidates for the board of trustees. A candidate shall submit at the time of filing a nominating petition signed by 25 or more members of the association. No name may be withdrawn from nomination by the nominee after October 15. At the request of a candidate for an elected position on the board of trustees, the board shall provide a statement of up to 300 words prepared by the candidate to all persons eligible to vote in the election of the candidate. The board may adopt policies and procedures to govern the form and length of these statements and the timing and deadlines for submitting materials to be distributed to the eligible voters.\n(c) By January 10 of each year in which elections are to be held, the board shall distribute to the eligible voters the instructions and materials necessary to vote for the candidates seeking terms on the board of trustees. Eligible voters are the members, retirees, and other benefit recipients. No voter may vote for more than one candidate for each board position to be filled. A vote for more than one person for any position is void. No special marking may be used to indicate incumbents. Votes cast by using paper ballots mailed to the association must be postmarked no later than January 31. Votes cast by using telephone or other electronic means authorized under the board's procedures must be entered by the end of the day on January 31. The design of the voting response media must ensure that each voter's vote is secret.\n(d) A candidate who receives contributions, who makes expenditures in excess of $100, or who has given implicit or explicit consent for any other person to receive contributions or make expenditures in excess of $100 for the purpose of bringing about the candidate's election shall file a report with the campaign finance and public disclosure board disclosing the source and amount of all contributions to the candidate's campaign. The campaign finance and public disclosure board shall prescribe forms governing these disclosures. Expenditures and contributions have the meaning defined in section 10A.01. These terms do not include any distribution made by the association board on behalf of the candidate. A candidate shall file a report within 30 days from the day that the results of the election are announced. The Campaign Finance and Public Disclosure Board shall maintain these reports and make them available for public inspection in the same manner as the board maintains and makes available other reports filed with it.\n(e) The secretary of state shall review and comment on the procedures defined by the board of trustees for conducting the elections specified in this subdivision, including board policies adopted under paragraph (b).\n(f) The board of trustees and the executive director shall undertake their activities consistent with chapter 356A.\nAny vacancy on the board caused by death, resignation, or removal of any trustee, or occurring because an elected trustee ceases to be a public employee and an active member of the association, must be filled by the board for trustees elected by members, and by the governor for other trustees, for the unexpired portion of the term in which the vacancy occurs. The board shall adopt policies and procedures governing how the vacancy of an elected trustee is to be filled.\nThe members of the board of trustees shall serve without compensation, but shall be reimbursed out of the retirement fund for expenses actually and necessarily paid or incurred in the performance of their duties. Members of the board of trustees shall suffer no loss of compensation from a public employer by reason of service on or for the board or on any authorized committee thereof.\n[Repealed, 1977 c 429 s 65]\nThe board is authorized to take legal action when necessary to effectively administer the various retirement plans administered by the association, consistent with applicable articles of incorporation, bylaws, law, and rules, as applicable, and including, but not limited to, the recapture of overpaid annuities, benefits, or refunds, and the correction of omitted or deficient deductions.\n(a) The board shall:\n(1) elect a president and vice-president;\n(2) approve the staffing complement, as recommended by the executive director, necessary to administer the fund;\n(3) adopt bylaws for its own government and for the management of the fund consistent with the laws of the state and may modify them at pleasure;\n(4) adopt, alter, and enforce reasonable rules consistent with the laws of the state and the terms of the applicable benefit plans for the administration and management of the fund, for the payment and collection of payments from members and for the payment of withdrawals and benefits, and that are necessary in order to comply with the applicable federal Internal Revenue Service and Department of Labor requirements;\n(5) pass upon and allow or disallow all applications for membership in the fund and allow or disallow claims for withdrawals, pensions, or benefits payable from the fund;\n(6) adopt an appropriate mortality table based on experience of the fund as recommended by the association actuary and approved under section 356.215, subdivision 18, with interest set at the rate specified in section 356.215, subdivision 8;\n(7) provide for the payment out of the fund of the cost of administering this chapter, of all necessary expenses for the administration of the fund and of all claims for withdrawals, pensions, or benefits allowed;\n(8) approve or disapprove all recommendations and actions of the executive director made subject to its approval or disapproval by subdivision 3a; and\n(9) approve early retirement and optional annuity factors, subject to review by the actuary retained by the Legislative Commission on Pensions and Retirement; establish the schedule for implementation of the approved factors; and notify the Legislative Commission on Pensions and Retirement of the implementation schedule.\n(b) In passing upon all applications and claims, the board may summon, swear, hear, and examine witnesses and, in the case of claims for disability benefits, may require the claimant to submit to a medical examination by a physician of the board's choice, at the expense of the fund, as a condition precedent to the passing on the claim, and, in the case of all applications and claims, may conduct investigations necessary to determine their validity and merit.\n(c) The board may continue to authorize the sale of life insurance to members under the insurance program in effect on January 1, 1985, but must not change that program without the approval of the commissioner of management and budget. The association shall not receive any financial benefit from the life insurance program beyond the amount necessary to reimburse the association for costs incurred in administering the program. The association shall not engage directly or indirectly in any other activity involving the sale or promotion of goods or services, or both, whether to members or nonmembers.\n(d) The board shall establish procedures governing reimbursement of expenses to board members. These procedures must define the types of activities and expenses that qualify for reimbursement, must provide that all out-of-state travel be authorized by the board, and must provide for the independent verification of claims for expense reimbursement. The procedures must comply with the applicable rules and policies of the Department of Management and Budget and the Department of Administration.\n(e) The board may purchase fiduciary liability insurance and official bonds for the officers and members of the board of trustees and employees of the association and may purchase property insurance or may establish a self-insurance risk reserve including, but not limited to, data processing insurance and \"extra-expense\" coverage.\n(a) Appointment. The board must appoint an executive director on the basis of education, experience in the retirement field, ability to manage and lead system staff, and ability to assist the board in setting a vision for the system. The executive director must have had at least five years of experience in either an executive-level management position or a position with responsibility for the governance, management, or administration of a retirement plan. The executive director serves at the pleasure of the board. Notwithstanding any law to the contrary, the board must set the salary of the executive director. The board must review the performance of the executive director on an annual basis and may grant salary adjustments as a result of the review.\n(b) Duties. The management of the association is vested in the executive director who shall be the executive and administrative head of the association. The executive director shall act as adviser to the board on all matters pertaining to the association and shall also act as the secretary of the board. The executive director shall:\n(1) attend all meetings of the board;\n(2) prepare and recommend to the board appropriate rules to carry out the provisions of this chapter;\n(3) establish and maintain an adequate system of records and accounts following recognized accounting principles and controls;\n(4) designate, with the approval of the board, up to two persons who may serve in the unclassified service and whose salaries are set in accordance with section 43A.18, subdivision 3, appoint a confidential secretary in the unclassified service, and appoint employees to carry out this chapter, who are subject to chapters 43A and 179A in the same manner as are executive branch employees;\n(5) organize the work of the association as the director deems necessary to fulfill the functions of the association, and define the duties of its employees and delegate to them any powers or duties, subject to the control of, and under such conditions as, the executive director may prescribe;\n(6) with the approval of the board, contract for the services of an approved actuary, professional management services, and any other consulting services as necessary to fulfill the purposes of this chapter. All contracts are subject to chapter 16C. The commissioner of administration shall not approve, and the association shall not enter into, any contract to provide lobbying services or legislative advocacy of any kind. Any approved actuary retained by the executive director shall function as the actuarial advisor of the board and the executive director. In addition to filing requirements under section 356.214, any supplemental actuarial valuations or experience studies shall be filed with the executive director of the Legislative Commission on Pensions and Retirement. Copies of professional management survey reports shall be transmitted to the secretary of the senate, the chief clerk of the house of representatives, and the Legislative Reference Library as provided by section 3.195, and to the executive director of the commission at the same time as reports are furnished to the board. Only management firms experienced in conducting management surveys of federal, state, or local public retirement systems shall be qualified to contract with the director hereunder;\n(7) with the approval of the board provide in-service training for the employees of the association;\n(8) make refunds of accumulated contributions to former members and to the designated beneficiary, surviving spouse, legal representative or next of kin of deceased members or deceased former members, as provided in this chapter;\n(9) determine the amount of the annuities and disability benefits of members covered by the association and authorize payment of the annuities and benefits beginning as of the dates on which the annuities and benefits begin to accrue, in accordance with the provisions of this chapter;\n(10) pay annuities, refunds, survivor benefits, salaries, and necessary operating expenses of the association;\n(11) prepare and submit to the board and the legislature an annual financial report covering the operation of the association, as required by section 356.20;\n(12) prepare and submit biennial and annual budgets to the board for its approval and submit the approved budgets to the Department of Management and Budget for approval by the commissioner;\n(13) reduce all or part of the accrued interest payable under section 353.27, subdivisions 12, 12a, and 12b, or 353.28, subdivision 5, upon receipt of proof by the association of an unreasonable processing delay or other extenuating circumstances of the employing unit; and notwithstanding section 353.27, subdivision 7, may waive the payment of accrued interest to the member if a credit has been taken by the employer to correct an employee deduction taken in error and if the accrued interest is $10 or less. The executive director shall prescribe and submit for approval by the board the conditions under which such interest may be reduced; and\n(14) with the approval of the board, perform such other duties as may be required for the administration of the association and the other provisions of this chapter and for the transaction of its business.\nThe executive director shall deduct from the annuity or benefit periodically the amount of any dues of any fraternal organization continuing or established after December 30, 2011, for former members of the former Minneapolis Firefighters Relief Association and December 30, 2011, for former members of the former Minneapolis Police Relief Association.\nThe commissioner of administration shall make provision for suitable office space in the public pension fund facilities created under section 356B.10.\nLaws applicable to state agencies and agencies with statewide jurisdiction shall apply to the association.",
	"repealed": false
}