{
	"id": "16B.307",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.307",
	"title": "16B.307 ASSET PRESERVATION APPROPRIATIONS.",
	"text": "(a) Article XI, section 5, clause (a), of the constitution requires that state general obligation bonds be issued to finance only the acquisition or betterment of public land, buildings, and other public improvements of a capital nature. Money appropriated for asset preservation, whether from state bond proceeds or from other revenue, is subject to the following additional limitations:\n(b) An appropriation for asset preservation may not be used to acquire new land nor to acquire or construct new buildings or additions to buildings.\n(c) An appropriation for asset preservation may be used only for a capital expenditure on a capital asset previously owned by the state, within the meaning of generally accepted accounting principles as applied to public expenditures. The commissioner of administration will consult with the commissioner of management and budget to the extent necessary to ensure this and will furnish the commissioner of management and budget a list of projects to be financed from the account in order of their priority. The legislature assumes that many projects for preservation and replacement of portions of existing capital assets will constitute betterments and capital improvements within the meaning of the constitution and capital expenditures under generally accepted accounting principles, and will be financed more efficiently and economically under this section than by direct appropriations for specific projects.\n(d) Categories of projects considered likely to be most needed and appropriate for asset preservation appropriations are the following:\n(1) major projects to address life safety hazards for existing buildings and sites, including but not limited to security, building code violations, or structural defects. Notwithstanding paragraph (b), a project in this category may include an addition to an existing building if it is a required component of the hazard abatement project;\n(2) projects to eliminate or contain hazardous substances like asbestos or lead paint;\n(3) major projects to address accessibility and building code violations; replace or repair roofs, windows, tuckpointing, mechanical, electrical, plumbing or other building systems, utility infrastructure, and tunnels; make site improvements necessary to support building use; and repair structural components necessary to preserve the exterior and interior of existing buildings; and\n(4) major projects to repair parking facilities and surface lots.\n(e) Up to ten percent of an appropriation subject to this section may be used for design costs for projects eligible to be funded under this section in anticipation of future asset preservation appropriations.\nBy January 15 of each year, the commissioner of an agency that has received an appropriation for asset preservation shall submit to the commissioner of management and budget, the chairs of the legislative committees or divisions that currently oversee the appropriations to the agency, and to the chairs of the senate and house of representatives Capital Investment Committees, a list of the projects that have been funded with money under this program during the preceding calendar year, as well as a list of those priority asset preservation projects for which state bond proceeds fund appropriations will be sought during that year's legislative session.",
	"repealed": false
}