{
	"id": "116L.666",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.666",
	"title": "116L.666 WORKFORCE DEVELOPMENT AREAS.",
	"text": "For the purpose of administering federal, state, and local employment and training services, the commissioner shall designate the geographic boundaries for workforce development areas in Minnesota.\nThe commissioner shall approve a request to be a workforce development area from:\n(1) a home rule charter or statutory city with a population of 200,000 or more or a county with a population of 200,000 or more; or\n(2) a consortium of contiguous home rule charter or statutory cities or counties with an aggregate population of 200,000 or more that serves a substantial part of one or more labor markets.\nThe commissioner may approve a request to be a workforce development area from a home rule charter or statutory city or a county or a consortium of contiguous home rule charter or statutory cities or counties, without regard to population, that serves a substantial portion of a labor market area.\nThe commissioner shall make a final designation of workforce development areas within the state after consulting with local elected officials and the governor's Workforce Development Board. Existing workforce development areas designated under the federal Workforce Investment Act shall be initially designated as workforce development areas providing that no other petitions are submitted by local elected officials.\nThe commissioner may redesignate workforce development areas, upon the advice of the affected local elected officials, no more frequently than every two years. These redesignations must be made not later than four months before the beginning of a program year.\nA local workforce development board must be established in each workforce development area, designated according to subdivision 1.\nIn workforce development areas representing only one home rule charter or statutory city or a county, the chief local elected official must appoint members to the board. In workforce development areas representing two or more home rule charter or statutory cities or counties, the chief elected officials of the home rule charter or statutory cities or counties must appoint members to the board, in accordance with an agreement entered into by such units of general local government.\nA local workforce development board shall include as members:\n(1) representatives of the private sector, who must constitute a majority of the membership of the workforce development board and who are owners of business concerns, chief executives or chief operating officers of nongovernmental employers, or other private sector executives who have substantial management or policy responsibility;\n(2) representatives of organized labor;\n(3) representatives of the area workforce and community-based organizations, including labor, veterans, individuals with disabilities, minorities, older workers, housing, secondary career and technical education, or philanthropic organizations, who shall constitute not less than 20 percent of the membership of the workforce development board; and\n(4) representatives of each of the following:\n(i) higher educational agencies that are representative of all higher educational agencies within the workforce development area, including community colleges;\n(ii) vocational rehabilitation programs carried out under title I of the Rehabilitation Act of 1973 within the workforce development area;\n(iii) representatives of adult education and literacy programs under title II of the Rehabilitation Act of 1973 within the workforce development area;\n(iv) the director of area apprenticeship training;\n(v) economic development agencies;\n(vi) a company or trade association with an apprenticeship program recognized by the Department of Labor and Industry; and\n(vii) Wagner-Peyser funded public employment service agencies.\nIndividual members of the local board may represent multiple categories referenced in clauses (1) to (4). The chair of each local workforce development board shall be selected from among the members of the board who are representatives of the private sector.\nPrivate sector representatives on the local workforce development board shall be selected from among individuals nominated by general purpose business organizations, such as local chambers of commerce, in the workforce development area.\nEducation representatives on the local workforce development board must include at least one representative from a local adult basic education program approved under section 124D.52 and nominated by the program, and the higher education representatives shall be selected from among individuals nominated by postsecondary educational institutions within the workforce development area.\nOrganized labor representatives on the local workforce development board shall be selected from individuals recommended by recognized state and local labor federations, organizations, or councils. If the state or local labor federations, organizations, or councils fail to nominate a sufficient number of individuals to meet the labor representation requirements, individual workers may be included on the local workforce development board to complete the labor representation.\nThe commissioner must certify a local workforce development board if the commissioner determines that its composition and appointments are consistent with this subdivision.\nThe local workforce development board is responsible for providing policy guidance for, and exercising oversight with respect to, activities conducted by local workforce centers in partnership with the local unit or units of general local government within the workforce development area and with the commissioner.\nA local workforce center is a location where federal, state, and local employment and training services are provided to job seekers and employers.\nA local workforce development board, in accordance with an agreement or agreements with the appropriate chief elected official or officials and the commissioner, shall:\n(1) determine procedures for the development of the local workforce development area plan. The procedures may provide for the preparation of all or any part of the plan:\n(i) by the local workforce development board;\n(ii) by any unit of general local or state government in the workforce development area, or by an agency of that unit; or\n(iii) by any other methods or institutions as may be provided in the agreement;\n(2) consult with the department prior to the award of competitive workforce development grants in the local area;\n(3) select the recipients for local grants and an administrator of the local workforce development area plan. These may be the same entity or separate entities and must be chosen from among the following:\n(i) the local workforce development board;\n(ii) a unit of general local or state government in its workforce development area, or an agency of that unit;\n(iii) a nonprofit organization or corporation; or\n(iv) any other agreed-upon entity;\n(4) jointly plan for local collaborative activities including the transition of public assistance recipients to employment in the public or private sectors;\n(5) provide on-site review and oversight of program performance;\n(6) establish local priorities for service and target populations;\n(7) ensure nonduplication of state and federal workforce development services and a unified service delivery system within the workforce development area;\n(8) ensure that local workforce centers provide meeting space, free of charge, for meetings of the Minnesota Family Resiliency Partnership, established under section 116L.96; and\n(9) nominate individuals to the governor to consider for membership on the governor's Workforce Development Board.",
	"repealed": false
}