{
	"id": "13.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.381",
	"title": "13.381 HEALTH REGULATORY DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside this chapter. Those sections classify health regulatory data as other than public, place restrictions on access to government data, or involve data sharing.\n(a) Health-related licensees and registrants. The collection, analysis, reporting, and use of data on individuals licensed or registered by the commissioner of health or health-related licensing boards are governed by sections 144.051, subdivisions 2 to 6, and 144.052.\n(b) Health services personnel. Data collected by the commissioner of health for the database on health services personnel are classified under section 144.1485.\nAccess to certain data on assessments of care and services to nursing home residents is governed by section 144.0721, subdivision 2.\nFinancial data on individual hospitals under the rural hospital grant program are classified under section 144.147, subdivision 5.\nDisclosure of certain data received by the commissioner of health under sections 144.50 to 144.56 is governed by section 144.58.\nData from a closed meeting of a public hospital are classified under section 144.581, subdivision 5.\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\nData provided to, filed with, or created or obtained by the commissioner of health under section 144.7065 are classified as provided in section 144.7065, subdivision 10.\nHealth test results obtained under sections 144.7401 to 144.7415 are classified under section 144.7411.\nData from correction orders of or notices of noncompliance by nursing homes are governed under section 144A.10.\nData regarding a home care provider under sections 144A.43 to 144A.47 are governed by section 144A.45. Data regarding home care provider background studies are governed by section 144A.476, subdivision 1. Data regarding a hospice provider under sections 144A.75 to 144A.755 are governed by sections 144A.752 and 144A.754.\nInformation gathered by the director of the Office of Health Facility Complaints is classified under section 144A.53, subdivision 3.\nData required to be reported by ambulance services under section 144E.123 are classified under that section.\nDisclosure of data and information acquired by a review organization as defined in section 145.61, subdivision 5, is governed by section 145.64.\nInformation gathered under section 145.925 is classified under section 145.925, subdivision 6.\n(a) The sharing of data maintained by the commissioner of health on volunteer health professionals is governed by section 145A.06, subdivision 6, paragraph (c).\n(b) Criminal history record data on Minnesota Responds Medical Reserve Corps volunteers are classified under section 145A.061.\nData collected in case reports filed with the commissioner of health by mortuary science interns are classified under section 149A.20, subdivision 6.\nData on individuals in annual reports required of certain funeral establishments are classified under section 149A.97, subdivision 11.\nAccess to data in the prescription electronic reporting system is governed by section 152.126.\n[Repealed, 2015 c 21 art 1 s 110]\nData collected from health plan companies and providers for purposes of approval of rural health cooperative arrangements are classified under section 62R.09.\nQuality of care complaint information gathered under section 62D.115 is classified by section 62D.115, subdivision 4.\nData collected relating to an individual who seeks to access urgent-need insulin or participates in a manufacturer's patient assistance program is classified under section 151.74, subdivision 11.",
	"repealed": false
}