{
	"id": "3.7394",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.7394",
	"title": "3.7394 EFFECT OF SPECIAL COMPENSATION PROCESS; RELATIONSHIP TO OTHER LAW.",
	"text": "The establishment of the special compensation process under section 3.7393 and the emergency relief fund, and an offer of settlement or a settlement agreement, is not an admission of liability by the state or a municipality or their employees and does not establish a duty of the state, a municipality, or their employees to compensate survivors. The creation and funding of the compensation process under sections 3.7391 to 3.7395 or an offer of settlement or settlement agreement is not admissible in a judicial or administrative proceeding to establish liability or a legal duty.\nPayments made under section 3.7393 or from the emergency relief fund are intended to supplement and be in addition to any payments required to be made by a third party under law or contract.\n(a) Notwithstanding any statutory or common law or agreement to the contrary, a person who is not a third-party tortfeasor and who is required to make payments, including future payments, to a survivor may eliminate or reduce those payments as a result of compensation paid to the survivor under section 3.7393 or from the emergency relief fund only to the extent those payments represent damages for future losses for which the survivor received compensation under section 3.7393 or from the emergency relief fund. The obligation of any person other than the state to make payments to a survivor is primary as compared to any payment made or to be made under section 3.7393 or from the emergency relief fund. The persons referenced in and covered by this subdivision and subdivision 4 include, without limitation:\n(1) reparation obligors, as defined in section 65B.43, subdivision 9, whether they are insurers or self-insurers;\n(2) health plan companies, as defined in section 62Q.01, subdivision 4, including the Minnesota Comprehensive Health Association created under section 62E.10;\n(3) insurance companies, as defined in section 60A.02, subdivision 4;\n(4) self-insured pools of political subdivisions organized under section 471.617 or 471.981, including service cooperatives pools organized under section 123A.21;\n(5) risk retention groups, as defined in section 60E.02, subdivision 12;\n(6) joint self-insurance plans governed by chapter 60F;\n(7) workers' compensation insurers and private self-insurers, as defined in section 79.01;\n(8) the Minnesota Life and Health Insurance Guaranty Association governed by chapter 61B;\n(9) the Minnesota Insurance Guaranty Association governed by chapter 60C;\n(10) the Minnesota Joint Underwriting Association governed by chapter 62I;\n(11) all insurers providing credit life, credit accident and health, and credit involuntary unemployment insurance under chapter 62B, but also including those coverages written in connection with real estate mortgage loans and those provided to borrowers at no additional cost;\n(12) the Minnesota unemployment insurance program provided under chapter 268;\n(13) coverage offered by the state under medical assistance and MinnesotaCare; and\n(14) any other plan providing health, life, disability income, or long-term care coverage.\n(b) A third-party tortfeasor who is required to make payments, including future payments, to a survivor may not eliminate or reduce those payments as a result of compensation paid to a survivor under section 3.7393 or from the emergency relief fund or as a result of the survivor's release of claims against the state, a municipality, or their employees under section 3.7393.\n(a) Notwithstanding any statutory or common law or agreement to the contrary, a person who pays benefits or compensation to or on behalf of a survivor does not have a subrogation or other right, including, but not limited to, any rights otherwise provided under sections 65B.53 and 176.061, to recover those benefits or compensation by making a claim against the state, a municipality or their employees, or by making a claim, or recovering from payments made, under section 3.7393 or from the emergency relief fund.\n(b) Following a settlement agreement under section 3.7393, a person who believes that the state cannot constitutionally prohibit assertion of a subrogation or other claim described in paragraph (a) and who claims such a subrogation or other interest against the state, a municipality or their employees, or against the amount to be paid by the state under section 3.7393 or any payment made from the emergency relief fund has 40 days after the settlement agreement was entered into to provide notice to the state and the survivor of the person's intent to assert that interest, during which time the commissioner of management and budget must not make the payment under section 3.7393. The subrogation or other claim is waived if the notice is not provided by the deadline. If no notice is received by the deadline, the commissioner of management and budget shall make the payment. If a notice of claim is received, the commissioner shall withhold the payment until the person abandons or waives the subrogation or other claim.\n(a) Notwithstanding any statutory or common law to the contrary, the state is entitled to recover from any third party, including an agent, contractor, or vendor retained by the state, any payments made from the emergency relief fund or under section 3.7393 to the extent the third party caused or contributed to the catastrophe. The state is entitled to be reimbursed regardless of whether the survivor is fully compensated.\n(b) Notwithstanding any statutory or common law to the contrary, the state is subrogated to all potential claims against third-party tortfeasors of a survivor receiving payment from the emergency relief fund or under section 3.7393 to the extent the claims relate to, involve, or arise out of the catastrophe. The subrogation right of the state under this subdivision is limited to the amount paid to the survivor from the emergency relief fund and under section 3.7393. The rights of the state under this subdivision are in addition to other remedies, claims, and rights relating to the catastrophe that the state may have against other persons for the recovery of monetary or other relief.\n(c) A survivor must notify the state if the survivor has been fully compensated by third parties for damages caused by the catastrophe. A survivor is fully compensated if payments made or required to be made to the survivor by a third-party tortfeasor under the terms of a settlement agreement or other agreement with the survivor or a final judgment in favor of the survivor concerning claims that relate to, involve, or arise out of the catastrophe are equal to or greater than the total damages incurred by the survivor as determined by the panel under section 3.7393, subdivision 10. The state is entitled to be reimbursed by a survivor only to the extent that these payments are greater than the total damages incurred by the survivor.\nPayments made to survivors under section 3.7393 or from the emergency relief fund are not to be considered in calculating the $1,000,000 limit on tort claims in civil actions against the state arising out of the catastrophe for purposes of section 3.736, subdivision 4, clause (e), or a municipality arising out of the catastrophe for purposes of section 466.04, subdivision 1, clause (5).",
	"repealed": false
}