{
	"id": "221.141",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.141",
	"title": "221.141 INSURANCE OR BOND.",
	"text": "(a) No motor carrier and no interstate carrier shall operate a vehicle until it has obtained and has in effect the minimum amount of financial responsibility required by this section. Policies of insurance, surety bonds, other types of security, and endorsements must be continuously in effect and must remain in effect until canceled. Before providing transportation, the motor carrier or interstate carrier shall secure and cause to be filed with the commissioner and maintain in full effect, a certificate of insurance in a form required by the commissioner, evidencing public liability insurance in the amount prescribed. The insurance must cover injuries and damage to persons or property resulting from the operation or use of motor vehicles, regardless of whether each vehicle is specifically described in the policy. This insurance does not apply to injuries or death to the employees of the motor carrier or to property being transported by the carrier.\n(b) Notwithstanding any other provision of this chapter, the insurance required of a motor carrier of passengers must be at least that amount required of interstate carriers under Code of Federal Regulations, title 49, section 387.33, as amended.\n(c) This section does not apply to a charitable organization exempt from taxation under section 501(c)(3) of the Internal Revenue Code when the transportation furthers the charitable organization's charitable mission. The charitable organization must comply with the insurance requirements of section 65B.48.\nInsurance, bonds, endorsements, certificates, and other evidence of financial responsibility issued to satisfy the requirements of this section may be canceled on not less than 30 days' written notice to the insured and to the commissioner.\nExcept as provided in subdivision 1d, the amount of insurance, bond, or other security required for motor carriers is the amount prescribed by order of the commissioner. The amount prescribed may from time to time be reduced or increased by order of the commissioner. The commissioner may, if desired by the petitioner, prescribe in lieu of the bond or insurance some other form of security as may be satisfactory. Each policy of insurance, surety bond, or other evidence of financial responsibility issued to a motor carrier or to an interstate carrier must be amended by attachment to the policy of Form MCS-90 prescribed in Code of Federal Regulations, title 49, section 387.15, or must by its terms provide coverage that conforms to the terms and conditions of that endorsement.\nAn interstate carrier must obtain insurance or bond in the minimum amounts prescribed in Code of Federal Regulations, title 49, section 387.303, paragraphs (a) and (b).\nA motor carrier that transports property described under (2) and (3) of the schedule of limits in Code of Federal Regulations, title 49, section 387.9, must obtain insurance or bond in the amounts prescribed in those regulations.\nA policy of insurance, bond, or other evidence of financial responsibility does not satisfy the requirements of this section unless:\n(1) the insurer or surety furnishing the evidence of financial responsibility is authorized or registered by the Department of Commerce to issue the policies, bonds, or certificates in this state; or\n(2) the insurer is a risk retention group registered under chapter 60E and the insured is a nonprofit organization that is exempt from taxation under section 501(c)(3) of the Internal Revenue Code of 1986.\n\"Financial responsibility\" means a policy of insurance, surety bond, or other financial undertaking sufficient to pay liability amounts required by this section.\n[Repealed, 1983 c 371 s 44]\nCertificates of insurance which have been accepted by the commissioner under subdivision 1 may be replaced by other certificates of insurance and the liability of the retiring insurer under the certificate of insurance is considered terminated as of the effective date of the replacement certificate, provided the replacement certificate is acceptable to the commissioner.\nA household goods mover shall maintain in effect cargo insurance or cargo bond in the amount of $50,000 and shall file with the commissioner a cargo certificate of insurance or cargo bond. A cargo certificate of insurance must conform to Form H, Uniform Motor Cargo Certificate of Insurance, described in Code of Federal Regulations, title 49, part 1023. A cargo bond must conform to Form J, described in Code of Federal Regulations, title 49, part 1023. Both Form H and Form J are incorporated by reference. The cargo certificate of insurance or cargo bond must be issued in the full and correct name of the person, corporation, or partnership to whom the household goods mover permit was issued and whose operations are being insured.\nFor purposes of this section, \"motor carrier\" includes any person who transports passengers for hire in intrastate commerce. This section does not apply to an entity or person included in section 221.031, subdivision 3b, paragraph (b).\n[Repealed, 2009 c 64 s 57]\nThe commissioner may permit the electronic filing of insurance, bonds, endorsements, certificates, and other evidence of financial responsibility required in this section or rules adopted under this section. The electronic filing of a document imposes the same obligations on the person filing the document and has the same legal effect as if the document had been filed on a prescribed form.",
	"repealed": false
}