{
	"id": "508A.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.52",
	"title": "508A.52 CONVEYANCE; CANCELLATION OF OLD AND ISSUANCE OF NEW CPT.",
	"text": "An owner of land registered under sections 508A.01 to 508A.85 who desires to convey the land, or a portion of it, in fee, shall execute a deed of conveyance, and record the deed with the registrar. The deed of conveyance shall be recorded and endorsed with the number and place of registration of the CPT. Before canceling the outstanding CPT, the registrar shall show by memorial on it the registration of the deed on the basis of which it is canceled. The encumbrances, claims, or interests adverse to the title of the registered owner shall be stated upon the new CPT, except so far as they may be simultaneously released or discharged. The registrar shall not carry forward as a memorial on the new CPT any memorials of a transfer on death deed if the grantors of the transfer on death deed retain no fee interest in the real property covered by the new CPT. The CPT shall be marked \"Canceled\" by the registrar, who shall enter in the register a new CPT to the grantee, and prepare and deliver to the grantee a copy of the new CPT. If a deed in fee is for a portion of the land described in a CPT, the memorial of the deed entered by the registrar shall include the legal description contained in the deed and the registrar shall enter a new CPT to the grantee for the portion of the land conveyed and, except as otherwise provided in this section, issue a residue CPT to the grantor for the portion of the land not conveyed. The registrar shall prepare and deliver to each of the parties a copy of their respective CPT's. In lieu of canceling the grantor's CPT and issuing a residue CPT to the grantor for the portion of the land not conveyed, the registrar may if the grantor's deed does not divide a parcel of unplatted land, and in the absence of a request to the contrary by the registered owner, mark by the land description on the CPT \"Part of land conveyed, see memorials.\" The fee for a residue CPT shall be paid to the registrar only when the grantor's CPT is canceled after the conveyance by the grantor of a portion of the land described in the grantor's CPT. When two or more successive conveyances of the same property are filed for registration on the same day the registrar may enter a CPT in favor of the grantee or grantees in the last of the successive conveyances, and the memorial of the previous deed or deeds entered on the prior CPT shall have the same force and effect as though the prior CPT had been entered in favor of the grantee or grantees in the earlier deed or deeds in the successive conveyances. The fees for the registration of the earlier deed or deeds shall be the same as the fees prescribed for the entry of memorials. The registrar of titles, with the consent of the transferee, may mark \"See memorials for new owner(s)\" by the names of the registered owners on the CPT and also add to the memorial of the transferring conveyance a statement that the memorial shall serve in lieu of a new CPT in favor of the grantee or grantees noted in it and may refrain from canceling the CPT until the time it is canceled by a subsequent transfer, and the memorial showing the transfer of title shall have the same effect as the entry of a new CPT for the land described in the CPT. The fee for the registration of a conveyance without cancellation of the CPT shall be the same as the fee prescribed for the entry of a memorial.",
	"repealed": false
}