{
	"id": "325F.755",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.755",
	"title": "325F.755 PRIZE NOTICES AND SOLICITATIONS.",
	"text": "For purposes of this section, the following terms in this subdivision have the meanings given them.\n(a) \"Prize\" means a gift, award, or other item or service of value that is offered or awarded to a participant in a real or purported contest, competition, sweepstakes, puzzle, drawing, scheme, plan, or other selection process.\n(b) \"Retail value\" of a prize means:\n(1) a price at which the sponsor can substantiate that a substantial number of the prizes have been sold to the public in Minnesota in the preceding year; or\n(2) if the sponsor is unable to satisfy the requirement in clause (1), then no more than 1.5 times the amount the sponsor paid for the prize in a bona fide purchase from an unaffiliated seller.\n(c) \"Sponsor\" means a corporation, partnership, limited liability company, sole proprietorship, or natural person that requires a person in Minnesota to pay the sponsor money as a condition of awarding the person a prize, or as a condition of allowing the person to receive, use, compete for, or obtain information about a prize, or that creates the reasonable impression that such a payment is required.\n(a) No sponsor shall require a person in Minnesota to pay the sponsor money as a condition of awarding the person a prize, or as a condition of allowing the person to receive, use, compete for, or obtain information about a prize, nor shall a sponsor use any solicitation that creates the reasonable impression that a payment is required, unless the person has first received a written prize notice containing the information required in paragraphs (b) and (c).\n(b) A written prize notice must contain each of the following:\n(1) the true name or names of the sponsor and the address of the sponsor's actual principal place of business;\n(2) the retail value of each prize the person receiving the notice has been selected to receive or may be eligible to receive;\n(3) a statement of the person's odds of receiving each prize identified in the notice;\n(4) any requirement that the person pay shipping or handling fees or any other charges to obtain or use a prize, including the nature and amount of the charges;\n(5) if receipt of the prize is subject to a restriction, a statement that a restriction applies, and a description of the restriction;\n(6) any limitations on eligibility; and\n(7) if a sponsor represents that the person is a \"winner,\" is a \"finalist,\" has been \"specially selected,\" is in \"first place,\" or is otherwise among a limited group of persons with an enhanced likelihood of receiving a prize, the written prize notice must contain a statement of the maximum number of persons in the group or purported group with this enhanced likelihood of receiving a prize.\n(c) The information required by paragraph (b) must be presented in the following form:\n(1) the retail value and the statement of odds required under paragraph (b), clauses (2) and (3), must be stated in immediate proximity to each identification of a prize on the written notice, and must be in the same size and boldness of type as the reference to the prize;\n(2) the statement of odds must include, for each prize, the total number of prizes to be given away and the total number of written prize notices to be distributed. The number of prizes and written prize notices must be stated in Arabic numerals. The statement of odds must be in the following form:\n\"....... (number of prizes) out of ....... notices distributed.\";\n(3) if a person is required to pay shipping or handling fees or any other charges to obtain a prize, to be eligible to obtain a prize, or participate in a contest, the following statement must appear in immediate proximity to each listing of the prize in the written prize notice, in not less than ten-point boldface type: \"YOU MUST PAY $....... TO RECEIVE THIS ITEM\" or \"YOU MUST PAY $....... TO COMPETE FOR THIS ITEM,\" whichever is applicable; and\n(4) a statement required under paragraph (b), clause (7), must appear in immediate proximity to each representation that the person is among a group of persons with an enhanced likelihood of receiving a prize, and must be in the same size and boldness of type as the representation.\nA sponsor who represents to a person that the person has been awarded a prize shall, not later than 30 days after making the representation, provide the person with the prize, or with a voucher, certificate, or other document giving the person the unconditional right to receive the prize, or shall provide the person with either of the following items selected by the person:\n(1) any other prize listed in the written prize notice that is available and that is of equal or greater value; or\n(2) the retail value of the prize, as stated in the written notice, in the form of cash, a money order, or a certified check.\nNothing in this section creates liability for acts by the publisher, owner, agent, or employee of a newspaper, periodical, radio station, television station, cable television system, or other advertising medium arising out of the publication or dissemination of a solicitation, notice, or promotion governed by this section, unless the publisher, owner, agent, or employee had knowledge that the solicitation, notice, or promotion violated the requirements of this section, or had a financial interest in the solicitation, notice, or promotion.\nThis section does not apply to solicitations or representations, in connection with (1) the sale or purchase of books, recordings, videocassettes, periodicals, and similar goods through a membership group or club which is regulated by the Federal Trade Commission pursuant to Code of Federal Regulations, title 16, part 425.1, concerning use of negative option plans by sellers in commerce; (2) the sale or purchase of goods ordered through a contractual plan or arrangement such as a continuity plan, subscription arrangement, or a single sale or purchase series arrangement under which the seller ships goods to a consumer who has consented in advance to receive the goods and after the receipt of the goods is given the opportunity to examine the goods and to receive a full refund of charges for the goods upon return of the goods undamaged; or (3) sales by a catalog seller. For purposes of this section \"catalog seller\" shall mean any entity (and its subsidiaries) or person at least 50 percent of whose annual revenues are derived from the sale of products sold in connection with the distribution of catalogs of at least 24 pages, which contain written descriptions or illustrations and sale prices for each item of merchandise and which are distributed in more than one state with a total annual distribution of at least 250,000.\nThis section does not apply to advertising permitted and regulated under chapter 82A, concerning membership camping practices; advertising permitted and regulated under chapter 83, concerning subdivided lands and interests in subdivided lands; pari-mutuel betting on horse racing permitted and regulated under chapter 240; lawful gambling permitted and regulated under chapter 349; savings promotion raffles permitted under chapter 609; or the State Lottery created and regulated under chapter 349A.\n(a) Nothing in this section shall be construed to permit an activity otherwise prohibited by law.\n(b) A violation of this section is also a violation of sections 325F.68 to 325F.71 and is subject to section 8.31.\n(c) Whoever intentionally violates this section may be fined not more than $10,000 or imprisoned for not more than two years, or both. It is evidence of intent if the violation occurs after the Office of the Attorney General has notified a person by certified mail that the person is in violation of this section.\n(d) A person suffering pecuniary loss because of an intentional violation of this section may bring an action in any court of competent jurisdiction and shall recover costs, reasonable attorney fees, and the greater of: (1) $500; or (2) twice the amount of the pecuniary loss.\n(e) The relief provided in this section is in addition to remedies or penalties otherwise available against the same conduct under common law or other statutes of this state.",
	"repealed": false
}