{
	"id": "116C.7791",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.7791",
	"title": "116C.7791 REBATES FOR SOLAR PHOTOVOLTAIC MODULES.",
	"text": "For the purpose of this section, the following terms have the meanings given.\n(a) \"Installation\" means an array of solar photovoltaic modules attached to a building that will use the electricity generated by the solar photovoltaic modules or placed on a facility or property proximate to that building.\n(b) \"Manufactured\" means:\n(1) the material production of solar photovoltaic modules, including the tabbing, stringing, and lamination processes; or\n(2) the production of interconnections of low-voltage photoactive elements that produce the final useful photovoltaic output by a manufacturer operating in this state on May 18, 2010.\n(c) \"Qualified owner\" means an owner of a qualified property, but does not include an entity engaged in the business of generating or selling electricity at retail, or an unregulated subsidiary of such an entity.\n(d) \"Qualified property\" means a residence, multifamily residence, business, or publicly owned building located in the assigned service area of the utility subject to section 116C.779.\n(e) \"Solar photovoltaic module\" means the smallest, nondivisible, self-contained physical structure housing interconnected photovoltaic cells and providing a single direct current of electrical output.\nThe utility subject to section 116C.779 shall establish a program to provide rebates to an owner of a qualified property for installing solar photovoltaic modules manufactured in Minnesota after December 31, 2009. Any solar photovoltaic modules installed under this program and any expenses incurred by the utility operating the program shall be treated the same as solar installations and related expenses under section 216B.241.\n(a) To be eligible for a rebate under this section, a solar photovoltaic module:\n(1) must be manufactured in Minnesota;\n(2) must be installed on a qualified property as part of a system whose generating capacity does not exceed 40 kilowatts;\n(3) must be certified by Underwriters Laboratory, must have received the ETL listed mark from Intertek, or must have an equivalent certification from an independent testing agency;\n(4) may or may not be connected to a utility grid;\n(5) must be installed, or reviewed and approved, by a person certified as a solar photovoltaic installer by the North American Board of Certified Energy Practitioners; and\n(6) may not be used to sell, transmit, or distribute the electrical energy at retail, nor to provide end-use electricity to an offsite facility of the electrical energy generator. On-site generation is allowed to the extent provided for in section 216B.1611.\n(b) To be eligible for a rebate under this section, an applicant must have applied for and been awarded a rebate or other form of financial assistance available exclusively to owners of properties on which solar photovoltaic modules are installed that is offered by:\n(1) the utility serving the property on which the solar photovoltaic modules are to be installed; or\n(2) this state, under an authority other than this section.\n(c) An applicant who is otherwise ineligible for a rebate under paragraph (b) is eligible if the applicant's failure to secure a rebate or other form of financial assistance is due solely to a lack of available funds on the part of a utility or this state.\n(a) The amount of a rebate under this section is the difference between the sum of all rebates described in subdivision 3, paragraph (b), awarded to the applicant and $5 per watt of installed generating capacity.\n(b) Notwithstanding paragraph (a), the amount of all rebates or other forms of financial assistance awarded to an applicant by a utility and the state, including any rebate paid under this section, net of applicable federal income taxes applied at the highest applicable income tax rates, must not exceed 60 percent of the total installed cost of the solar photovoltaic modules.\n(c) Rebates must be awarded to eligible applicants beginning July 1, 2010.\n(d) The rebate must be paid out proportionately in five consecutive annual installments.\n(a) The following amounts must be allocated from the renewable development account established in section 116C.779 to a separate account for the purpose of providing the rebates for solar photovoltaic modules specified in this section:\n(1) $2,000,000 in fiscal year 2011;\n(2) $4,000,000 in fiscal year 2012;\n(3) $5,000,000 in fiscal year 2013;\n(4) $5,000,000 in fiscal year 2014; and\n(5) $5,000,000 in fiscal year 2015.\n(b) If, by the end of fiscal year 2015, insufficient qualified owners have applied for and met the requirements for rebates under this section to exhaust the funds available, any remaining balance shall be returned to the account established under section 116C.779.",
	"repealed": false
}