{
	"id": "2.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/2.93",
	"title": "2.93 INCARCERATED PERSONS IN DISTRICT PLANS.",
	"text": "(a) For the purposes of this section, the definitions have the meanings given.\n(b) \"Commissioner\" means the commissioner of corrections.\n(c) \"Director\" means the director of the Legislative Coordinating Commission.\n(d) \"Legislative Coordinating Commission\" means the Legislative Coordinating Commission established in section 3.303.\n(a) For purposes of drawing congressional, legislative, and all other election districts, the legislature and local governments must use the population from the federal decennial census as modified by reallocating and excluding persons who are incarcerated.\n(b) A person who was incarcerated in a state or federal correctional facility, as determined by the decennial census, and who has a last known address in Minnesota must be reallocated to the census block of the last known address.\n(c) A person who was incarcerated in a state or federal correctional facility, as determined by the decennial census, and who has a last known address outside of Minnesota or does not have a last known address must:\n(1) be excluded from the population count for purposes of drawing congressional, legislative, or political subdivision districts; and\n(2) be counted as part of the statewide population total.\n(a) On or before June 1 in a year ending in zero, the commissioner must provide to the director of the Legislative Coordinating Commission the following information, in electronic form, for each person incarcerated in a state correctional facility on April 1 in the year of the decennial census:\n(1) a unique identifier that does not include the person's name, Department of Corrections identification number, or other identifying information;\n(2) the street address of the correctional facility in which the person was incarcerated at the time of the report;\n(3) the residential address of the person immediately prior to incarceration, if known, or if the person resided in an area lacking a specific physical address immediately prior to incarceration, a description of the physical location where the person regularly stayed immediately prior to being incarcerated;\n(4) the following demographic information, if known: the racial and ethnic information collected by the census and whether the person is over the age of 18; and\n(5) any additional information the director of the Legislative Coordinating Commission deems necessary.\n(b) Notwithstanding any law to the contrary, the commissioner must provide the director with access to the best available data necessary to conduct the reallocations and exclusions required by this section.\nBy April 15 in a year ending in zero, the director must request each agency that operates a federal facility in Minnesota that incarcerates persons convicted of a criminal offense to provide the director with a report, including the information listed in subdivision 3. The information must reflect the persons incarcerated in the federal facility on April 1 of that year. If information is provided pursuant to this subdivision, the information must be provided by June 1 of the year ending in zero. If information is not provided pursuant to this subdivision, persons incarcerated at federal facilities must be treated as having no known last address and must be excluded as provided in subdivision 2, paragraph (c).\n(a) The director must reallocate and exclude people who are incarcerated in state or federal correctional facilities as provided in this subdivision and subdivision 2. Within 30 calendar days of receiving the Public Law 94-171 data from the United States Census Bureau, the director must post the population counts that reflect all required reallocations and exclusions on the Legislative Coordinating Commission's website.\n(b) The director must, in consultation with the commissioner, develop a standardized format and technical guidelines to be used in collecting addresses from incarcerated persons. The commissioner must use this format and follow the guidelines in collecting addresses. The commissioner and the director may enter a memorandum of understanding detailing the additional details regarding the methodology to be used and the format and manner in which the data will be provided. Notwithstanding any law to the contrary, the commissioner must provide the director with access to the best available data necessary to conduct the reallocations and exclusions required by this section.\n(c) Prior to reallocating and excluding incarcerated persons, the director must geocode addresses received from the commissioner. When geocoding addresses, the director must accept an address that is an exact match or is approximated to the street level and reject any address that is approximated to the center of a zip code, city, county, or state. The director must only reallocate those addresses that are accepted pursuant to this paragraph. The director must not reallocate any person at an address that was rejected but must instead count that person as part of the statewide population total.\n(d) The director must not disseminate data received pursuant to this section in any manner, except as explicitly required by state or federal law.",
	"repealed": false
}