{
	"id": "11A.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.245",
	"title": "11A.245 INVESTMENT IN RUSSIA AND BELARUS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Active business operations\" means all business operations that are not inactive business operations.\n(c) \"Belarus\" means the government of the Republic of Belarus and its instrumentalities or political subdivisions, and companies owned or controlled by the Republic of Belarus.\n(d) \"Company\" means any sole proprietorship, organization, association, corporation, partnership, joint venture, limited partnership, limited liability partnership, limited liability company, or other entity or business association, including all wholly owned subsidiaries, majority-owned subsidiaries, parent companies, or affiliates of such entities or business associations, that exists for profit-making purposes.\n(e) \"Direct holdings\" means all publicly traded debt and equity securities, including depository receipts representing ownership rights of such securities, of an entity subject to this section, or derivatives or notes representing exposure to such securities, that are held directly by the state board or held in an account or fund in which the state board owns all shares or interests.\n(f) \"Inactive business operations\" means the continued holding or renewal of rights to property previously operated for the purpose of generating revenues but not presently deployed for such a purpose.\n(g) \"Indirect holdings\" means all investments held in an account or fund, including a mutual fund, a real estate fund, a private equity fund, or a commingled fund, managed by one or more persons who are not employed by the state board, in which the public funds own shares or interests together with other investors who are not subject to this section.\n(h) \"Russia\" means the government of the Russian Federation or its instrumentalities or political subdivisions, and companies owned or controlled by the Russian Federation.\n(a) The state board must sell, redeem, or withdraw, in a fiscally prudent manner and consistent with applicable laws and regulations not in conflict with this section, all direct holdings of the following assets:\n(1) securities issued by a company with a principal place of business in Russia or Belarus, or depository receipts representing ownership rights to such securities;\n(2) securities issued by Russia or Belarus;\n(3) securities issued by any governmental unit of Russia or Belarus;\n(4) currency issued by Russia, Belarus, or a governmental unit of Russia or Belarus; and\n(5) derivatives or notes representing exposure to any assets listed in this subdivision.\n(b) For purposes of this subdivision, when determining whether a company has a principal place of business in Russia or Belarus, the state board must give consideration to the company's country of risk; domicile; country of incorporation; the country in which the company's securities are issued; and other relevant factors as determined by the state board or its director.\n(c) At least quarterly, the director must report to the state board on the status of any actions taken under this subdivision.\nTo the extent practicable, the sale, redemption, or withdrawal of assets under subdivision 2 must be completed according to the following schedule:\n(1) at least 50 percent of any direct holdings must be removed from the state board's assets under management by nine months after April 2, 2022; and\n(2) 100 percent of any direct holdings must be removed from the state board's assets under management within 15 months after April 2, 2022.\nThe state board may not further acquire securities that are subject to sale, redemption, or withdrawal under subdivision 2.\nIf the federal government excludes an asset from its present, or any future, federal sanctions relating to Russia or Belarus, that asset is exempt from the divestment requirements and the investment prohibitions in this section.\nSubdivision 2 does not apply to any of the following:\n(1) investments in a company that is primarily engaged in supplying goods or services intended to relieve human suffering in Russia or Belarus;\n(2) investments in a company that is primarily engaged in promoting health; education; or journalistic, religious, or welfare activities in Russia or Belarus; and\n(3) investments in a United States company that is authorized by the federal government to have active business operations in Russia or Belarus.\nSubdivision 2 does not apply to indirect holdings in actively managed investment funds. The state board must submit letters to the managers of investment funds containing assets that would otherwise be subject to sale, redemption, or withdrawal under subdivision 2 requesting the managers to consider removing those assets from the fund or to create a similar actively managed fund with indirect holdings that do not include those assets. If a manager creates a similar fund, the state board shall promptly replace all applicable investments with investments in the similar fund consistent with prudent investing standards. For the purposes of this section, private equity funds shall be deemed to be actively managed investment funds.\nBy January 15 of each calendar year, the state board shall submit a report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over the state board. The report must include:\n(1) a list of all investments sold, redeemed, or withdrawn in compliance with subdivision 2;\n(2) a list of all prohibited investments under subdivision 4; and\n(3) a description of any progress made under subdivision 7.\nThis section ceases to be operative if the President of the United States determines and certifies that state legislation similar to this section interferes with the conduct of United States foreign policy.\nThe state board, including its executive director and staff, is exempt from any statutory or common law obligations that conflict with actions taken in compliance with this section, including all good-faith determinations regarding companies as required by this section, including any obligations regarding the choice of asset managers, investment funds, or investments for the State Board of Investment's securities portfolios.\nThe provisions of this section are severable. If any provision of this section or its application is held invalid, that invalidity does not affect other provisions or applications that can be given effect without the invalid provision or application.",
	"repealed": false
}