{
	"id": "260C.007",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.007",
	"title": "260C.007 DEFINITIONS.",
	"text": "As used in this chapter, the terms defined in this section have the same meanings given to them.\n\"Agency\" means the responsible social services agency or a licensed child-placing agency.\n\"Case plan\" means any plan for the delivery of services to a child and parent or guardian, or, when reunification is not required, the child alone, that is developed according to the requirements of section 245.4871, subdivision 19 or 21; 245.492, subdivision 16; 256B.092; 260C.212, subdivision 1; or 260E.26.\n\"Child\" means an individual under 18 years of age. For purposes of this chapter and chapter 260D, child also includes individuals under age 21 who are in foster care pursuant to section 260C.451.\n\"Child abuse\" means an act that involves a minor victim that constitutes a violation of section 609.221, 609.222, 609.223, 609.224, 609.2242, 609.282, 609.322, 609.324, 609.342, 609.343, 609.344, 609.345, 609.3458, 609.377, 609.378, 617.246, or that is physical or sexual abuse as defined in section 260E.03, or an act committed in another state that involves a minor victim and would constitute a violation of one of these sections if committed in this state.\n[See Note.]\n\"Child in need of protection or services\" means a child who is in need of protection or services because the child:\n(1) is abandoned or without parent, guardian, or custodian;\n(2)(i) has been a victim of physical or sexual abuse as defined in section 260E.03, subdivision 18 or 20, (ii) resides with or has resided with a victim of child abuse as defined in subdivision 5 or domestic child abuse as defined in subdivision 13, (iii) resides with or would reside with a perpetrator of domestic child abuse as defined in subdivision 13 or child abuse as defined in subdivision 5 or 13, or (iv) is a victim of emotional maltreatment as defined in subdivision 15;\n(3) is without necessary food, clothing, shelter, education, or other required care for the child's physical or mental health or morals because the child's parent, guardian, or custodian is unable or unwilling to provide that care;\n(4) is without the special care made necessary by a physical, mental, or emotional condition because the child's parent, guardian, or custodian is unable or unwilling to provide that care;\n(5) is medically neglected, which includes, but is not limited to, the withholding of medically indicated treatment from an infant with a disability with a life-threatening condition. The term \"withholding of medically indicated treatment\" means the failure to respond to the infant's life-threatening conditions by providing treatment, including appropriate nutrition, hydration, and medication which, in the treating physician's, advanced practice registered nurse's, or physician assistant's reasonable medical judgment, will be most likely to be effective in ameliorating or correcting all conditions, except that the term does not include the failure to provide treatment other than appropriate nutrition, hydration, or medication to an infant when, in the treating physician's, advanced practice registered nurse's, or physician assistant's reasonable medical judgment:\n(i) the infant is chronically and irreversibly comatose;\n(ii) the provision of the treatment would merely prolong dying, not be effective in ameliorating or correcting all of the infant's life-threatening conditions, or otherwise be futile in terms of the survival of the infant; or\n(iii) the provision of the treatment would be virtually futile in terms of the survival of the infant and the treatment itself under the circumstances would be inhumane;\n(6) is one whose parent, guardian, or other custodian for good cause desires to be relieved of the child's care and custody, including a child who entered foster care under a voluntary placement agreement between the parent and the responsible social services agency under section 260C.227;\n(7) has been placed for adoption or care in violation of law;\n(8) is without proper parental care because of the emotional, mental, or physical disability, or state of immaturity of the child's parent, guardian, or other custodian. A child is not considered to be without proper parental care based solely on the disability of the child's parent, guardian, or custodian;\n(9) is one whose behavior, condition, or environment is such as to be injurious or dangerous to the child or others. An injurious or dangerous environment may include, but is not limited to, the exposure of a child to criminal activity in the child's home;\n(10) is experiencing growth delays, which may be referred to as failure to thrive, that have been diagnosed by a physician and are due to parental neglect;\n(11) is a sexually exploited youth;\n(12) is a labor trafficked youth;\n(13) has committed a delinquent act or a juvenile petty offense before becoming ten years old. This clause expires July 31, 2026;\n(14) is a runaway;\n(15) is a habitual truant;\n(16) has been found incompetent to proceed or has been found not guilty by reason of mental illness or mental deficiency in connection with a delinquency proceeding, a certification under section 260B.125, an extended jurisdiction juvenile prosecution, or a proceeding involving a juvenile petty offense;\n(17) has a parent whose parental rights to one or more other children were involuntarily terminated or whose custodial rights to another child have been involuntarily transferred to a relative and there is a case plan prepared by the responsible social services agency documenting a compelling reason why filing the termination of parental rights petition under section 260C.503, subdivision 2, is not in the best interests of the child; or\n(18) effective August 1, 2026, has committed a delinquent act or a juvenile petty offense before becoming 13 years old.\n[See Note.]\n\"Child-placing agency\" means anyone licensed under sections 142B.01 to 142B.79 and 252.28, subdivision 2.\n\"Compelling reasons\" means an individualized determination by the responsible social services agency, which is approved by the court, related to a request by the agency not to initiate proceedings to terminate parental rights or transfer permanent legal and physical custody of a child to the child's relative or former noncustodial parent under section 260C.503, subdivision 2.\n\"Court\" means juvenile court unless otherwise specified in this section.\n\"Custodian\" means any person who is under a legal obligation to provide care and support for a minor or who is in fact providing care and support for a minor. This subdivision does not impose upon persons who are not otherwise legally responsible for providing a child with necessary food, clothing, shelter, education, or medical care a duty to provide that care. For an Indian child, custodian means any Indian person who has legal custody of an Indian child under tribal law or custom or under state law or to whom temporary physical care, custody, and control has been transferred by the parent of the child, as provided in section 260.755, subdivision 10.\n\"Delinquent child\" has the meaning given in section 260B.007, subdivision 6.\n\"Developmental disability\" means developmental disability as defined in United States Code, title 42, section 6001(8).\n\"Domestic child abuse\" means:\n(1) any physical injury to a minor family or household member inflicted by an adult family or household member other than by accidental means;\n(2) subjection of a minor family or household member by an adult family or household member to any act which constitutes a violation of sections 609.321 to 609.324, 609.342, 609.343, 609.344, 609.345, 609.3458, or 617.246; or\n(3) physical or sexual abuse as defined in section 260E.03, subdivision 18 or 20.\n\"Egregious harm\" means the infliction of bodily harm to a child or neglect of a child which demonstrates a grossly inadequate ability to provide minimally adequate parental care. The egregious harm need not have occurred in the state or in the county where a termination of parental rights action has proper venue. Egregious harm includes, but is not limited to:\n(1) conduct toward a child that constitutes a violation of sections 609.185 to 609.2114, 609.222, subdivision 2, 609.223, or any other similar law of any other state;\n(2) the infliction of \"substantial bodily harm\" to a child, as defined in section 609.02, subdivision 7a;\n(3) conduct toward a child that constitutes felony malicious punishment of a child under section 609.377;\n(4) conduct toward a child that constitutes felony unreasonable restraint of a child under section 609.255, subdivision 3;\n(5) conduct toward a child that constitutes felony neglect or endangerment of a child under section 609.378;\n(6) conduct toward a child that constitutes assault under section 609.221, 609.222, or 609.223;\n(7) conduct toward a child that constitutes sex trafficking, solicitation, inducement, promotion of, or receiving profit derived from prostitution under section 609.322;\n(8) conduct toward a child that constitutes murder or voluntary manslaughter as defined by United States Code, title 18, section 1111(a) or 1112(a);\n(9) conduct toward a child that constitutes aiding or abetting, attempting, conspiring, or soliciting to commit a murder or voluntary manslaughter that constitutes a violation of United States Code, title 18, section 1111(a) or 1112(a); or\n(10) conduct toward a child that constitutes criminal sexual conduct under sections 609.342 to 609.345 or sexual extortion under section 609.3458.\n\"Emotional maltreatment\" means the consistent, deliberate infliction of mental harm on a child by a person responsible for the child's care, that has an observable, sustained, and adverse effect on the child's physical, mental, or emotional development. \"Emotional maltreatment\" does not include reasonable training or discipline administered by the person responsible for the child's care or the reasonable exercise of authority by that person.\n\"Emotionally disturbed\" means emotional disturbance as described in section 245.4871, subdivision 15.\n\"Family and permanency team\" means a team consisting of the child's parent or legal custodian, relatives, foster care providers, and professionals who are resources to the child's family such as teachers, medical or mental health providers who have treated the child, or clergy, as appropriate. In the case of an Indian child, the family and permanency team includes tribal representatives, delegates, and cultural resources as identified by the child's tribe. Consistent with section 260C.212, subdivision 1, paragraph (b), if the child is age 14 or older, the team must also include two team members that the child selects who are not the child's foster parent or caseworker. The responsible social services agency may reject an individual that the child selects if the agency has good cause to believe that the individual would not act in the best interests of the child.\n\"Family foster home\" means the home of an individual or family who is licensed for child foster care under Minnesota Statutes, chapter 142B, meeting the standards in Minnesota Rules, chapter 2960, excluding foster residence settings licensed under Minnesota Rules, parts 2960.3000 to 2960.3200, or licensed or approved by a tribe in accordance with tribal standards with whom the foster child resides. Family foster home includes an emergency unlicensed relative placement under section 142B.06.\n\"Family or household members\" means spouses, former spouses, parents and children, persons related by blood, and persons who are presently residing together or who have resided together in the past, and persons who have a child in common regardless of whether they have been married or have lived together at any time.\n(a) \"Foster care\" means 24-hour substitute care for a child for whom a responsible social services agency has placement and care responsibility and:\n(1) who is placed away from the child's parent or guardian in foster family homes, foster homes of relatives, group homes, emergency shelters, residential facilities not excluded in this subdivision, child care institutions, and preadoptive homes;\n(2) who is colocated with the child's parent or guardian in a licensed residential family-based substance use disorder treatment program as defined in subdivision 22a; or\n(3) who is returned to the care of the child's parent or guardian from whom the child was removed under a trial home visit pursuant to section 260C.201, subdivision 1, paragraph (a), clause (3).\n(b) A child is in foster care under this definition regardless of whether the facility is licensed and payments are made for the cost of care. Nothing in this definition creates any authority to place a child in a home or facility that is required to be licensed which is not licensed. \"Foster care\" does not include placement in any of the following facilities: hospitals, inpatient chemical dependency treatment facilities where the child is the recipient of the treatment, facilities that are primarily for delinquent children, any corrections facility or program within a particular correction's facility not meeting requirements for title IV-E facilities as determined by the commissioner, facilities to which a child is committed under the provision of chapter 253B, forestry camps, or jails. Foster care is intended to provide for a child's safety or to access treatment. Foster care must not be used as a punishment or consequence for a child's behavior.\n\"Habitual truant\" means a child under the age of 17 years who is absent from attendance at school without lawful excuse for seven school days per school year if the child is in elementary school or for one or more class periods on seven school days per school year if the child is in middle school, junior high school, or high school or a child who is 17 years of age who is absent from attendance at school without lawful excuse for one or more class periods on seven school days per school year and who has not lawfully withdrawn from school under section 120A.22, subdivision 8.\n\"Indian,\" consistent with section 260.755, subdivision 7, means a person who is a member of an Indian tribe or who is an Alaskan native and a member of a regional corporation as defined in section 7 of the Alaska Native Claims Settlement Act, United States Code, title 43, section 1606.\n\"Indian child,\" consistent with section 260.755, subdivision 8, means an unmarried person who is under age 18 and is:\n(1) a member of an Indian tribe; or\n(2) eligible for membership in an Indian tribe.\n\"Legal authority to place the child\" means that the agency has legal responsibility for the care and control of the child while the child is in foster care. The agency may have legal authority to place a child through a court order under this chapter through a voluntary placement agreement between the agency and the child's parent under section 260C.227 or, in the case of an Indian child, through tribal court.\n\"Legal custody\" means the right to the care, custody, and control of a child who has been taken from a parent by the court in accordance with the provisions of section 260C.201 or 260C.317. The expenses of legal custody are paid in accordance with the provisions of section 260C.331.\n\"Licensed residential family-based substance use disorder treatment program\" means a residential treatment facility that provides the parent or guardian with parenting skills training, parent education, or individual and family counseling, under an organizational structure and treatment framework that involves understanding, recognizing, and responding to the effects of all types of trauma according to recognized principles of a trauma-informed approach and trauma-specific interventions to address the consequences of trauma and facilitate healing. The residential program must be licensed by the Department of Human Services under chapters 245A and 245G or Tribally licensed or approved as a residential substance use disorder treatment program specializing in the treatment of clients with children.\n\"Minor\" means an individual under 18 years of age.\n\"Neglected and in foster care\" means a child:\n(1) who has been placed in foster care by court order; and\n(2) whose parents' circumstances, condition, or conduct are such that the child cannot be returned to them; and\n(3) whose parents, despite the availability of needed rehabilitative services, have failed to make reasonable efforts to adjust their circumstances, condition or conduct, or have willfully failed to meet reasonable expectations with regard to visiting the child or providing financial support for the child.\n(a) \"Parent\" means a person who has a legal parent and child relationship with a child which confers or imposes on the person legal rights, privileges, duties, and obligations consistent with sections 257.51 to 257.74 or 257.75. It includes the mother and child relationship and the father and child relationship. For matters governed by the Indian Child Welfare Act, parent includes any Indian person who has adopted a child by tribal law or custom, as provided in section 260.755, subdivision 14, and does not include the unwed father where paternity has not been acknowledged or established.\n(b) A legally recognized parent and child relationship is established for purposes of this chapter between:\n(1) a child and a biological mother, by proof of her having given birth to the child, or under sections 257.51 to 257.74 or 257.75;\n(2) a child and father when:\n(i) there is a presumption of paternity under section 257.55, subdivision 1, paragraph (a), (b), or (c), and no action has been taken to declare the nonexistence of the father and child relationship;\n(ii) there is a presumption of paternity under section 257.55, subdivision 1, paragraph (d), and there is an adjudication of paternity under sections 257.51 to 257.74, or the father and mother have signed a recognition of parentage having the effect of an adjudication under section 257.75;\n(iii) there is a presumption of paternity under section 257.55, subdivision 1, paragraph (e), (f), (g), or (h), and there is an adjudication of paternity under sections 257.51 to 257.74;\n(iv) there is no presumption of paternity under section 257.55, but the father has been adjudicated by court order under sections 257.51 to 257.74;\n(v) there is no presumption of paternity under section 257.55, but the father and mother have signed a recognition of parentage having the effect of adjudication under section 257.75;\n(vi) there is a positive test result under section 257.62, subdivision 5, and the father is adjudicated as the father of the child either by court order under sections 257.51 to 257.74, or because the father and the child's mother have signed a recognition of parentage having the effect of adjudication under section 257.75; or\n(vii) the parent and child relationship is established under section 260.755, subdivision 14; or\n(3) a child and an adoptive parent by proof of adoption.\n\"Permanency plan\" means the established goal in the out-of-home placement plan that will achieve a safe, permanent home for the child. There are four permanency goals for children:\n(1) reunification with the child's parent or legal guardian;\n(2) placement with other relatives;\n(3) adoption; or\n(4) establishment of a new legal guardianship.\n\"Person\" includes any individual, association, corporation, partnership, and the state or any of its political subdivisions, departments, or agencies.\n\"Putative father\" has the meaning given in section 259.21, subdivision 12.\n\"Relative of an Indian child\" means a person who is a member of the Indian child's family as defined in the Indian Child Welfare Act of 1978, United States Code, title 25, section 1903, paragraphs (2), (6), and (9), and who is an extended family member as defined in section 260.755, subdivision 5b, of the Minnesota Indian Family Preservation Act.\n(a) \"Qualified individual\" means a trained culturally competent professional or licensed clinician, including a mental health professional under section 245.4871, subdivision 27, who is qualified to conduct the assessment approved by the commissioner. The qualified individual must not be an employee of the responsible social services agency or an individual connected to or affiliated with any placement setting in which a responsible social services agency has placed children.\n(b) When the Indian Child Welfare Act of 1978, United States Code, title 25, sections 1901 to 1963, applies to a child, the county must contact the child's tribe without delay to give the tribe the option to designate a qualified individual who is a trained culturally competent professional or licensed clinician, including a mental health professional under section 245.4871, subdivision 27, who is not employed by the responsible social services agency and who is not connected to or affiliated with any placement setting in which a responsible social services agency has placed children. Only a federal waiver that demonstrates maintained objectivity may allow a responsible social services agency employee or Tribal employee affiliated with any placement setting in which the responsible social services agency has placed children to be designated the qualified individual.\n\"Qualified residential treatment program\" means a children's residential treatment program licensed under chapter 245A or licensed or approved by a tribe that is approved to receive foster care maintenance payments under section 142A.418 that:\n(1) has a trauma-informed treatment model designed to address the needs of children with serious emotional or behavioral disorders or disturbances;\n(2) has registered or licensed nursing staff and other licensed clinical staff who:\n(i) provide care within the scope of their practice; and\n(ii) are available 24 hours per day and seven days per week;\n(3) is accredited by any of the following independent, nonprofit organizations: the Commission on Accreditation of Rehabilitation Facilities (CARF), the Joint Commission on Accreditation of Healthcare Organizations (JCAHO), and the Council on Accreditation (COA), or any other nonprofit accrediting organization approved by the United States Department of Health and Human Services;\n(4) if it is in the child's best interests, facilitates participation of the child's family members in the child's treatment programming consistent with the child's out-of-home placement plan under sections 260C.212, subdivision 1, and 260C.708;\n(5) facilitates outreach to family members of the child, including siblings;\n(6) documents how the facility facilitates outreach to the child's parents and relatives, as well as documents the child's parents' and other relatives' contact information;\n(7) documents how the facility includes family members in the child's treatment process, including after the child's discharge, and how the facility maintains the child's sibling connections; and\n(8) provides the child and child's family with discharge planning and family-based aftercare support for at least six months after the child's discharge. Aftercare support may include clinical care consultation under section 256B.0671, subdivision 7, and mental health certified family peer specialist services under section 256B.0616.\n\"Relative\" means a person related to the child by blood, marriage, or adoption; the legal parent, guardian, or custodian of the child's siblings; or an individual who is an important friend of the child or of the child's parent or custodian, including an individual with whom the child has resided or had significant contact or who has a significant relationship to the child or the child's parent or custodian.\n\"Responsible social services agency\" means the county social services agency that has responsibility for public child welfare and child protection services and includes the provision of adoption services as an agent of the commissioner of children, youth, and families.\n\"Residential treatment facility\" means a 24-hour-a-day program that provides treatment for children with emotional disturbance, consistent with section 245.4871, subdivision 32, and includes a licensed residential program specializing in caring 24 hours a day for children with a developmental delay or related condition. A residential treatment facility does not include a psychiatric residential treatment facility under section 256B.0941 or a family foster home as defined in section 260C.007, subdivision 16b.\n\"Runaway\" means an unmarried child under the age of 18 years who is absent from the home of a parent or other lawful placement without the consent of the parent, guardian, or lawful custodian.\n\"Secure detention facility\" means a physically restricting facility, including but not limited to a jail, a hospital, a state institution, a residential treatment center, or a detention home used for the temporary care of a child pending court action.\n\"Shelter care facility\" means a physically unrestricting facility, such as but not limited to, a hospital, a group home or a licensed facility for foster care, used for the temporary care of a child pending court action.\n\"Sexually exploited youth\" means an individual who:\n(1) is alleged to have engaged in conduct which would, if committed by an adult, violate any federal, state, or local law relating to being hired, offering to be hired, or agreeing to be hired by another individual to engage in sexual penetration or sexual conduct;\n(2) is a victim of a crime described in section 609.342, 609.343, 609.344, 609.345, 609.3451, 609.3453, 609.3458, 609.352, 617.246, or 617.247;\n(3) is a victim of a crime described in United States Code, title 18, section 2260; 2421; 2422; 2423; 2425; 2425A; or 2256;\n(4) is a sex trafficking victim as defined in section 609.321, subdivision 7b; or\n(5) is a victim of commercial sexual exploitation as defined in United States Code, title 22, section 7102(11)(A) and (12).\n\"Sibling\" means one of two or more individuals who have one or both parents in common through blood, marriage, or adoption. This includes siblings as defined by the child's tribal code or custom. Sibling also includes an individual who would have been considered a sibling but for a termination of parental rights of one or both parents, suspension of parental rights under tribal code, or other disruption of parental rights such as the death of a parent.\nFor the purposes of this section, \"labor trafficked youth\" means a child, as defined in subdivision 4, who:\n(1) is a labor trafficking victim as defined in section 609.281, subdivision 6; or\n(2) is a victim of severe forms of trafficking in persons as defined in United States Code, title 22, section 7102(11)(B).\nFor purposes of this section, \"human trafficking\" includes labor trafficking as defined in section 609.281, subdivision 5; sex trafficking as defined in section 609.321, subdivision 7a; and severe forms of trafficking in persons as defined in United States Code, title 22, section 7102(11).",
	"repealed": false
}