{
	"id": "299C.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.155",
	"title": "299C.155 STANDARDIZED EVIDENCE COLLECTION; DNA ANALYSIS.",
	"text": "As used in this section, \"DNA analysis\" means the process through which deoxyribonucleic acid (DNA) in a human biological specimen is analyzed and compared with DNA from another human biological specimen for identification purposes.\nThe bureau shall develop uniform procedures and protocols for collecting evidence in cases of alleged or suspected criminal sexual conduct, including procedures and protocols for the collection and preservation of human biological specimens for DNA analysis. Law enforcement agencies and medical personnel who conduct evidentiary exams shall use the uniform procedures and protocols in their investigation of criminal sexual conduct offenses. The uniform procedures and protocols developed under this subdivision are not subject to the rulemaking provisions of chapter 14.\nThe bureau shall adopt uniform procedures and protocols to maintain, preserve, and analyze human biological specimens for DNA. The bureau shall establish a centralized system to cross-reference data obtained from DNA analysis. Data contained on the bureau's centralized system is private data on individuals, as that term is defined in section 13.02. The bureau's centralized system may only be accessed by authorized law enforcement personnel and used solely for law enforcement identification purposes. The remedies in section 13.08 apply to a violation of this subdivision. The uniform procedures and protocols developed under this subdivision are not subject to the rulemaking provisions of chapter 14.\nThe bureau shall perform DNA analysis and make data obtained available to law enforcement officials in connection with criminal investigations in which human biological specimens have been recovered. Upon request, the bureau shall also make the data available to the prosecutor and the subject of the data in any subsequent criminal prosecution of the subject. The results of the bureau's DNA analysis and related records are private data on individuals, as that term is defined in section 13.02, and may only be used for law enforcement identification purposes. The remedies in section 13.08 apply to a violation of this subdivision.",
	"repealed": false
}