{
	"id": "148E.116",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.116",
	"title": "148E.116 PROVISIONAL LICENSE; SUPERVISED PRACTICE.",
	"text": "After receiving a provisional license from the board, the licensee must obtain at least 37.5 hours of supervision according to the requirements of this section.\nThe supervision required by subdivision 1 must be obtained during the first 2,000 hours of social work practice after the effective date of the provisional license. At least three hours of supervision must be obtained during every 160 hours of practice under a provisional license until a permanent license is issued.\n(a) Half of the supervision hours required by subdivision 1 must consist of one-on-one supervision. The supervision must be provided either in person or via eye-to-eye electronic media while maintaining visual contact.\n(b) Half of the supervision hours must consist of one or more of the following types of supervision:\n(1) one-on-one supervision provided in person or via eye-to-eye electronic media while maintaining visual contact; or\n(2) group supervision provided in person, by telephone, or via eye-to-eye electronic media while maintaining visual contact.\n(c) Group supervision must not exceed six supervisees.\n(d) Supervision must not be provided by email.\n(a) The supervision required by subdivision 1 must be provided by a supervisor who meets the requirements in section 148E.120 and has completed 30 hours of training in supervision, which may be satisfied by completing academic coursework in supervision or continuing education courses in supervision as defined in section 148E.010, subdivision 18.\n(b) Supervision must be provided:\n(1) if the supervisee is not engaged in clinical practice and the supervisee has a provisional license to practice as a licensed social worker, by:\n(i) a licensed social worker who has completed the supervised practice requirements;\n(ii) a licensed graduate social worker who has completed the supervised practice requirements;\n(iii) a licensed independent social worker; or\n(iv) a licensed independent clinical social worker;\n(2) if the supervisee is not engaged in clinical practice and the supervisee has a provisional license to practice as a licensed graduate social worker, licensed independent social worker, or licensed independent clinical social worker, by:\n(i) a licensed graduate social worker who has completed the supervised practice requirements;\n(ii) a licensed independent social worker; or\n(iii) a licensed independent clinical social worker;\n(3) if the supervisee is engaged in clinical practice and the supervisee has a provisional license to practice as a licensed graduate social worker, licensed independent social worker, or licensed independent clinical social worker, by a licensed independent clinical social worker; or\n(4) by a supervisor who meets the requirements in section 148E.120, subdivision 2.\nMS 2008 [Repealed, 2009 c 157 art 2 s 14]",
	"repealed": false
}