{
	"id": "103D.905",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.905",
	"title": "103D.905 FUNDS OF WATERSHED DISTRICT.",
	"text": "The money of a watershed district consists of the funds established in this section.\n(a) An organizational expense fund, consisting of an ad valorem tax levy, shall not exceed 0.01596 percent of estimated market value, or $60,000, whichever is less. The money in the fund shall be used for organizational expenses and preparation of the watershed management plan for projects.\n(b) The managers may borrow from the affected counties up to 75 percent of the anticipated funds to be collected from the organizational expense fund levy and the counties affected may make the advancements.\n(c) The advancement of anticipated funds shall be apportioned among affected counties in the same ratio as the net tax capacity of the area of the counties within the watershed district bears to the net tax capacity of the entire watershed district. If a watershed district is enlarged, an organizational expense fund may be levied against the area added to the watershed district in the same manner as provided in this subdivision.\n(d) Unexpended funds collected for the organizational expense may be transferred to the administrative fund and used for the purposes of the administrative fund.\nA general fund, consisting of an ad valorem tax levy, may not exceed 0.096 percent of estimated market value, or $500,000, whichever is less. The money in the fund shall be used for general administrative expenses and for the construction or implementation and maintenance of projects of common benefit to the watershed district. The managers may make an annual levy for the general fund as provided in section 103D.911. In addition to the annual general levy, the managers may annually levy a tax not to exceed 0.00798 percent of estimated market value for a period not to exceed 15 consecutive years to pay the cost attributable to the basic water management features of projects initiated by petition of a political subdivision within the watershed district or by petition of at least 50 resident owners whose property is within the watershed district.\nA bond fund consists of the proceeds of special assessments, stormwater charges, loan repayments, and ad valorem tax levies pledged by the watershed district for the payment of bonds or notes issued by the watershed district. The bond fund is to be used for the payment of the principal of, premium or administrative surcharge, if any, and interest on the bonds and notes issued by the watershed district and for payments required to be made to the federal government under section 148(f) of the Internal Revenue Code of 1986, as amended through December 31, 1996.\n(a) A construction or implementation fund consists of:\n(1) the proceeds of watershed district bonds or notes or of the sale of county bonds;\n(2) construction or implementation loans or grants from the state or from any agency of the federal government; and\n(3) special assessments, stormwater charges, loan repayments, and ad valorem tax levies levied or to be levied to supply funds for the construction or implementation of the projects of the watershed district, including reservoirs, ditches, dikes, canals, channels, stormwater facilities, sewage treatment facilities, wells, and other works, and the expenses incident to and connected with the construction or implementation.\n(b) Construction or implementation loans or grants from the state or from an agency of the federal government may be repaid from the proceeds of watershed district bonds or notes or from the collections of stormwater charges, loan repayments, ad valorem tax levies, or special assessments on properties benefited by the project.\nA preliminary fund consists of funds authorized to be provided. The preliminary fund is to be used for preliminary work on proposed works of the watershed district.\nRepair and maintenance funds are established under section 103D.631, subdivision 2.\n(a) A survey and data acquisition fund is established and used only if other funds are not available to the watershed district to pay for making necessary surveys and acquiring data.\n(b) The survey and data acquisition fund consists of the proceeds of a property tax that can be levied only once every five years. The levy may not exceed 0.02418 percent of estimated market value.\n(c) The balance of the survey and data acquisition fund may not exceed $50,000.\n(d) In a subsequent proceeding for a project where a survey has been made, the attributable cost of the survey as determined by the managers shall be included as a part of the cost of the work and the sum shall be repaid to the survey and data acquisition fund.\n(a) In addition to other tax levies provided in this section or in any other law, a watershed district may levy a tax:\n(1) to pay the costs of projects undertaken by the watershed district that are funded, in whole or in part, with money appropriated by law for grants or loans to the district;\n(2) to pay the principal of, or premium or administrative surcharge, if any, and interest on bonds or notes issued by the watershed district to repay such loans; or\n(3) to repay such loans.\n(b) Taxes levied with respect to payment of bonds and notes must comply with section 475.61.",
	"repealed": false
}