{
	"id": "144.058",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.058",
	"title": "144.058 INTERPRETER SERVICES QUALITY INITIATIVE.",
	"text": "(a) The commissioner of health shall establish a voluntary statewide roster and develop a plan for a registry and certification process for interpreters who provide high quality, spoken language health care interpreter services. The roster, registry, and certification process shall be based on the findings and recommendations set forth by the Interpreter Services Work Group required under Laws 2007, chapter 147, article 12, section 13.\n(b) By January 1, 2009, the commissioner shall establish a roster of all available interpreters to address access concerns, particularly in rural areas.\n(c) By January 15, 2010, the commissioner shall:\n(1) develop a plan for a registry of spoken language health care interpreters, including:\n(i) development of standards for registration that set forth educational requirements, training requirements, demonstration of language proficiency and interpreting skills, agreement to abide by a code of ethics, and a criminal background check;\n(ii) recommendations for appropriate alternate requirements in languages for which testing and training programs do not exist;\n(iii) recommendations for appropriate fees; and\n(iv) recommendations for establishing and maintaining the standards for inclusion in the registry; and\n(2) develop a plan for implementing a certification process based on national testing and certification processes for spoken language interpreters 12 months after the establishment of a national certification process.\n(d) The commissioner shall consult with the Interpreter Stakeholder Group of the Upper Midwest Translators and Interpreters Association for advice on the standards required to plan for the development of a registry and certification process.\n(e) The commissioner shall charge an annual fee of $50 to include an interpreter in the roster. Fee revenue shall be deposited in the state government special revenue fund. All fees are nonrefundable.",
	"repealed": false
}