{
	"id": "122A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.06",
	"title": "122A.06 DEFINITIONS.",
	"text": "For the purpose of sections 122A.04 to 122A.093 and 122A.15 to 122A.33, the terms defined in this section have the meanings given them, unless another meaning is clearly indicated.\n\"Teacher\" means a classroom teacher or other similar professional employee required by law to hold a license from the Professional Educator Licensing and Standards Board.\n\"Board\" means the Professional Educator Licensing and Standards Board.\nMS 2022 [Repealed, 2023 c 55 art 3 s 12]\nA \"field,\" \"licensure area,\" or \"subject area\" means the content area in which a teacher may become licensed to teach.\n\"Shortage area\" means:\n(1) licensure fields and economic development regions reported by the Professional Educator Licensing and Standards Board as experiencing a teacher shortage; and\n(2) economic development regions where the aggregate percentage of Indigenous teachers and teachers of color in the region is lower than the aggregate percentage of kindergarten through grade 12 Indigenous students and students of color in that region. Only individuals who close the gap between these percentages qualify as filling a shortage by this definition.\n\"Teacher preparation program\" means a program approved by the Professional Educator Licensing and Standards Board for the purpose of preparing individuals for a specific teacher licensure field in Minnesota.\n\"Teacher preparation program provider\" or \"unit\" means an entity that has primary responsibility for overseeing and delivering a teacher preparation program. Teacher preparation program providers include institutes of higher education, school districts, charter schools, or nonprofit corporations organized under chapter 317A.\n\"District\" means a school district or charter school.\n\"Transfer pathway\" means an established pathway to licensure between a two-year college or Tribal college, and a board-approved teacher preparation provider.",
	"repealed": false
}