{
	"id": "383B.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.46",
	"title": "383B.46 SUPPLEMENTAL RETIREMENT ACCOUNT.",
	"text": "Any person who was employed by the county of Hennepin or its agencies, boards, commissions, authorities and committees before April 14, 1982, as an employee or an officer in the classified service as defined in sections 383B.26 to 383B.42, or as an employee in the unclassified service, and who has served for five years as a county employee or an officer in the classified service, or as a county employee in the unclassified service, which need not necessarily be continuous, and which must include time served as a county employee before June 8, 1965, if the person is an employee in the classified service of the county or if the person is an employee of Hennepin Healthcare System, Inc., is entitled to elect to obtain coverage by the Hennepin County supplemental retirement program. The election to obtain coverage may be exercised only once and must be exercised within 30 days of the date on which the person first becomes entitled to elect to obtain coverage. No person hired, rehired, or reinstated by the county as an employee in the classified or unclassified service on or after April 14, 1982, is eligible for coverage by the Hennepin County supplemental retirement program.\nThe county of Hennepin or Hennepin Healthcare System, Inc., whichever applies, shall deduct from the salary of every person who is eligible for coverage and who elected to retain or obtain coverage by the Hennepin County supplemental retirement program a sum equal to one percent of the total salary of the person. The deduction shall be made in the same manner as other retirement deductions are made from the salary of the person. An amount equal to the amounts deducted during each payroll period must be contributed by the county of Hennepin or Hennepin Healthcare System, Inc., whichever applies. The total amount deducted and contributed must be deposited to the credit of the supplemental retirement account in a separate account administered by the Minnesota State Retirement System on behalf of Hennepin County. The Hennepin County supplemental retirement account is hereby established as an account separate and distinct from other funds, accounts, or assets of the county of Hennepin.",
	"repealed": false
}