{
	"id": "80B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/80B.10",
	"title": "80B.10 PENALTIES.",
	"text": "Any person, including a controlling person of an offeror or target company, who willfully violates any provision of sections 80B.01 to 80B.13 or any rule thereunder, or any order of the commissioner of which this person has notice, may be fined not more than $25,000 or imprisoned not more than five years or both. Each of the acts specified shall constitute a separate offense and a prosecution or conviction for any one of such offenses shall not bar prosecution or conviction for any other offense. No indictment or information may be returned under sections 80B.01 to 80B.13 more than six years after the alleged violation.\nThe commissioner may refer such evidence as is available concerning violations of sections 80B.01 to 80B.13 or of any rule or order hereunder to the attorney general or the county attorney of the appropriate county who may, with or without any reference, institute the appropriate criminal proceedings under sections 80B.01 to 80B.13. A county attorney, on receiving a referral, shall within 90 days file with the commissioner a statement concerning any action taken or, if no action has been taken, the reasons therefor.\nNothing in sections 80B.01 to 80B.13 limits the power of the state to punish any person for any conduct which constitutes a crime under any other statute.\nAll shares of a target company incorporated under the laws of this state acquired from a Minnesota resident in violation of any provision of this chapter or any rule hereunder, or any order of the commissioner of which the person has notice, shall be denied voting rights for one year after acquisition, the shares shall be nontransferable on the books of the target company for one year after acquisition and the target company shall, during this one-year period, have the option to call the shares for redemption at the price at which the shares were acquired. Such a redemption shall occur on the date set in the call notice but not later than 60 days after the call notice is given.\nOfferors, offerees, and target companies may sue at law or in equity to enforce the provisions of this chapter.",
	"repealed": false
}