{
	"id": "241.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.01",
	"title": "241.01 CREATION OF DEPARTMENT.",
	"text": "The Department of Corrections is created under the control and supervision of the commissioner of corrections which office is established. The commissioner of corrections shall be selected without regard to political affiliation and shall have wide and successful administrative experience in correctional programs embodying rehabilitative concepts. The commissioner shall be appointed by the governor under the provisions of section 15.06.\nThe commissioner of corrections may appoint and employ no more than two deputy commissioners. The commissioner may also appoint a personal secretary, who shall serve at the commissioner's pleasure in the unclassified civil service.\n[Repealed, 1975 c 304 s 15]\nThe commissioner of corrections has the following powers and duties:\n(a) To accept persons committed to the commissioner by the courts of this state for care, custody, and rehabilitation.\n(b) To determine the place of confinement of committed persons in a correctional facility or other facility of the Department of Corrections and to prescribe reasonable conditions and rules for their employment, conduct, instruction, and discipline within or outside the facility. After July 1, 2023, the commissioner shall not allow inmates who have not been conditionally released from prison, whether on parole, supervised release, work release, or an early release program, to be housed in correctional facilities that are not owned and operated by the state, a local unit of government, or a group of local units of government. Inmates shall not exercise custodial functions or have authority over other inmates.\n(c) To administer the money and property of the department.\n(d) To administer, maintain, and inspect all state correctional facilities.\n(e) To transfer authorized positions and personnel between state correctional facilities as necessary to properly staff facilities and programs.\n(f) To utilize state correctional facilities in the manner deemed to be most efficient and beneficial to accomplish the purposes of this section, but not to close the Minnesota Correctional Facility-Stillwater or the Minnesota Correctional Facility-St. Cloud without legislative approval. The commissioner may place juveniles and adults at the same state minimum security correctional facilities, if there is total separation of and no regular contact between juveniles and adults, except contact incidental to admission, classification, and mental and physical health care.\n(g) To organize the department and employ personnel the commissioner deems necessary to discharge the functions of the department, including a chief executive officer for each facility under the commissioner's control who shall serve in the unclassified civil service and may, under the provisions of section 43A.33, be removed only for cause.\n(h) To define the duties of these employees and to delegate to them any of the commissioner's powers, duties and responsibilities, subject to the commissioner's control and the conditions the commissioner prescribes.\n(i) To annually develop a comprehensive set of goals and objectives designed to clearly establish the priorities of the Department of Corrections. This report shall be submitted to the governor commencing January 1, 1976. The commissioner may establish ad hoc advisory committees.\n(j) To publish, administer, and award grant contracts with state agencies, local units of government, and other entities for correctional programs embodying rehabilitative concepts, for restorative programs for crime victims and the overall community, and for implementing legislative directives.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve service to the public, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.\nBefore entering upon the duties of office, the commissioner of corrections shall take and subscribe an oath and give a bond to the state of Minnesota, to be approved by the governor and filed with the secretary of state, in the sum of $25,000, conditioned for the faithful performance of the commissioner's duties.\nFor the maintenance of adequate standards of operation in discharging the functions of the department, obtaining suitable candidates for positions for which there is a scarcity of qualified applicants, and the development of more effective treatment programs directed toward the correction and rehabilitation of persons found delinquent or guilty of crimes, and of more effective delinquency prevention the commissioner of corrections shall establish a training program including but not limited to in-service, preservice, internship and scholarship programs, and an operational research program. Within the limits of appropriations available, the commissioner may provide educational stipends or tuition reimbursement in such amounts and upon such terms and conditions as may be determined jointly by the commissioner of management and budget. Within the limits of appropriations therefor the commissioner shall establish and provide personnel, facilities and equipment for research and study to evaluate the effectiveness of correctional treatment in camps, facilities, probation and parole investigation and supervision and delinquency prevention.\nThe commissioner may provide training to public or private agencies or organizations and may require the participating agencies or organizations to pay all or part of the costs of the training. All sums of money received pursuant to the agreements shall not cancel until the end of the fiscal year immediately following the fiscal year in which the funds were received. The funds are available for use by the commissioner during that period and are appropriated annually to the commissioner of corrections for the purposes of this subdivision.\nFor the purposes of subdivision 5 and to discharge the functions of the department through the establishment of additional facilities and services to persons committed to the commissioner's care the commissioner may, subject to the provisions of section 15.43, accept and expend on behalf of the state, gifts, grants and subsidies from any lawful source; all moneys and securities so received shall be deposited in the state treasury subject to the order of the commissioner. From the fund to which such receipts are credited there is hereby appropriated annually to the commissioner of corrections such gifts, grants and subsidies as are received under the provisions of this subdivision.\nTo assist in the discharge of the functions of the Corrections Department the commissioner of corrections shall have authority to accept uncompensated and voluntary services and to enter into contracts or agreements with private or public agencies or persons for such uncompensated and voluntary services as the commissioner may deem practicable. Persons rendering voluntary uncompensated services as herein authorized may be reimbursed for travel expenses paid or incurred in the performance of such official duties as may be assigned them at the same rate per mile as state employees. It is the purpose of this subdivision to provide travel expenses only to those volunteers who would otherwise be unable to afford to perform volunteer services.\nThe commissioner of corrections may authorize and permit public or private social service, educational, or rehabilitation agencies or organizations, and their clients; or lawyers, insurance companies, or others; to use the facilities, staff, and other resources of correctional facilities under the commissioner's control and may require the participating agencies or organizations to pay all or part of the costs thereof. All sums of money received pursuant to the agreements herein authorized shall not cancel until the end of the fiscal year immediately following the fiscal year in which the funds were received. The funds are available for use by the commissioner during that period, and are hereby appropriated annually to the commissioner of corrections for the purposes of this subdivision.\nThe commissioner may provide meals for staff and visitors for efficiency of operation and may require the participants to pay all or part of the costs of the meals. All sums of money received under this provision are appropriated to the commissioner and shall not cancel until the end of the fiscal year immediately following the fiscal year in which the funds were received.\n[Repealed, 1981 c 192 s 21]\nMoney collected as rent under section 16B.24, subdivision 5, for state property at any of the correctional facilities administered by the commissioner of corrections is appropriated to the commissioner and is dedicated to the correctional facility from which it is generated. Any balance remaining at the end of the fiscal year shall not cancel and is available until expended.\nIn accordance with section 241.021, subdivision 4, the commissioner may contract with a separate entity to purchase prescription drugs for persons confined in institutions under the control of the commissioner. Local governments may participate in this purchasing pool in order to purchase prescription drugs for those persons confined in local correctional facilities in which the local government has responsibility for providing health care. If any county participates, the commissioner shall appoint a county representative to any committee convened by the commissioner for the purpose of establishing a drug formulary to be used for state and local correctional facilities.",
	"repealed": false
}