{
	"id": "3.736",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.736",
	"title": "3.736 TORT CLAIMS.",
	"text": "The state will pay compensation for injury to or loss of property or personal injury or death caused by an act or omission of an employee of the state while acting within the scope of office or employment or a peace officer who is not acting on behalf of a private employer and who is acting in good faith under section 629.40, subdivision 4, under circumstances where the state, if a private person, would be liable to the claimant, whether arising out of a governmental or proprietary function. Nothing in this section waives the defense of judicial, quasi-judicial, or legislative immunity except to the extent provided in subdivision 8.\nClaims of various kinds shall be considered and paid only in accordance with the statutory procedures provided. If there is no other applicable statute, a claim shall be brought under this section as a civil action in the courts of the state.\nWithout intent to preclude the courts from finding additional cases where the state and its employees should not, in equity and good conscience, pay compensation for personal injuries or property losses, the legislature declares that the state and its employees are not liable for the following losses:\n(a) a loss caused by an act or omission of a state employee exercising due care in the execution of a valid or invalid statute or rule;\n(b) a loss caused by the performance or failure to perform a discretionary duty, whether or not the discretion is abused;\n(c) a loss in connection with the assessment and collection of taxes;\n(d) a loss caused by snow or ice conditions on a highway or public sidewalk that does not abut a publicly owned building or a publicly owned parking lot, except when the condition is affirmatively caused by the negligent acts of a state employee;\n(e) a loss caused by wild animals in their natural state, except as provided in section 3.7371;\n(f) a loss other than injury to or loss of property or personal injury or death;\n(g) a loss caused by the condition of unimproved real property owned by the state, which means land that the state has not improved, state land that contains idled or abandoned mine pits or shafts, and appurtenances, fixtures, and attachments to land that the state has neither affixed nor improved;\n(h) a loss involving or arising out of the use or operation of a recreational motor vehicle, as defined in section 84.90, subdivision 1, within the right-of-way of a trunk highway, as defined in section 160.02, except that the state is liable for conduct that would entitle a trespasser to damages against a private person;\n(i) a loss incurred by a user arising from the construction, operation, or maintenance of the outdoor recreation system, as defined in section 86A.04, or for a loss arising from the construction, operation, maintenance, or administration of grants-in-aid trails as defined in section 85.018, or for a loss arising from the construction, operation, or maintenance of a water access site created by the Department of Iron Range Resources and Rehabilitation, except that the state is liable for conduct that would entitle a trespasser to damages against a private person. For the purposes of this clause, a water access site, as defined in section 86A.04 or created by the commissioner of Iron Range resources and rehabilitation, that provides access to an idled, water filled mine pit, also includes the entire water filled area of the pit and, further, includes losses caused by the caving or slumping of the mine pit walls;\n(j) a loss of benefits or compensation due under a program of public assistance or public welfare, except if state compensation for loss is expressly required by federal law in order for the state to receive federal grants-in-aid;\n(k) a loss based on the failure of a person to meet the standards needed for a license, permit, or other authorization issued by the state or its agents;\n(l) a loss based on the usual care and treatment, or lack of care and treatment, of a person at a state hospital or state corrections facility where reasonable use of available appropriations has been made to provide care;\n(m) loss, damage, or destruction of property of a patient or inmate of a state institution except as provided under section 3.7381;\n(n) a loss for which recovery is prohibited by section 169A.48, subdivision 2;\n(o) a loss caused by an aeration, bubbler, water circulation, or similar system used to increase dissolved oxygen or maintain open water on the ice of public waters, that is operated under a permit issued by the commissioner of natural resources;\n(p) a loss incurred by a visitor to the Minnesota Zoological Garden, except that the state is liable for conduct that would entitle a trespasser to damages against a private person;\n(q) a loss arising out of a person's use of a logging road on public land that is maintained exclusively to provide access to timber on that land by harvesters of the timber, and is not signed or otherwise held out to the public as a public highway; and\n(r) a loss incurred by a user of property owned, leased, or otherwise controlled by the Minnesota National Guard or the Department of Military Affairs, except that the state is liable for conduct that would entitle a trespasser to damages against a private person.\nThe state will not pay punitive damages.\nThe total liability of the state and its employees acting within the scope of their employment on any tort claim shall not exceed:\n(a) $300,000 when the claim is one for death by wrongful act or omission and $300,000 to any claimant in any other case, for claims arising before August 1, 2007;\n(b) $400,000 when the claim is one for death by wrongful act or omission and $400,000 to any claimant in any other case, for claims arising on or after August 1, 2007, and before July 1, 2009;\n(c) $500,000 when the claim is one for death by wrongful act or omission and $500,000 to any claimant in any other case, for claims arising on or after July 1, 2009;\n(d) $750,000 for any number of claims arising out of a single occurrence, for claims arising on or after January 1, 1998, and before January 1, 2000;\n(e) $1,000,000 for any number of claims arising out of a single occurrence, for claims arising on or after January 1, 2000, and before January 1, 2008;\n(f) $1,200,000 for any number of claims arising out of a single occurrence, for claims arising on or after January 1, 2008, and before July 1, 2009;\n(g) $1,500,000 for any number of claims arising out of a single occurrence, for claims arising on or after July 1, 2009; or\n(h) $1,000,000 for any number of claims arising out of a single occurrence, if the claim involves a nonprofit organization engaged in or administering outdoor recreational activities funded in whole or in part by the state or operating under the authorization of a permit issued by an agency or department of the state.\nIf the amount awarded to or settled upon multiple claimants exceeds the applicable limit under clause (d), (e), (f), (g), or (h), any party may apply to the district court to apportion to each claimant a proper share of the amount available under the applicable limit under clause (d), (e), (f), or (g). The share apportioned to each claimant shall be in the proportion that the ratio of the award or settlement bears to the aggregate awards and settlements for all claims arising out of the occurrence.\nThe limitation imposed by this subdivision on individual claimants includes damages claimed for loss of services or loss of support arising out of the same tort.\nThe total liability of the state and its employees acting within the scope of their employment on any claim of whatever matter arising from the issuance and sale of securities by the state shall not exceed:\n(a) $100,000 to any one person; or\n(b) $500,000 to all claimants in respect of the securities of the same series.\nThe limitations in clauses (a) and (b) shall not affect the obligation of the issuing state entity to pay the indebtedness under the securities in accordance with their terms and from the sources pledged to their payment.\nExcept as provided in subdivision 6, every person, whether plaintiff, defendant or third-party plaintiff or defendant, who claims compensation from the state or a state employee acting within the scope of employment for or on account of any loss or injury shall present to the attorney general or, in the case of a claim against the University of Minnesota, to the person designated by the regents of the university as the university attorney, and any state employee from whom the claimant will seek compensation, within 180 days after the alleged loss or injury is discovered, a notice stating its time, place and circumstances, the names of any state employees known to be involved, and the amount of compensation or other relief demanded. Actual notice of sufficient facts to reasonably put the state or its insurer on notice of a possible claim complies with the notice requirements of this section. Failure to state the amount of compensation or other relief demanded does not invalidate the notice, but the claimant shall furnish full information available regarding the nature and extent of the injuries and damages within 15 days after demand by the state. The time for giving the notice does not include the time during which the person injured is incapacitated by the injury from giving the notice.\nWhen the claim is one for death by wrongful act or omission, the notice may be presented by the personal representative, surviving spouse, or next of kin, or the consular officer of the foreign country of which the deceased was a citizen, within one year after the alleged injury or loss resulting in the death. If the person for whose death the claim is made has presented a notice that would have been sufficient had the person lived, an action for wrongful death may be brought without additional notice.\nA state agency, including an entity defined as part of the state in section 3.732, subdivision 1, clause (1), incurring a tort claim judgment or settlement obligation or whose employees acting within the scope of their employment incur the obligation shall seek approval to make payment from the commissioner or director of that agency. The request shall contain a description of the tort claim that causes the request, specify the amount of the obligation and be accompanied by copies of judgments, settlement agreements or other documentation relevant to the obligation for which the agency seeks payment. Upon receipt of the request and review of the claim, the commissioner or director shall determine the proper appropriation from which to make payment. If there is enough money in an appropriation or combination of appropriations to the agency for its general operations and management to pay the claim without unduly hindering the operation of the agency, the commissioner or director shall direct that payment be made from that source. Claims relating to activities paid for by appropriations of dedicated receipts shall be paid from those appropriations if practicable. On determining that an agency has sufficient money in these appropriations to pay only part of a claim, the commissioner of management and budget shall pay the remainder of the claim from the money appropriated to the commissioner for the purpose. On determining that the agency does not have enough money to pay any part of the claim, the commissioner shall pay all of the claim from money appropriated to the commissioner for the purpose. Payment shall be made only upon receipt of a written release by the claimant in a form approved by the attorney general, or the person designated as the university attorney, as the case may be.\nNo attachment or execution shall issue against the state.\nA state agency, including an entity defined as a part of the state in section 3.732, subdivision 1, clause (1), may procure insurance against liability of the agency and its employees for damages resulting from the torts of the agency and its employees. Procurement of the insurance is a waiver of the limits of governmental liability under subdivisions 4 and 4a only to the extent that valid and collectible insurance, including where applicable, proceeds from the Minnesota Insurance Guaranty Association, exceeds those limits and covers the claim. Purchase of insurance has no other effect on the liability of the agency and its employees. Procurement of commercial insurance, participation in the risk management fund under section 16B.85, or provisions of an individual self-insurance plan with or without a reserve fund or reinsurance does not constitute a waiver of any governmental immunities or exclusions.\nThe state shall defend, save harmless, and indemnify any employee of the state against expenses, attorneys' fees, judgments, fines, and amounts paid in settlement actually and reasonably incurred by the employee in connection with any tort, civil, or equitable claim or demand, or expenses, attorneys' fees, judgments, fines, and amounts paid in settlement actually and reasonably incurred by the employee in connection with any claim or demand arising from the issuance and sale of securities by the state, whether groundless or otherwise, arising out of an alleged act or omission occurring during the period of employment if the employee provides complete disclosure and cooperation in the defense of the claim or demand and if the employee was acting within the scope of employment. Except for elected employees, an employee is conclusively presumed to have been acting within the scope of employment if the employee's appointing authority issues a certificate to that effect. This determination may be overruled by the attorney general. The determination of whether an employee was acting within the scope of employment is a question of fact to be determined by the trier of fact based upon the circumstances of each case:\n(i) in the absence of a certification,\n(ii) if a certification is overruled by the attorney general,\n(iii) if an unfavorable certification is made, or\n(iv) with respect to an elected official.\nThe absence of the certification or an unfavorable certification is not evidence relevant to a determination by the trier of fact. It is the express intent of this provision to defend, save harmless, and indemnify any employee of the state against the full amount of any final judgment rendered by a court of competent jurisdiction arising from a claim or demand described herein, regardless of whether the limitations on liability specified in subdivision 4 or 4a are, for any reason, found to be inapplicable. This subdivision does not apply in case of malfeasance in office or willful or wanton actions or neglect of duty, nor does it apply to expenses, attorneys' fees, judgments, fines, and amounts paid in settlement of claims for proceedings brought by or before responsibility or ethics boards or committees.\nThe state shall defend, save harmless, and indemnify a peace officer who is not acting on behalf of a private employer and who is acting in good faith under section 629.40, subdivision 4, the same as if the officer were an employee of the state.\nThe judgment in an action under this section is a complete bar to any action by the claimant, by reason of the same subject matter, against the state employee whose act or omission gave rise to the claim.\nThe statute of limitations for all tort claims brought against the state is as provided in chapter 541 and other laws.",
	"repealed": false
}