{
	"id": "123A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.19",
	"title": "123A.19 TEACHING POSITIONS.",
	"text": "For the purposes of this section, \"teacher\" does not include a superintendent.\nThe boards in all member districts and exclusive bargaining representatives of the teachers in all member districts may negotiate a plan for filling positions resulting from implementation of the education district agreement. If the plan is negotiated among the member districts and the exclusive bargaining representative of each member district and unanimously agreed upon, in writing, the education district must include the plan in the education district agreement. If a plan is not negotiated, the education district is governed by subdivision 3.\n(a) When an education district board or a member board is filling a position resulting from implementation of the agreement, the board may offer the position to a teacher currently employed by a member district according to the exchange teacher provisions of section 122A.54.\n(b) If the position is not filled by a currently employed teacher, the board must offer the position to an available teacher in the order of seniority in fields of licensure on a combined seniority list of all available teachers in the member districts. For the purpose of establishing a combined seniority list, each district must be considered to have started school each year on the same date. An available teacher is a teacher in a member district who:\n(1) was placed on unrequested leave of absence by a member district, according to section 122A.40, subdivision 10, not more than one year before the initial formation of an education district as a result of an intention to enter into an education district agreement;\n(2) was placed on unrequested leave of absence by a member district, according to section 122A.40, subdivision 10, as a result of implementing the education district agreement, after the formation of the education district; or\n(3) is placed on unrequested leave of absence by a member district, according to section 122A.40, subdivision 10, as a result of implementing the education district, in the same year the position is filled.\n(c) If no currently employed teacher or available teacher accepts the position, the board may fill the position with any other teacher.\n(d) Any teacher who has been placed on unrequested leave of absence or who has been terminated has a right to a position only as long as the teacher has a right to reinstatement in a member district under section 122A.40, subdivision 10.\nNotwithstanding section 122A.40, subdivision 5, a teacher who has acquired continuing contract rights in a member district and who transfers employment from a member district to the education district or to another member district does not have to serve a probationary period. A teacher who is terminated or discharged by a member district according to section 122A.40, subdivision 9 or 13, or 122A.41, subdivision 6, has no right to any position under this section.\nWhen a school board that intends to enter into an education district agreement, and at the time a board that has entered into an education district agreement places a teacher on unrequested leave of absence, according to section 122A.40, subdivision 10, the board must make a determination whether the placement or termination is a result of implementing the education district agreement. That determination must be included in the notice of proposed placement or termination, may be reviewed at a hearing upon request of the teacher, and must be included in the notice of final action of the board. If the determination is not disputed by the teacher before June 1 or the final date required for action by the board, the teacher shall be deemed to acquiesce in the board's determination.",
	"repealed": false
}