{
	"id": "193.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/193.36",
	"title": "193.36 UNUSED ARMORIES.",
	"text": "Whenever the unit or units of the military forces of the state which are quartered in an armory acquired or erected in whole or in part by state funds have been called or ordered into federal service or have been mustered out of the service of the state, and there is no immediate prospect that a new military unit will be organized in the place where the armory is located, the adjutant general shall immediately take possession of and close the same, and shall not permit its use for other than military purposes except as otherwise provided by law.\nIn any case when the adjutant general finds it advantageous for military training, the adjutant general may sell and convey property to the municipality or county in which the property is located at a price to be determined by an appraiser to be selected by the adjutant general. The money received must be credited to the general fund and is appropriated to the adjutant general to be used: (1) as a contribution for the construction or acquisition of an armory, armories, or armory facilities to replace the one sold; or (2) for the maintenance, operation, repair, rehabilitation, or improvement of existing armory facilities. The money may also be transferred to the Minnesota State Armory Commission: (1) for the replacement of an armory, armories, or armory facilities constructed or acquired by the commission; or (2) for the maintenance, operation, repair, rehabilitation, or improvement of facilities owned by the commission. If the money received is not expended for the purposes stated in this subdivision within ten years after the old armory has been sold, the appropriation to the adjutant general as provided in this subdivision lapses. In the event that both the municipality and the county desire to purchase the armory, the municipality must be given first priority to purchase the armory. In addition to money, the adjutant general may consider local government contributions to include the donation of land, provision of utilities to provide for a new armory, or other expenditures by the municipality or county.\nIf the municipality or county does not purchase the property after a reasonable opportunity, the adjutant general may sell and convey it to any person after a public sale of the property by first advertising for bids or proposals for three consecutive weeks in a newspaper of general circulation in the area that the property is located and accepting the proposal most favorable to the department. The adjutant general may reject all proposals. The proceeds of the sale must be credited as provided in this subdivision. The adjutant general may lease any armory remaining unsold to the municipality for public purposes.\nThe adjutant general may sell and convey property to a municipality at a price to be determined by the adjutant general with the condition that the property remain in public use by the municipality for no less than 25 years, if the adjutant general:\n(1) finds it advantageous for military training;\n(2) intends to sell and convey property located in a municipality; and\n(3) determines that the municipality in which the property is located lacks sufficient property tax base or other resources to purchase the property at the appraised value.\nThe adjutant general with the approval of the Land Exchange Board may exchange any property for any publicly or privately held property without regard for value when the adjutant general finds it advantageous for military training, operations, or reduction of management costs.\nThe adjutant general with the approval of the governor, may sell and convey on behalf of the state any state armory sites and buildings which in the judgment of the adjutant general are unsuitable for military purposes or which have been condemned by proper authority as unsafe. Money received from the sale of such armories shall be paid into the state treasury and credited to the maintenance appropriation of the Department of Military Affairs or the Minnesota State Armory Building Commission as determined by the adjutant general.\nNotwithstanding a provision to the contrary in this section, all conveyances, sales, or exchanges under this section of state bond financed property, as defined in section 16A.695, subdivision 1, are subject to section 16A.695, subdivision 3.",
	"repealed": false
}