{
	"id": "144A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.12",
	"title": "144A.12 INJUNCTIVE RELIEF; SUBPOENAS.",
	"text": "In addition to any other remedy provided by law, the commissioner of health may bring an action in the district court in Ramsey or Hennepin County or in the district in which a nursing home is located to enjoin a controlling person or an employee of the nursing home from illegally engaging in activities regulated by sections 144A.01 to 144A.155. A temporary restraining order may be granted by the court in the proceeding if continued activity by the controlling person or employee would create an imminent risk of harm to a resident of the facility.\nIn all matters pending before the commissioner under sections 144A.01 to 144A.155, the commissioner of health shall have the power to issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents and other evidentiary material. Any person failing or refusing to appear or testify regarding any matter about which that person may be lawfully questioned or to produce any papers, books, records, documents or evidentiary materials in the matter to be heard, after having been required by order of the commissioner of health or by a subpoena of the commissioner of health to do so may, upon application by the commissioner of health to the district court in any district, be ordered by the court to comply therewith. The commissioner of health may issue subpoenas and may administer oaths to witnesses, or take their affirmation. Depositions may be taken within or without the state in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process or paper may be served upon any named person anywhere within the state by any officer authorized to serve subpoenas in civil actions, with the same fees and mileage and in the same manner as prescribed by law for process issued out of the district court of this state. Fees and mileage and other costs of persons subpoenaed by the commissioner of health shall be paid in the same manner as for proceedings in district court.",
	"repealed": false
}