{
	"id": "2.722",
	"url": "https://www.revisor.mn.gov/statutes/cite/2.722",
	"title": "2.722 JUDICIAL DISTRICTS.",
	"text": "Effective July 1, 1959, the state is divided into ten judicial districts composed of the following named counties, respectively, in each of which districts judges shall be chosen as hereinafter specified:\n1. Goodhue, Dakota, Carver, Le Sueur, McLeod, Scott, and Sibley; 36 judges; and four permanent chambers shall be maintained in Red Wing, Hastings, Shakopee, and Glencoe and one other shall be maintained at the place designated by the chief judge of the district;\n2. Ramsey; 26 judges;\n3. Wabasha, Winona, Houston, Rice, Olmsted, Dodge, Steele, Waseca, Freeborn, Mower, and Fillmore; 23 judges; and permanent chambers shall be maintained in Faribault, Albert Lea, Austin, Rochester, and Winona;\n4. Hennepin; 60 judges;\n5. Blue Earth, Watonwan, Lyon, Redwood, Brown, Nicollet, Lincoln, Cottonwood, Murray, Nobles, Pipestone, Rock, Faribault, Martin, and Jackson; 17 judges; and permanent chambers shall be maintained in Marshall, Windom, Fairmont, New Ulm, and Mankato;\n6. Carlton, St. Louis, Lake, and Cook; 15 judges;\n7. Benton, Douglas, Mille Lacs, Morrison, Otter Tail, Stearns, Todd, Clay, Becker, and Wadena; 30 judges; and permanent chambers shall be maintained in Moorhead, Fergus Falls, Little Falls, and St. Cloud;\n8. Chippewa, Kandiyohi, Lac qui Parle, Meeker, Renville, Swift, Yellow Medicine, Big Stone, Grant, Pope, Stevens, Traverse, and Wilkin; 11 judges; and permanent chambers shall be maintained in Morris, Montevideo, and Willmar;\n9. Norman, Polk, Marshall, Kittson, Red Lake, Roseau, Mahnomen, Pennington, Aitkin, Itasca, Crow Wing, Hubbard, Beltrami, Lake of the Woods, Clearwater, Cass and Koochiching; 24 judges; and permanent chambers shall be maintained in Crookston, Thief River Falls, Bemidji, Brainerd, Grand Rapids, and International Falls; and\n10. Anoka, Isanti, Wright, Sherburne, Kanabec, Pine, Chisago, and Washington; 45 judges; and permanent chambers shall be maintained in Anoka, Stillwater, and other places designated by the chief judge of the district.\nThe supreme court, with the consent of a majority of the chief judges of the judicial districts, may alter the boundaries or change the number of judicial districts, except the Second and Fourth Judicial Districts.\nThe probate judges of Ramsey and Hennepin probate courts in office on August 1, 1982, shall be district court judges of the Second and Fourth Judicial Districts, respectively, and shall continue in office for the balance of the term for which they were elected and shall be eligible for reelection. The offices of probate court of Ramsey and Hennepin Counties, and all of their jurisdiction, records, powers, duties, functions, and personnel, are hereby transferred to the district courts of the Second and Fourth Judicial Districts respectively and made divisions of them. The chief judge of the fourth judicial district shall at all times assign at least two judges to the probate court duties.\n(a) When a judge of the district court dies, resigns, retires, or is removed from office, the supreme court, in consultation with judges and attorneys in the affected district, shall determine after receiving notice of a vacancy from the governor whether the vacant office is necessary for effective judicial administration or is necessary for adequate access to the courts. In determining whether the position is necessary for adequate access to the courts, the supreme court shall consider whether abolition or transfer of the position would result in a county having no chambered judge. The supreme court may continue the position, may order the position abolished, or may transfer the position to a judicial district where need for additional judges exists, designating the position as either a county, county/municipal or district court judgeship. The supreme court shall certify any vacancy to the governor, who shall fill it in the manner provided by law.\n(b) If a judge of district court fails to timely file an affidavit of candidacy and filing fee or petition in lieu of a fee, the official with whom the affidavits of candidacy are required to be filed shall notify the supreme court that the incumbent judge is not seeking reelection. Within five days of receipt of the notice, the supreme court shall determine whether the judicial position is necessary for effective judicial administration or adequate access to the courts and notify the official responsible for certifying the election results of its determination. In determining whether the position is necessary for adequate access to the courts, the supreme court shall consider whether abolition or transfer of the position would result in a county having no chambered judge. The supreme court may continue the position, may order the position abolished, or may transfer the position to a judicial district where the need for additional judgeships exists. If the position is abolished or transferred, the election may not be held. If the position is transferred, the court shall also notify the governor of the transfer. Upon transfer, the position is vacant and the governor shall fill it in the manner provided by law. An order abolishing or transferring a position is effective the first Monday in the next January.\nWhen a referee of the district court dies, resigns, retires, or is voluntarily removed from the position, the chief judge of the district shall notify the supreme court and may petition to request that the position be converted to a judgeship. The supreme court shall determine whether to order the position abolished or convert the position to a judgeship in the affected or another judicial district. The supreme court shall certify any judicial vacancy to the governor, who shall fill it in the manner provided by law. The conversion of a referee position to a judgeship under this subdivision shall not reduce the total number of judges and referees hearing cases in the family and juvenile courts.\nThe complement for the law clerk and court reporter assigned exclusively to a judgeship that is abolished under this section is abolished upon vacancy of the position. The complement for the law clerk and court reporter shall be transferred to the judicial district to which a judgeship is transferred pursuant to this section.",
	"repealed": false
}