{
	"id": "469.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.103",
	"title": "469.103 REVENUE BONDS; PLEDGE; COVENANTS.",
	"text": "An economic development authority may decide by resolution to issue its revenue bonds either at one time or in series from time to time. The revenue bonds may be issued to provide money to pay to acquire land needed to operate the authority, to purchase or construct facilities, to purchase, construct, install, or furnish capital equipment to operate a facility for economic development of any kind within the city, or to pay to extend, enlarge, or improve a project under its control. The issued bonds may include the amount the authority considers necessary to establish an initial reserve to pay principal and interest on the bonds. The authority shall state in a resolution how the bonds and their attached interest coupons are to be executed.\nThe bonds of each series issued by the authority under this section shall bear interest at a rate or rates, shall mature at the time or times within 30 years from the date of issuance, and shall be in the form, whether payable to bearer, registrable as to principal, or fully registrable, as determined by the authority. Section 469.102, subdivision 6, applies to all bonds issued under this section, and the bonds and their coupons, if any, when payable to bearer, shall be negotiable instruments.\nThe sale of revenue bonds issued by the authority shall be at public or private sale. The bonds may be sold in the manner and for the price that the authority determines to be for the best interest of the authority. The bonds may be made callable, and if so issued, may be refunded.\nThe authority may by resolution make an agreement or covenant with the bondholders or their trustee. The authority must first decide that the agreement or covenant is needed or desirable to do what the authority may do under this section and to assure that the revenue bonds are marketable and promptly paid.\nIn issuing general obligation or revenue bonds, the authority may secure the payment of the principal and the interest on the bonds by a pledge of and lien on authority revenue. The revenue must come from the facility to be acquired, constructed, or improved with the bond proceeds or from other facilities named in the bond-authorizing resolutions. The authority also may secure the payment with its promise to impose, maintain, and collect enough rentals, rates, and charges, for the use and occupancy of the facilities and for services furnished in connection with the use and occupancy, to pay its current expenses to operate and maintain the named facilities, and to produce and deposit sufficient net revenue in a special fund to meet the interest and principal requirements of the bonds, and to collect and keep any more money required by the resolutions. The authority shall decide what constitutes \"current expense\" under this subdivision based on what is normal and reasonable under generally accepted accounting principles. Revenues pledged by the authority must not be used or pledged for any other authority purpose or to pay any other bonds issued under this section or under section 469.102, unless the other use or pledge is specifically authorized in the bond-authorizing resolutions.\nRevenue bonds issued under this section are not a debt of the authority's city nor a pledge of that city's full faith and credit. The bonds are payable only from project revenue as described in this section. A revenue bond must contain on its face a statement to the effect that the economic development authority and its city do not have to pay the bond or the interest on it except from revenue and that the faith, credit, and taxing power of the city are not pledged to pay the principal of or the interest on the bond.\nSections 469.153, subdivision 2, paragraph (e), and 469.154, subdivisions 3, 4, and 5 do not apply to revenue bonds issued under this section and sections 469.152 to 469.165 if the interest on the revenue bonds is subject to both state and federal income tax or if the revenue bond proceeds are not loaned by the authority to a private person.\nObligations secured or payable from tax increment revenues and issued pursuant to this section or section 469.102 are subject to the provisions of section 469.178.",
	"repealed": false
}