{
	"id": "582.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.042",
	"title": "582.042 FORECLOSURE; AGRICULTURAL LAND IN SEPARATE TRACTS.",
	"text": "If a mortgage on real property that is agricultural land is foreclosed and the property contains separate tracts, the person in possession of the real property must be notified by the foreclosing mortgagee that the separate tracts may be sold and redeemed separately. The notice in subdivision 2 must be served with the notice of foreclosure that is served on the person in possession of the property under section 580.03, or for a foreclosure by action under chapter 581, in the summons and complaint.\n(a) The following notice must be served with the foreclosure notice of the property that is served on the person in possession of the real property under section 580.03. The notice must be in 10-point capitalized letters and the notice is not to be published.\n\"IF THE PROPERTY TO BE SOLD CONTAINS SEPARATE TRACTS, YOU MAY REQUEST THAT THE TRACTS BE SOLD AND REDEEMED SEPARATELY. EACH OF THE SEPARATE TRACTS MUST CONFORM TO LOCAL ZONING ORDINANCES, MUST HAVE AN ENTRANCE BY DIRECT ACCESS TO A PUBLIC ROAD OR BY PERMANENT EASEMENT, AND MUST NOT UNREASONABLY AFFECT THE VALUE OF THE REMAINING PROPERTY.\nYOU MUST PROVIDE THE PERSON FORECLOSING ON THE PROPERTY, THE SHERIFF, AND THE COUNTY RECORDER WITH A COPY OF THE LEGAL DESCRIPTIONS OF EACH OF THE TRACTS YOU HAVE DESIGNATED TO BE SOLD SEPARATELY BY TEN BUSINESS DAYS BEFORE THE DATE THE PROPERTY IS TO BE SOLD.\"\n(b) The following notice must be served with the summons and complaint in an action to foreclose a mortgage of real property containing separate tracts under chapter 581. The notice must be in 10-point capitalized letters and is not to be published with the summons if the summons is published.\n\"IF THE PROPERTY TO BE SOLD CONTAINS SEPARATE TRACTS, YOU MAY REQUEST THAT THE TRACTS BE SOLD AND REDEEMED SEPARATELY. EACH OF THE SEPARATE TRACTS MUST CONFORM TO LOCAL ZONING ORDINANCES.\nYOU MUST PROVIDE THE COURT WITH A COPY OF THE LEGAL DESCRIPTIONS OF EACH OF THE TRACTS YOU HAVE DESIGNATED TO BE SOLD SEPARATELY.\"\nThe person being foreclosed must designate by legal description each of the tracts to be sold separately. The tracts designated must be previously recorded as separate tracts. Each of the separate tracts must conform to local zoning ordinances, must have an entrance by direct access to a public road or by permanent easement, and must not unreasonably affect the value of the remaining property. The person being foreclosed must serve a copy of the legal descriptions of the tracts to be sold separately on the foreclosing mortgagee, the sheriff, and the county recorder or registrar of titles by ten business days before the sale is scheduled, or for a foreclosure by action under chapter 581, a copy of the legal descriptions of the tracts to be sold separately must be provided to the court.\nIf the sheriff receives a designation of separate tracts under subdivision 3, or is ordered by the court, the sheriff must offer and sell the tracts separately.\nThe designated tracts may be redeemed separately or the entire foreclosed property may be redeemed. The period of redemption is the period for the entire property including all of the designated tracts.",
	"repealed": false
}