{
	"id": "353F.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/353F.02",
	"title": "353F.02 DEFINITIONS.",
	"text": "As used in this chapter, unless the context clearly indicates otherwise, each of the terms in the following subdivisions has the meaning indicated.\n\"Allowable service\" has the meaning provided in section 353.01, subdivision 16, of the edition of Minnesota Statutes published in the year before the year in which the privatization occurred.\n\"Effective date of privatization\" means the date that the operation of a medical facility is assumed by another employer or the date that a medical facility is purchased by another employer and active membership in the Public Employees Retirement Association consequently terminates.\n\"Executive director\" means the executive director of the Public Employees Retirement Association.\n[Repealed, 2013 c 111 art 3 s 31]\n\"Medical facility\" means a facility that has the primary purpose of providing medical care and that satisfies the definition of governmental subdivision under section 353.01, subdivision 6.\n\"Privatization\" means a medical facility that privatizes when the facility ceases to be a governmental subdivision for any reason other than that the medical facility closes or permanently ceases to operate.\n[Repealed, 2013 c 111 art 3 s 31]\n\"Privatized former public employer\" means a medical facility that was included in the definition of governmental subdivision under section 353.01, subdivision 6, on the day before the effective date of privatization that is privatized and whose employees are certified for participation under this chapter.\n(a) \"Privatized former public employee\" means a person who:\n(1) was employed by the privatized former public employer on the day before the effective date of privatization; or\n(2) terminated employment with the privatized former public employer on the day before the effective date; and\n(3) was a participant in the general employees retirement plan of the Public Employees Retirement Association at the time of termination of employment with the privatized former public employer.\n(b) Privatized former public employee does not mean a person who, on the day before the effective date of privatization, was simultaneously employed with the privatized former public employer and by a governmental subdivision under section 353.01, subdivision 6, and who, after the effective date of privatization, continues to accrue service credit under section 353.01, subdivision 16, through simultaneous employment with a governmental subdivision.\n\"Years of allowable service\" means the total number of years of allowable service under section 353.01, subdivision 18, of the edition of Minnesota Statutes published in the year before the year in which the privatization occurred.",
	"repealed": false
}