{
	"id": "161.3209",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.3209",
	"title": "161.3209 CONSTRUCTION MANAGER/GENERAL CONTRACTOR; PROCEDURES.",
	"text": "If the commissioner determines that a construction manager/general contractor method of procurement is appropriate for a project, the commissioner shall establish a two-phase procedure for awarding the construction manager/general contractor contract, as described in subdivisions 2 and 3.\n(a) The commissioner shall prepare or have prepared an RFP for each construction manager/general contractor contract as provided in this section. The RFP must contain, at a minimum, the following elements:\n(1) the minimum qualifications of the construction manager/general contractor;\n(2) the procedures for submitting proposals and the criteria for evaluation of qualifications and the relative weight for each criteria;\n(3) the form of the contract to be awarded;\n(4) the scope of intended construction work;\n(5) a listing of the types of preconstruction services that will be required;\n(6) an anticipated schedule for commencing and completing the project;\n(7) any applicable budget limits for the project;\n(8) the requirements for insurance, statutorily required performance, and payment bonds;\n(9) the requirements that the construction manager/general contractor provide a letter from a surety or insurance company stating that the construction manager/general contractor is capable of obtaining a performance bond and payment bond covering the estimated contract cost;\n(10) the method for how construction manager/general contractor fees for the preconstruction services contract will be negotiated;\n(11) a statement that past performance or experience does not include the exercise or assertion of a person's legal rights; and\n(12) any other information desired by the commissioner.\n(b) Before receiving any responses to the RFP:\n(1) the commissioner shall appoint a technical review committee of at least five individuals, of which one is a Department of Transportation manager who is also a licensed professional engineer in Minnesota;\n(2) the technical review committee shall evaluate the construction manager/general contractor proposals according to criteria and subcriteria published in the RFP and procedures established by the commissioner. The commissioner shall, as designated in the RFP, evaluate construction manager/general contractor proposals on the basis of best value as defined in section 16C.05, or using the qualifications-based selection process set forth in section 16C.087, except that subdivision 1 of section 16C.087 shall not apply. If the commissioner does not receive at least two proposals from construction managers, the commissioner may:\n(i) solicit new proposals;\n(ii) revise the RFP and thereafter solicit new proposals using the revised RFP;\n(iii) select another allowed procurement method; or\n(iv) reject the proposals; and\n(3) the technical review committee shall evaluate the responses to the request for proposals and rank the construction manager/general contractor based on the predefined criteria set forth in the RFP in accordance with paragraph (a), clause (2).\n(c) Unless all proposals are rejected, the commissioner shall conduct contract negotiations for a preconstruction services contract with the construction manager/general contractor with the highest ranking. If the construction manager/general contractor with the highest ranking declines or is unable to reach an agreement, the commissioner may begin contract negotiations with the next highest ranked construction manager/general contractor.\n(d) Before issuing the RFP, the commissioner may elect to issue a request for qualifications (RFQ) and short-list the most highly qualified construction managers/general contractors. The RFQ must include the procedures for submitting statements of qualification, the criteria for evaluation of qualifications, and the relative weight for each criterion. The statements of qualifications must be evaluated by the technical review committee.\n(a) Before conducting any construction-related services, the commissioner shall:\n(1) conduct an independent cost estimate for the project or each work package; and\n(2) conduct contract negotiations with the construction manager/general contractor to develop a construction manager/general contractor contract. This contract must include a minimum construction manager/general contractor self-performing requirement of 30 percent of the negotiated cost. Items designated in the construction manager/general contractor contract as specialty items may be subcontracted and the cost of any specialty item performed under the subcontract will be deducted from the cost before computing the amount of work required to be performed by the contractor.\n(b) If the construction manager/general contractor and the commissioner are unable to negotiate a contract, the commissioner may use other contract procurement processes or may readvertise the construction manager/general contractor contract. The construction manager/general contractor may: (1) bid or propose on the project if advertised under section 161.32 or 161.3206; or (2) join a design-build team if advertised under sections 161.3410 to 161.3426.\n(c) The commissioner shall provide to all bidders or design-build teams all data shared between the commissioner and the construction manager/general contractor during the contract negotiations under this subdivision.",
	"repealed": false
}