{
	"id": "500.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.24",
	"title": "500.24 FARMING BY BUSINESS ORGANIZATIONS.",
	"text": "The legislature finds that it is in the interests of the state to encourage and protect the family farm as a basic economic unit, to insure it as the most socially desirable mode of agricultural production, and to enhance and promote the stability and well-being of rural society in Minnesota and the nuclear family.\nThe definitions in this subdivision apply to this section.\n(a) \"Farming\" means the production of (1) agricultural products; (2) livestock or livestock products; (3) milk or milk products; or (4) fruit or other horticultural products. It does not include the processing, refining, or packaging of said products, nor the provision of spraying or harvesting services by a processor or distributor of farm products. It does not include the production of timber or forest products, the production of poultry or poultry products, or the feeding and caring for livestock that are delivered to a corporation for slaughter or processing for up to 20 days before slaughter or processing.\n(b) \"Family farm\" means an unincorporated farming unit owned by one or more persons residing on the farm or actively engaging in farming.\n(c) \"Family farm corporation\" means a corporation founded for the purpose of farming and the ownership of agricultural land in which the majority of the stock is held by and the majority of the stockholders are persons, the spouses of persons, or current beneficiaries of one or more family farm trusts in which the trustee holds stock in a family farm corporation, related to each other within the third degree of kindred according to the rules of the civil law, and at least one of the related persons is residing on or actively operating the farm, and none of whose stockholders are corporations; provided that a family farm corporation shall not cease to qualify as such hereunder by reason of any:\n(1) transfer of shares of stock to a person or the spouse of a person related within the third degree of kindred according to the rules of civil law to the person making the transfer, or to a family farm trust of which the shareholder, spouse, or related person is a current beneficiary; or\n(2) distribution from a family farm trust of shares of stock to a beneficiary related within the third degree of kindred according to the rules of civil law to a majority of the current beneficiaries of the trust, or to a family farm trust of which the shareholder, spouse, or related person is a current beneficiary.\nFor the purposes of this section, a transfer may be made with or without consideration, either directly or indirectly, during life or at death, whether or not in trust, of the shares in the family farm corporation, and stock owned by a family farm trust are considered to be owned in equal shares by the current beneficiaries.\n(d) \"Family farm trust\" means:\n(1) a trust in which:\n(i) a majority of the current beneficiaries are persons or spouses of persons who are related to each other within the third degree of kindred according to the rules of civil law;\n(ii) all of the current beneficiaries are natural persons or nonprofit corporations or trusts described in the Internal Revenue Code, section 170(c), as amended, and the regulations under that section; and\n(iii) one of the family member current beneficiaries is residing on or actively operating the farm; or the trust leases the agricultural land to a family farm unit, a family farm corporation, an authorized farm corporation, an authorized livestock farm corporation, a family farm limited liability company, a family farm trust, an authorized farm limited liability company, a family farm partnership, or an authorized farm partnership; or\n(2) a charitable remainder trust as defined in the Internal Revenue Code, section 664, as amended, and the regulations under that section, and a charitable lead trust as set forth in the Internal Revenue Code, section 170(f), and the regulations under that section.\n(e) \"Authorized farm corporation\" means a corporation meeting the following standards:\n(1) it has no more than five shareholders, provided that for the purposes of this section, spouses are considered one shareholder;\n(2) all its shareholders, other than any estate, are natural persons or a family farm trust;\n(3) it does not have more than one class of shares;\n(4) its revenue from rent, royalties, dividends, interest, and annuities does not exceed 20 percent of its gross receipts;\n(5) shareholders holding 51 percent or more of the interest in the corporation reside on the farm or are actively engaging in farming;\n(6) it does not, directly or indirectly, own or otherwise have an interest in any title to more than 1,500 acres of agricultural land; and\n(7) none of its shareholders are shareholders in other authorized farm corporations that directly or indirectly in combination with the corporation own more than 1,500 acres of agricultural land.\n(f) \"Authorized livestock farm corporation\" means a corporation formed for the production of livestock and meeting the following standards:\n(1) it is engaged in the production of livestock other than dairy cattle;\n(2) all its shareholders, other than any estate, are natural persons, family farm trusts, or family farm corporations;\n(3) it does not have more than one class of shares;\n(4) its revenue from rent, royalties, dividends, interest, and annuities does not exceed 20 percent of its gross receipts;\n(5) shareholders holding 75 percent or more of the control, financial, and capital investment in the corporation are farmers, and at least 51 percent of the required percentage of farmers are actively engaged in livestock production;\n(6) it does not, directly or indirectly, own or otherwise have an interest in any title to more than 1,500 acres of agricultural land; and\n(7) none of its shareholders are shareholders in other authorized farm corporations that directly or indirectly in combination with the corporation own more than 1,500 acres of agricultural land.\n(g) \"Agricultural land\" means real estate used for farming or capable of being used for farming in this state.\n(h) \"Pension or investment fund\" means a pension or employee welfare benefit fund, however organized, a mutual fund, a life insurance company separate account, a common trust of a bank or other trustee established for the investment and reinvestment of money contributed to it, a real estate investment trust, or an investment company as defined in United States Code, title 15, section 80a-3.\n(i) \"Farm homestead\" means a house including adjoining buildings that has been used as part of a farming operation or is part of the agricultural land used for a farming operation.\n(j) \"Family farm partnership\" means a limited partnership formed for the purpose of farming and the ownership of agricultural land in which the majority of the interests in the partnership is held by and the majority of the partners are natural persons or current beneficiaries of one or more family farm trusts in which the trustee holds an interest in a family farm partnership related to each other within the third degree of kindred according to the rules of the civil law, and at least one of the related persons is residing on the farm, actively operating the farm, or the agricultural land was owned by one or more of the related persons for a period of five years before its transfer to the limited partnership, and none of the partners is a corporation. A family farm partnership does not cease to qualify as a family farm partnership because of a:\n(1) transfer of a partnership interest to a person or spouse of a person related within the third degree of kindred according to the rules of civil law to the person making the transfer or to a family farm trust of which the partner, spouse, or related person is a current beneficiary; or\n(2) distribution from a family farm trust of a partnership interest to a beneficiary related within the third degree of kindred according to the rules of civil law to a majority of the current beneficiaries of the trust, or to a family farm trust of which the partner, spouse, or related person is a current beneficiary.\nFor the purposes of this section, a transfer may be made with or without consideration, either directly or indirectly, during life or at death, whether or not in trust, of a partnership interest in the family farm partnership, and interest owned by a family farm trust is considered to be owned in equal shares by the current beneficiaries.\n(k) \"Authorized farm partnership\" means a limited partnership meeting the following standards:\n(1) it has been issued a certificate from the secretary of state or is registered with the county recorder and farming and ownership of agricultural land is stated as a purpose or character of the business;\n(2) it has no more than five partners;\n(3) all its partners, other than any estate, are natural persons or family farm trusts;\n(4) its revenue from rent, royalties, dividends, interest, and annuities does not exceed 20 percent of its gross receipts;\n(5) its general partners hold at least 51 percent of the interest in the land assets of the partnership and reside on the farm or are actively engaging in farming not more than 1,500 acres as a general partner in an authorized limited partnership;\n(6) its limited partners do not participate in the business of the limited partnership including operating, managing, or directing management of farming operations;\n(7) it does not, directly or indirectly, own or otherwise have an interest in any title to more than 1,500 acres of agricultural land; and\n(8) none of its limited partners are limited partners in other authorized farm partnerships that directly or indirectly in combination with the partnership own more than 1,500 acres of agricultural land.\n(l) \"Family farm limited liability company\" means a limited liability company founded for the purpose of farming and the ownership of agricultural land in which the majority of the membership interests is held by and the majority of the members are natural persons, or current beneficiaries of one or more family farm trusts in which the trustee holds an interest in a family farm limited liability company related to each other within the third degree of kindred according to the rules of the civil law, and at least one of the related persons is residing on the farm, actively operating the farm, or the agricultural land was owned by one or more of the related persons for a period of five years before its transfer to the limited liability company, and none of the members is a corporation or a limited liability company. A family farm limited liability company does not cease to qualify as a family farm limited liability company because of:\n(1) a transfer of a membership interest to a person or spouse of a person related within the third degree of kindred according to the rules of civil law to the person making the transfer or to a family farm trust of which the member, spouse, or related person is a current beneficiary; or\n(2) distribution from a family farm trust of a membership interest to a beneficiary related within the third degree of kindred according to the rules of civil law to a majority of the current beneficiaries of the trust, or to a family farm trust of which the member, spouse, or related person is a current beneficiary.\nFor the purposes of this section, a transfer may be made with or without consideration, either directly or indirectly, during life or at death, whether or not in trust, of a membership interest in the family farm limited liability company, and interest owned by a family farm trust is considered to be owned in equal shares by the current beneficiaries. Except for a state or federally chartered financial institution acquiring an encumbrance for the purpose of security or an interest under paragraph (x), a member of a family farm limited liability company may not transfer a membership interest, including a financial interest, to a person who is not otherwise eligible to be a member under this paragraph.\n(m) \"Authorized farm limited liability company\" means a limited liability company meeting the following standards:\n(1) it has no more than five members;\n(2) all its members, other than any estate, are natural persons or family farm trusts;\n(3) it does not have more than one class of membership interests;\n(4) its revenue from rent, royalties, dividends, interest, and annuities does not exceed 20 percent of its gross receipts;\n(5) members holding 51 percent or more of both the governance rights and financial rights in the limited liability company reside on the farm or are actively engaged in farming;\n(6) it does not, directly or indirectly, own or otherwise have an interest in any title to more than 1,500 acres of agricultural land; and\n(7) none of its members are members in other authorized farm limited liability companies that directly or indirectly in combination with the authorized farm limited liability company own more than 1,500 acres of agricultural land.\nExcept for a state or federally chartered financial institution acquiring an encumbrance for the purpose of security or an interest under paragraph (x), a member of an authorized farm limited liability company may not transfer a membership interest, including a financial interest, to a person who is not otherwise eligible to be a member under this paragraph.\n(n) \"Farmer\" means a natural person who regularly participates in physical labor or operations management in the person's farming operation and files \"Schedule F\" as part of the person's annual Form 1040 filing with the United States Internal Revenue Service.\n(o) \"Actively engaged in livestock production\" means performing day-to-day physical labor or day-to-day operations management that significantly contributes to livestock production and the functioning of a livestock operation.\n(p) \"Research or experimental farm\" means a corporation, limited partnership, pension, investment fund, or limited liability company that owns or operates agricultural land for research or experimental purposes, provided that any commercial sales from the operation are incidental to the research or experimental objectives of the corporation. A corporation, limited partnership, limited liability company, or pension or investment fund seeking initial approval by the commissioner to operate agricultural land for research or experimental purposes must first submit to the commissioner a prospectus or proposal of the intended method of operation containing information required by the commissioner including a copy of any operational contract with individual participants.\n(q) \"Breeding stock farm\" means a corporation, limited partnership, or limited liability company, that owns or operates agricultural land for the purpose of raising breeding stock, including embryos, for resale to farmers or for the purpose of growing seed, wild rice, nursery plants, or sod. An entity that is organized to raise livestock other than dairy cattle under this paragraph that does not qualify as an authorized farm corporation must:\n(1) sell all castrated animals to be fed out or finished to farming operations that are neither directly nor indirectly owned by the business entity operating the breeding stock operation; and\n(2) report its total production and sales annually to the commissioner.\n(r) \"Aquatic farm\" means a corporation, limited partnership, or limited liability company, that owns or leases agricultural land as a necessary part of an aquatic farm as defined in section 17.47, subdivision 3.\n(s) \"Religious farm\" means a corporation formed primarily for religious purposes whose sole income is derived from agriculture.\n(t) \"Utility corporation\" means a corporation regulated under Minnesota Statutes 1974, chapter 216B, that owns agricultural land for purposes described in that chapter, or an electric generation or transmission cooperative that owns agricultural land for use in its business if the land is not used for farming except under lease to a family farm unit, a family farm corporation, a family farm trust, a family farm partnership, or a family farm limited liability company.\n(u) \"Development organization\" means a corporation, limited partnership, limited liability company, or pension or investment fund that has an interest in agricultural land for which the corporation, limited partnership, limited liability company, or pension or investment fund has documented plans to use and subsequently uses the land within six years from the date of purchase for a specific nonfarming purpose, or if the land is zoned nonagricultural, or if the land is located within an incorporated area. A corporation, limited partnership, limited liability company, or pension or investment fund may hold agricultural land in the amount necessary for its nonfarm business operation; provided, however, that pending the development of agricultural land for nonfarm purposes, the land may not be used for farming except under lease to a family farm unit, a family farm corporation, a family farm trust, an authorized farm corporation, an authorized livestock farm corporation, a family farm partnership, an authorized farm partnership, a family farm limited liability company, or an authorized farm limited liability company, or except when controlled through ownership, options, leaseholds, or other agreements by a corporation that has entered into an agreement with the United States under the New Community Act of 1968 (Title IV of the Housing and Urban Development Act of 1968, United States Code, title 42, sections 3901 to 3914) as amended, or a subsidiary or assign of such a corporation.\n(v) \"Exempt land\" means agricultural land owned or leased by a corporation as of May 20, 1973, agricultural land owned or leased by a pension or investment fund as of May 12, 1981, agricultural land owned or leased by a limited partnership as of May 1, 1988, or agricultural land owned or leased by a trust as of the effective date of Laws 2000, chapter 477, including the normal expansion of that ownership at a rate not to exceed 20 percent of the amount of land owned as of May 20, 1973, for a corporation; May 12, 1981, for a pension or investment fund; May 1, 1988, for a limited partnership, or the effective date of Laws 2000, chapter 477, for a trust, measured in acres, in any five-year period, and including additional ownership reasonably necessary to meet the requirements of pollution control rules. A corporation, limited partnership, or pension or investment fund that is eligible to own or lease agricultural land under this section prior to May 1997, or a corporation that is eligible to own or lease agricultural land as a benevolent trust under this section prior to the effective date of Laws 2000, chapter 477, may continue to own or lease agricultural land subject to the same conditions and limitations as previously allowed.\n(w) \"Gifted land\" means agricultural land acquired as a gift, either by grant or devise, by an educational, religious, or charitable nonprofit corporation, limited partnership, limited liability company, or pension or investment fund if all land so acquired is disposed of within ten years after acquiring the title.\n(x) \"Repossessed land\" means agricultural land acquired by a corporation, limited partnership, limited liability company, or pension or investment fund by process of law in the collection of debts, or by any procedure for the enforcement of a lien or claim on the land, whether created by mortgage or otherwise if all land so acquired is disposed of within five years after acquiring the title. The five-year limitation is a covenant running with the title to the land against any grantee, assignee, or successor of the pension or investment fund, corporation, limited partnership, or limited liability company. The land so acquired must not be used for farming during the five-year period, except under a lease to a family farm unit, a family farm corporation, a family farm trust, an authorized farm corporation, an authorized livestock farm corporation, a family farm partnership, an authorized farm partnership, a family farm limited liability company, or an authorized farm limited liability company. Notwithstanding the five-year divestiture requirement under this paragraph, a financial institution may continue to own the agricultural land if the agricultural land is leased to the immediately preceding former owner, but must dispose of the agricultural land within ten years of acquiring the title. Livestock acquired by a pension or investment fund, corporation, limited partnership, or limited liability company in the collection of debts, or by a procedure for the enforcement of lien or claim on the livestock whether created by security agreement or otherwise after August 1, 1994, must be sold or disposed of within one full production cycle for the type of livestock acquired or 18 months after the livestock is acquired, whichever is earlier.\n(y) \"Commissioner\" means the commissioner of agriculture.\n(z) \"Nonprofit corporation\" means a nonprofit corporation organized under state nonprofit corporation or trust law or qualified for tax-exempt status under federal tax law that: (1) uses the land for a specific nonfarming purpose; (2) leases the agricultural land to a family farm unit, a family farm corporation, an authorized farm corporation, an authorized livestock farm corporation, a family farm limited liability company, a family farm trust, an authorized farm limited liability company, a family farm partnership, or an authorized farm partnership; or (3) actively farms less than 160 acres that were acquired by the nonprofit corporation prior to August 1, 2010, or actively farms less than 40 acres that were acquired by the nonprofit corporation after August 1, 2010, and the nonprofit corporation uses all profits from the agricultural land for educational purposes.\n(aa) \"Current beneficiary\" means a person who at any time during a year is entitled to, or at the discretion of any person may, receive a distribution from the income or principal of the trust. It does not include a distributee trust, other than a trust described in section 170(c) of the Internal Revenue Code, as amended, but does include the current beneficiaries of the distributee trust. It does not include a person in whose favor a power of appointment could be exercised until the holder of the power of appointment actually exercises the power of appointment in that person's favor. It does not include a person who is entitled to receive a distribution only after a specified time or upon the occurrence of a specified event until the time or occurrence of the event. For the purposes of this section, a distributee trust is a current beneficiary of a family farm trust.\n(bb) \"De minimis\" means that any corporation, pension or investment fund, limited liability company, or limited partnership that directly or indirectly owns, acquires, or otherwise obtains any interest in 40 acres or less of agricultural land and annually receives less than $150 per acre in gross revenue from rental or agricultural production.\n(a) No corporation, limited liability company, pension or investment fund, trust, or limited partnership shall engage in farming; nor shall any corporation, limited liability company, pension or investment fund, trust, or limited partnership, directly or indirectly, own, acquire, or otherwise obtain any interest, in agricultural land other than a bona fide encumbrance taken for purposes of security. This subdivision does not apply to general partnerships. This subdivision does not apply to any agricultural land, corporation, limited partnership, trust, limited liability company, or pension or investment fund that meet any of the definitions in subdivision 2, paragraphs (b) to (f), (j) to (m), (p) to (x), (z), and (bb), has a conservation plan prepared for the agricultural land, and reports as required under subdivision 4.\n(b) A corporation, pension or investment fund, trust, limited liability company, or limited partnership that cannot meet any of the definitions in subdivision 2, paragraphs (b) to (f), (j) to (m), (p) to (x), (z), and (bb), may petition the commissioner for an exemption from this subdivision. The commissioner may issue an exemption if the entity meets the following criteria:\n(1) the exemption would not contradict the purpose of this section; and\n(2) the petitioning entity would not have a significant impact upon the agriculture industry and the economy.\nThe commissioner shall review annually each entity that is issued an exemption under this paragraph to ensure that the entity continues to meet the criteria in clauses (1) and (2). If an entity fails to meet the criteria, the commissioner shall withdraw the exemption and the entity is subject to enforcement proceedings under subdivision 5. The commissioner shall submit a report with a list of each entity that is issued an exemption under this paragraph to the chairs of the senate and house of representatives agricultural policy committees by October 1 of each year.\nA corporation, pension or investment fund, limited partnership, or limited liability company other than those meeting any of the definitions in subdivision 2, paragraphs (c) to (f) or (j) to (m), when leasing farm land to a family farm unit, a family farm corporation, a family farm trust, an authorized farm corporation, an authorized livestock farm corporation, a family farm partnership, an authorized farm partnership, a family farm limited liability company, or an authorized farm limited liability company, under provisions of subdivision 2, paragraph (x), must include within the lease agreement a provision prohibiting intentional damage or destruction to a conservation practice on the agricultural land.\nA corporation, pension or investment fund, or limited partnership, or limited liability company other than those meeting any of the definitions in subdivision 2, paragraphs (c) to (f) or (j) to (m), which, during the period of time it holds agricultural land under subdivision 2, paragraph (x), intentionally destroys a conservation practice as defined in section 103F.401, subdivision 3, to which the state has made a financial contribution, must pay the commissioner, for deposit in the general fund, an amount equal to the state's total contributions to that conservation practice plus interest from the time of investment in the conservation practice. Interest must be calculated at an annual percentage rate of 12 percent.\n(a) The chief executive officer of every pension or investment fund, corporation, limited partnership, limited liability company, or entity that is seeking to qualify for an exemption from the commissioner, and the trustee of a family farm trust that holds any interest in agricultural land or land used for the breeding, feeding, pasturing, growing, or raising of livestock, dairy or poultry, or products thereof, or land used for the production of agricultural crops or fruit or other horticultural products, other than a bona fide encumbrance taken for purposes of security, or which is engaged in farming or proposing to commence farming in this state after May 20, 1973, shall file with the commissioner a report containing the following information and documents:\n(1) the name of the pension or investment fund, corporation, limited partnership, or limited liability company and its place of incorporation, certification, or registration;\n(2) the address of the pension or investment plan headquarters or of the registered office of the corporation in this state, the name and address of its registered agent in this state and, in the case of a foreign corporation, limited partnership, or limited liability company, the address of its principal office in its place of incorporation, certification, or registration;\n(3) the acreage and location listed by quarter-quarter section, township, and county of each lot or parcel of agricultural land or land used for the keeping or feeding of poultry in this state owned or leased by the pension or investment fund, limited partnership, corporation, or limited liability company;\n(4) the names and addresses of the officers, administrators, directors, or trustees of the pension or investment fund, or of the officers, shareholders owning more than ten percent of the stock, including the percent of stock owned by each such shareholder, the members of the board of directors of the corporation, and the members of the limited liability company, and the general and limited partners and the percentage of interest in the partnership by each partner;\n(5) the farm products which the pension or investment fund, limited partnership, corporation, or limited liability company produces or intends to produce on its agricultural land;\n(6) with the first report, a copy of the title to the property where the farming operations are or will occur indicating the particular exception claimed under subdivision 3; and\n(7) with the first or second report, a copy of the conservation plan proposed by the soil and water conservation district, and with subsequent reports a statement of whether the conservation plan was implemented.\nThe report of a corporation, trust, limited liability company, or partnership seeking to qualify hereunder as a family farm corporation, an authorized farm corporation, an authorized livestock farm corporation, a family farm partnership, an authorized farm partnership, a family farm limited liability company, an authorized farm limited liability company, or a family farm trust or under an exemption from the commissioner shall contain the following additional information: the number of shares, partnership interests, or governance and financial rights owned by persons or current beneficiaries of a family farm trust residing on the farm or actively engaged in farming, or their relatives within the third degree of kindred according to the rules of the civil law or their spouses; the name, address, and number of shares owned by each shareholder, partnership interests owned by each partner or governance and financial rights owned by each member, and a statement as to percentage of gross receipts of the corporation derived from rent, royalties, dividends, interest, and annuities. No pension or investment fund, limited partnership, corporation, or limited liability company shall commence farming in this state until the commissioner has inspected the report and certified that its proposed operations comply with the provisions of this section.\n(b) Every pension or investment fund, limited partnership, trust, corporation, or limited liability company as described in paragraph (a) shall, prior to April 15 of each year, file with the commissioner a report containing the information required in paragraph (a), based on its operations in the preceding calendar year and its status at the end of the year. A pension or investment fund, limited partnership, corporation, or limited liability company that does not file the report by April 15 must pay a $500 civil penalty. The penalty is a lien on the land being farmed under subdivision 3 until the penalty is paid.\n(c) The commissioner may, for good cause shown, issue a written waiver or reduction of the civil penalty for failure to make a timely filing of the annual report required by this subdivision. The waiver or reduction is final and conclusive with respect to the civil penalty, and may not be reopened or modified by an officer, employee, or agent of the state, except upon a showing of fraud or malfeasance or misrepresentation of a material fact. The report required under paragraph (b) must be completed prior to a reduction or waiver under this paragraph. The commissioner may enter into an agreement under this paragraph only once for each corporation or partnership.\n(d) A report required under paragraph (a) or (b) must be submitted with a filing fee of $15. The fee must be deposited in the state treasury and credited to an account in the agricultural fund. Money in the account, including interest, is appropriated to the commissioner for the administrative expenses of this section.\n(e) Failure to file a required report or the willful filing of false information is a gross misdemeanor.\n(f) The trustee of a revocable trust with respect to which either the settlor, the settlor's spouse, or both, are the primary beneficiaries during the settlor's lifetime shall not be required to file with the commissioner a report under this section during any period that the trust is revocable.\nWith reason to believe that a corporation, limited partnership, limited liability company, trust, or pension or investment fund is violating subdivision 3, the attorney general shall commence an action in the district court in which any agricultural lands relative to such violation are situated, or if situated in two or more counties, in any county in which a substantial part of the lands are situated. The attorney general shall file for record with the county recorder or the registrar of titles of each county in which any portion of said lands are located a notice of the pendency of the action as provided in section 557.02. If the court finds that the lands in question are being held in violation of subdivision 3, it shall enter an order so declaring. The attorney general shall file for record any such order with the county recorder or the registrar of titles of each county in which any portion of said lands are located. Thereafter, the pension or investment fund, limited partnership, or corporation owning such land shall have a period of five years from the date of such order to divest itself of such lands. The aforementioned five-year limitation period shall be deemed a covenant running with the title to the land against any pension or investment fund, limited partnership, or corporate grantee or assignee or the successor of such pension or investment fund, limited partnership, or corporation. Any lands not so divested within the time prescribed shall be sold at public sale in the manner prescribed by law for the foreclosure of a mortgage by action. In addition, any prospective or threatened violation may be enjoined by an action brought by the attorney general in the manner provided by law.\n[Renumbered 500.245, subdivision 1]\n[Renumbered 500.245, subd 2]\n[Renumbered 500.245, subd 3]",
	"repealed": false
}