{
	"id": "62D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.04",
	"title": "62D.04 ISSUANCE OF CERTIFICATE AUTHORITY.",
	"text": "Upon receipt of an application for a certificate of authority, the commissioner of health shall determine whether the applicant for a certificate of authority has:\n(a) demonstrated the willingness and potential ability to assure that health care services will be provided in such a manner as to enhance and assure both the availability and accessibility of adequate personnel and facilities;\n(b) arrangements for an ongoing evaluation of the quality of health care, including a peer review process;\n(c) a procedure to develop, compile, evaluate, and report statistics relating to the cost of its operations, the pattern of utilization of its services, the quality, availability and accessibility of its services, and such other matters as may be reasonably required by regulation of the commissioner of health;\n(d) reasonable provisions for emergency and out of area health care services;\n(e) demonstrated that it is financially responsible and may reasonably be expected to meet its obligations to enrollees and prospective enrollees. In making this determination, the commissioner of health shall require the amount of initial net worth required in section 62D.042, compliance with the risk-based capital standards under sections 60A.50 to 60A.592, the deposit required in section 62D.041, and in addition shall consider:\n(1) the financial soundness of its arrangements for health care services and the proposed schedule of charges used in connection therewith;\n(2) arrangements which will guarantee for a reasonable period of time the continued availability or payment of the cost of health care services in the event of discontinuance of the health maintenance organization; and\n(3) agreements with providers for the provision of health care services;\n(f) demonstrated that it will assume full financial risk on a prospective basis for the provision of comprehensive health maintenance services, including hospital care; provided, however, that the requirement in this paragraph shall not prohibit the following:\n(1) a health maintenance organization from obtaining insurance or making other arrangements (i) for the cost of providing to any enrollee comprehensive health maintenance services, the aggregate value of which exceeds $5,000 in any year, (ii) for the cost of providing comprehensive health care services to its members on a nonelective emergency basis, or while they are outside the area served by the organization, or (iii) for not more than 95 percent of the amount by which the health maintenance organization's costs for any of its fiscal years exceed 105 percent of its income for such fiscal years; and\n(2) a health maintenance organization from having a provision in a group health maintenance contract allowing an adjustment of premiums paid based upon the actual health services utilization of the enrollees covered under the contract, except that at no time during the life of the contract shall the contract holder fully self-insure the financial risk of health care services delivered under the contract. Risk sharing arrangements shall be subject to the requirements of sections 62D.01 to 62D.30;\n(g) demonstrated that it has made provisions for and adopted a conflict of interest policy applicable to all members of the board of directors and the principal officers of the health maintenance organization. The conflict of interest policy shall include the procedures described in section 317A.255, subdivisions 1 and 2. However, the commissioner is not precluded from finding that a particular transaction is an unreasonable expense as described in section 62D.19 even if the directors follow the required procedures; and\n(h) otherwise met the requirements of sections 62D.01 to 62D.30.\nWithin 90 days after the receipt of the application for a certificate of authority, the commissioner of health shall determine whether or not the applicant meets the requirements of this section. If the commissioner of health determines that the applicant meets the requirements of sections 62D.01 to 62D.30, the commissioner shall issue a certificate of authority to the applicant. If the commissioner of health determines that the applicant is not qualified, the commissioner shall so notify the applicant and shall specify the reason or reasons for such disqualification.\nNo person who has not been issued a certificate of authority shall use the words \"health maintenance organization\" or the initials \"HMO\" in its name, contracts or literature. Provided, however, that persons who are operating under a contract with, operating in association with, enrolling enrollees for, or otherwise authorized by a health maintenance organization licensed under sections 62D.01 to 62D.30 to act on its behalf may use the terms \"health maintenance organization\" or \"HMO\" for the limited purpose of denoting or explaining their association or relationship with the authorized health maintenance organization. No health maintenance organization which has a minority of enrollees and members elected according to section 62D.06, subdivision 1, as members of its board of directors shall use the words \"consumer controlled\" in its name or in any way represent to the public that it is controlled by consumers.\nUpon being granted a certificate of authority to operate as a health maintenance organization, the organization must continue to operate in compliance with the standards set forth in subdivision 1. Noncompliance may result in the imposition of a fine or the suspension or revocation of the certificate of authority, in accordance with sections 62D.15 to 62D.17.\nHealth maintenance organizations that are a nonprofit corporation organized under chapter 317A or a local governmental unit shall, as a condition of receiving and retaining a certificate of authority, participate in the medical assistance and MinnesotaCare programs. A health maintenance organization governed by this subdivision is required to submit proposals in good faith that meet the requirements of the request for proposal provided that the requirements can be reasonably met by a health maintenance organization to serve individuals eligible for the above programs in a geographic region of the state if, at the time of publication of a request for proposal, the percentage of recipients in the public programs in the region who are enrolled in the health maintenance organization is less than the health maintenance organization's percentage of the total number of individuals enrolled in health maintenance organizations in the same region. Geographic regions shall be defined by the commissioner of human services in the request for proposals.",
	"repealed": false
}