{
	"id": "270C.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.56",
	"title": "270C.56 PERSONAL LIABILITY.",
	"text": "A person who, either singly or jointly with others, has the control of, supervision of, or responsibility for filing returns or reports, paying taxes, or collecting or withholding and remitting taxes and who fails to do so, or a person who is liable under any other law, is liable for the payment of taxes arising under chapters 295, 296A, 297A, 297F, and 297G, or sections 290.92 and 297E.02, and the applicable penalties and interest on those taxes.\nThe term \"person\" includes, but is not limited to, a corporation, estate, trust, organization, or association, whether organized for profit or not, an officer or director of a corporation, a member of a partnership, an employee, a third party (including, but not limited to, a financial institution, lender, or surety), and any other individual or entity. \"Person\" does not include an unpaid, volunteer member of a board of trustees or directors of an organization exempt from taxation under section 290.05, if the member is solely serving in an honorary capacity, does not participate in the day-to-day or financial operations of the organization, and has no actual knowledge of the failure to file returns or remit taxes.\n(a) The commissioner may assess liability for the taxes described in subdivision 1 against a person liable under this section. The assessment may be based upon information available to the commissioner. It must be made within the prescribed period of limitations for assessing the underlying tax, within one year after the date of an order assessing underlying tax, or within one year after the date of a final administrative or judicial determination, whichever period expires later. An order assessing personal liability under this section is reviewable under section 270C.35 and is appealable to Tax Court.\n(b) If the time for appealing the order has expired and a payment is made by or collected from the person assessed on the order in excess of the amount lawfully due from that person of any portion of the liability shown on the order, a claim for refund may be made by that person within 120 days after any payment of the liability if the payment is within 3-1/2 years after the date the order was issued. Claims for refund under this paragraph are limited to the amount paid during the 120-day period. Any amounts collected under paragraph (c) after a claim for refund is filed in order to satisfy the unpaid balance of the assessment that is the subject of the claim shall be returned if the claim is allowed. There is no claim for refund available under this paragraph if the assessment has previously been the subject of an administrative or Tax Court appeal, or a denied claim for refund. The taxpayer may contest denial of the refund as provided in the procedures governing claims for refunds under section 289A.50, subdivision 7.\n(c) If a person has been assessed under this section for an amount for a given period and the time for appeal has expired, regardless of whether an action contesting denial of a claim for refund has been filed under paragraph (b), or there has been a final determination that the person is liable, collection action is not stayed pursuant to section 270C.33, subdivision 5, for that assessment or for subsequent assessments of additional amounts for the same person for the same period and tax type.\nA person who has paid all or part of a liability assessed under this section has a cause of action against other liable persons to recover the amount paid in excess of that person's share of the liability. A claim for recovery of contribution may be made only in a proceeding which is separate from, and cannot be joined or consolidated with, an administrative or judicial proceeding or investigation involving the commissioner's administration or enforcement of this section. An order assessing liability under this section against the person from whom contribution is being sought is not a prerequisite for bringing an action for recovery of contribution, nor is the issuance of an order binding on the court in which the proceeding is brought. The court can determine whether each person would be liable under this section and the share of liability. The commissioner cannot be made a party to any proceeding for recovery of contribution, nor is a determination in such a proceeding binding on the commissioner for the purpose of administering or enforcing this section. An action for contribution arises when the liability under this section is paid in full, or the liability of the person seeking contribution has been determined by agreement between the commissioner and such person and paid, and must be brought within the time period prescribed in section 541.05.",
	"repealed": false
}