{
	"id": "518A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.60",
	"title": "518A.60 COLLECTION; ARREARS ONLY.",
	"text": "(a) Remedies available for the collection and enforcement of support in this chapter and chapters 142A, 256, 257, 518, and 518C also apply to cases in which the child or children for whom support is owed are emancipated and the obligor owes past support or has an accumulated arrearage as of the date of the youngest child's emancipation. Child support arrearages under this section include arrearages for child support, medical support, child care, pregnancy and birth expenses, and unreimbursed medical expenses as defined in section 518A.41, subdivision 1, paragraph (h).\n(b) This section applies retroactively to any support arrearage that accrued on or before June 3, 1997, and to all arrearages accruing after June 3, 1997.\n(c) Past support or pregnancy and confinement expenses ordered for which the obligor has specific court ordered terms for repayment may not be enforced using drivers' and occupational or professional license suspension and credit bureau reporting, unless the obligor fails to comply with the terms of the court order for repayment.\n(d) If an arrearage exists at the time a support order would otherwise terminate and section 518A.53, subdivision 10, paragraph (c), does not apply to this section, the arrearage shall be repaid in an amount equal to the current support order until all arrears have been paid in full, absent a court order to the contrary.\n(e) If an arrearage exists according to a support order which fails to establish a monthly support obligation in a specific dollar amount, the public authority, if it provides child support services, or the obligee, may establish a payment agreement which shall equal what the obligor would pay for current support after application of section 518A.34, plus an additional 20 percent of the current support obligation, until all arrears have been paid in full. If the obligor fails to enter into or comply with a payment agreement, the public authority, if it provides child support services, or the obligee, may move the district court or child support magistrate, if section 484.702 applies, for an order establishing repayment terms.\n(f) If there is no longer a current support order because all of the children of the order are emancipated, the public authority may discontinue child support services and close its case under title IV-D of the Social Security Act if:\n(1) the arrearage is under $500; or\n(2) the arrearage is considered unenforceable by the public authority because there have been no collections for three years, and all administrative and legal remedies have been attempted or are determined by the public authority to be ineffective because the obligor is unable to pay, the obligor has no known income or assets, and there is no reasonable prospect that the obligor will be able to pay in the foreseeable future.\n(g) At least 60 calendar days before the discontinuation of services under paragraph (f), the public authority must mail a written notice to the obligee and obligor at the obligee's and obligor's last known addresses that the public authority intends to close the child support enforcement case and explaining each party's rights. Seven calendar days after the first notice is mailed, the public authority must mail a second notice under this paragraph to the obligee.\n(h) The case must be kept open if the obligee responds before case closure and provides information that could reasonably lead to collection of arrears. If the case is closed, the obligee may later request that the case be reopened by completing a new application for services, if there is a change in circumstances that could reasonably lead to the collection of arrears.",
	"repealed": false
}