{
	"id": "332B.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/332B.13",
	"title": "332B.13 ENFORCEMENT; REMEDIES.",
	"text": "A violation of any of the provisions of this chapter is considered an unfair or deceptive trade practice under section 8.31, subdivision 1. A private right of action under section 8.31 by an aggrieved debtor is in the public interest.\n(a) A debt settlement services provider who fails to comply with any of the provisions of this chapter, or a lead generator who violates section 332B.11, is liable under this section in an individual action for the sum of:\n(1) actual, incidental, and consequential damages sustained by the debtor as a result of the failure; and\n(2) statutory damages of up to $5,000.\n(b) A debt settlement services provider who fails to comply with any of the provisions of this chapter, or a lead generator who violates section 332B.11, is liable to the named plaintiffs under this section in a class action for the amount that each named plaintiff could recover under paragraph (a), clause (1), and to the other class members for such amount as the court may allow.\n(c) In determining the amount of statutory damages, the court shall consider, among other relevant factors:\n(1) the frequency, nature, and persistence of noncompliance;\n(2) the extent to which the noncompliance was intentional; and\n(3) in the case of a class action, the number of debtors adversely affected.\n(d) A plaintiff or class successful in a legal or equitable action under this section is entitled to the costs of the action, plus reasonable attorney fees.\n(a) A debtor may sue a debt settlement services provider for temporary or permanent injunctive or other appropriate equitable relief to prevent violations of any provision of this chapter. A court must grant injunctive relief on a showing that the debt settlement services provider has violated any provision of this chapter, or in the case of a temporary injunction, on a showing that the debtor is likely to prevail on allegations that the debt settlement services provider violated any provision of this chapter.\n(b) A debtor may sue a lead generator for temporary or permanent injunctive or other appropriate equitable relief to prevent violations of section 332B.11. A court must grant injunctive relief on a showing that the lead generator has violated section 332B.11, or in the case of a temporary injunction, on a showing that the debtor is likely to prevail on allegations that the lead generator violated section 332B.11.\nThe remedies provided in this section are cumulative and do not restrict any remedy that is otherwise available. The provisions of this chapter are not exclusive and are in addition to any other requirements, rights, remedies, and penalties provided by law.\nThe attorney general shall enforce this chapter under section 8.31.",
	"repealed": false
}