{
	"id": "298.018",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.018",
	"title": "298.018 DISTRIBUTION OF PROCEEDS.",
	"text": "(a) The proceeds of the tax paid under sections 298.015 and 298.016 on ores, metals, or minerals mined or extracted within the taconite assistance area defined in section 273.1341, shall be allocated as follows:\n(1) except as provided under paragraph (b), five percent to the city or town within which the minerals or energy resources are mined or extracted, or within which the concentrate was produced. If the mining and concentration, or different steps in either process, are carried on in more than one taxing district, the commissioner shall apportion equitably the proceeds among the cities and towns by attributing 50 percent of the proceeds of the tax to the operation of mining or extraction, and the remainder to the concentrating plant and to the processes of concentration, and with respect to each thereof giving due consideration to the relative extent of the respective operations performed in each taxing district;\n(2) ten percent to the taconite municipal aid account to be distributed as provided in section 298.282, subdivisions 1 and 2, on the dates provided under this section;\n(3) ten percent to the school district within which the minerals or energy resources are mined or extracted, or within which the concentrate was produced. If the mining and concentration, or different steps in either process, are carried on in more than one school district, distribution among the school districts must be based on the apportionment formula prescribed in clause (1);\n(4) 20 percent to a group of school districts comprised of those school districts wherein the mineral or energy resource was mined or extracted or in which there is a qualifying municipality as defined by section 273.134, paragraph (b), in direct proportion to school district indexes as follows: for each school district, its pupil units determined under section 126C.05 for the prior school year shall be multiplied by the ratio of the average adjusted net tax capacity per pupil unit for school districts receiving aid under this clause as calculated pursuant to chapters 122A, 126C, and 127A for the school year ending prior to distribution to the adjusted net tax capacity per pupil unit of the district. Each district shall receive that portion of the distribution which its index bears to the sum of the indices for all school districts that receive the distributions;\n(5) ten percent to the county within which the minerals or energy resources are mined or extracted, or within which the concentrate was produced. If the mining and concentration, or different steps in either process, are carried on in more than one county, distribution among the counties must be based on the apportionment formula prescribed in clause (1), provided that any county receiving distributions under this clause shall pay one percent of its proceeds to the Range Association of Municipalities and Schools;\n(6) five percent to St. Louis County acting as the counties' fiscal agent to be distributed as provided in sections 273.134 to 273.136;\n(7) 20 percent to the commissioner of Iron Range resources and rehabilitation for the purposes of section 298.22;\n(8) three percent to the Douglas J. Johnson economic protection trust fund;\n(9) seven percent to the taconite environmental protection fund; and\n(10) ten percent to the commissioner of Iron Range resources and rehabilitation for capital improvements to Giants Ridge Recreation Area.\n(b) If the materials or energy resources are mined, extracted, or concentrated in School District No. 2711, Mesabi East, then the amount under paragraph (a), clause (1), must instead be distributed pursuant to this paragraph. The cities of Aurora, Babbitt, Ely, and Hoyt Lakes must each receive 20 percent of the amount. The city of Biwabik and Embarrass Township must each receive ten percent of the amount.\n(c) For the first five years that tax paid under section 298.015, subdivisions 1 and 2, is distributed under this subdivision, ten percent of the total proceeds distributed in each year must first be distributed pursuant to this paragraph. The remaining 90 percent of the total proceeds distributed in each of those years must be distributed as outlined in paragraph (a). Of the amount available under this paragraph, the cities of Aurora, Babbitt, Ely, and Hoyt Lakes must each receive 20 percent. Of the amount available under this paragraph, the city of Biwabik and Embarrass Township must each receive ten percent. This paragraph applies only to tax paid by a person engaged in the business of mining within the area described in section 273.1341, clauses (1) and (2).\n[See Note.]\nThe proceeds of the tax allocated under subdivision 1 shall be distributed on December 15 each year. Any payment of proceeds received after December 15 shall be distributed on the next gross proceeds tax distribution date.\nThe proceeds of the tax paid under sections 298.015 and 298.016 on ores, metals, or minerals mined or extracted outside of the taconite assistance area defined in section 273.1341, shall be deposited in the general fund.",
	"repealed": false
}