{
	"id": "347.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.11",
	"title": "347.11 DOG COLLARS TO BE TAGGED.",
	"text": "The clerk or the clerk's deputy issuing a license shall at the same time deliver to the licensee a metal tag, which shall bear the same serial number as the license. The tag shall also bear the name of the county in which issued and the license year. The county auditor shall contract for and have prepared and furnished, annually, a sufficient number of such metal tags, and a sufficient supply of suitable blank licenses to be bound in books of proper size and perforated so that a duplicate of each license may be kept upon the stub thereof. The cost of making, printing, and furnishing the tags and blank license receipts shall be paid out of the dog license fund.\nThe several county auditors shall distribute these tags and license blanks to the several town and city treasurers in proper amounts, together with blank license receipts. The licensee shall securely attach the tag to a collar and this collar, with the tag attached, shall at all times be kept on the dog for which the license is issued. A new tag, with a new number, shall be furnished to the licensee by the town or city clerk, or deputy, in place of the original tag, upon presentation of the license and proof of the loss of the original tag. The town clerk or deputy shall then endorse the new tag number on the license and shall enter it upon the register. The clerk shall receive for services rendered in issuing the new tag the sum of ten cents, to be paid by the person obtaining the new tag.\nEvery town or city clerk, or clerk's deputy, shall, at the time of issuing a license and before delivering it, make a complete duplicate thereof upon the stub portion of the license blank. The clerk shall, annually, during the month of January, return to the county auditor all unused tags of the preceding year, together with license books therefor and all duplicate licenses of the preceding year, and the county auditor shall carefully check the returned tags, duplicate licenses, and license blanks to ascertain whether all tags and license blanks which were furnished by the county auditor have been accounted for; and to enable the county auditor to do that, the county auditor shall charge each town or city clerk with all tags and blank licenses furnished or delivered to the clerk and credit the clerk with those returned. In case of discrepancy, the county auditor shall notify the county attorney, who shall investigate and take steps to enforce the law.",
	"repealed": false
}