{
	"id": "103F.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.515",
	"title": "103F.515 REINVEST IN MINNESOTA RESERVE PROGRAM.",
	"text": "The board, in consultation with the commissioner of agriculture and the commissioner of natural resources, shall establish and administer the reinvest in Minnesota reserve program. The board shall implement sections 103F.505 to 103F.531. Selection of land for the reinvest in Minnesota reserve program must be based on its benefit to accomplishing the purposes in section 103F.505.\n(a) Land may be placed in the reinvest in Minnesota reserve program if the land meets the requirements of paragraphs (b) and (c) or paragraph (d).\n(b) Land is eligible if the land:\n(1) is marginal agricultural land;\n(2) is adjacent to marginal agricultural land and is either beneficial to resource protection or necessary for efficient recording of the land description;\n(3) consists of a drained wetland;\n(4) is land that with a windbreak or water quality improvement practice would be beneficial to resource protection;\n(5) is land in a sensitive groundwater area;\n(6) is riparian or floodplain land;\n(7) is cropland or noncropland adjacent to restored wetlands to the extent of up to eight acres of cropland or noncropland for each acre of wetland restored;\n(8) is a woodlot on agricultural land;\n(9) is abandoned building site on agricultural land, provided that funds are not used for compensation of the value of the buildings;\n(10) is land used for pasture; or\n(11) is land in an environmentally sensitive area, including grasslands, peatlands, shorelands, karst geology, trout stream watersheds, and forest lands in priority areas.\n(c) Eligible land under paragraph (a) must:\n(1) be owned by the landowner, or a parent or other blood relative of the landowner, for at least one year before the date of application;\n(2) not be set aside, enrolled or diverted under another federal or state government program unless enrollment in the reinvest in Minnesota reserve program would provide additional conservation benefits or a longer term of enrollment than under the current federal or state program; and\n(3) benefit the purposes in section 103F.505.\n(d) Land is eligible if the land is within a wellhead protection area as defined under section 103I.005, subdivision 24, and has a wellhead protection plan approved by the commissioner of health.\n(e) In selecting land for enrollment in the program, highest priority must be given to permanent easements that are consistent with the purposes stated in section 103F.505.\n(a) The board may acquire, or accept by gift or donation, conservation easements on eligible land. An easement may be permanent or of limited duration. An easement acquired on land for wetland restoration or windbreak purposes, under subdivision 2, may be only of permanent duration. An easement of limited duration may not be acquired if it is for a period less than 20 years. The negotiation and acquisition of easements authorized by this section are exempt from the contractual provisions of chapters 16B and 16C.\n(b) The board may acquire, or accept by gift or donation, flowage easements when necessary for completion of wetland restoration projects.\n(a) A conservation easement must prohibit:\n(1) alteration of wildlife habitat and other natural features, unless specifically approved by the board;\n(2) agricultural crop production and livestock grazing, unless specifically approved by the board for conservation management purposes or extreme drought;\n(3) spraying with chemicals or mowing, except:\n(i) as necessary to comply with noxious weed control laws;\n(ii) for emergency control of pests necessary to protect public health; or\n(iii) as approved by the board for conservation management purposes; and\n(4) extracting or mining any gravel, rock, or topsoil.\n(b) A conservation easement is subject to the terms of the agreement provided in subdivision 5.\n(c) A conservation easement must allow repairs, improvements, and inspections necessary to maintain public drainage systems provided the easement area is restored to the condition required by the terms of the conservation easement.\n(d) Notwithstanding paragraph (a), the board must permit the harvest of native grasses for use in seed production or bioenergy on wellhead protection lands eligible under subdivision 2, paragraph (d).\n(e) A conservation easement must allow the board and its employees and agents to enter the easement area for inspection and for enforcing the terms and conditions of the conservation easement.\nThe board may enroll eligible land in the reinvest in Minnesota reserve program by signing an agreement with a landowner in which the landowner agrees:\n(1) to convey to the state a conservation easement that is not subject to any prior liens or encumbrances that are determined to be objectionable by the attorney general;\n(2) to seed the land subject to the conservation easement, as specified in the agreement, to establish and maintain perennial cover of either a grass-legume mixture or native grasses for the term of the easement, at seeding rates determined by the board; or to plant trees or carry out other long-term capital improvements approved by the board for soil and water conservation or wildlife management;\n(3) to convey to the state a permanent easement for the wetland restoration;\n(4) that the easement duration may be lengthened through mutual agreement with the board in consultation with the commissioners of agriculture and natural resources if they determine that the changes effectuate the purpose of the program or facilitate its administration;\n(5) to be responsible for operating and maintaining approved practices designated in the conservation plan;\n(6) to pay, when due, all taxes and assessments that may be levied against the easement area;\n(7) to remove any existing structures as required before the conservation easement is conveyed and not place, erect, or construct structures on the easement area;\n(8) to remove any existing hazardous and toxic substances or any pollutants and contaminants before the conservation easement is conveyed and not place such substances, pollutants, or contaminants on the easement area; and\n(9) to properly seal all abandoned wells on the easement area before the conservation easement is conveyed and pay all associated costs.\n(a) The board shall establish rates for payments to the landowner for the conservation easement and related practices. The board shall consider market factors, including the township average equalized estimated market value of property as established by the commissioner of revenue at the time of easement application.\n(b) The board may establish a payment system for flowage easements acquired under this section.\n(c) For wetland restoration projects involving more than one conservation easement, state payments for restoration costs may exceed the limits set by the board for an individual easement provided the total payment for the restoration project does not exceed the amount payable for the total number of acres involved.\nWhen a conservation easement of limited duration expires, a new conservation easement and agreement for an additional period of not less than 20 years may be acquired by agreement of the board and the landowner, under the terms of this section. The board may adjust payment rates as a result of renewing an agreement and conservation easement only after examining the condition of the established cover, conservation practices, and land values.\nTo correct errors in legal descriptions for easements that affect the ownership interests in the state and adjacent landowners, the board may, in the name of the state, with the approval of the attorney general, convey, without consideration, interests of the state necessary to correct legal descriptions of boundaries. The conveyance must be by quitclaim deed or release in a form approved by the attorney general.\n(a) A landowner who violates the term of a conservation easement or agreement under this section, or induces, assists, or allows another to do so, is liable to the state for treble damages if the trespass is willful, but liable for double damages only if the trespass is not willful. The amount of damages is the amount needed to make the state whole or the amount the landowner has gained due to the violation, whichever is greater.\n(b) The board may request that the attorney general commence a legal action for a violation, and the attorney general may commence an action for specific performances, injunctive relief, damages, including attorney's fees, and any other appropriate relief to enforce sections 103F.505 to 103F.531 in district court in the county where all or part of the violation is alleged to have been committed, or where the landowner resides or has a principal place of business. In addition to or in lieu of making a request under this paragraph, the board may use its authority under section 103B.101, subdivision 12, to issue a penalty order for a violation. The penalties may be forgiven, in whole or in part, upon compliance with the conservation easement conditions.\n(c) A landowner is not in violation of the conservation easement if a failure of approved practices was caused by reasons beyond the landowner's control.\nMoney made available under the reinvest in Minnesota reserve program may not be used for environmental regulatory or wetland mitigation purposes required under federal or state law.",
	"repealed": false
}