{
	"id": "252.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.50",
	"title": "252.50 STATE-OPERATED PROGRAMS.",
	"text": "MS 2022 [Repealed, 2024 c 79 art 10 s 5]\n[Renumbered 246C.16, subd 5]\nThe commissioner may, within the limits of appropriations made available for this purpose, use enhanced waivered services funds under the home and community-based waiver for persons with developmental disabilities to move to state-operated community programs and to private facilities.\nTo the extent possible, the commissioner may amend the medical assistance home and community-based waiver and, as appropriate, develop special waiver procedures for targeting services to persons currently in state regional treatment centers.\n[Renumbered 246C.11, subd 6]\n(a) In determining the location of state-operated, community-based programs, the needs of the individual client shall be paramount. The executive board shall also take into account:\n(1) prioritization of beds in state-operated, community-based programs for individuals with complex behavioral needs that cannot be met by private community-based providers;\n(2) choices made by individuals who chose to move to a more integrated setting, and shall coordinate with the lead agency to ensure that appropriate person-centered transition plans are created;\n(3) the personal preferences of the persons being served and their families as determined by Minnesota Rules, parts 9525.0004 to 9525.0036;\n(4) the location of the support services established by the individual service plans of the persons being served;\n(5) the appropriate grouping of the persons served;\n(6) the availability of qualified staff;\n(7) the need for state-operated, community-based programs in the geographical region of the state; and\n(8) a reasonable commuting distance from a regional treatment center or the residences of the program staff.\n(b) The executive board must locate state-operated, community-based programs in coordination with the commissioner of human services according to section 252.28.\n[Renumbered 246.65]\n[Renumbered 246.585]\n[Renumbered 246.588]\nMS 2022 [Repealed, 2024 c 79 art 10 s 5]\n[Renumbered 246.611]\nMS 2022 [Repealed, 2024 c 79 art 10 s 5]",
	"repealed": false
}