{
	"id": "116O.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/116O.05",
	"title": "116O.05 POWERS OF CORPORATION.",
	"text": "(a) The corporation has the powers granted to a business corporation by section 302A.161, subdivisions 3; 4; 5; 7; 8; 9; 11; 12; 13, except that the corporation may not act as a general partner in any partnership; 14; 15; 16; 17; 18; and 22.\n(b) The state is not liable for the obligations of the corporation.\n(c) Section 302A.041 applies to this chapter and the corporation in the same manner that it applies to business corporations established under chapter 302A.\n(a) The primary duties of the corporation shall include:\n(1) development of new products and processes for operational efficiency and excellence, enabling company growth; and\n(2) business development services with technology utilization and application, primarily for small and medium-sized manufacturers.\n(b) The corporation shall also:\n(1) provide or provide for technology-related assistance to individuals, sole proprietorships, partnerships, corporations, other business entities, and nonprofit organizations; and\n(2) not duplicate existing services or activities provided by other public and private organizations but shall build on the existing educational, business, and economic development infrastructure.\nThe corporation must publish in the State Register any guidelines, policies, or eligibility criteria prepared or adopted by the corporation for any of its financial or technology transfer programs.\nOn making a determination that the public policies and purposes of this chapter will be carried out to a greater extent than what might otherwise occur, the board may cause to be created and may delegate, assign, or transfer to one or more entities, including without limitation a corporation, nonprofit corporation, limited liability company, partnership, or limited partnership, any or all rights and duties, assets and liabilities, powers or authority created, authorized, or allowed under this chapter, except to the extent specifically limited by the constitution or by law.",
	"repealed": false
}