{
	"id": "473.252",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.252",
	"title": "473.252 TAX BASE REVITALIZATION ACCOUNT.",
	"text": "For the purpose of this section, \"municipality\" means a statutory or home rule charter city or town participating in the local housing incentives program under section 473.254, or a county in the metropolitan area.\nFor the purpose of this section, \"development authority\" means a statutory or home rule charter city, housing and redevelopment authority, economic development authority, and a port authority.\nThe council shall credit to the tax base revitalization account within the fund the amount, if any, distributed to the council under section 473F.08, subdivision 3b.\n(a) The council must use the funds in the account to make grants to municipalities or development authorities for the cleanup of polluted land in the metropolitan area. A grant to a metropolitan county or a development authority must be used for a project in a participating municipality. The council shall prescribe and provide the grant application form to municipalities. The council must consider the probability of funding from other sources when making grants under this section.\n(b)(1) The legislature expects that applications for grants will exceed the available funds and the council will be able to provide grants to only some of the applicant municipalities. If applications for grants for qualified sites exceed the available funds, the council shall make grants that provide the highest return in public benefits for the public costs incurred, that encourage development that will lead to the preservation or growth of living-wage jobs or the production of affordable housing, and that enhance the tax base of the recipient municipality.\n(2) In making grants, the council shall establish regular application deadlines in which grants will be awarded from the available money in the account. If the council provides for application cycles of less than six-month intervals, the council must reserve at least 40 percent of the receipts of the account for a year for application deadlines that occur in the second half of the year. If the applications for grants exceed the available funds for an application cycle, no more than one-half of the funds may be granted to projects in a statutory or home rule charter city and no more than three-quarters of the funds may be granted to projects located in cities of the first class.\n(c) A municipality may use the grant to provide a portion of the local match requirement for project costs that qualify for a grant under sections 116J.551 to 116J.557.\nMS 1998 [Repealed, 1999 c 243 art 6 s 17]\nMS 1998 [Repealed, 1999 c 243 art 6 s 17]",
	"repealed": false
}