{
	"id": "256B.0651",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0651",
	"title": "256B.0651 HOME CARE SERVICES.",
	"text": "(a) For the purposes of sections 256B.0651 to 256B.0654 and 256B.0659, the terms in paragraphs (b) to (g) have the meanings given.\n(b) \"Activities of daily living\" has the meaning given in section 256B.0659, subdivision 1, paragraph (b).\n(c) \"Assessment\" means a review and evaluation of a recipient's need for home care services conducted in person.\n(d) \"Home care services\" means medical assistance covered services that are home health agency services, including skilled nurse visits; home health aide visits; physical therapy, occupational therapy, respiratory therapy, and language-speech pathology therapy; home care nursing; and personal care assistance.\n(e) \"Home residence,\" effective January 1, 2010, means a residence owned or rented by the recipient either alone, with roommates of the recipient's choosing, or with an unpaid responsible party or legal representative; or a family foster home where the license holder lives with the recipient and is not paid to provide home care services for the recipient except as allowed under sections 256B.0652, subdivision 10, and 256B.0654, subdivision 4.\n(f) \"Medically necessary\" has the meaning given in Minnesota Rules, parts 9505.0170 to 9505.0475.\n(g) \"Ventilator-dependent\" means an individual who receives mechanical ventilation for life support at least six hours per day and is expected to be or has been dependent on a ventilator for at least 30 consecutive days.\nHome care services covered under this section and sections 256B.0652 to 256B.0654 and 256B.0659 include:\n(1) nursing services under sections 256B.0625, subdivision 6a, and 256B.0653;\n(2) home care nursing services under sections 256B.0625, subdivision 7, and 256B.0654;\n(3) home health services under sections 256B.0625, subdivision 6a, and 256B.0653;\n(4) personal care assistance services under sections 256B.0625, subdivision 19a, and 256B.0659;\n(5) supervision of personal care assistance services provided by a qualified professional under sections 256B.0625, subdivision 19a, and 256B.0659;\n(6) face-to-face assessments by county public health nurses for services under sections 256B.0625, subdivision 19a, and 256B.0659; and\n(7) service updates and review of temporary increases for personal care assistance services by the county public health nurse for services under sections 256B.0625, subdivision 19a, and 256B.0659.\nThe following home care services are not eligible for payment under medical assistance:\n(1) services provided in a nursing facility, hospital, or intermediate care facility with exceptions in section 256B.0653;\n(2) services for the sole purpose of monitoring medication compliance with an established medication program for a recipient;\n(3) home care services for covered services under the Medicare program or any other insurance held by the recipient;\n(4) services to other members of the recipient's household;\n(5) any home care service included in the daily rate of the community-based residential facility where the recipient is residing;\n(6) nursing and rehabilitation therapy services that are reasonably accessible to a recipient outside the recipient's place of residence, excluding the assessment, counseling and education, and personal assistance care; or\n(7) Medicare evaluation or administrative nursing visits on dual-eligible recipients that do not qualify for Medicare visit billing.\nMS 2008 [Renumbered 256B.0652, subd 14]\n[Repealed by amendment, 2009 c 79 art 8 s 23]\nMS 2008 [Paragraph (a) renumbered 256B.0652, subd 3a]\n[Paragraph (b) renumbered 256B.0652, subd 4]\n[Paragraph (c) renumbered 256B.0652, subd 7]\nMS 2008 [Paragraph (a) renumbered 256B.0652, subd 8]\n[Paragraph (b) renumbered 256B.0652, subd 8]\n[Paragraph (c) renumbered 256B.0652, subd 13]\nMS 2008 [Renumbered 256B.0652, subd 9]\nMS 2008 [Renumbered 256B.0652, subd 10]\n[Repealed by amendment, 2009 c 79 art 8 s 23]\nMS 2008 [Renumbered 256B.0652, subd 11]\nThe commissioner or the commissioner's designee shall determine the medical necessity of home care services, the level of caregiver according to subdivision 2, and the institutional comparison according to this subdivision and sections 256B.0652, subdivisions 3a, 4 to 11, 13, and 14, and 256B.0659, the cost-effectiveness of services, and the amount, scope, and duration of home care services reimbursable by medical assistance, based on the assessment, primary payer coverage determination information as required, the service plan, the recipient's age, the cost of services, the recipient's medical condition, and diagnosis or disability. The commissioner may publish additional criteria for determining medical necessity according to section 256B.04.\nThe commissioner shall seek monetary recovery from providers of payments made for services which exceed the limits established in this section and sections 256B.0653, 256B.0654, and 256B.0659. This subdivision does not apply to services provided to a recipient at the previously authorized level pending an appeal under section 256.045, subdivision 10.\nHome care providers that do not participate in or accept Medicare assignment must refer and document the referral of dual-eligible recipients to Medicare providers when Medicare is determined to be the appropriate payer for services and supplies and equipment. Providers must be terminated from participation in the medical assistance program for failure to make these referrals.\nThe commissioner shall establish an ongoing quality assurance process for home care services to monitor program integrity, including provider standards and training, consumer surveys, and random reviews of documentation.\nThe commissioner has the authority to request proof of documentation of meeting provider standards, quality standards of care, correct billing practices, and other information. Failure to comply with or to provide access and information to demonstrate compliance with laws, rules, or policies may result in suspension, denial, or termination of the provider agency's enrollment with the department.\n(a) Providers of home care services must provide each recipient with a copy of the home care bill of rights under section 144A.44 at least 30 days prior to terminating services to a recipient, if the termination results from provider sanctions under section 256B.064, such as a payment withhold, a suspension of participation, or a termination of participation. If a home care provider determines it is unable to continue providing services to a recipient, the provider must notify the recipient, the recipient's responsible party, and the commissioner 30 days prior to terminating services to the recipient because of an action under section 256B.064, and must assist the commissioner and lead agency in supporting the recipient in transitioning to another home care provider of the recipient's choice.\n(b) In the event of a payment withhold from a home care provider, a suspension of participation, or a termination of participation of a home care provider under section 256B.064, the commissioner may inform the Office of Ombudsman for Long-Term Care and the lead agencies for all recipients with active service agreements with the provider. At the commissioner's request, the lead agencies must contact recipients to ensure that the recipients are continuing to receive needed care, and that the recipients have been given free choice of provider if they transfer to another home care provider. In addition, the commissioner or the commissioner's delegate may directly notify recipients who receive care from the provider that payments have been or will be withheld or that the provider's participation in medical assistance has been or will be suspended or terminated, if the commissioner determines that notification is necessary to protect the welfare of the recipients. For purposes of this subdivision, \"lead agencies\" means counties, tribes, and managed care organizations.",
	"repealed": false
}