{
	"id": "356.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.62",
	"title": "356.62 PAYMENT OF EMPLOYEE CONTRIBUTION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Employee\" means any person covered by a public pension or retirement plan.\n(c) \"Employee contributions\" means any sums deducted from the employee's salary or wages or otherwise paid in lieu thereof, regardless of whether they are denominated contributions by the public pension or retirement plan.\n(d) \"Public pension or retirement plan\" means a covered retirement plan listed in section 356.611, subdivision 6, or any other public retirement plan to which section 414(h)(2) of the Internal Revenue Code applies.\n(a) For purposes of any public pension or retirement plan, each employer shall pick up the employee contributions required under law or under the pension plan document for all salaries. The employer shall pick up these employee contributions by a reduction in the cash salary of the employee.\n(b) Employee contributions that are picked up must be treated for all purposes of the public pension or retirement plan in the same manner and to the same extent as employee contributions that were made before the date on which the employee contributions pick up began. The amount of the employee contributions that are picked up must be included in the salary upon which retirement coverage is credited and upon which retirement and survivor's benefits are determined.\n(c) The employing unit shall supply each employee and the commissioner of revenue with an information return indicating the amount of the employer's picked-up contributions for the calendar year that were not subject to withholding. This return must be provided to the employee not later than January 31 of the succeeding calendar year. The commissioner of revenue shall prescribe the form of the return and the provisions of section 289A.12 must apply to the extent not inconsistent with the provisions of this section.",
	"repealed": false
}