{
	"id": "473J.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.17",
	"title": "473J.17 MUNICIPAL ACTIVITIES.",
	"text": "The city may, to the extent legally permissible, acquire land, air rights, and other property interests within the development area for the stadium site and stadium infrastructure and convey it to the authority with or without consideration, prepare a site for development as a stadium, and acquire and construct any related stadium infrastructure. To the extent property parcels or interests acquired are more extensive than the stadium infrastructure requirements, the city may sell or otherwise dispose of the excess.\nExcept as may be mutually agreed to by the city and the authority, the city has no interest in or claim to any assets or revenues of the authority.\nThe authority is the responsible governmental unit for an environmental impact statement for the stadium prepared under section 116D.04, if an environmental impact statement is necessary. Notwithstanding section 116D.04, subdivision 2b, and implementing rules: (1) the environmental impact statement shall not be required to consider alternative stadium sites; and (2) the environmental impact statement must be determined to be adequate before commencing work on the foundation of the stadium, but the stadium and stadium infrastructure may otherwise be started and all preliminary and final government decisions and actions may be made and taken including, but not limited to, acquiring land; obtaining financing; granting permits or other land use approvals; entering into grant, lease, or use agreements; or preparing the site or related stadium infrastructure prior to a determination of the adequacy of the environmental impact statement.\nThe city may make expenditures or grants for other costs incidental and necessary to further the purposes of this chapter and may, by agreement, reimburse in whole or in part, any entity that has granted, loaned, or advanced funds to the city to further the purposes of this chapter. The city may reimburse the authority or a local governmental entity or make a grant to the authority or such a governmental unit or be reimbursed by the authority or local governmental entity for site acquisition, preparation of the site for stadium development, and stadium infrastructure.\nThe legislature intends that, except as expressly limited herein, the city may acquire and develop stadium infrastructure, enter into contracts with the authority and other governmental or nongovernmental entities, appropriate funds, and make employees, consultants, and other revenues available for those purposes.\nIn order to accomplish the objectives of Laws 2012, chapter 299, within the required time frame, it is necessary to establish an alternative process for municipal land use and development review. It is hereby found and declared that the construction of a stadium within the development area is consistent with the adopted area plan, is the preferred stadium location, and is a permitted land use. This subdivision establishes a procedure for all land use and development reviews and approvals by the city of Minneapolis for the stadium and related stadium infrastructure and supersedes all land use and development rules and restrictions and procedures imposed by other law, charter, or ordinance, including without limitation section 15.99. No later than 30 days after timely compliance of the city as provided in Laws 2012, chapter 299, article 3, section 7, the city of Minneapolis shall establish a stadium implementation committee to make recommendations on the design plans submitted for the stadium, and stadium infrastructure, and related improvements. The implementation committee must take action to issue its recommendations within the time frames established in the planning and construction timetable issued by the authority which shall provide for no less than 60 days for the committee's review. The recommendations of the implementation committee shall be forwarded to the city of Minneapolis Planning Commission for an advisory recommendation and then to the city council for final action in a single resolution, which final action must be taken within 45 days of the submission of the recommendations to the planning commission. The city council shall not impose any unreasonable conditions on the recommendations of the implementation committee, nor take any action or impose any conditions that will result in delay from the time frames established in the planning and construction timetable or in additional overall costs. Failure of the city council to act within the 45-day period shall be deemed to be approval. The authority may seek de novo review in the district court of any city council action. The district court or any appellate court shall expedite review to the maximum extent possible and timely issue relief, orders, or opinions as necessary to give effect to the provisions and objectives in this act.",
	"repealed": false
}