{
	"id": "352.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.93",
	"title": "352.93 RETIREMENT ANNUITY.",
	"text": "After separation from state service, an employee covered under section 352.91 who has reached age 55 years and is vested under section 352.925, is entitled upon application to a retirement annuity under this section, based only on covered correctional employees' service. Application may be made no earlier than 60 days before the date the employee is eligible to retire by reason of both age and service requirements.\nThe monthly annuity under this section must be determined by multiplying the average monthly salary by the number of years, or completed months, of covered correctional service by 2.4 percent if employed as a correctional state employee before July 1, 2010, or 2.2 percent if employed as a correctional state employee after June 30, 2010.\nAny covered correctional employee who becomes at least 50 years old and is vested under section 352.925, is entitled upon application to a reduced retirement annuity equal to the annuity calculated under subdivision 2, reduced by two-tenths of one percent for each month that the correctional employee is under age 55 at the time of retirement if first employed as a correctional state employee before July 1, 2010, and if retired before July 1, 2015, or reduced by 0.417 percent for each month that the correctional employee is under age 55 at the time of retirement if first employed as a correctional state employee after June 30, 2010, or if first employed as a correctional state employee before July 1, 2010, and if retired after June 30, 2015.\nThe annuity under this section must begin to accrue as provided in section 352.115, subdivision 8.\nThe board may establish optional annuity forms to pay a higher amount from the date of retirement until an employee is first eligible to draw Social Security benefits, reaches age 65, or reaches the age the employee is eligible to receive unreduced Social Security benefits, at which time the monthly benefits must be reduced. The optional annuity forms must be actuarially equivalent to the normal single life annuity form provided in subdivision 2. The optional annuity forms must be certified as actuarially equivalent by the actuary retained under section 356.214.\nA former employee who has both regular and correctional service shall, if qualified, receive an annuity based on both periods of service under applicable sections of law but no period of service shall be used more than once in calculating the annuity.\n[Repealed, 1983 c 128 s 36]\n[Repealed, 1983 c 128 s 36]\nA retirement annuity under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}