{
	"id": "403.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.51",
	"title": "403.51 AUTOMATIC EXTERNAL DEFIBRILLATION; REGISTRATION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Automatic external defibrillator\" or \"AED\" means an electronic device designed and manufactured to operate automatically or semiautomatically for the purpose of delivering an electrical current to the heart of a person in sudden cardiac arrest.\n(c) \"AED registry\" means a registry of AEDs that requires a maintenance program or package, and includes, but is not limited to: the Minnesota AED Registry, the National AED Registry, iRescU, or a manufacturer-specific program.\n(d) \"Person\" means a natural person, partnership, association, corporation, or unit of government.\n(e) \"Public access AED\" means an AED that is intended, by its markings or display, to be used or accessed by the public for the benefit of the general public that may be in the vicinity or location of that AED. It does not include an AED that is owned or used by a hospital, clinic, business, or organization that is intended to be used by staff and is not marked or displayed in a manner to encourage public access.\n(f) \"Maintenance program or package\" means a program that will alert the AED owner when the AED has electrodes and batteries due to expire or replaces those expiring electrodes and batteries for the AED owner.\n(g) \"Public safety agency\" means local law enforcement, county sheriff, municipal police, tribal agencies, state law enforcement, fire departments, including municipal departments, industrial fire brigades, and nonprofit fire departments, joint powers agencies, and licensed ambulance services.\n(h) \"Mobile AED\" means an AED that (1) is purchased with the intent of being located in a vehicle, including, but not limited to, public safety agency vehicles; or (2) will not be placed in stationary storage, including, but not limited to, an AED used at an athletic event.\n(i) \"Private-use AED\" means an AED that is not intended to be used or accessed by the public for the benefit of the general public. This may include, but is not limited to, AEDs found in private residences.\nA person who purchases or obtains a public access AED shall register that device with an AED registry within 30 working days of receiving the AED.\nA person registering a public access AED shall provide the following information for each AED:\n(1) AED manufacturer, model, and serial number;\n(2) specific location where the AED will be kept; and\n(3) the title, address, and telephone number of a person in management at the business or organization where the AED is located.\nThe owner of a public access AED shall notify the owner's AED registry of any changes in the information that is required in the registration within 30 working days of the change occurring.\nA public access AED:\n(1) may be inspected during regular business hours by a public safety agency with jurisdiction over the location of the AED;\n(2) must be kept in the location specified in the registration; and\n(3) must be reasonably maintained, including replacement of dead batteries and pads/electrodes, and comply with all manufacturer's recall and safety notices.\nAn authorized agent of a public safety agency with jurisdiction over the location of the AED may direct the owner of a public access AED to comply with this section. The authorized agent of the public safety agency may direct the owner of the AED to remove the AED from its public access location and to remove or cover any public signs relating to that AED if it is determined that the AED is not ready for immediate use.\nThe owner of a private-use AED is not subject to the requirements of this section but is encouraged to maintain the AED in a consistent manner.\nThe owner of a mobile AED is not subject to the requirements of this section but is encouraged to maintain the AED in a consistent manner.\nA person acquiring a public-use AED is encouraged but is not required to post signs bearing the universal AED symbol in order to increase the ease of access by the public to the AED in the event of an emergency. A person may not post any AED sign or allow any AED sign to remain posted upon being ordered to remove or cover any AED signs by an authorized agent of a public safety agency.\nThe owner of one or more public access AEDs shall develop an emergency response plan appropriate for the nature of the facility the AED is intended to serve.\nThis section does not create any civil liability on the part of an AED owner or preclude civil liability under other law. Section 645.241 does not apply to this section.",
	"repealed": false
}