{
	"id": "51A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.22",
	"title": "51A.22 SAVINGS LIABILITY.",
	"text": "The savings liability of an association shall consist only of the aggregate amount of savings accounts, plus earnings credited to the accounts, less redemption and withdrawal payments. Except as limited by the board of directors from time to time, additions may be made to an account holder's savings accounts in the amounts and at times the account holder elects. Savings accounts may be opened for cash or property in which the association is authorized to invest, and, in the absence of fraud in the transaction, the value of the property taken in payment therefor as determined by the board of directors shall be conclusive. The account holders of an association shall not be responsible for any losses which its savings liability shall not be sufficient to satisfy, and savings accounts shall not be subject to assessment, nor shall the holders thereof be liable for any unpaid installments on their accounts. Earnings shall be declared in accordance with the provisions of sections 51A.01 to 51A.57. Except as provided in section 51A.32, no association shall prefer one of its savings accounts over any other savings account as to the right to participate in earnings. No preference between savings account holders shall be created with respect to the distribution of assets upon voluntary liquidation, dissolution, or winding up of an association. No association shall issue, sell, negotiate, or advertise for issuance or sale to savings account holders any type of savings or investment media other than savings accounts, nor shall it contract with respect to the savings liability in a manner inconsistent with the provisions of sections 51A.01 to 51A.57.\nThe savings liability of a mutual association is not limited. The savings liability of a stock association shall not exceed a sum which is 30 times the amount of its capital stock and its actual surplus. For purposes of this subdivision capital certificates outstanding pursuant to section 51A.21, subdivision 20, may be included in the definition of capital stock.",
	"repealed": false
}