{
	"id": "80A.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.53",
	"title": "80A.53 SECTION 305; SECURITIES REGISTRATION FILINGS.",
	"text": "(a) Who may file. A registration statement may be filed by the issuer, a person on whose behalf the offering is to be made, or a broker-dealer registered under this chapter.\n(b) Status of offering. A registration statement filed under section 80A.51 or 80A.52 must specify:\n(1) the amount of securities to be offered in this state;\n(2) the states in which a registration statement or similar record in connection with the offering has been or is to be filed; and\n(3) any adverse order, judgment, or decree issued in connection with the offering by a state securities regulator, the Securities and Exchange Commission, or a court.\n(c) Incorporation by reference. A record filed under this chapter or the predecessor act within five years preceding the filing of a registration statement may be incorporated by reference in the registration statement to the extent that the record is currently accurate.\n(d) Nonissuer distribution. In the case of a nonissuer distribution, information or a record may not be required under subsection (i) or section 80A.52, unless it is known to the person filing the registration statement or to the person on whose behalf the distribution is to be made or unless it can be furnished by those persons without unreasonable effort or expense.\n(e) Escrow and impoundment. A rule adopted or order issued under this chapter may require as a condition of registration that a security issued within the previous five years or to be issued to a promoter for a consideration substantially less than the public offering price or to a person for a consideration other than cash be deposited in escrow; and that the proceeds from the sale of the registered security in this state be impounded until the issuer receives a specified amount from the sale of the security either in this state or elsewhere. The conditions of any escrow or impoundment required under this subsection may be established by rule adopted or order issued under this chapter, but the administrator may not reject a depository institution solely because of its location in another state.\n(f) Form of subscription. A rule adopted or order issued under this chapter may require as a condition of registration that a security registered under this chapter be sold only on a specified form of subscription or sale contract and that a signed or conformed copy of each contract be filed under this chapter or preserved for a period specified by the rule or order, which may not be longer than five years.\n(g) Effective period. Except while a stop order is in effect under section 80A.54, a registration statement is effective for one year after its effective date, or for any longer period designated in an order under this chapter during which the security is being offered or distributed in a nonexempted transaction by or for the account of the issuer or other person on whose behalf the offering is being made or by an underwriter or broker-dealer that is still offering part of an unsold allotment or subscription taken as a participant in the distribution. For the purposes of a nonissuer transaction, all outstanding securities of the same class identified in the registration statement as a security registered under this chapter are considered to be registered while the registration statement is effective. If any securities of the same class are outstanding, a registration statement may not be withdrawn until one year after its effective date. A registration statement may be withdrawn only with the approval of the administrator.\n(h) Periodic reports. While a registration statement is effective, a rule adopted or order issued under this chapter may require the person that filed the registration statement to file reports, not more often than quarterly, to keep the information or other record in the registration statement reasonably current and to disclose the progress of the offering.\n(i) Posteffective amendments. A registration statement may be amended after its effective date. The posteffective amendment becomes effective when the administrator so orders. If a posteffective amendment is made to increase the number of securities specified to be offered or sold, the person filing the amendment shall pay a registration fee. A posteffective amendment relates back to the date of the offering of the additional securities being registered if, within one year after the date of the sale, the amendment is filed and the additional registration fee is paid.",
	"repealed": false
}