{
	"id": "84.926",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.926",
	"title": "84.926 VEHICLE USE ON PUBLIC LANDS; EXCEPTIONS.",
	"text": "Notwithstanding sections 84.773, subdivision 1, and 84.777, on a case-by-case basis, the commissioner may issue a permit authorizing a person to operate an off-highway vehicle on individual public trails under the commissioner's jurisdiction during specified times and for specified purposes.\nNotwithstanding section 84.777, but subject to the commissioner's authority under subdivision 5, on state forest lands classified as managed or limited, other than the Richard J. Dorer Memorial Hardwood Forest, a person may use an all-terrain vehicle off forest trails or forest roads when:\n(1) hunting big game or transporting or installing hunting stands during October, November, and December, when in possession of a valid big-game-hunting license;\n(2) retrieving big game in September, when in possession of a valid big-game-hunting license;\n(3) tending traps during an open trapping season for protected furbearers, when in possession of a valid trapping license; or\n(4) trapping minnows, when in possession of a valid minnow dealer, private fish hatchery, or aquatic farm license.\nNotwithstanding section 84.777, the commissioner may determine whether all-terrain vehicles are allowed on specific forest roads, on state forest lands classified as closed, for the purpose of hunting big game during an open big-game season. The determination shall be by written order as published in the State Register and is exempt from chapter 14. Section 14.386 does not apply.\nNotwithstanding section 84.777, but subject to the commissioner's authority under subdivision 5, on state forest lands classified as limited or managed, other than the Richard J. Dorer Memorial Hardwood Forest, a person may use vehicles registered under chapter 168 or section 84.798 or 84.922, including class 2 all-terrain vehicles, on forest trails designated for off-road vehicle use and on forest trails that are not designated for a specific use when:\n(1) hunting big game or transporting or installing hunting stands during October, November, and December, when in possession of a valid big-game-hunting license;\n(2) retrieving big game in September, when in possession of a valid big-game-hunting license;\n(3) tending traps during an open trapping season for protected furbearers, when in possession of a valid trapping license; or\n(4) trapping minnows, when in possession of a valid minnow dealer, private fish hatchery, or aquatic farm license.\nThe commissioner may designate areas on state forest lands that are not subject to the exceptions provided in subdivisions 2 and 4. Such designations are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply. Before designating such areas, the commissioner shall hold a public meeting in the county where the largest portion of the forest lands are located to provide information to and receive comment from the public regarding the proposed designation. Sixty days before the public meeting, notice of the proposed designation shall be published in the legal newspapers that serve the counties in which the lands are located, in a statewide Department of Natural Resources news release, and in the State Register.\nExcept as provided in subdivision 4, operation of class 2 all-terrain vehicles on lands administered by the commissioner is limited to forest roads, minimum maintenance roads, and trails designated or signed for class 2 all-terrain vehicles.\nForests classified as closed forests are open to off-trail snowmobile use unless prohibited, as determined by the commissioner by written order published in the State Register. The determination is not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.",
	"repealed": false
}