{
	"id": "326A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.02",
	"title": "326A.02 STATE BOARD OF ACCOUNTANCY.",
	"text": "A Board of Accountancy is created to carry out the purposes and enforce the provisions of this chapter. It consists of nine citizens of this state appointed by the governor. Two must be public members as defined by section 214.02, and seven must be certified public accountants under the provisions of this chapter. Effective January 1, 2003, no fewer than five of the certified public accountants must be owners or employees of a CPA firm that holds a current permit and provides professional services at the time of appointment and reappointment. No fewer than two board members, who may be any of the seven certified public accountants, at the time of appointment and reappointment must be owners or employees of a CPA firm that:\n(1) holds a current permit;\n(2) provides professional services; and\n(3) consists of ten or fewer certified public accountants.\nMembership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements are as provided in sections 214.07 to 214.09. The provision of staff, administrative services, and office space; the review and processing of complaints; the setting of board fees; and other provisions relating to board operations shall be as provided in this chapter and chapter 214.\nAny member of the board whose certificate under section 326A.04 is revoked or suspended automatically ceases to be a member of the board.\nThe board shall elect one of its members as chair, another as vice-chair, and another as secretary and treasurer. The officers shall hold their respective offices for a term of one year and until their successors are elected. The affirmative vote of a majority of the qualified members of the board, or a majority of a quorum of the board at any meeting duly called, is considered the action of the board. The board shall meet at such times and places as may be fixed by the board. Meetings of the board are subject to chapter 13D. A majority of the board members then in office constitutes a quorum at any meeting duly called. The board shall retain or arrange for the retention of all applications and all documents under oath that are filed with the board and also records of its proceedings, and it shall maintain a registry of the names and addresses of all licensees and registrants under this chapter. In any proceeding in court, civil or criminal, arising out of or founded upon any provision of this chapter, copies of records of the proceeding certified as true copies by the board chair or executive director shall be admissible in evidence as tending to prove the contents of the records.\nThe powers and duties of the board shall be as provided in this chapter or as otherwise provided by law. The board, or the complaint committee if authorized by the board, may issue subpoenas to compel the attendance of witnesses and the production of documents, to administer oaths, to take testimony, to cooperate with the appropriate state, federal, foreign regulatory, or law enforcement authorities in investigation and enforcement concerning violations of this chapter and comparable acts of other states, and to receive evidence concerning all matters within the scope of this chapter. In case of disobedience of a subpoena, the board may invoke the aid of any court in requiring the attendance and testimony of witnesses and the production of documentary evidence. The board, its members, and its agents are immune from personal liability for actions taken in good faith in the discharge of the board's responsibilities, and the state shall hold the board, its members, and its agents harmless from all costs, damages, and attorneys fees arising from claims and suits against them with respect to matters to which such immunity applies. The board shall enforce the laws relating to the practice of public accounting, as prescribed in this chapter and rules adopted by the board.\nThe board may adopt rules governing its administration and enforcement of this chapter and the conduct of licensees and persons registered under section 326A.06, paragraph (b), including:\n(1) rules governing the board's meetings and the conduct of its business;\n(2) rules of procedure governing the conduct of investigations and hearings and discipline by the board;\n(3) rules specifying the educational and experience qualifications required for the issuance of certificates and the continuing professional education required for renewal of certificates;\n(4) rules of professional conduct directed to controlling the quality and probity of services by licensees, and dealing among other things with independence, integrity, and objectivity; competence and technical standards; and responsibilities to the public and to clients;\n(5) rules governing the professional standards applicable to licensees including adoption of the standards specified in section 326A.01, subdivision 2, and as developed for general application by recognized national accountancy organizations such as the American Institute of Certified Public Accountants or the Public Company Accounting Oversight Board;\n(6) rules that incorporate by reference the standards for attesting listed in section 326A.01, subdivision 2, that are consistent with the standards of general applicability recognized by national accountancy organizations, including the American Institute of Certified Public Accountants and the Public Company Accounting Oversight Board;\n(7) rules governing the manner and circumstances of use of the titles \"certified public accountant,\" \"CPA,\" \"registered accounting practitioner,\" and \"RAP\";\n(8) rules regarding peer review that may be required to be performed under provisions of this chapter;\n(9) rules on substantial equivalence to implement section 326A.14;\n(10) rules regarding the conduct of the certified public accountant examination;\n(11) rules regarding the issuance and renewals of certificates, permits, and registrations;\n(12) rules regarding transition provisions to implement this chapter;\n(13) rules specifying the educational and experience qualifications for registration, rules of professional conduct, rules regarding peer review, rules governing standards for providing services, and rules regarding the conduct and content of examination for those persons registered under section 326A.06, paragraph (b);\n(14) rules regarding fees for examinations, certificate issuance and renewal, firm permits, registrations under section 326A.06, paragraph (b), notifications made under section 326A.14, and late processing fees; and\n(15) upon any change to this chapter, if the board determines a change in Minnesota Rules is required, the board may initiate the expedited process under section 14.389 up to one year after the effective date of the change to this chapter.\nThe board shall establish a complaint committee to investigate, mediate, or initiate administrative or legal proceedings on behalf of the board with respect to complaints filed with or information received by the board alleging or indicating violations of this chapter or rules adopted by the board. The complaint committee shall consist of three members of the board.\nThe expenses of administering this chapter must be paid from appropriations made to the board.\nThe board shall appoint an executive director to assist the board in performing its duties.",
	"repealed": false
}