{
	"id": "80F.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/80F.03",
	"title": "80F.03 SURVIVORSHIP.",
	"text": "For purposes of this section, \"designated family member\" means the spouse, child, grandchild, parent, brother, or sister of the operator.\nAny designated family member of a deceased or incapacitated dealer may succeed to the marketing agreement if (1) the designated family member gives the supplier written notice of the intention to succeed to the agreement within 60 days of the dealer's death; (2) the designated family member agrees to be bound by the terms and conditions of a written existing marketing agreement; and (3) the designated family member is a person who meets the supplier's reasonable standards. At the request of the supplier, the designated family member must provide any personal and financial data that is reasonably necessary to determine whether the designated family member meets the reasonable standards of the supplier.\nReasonable standards used by a supplier may include, but are not limited to, consideration of the designated family member's ability and potential to operate the facility at the same level as the former operator, and of the designated family member's gasoline marketing experience, education, creditworthiness, and management experience.\nIf the marketing agreement under which the deceased or incapacitated dealer operated the facility was oral, the supplier shall offer a reasonable written agreement to the designated family member within 30 days of the designated family member's notification to the supplier of intent to succeed to the agreement. If the designated family member does not, within 30 days after receiving the written agreement from the supplier, either accept the terms of the offered agreement or object to the terms as unreasonable, the designated family member shall be deemed to have waived the right of succession.\nIf a supplier believes in good faith that the designated family member does not meet the supplier's reasonable standards, the supplier shall notify the designated family member of the refusal to allow succession and intent to terminate the marketing agreement. This notice must be provided no more than 90 days after the supplier receives all personal and financial data requested from the designated family member. The agreement must not be terminated less than 90 days after notice is served on the designated family member.\nIn determining whether a designated family member failed to meet a supplier's reasonable standards, the supplier has the burden of proving that the standards used are reasonable, and the designated family member has the burden of proving that those standards that are reasonable have been met.\nAs a condition of succession, the supplier may require that reasonable arrangements be entered into for the payment of rent or product payment during the interim period from the date of the dealer's death or incapacity until succession is completed or the right to succession is terminated.",
	"repealed": false
}