{
	"id": "326B.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.94",
	"title": "326B.94 BOATS; MASTERS.",
	"text": "\"Boat\" means any vessel navigating inland waters of the state that is propelled by machinery or sails and is carrying more than six passengers for hire.\nThe department shall designate the number of passengers that each boat may safely carry, and no such boat shall carry a greater number than is allowed by the inspector's certificate.\nThe commissioner shall issue an annual permit to a boat for the purpose of carrying passengers for hire on the inland waters of the state provided the boat satisfies the inspection requirements of this section. A boat subject to inspection under this chapter shall be registered with the department and shall be inspected before a permit may be issued. No person shall operate a boat or cause a boat to be operated for the purpose of carrying passengers for hire on the inland waters of the state without a valid annual permit issued under this section. Boats operating with a current inspection certificate issued by the United States Coast Guard are exempt from the inspection requirements of this section.\nEvery individual who operates a boat must hold a current master's license issued by the commissioner, unless the individual holds a valid, current charter boat captain's license issued by the United States Coast Guard. The commissioner shall develop and administer an examination for all masters of boats carrying passengers for hire on the inland waters of the state. If found qualified and competent to perform their duties as a master of a boat carrying passengers for hire, they shall be issued a license authorizing them to act as such on the inland waters of the state. All initial master's licenses shall be for two years. The commissioner shall in a manner determined by the commissioner, without the need for any rulemaking under chapter 14, phase in the renewal of master's licenses from one year to two years. By June 30, 2011, all renewed master's licenses shall be two-year licenses. Fees for the original issue and renewal of the license authorized under this section shall be pursuant to section 326B.092.\n(a) The department shall prescribe rules for the inspection of the hulls, machinery, boilers, steam connections, firefighting apparatus, lifesaving appliances, and lifesaving equipment of all power boats navigating the inland waters of the state, which shall conform to the requirements and specifications of the United States Coast Guard in similar cases as provided in Code of Federal Regulations, titles 33 and 46, and COMDTINST M16672.2D, as applicable to inland waters; these rules shall have the force of law.\n(b) For purposes of this subdivision, the term \"COMDTINST M16672.2D\" means United States Department of Homeland Security, United States Coast Guard, Navigation Rules: International-Inland, as forwarded by Commandant Instruction M16672.2D, dated March 25, 1999, with any corrections or revisions.\nNo master shall be under the influence of illegal drugs or alcohol when on duty.",
	"repealed": false
}