{
	"id": "60A.985",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.985",
	"title": "60A.985 DEFINITIONS.",
	"text": "As used in sections 60A.985 to 60A.9857, the following terms have the meanings given.\n\"Authorized individual\" means an individual known to and screened by the licensee and determined to be necessary and appropriate to have access to the nonpublic information held by the licensee and its information systems.\n\"Consumer\" means an individual, including but not limited to an applicant, policyholder, insured, beneficiary, claimant, and certificate holder who is a resident of this state and whose nonpublic information is in a licensee's possession, custody, or control.\n\"Cybersecurity event\" means an event resulting in unauthorized access to, or disruption or misuse of, an information system or nonpublic information stored on an information system.\nCybersecurity event does not include the unauthorized acquisition of encrypted nonpublic information if the encryption, process, or key is not also acquired, released, or used without authorization.\nCybersecurity event does not include an event with regard to which the licensee has determined that the nonpublic information accessed by an unauthorized person has not been used or released and has been returned or destroyed.\n\"Encrypted\" means the transformation of data into a form which results in a low probability of assigning meaning without the use of a protective process or key.\n\"Information security program\" means the administrative, technical, and physical safeguards that a licensee uses to access, collect, distribute, process, protect, store, use, transmit, dispose of, or otherwise handle nonpublic information.\n\"Information system\" means a discrete set of electronic information resources organized for the collection, processing, maintenance, use, sharing, dissemination, or disposition of nonpublic electronic information, as well as any specialized system such as industrial or process controls systems, telephone switching and private branch exchange systems, and environmental control systems.\n\"Licensee\" means any person licensed, authorized to operate, or registered, or required to be licensed, authorized, or registered by the Department of Commerce or the Department of Health under chapters 59A to 62M, 62Q to 62V, and 64B to 79A.\n\"Multifactor authentication\" means authentication through verification of at least two of the following types of authentication factors:\n(1) knowledge factors, such as a password;\n(2) possession factors, such as a token or text message on a mobile phone; or\n(3) inherence factors, such as a biometric characteristic.\n\"Nonpublic information\" means electronic information that is not publicly available information and is:\n(1) any information concerning a consumer which because of name, number, personal mark, or other identifier can be used to identify the consumer, in combination with any one or more of the following data elements:\n(i) Social Security number;\n(ii) driver's license number or nondriver identification card number;\n(iii) financial account number, credit card number, or debit card number;\n(iv) any security code, access code, or password that would permit access to a consumer's financial account; or\n(v) biometric records; or\n(2) any information or data, except age or gender, in any form or medium created by or derived from a health care provider or a consumer that can be used to identify a particular consumer and that relates to:\n(i) the past, present, or future physical, mental, or behavioral health or condition of any consumer or a member of the consumer's family;\n(ii) the provision of health care to any consumer; or\n(iii) payment for the provision of health care to any consumer.\n\"Person\" means any individual or any nongovernmental entity, including but not limited to any nongovernmental partnership, corporation, branch, agency, or association.\n\"Publicly available information\" means any information that a licensee has a reasonable basis to believe is lawfully made available to the general public from: federal, state, or local government records; widely distributed media; or disclosures to the general public that are required to be made by federal, state, or local law.\nFor the purposes of this definition, a licensee has a reasonable basis to believe that information is lawfully made available to the general public if the licensee has taken steps to determine:\n(1) that the information is of the type that is available to the general public; and\n(2) whether a consumer can direct that the information not be made available to the general public and, if so, that such consumer has not done so.\n\"Risk assessment\" means the risk assessment that each licensee is required to conduct under section 60A.9851, subdivision 3.\n\"State\" means the state of Minnesota.\n\"Third-party service provider\" means a person, not otherwise defined as a licensee, that contracts with a licensee to maintain, process, or store nonpublic information, or is otherwise permitted access to nonpublic information through its provision of services to the licensee.",
	"repealed": false
}