{
	"id": "148E.265",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.265",
	"title": "148E.265 ADVERSARIAL BUT NONDISCIPLINARY ACTIONS.",
	"text": "(a) A license to practice social work is automatically suspended if:\n(1) a guardian of a licensee is appointed by order of a court according to sections 524.5-101 and 524.5-102; or\n(2) the licensee is committed by order of a court according to chapter 253B.\n(b) A license remains suspended until:\n(1) the licensee is restored to capacity by a court; and\n(2) upon petition by the licensee and after a hearing or an agreement with the licensee, the board terminates the suspension.\n(c) If the board terminates the suspension, it may do so with or without conditions or restrictions, including, but not limited to, participation in the health professional services program.\n(a) The board or a designated board member may issue a cease and desist order to stop a person from engaging in unauthorized practice or from violating or threatening to violate a statute or rule enforced by the board or an order, stipulation, or agreement agreed to or issued by the board.\n(b) The cease and desist order must state the reason for its issuance and give notice of the person's right to request a hearing under sections 14.57 to 14.62. If the person fails to request a hearing in writing postmarked within 15 calendar days after service of the cease and desist order, the order is the final order of the board and is not reviewable by a court or agency.\n(c) If the board receives a written request for a hearing postmarked within 15 calendar days after service of the cease and desist order, the board must schedule a hearing within 30 calendar days of receiving the request.\n(d) The administrative law judge must issue a report within 30 calendar days after the contested case hearing is concluded.\n(e) Within 30 calendar days after the board receives the administrative law judge's report, the board must issue a final order modifying, vacating, or making permanent the cease and desist order. The final order remains in effect until modified or vacated by the board.\n(f) If a person does not comply with a cease and desist order, the board may institute a proceeding in any district court to obtain injunctive relief or other appropriate relief, including but not limited to, a civil penalty payable to the board of up to $10,000 for each violation.\n(g) A cease and desist order issued according to this subdivision does not relieve a person from criminal prosecution by a competent authority or from disciplinary action by the board.\n(a) In addition to any other remedy provided by law, the board may bring an action in district court for injunctive relief to restrain any unauthorized practice or violation or threatened violation of any statute or rule, stipulation, or agreement agreed to or enforced by the board or an order issued by the board.\n(b) A temporary restraining order may be granted in the proceeding if continued activity by a person would create an imminent risk of harm to others.\n(c) Injunctive relief granted according to this subdivision does not relieve a person from criminal prosecution by a competent authority or from disciplinary action by the board.\n(d) In bringing an action for injunctive relief, the board need not show irreparable harm.",
	"repealed": false
}