{
	"id": "237.414",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.414",
	"title": "237.414 EXPANDED CALLING AREAS; TRANSPORT FACILITIES; TERMINATIONS.",
	"text": "(a) In addition to any existing authority applicable to telephone companies, a telephone company may expand the area to which it can provide calling to its customers upon filing with the commission any agreements between the telephone company and other telephone companies and telecommunications carriers entered into under subdivision 3. Calling to these expanded areas must be optional to customers and must be in addition to the customers' existing local service and any extended area service. Subject to sections 237.06 and 237.09, the telephone company may determine the quantity of expanded calling to provide, the prices for that calling, and whether to offer calling alone or in combination with one or more other telephone or unregulated services.\n(b) Prices for expanded calling service or for bundles of services that include expanded calling must exceed the variable cost of the expanded calling service or bundles of services, determined on an aggregate basis. A telephone company is not required to file cost information before implementing its prices and is not required to file cost information except on request of the department, Office of the Attorney General, or commission. Customers must be notified of local service options and prices, including options that do not include expanded calling, as required under section 237.66. The telephone company shall clearly identify the distinction between the expanded calling area and the basic local calling area to customers. The telephone company is not required to offer unlimited flat-rate calling to these expanded calling areas. The telephone company shall file tariffs setting forth the expanded calling area along with the applicable prices and quantities of calling.\n(c) A rate increase or a substantial change in terms and conditions of the expanded calling service may be effective 30 days after filing with the commission and 30 days after providing written notice to affected customers. Rate decreases may be effective immediately upon filing. Minor changes to terms and conditions may be effective immediately upon filing and upon notice to customers. This section does not apply to extended area service or to calling areas previously or hereafter established by order of the commission. This section does not limit the existing rights and obligations of telephone companies and telecommunications carriers to provide local calling, including the obligation to offer unlimited flat rate calling in the basic local calling area or expanded calling area.\nA telephone company may construct, purchase, lease, or rent transport and switching facilities between its existing local area and the expanded calling area that are needed to provide the expanded calling. If the telephone company is unable to reach agreement with other telephone companies or telecommunications carriers, the company or carrier may petition the commission under section 237.12 to resolve issues regarding prices, terms, and conditions for use of any transport facilities that are subject to the jurisdiction of the commission.\n(a) A telephone company providing an expanded calling area under this section may enter into an agreement to terminate calls with telephone companies and telecommunications carriers providing service within the expanded calling area. Compensation to the telephone company or telecommunications carrier to terminate expanded calling into such areas must be the intrastate access charges of the telephone company or telecommunications carrier terminating the call or other rates agreed upon by the companies.\n(b) Two telephone companies that provide expanded calling between their respective areas may also enter into \"bill and keep\" arrangements for exchange of the expanded calling area traffic.\n(c) The telephone company shall file with the commission any agreements for termination of calling by telephone companies and telecommunications carriers providing service within the expanded calling area. The prices, terms, and conditions contained in the agreements required to be filed shall be publicly disclosed in their entirety, and other terminating carriers may elect to adopt those prices, terms, and conditions in whole or in part for technically similar services provided in the exchanges included in the agreement.\nExcept for calling areas that result from a prior or subsequent order of the commission, a telephone company may amend or terminate the expanded calling area service upon 30 days' written notice to customers, the commission, and other telephone companies and telecommunications carriers providing local service in the expanded area. The notice to customers of an amendment to the expanded calling area or termination of an expanded calling area must be sent separately from other mailings and clearly explain how the expanded calling area is being changed. The notice to customers of an amendment must also clearly identify that calls to areas outside of the expanded calling area will be long-distance calls billed at the applicable rate of the customer's long-distance carrier. The notice to customers of a termination must clearly identify that calls to the terminated expanded calling area will become long-distance calls billed at the applicable rate of the customer's long-distance carrier.",
	"repealed": false
}