{
	"id": "16B.282",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.282",
	"title": "16B.282 SURVEYS, APPRAISALS, AND SALE.",
	"text": "(a) Before offering any surplus state-owned lands for sale, the commissioner of administration may survey the lands and, if the value of the lands is estimated to be $50,000 or less, may have the lands appraised. The commissioner shall have the lands appraised if the estimated value is in excess of $50,000.\n(b) Appraisals must be made by an appraiser that holds a state appraiser license issued by the Department of Commerce. The appraisal must be in conformity with the Uniform Standards of Professional Appraisal Practice of the Appraisal Foundation.\n(c) Before offering surplus state-owned lands for public sale, the lands shall first be offered to the city, county, town, school district, or other public body corporate or politic in which the lands are situated for public purposes and the lands may be sold for public purposes for not less than the appraised value of the lands. To determine whether a public body desires to purchase the surplus land, the commissioner shall give a written notice to the governing body of each political subdivision whose jurisdictional boundaries include or are adjacent to the surplus land. If a public body desires to purchase the surplus land, it shall submit a written offer to the commissioner no later than two weeks after receipt of notice setting forth in detail its reasons for desiring to acquire and its intended use of the land. In the event that more than one public body tenders an offer, the commissioner shall determine which party shall receive the property and shall submit written findings regarding the decision. If lands are offered for sale for public purposes and if a public body notifies the commissioner of its desire to acquire the lands, the public body may have up to two years from the date of the accepted offer to commence payment for the lands in the manner provided by law.\n(a) After complying with subdivision 1, before any public sale of surplus state-owned land is made, and at least 30 days before the sale, the commissioner of administration shall publish a notice of the sale in a newspaper of general distribution in the city or county in which the real property to be sold is situated. The notice shall specify the time and place at which the sale will commence, a general description of the lots or tracts to be offered, and a general statement of the terms of sale.\n(b) Surplus state-owned land shall be sold for no less than the estimated or appraised value. The minimum bid may include expenses incurred by the commissioner in rendering the property saleable, including survey, appraisal, legal, advertising, and other expenses.\n(c) Parcels remaining unsold after the offering may be sold to anyone agreeing to pay the appraised value. The sale shall continue until all parcels are sold or until the commissioner orders a reappraisal or withdraws the remaining parcels from sale.",
	"repealed": false
}