{
	"id": "49.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.36",
	"title": "49.36 APPROVAL BY COMMISSIONER.",
	"text": "This consolidation or merger agreement and certified copy of the proceedings of the meetings of the respective boards of directors, at which the making of the agreement was authorized, must be submitted to the commissioner of commerce for approval with a fee of $2,000 payable to the commissioner of commerce. The agreement shall not be effective until so approved by the commissioner. The commissioner shall take action after the documents are submitted, and is entitled to further information from any party to the transaction as may be requested by the commissioner, or as may be obtained upon a hearing directed by the commissioner.\nThe procedures contained in section 47.54 must also be adhered to when a merger, consolidation, or purchase of assets and assumption of liabilities is effected pursuant to section 49.34, subdivision 2. In the event the commissioner has determined that it is necessary and in the public interest to act immediately on a merger, consolidation or purchase of assets and assumption of liabilities to prevent the probable failure of a bank, the commissioner may waive the requirements of section 47.54.\nIn all applications filed under this section the commissioner in determining whether to approve or disapprove the application shall consider (a) the effects of the proposed merger transaction on competition, (b) the convenience and needs of the community to be served, and (c) the financial and managerial resources and future prospects of the existing and successor banks.\nThe successor bank shall give reasonable notice of the acquisition to each of the depositors and creditors of an acquired bank or savings association at a time and in a form determined in the discretion of the commissioner. This notice may be coordinated to include federal regulator concerns for impact on deposit insurance of accounts and information designed to alert depositors and creditors of any changes in procedures or practices. If detached facilities are to be closed as a result of transactions authorized by this section, adequate notice shall be provided by the bank prior to closing, unless the commissioner has acted to prevent the probable failure of the bank or savings association, and then as soon as practicable after the acquisition date.",
	"repealed": false
}