{
	"id": "237.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.045",
	"title": "237.045 RAILROAD RIGHTS-OF-WAY; CROSSING OR PARALLELING BY UTILITIES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Crossing\" means a utility facility constructed over, under, or across a railroad right-of-way. The term does not include longitudinal occupancy of railroad right-of-way.\n(c) \"Facility\" or \"utility facility\" means any item of personal property placed over, across, or underground for use in connection with the storage or conveyance of:\n(1) water;\n(2) sewage;\n(3) electronic, telephone, or telegraphic communications;\n(4) fiber optics;\n(5) cable television;\n(6) electric energy;\n(7) oil;\n(8) natural gas; or\n(9) hazardous liquids.\nFacility includes, but is not limited to, pipes, sewers, conduits, cables, valves, lines, wires, manholes, and attachments.\n(d) \"Parallel\" or \"paralleling\" means a utility facility that runs adjacent to and alongside the lines of a railroad for no more than one mile, or another distance agreed to by the parties, after which the utility facility crosses the railroad lines, terminates, or exits the railroad right-of-way.\n(e) \"Railroad\" means any association, corporation, or other entity engaged in operating a common carrier by rail, or its agents or assigns, including any entity responsible for the management of crossings or collection of crossing fees.\n(f) \"Utility\" means cooperative electric association, electric utility, public utility, transmission company, gas utility, municipal utility, municipal power agency, municipality, joint action agency, pipeline company, rural water system, or telephone, telegraph, telecommunications, cable, or fiber optic carrier. Utility includes contractors or agents.\n(a) This section applies to:\n(1) any crossing in existence before July 1, 2016, if an agreement concerning the crossing has expired or has been terminated. In such instance, if the collective amount that equals or exceeds the standard crossing fee under subdivision 6 has been paid to the railroad during the existence of the crossing, no additional fee is required; and\n(2) any crossing commenced on or after July 1, 2016.\n(b) This section does not apply to a crossing or paralleling of a large energy facility, as defined in section 216B.2421, subdivision 2, regardless of length.\n(a) Any utility that intends to place a facility across or upon a railroad right-of-way shall request prior permission from the railroad.\n(b) The request must be in the form of a completed crossing application, including an engineering design showing the location of the proposed crossing and the railroad's property, tracks, and wires that the utility will cross. The engineering design must conform with guidelines published in the most recent edition of the (1) National Electric Safety Code, or (2) Manual for Railway Engineering of the American Railway Engineering and Maintenance-of-Way Association. The utility must submit the crossing application on a form provided or approved by the railroad, if available.\n(c) The application must be accompanied by the standard crossing fee specified in subdivision 6 and evidence of insurance as required in subdivision 7. The utility must send the application to the railroad by certified mail, with return receipt requested.\n(d) Within 15 calendar days of receipt of an application that is not complete, the railroad must inform the applicant regarding any additional necessary information and submittals.\n(a) A railroad may require an electric utility to conduct an inductive interference study if:\n(1) the facility is for an electric energy transmission line of at least 125 kilovolts; and\n(2) in accordance with guidelines in the National Electric Safety Code and the Manual for Railway Engineering of the American Railway Engineering and Maintenance-of-Way Association, the railroad reasonably determines that the proposed facility poses a material possibility of creating induction issues or interference with railroad property.\n(b) The utility must arrange and pay for the study, perform and pay for any costs of modifications to the proposed facility, and pay for any costs of modifications to railroad property that are necessary to ensure safe and reliable railroad operations. The study must be performed by a qualified engineer approved by the railroad.\n(c) A utility facility for which an inductive interference study has been performed under this subdivision may not be energized until at least 30 calendar days after the railroad receives notice from the utility that the facility is ready to be energized. Within 30 days of receiving notice that the facility is ready to be energized, the railroad shall conduct any appropriate tests to ensure that there will not be any interference with safe operation of the railroad following energization.\nBeginning 35 calendar days after the receipt by the railroad of a completed crossing application, crossing fee, and certificate of insurance, the utility may commence the construction of the crossing unless the railroad notifies the utility in writing that the proposed crossing or paralleling is a serious threat to the safe operations of the railroad or to the current use of the railroad right-of-way.\n(a) Unless otherwise agreed by the parties or determined under section 237.04, a utility that crosses a railroad right-of-way, other than a crossing within a public right-of-way, must pay the railroad a onetime standard crossing fee of $1,250, adjusted as provided in paragraph (e), for each crossing. Except as otherwise provided in this subdivision, the standard crossing fee is paid in lieu of any license, permit, application, processing fee, or any other fee or charge to reimburse the railroad for direct expenses incurred by the railroad as a result of the crossing. No other fee or charge may be assessed to the utility by the railroad.\n(b) In addition to the standard crossing fee, the utility shall also reimburse the railroad for any reasonable and necessary flagging expense associated with a crossing, based on the railroad traffic at the crossing.\n(c) No crossing fee is required if the crossing is located within a public right-of-way.\n(d) The placement of a single conduit and its content is a single facility. No additional fees are payable based on the individual fibers, wires, lines, or other items contained within the conduit.\n(e) Annually each May 1, the standard crossing fee under paragraph (a) must be adjusted based on the percentage change in the annual average producer price index for the preceding year compared to the year prior to the preceding year. Each adjustment is effective for applications submitted on or after June 1. The producer price index is final demand, finished consumer energy goods, as prepared by the Bureau of Labor Statistics of the United States Department of Labor.\n(a) The certificate of insurance or coverage submitted by:\n(1) a municipal utility or municipality must include commercial general liability insurance or an equivalent form with a limit of at least $1,000,000 for each occurrence and an aggregate of at least $2,000,000;\n(2) a utility providing natural gas service must include commercial general liability insurance with a combined single limit of at least $5,000,000 for each occurrence and an aggregate limit of at least $10,000,000; or\n(3) a utility not specified in clauses (1) and (2) must include commercial general liability insurance with a combined single limit of at least $2,000,000 for each occurrence and an aggregate limit of at least $6,000,000.\n(b) The railroad may require protective liability insurance with a combined single limit of $2,000,000 for each occurrence and $6,000,000 aggregate. The coverage may be provided by a blanket railroad protective liability insurance policy if the coverage, including the coverage limits, applies separately to each individual crossing. The coverage is required only during the period of construction, repair, or replacement of the facility.\n(c) The insurance coverage under paragraphs (a) and (b) must not contain an exclusion or limitation related to railroads or to activities within 50 feet of railroad property.\n(d) The certificate of insurance must be from an insurer of the utility's choosing.\n(a) If a railroad objects to the proposed crossing or paralleling due to the proposal being a serious threat to the safe operations of the railroad or to the current use of the railroad right-of-way, the railroad must notify the utility of the objection and the specific basis for the objection. The railroad shall send the notice of objection to the utility by certified mail, with return receipt requested.\n(b) If the parties are unable to resolve the objection, either party may petition the Public Utilities Commission for assistance via mediation or arbitration of the disputed crossing application. The petition must be filed within 60 days of receipt of the objection. Before filing a petition, the parties shall make good faith efforts to resolve the objection.\n(c) If a petition is filed, the Public Utilities Commission must issue an order within 120 days of filing of the petition. The order may be appealed under chapter 14 and section 216B.27. The Public Utilities Commission must assess the costs associated with a petition equitably among the parties.\n(a) If a railroad imposes additional requirements on a utility for crossing its lines, other than the proposed crossing being a serious threat to the safe operations of the railroad or to the current use of the railroad right-of-way, the utility may object to one or more of the requirements. If it objects, the utility shall provide notice of the objection and the specific basis for the objection to the railroad by certified mail, with return receipt requested.\n(b) If the parties are unable to resolve the objection, either party may petition the Public Utilities Commission for resolution or modification of the additional requirements. The petition must be filed within 60 days of receipt of the objection. Before filing a petition, the parties shall make good faith efforts to resolve the objection.\n(c) If a petition is filed, the Public Utilities Commission shall determine, after notice and opportunity for hearing, whether special circumstances exist that necessitate additional requirements for the placement of the crossing. The Public Utilities Commission must issue an order within 120 days of filing of the petition. The order may be appealed under chapter 14 and section 216B.27. The Public Utilities Commission shall assess the costs associated with a petition equitably among the parties.\n(a) A railroad may require a utility to relocate a facility when the railroad determines that relocation is essential to accommodate railroad operations, and the relocation is not arbitrary or unreasonable. Before agreeing to the relocation, a utility may require a railroad to provide a statement and supporting documentation identifying the operational necessity for requesting the relocation. A utility must perform the relocation within a reasonable period of time following the agreement.\n(b) Relocation is at the expense of the small utility. A standard fee under subdivision 6 may not be imposed for relocation.\nNothing in this section prevents a railroad and a utility from continuing under an existing agreement, or from otherwise negotiating the terms and conditions applicable to a crossing or the resolution of any disputes relating to the crossing. A utility may elect to undertake a crossing or paralleling under this section or section 237.04. Nothing in this section impairs the authority of a utility to secure crossing rights by easement through exercise of the power of eminent domain.",
	"repealed": false
}