{
	"id": "624.7172",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7172",
	"title": "624.7172 EXTREME RISK PROTECTION ORDERS ISSUED AFTER HEARING.",
	"text": "(a) Upon receipt of the petition for an order after a hearing, the court must schedule and hold a hearing within 14 days from the date the petition was received.\n(b) The court shall advise the petitioner of the right to request an emergency extreme risk protection order under section 624.7174 separately from or simultaneously with the petition under this subdivision.\n(c) The petitioning agency shall be responsible for service of an extreme risk protection order issued by the court and shall further be the agency responsible for the execution of any legal process required for the seizure and storage of firearms subject to the order. Nothing in this provision limits the ability of the law enforcement agency of record from cooperating with other law enforcement entities. When a court issues an extreme risk protection order for a person who resides on Tribal territory, the chief law enforcement officer of the law enforcement agency responsible for serving the order must request the assistance and counsel of the appropriate Tribal police department prior to serving the respondent. When the petitioner is a family or household member of the respondent, the primary law enforcement agency serving the jurisdiction of residency of the respondent shall be responsible for the execution of any legal process required for the seizure and storage of firearms subject to the order.\n(d) Personal service of notice for the hearing may be made upon the respondent at any time up to 48 hours prior to the time set for the hearing, provided that the respondent at the hearing may request a continuance of up to 14 days if the respondent is served less than five days prior to the hearing, which continuance shall be granted unless there are compelling reasons not to do so. If the court grants the requested continuance, and an existing emergency order under section 624.7174 will expire due to the continuance, the court shall also issue a written order continuing the emergency order pending the new time set for the hearing.\n(e) If personal service cannot be made, the court may order service of the petition and any order issued under this section by alternate means. The application for alternate service must include the last known location of the respondent; the petitioner's most recent contacts with the respondent; the last known location of the respondent's employment; the names and locations of the respondent's parents, siblings, children, and other close relatives; the names and locations of other persons who are likely to know the respondent's whereabouts; and a description of efforts to locate those persons. The court shall consider the length of time the respondent's location has been unknown, the likelihood that the respondent's location will become known, the nature of the relief sought, and the nature of efforts made to locate the respondent. The court shall order service by first class mail, forwarding address requested, to any addresses where there is a reasonable possibility that mail or information will be forwarded or communicated to the respondent. The court may also order publication, within or without the state, but only if it might reasonably succeed in notifying the respondent of the proceeding. Service shall be deemed complete 14 days after mailing or 14 days after court-ordered publication.\n(f) When a petitioner who is not the sheriff of the county where the respondent resides, the sheriff's designee, or a family or household member files a petition, the petitioner must provide notice of the action to the sheriff of the county where the respondent resides. When a family or household member is the petitioner, the court must provide notice of the action to the sheriff of the county where the respondent resides.\n(a) At the hearing, the petitioner must prove by clear and convincing evidence that the respondent poses a significant danger to other persons or is at significant risk of suicide by possessing a firearm.\n(b) In determining whether to grant the order after a hearing, the court shall consider evidence of the following, whether or not the petitioner has provided evidence of the same:\n(1) a history of threats or acts of violence by the respondent directed toward another person;\n(2) the history of use, attempted use, or threatened use of physical force by the respondent against another person;\n(3) a violation of any court order, including but not limited to orders issued under sections 624.7171 to 624.7178 or chapter 260C or 518B;\n(4) a prior arrest for a violent felony offense;\n(5) a conviction or prior arrest for a violent misdemeanor offense, for a stalking offense under section 609.749, or for domestic assault under section 609.2242;\n(6) a conviction for an offense of cruelty to animals under chapter 343;\n(7) the unlawful and reckless use, display, or brandishing of a firearm by the respondent;\n(8) suicide attempts by the respondent or a serious mental illness; and\n(9) whether the respondent is named in an existing order in effect under sections 624.7171 to 624.7178 or chapter 260C or 518B, or party to a pending lawsuit, complaint, petition, or other action under sections 624.7171 to 624.7178 or chapter 518B.\n(c) In determining whether to grant the order after a hearing, the court may:\n(1) subpoena peace officers who have had contact with the respondent to provide written or sworn testimony regarding the officer's contacts with the respondent; and\n(2) consider any other evidence that bears on whether the respondent poses a danger to others or is at risk of suicide.\n(d) If the court finds there is clear and convincing evidence to issue an extreme risk protection order, the court shall issue the order prohibiting the person from possessing or purchasing a firearm for the duration of the order. The court shall inform the respondent that the respondent is prohibited from possessing or purchasing firearms and shall issue a transfer order under section 624.7175. The court shall also give notice to the county attorney's office, which may take action as it deems appropriate.\n(e) The court shall determine the length of time the order is in effect, but may not set the length of time for less than six months or more than one year, subject to renewal or extension under section 624.7173.\n(f) If there is no existing emergency order under section 624.7174 at the time an order is granted under this section, the court shall determine by clear and convincing evidence whether the respondent presents an immediate and present danger of bodily harm. If the court so determines, the transfer order shall include the provisions described in section 624.7175, paragraph (d).\n(g) If, after a hearing, the court does not issue an order of protection, the court shall vacate any emergency extreme risk protection order currently in effect.\n(h) A respondent may waive the respondent's right to contest the hearing and consent to the court's imposition of an extreme risk protection order. The court shall seal the petition filed under this section and section 624.7174 if a respondent who consents to imposition of an extreme risk protection order requests that the petition be sealed, unless the court finds that there is clear and convincing evidence that the interests of the public and public safety outweigh the disadvantages to the respondent of not sealing the petition. All extreme risk protection orders based on the respondent being a danger to others shall remain public. Extreme risk protection orders issued for respondents who are solely at risk of suicide shall not be public.",
	"repealed": false
}