{
	"id": "473.147",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.147",
	"title": "473.147 REGIONAL RECREATION OPEN SPACE SYSTEM POLICY PLAN.",
	"text": "The Metropolitan Council after consultation with the Parks and Open Space Commission, municipalities, park districts and counties in the metropolitan area, and after appropriate public hearings, shall prepare and adopt a long-range system policy plan for regional recreation open space as part of the council's Metropolitan Development Guide. The plan shall substantially conform to all policy statements, purposes, goals, standards, and maps in development guide sections and comprehensive plans as developed and adopted by the council pursuant to the chapters of the Minnesota Statutes directly relating to the council. The policy plan shall identify generally the areas which should be acquired by a public agency to provide a system of regional recreation open space comprising park district, county and municipal facilities which, together with state facilities, reasonably will meet the outdoor recreation needs of the people of the metropolitan area and shall establish priorities for acquisition and development. The policy plan shall estimate the cost of the recommended acquisitions and development, including an analysis of what portion of the funding is proposed to come from the state, Metropolitan Council levies, and cities, counties, and towns in the metropolitan area, respectively. In preparing or amending the policy plan the council shall consult with and make maximum use of the expertise of the commission. The policy plan shall include a five-year capital improvement program, which shall be revised periodically, and shall establish criteria and priorities for the allocation of funds for such acquisition and development. The legislature in each bonding measure shall designate an anticipated level of funding for this acquisition and development for each of the two succeeding bienniums.\nBefore adopting the policy plan, the council shall submit the proposed plan to the parks and open space commission for its review, and the commission shall report its comments to the council within 60 days. The council shall hold a public hearing on the proposed policy plan at such time and place in the metropolitan area as it shall determine. Not less than 15 days before the hearing, the council shall publish notice thereof in a newspaper or newspapers having general circulation in the metropolitan area, stating the date, time and place of hearing, and the place where the proposed policy plan and commission comments may be examined by any interested person. At any hearing interested persons shall be permitted to present their views on the policy plan, and the hearing may be continued from time to time. After receipt of the commission's report and hearing, the council may revise the proposed plan giving appropriate consideration to all comments received, and thereafter shall adopt the plan by resolution. An amendment to the policy plan may be proposed by the council or by the parks and open space commission. At least every four years the council shall engage in a comprehensive review of the policy plan, development guide sections, comprehensive plans, capital improvement programs and other plans in substantial conformance with the requirements of subdivision 1 which have been adopted by the council.",
	"repealed": false
}