{
	"id": "160.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.81",
	"title": "160.81 HIGHWAYS IN SCENIC AREAS.",
	"text": "The commissioner of transportation, in consultation with the commissioner of natural resources, shall establish standards for trunk highway segments located in areas of unusual scenic interest. The standards shall:\n(1) establish and ensure that the safety of the traveling public is maintained or enhanced;\n(2) define \"areas of unusual scenic interest,\" which must include major recreational areas, historic areas, and major publicly and privately owned tourist attractions;\n(3) prescribe standards for right-of-way, shoulders, and parking areas for trunk highway segments in such areas; and\n(4) prescribe standards for scenic overlooks, parking piers and other parking areas, tourist information facilities, public water access points and other facilities intended to expand the recreational use of trunk highway segments in such areas.\nThe commissioner of transportation, in consultation with the commissioner of natural resources, shall prepare a plan for the recreational uses of trunk highway right-of-way and adjacent public land in areas of unusual scenic interest. The plan must ensure that the safety of the traveling public is maintained or enhanced. The plan must provide for the enhancement of such recreational uses by the construction of new recreational facilities or the improvement or rehabilitation of existing recreational facilities, as enumerated in subdivision 1, clause (4). The plan must provide for joint development of these facilities by the Departments of Transportation and Natural Resources, where feasible, and must contain provisions permitting local units of government and regional development commissions to participate in the planning and development of recreational facilities.\nThe commissioner of transportation may, in areas of unusual scenic interest:\n(1) construct, improve, and maintain recreational facilities, including parking areas, scenic overlooks, and tourist information facilities, on trunk highway right-of-way and adjacent areas; and\n(2) construct, improve, and maintain access ramps and turnoffs to connect trunk highways with recreational land owned by the Department of Natural Resources.\nMS 1986 [Repealed, 1987 c 321 s 8]",
	"repealed": false
}