{
	"id": "153.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/153.16",
	"title": "153.16 LICENSURE.",
	"text": "The board shall issue a license to practice podiatric medicine to a person who meets the following requirements:\n(a) The applicant for a license shall file a written notarized application on forms provided by the board, showing to the board's satisfaction that the applicant is of good moral character and satisfies the requirements of this section.\n(b) The applicant shall present evidence satisfactory to the board of being a graduate of a podiatric medical school approved by the board based upon its faculty, curriculum, facilities, accreditation by a recognized national accrediting organization approved by the board, and other relevant factors.\n(c) The applicant must have received a passing score on each part of the national board examinations, parts one and two, prepared and graded by the National Board of Podiatric Medical Examiners. The passing score for each part of the national board examinations, parts one and two, is as defined by the National Board of Podiatric Medical Examiners.\n(d) Applicants graduating after 1990 from a podiatric medical school shall present evidence of successful completion of a residency program approved by a national accrediting podiatric medicine organization.\n(e) The applicant shall appear in person before the board or its designated representative to show that the applicant satisfies the requirements of this section, including knowledge of laws, rules, and ethics pertaining to the practice of podiatric medicine. The board may establish as internal operating procedures the procedures or requirements for the applicant's personal presentation. Upon completion of all other application requirements, a doctor of podiatric medicine applying for a temporary military license has six months in which to comply with this subdivision.\n(f) The applicant shall pay a fee established by the board by rule. The fee shall not be refunded.\n(g) The applicant must not have engaged in conduct warranting disciplinary action against a licensee. If the applicant does not satisfy the requirements of this paragraph, the board may refuse to issue a license unless it determines that the public will be protected through issuance of a license with conditions and limitations the board considers appropriate.\n(h) Upon payment of a fee as the board may require, an applicant who fails to pass an examination and is refused a license is entitled to reexamination within one year of the board's refusal to issue the license. No more than two reexaminations are allowed without a new application for a license.\nA podiatrist seeking licensure or reinstatement of a license after a lapse of continuous practice of podiatric medicine of greater than two years must reestablish competency by completing a reentry program approved by the board.\nThe board shall issue a license to practice podiatric medicine to any person currently or formerly licensed to practice podiatric medicine in another state who satisfies the requirements of this section:\n(a) The applicant shall satisfy the requirements established in subdivision 1.\n(b) The applicant shall present evidence satisfactory to the board indicating the current status of a license to practice podiatric medicine issued by the first state of licensure and all other states and countries in which the individual has held a license.\n(c) If the applicant has had a license revoked, engaged in conduct warranting disciplinary action against the applicant's license, or been subjected to disciplinary action, in another state, the board may refuse to issue a license unless it determines that the public will be protected through issuance of a license with conditions or limitations the board considers appropriate.\n(d) The applicant shall submit with the license application the following additional information for the five-year period preceding the date of filing of the application: (1) the name and address of the applicant's professional liability insurer in the other state; and (2) the number, date, and disposition of any podiatric medical malpractice settlement or award made to the plaintiff relating to the quality of podiatric medical treatment.\n(e) If the license is active, the applicant shall submit with the license application evidence of compliance with the continuing education requirements in the current state of licensure.\n(f) If the license is inactive, the applicant shall submit with the license application evidence of participation in the same number of hours of acceptable continuing education required for biennial renewal, as specified under Minnesota Rules, up to five years. If the license has been inactive for more than two years, the amount of acceptable continuing education required must be obtained during the two years immediately before application or the applicant must provide other evidence as the board may reasonably require.\nUpon payment of a fee and in accordance with the rules of the board, the board may issue a temporary permit to practice podiatric medicine to a podiatrist engaged in a clinical residency approved by a national accrediting organization. The temporary permit is renewed annually until the residency training requirements are completed or until the residency program is terminated or discontinued.\n(a) The board shall issue an expedited license to practice podiatric medicine to an applicant who meets the following requirements:\n(1) is an active duty military member;\n(2) is the spouse of an active duty military member; or\n(3) is a veteran who has left service in the two years preceding the date of license application, and has confirmation of an honorable or general discharge status.\n(b) A qualified applicant under this subdivision must provide evidence of:\n(1) a current, valid license in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(c) The board shall issue a license for up to six months to a doctor of podiatric medicine eligible for licensure under this subdivision. Doctors of podiatric medicine licensed in another state who have complied with all other requirements may receive a temporary license valid for up to six months. No extension is available.\n(d) A temporary license issued under this subdivision permits a qualified individual to perform podiatric medicine for a limited length of time as determined by the licensing board. During the temporary license period, the individual shall complete the full application procedure and be approved as required by applicable law.\n(e) The fee for the temporary military license is $250.\n(a) Every podiatrist licensed to practice in this state shall obtain 40 clock hours of continuing education in each two-year cycle of license renewal. All continuing education hours must be earned by verified attendance at or participation in a program or course sponsored by the Council on Podiatric Medical Education or approved by the board. In each two-year cycle, a maximum of eight hours of continuing education credits may be obtained through participation in online courses.\n(b) The number of continuing education hours required during the initial licensure period is that fraction of 40 hours, to the nearest whole hour, that is represented by the ratio of the number of days the license is held in the initial licensure period to 730 days.",
	"repealed": false
}