{
	"id": "254B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.01",
	"title": "254B.01 DEFINITIONS.",
	"text": "[Repealed, 2014 c 262 art 3 s 18]\nFor purposes of services provided under section 254B.09, subdivision 8, \"American Indian\" means a person who is a member of an Indian tribe, and the commissioner shall use the definitions of \"Indian\" and \"Indian tribe\" and \"Indian organization\" provided in Public Law 93-638. For purposes of services provided under section 254B.09, subdivision 6, \"American Indian\" means a resident of federally recognized tribal lands who is recognized as an Indian person by the federally recognized tribal governing body.\n\"American Society of Addiction Medicine criteria\" or \"ASAM criteria\" means the clinical guidelines for purposes of assessment, treatment, placement, and transfer or discharge of individuals with substance use disorders. The ASAM criteria are contained in the most current edition of the ASAM Criteria: Treatment Criteria for Addictive, Substance-Related, and Co-Occurring Conditions.\n\"Behavioral health fund\" means money allocated for payment of treatment services under chapter 254B.\n\"Client\" means an individual who has requested substance use disorder services or for whom substance use disorder services have been requested.\nUnless otherwise indicated, \"commissioner\" means the commissioner of human services.\n\"Co-payment\" means:\n(1) the amount an insured person is obligated to pay before the person's third-party payment source is obligated to make a payment; or\n(2) the amount an insured person is obligated to pay in addition to the amount the person's third-party payment source is obligated to pay.\n[Renumbered subd 12]\n[Renumbered subd 2d]\n(a) \"Culturally specific or culturally responsive program\" means a substance use disorder treatment service program or subprogram that is culturally responsive or culturally specific when the program attests that it:\n(1) improves service quality to and outcomes of a specific community that shares a common language, racial, ethnic, or social background by advancing health equity to help eliminate health disparities;\n(2) ensures effective, equitable, comprehensive, and respectful quality care services that are responsive to an individual within a specific community's values, beliefs and practices, health literacy, preferred language, and other communication needs; and\n(3) is compliant with the national standards for culturally and linguistically appropriate services or other equivalent standards, as determined by the commissioner.\n(b) A tribally licensed substance use disorder program that is designated as serving a culturally specific population by the applicable tribal government is deemed to satisfy this subdivision.\n(c) A program satisfies the requirements of this subdivision if it attests that the program:\n(1) is designed to address the unique needs of individuals who share a common language, racial, ethnic, or social background;\n(2) is governed with significant input from individuals of that specific background; and\n(3) employs individuals to provide treatment services, at least 50 percent of whom are members of the specific community being served.\n\"Disability responsive program\" means a program that:\n(1) is designed to serve individuals with disabilities, including individuals with traumatic brain injuries, developmental disabilities, cognitive disabilities, and physical disabilities; and\n(2) employs individuals to provide treatment services who have the necessary professional training, as approved by the commissioner, to serve individuals with the specific disabilities that the program is designed to serve.\n\"Department\" means the Department of Human Services.\n\"Drug and Alcohol Abuse Normative Evaluation System\" or \"DAANES\" means the reporting system used to collect all substance use disorder treatment data across all levels of care and providers.\n\"Individual recovery plan\" means a person-centered outline of supports that an eligible vendor of peer recovery support services under section 254B.05, subdivision 1, must develop to respond to an individual's peer recovery support services needs and goals.\n\"Local agency\" means the agency designated by a board of county commissioners, a local social services agency, or a human services board authorized under section 254B.03, subdivision 1, to determine financial eligibility for the behavioral health fund.\n\"Local money\" means county levies, federal social services money, or other money that may be spent at county discretion to provide substance use disorder services eligible for payment according to Laws 1986, chapter 394, sections 8 to 20.\n\"Minor child\" means an individual under the age of 18 years.\n\"Policyholder\" means a person who has a third-party payment policy under which a third-party payment source has an obligation to pay all or part of a client's treatment costs.\n[Repealed, 2011 c 86 s 23]\n\"Recovery community organization\" means an independent, nonprofit organization led and governed by representatives of local communities of recovery. A recovery community organization mobilizes resources within and outside of the recovery community to increase the prevalence and quality of long-term recovery from substance use disorder. Recovery community organizations provide peer-based recovery support activities such as training of recovery peers. Recovery community organizations provide mentorship and ongoing support to individuals dealing with a substance use disorder and connect them with the resources that can support each person's recovery. A recovery community organization also promotes a recovery-focused orientation in community education and outreach programming, and organize recovery-focused policy advocacy activities to foster healthy communities and reduce the stigma of substance use disorder.\n\"Recovery peer\" means a person who is qualified according to section 245I.04, subdivision 18, to provide peer recovery support services within the scope of practice provided under section 245I.04, subdivision 19.\n\"Responsible relative\" means a person who is a member of the client's household and is the client's spouse or the parent of a minor child who is a client.\n\"Skilled treatment services\" includes the treatment services described in section 245G.07, subdivisions 1, paragraph (a), clauses (1) to (4), and 2, clauses (1) to (6). Skilled treatment services must be provided by qualified professionals as identified in section 245G.07, subdivision 3.\nA sober home is a cooperative living residence, a room and board residence, an apartment, or any other living accommodation that:\n(1) provides temporary housing to persons with substance use disorders;\n(2) stipulates that residents must abstain from using alcohol or other illicit drugs or substances not prescribed by a physician;\n(3) charges a fee for living there;\n(4) does not provide counseling or treatment services to residents;\n(5) promotes sustained recovery from substance use disorders; and\n(6) follows the sober living guidelines published by the federal Substance Abuse and Mental Health Services Administration.\n\"Substance use disorder treatment services\" means a planned program of care for the treatment of substance misuse or substance use disorder to minimize or prevent further substance misuse by the person. Diagnostic, evaluation, prevention, referral, detoxification, and aftercare services that are not part of a program of care licensable as a residential or nonresidential substance use disorder treatment program are not substance use disorder services for purposes of this section. For pregnant and postpartum women, substance use disorder services include halfway house services, aftercare services, psychological services, and case management.\n\"Third-party payment source\" means a person, entity, or public or private agency other than medical assistance or general assistance medical care that has a probable obligation to pay all or part of the costs of a client's substance use disorder treatment.\n\"Vendor\" means a provider of substance use disorder treatment services that meets the criteria established in section 254B.05, and that has applied to participate as a provider in the medical assistance program according to Minnesota Rules, part 9505.0195.\n\"Executive board\" has the meaning given in section 246C.015.",
	"repealed": false
}