{
	"id": "60K.383",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.383",
	"title": "60K.383 TRAVEL INSURANCE.",
	"text": "(a) As used in this section, the terms in paragraphs (b) to (d) have the meanings given.\n(b) \"Travel insurance\" means insurance coverage for personal risks incident to planned travel, including, but not limited to:\n(1) interruption or cancellation of trip or event;\n(2) loss of baggage or personal effects;\n(3) damages to accommodations or rental vehicles; or\n(4) sickness, accident, disability, or death occurring during travel.\nTravel insurance does not include major medical plans, which provide comprehensive medical protection for travelers with trips lasting six months or longer, including those working overseas as an expatriate or military personnel being deployed.\n(c) \"Travel insurance producer\" means an insurer designee, such as a managing general underwriter, managing general agent, or licensed limited lines producer of travel insurance.\n(d) \"Travel retailer\" means a business entity that offers and disseminates travel insurance on behalf of and under the direction of a travel insurance producer.\nA travel retailer may offer and disseminate travel insurance on behalf of and under a travel insurance producer business entity license only if the travel insurance producer holds a business entity license, and:\n(1) the licensed business entity is clearly identified as the licensed producer on marketing materials and fulfillment packages distributed by travel retailers to customers; identification shall include the entity's name and contact information;\n(2) the licensed business entity keeps a register of each travel retailer that offers travel insurance on the licensed business entity's behalf. The register must include the name and contact information of the travel retailer and an officer or person who directs or controls the travel retailer's operations, and the travel retailer's federal Employer Identification Number. The licensed business entity shall also certify that the travel retailer registered complies with United States Code, title 18, section 1033. The licensed business entity shall submit the register within 30 days upon request by the commissioner;\n(3) the licensed business entity has designated one of its employees as a licensed individual producer, a \"designated responsible producer\" or \"DRP,\" responsible for the business entity's compliance with Minnesota insurance laws and rules;\n(4) the DRP, president, secretary, treasurer, and any other officer or person who directs or controls the licensed business entity's insurance operations comply with the fingerprinting requirements applicable to insurance producers in the resident state of the business entity;\n(5) the licensed business entity has paid all applicable insurance producer licensing fees as set forth in Minnesota state law; and\n(6) the licensed business entity requires each employee of the travel retailer whose duties include offering and disseminating travel insurance to receive a program of instruction or training, which may be subject to review by the commissioner.\nA travel retailer whose activities, and those of its employees, are limited to offering and disseminating travel insurance on behalf of and under the direction of a licensed business entity meeting the conditions stated in this section, is authorized to do so and receive related compensation, upon registration by the licensed business entity. For purposes of this section, \"offering and disseminating\" means providing general information, including a description of the coverage and price, as well as processing the application, collecting premiums, and performing other nonlicensable activities permitted by the state.\nAs the insurer designee, the travel insurance producer is responsible for the acts of the travel retailer.",
	"repealed": false
}