{
	"id": "169.826",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.826",
	"title": "169.826 GROSS WEIGHT SEASONAL INCREASES.",
	"text": "The limitations provided in sections 169.823 to 169.829 are increased by ten percent between the dates set by the commissioner for each zone established by the commissioner based on a freezing index model each winter.\nThe limitations provided in sections 169.823 to 169.829 are increased by ten percent from the beginning of harvest to November 30 each year for the movement of sugar beets, carrots, and potatoes from the field of harvest to the point of the first unloading. Transfer of the product from a farm vehicle or small farm trailer, within the meaning of chapter 168, to another vehicle is not considered to be the first unloading. A permit issued under section 169.86, subdivision 1, paragraph (a), is required. The commissioner shall not issue permits under this subdivision if to do so will result in a loss of federal highway funding to the state.\n[Repealed, 2009 c 64 s 57]\nThe duration of a ten percent increase in load limits is subject to limitation by order of the commissioner, subject to implementation of springtime load restrictions.\nWhen the ten percent increase is in effect, a permit is required for a motor vehicle, trailer, or semitrailer combination that has a gross weight in excess of 80,000 pounds, an axle group weight in excess of that prescribed in section 169.824, or a single axle weight in excess of 20,000 pounds and which travels on interstate routes.\nIn cases where gross weights in an amount less than that set forth in sections 169.823 to 169.829 are fixed, limited, or restricted on a highway or bridge by or under another section of this chapter, the lesser gross weight as fixed, limited, or restricted may not be exceeded and must control instead of the gross weights set forth in sections 169.823 to 169.829.\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2010 c 320 art 1 s 20]\nUpon request of the permit applicant, the expiration date for a permit issued under this section must be the same as the expiration date of the permitted vehicle's registration.",
	"repealed": false
}