{
	"id": "216C.436",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.436",
	"title": "216C.436 COMMERCIAL PACE LOAN PROGRAM.",
	"text": "An implementing entity may establish a commercial PACE loan program to finance energy, water, and resiliency improvements to enable owners of qualifying commercial real property to pay for eligible improvements to the qualifying real property with the net proceeds and interest earnings of revenue bonds authorized in this section. An implementing entity may limit the number of qualifying commercial real properties for which a property owner may receive program financing.\nUnless otherwise specified, this section applies only to programs established under subdivision 1 that are offered to an owner of qualifying commercial real property.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Agronomic assessment\" means a study by an independent third party that assesses the environmental impacts of proposed land and water improvements on farmland.\n(c) \"Farmland\" means land classified as 2a, 2b, or 2c for property tax purposes under section 273.13, subdivision 23.\n(d) \"Land and water improvement\" means:\n(1) an improvement to farmland that:\n(i) is permanent;\n(ii) results in improved agricultural profitability or resiliency;\n(iii) reduces the environmental impact of agricultural production; and\n(iv) if the improvement affects drainage, complies with the most recent versions of the applicable following conservation practice standards issued by the United States Department of Agriculture's Natural Resources Conservation Service: Drainage Water Management (Code 554), Saturated Buffer (Code 604), Denitrifying Bioreactor (Code 605), and Constructed Wetland (Code 656); or\n(2) water conservation and quality measures, which include permanently affixed equipment, appliances, or improvements that reduce a property's water consumption or that enable water to be managed more efficiently.\n(e) \"Resiliency\" means:\n(1) the ability of farmland to maintain and enhance profitability, soil health, and water quality;\n(2) the ability to mitigate greenhouse gas embodied emissions from an eligible real property; or\n(3) an increase in building resilience through flood mitigation, stormwater management, wildfire and wind resistance, energy storage use, or microgrid use.\nA commercial PACE loan program must:\n(1) impose requirements and conditions on financing arrangements to ensure timely repayment;\n(2) require an energy audit, renewable energy system feasibility study, resiliency improvement study, water improvement study, or agronomic or soil health assessment to be conducted on the qualifying commercial real property and reviewed by the implementing entity prior to approval of the financing;\n(3) require the inspection or verification of all eligible improvements or land and water improvements financed by the program;\n(4) not prohibit the financing of all eligible improvements or land and water improvements not otherwise prohibited by this section;\n(5) require that all eligible improvements or land and water improvements be made to a qualifying commercial real property prior to, or in conjunction with, an applicant's repayment of financing for eligible improvements or land and water improvements for the qualifying commercial real property;\n(6) have eligible improvements or land and water improvements financed by the program performed by a licensed contractor as required by chapter 326B or other law or ordinance;\n(7) require disclosures in the loan document to borrowers by the implementing entity of: (i) the risks involved in borrowing, including the risk of foreclosure if a tax delinquency results from a default; and (ii) all the terms and conditions of the commercial PACE loan and the installation of eligible improvements or land and water improvements, including the interest rate being charged on the loan;\n(8) provide financing only to those who demonstrate an ability to repay;\n(9) not provide financing for a qualifying commercial real property in which the owner is not current on mortgage or real property tax payments;\n(10) require a petition to the implementing entity by all owners of the qualifying commercial real property requesting collections of repayments as a special assessment under section 429.101;\n(11) provide that payments and assessments are not accelerated due to a default and that a tax delinquency exists only for assessments not paid when due;\n(12) require that liability for special assessments related to the financing runs with the qualifying commercial real property; and\n(13) prior to financing any improvements to or imposing any assessment upon qualifying commercial real property, require notice to and written consent from the mortgage lender of any mortgage encumbering or otherwise secured by the qualifying commercial real property.\nEnergy generated by an energy improvement may not be sold, transmitted, or distributed at retail and may not provide for end use of the electrical energy from an off-site facility. On-site generation is allowed to the extent provided for in section 216B.1611.\nThis section does not modify the exclusive service territories or exclusive right to serve as provided in sections 216B.37 to 216B.43.\nFinancing provided under this section must have:\n(1) a cost-weighted average maturity not exceeding the useful life of the eligible improvements installed, as determined by the implementing entity, but in no event may a term exceed 30 years;\n(2) a principal amount not to exceed the lesser of:\n(i) the greater of 30 percent of the assessed value of the real property on which the improvements are to be installed or 30 percent of the real property's appraised value, accepted or approved by the mortgage lender; or\n(ii) the actual cost of installing the eligible improvements, including the costs of necessary equipment, materials, and labor; the costs of each related energy audit, renewable energy system feasibility study, water improvement study, or resiliency improvement study; and the cost of verification of installation; and\n(3) an interest rate sufficient to pay the financing costs of the program, including the issuance of bonds and any financing delinquencies.\nA commercial PACE loan program must include cooperation and coordination with the conservation improvement activities of the utility serving the qualifying commercial real property under section 216B.241 and other public and private energy improvement programs.\nUpon completion of a project, an implementing entity shall provide a borrower with a certificate stating participation in the program and what energy improvements have been made with financing program proceeds.\n(a) An implementing entity that finances an eligible improvement under this section must:\n(1) secure payment with a lien against the qualifying commercial real property; and\n(2) collect repayments as a special assessment as provided for in section 429.101 or by charter, provided that special assessments may be made payable in up to 30 equal annual installments.\n(b) If the implementing entity is an authority, the local government that authorized the authority to act as implementing entity shall impose and collect special assessments necessary to pay debt service on bonds issued by the implementing entity under subdivision 8, and shall transfer all collections of the assessments upon receipt to the authority.\n(a) An implementing entity may issue revenue bonds as provided in chapter 475 for the purposes of this section and section 216C.437, provided the revenue bond must not be payable more than 30 years from the date of issuance.\n(b) The bonds must be payable as to both principal and interest solely from the revenues from the assessments established in subdivision 7 and section 216C.437, subdivision 28.\n(c) No holder of bonds issued under this subdivision may compel any exercise of the taxing power of the implementing entity that issued the bonds to pay principal or interest on the bonds, and if the implementing entity is an authority, no holder of the bonds may compel any exercise of the taxing power of the local government. Bonds issued under this subdivision are not a debt or obligation of the issuer or any local government that issued them, nor is the payment of the bonds enforceable out of any money other than the revenue pledged to the payment of the bonds.\n(a) An implementing entity is authorized to establish, acquire, and use additional or alternative funding sources for the purposes of this section and section 216C.437.\n(b) For the purposes of this subdivision and section 216C.437, additional or alternative funding sources do not include issuance of general obligation bonds.\nAn eligible improvement financed under a PACE loan program, including all equipment purchased in whole or in part with loan proceeds under a loan program, is deemed real property or a fixture attached to the real property.",
	"repealed": false
}