{
	"id": "82.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.76",
	"title": "82.76 LOAN BROKERS.",
	"text": "Loan brokers shall comply with the requirements of subdivisions 2 to 7.\nA loan broker shall enter into a written contract with each customer and shall provide a copy of the written contract to each customer at or before the time of receipt of any fee or valuable consideration paid for loan brokerage services. The written contract shall:\n(1) identify the escrow account into which the fees or consideration will be deposited;\n(2) set forth the circumstances under which the loan broker will be entitled to disbursement from the escrow account;\n(3) set forth the circumstances under which the customer will be entitled to a refund of all or part of the fee;\n(4) specifically describe the services to be provided by the loan broker and the dates by which the services will be performed;\n(5) state the maximum rate of interest to be charged on any loan obtained;\n(6) contain a statement which notifies the customer of his or her rights to cancel the contract pursuant to subdivision 3;\n(7) disclose, with respect to the 12-month period ending ten business days prior to the date of the contract in question, the percentage of the loan broker's customers for whom loans have actually been funded as a result of the loan broker's services. This disclosure need not be made for any period prior to September 8, 1986; and\n(8) disclose the cancellation rights and procedures set forth in subdivision 3.\nAny customer of a loan broker who pays a fee prior to the time a loan is actually funded shall have an unconditional right to rescind the contract for loan brokerage services at any time until midnight of the third business day after the day on which the contract is signed. Cancellation is evidenced by the customer giving written notice of cancellation to the loan broker at the address stated in the contract. Notice of cancellation, if given by mail, is effective upon deposit in a mailbox properly addressed to the loan broker with postage prepaid. Notice of cancellation need not take a particular form and is sufficient if it indicates by any form of written expression the intention of the customer not to be bound by the contract. No act of a customer of a loan broker shall be effective to waive the right to rescind as provided in this subdivision.\nThe loan broker shall deposit in an escrow account within 48 hours all fees received prior to the time a loan is actually funded. The escrow account shall be in a bank located within the state of Minnesota and shall be controlled by an unaffiliated accountant, lawyer, or bank.\nThe loan broker shall maintain a separate record of all fees received for services performed or to be performed as a loan broker. Each record shall set forth the date funds are received, the person from whom the funds are received, the amount received, the date of deposit in the escrow account, the account number, the date the funds are disbursed and the check number of the disbursement, and a description of each disbursement and the justification for the disbursement.\nThe loan broker shall provide to each customer at least monthly a detailed written accounting of all disbursements of the customer's funds from the trust account.\nThe loan broker shall provide to each customer at the expiration of the contract a list of the lenders or loan sources to whom loan applications were submitted on behalf of the customer.",
	"repealed": false
}