{
	"id": "115A.919",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.919",
	"title": "115A.919 COUNTY FEE AUTHORITY.",
	"text": "(a) A county may impose a fee, by cubic yard of waste or its equivalent, on operators of facilities for the disposal of mixed municipal solid waste or construction debris located within the county. The revenue from the fees shall be credited to the county general fund and shall be used only for landfill abatement purposes, or costs of closure, postclosure care, and response actions or for purposes of mitigating and compensating for the local risks, costs, and other adverse effects of facilities. The interest generated from fees imposed under this subdivision may be credited to the county general fund for use by a county for other purposes.\n(b) Fees for construction debris facilities may not exceed 50 cents per cubic yard. Revenues from the fees must offset any financial assurances required by the county for a construction debris facility. The maximum revenue that may be collected for a construction debris facility must be determined by multiplying the total permitted capacity of the facility by 15 cents per cubic yard. Once the maximum revenue has been collected for a facility, the fee may no longer be imposed. The limitation on the fees in this paragraph and in section 115A.921, subdivision 2, are not intended to alter the liability of the facility operator or the authority of the agency to impose financial assurance requirements.\nA county may impose a fee, by cubic yard or the equivalent of waste collected outside the county, in addition to a fee imposed under subdivision 1, on operators of mixed municipal solid waste disposal facilities located within the county. The fee may not exceed $7.50 per cubic yard or the equivalent. A person licensed to collect solid waste in a county that designates the waste under sections 115A.80 to 115A.893 who is referred to a disposal facility outside the county due to temporary closure of the designated facility is exempt from the additional fee; the designated facility is responsible for the fee. Revenue generated from the additional fee must be credited to the county general fund and may be used only for the purposes listed in subdivision 1.\nIf a facility is owned by a joint powers board, total fees in excess of $1 per cubic yard or equivalent may not be imposed or revenue expended under subdivision 1 or 2 without the approval of the board.\n(a) Waste residue from recycling facilities at which recyclable materials are separated or processed for the purpose of recycling, or from energy and resource recovery facilities at which solid waste is processed for the purpose of extracting, reducing, converting to energy, or otherwise separating and preparing solid waste for reuse shall be exempt from any fee imposed by a county under this section if there is at least an 85 percent weight reduction in the solid waste processed. Before any fee is reduced, the verification procedures of section 473.843, subdivision 1, paragraph (c), must be followed and submitted to the appropriate county, except that for facilities operating outside of the metropolitan area the commissioner shall prescribe procedures for verifying the required 85 percent weight reduction.\n(b) A facility permitted for the disposal of construction debris is exempt from 25 percent of a fee imposed under subdivision 1 if the facility has implemented a recycling program approved by the county and 25 percent if the facility contains a liner and leachate collection system approved by the agency.",
	"repealed": false
}