{
	"id": "302A.461",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.461",
	"title": "302A.461 BOOKS AND RECORDS; INSPECTION.",
	"text": "(a) A corporation shall keep at its principal executive office, or at another place or places within the United States determined by the board, a share register not more than one year old, containing the names and addresses of the shareholders and the number and classes of shares held by each shareholder.\n(b) A corporation shall also keep, at its principal executive office, or at another place or places within the United States determined by the board, a record of the dates on which certificated or uncertificated shares were issued.\nA corporation shall keep at its principal executive office or at another place or places within the United States determined by the board, and, if its principal executive office or any such other place is outside of this state, shall make available at its registered office or its principal executive office within this state within ten days after receipt by an officer of the corporation of a written demand for them made by a person described in subdivision 4, originals or copies of:\n(a) records of all proceedings of shareholders for the last three years;\n(b) records of all proceedings of the board for the last three years;\n(c) its articles and all amendments currently in effect;\n(d) its bylaws and all amendments currently in effect;\n(e) financial statements required by section 302A.463 and the financial statement for the most recent interim period prepared in the course of the operation of the corporation for distribution to the shareholders or to a governmental agency as a matter of public record;\n(f) reports made to shareholders generally within the last three years;\n(g) a statement of the names and usual business addresses of its directors and principal officers;\n(h) voting trust agreements described in section 302A.453;\n(i) shareholder control agreements described in section 302A.457; and\n(j) a copy of agreements, contracts, or other arrangements or portions of them incorporated by reference under section 302A.111, subdivision 7.\nA corporation shall keep appropriate and complete financial records.\n(a) A shareholder, beneficial owner, or a holder of a voting trust certificate of a corporation that is not a publicly held corporation has an absolute right, upon written demand, to examine and copy, in person or by a legal representative, at any reasonable time, and the corporation shall make available within ten days after receipt by an officer of the corporation of the written demand:\n(1) the share register; and\n(2) all documents referred to in subdivision 2.\n(b) A shareholder, beneficial owner, or a holder of a voting trust certificate of a corporation that is not a publicly held corporation has a right, upon written demand, to examine and copy, in person or by a legal representative, other corporate records at any reasonable time only if the shareholder, beneficial owner, or holder of a voting trust certificate demonstrates a proper purpose for the examination.\n(c) A shareholder, beneficial owner, or a holder of a voting trust certificate of a publicly held corporation has, upon written demand stating the purpose and acknowledged or verified in the manner provided in chapter 358, a right at any reasonable time to examine and copy the corporation's share register and other corporate records reasonably related to the stated purpose and described with reasonable particularity in the written demand upon demonstrating the stated purpose to be a proper purpose. The acknowledged or verified demand must be directed to the corporation at its registered office in this state or at its principal place of business.\n(d) For purposes of this section, a \"proper purpose\" is one reasonably related to the person's interest as a shareholder, beneficial owner, or holder of a voting trust certificate of the corporation.\nOn application of the corporation, a court in this state may issue a protective order permitting the corporation to withhold portions of the records of proceedings of the board for a reasonable period of time, not to exceed 12 months, in order to prevent premature disclosure of confidential information which would be likely to cause competitive injury to the corporation. A protective order may be renewed for successive reasonable periods of time, each not to exceed 12 months and in total not to exceed 36 months, for good cause shown. In the event a protective order is issued, the statute of limitations for any action which the shareholder, beneficial owner, or holder of a voting trust certificate might bring as a result of information withheld automatically extends for the period of delay. If the court does not issue a protective order with respect to any portion of the records of proceedings as requested by the corporation, it shall award reasonable expenses, including attorney's fees and disbursements, to the shareholder, beneficial owner, or holder of a voting trust certificate. This subdivision does not limit the right of a court to grant other protective orders or impose other reasonable restrictions on the nature of the corporate records that may be copied or examined under subdivision 4 or the use or distribution of the records by the demanding shareholder, beneficial owner, or holder of a voting trust certificate.\nA shareholder, beneficial owner, or holder of a voting trust certificate who has gained access under this section to any corporate record including the share register may not use or furnish to another for use the corporate record or a portion of the contents for any purpose other than a proper purpose. Upon application of the corporation, a court may issue a protective order or order other relief as may be necessary to enforce the provisions of this subdivision.\nCopies of the share register and all documents referred to in subdivision 2, if required to be furnished under this section, shall be furnished at the expense of the corporation. In all other cases, the corporation may charge the requesting party a reasonable fee to cover the expenses of providing the copy.\nThe records maintained by a corporation, including its share register, financial records, and minute books, may utilize any information storage technique, including, for example, punched holes, printed or magnetized spots, or micro-images, even though that makes them illegible visually, if the records can be converted accurately and within a reasonable time, into a form that is legible visually and whose contents are assembled by related subject matter to permit convenient use by people in the normal course of business. A corporation shall convert any of the records referred to in subdivision 4 upon the request of a person entitled to inspect them, and the expense of the conversion shall be borne by the person who bears the expense of copying pursuant to subdivision 5. A copy of the conversion is admissible in evidence, and shall be accepted for all other purposes, to the same extent as the existing or original records would be if they were legible visually.",
	"repealed": false
}