{
	"id": "469.176",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.176",
	"title": "469.176 LIMITATIONS.",
	"text": "(a) Subject to the limitations contained in subdivisions 1a to 1f, any tax increment financing district as to which bonds are outstanding, payment for which the tax increment and other revenues have been pledged, shall remain in existence at least as long as the bonds continue to be outstanding. The municipality may, at the time of approval of the initial tax increment financing plan, provide for one or both of the following:\n(1) a shorter maximum duration limit than specified in subdivisions 1a to 1f;\n(2) an election as provided under section 469.175, subdivision 1, paragraph (b).\nThe specified limit applies in place of the otherwise applicable limit, unless the authority modifies the plan following the procedures under section 469.175, subdivision 4, paragraph (b).\n(b) The tax increment pledged to the payment of the bonds and interest thereon may be discharged and the tax increment financing district may be terminated if sufficient funds have been irrevocably deposited in the debt service fund or other escrow account held in trust for all outstanding bonds to provide for the payment of the bonds at maturity or date of redemption and interest thereon to the maturity or redemption date.\n(c) For bonds issued pursuant to section 469.178, subdivisions 2 and 3, the full faith and credit and any taxing powers of the municipality or authority are pledged to the payment of the bonds until the principal of and interest on the bonds has been paid in full.\nMS 2004 [Repealed, 2005 c 152 art 2 s 31]\n(a) No tax increment shall in any event be paid to the authority:\n(1) after 15 years after receipt by the authority of the first increment for a renewal and renovation district;\n(2) after 20 years after receipt by the authority of the first increment for a soils condition district;\n(3) after eight years after receipt by the authority of the first increment for an economic development district;\n(4) for a housing district or a redevelopment district, after 25 years from the date of receipt by the authority of the first increment.\n(b) For purposes of determining a duration limit under this subdivision or subdivision 1e that is based on the receipt of an increment, any increments from taxes payable in the year in which the district terminates shall be paid to the authority. This paragraph does not affect a duration limit calculated from the date of approval of the tax increment financing plan or based on the recovery of costs or to a duration limit under subdivision 1c. This paragraph does not supersede the restrictions on payment of delinquent taxes in subdivision 1f.\n(c) An action by the authority to waive or decline to accept an increment has no effect for purposes of computing a duration limit based on the receipt of increment under this subdivision or any other provision of law. The authority is deemed to have received an increment for any year in which it waived or declined to accept an increment, regardless of whether the increment was paid to the authority.\n(d) Receipt by a hazardous substance subdistrict of an increment as a result of a reduction in original net tax capacity under section 469.174, subdivision 7, paragraph (b), does not constitute receipt of increment by the overlying district for the purpose of calculating the duration limit under this section.\n(a) For tax increment financing districts created prior to August 1, 1979, no tax increment shall be paid to the authority after April 1, 2001, or the term of a nondefeased bond or obligation outstanding on April 1, 1990, secured by increments from the district or project area, whichever time is greater, provided that in no case will a tax increment be paid to an authority after August 1, 2009, from such a district. If a district's termination date is extended beyond April 1, 2001, because bonds were outstanding on April 1, 1990, with maturities extending beyond April 1, 2001, the following restrictions apply. No increment collected from the district may be expended after April 1, 2001, except to pay or repay:\n(1) bonds issued before April 1, 1990;\n(2) bonds issued to refund the principal of the outstanding bonds and pay associated issuance costs;\n(3) administrative expenses of the district required to be paid under section 469.176, subdivision 4h, paragraph (a);\n(4) transfers of increment permitted under section 469.1763, subdivision 6; and\n(5) any advance or payment made by the municipality or the authority after June 1, 2002, to pay any bonds listed in clause (1) or (2).\n(b) Each year, any increments from a district subject to this subdivision must be first applied to pay obligations listed under paragraph (a), clauses (1) and (2), and administrative expenses under paragraph (a), clause (3). Any remaining increments may be used for transfers of increments permitted under section 469.1763, subdivision 6, and to make payments under paragraph (a), clause (5).\n(c) When sufficient money has been received to pay in full or defease obligations under paragraph (a), clauses (1), (2), and (5), the tax increment project or district must be decertified.\nModification of a tax increment financing plan pursuant to section 469.175, subdivision 4, shall not extend the durational limitations of subdivisions 1 to 1f.\nIf a parcel of a district is part of a designated hazardous substance site or a hazardous substance subdistrict, tax increment may be paid to the authority from the parcel for longer than the period otherwise provided by subdivisions 1 to 1f for the overlying district. The extended period for collection of tax increment begins on the date of receipt of the first tax increment from the parcel that is more than any tax increment received from the parcel before the date of the certification under section 469.174, subdivision 7, paragraph (b), and received after the date of certification to the county auditor described in section 469.174, subdivision 7, paragraph (b). The extended period for collection of tax increment is the lesser of: (1) 25 years from the date of commencement of the extended period; or (2) the period necessary to recover the costs of removal actions or remedial actions specified in a development response action plan.\nIf a parcel located in the district has delinquent property taxes when the district terminates under the duration limits, the payment of the parcel's delinquent taxes made after decertification of the district are tax increments to the extent the nonpayment of property taxes caused the outstanding bonds or contractual obligations pledged to be paid by the district to be paid by sources other than tax increments or to go unpaid. The county auditor shall pay the appropriate amount to the district. The authority shall provide the county auditor with information regarding the payment of outstanding bonds or contractual obligations and any other information necessary to administer the payment, as requested by the county auditor.\n(a) The authority, with the approval of the municipality, may extend the duration of a district beyond the limit that otherwise applies under this section, if the following circumstances apply:\n(1) after the district is established, contamination, hazardous substances, pollution, or other materials requiring removal or remediation are found in the district;\n(2) the authority elects not to create a hazardous substance subdistrict; and\n(3) the municipality pays for the cost of removal, cleanup, or remediation out of its general fund or other money of the municipality, except revenues from tax increments.\n(b) The maximum duration extension permitted by this subdivision is the lesser of (1) ten years after the district otherwise would have terminated or (2) the number of additional years necessary to collect increment equal to the cleanup costs paid by the municipality out of funds other than tax increments. Cleanup costs are limited to the actual costs of removal and remediation, and do not include financing or interest costs. Cleanup costs do include testing and engineering costs. Cleanup costs must be reduced by any reimbursements or amounts recovered from private parties or other responsible parties.\nMS 2001 Supp [Repealed, 2002 c 377 art 7 s 13]\nMS 2013 Supp [Repealed, 2014 c 308 art 9 s 94]\n(a) The authority shall annually determine the amount of excess increments for a district, if any. This determination must be based on the tax increment financing plan in effect on December 31 of the year and the increments and other revenues received as of December 31 of the year. The authority must spend or return the excess increments under paragraph (c) within nine months after the end of the year.\n(b) For purposes of this subdivision, \"excess increments\" equals the excess of:\n(1) total increments collected from the district since its certification, reduced by any excess increments paid under paragraph (c), clause (4), for a prior year, over\n(2) the total costs authorized by the tax increment financing plan to be paid with increments from the district, reduced, but not below zero, by the sum of:\n(i) the amounts of those authorized costs that have been paid from sources other than tax increments from the district;\n(ii) revenues, other than tax increments from the district, that are dedicated for or otherwise required to be used to pay those authorized costs and that the authority has received and that are not included in item (i);\n(iii) the amount of principal and interest obligations due on outstanding bonds after December 31 of the year and not prepaid under paragraph (c) in a prior year; and\n(iv) increased by the sum of the transfers of increments made under section 469.1763, subdivision 6, to reduce deficits in other districts made by December 31 of the year.\n(c) The authority shall use excess increment only to do one or more of the following:\n(1) prepay any outstanding bonds;\n(2) discharge the pledge of tax increment for any outstanding bonds;\n(3) pay into an escrow account dedicated to the payment of any outstanding bonds; or\n(4) return the excess amount to the county auditor who shall distribute the excess amount to the city or town, county, and school district in which the tax increment financing district is located in direct proportion to their respective local tax rates.\n(d) For purposes of a district for which the request for certification was made prior to August 1, 1979, excess increments equal the amount of increments on hand on December 31, less the principal and interest obligations due on outstanding bonds or advances, qualifying under subdivision 1c, clauses (1), (2), (4), and (5), after December 31 of the year and not prepaid under paragraph (c).\n(e) The county auditor must, prior to February 1 of each year, report to the commissioner of education the amount of any excess tax increment distributed to a school district for the preceding taxable year.\n(f) For purposes of this subdivision, \"outstanding bonds\" means bonds which are secured by increments from the district.\n(g) The state auditor may exempt an authority from reporting the amounts calculated under this subdivision for a calendar year, if the authority certifies to the auditor in its report that the total amount authorized by the tax increment plan to be paid with increments from the district exceeds the sum of the total increments collected for the district for all years by 20 percent.\n(a) For districts for which certification was requested before August 1, 2001, no tax increment shall be used to pay any administrative expenses for a project which exceed ten percent of the total estimated tax increment expenditures authorized by the tax increment financing plan or ten percent of the total tax increment expenditures for the project net of any amounts returned to the county auditor as excess increment; as returned increment under section 469.1763, subdivision 4, paragraph (g); or as remedies under section 469.1771, subdivision 2, whichever is less.\n(b) For districts for which certification was requested after July 31, 2001, no tax increment may be used to pay any administrative expenses for a project which exceed ten percent of total estimated tax increment expenditures authorized by the tax increment financing plan or ten percent of the total tax increments, as defined in section 469.174, subdivision 25, clause (1), received for the district net of any amounts returned to the county auditor as excess increment; as returned increment under section 469.1763, subdivision 4, paragraph (g); or as remedies under section 469.1771, subdivision 2, whichever is less.\n(c) Increments used to pay the county's administrative expenses under subdivision 4h are not subject to the percentage limits in this subdivision.\n(d) Increments defined under section 469.174, subdivision 25, clause (2), used for administrative expenses described under section 469.174, subdivision 14, paragraph (a), clause (4), are not subject to the percentage limits in this subdivision.\nAll revenues derived from tax increment shall be used in accordance with the tax increment financing plan. The revenues shall be used solely for the following purposes: (1) to pay the principal of and interest on bonds issued to finance a project; (2) by a rural development financing authority for the purposes stated in section 469.142; by a port authority or municipality exercising the powers of a port authority to finance or otherwise pay the cost of redevelopment pursuant to sections 469.048 to 469.068; by an economic development authority to finance or otherwise pay the cost of redevelopment pursuant to sections 469.090 to 469.108; by a housing and redevelopment authority or economic development authority to finance or otherwise pay public redevelopment costs pursuant to sections 469.001 to 469.047; by a municipality or economic development authority to finance or otherwise pay the capital and administration costs of a development district pursuant to sections 469.124 to 469.133; by a municipality or authority to finance or otherwise pay the costs of developing and implementing a development action response plan; by a municipality or redevelopment agency to finance or otherwise pay premiums for insurance or other security guaranteeing the payment when due of principal of and interest on the bonds pursuant to chapter 462C, sections 469.152 to 469.165, or both, or to accumulate and maintain a reserve securing the payment when due of the principal of and interest on the bonds pursuant to chapter 462C, sections 469.152 to 469.165, or both, which revenues in the reserve shall not exceed, subsequent to the fifth anniversary of the date of issue of the first bond issue secured by the reserve, an amount equal to 20 percent of the aggregate principal amount of the outstanding and nondefeased bonds secured by the reserve; and (3) to pay administrative expenses.\nMS 1998 [Repealed, 2000 c 490 art 11 s 44]\nRevenue derived from tax increment from a soils condition district may be used only to (1) acquire parcels on which the improvements described in clause (2) will occur; (2) pay for the cost of removal or remedial action; and (3) pay for the administrative expenses of the authority allocable to the district, including the cost of preparation of the development action response plan.\n(a) Revenue derived from tax increment from an economic development district may not be used to provide improvements, loans, subsidies, grants, interest rate subsidies, or assistance in any form to developments consisting of buildings and ancillary facilities, if more than 15 percent of the buildings and facilities (determined on the basis of square footage) are used for a purpose other than:\n(1) the manufacturing or production of tangible personal property, including processing resulting in the change in condition of the property;\n(2) warehousing, storage, and distribution of tangible personal property, excluding retail sales;\n(3) research and development related to the activities listed in clause (1) or (2);\n(4) telemarketing if that activity is the exclusive use of the property;\n(5) tourism facilities;\n(6) space necessary for and related to the activities listed in clauses (1) to (5); or\n(7) a workforce housing project that satisfies the requirements of paragraph (d).\n(b) Notwithstanding the provisions of this subdivision, revenues derived from tax increment from an economic development district may be used to provide improvements, loans, subsidies, grants, interest rate subsidies, or assistance in any form for up to 15,000 square feet of any separately owned commercial facility located within the municipal jurisdiction of a small city, if the revenues derived from increments are spent only to assist the facility directly or for administrative expenses, the assistance is necessary to develop the facility, and all of the increments, except those for administrative expenses, are spent only for activities within the district.\n(c) A city is a small city for purposes of this subdivision if the city was a small city in the year in which the request for certification was made and applies for the rest of the duration of the district, regardless of whether the city qualifies or ceases to qualify as a small city.\n(d) A project qualifies as a workforce housing project under this subdivision if:\n(1) increments from the district are used exclusively to assist in the acquisition of property; construction of improvements; and provision of loans or subsidies, grants, interest rate subsidies, public infrastructure, and related financing costs for rental housing developments in the municipality;\n(2) the governing body of the municipality made the findings for the project required by section 469.175, subdivision 3, paragraph (f); and\n(3) the governing bodies of the county and the school district, following receipt, review, and discussion of the materials required by section 469.175, subdivision 2, for the tax increment financing district, have each approved the tax increment financing plan, by resolution.\nRevenue derived from tax increment from a housing district must be used solely to finance the cost of housing projects as defined in sections 469.174, subdivision 11, and 469.1761. The cost of public improvements directly related to the housing projects and the allocated administrative expenses of the authority may be included in the cost of a housing project.\nThe additional tax increment received by the municipality from a hazardous substance subdistrict as a result of a reduction in original net tax capacity pursuant to section 469.174, subdivision 7, paragraph (b), or as a result of the extension of the period for collection of tax increment from a hazardous substance site or subdistrict provided for in subdivision 1, paragraph (g), may be used only to pay or reimburse the costs of: (1) removal actions or remedial actions with respect to hazardous substances or pollutants or contaminants or petroleum releases affecting or which may affect the designated hazardous substance site; (2) pollution testing, demolition, and soil compaction correction necessitated by the development response action plan for the designated hazardous substance site; (3) purchase of environmental insurance or deposits to a guaranty fund, relating only to liability or response costs for land in the subdistrict; and (4) related administrative and legal costs, including costs of review and approval of development response action plans by the Pollution Control Agency and litigation expenses of the attorney general.\nRevenues derived from tax increment may be used to finance the costs of an interest reduction program operated pursuant to section 469.012, subdivisions 7 to 10, or pursuant to other law granting interest reduction authority and power by reference to those subdivisions only under the following conditions: (1) tax increments may not be collected for a program for a period in excess of 15 years after the date of the first interest rate reduction payment for the program, (2) tax increments may not be used for an interest reduction program, if the proceeds of bonds issued pursuant to section 469.178 after December 31, 1985, have been or will be used to provide financial assistance to the specific project which would receive the benefit of the interest reduction program, and (3) tax increments may not be used to finance an interest reduction program for owner-occupied single-family dwellings.\n(a) Tax increments may not be used to circumvent existing levy limit law.\n(b) No tax increment from any district may be used for the acquisition, construction, renovation, operation, or maintenance of a building to be used primarily and regularly for conducting the business of a municipality, county, school district, or any other local unit of government or the state or federal government. This provision does not prohibit the use of revenues derived from tax increments for the construction or renovation of a parking structure.\n(a) Tax increments may be used to pay for the county's actual administrative expenses under sections 469.174 to 469.179. The county may require payment of those expenses by February 15 of the year after the year in which the expenses are incurred. The amount of these payments is not required to be set forth in the tax increment financing plan for the project. To obtain payment for actual administrative costs, the county auditor must submit to the authority a record of costs incurred by the county auditor related to administration of the authority's tax increment financing districts.\n(b) Tax increments may be used to pay county road costs as provided in section 469.175, subdivision 1a.\nIf a tax increment district is located in a municipality, parts of which are situated in more than one county, the revenue derived from tax increments from parcels located in one county must be expended for the direct and primary benefit of a project located or conducted within that county, unless the county boards of each of the counties involved agree to waive this requirement.\nAt least 90 percent of the revenues derived from tax increments from a redevelopment district or renewal and renovation district must be used to finance the cost of correcting conditions that allow designation of redevelopment and renewal and renovation districts under section 469.174. These costs include, but are not limited to, acquiring properties containing structurally substandard buildings or improvements or hazardous substances, pollution, or contaminants, acquiring adjacent parcels necessary to provide a site of sufficient size to permit development, demolition and rehabilitation of structures, clearing of the land, the removal of hazardous substances or remediation necessary to development of the land, and installation of utilities, roads, sidewalks, and parking facilities for the site. The allocated administrative expenses of the authority, including the cost of preparation of the development action response plan, may be included in the qualifying costs.\nNotwithstanding the definition of a project under section 469.174, increments may be spent to assist housing that meets the requirements under section 469.1763, subdivision 2, paragraph (d), regardless of whether the housing is located within the boundaries of the project area.\n(a) No tax increment from any district may be used for:\n(1) a commons area used as a public park; or\n(2) a facility used for social, recreational, or conference purposes.\n(b) This subdivision does not apply to a privately owned facility for conference purposes or a parking structure, whether it is public or privately owned or whether it is ancillary to a use listed in paragraph (a).\n(a) Notwithstanding the restrictions in any other subdivision of this section or any other law to the contrary, except the requirement to pay bonds to which the increments are pledged and the provisions of subdivisions 4g and 4h, the authority may spend tax increments for one or more of the following purposes:\n(1) to provide improvements, loans, interest rate subsidies, or assistance in any form to private development consisting of the construction or substantial rehabilitation of buildings and ancillary facilities, if doing so will create or retain jobs in this state, including construction jobs, and that the construction commences before July 1, 2012, and would not have commenced before that date without the assistance; or\n(2) to make an equity or similar investment in a corporation, partnership, or limited liability company that the authority determines is necessary to make construction of a development that meets the requirements of clause (1) financially feasible.\n(b) The authority may undertake actions under the authority of this subdivision only after approval by the municipality of a written spending plan that specifically authorizes the authority to take the actions. The municipality shall approve the spending plan only after a public hearing after published notice in a newspaper of general circulation in the municipality at least once, not less than ten days nor more than 30 days prior to the date of the hearing.\n(c) The authority to spend tax increments under this subdivision expires December 31, 2012.\n(d) For a development consisting of housing, the authority to spend tax increments under this subdivision expires December 31, 2011, and construction must commence before July 1, 2011, except the authority to spend tax increments on market rate housing developments under this subdivision expires July 31, 2012, and construction must commence before January 1, 2012.\n(a) Notwithstanding any other provision of this section or any other law to the contrary, except the requirements to pay bonds to which increments are pledged, the authority may elect, by resolution, to transfer unobligated increment for one or more of the following purposes:\n(1) to provide improvements, loans, interest rate subsidies, or assistance in any form to private development consisting of the construction or substantial rehabilitation of buildings and ancillary facilities, if doing so will create or retain jobs in the state, including construction jobs, and the construction commences before December 31, 2025, and would not have commenced before that date without the assistance; or\n(2) to make an equity or similar investment in a corporation, partnership, or limited liability company that the authority determines is necessary to make construction of a development that meets the requirement of clause (1) financially feasible.\n(b) For each calendar year for which transfers are permitted under this subdivision, the maximum transfer equals the excess of the district's unobligated increment which includes any increment not required for payments of obligations due during six months following the transfer on outstanding bonds, binding contracts, and other outstanding financial obligations of the district to which the district's increment is pledged.\n(c) The authority may transfer increments permitted under this subdivision after creating a written spending plan that authorizes the authority to take the action described in paragraph (a) and details the use of transferred increment. Additionally, the municipality must approve the authority's spending plan after holding a public hearing. The municipality must publish notice of the hearing in a newspaper of general circulation in the municipality and on the municipality's public website at least ten days, but not more than 30 days, prior to the date of the hearing.\n(d) Increment that is improperly retained, received, spent, or transferred is not eligible for transfer under this subdivision.\n(e) An authority making a transfer under this subdivision must provide to the Office of the State Auditor a copy of the spending plan approved and signed by the municipality.\n(f) The authority to transfer increments under this subdivision expires on December 31, 2022. All transferred increments must be spent by December 31, 2025. Increment not spent by December 31, 2025, must be returned to the district. If the district has already been decertified, the increment shall be treated as excess increment and distributed as provided in subdivision 2, paragraph (c), clause (4).\nNo more than 25 percent, by acreage, of the property to be acquired within a project which contains a redevelopment district, or ten percent, by acreage, of the property to be acquired within a project which contains a housing or economic development district, as set forth in the tax increment financing plan, shall at any time be owned by an authority as a result of acquisition with the proceeds of bonds issued pursuant to section 469.178 to which tax increment from the property acquired is pledged unless prior to acquisition in excess of the percentages, the authority has concluded an agreement for the development or redevelopment of the property acquired and which provides recourse for the authority should the development or redevelopment not be completed. This subdivision does not apply to a parcel of a district that is a designated hazardous substance site established under section 469.174, subdivision 16, or part of a hazardous substance subdistrict established under section 469.175, subdivision 7.\n(a) If, after four years from the date of certification of the original net tax capacity of the tax increment financing district pursuant to section 469.177, no demolition, rehabilitation, or renovation of property or other site preparation, including qualified improvement of a street adjacent to a parcel but not installation of utility service including sewer or water systems, has been commenced on a parcel located within a tax increment financing district by the authority or by the owner of the parcel in accordance with the tax increment financing plan, no additional tax increment may be taken from that parcel, and the original net tax capacity of that parcel shall be excluded from the original net tax capacity of the tax increment financing district. If the authority or the owner of the parcel subsequently commences demolition, rehabilitation, or renovation or other site preparation on that parcel including qualified improvement of a street adjacent to that parcel, in accordance with the tax increment financing plan, the authority shall certify to the county auditor that the activity has commenced, and the county auditor shall certify the net tax capacity thereof as most recently certified by the commissioner of revenue and add it to the original net tax capacity of the tax increment financing district. The county auditor must enforce the provisions of this subdivision. The authority must submit to the county auditor evidence that the required activity has taken place for each parcel in the district. The evidence for a parcel must be submitted by February 1 of the fifth year following the year in which the parcel was certified as included in the district. For purposes of this subdivision, qualified improvements of a street are limited to (1) construction or opening of a new street, (2) relocation of a street, and (3) substantial reconstruction or rebuilding of an existing street.\n(b) For districts which were certified on or after January 1, 2005, and before April 20, 2009, the four-year period under paragraph (a) is deemed to end on December 31, 2016.\n(a) The authority may request inclusion in a tax increment financing district and the county auditor may certify the original tax capacity of a parcel or a part of a parcel that qualified under the provisions of section 273.111, 273.112, 273.114, or chapter 473H for taxes payable in any of the five calendar years before the filing of the request for certification only for:\n(1) a district in which 85 percent or more of the planned buildings and facilities (determined on the basis of square footage) are a qualified manufacturing facility or a qualified distribution facility or a combination of both; or\n(2) a housing district.\n(b)(1) A distribution facility means buildings and other improvements to real property that are used to conduct activities in at least each of the following categories:\n(i) to store or warehouse tangible personal property;\n(ii) to take orders for shipment, mailing, or delivery;\n(iii) to prepare personal property for shipment, mailing, or delivery; and\n(iv) to ship, mail, or deliver property.\n(2) A manufacturing facility includes space used for manufacturing or producing tangible personal property, including processing resulting in the change in condition of the property, and space necessary for and related to the manufacturing activities.\n(3) To be a qualified facility, the owner or operator of a manufacturing or distribution facility must agree to pay and pay 90 percent or more of the employees of the facility at a rate equal to or greater than 160 percent of the federal minimum wage for individuals over the age of 20.",
	"repealed": false
}