{
	"id": "216D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/216D.03",
	"title": "216D.03 NOTIFICATION CENTER.",
	"text": "An operator shall participate in and share in the costs of one statewide notification center operated by a vendor selected under subdivision 2.\n(a) The notification center services must be provided by a nonprofit corporation approved in writing by the commissioner. The nonprofit corporation must be governed by a board of directors of up to 20 members, one of whom is the director of the Office of Pipeline Safety. The other board members must represent and be elected by operators, excavators, and other persons eligible to participate in the center. In deciding to approve a nonprofit corporation, the commissioner shall consider whether it meets the requirements of this paragraph and whether it demonstrates that it has the ability to contract for and implement the notification center service.\n(b) The commissioner shall adopt rules:\n(1) establishing a notification process and competitive bidding procedure for selecting a vendor to provide the notification service;\n(2) governing the operating procedures and technology needed for a statewide notification center; and\n(3) setting forth the method for assessing the cost of the service among operators.\n(c) The commissioner shall select a vendor to provide the notification center service. The commissioner may advertise for bids as provided in section 16C.06, subdivisions 1 and 2, and base the selection of a vendor on best value as provided in section 16C.06, subdivision 6. The commissioner shall select and contract with the vendor to provide the notification center service, but all costs of the center must be paid by the operators. The commissioner may at any time appoint a task force to advise on the renewal of the contract or any other matter involving the center's operations.\n(d) An operator may submit a bid and be selected to contract to provide the notification center service under paragraph (a) or (c). The commissioner shall annually review the services provided by the nonprofit corporation approved under paragraph (a) or the vendor selected under paragraph (c).\nIn establishing operating procedures and technology for the statewide notification center, the board of directors or the commissioner must work in cooperation with the League of Minnesota Cities, the Association of Minnesota Counties, and the Township Officers' Association. The purpose of this cooperation is to maximize the participation of local governmental units that issue permits for activities involving excavation to assure that excavators receive notice of and comply with the requirements of sections 216D.01 to 216D.07.\nThe notification center shall provide local governmental units with a master list, by county, of the operators in the county who are participants in the notification center, and the telephone number and mailing address of the notification center.\n(a) Each operator must submit a report to the Office of Pipeline Safety on a quarterly basis, using a form or database entry designated by the Office of Pipeline Safety. The report must contain the following information:\n(1) the total number of notifications and the number of notifications, itemized by type;\n(2) for each notification type, the percentage of notifications marked by the start time on the notice; and\n(3) the number of utility damages, itemized by the cause of the damages.\n(b) Except for a pipeline operator that is subject to chapter 299F or 299J, an operator with fewer than 5,000 notifications received during the previous calendar year is exempt from the reporting requirement under paragraph (a).\n(c) The data collected under this subdivision may not be used to initiate an enforcement action by the Office of Pipeline Safety.\n(d) The commissioner must annually publish a report on the data collected under this subdivision and make the report available on the Office of Pipeline Safety website.",
	"repealed": false
}