{
	"id": "327.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.665",
	"title": "327.665 REINSTATEMENT.",
	"text": "(a) If the debtor does not cure the default within the 30-day period specified in section 327.66, the secured party must send a registered or certified letter and concurrently send a copy of the notice by first class mail to the occupant of the home and, if the debtor is different than the occupant, to the debtor, stating that the debtor has 30 days to reinstate the loan by paying the defaulted amount plus additional allowable fees incurred by the secured party in order to regain possession of the home.\n(b) If the debtor does not sign for the registered or certified letter containing the notice within seven calendar days of the first attempted delivery, the secured party may proceed with all permissible actions provided in statute as though the debtor's signature had been secured.\n(a) The notice shall contain, at a minimum, the following information:\n(1) the name of the secured party, the debtor, each current assignee of the loan, if any, and the original or maximum principal amount secured by the loan;\n(2) the date of the loan;\n(3) the amount in arrears on the loan as of the date of the notice;\n(4) a description of the manufactured home upon which the loan is secured, conforming substantially to that contained in the loan documents;\n(5) the amount of allowable fees incurred by the secured party in order to regain possession of the home prior to the court order.\n(b) The notice must also state: \"Your manufactured home is currently being repossessed. Contact us immediately at [insert phone number] to discuss possible options for reinstating your loan. We encourage you to seek counseling with the foreclosure prevention counselor in your area. Nearby community agencies will answer your questions, offer free advice, and help you create a plan. You can contact the Minnesota Home Ownership Center at 866-462-6466 or www.hocmn.org to get the phone number and location of the nearest counseling organization. Call today. Waiting limits your options. If you do not become current on your loan within 30 days, including any additional fees, you will no longer be entitled to reinstate your loan. We are seeking a court order repossessing the home, and by court order you will have to vacate the home.\"\nAt any time after the expiration of the 30-day period required under section 327.64, the creditor may proceed with a court action under section 327.65, so long as the right to reinstate has not been exercised. The exercise of the right to reinstatement in accordance with the provisions of this section shall suspend the secured party's right to seek repossession of the manufactured home under the provisions of sections 327.61 to 327.67 and shall immediately terminate any court action filed pursuant to sections 327.61 to 327.67 or chapter 565.\nFor the purposes of this section, allowable costs that can be recovered include insurance; delinquent taxes, if any, upon the premises; interest to date of payment; cost of services of process or notices; filing fees; attorney fees, not to exceed $150 or one-half of the attorney fees authorized by section 582.01, whichever is greater; together with other lawful disbursements necessarily incurred in connection with the proceedings by the party repossessing.",
	"repealed": false
}