{
	"id": "600.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/600.13",
	"title": "600.13 ORIGINAL RECORDS; PROBATE COURT DECREES; CERTIFIED COPIES.",
	"text": "The original record made by any public officer in the performance of official duty shall be prima facie evidence of the facts required or permitted by law to be recorded by the officer. A copy of such record, or of any document which is made evidence by law and is preserved in the office or place where the same was required or is permitted to be filed or kept, or a copy of any authorized record of such document so preserved, when certified by the person entitled to the official custody thereof to have been compared by that person with the original and to be a correct transcript therefrom, shall be received in evidence in all cases, with the same force and effect given to such original document or record; but if such officer have, by law, an official seal, the certificate shall be authenticated thereby. No part of this section relating to the form of certification shall apply to documents or records kept in the departments or offices of the United States government.\nIn all cases where a decree of a court exercising probate jurisdiction, assigning or distributing property of a decedent, embraces real estate or other property situated in more than one county, the court exercising probate jurisdiction shall furnish, upon request therefor, certified copies of parts of such decrees, excluding from such certified copy all descriptions of real or other property included in such decree excepting description of such real estate and other property as appears from the face of the decree to be situated in any one or more counties designated by the applicant for such certified copy. The court shall indicate the omission hereby permitted, in the certified copy, by the words \"and other property situated in .................... county, or counties, Minnesota\" inserted in the certified copy at the points where the omissions occur. Such certified copy shall be entitled to record in the office of the county recorder and in the office of the registrar of titles of the county, or counties, in which the real estate or other property in the certified copy described, or any part thereof, is situated. Such certified copy, or a copy of any authorized record of such certified copy, certified by the person entitled to the official custody thereof to have been compared by that person with the original or the record thereof and to be a correct transcription therefrom, shall be received in evidence in all cases with the same force and effect given to such original decree relative to the matter in the certified copy or the record thereof contained. If such officer have by law an official seal, the certificate shall be authenticated thereby.\nThis section shall not be construed to require the affixing of the seal of the court to any certified copy of a rule or order made by such court, or to any paper filed therein, when such copy is used in the same court or before any officer thereof.\nIn all cases where the affixing of a seal of the court is required, the court seal may be affixed electronically as provided in sections 358.03 and 645.44.",
	"repealed": false
}