{
	"id": "142C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/142C.07",
	"title": "142C.07 DECERTIFICATION.",
	"text": "(a) The commissioner may decertify a center if a certification holder:\n(1) failed to comply with an applicable law or rule;\n(2) knowingly withheld relevant information from or gave false or misleading information to the commissioner in connection with an application for certification, in connection with the background study status of an individual, during an investigation, or regarding compliance with applicable laws or rules; or\n(3) has authorization to receive child care assistance payments revoked pursuant to chapter 142E.\n(b) When considering decertification, the commissioner shall consider the nature, chronicity, or severity of the violation of law or rule.\n(c) When a center is decertified, the center is ineligible to receive a child care assistance payment under chapter 142E.\n(d) The commissioner may issue a decertification order to a certification holder through the provider licensing and reporting hub.\n(a) The certification holder may request reconsideration of the decertification by notifying the commissioner by certified mail, by personal service, or through the provider licensing and reporting hub. The request must be made in writing. If sent by certified mail, the request must be postmarked and sent to the commissioner within 20 calendar days after the certification holder received the order. If a request is made by personal service, it must be received by the commissioner within 20 calendar days after the certification holder received the order. If the order is issued through the provider hub, the request must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub. With the request for reconsideration, the certification holder may submit a written argument or evidence in support of the request for reconsideration.\n(b) The commissioner's disposition of a request for reconsideration is final and not subject to appeal under chapter 14.\nIf the commissioner decertifies a center pursuant to subdivision 1, paragraph (a), clause (1), based on a determination that the center was responsible for maltreatment, and if the center requests reconsideration of the decertification according to subdivision 2, paragraph (a), and appeals the maltreatment determination under section 260E.33, the final decertification determination is stayed until the commissioner issues a final decision regarding the maltreatment appeal.\nIf the commissioner decertifies a center that had payments revoked pursuant to chapter 142E, and if the center appeals the revocation of the center's authorization to receive child care assistance payments, the final decertification determination is stayed until the appeal of the center's authorization under chapter 142E is resolved. If the center also requests reconsideration of the decertification, the center must do so according to subdivision 2, paragraph (a). The final decision on reconsideration is stayed until the appeal of the center's authorization under chapter 142E is resolved.",
	"repealed": false
}