{
	"id": "62Q.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.37",
	"title": "62Q.37 AUDITS CONDUCTED BY INDEPENDENT ORGANIZATION.",
	"text": "This section applies only to (1) a nonprofit health service plan corporation operating under chapter 62C; (2) a health maintenance organization operating under chapter 62D; (3) a community integrated service network operating under chapter 62N; and (4) managed care organizations operating under chapter 256B or 256L.\n(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Commissioner\" means the commissioner of health for purposes of regulating health maintenance organizations and community integrated service networks, the commissioner of commerce for purposes of regulating nonprofit health service plan corporations, or the commissioner of human services for the purpose of contracting with managed care organizations serving persons enrolled in programs under chapter 256B or 256L.\n(c) \"Health plan company\" means (1) a nonprofit health service plan corporation operating under chapter 62C; (2) a health maintenance organization operating under chapter 62D; (3) a community integrated service network operating under chapter 62N; or (4) a managed care organization operating under chapter 256B or 256L.\n(d) \"Nationally recognized independent organization\" means (1) an organization that sets specific national standards governing health care quality assurance processes, utilization review, provider credentialing, marketing, and other topics covered by this chapter and other chapters and audits and provides accreditation to those health plan companies that meet those standards. The American Accreditation Health Care Commission (URAC), the National Committee for Quality Assurance (NCQA), the Joint Commission on Accreditation of Healthcare Organizations (JCAHO), and the Accreditation Association for Ambulatory Health Care (AAAHC) are, at a minimum, defined as nationally recognized independent organizations; and (2) the Centers for Medicare and Medicaid Services for purposes of reviews or audits conducted of health plan companies under Part C of Title XVIII of the Social Security Act or under section 1876 of the Social Security Act.\n(e) \"Performance standard\" means those standards relating to quality management and improvement, access and availability of service, utilization review, provider selection, provider credentialing, marketing, member rights and responsibilities, complaints, appeals, grievance systems, enrollee information and materials, enrollment and disenrollment, subcontractual relationships and delegation, confidentiality, continuity and coordination of care, assurance of adequate capacity and services, coverage and authorization of services, practice guidelines, health information systems, and financial solvency.\n(a) The commissioner may conduct routine audits and investigations as prescribed under the commissioner's respective state authorizing statutes. If a nationally recognized independent organization has conducted an audit of the health plan company using audit procedures that are comparable to or more stringent than the commissioner's audit procedures:\n(1) the commissioner shall accept the independent audit, including standards and audit practices, and require no further audit if the results of the independent audit show that the performance standard being audited meets or exceeds state standards;\n(2) the commissioner may accept the independent audit and limit further auditing if the results of the independent audit show that the performance standard being audited partially meets state standards;\n(3) the health plan company must demonstrate to the commissioner that the nationally recognized independent organization that conducted the audit is qualified and that the results of the audit demonstrate that the particular performance standard partially or fully meets state standards; and\n(4) if the commissioner has partially or fully accepted an independent audit of the performance standard, the commissioner may use the finding of a deficiency with regard to statutes or rules by an independent audit as the basis for a targeted audit or enforcement action.\n(b) If a health plan company has formally delegated activities that are required under either state law or contract to another organization that has undergone an audit by a nationally recognized independent organization, that health plan company may use the nationally recognized accrediting body's determination on its own behalf under this section.\nThe health plan company shall:\n(1) request that the nationally recognized independent organization provide to the commissioner a copy of the current nationally recognized independent organization's standards upon which the acceptable accreditation status has been granted; and\n(2) provide the commissioner a copy of the most current final audit report issued by the nationally recognized independent organization.\n[Repealed, 2013 c 84 art 1 s 94]\nNothing in this section precludes the commissioner from conducting audits and investigations or requesting data as granted under the commissioner's respective state authorizing statutes.\nThe commissioner of human services shall implement this section in a manner that is consistent with applicable federal laws and regulations and that avoids the duplication of review activities performed by a nationally recognized independent organization.\nAny documents provided to the commissioner related to the audit report that may be accepted under this section are private data on individuals pursuant to chapter 13 and may only be released as permitted under section 60A.03, subdivision 9.",
	"repealed": false
}