{
	"id": "582.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.32",
	"title": "582.32 VOLUNTARY FORECLOSURE; PROCEDURE.",
	"text": "This section applies to mortgages executed on or after August 1, 1993, under which there is a default and the mortgagor and mortgagee enter into an agreement for voluntary foreclosure of the mortgage under this section. This section applies only to mortgages on real estate no part of which is classified as a homestead under section 273.124 or in agricultural use as defined in section 40A.02, subdivision 3, as of the date of agreement.\n(a) As used in this section, the following terms have the meanings given:\n(b) \"Agreement\" means the agreement for voluntary foreclosure described in subdivision 3.\n(c) \"Date of agreement\" means the effective date of the agreement which shall not be sooner than the date on which the agreement is executed and acknowledged by both the mortgagor and mortgagee.\n(d) \"Junior lien\" means a lien subordinate to the lien of the mortgage foreclosed under this section, the holder of which has a redeemable interest in the real estate under section 580.24.\n(e) \"Mortgage\" means a recorded mortgage on real estate no part of which is classified as a homestead under section 273.124 or is in agricultural use as defined in section 40A.02, subdivision 3, as of the date of agreement.\n(f) \"Mortgagee\" means the record holders of the mortgage, whether one or more.\n(g) \"Mortgagor\" means the record holders, whether one or more, of the legal and equitable interest in the real estate encumbered by the mortgage.\n(h) \"Real estate\" means the real property encumbered by the mortgage.\n(a) Voluntary foreclosure may occur only in accordance with this section.\n(b) The mortgagor and mortgagee shall enter into a written agreement for voluntary foreclosure under this section only during the existence of a default under the mortgage. At least one of the items constituting the default must have been in existence for at least one month on the date of agreement. The agreement shall identify the mortgage by recording data and the real estate by legal description, specify the date of the agreement and provide that:\n(1) The mortgagor and mortgagee have agreed that the mortgage shall be voluntarily foreclosed with the mortgagor's redemption period reduced to two months as provided in this section.\n(2) The mortgagee waives any rights to a deficiency or other claim for personal liability against the mortgagor arising from the mortgage or the debt secured by the mortgage. This does not preclude an agreement between the mortgagor and mortgagee to a payment to the mortgagee as part of the voluntary foreclosure, or collection from a guarantor.\n(3) The mortgagor waives its right to surplus sale proceeds, to contest foreclosure, and to rents and occupancy during the period from the date of agreement through the redemption period.\n(4) The mortgagor consents to the appointment of a receiver for, or grants mortgagee possession of, the real estate and all rights of possession of the real estate, including, but not limited to operating, maintaining, and protecting the real estate, and the making of any additions or betterments to the real estate.\n(5) A default exists under the mortgage and on the date of agreement at least one of the items constituting the default has been in existence for at least one month.\n(c) Within seven days after the date of agreement, the mortgagee must record or file the agreement with the county recorder or registrar of titles, as appropriate, in each county where any part of the real estate is located. Filing or recording of a short form agreement signed by the mortgagor and mortgagee containing the following information satisfies this requirement:\n(1) the identity and mailing address of the mortgagor and mortgagee;\n(2) the legal description of the real estate;\n(3) the mortgage identified by recording data;\n(4) a statement that an event of default under the mortgage has existed for at least one month as of the date of agreement and foreclosure under this section has been agreed to by the parties; and\n(5) the date of agreement.\n(d) A certificate signed by the county or city assessor where the real estate is located, stating that, as of the date of agreement, the real estate was not in agricultural use as defined in section 40A.02, subdivision 3, and was not a homestead for property tax purposes under section 273.124, must be recorded before or with the certificate of sale in the office of the county recorder or registrar of titles where the real estate is located, and shall be prima facie evidence of the facts contained in the certificate.\n(e) Within ten days of receipt of a written request for information from a holder of a junior lien, the mortgagee, without charge, shall deliver or mail by first class mail postage prepaid, to the address of the holder set forth in the request, either the agreement or a written statement of the amount of money and the value or a detailed description of any property paid or transferred, or to be paid or transferred, by the parties to the agreement under the terms of the agreement. Failure to provide this information does not invalidate the foreclosure.\nMS 1992 [Repealed, 1993 c 40 s 11]\nThere is no right of reinstatement pursuant to section 580.30, of the mortgage after the date of agreement.\n(a) After the date of agreement, the mortgagee may proceed to foreclose the mortgage in accordance with the laws generally applicable to foreclosure by advertisement including this chapter and chapter 580, except as otherwise provided in this section.\n(b) At least 14 days before the date of sale, the mortgagee shall:\n(1) serve the persons in possession of the real estate with notice of the voluntary foreclosure sale under this section in the same manner as in a foreclosure by advertisement as provided in section 580.03; and\n(2) mail notice of the voluntary foreclosure sale under this section to each holder of a junior lien who has filed or recorded a request for notice under section 580.032.\n(c) The mortgagee shall publish notice of the voluntary foreclosure sale under this section in the same manner as in a foreclosure by advertisement as provided in section 580.03 for four consecutive weeks. The notice must include all information required under section 580.04, clauses (1) to (6), the date of agreement, and shall state that each holder of a junior lien may redeem in the order and manner provided in subdivision 9, beginning after the expiration of the mortgagor's redemption period under this section.\n(d) The mortgagor's redemption period is two months from the date of sale, except that if the real estate is subject to a federal tax lien under which the United States is entitled to a 120-day redemption period under section 7425(d)(1) of the Internal Revenue Code, as amended, the mortgagor's redemption period is 120 days from the date of sale. The certificate of sale must indicate the redemption period applicable under this paragraph.\nExcept as provided in this section, the foreclosure sale must be conducted and the certificate of sale shall be made and recorded in accordance with a foreclosure by advertisement as provided in chapter 580. The certificate of sale must be filed or recorded within five days after the sale. Affidavits of service, mailing, publication, and other affidavits or certificates permitted by chapter 580, must be recorded with the certificate of sale, or within five days after the sale, in the office of the county recorder or registrar of titles where the real estate is located, and when so recorded are prima facie evidence of the facts contained in them.\nMS 1992 [Repealed, 1993 c 40 s 11]\nMS 1992 [Repealed, 1993 c 40 s 11]\nA person holding a junior lien upon the real estate or some part of the real estate may redeem in the order and manner specified in sections 580.24 and 580.25, but only if before the end of the mortgagor's redemption period under this section the creditor files with the county recorder or registrar of titles of each county where the real estate is located, a notice of intention to redeem. If a junior creditor fails to timely file a notice of intention to redeem as provided in this subdivision, or fails to redeem, its lien on the real estate is extinguished.",
	"repealed": false
}