{
	"id": "609.2241",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.2241",
	"title": "609.2241 KNOWING TRANSFER OF COMMUNICABLE DISEASE.",
	"text": "As used in this section, the following terms have the meanings given:\n(a) \"Communicable disease\" means a disease or condition that causes serious illness, serious disability, or death; the infectious agent of which may pass or be carried from the body of one person to the body of another through direct transmission.\n(b) \"Direct transmission\" means predominately sexual or blood-borne transmission.\n(c) \"A person who knowingly harbors an infectious agent\" refers to a person who receives from a physician or other health professional:\n(1) advice that the person harbors an infectious agent for a communicable disease;\n(2) educational information about behavior which might transmit the infectious agent; and\n(3) instruction of practical means of preventing such transmission.\n(d) \"Transfer\" means to engage in behavior that has been demonstrated epidemiologically to be a mode of direct transmission of an infectious agent which causes the communicable disease.\n(e) \"Sexual penetration\" means any of the acts listed in section 609.341, subdivision 12, when the acts described are committed without the use of a latex or other effective barrier.\nIt is a crime, which may be prosecuted under section 609.17, 609.185, 609.19, 609.221, 609.222, 609.223, 609.2231, or 609.224, for a person who knowingly harbors an infectious agent to transfer, if the crime involved:\n(1) sexual penetration with another person without having first informed the other person that the person has a communicable disease;\n(2) transfer of blood, sperm, organs, or tissue, except as deemed necessary for medical research or if disclosed on donor screening forms; or\n(3) sharing of nonsterile syringes or needles for the purpose of injecting drugs.\nIt is an affirmative defense to prosecution, if it is proven by a preponderance of the evidence, that:\n(1) the person who knowingly harbors an infectious agent for a communicable disease took practical means to prevent transmission as advised by a physician or other health professional; or\n(2) the person who knowingly harbors an infectious agent for a communicable disease is a health care provider who was following professionally accepted infection control procedures.\nNothing in this section shall be construed to be a defense to a criminal prosecution that does not allege a violation of subdivision 2.\nData protected by section 13.3805, subdivision 1, and information collected as part of a Health Department investigation under sections 144.4171 to 144.4186 may not be accessed or subpoenaed by law enforcement authorities or prosecutors without the consent of the subject of the data.",
	"repealed": false
}