{
	"id": "148.5194",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.5194",
	"title": "148.5194 FEES.",
	"text": "The commissioner shall prorate the licensure fee for clinical fellowship, doctoral externship, temporary, and first time licensees according to the number of months that have elapsed between the date the license is issued and the date the license expires or must be renewed under section 148.5191, subdivision 4.\n(a) The fee for initial licensure for a speech-language pathologist is $210.50.\n(b) The fee for clinical fellowship licensure, doctoral externship, temporary license, or renewal for a speech-language pathologist is $200.\n(a) The fee for initial dual licensure as a speech-language pathologist and audiologist is $523.\n(b) The fee for clinical fellowship licensure, doctoral externship, temporary license, or renewal for dual licensure as a speech-language pathologist and audiologist is $510.\n[Repealed, 1Sp2003 c 14 art 7 s 89]\nThe fee for initial licensure as a speech-language pathology assistant is $493. The fee for licensure renewal for a speech-language pathology assistant is $493.\n[See Note.]\nThe penalty fee for late submission of a renewal application is $60.\nAll fees are nonrefundable. The commissioner shall only use fees collected under this section for the purposes of administering this chapter. The legislature must not transfer money generated by these fees from the state government special revenue fund to the general fund.\nThe fee for written verification of credentialed status is $25.\nThe licensure fee for initial applicants is $523. The biennial licensure fee for audiologists for clinical fellowship, doctoral externship, temporary, and renewal licenses is $510.\nSpeech-language pathologists who were licensed prior to January 1, 2018, shall pay a onetime surcharge of $10.50 to renew when their license first expires after January 1, 2020. Audiologists who were licensed before January 1, 2018, shall pay a onetime surcharge of $13 to renew when their license first expires after January 1, 2020. The surcharge shall cover the commissioner's costs associated with criminal background checks.\n(a) The penalty fee for practicing speech-language pathology or audiology, practicing as a speech-language pathology assistant, or using protected titles without a current license after the credential has expired and before it is renewed is the amount of the license renewal fee for any part of the first month, plus the license renewal fee for any part of any subsequent month up to 36 months.\n(b) The penalty fee for applicants who engage in the unauthorized practice of speech-language pathology or audiology, practice as a speech-language pathology assistant, or use of protected titles before being issued a license is the amount of the license application fee for any part of the first month, plus the license application fee for any part of any subsequent month up to 36 months. This paragraph does not apply to applicants not qualifying for a license who engage in the unauthorized practice of speech-language pathology or audiology or in the unauthorized practice as a speech-language pathology assistant.\n(c) The penalty fee for practicing speech-language pathology or audiology and failing to submit a continuing education report by the due date with the correct number or type of hours in the correct time period is $100 plus $20 for each missing clock hour. The penalty fee for a licensed speech-language pathology assistant who fails to submit a continuing education report by the due date with the correct number or type of hours in the correct time period is $100 plus $20 for each missing clock hour. \"Missing\" means not obtained between the effective and expiration dates of the certificate, the one-month period following the certificate expiration date, or the 30 days following notice of a penalty fee for failing to report all continuing education hours. The licensee must obtain the missing number of continuing education hours by the next reporting due date.\n(d) Civil penalties and discipline incurred by licensees prior to August 1, 2005, for conduct described in paragraph (a), (b), or (c) shall be recorded as nondisciplinary penalty fees. For conduct described in paragraph (a) or (b) occurring after August 1, 2005, and exceeding six months, payment of a penalty fee does not preclude any disciplinary action reasonably justified by the individual case.\n[See Note.]",
	"repealed": false
}