{
	"id": "142A.607",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.607",
	"title": "142A.607 ASSESSMENTS.",
	"text": "(a) Each child eligible under sections 142A.604 to 142A.606, must be assessed to determine the benefits the child may receive under section 142A.609, in accordance with the assessment tool, process, and requirements specified in subdivision 2.\n(b) If an agency applies the emergency foster care rate for initial placement under section 142A.609, the agency may wait up to 30 days to complete the initial assessment.\n(c) Unless otherwise specified in paragraph (d), a child must be assessed at the basic level, level B, or one of ten supplemental difficulty of care levels, levels C to L.\n(d) An assessment must not be completed for:\n(1) a child eligible for Northstar adoption assistance under section 142A.606 who is determined to be an at-risk child. A child under this clause must be assigned level A under section 142A.609, subdivision 1; and\n(2) a child transitioning into Northstar Care for Children under section 142A.612, subdivision 7, unless the commissioner determines an assessment is appropriate.\nConsistent with sections 142A.60 to 142A.612, the commissioner shall establish an assessment tool to determine the basic and supplemental difficulty of care, and shall establish the process to be followed and other requirements, including appropriate documentation, when conducting the initial assessment of a child entering Northstar Care for Children or when the special assessment and reassessments may be needed for children continuing in the program. The assessment tool must take into consideration the strengths and needs of the child and the extra parenting provided by the caregiver to meet the child's needs.\nThe commissioner, in consultation with representatives from communities of color, including but not limited to advisory councils and ombudspersons, shall review and revise the MAPCY tool and incorporate changes that take into consideration different cultures and the diverse needs of communities of color.\n(a) The assessment tool established under subdivision 2 must include consideration of the caregiver's need for child care under this subdivision, with greater consideration for children of younger ages.\n(b) The child's assessment must include consideration of the caregiver's need for child care if the following criteria are met:\n(1) the child is under age 13;\n(2) all available adult caregivers are employed or attending educational or vocational training programs; and\n(3) the caregiver does not receive child care assistance for the child under chapter 142E.\n(c) For children younger than seven years of age, the level determined by the non-child care portions of the assessment must be adjusted based on the average number of hours child care is needed each week due to employment or attending a training or educational program as follows:\n(1) fewer than ten hours or if the caregiver is participating in the child care assistance program under chapter 119B, no adjustment;\n(2) ten to 19 hours or if needed during school summer vacation or equivalent only, increase one level;\n(3) 20 to 29 hours, increase two levels;\n(4) 30 to 39 hours, increase three levels; and\n(5) 40 or more hours, increase four levels.\n(d) For children at least seven years of age but younger than 13, the level determined by the non-child care portions of the assessment must be adjusted based on the average number of hours child care is needed each week due to employment or attending a training or educational program as follows:\n(1) fewer than 20 hours, needed during school summer vacation or equivalent only, or if the caregiver is participating in the child care assistance program under chapter 142E, no adjustment;\n(2) 20 to 39 hours, increase one level; and\n(3) 40 or more hours, increase two levels.\n(e) When the child attains the age of seven, the child care allowance must be reduced by reducing the level to that available under paragraph (d). For children in foster care, benefits under section 142A.609 must be automatically reduced when the child turns seven. For children who receive Northstar kinship assistance or adoption assistance, agreements must include similar provisions to ensure that the benefit provided to these children does not exceed the benefit provided to children in foster care.\n(f) When the child attains the age of 13, the child care allowance must be eliminated by reducing the level to that available prior to any consideration of the caregiver's need for child care. For children in foster care, benefits under section 142A.609 must be automatically reduced when the child attains the age of 13. For children who receive Northstar kinship assistance or adoption assistance, agreements must include similar provisions to ensure that the benefit provided to these children does not exceed the benefit provided to children in foster care.\n(g) The child care allowance under this subdivision is not available to caregivers who receive the child care assistance under chapter 142E. A caregiver receiving a child care allowance under this subdivision must notify the commissioner if the caregiver subsequently receives the child care assistance program under chapter 142E, and the level must be reduced to that available prior to any consideration of the caregiver's need for child care.\n(h) In establishing the assessment tool under subdivision 2, the commissioner must design the tool so that the levels applicable to the non-child care portions of the assessment at a given age accommodate the requirements of this subdivision.\n(a) The assessment tool established under subdivision 2 must provide a mechanism through which up to five levels can be added to the supplemental difficulty of care for a particular child under section 142A.609, subdivision 4. In establishing the assessment tool, the commissioner must design the tool so that the levels applicable to the portions of the assessment other than the extraordinary levels can accommodate the requirements of this subdivision.\n(b) These extraordinary levels are available when all of the following circumstances apply:\n(1) the child has extraordinary needs as determined by the assessment tool provided for under subdivision 2, and the child meets other requirements established by the commissioner, such as a minimum score on the assessment tool;\n(2) the child's extraordinary needs require extraordinary care and intense supervision that is provided by the child's caregiver as part of the parental duties as described in the supplemental difficulty of care rate, section 142A.602, subdivision 22. This extraordinary care provided by the caregiver is required so that the child can be safely cared for in the home and community, and prevents residential placement;\n(3) the child is physically living in a foster family setting, as defined in Minnesota Rules, part 2960.3010, subpart 23, or physically living in the home with the adoptive parent or relative custodian; and\n(4) the child is receiving the services for which the child is eligible through medical assistance programs or other programs that provide necessary services for children with disabilities or other medical and behavioral conditions to live with the child's family, but the agency with caregiver's input has identified a specific support gap that cannot be met through home and community support waivers or other programs that are designed to provide support for children with special needs.\n(c) The agency completing an assessment, under subdivision 2, that suggests an extraordinary level must document as part of the assessment, the following:\n(1) the assessment tool that determined that the child's needs or disabilities require extraordinary care and intense supervision;\n(2) a summary of the extraordinary care and intense supervision that is provided by the caregiver as part of the parental duties as described in the supplemental difficulty of care rate, section 142A.602, subdivision 22;\n(3) confirmation that the child is currently physically residing in the home with the foster parent, adoptive parent, or relative custodian;\n(4) the efforts of the agency, caregiver, parents, and others to request support services in the home and community that would ease the degree of parental duties provided by the caregiver for the care and supervision of the child. This would include documentation of the services provided for the child's needs or disabilities, and the services that were denied or not available from the local social service agency, community agency, the local school district, local public health department, the parent, or child's medical insurance provider;\n(5) the specific support gap identified that places the child's safety and well-being at risk in the home or community and is necessary to prevent residential placement; and\n(6) the extraordinary care and intense supervision provided by the foster, adoptive, or guardianship caregivers to maintain the child safely in the child's home and prevent residential placement that cannot be supported by medical assistance or other programs that provide services, necessary care for children with disabilities, or other medical or behavioral conditions in the home or community.\n(d) An agency completing an assessment under subdivision 2 that suggests an extraordinary level is appropriate must forward the assessment and required documentation to the commissioner. If the commissioner approves, the extraordinary levels must be retroactive to the date the assessment was forwarded.\nFor a child entering Northstar Care for Children under section 142A.604, the initial assessment must be completed within 30 days after the child is placed in foster care.\n(a) The assessment must be completed in consultation with the child's caregiver. Face-to-face contact with the caregiver is not required to complete the assessment.\n(b) Initial assessments are completed for foster children, eligible under section 142A.604.\n(c) The initial assessment must be completed by the financially responsible agency, in consultation with the legally responsible agency if different, within 30 days of the child's placement in foster care.\n(d) If the foster parent is unable or unwilling to cooperate with the assessment process, the child shall be assigned the basic level, level B under section 142A.609, subdivision 3.\n(e) Notice to the foster parent shall be provided as specified in subdivision 13.\n(a) A special assessment is required as part of the negotiation of the Northstar kinship assistance agreement under section 142A.605 if:\n(1) the child was not placed in foster care with the prospective relative custodian or custodians prior to the negotiation of the Northstar kinship assistance agreement under section 142A.608; or\n(2) any requirement for reassessment under subdivision 10 is met.\n(b) A special assessment is required as part of the negotiation of the adoption assistance agreement under section 142A.606 if:\n(1) the child was not placed in foster care with the prospective adoptive parent or parents prior to the negotiation of the adoption assistance agreement under section 142A.608; or\n(2) any requirement for reassessment under subdivision 10 is met.\n(c) A special assessment is required when a child transitions from a pre-Northstar Care for Children program into Northstar Care for Children if the commissioner determines that a special assessment is appropriate instead of assigning the transition child to a level under section 142A.612.\n(d) The special assessment must be completed prior to the establishment of a Northstar kinship assistance or adoption assistance agreement on behalf of the child.\n(a) The special assessment must be completed in consultation with the child's caregiver. Face-to-face contact with the caregiver is not required to complete the special assessment.\n(b) If a new special assessment is required prior to the effective date of the Northstar kinship assistance agreement, it must be completed by the financially responsible agency, in consultation with the legally responsible agency if different. If the prospective relative custodian is unable or unwilling to cooperate with the special assessment process, the child shall be assigned the basic level, level B under section 142A.609, subdivision 3.\n(c) If a special assessment is required prior to the effective date of the adoption assistance agreement, it must be completed by the financially responsible agency, in consultation with the legally responsible agency if different. If there is no financially responsible agency, the special assessment must be completed by the agency designated by the commissioner. If the prospective adoptive parent is unable or unwilling to cooperate with the special assessment process, the child must be assigned the basic level, level B under section 142A.609, subdivision 3, unless the child is known to be an at-risk child, in which case, the child shall be assigned level A under section 142A.609, subdivision 1.\n(d) Notice to the prospective relative custodians or prospective adoptive parents must be provided as specified in subdivision 14.\nReassessments for an eligible child must be completed within 30 days of any of the following events:\n(1) for a child in continuous foster care, when six months have elapsed since the initial assessment, and annually thereafter;\n(2) for a child in continuous foster care, change of placement location;\n(3) for a child in foster care, at the request of the financially responsible agency or legally responsible agency;\n(4) at the request of the commissioner; or\n(5) at the request of the caregiver under subdivision 11.\n(a) A caregiver may initiate a reassessment request for an eligible child in writing to the financially responsible agency or, if there is no financially responsible agency, the agency designated by the commissioner. The written request must include the reason for the request and the name, address, and contact information of the caregivers. The caregiver may request a reassessment if at least six months have elapsed since any previous assessment or reassessment. For an eligible foster child, a foster parent may request reassessment in less than six months with written documentation that there have been significant changes in the child's needs that necessitate an earlier reassessment.\n(b) A caregiver may request a reassessment of an at-risk child for whom an adoption assistance agreement has been executed if the caregiver has satisfied the commissioner with written documentation from a qualified expert that the potential disability upon which eligibility for the agreement was based has manifested itself, consistent with section 142A.608, subdivision 4, paragraph (b).\n(c) If the reassessment cannot be completed within 30 days of the caregiver's request, the agency responsible for reassessment must notify the caregiver of the reason for the delay and a reasonable estimate of when the reassessment can be completed.\n(d) Notwithstanding any provision to the contrary in paragraph (a) or subdivision 10, when a Northstar kinship assistance agreement or adoption assistance agreement under section 142A.608 has been signed by all parties, no reassessment may be requested or conducted until the court finalizes the transfer of permanent legal and physical custody or finalizes the adoption.\n(a) The reassessment must be completed in consultation with the child's caregiver. Face-to-face contact with the caregiver is not required to complete the reassessment.\n(b) For foster children eligible under section 142A.604, reassessments must be completed by the financially responsible agency, in consultation with the legally responsible agency if different.\n(c) If reassessment is required after the effective date of the Northstar kinship assistance agreement, the reassessment must be completed by the financially responsible agency.\n(d) If a reassessment is required after the effective date of the adoption assistance agreement, it must be completed by the financially responsible agency or, if there is no financially responsible agency, the agency designated by the commissioner.\n(e) If the child's caregiver is unable or unwilling to cooperate with the reassessment, the child must be assessed at level B under section 142A.609, subdivision 3, unless the child has a Northstar adoption assistance agreement and is known to be an at-risk child, in which case the child must be assessed at level A under section 142A.609, subdivision 1.\n(a) Any agency completing initial assessments, special assessments, or reassessments must designate one or more supervisors or other staff to examine and approve assessments completed by others in the agency under subdivision 2. The person approving an assessment must not be the case manager or staff member completing that assessment.\n(b) In cases where a special assessment or reassessment for Northstar kinship assistance and adoption assistance is required under subdivision 9 or 12, the commissioner shall review and approve the assessment as part of the eligibility determination process outlined in section 142A.605, subdivision 7, for Northstar kinship assistance, or section 142A.606, subdivision 7, for adoption assistance. The assessment determines the maximum of the negotiated agreement amount under section 142A.608.\n(c) The effective date of the new rate is determined as follows:\n(1) for initial assessments of children in foster care, the new rate is effective based on the emergency foster care rate for initial placement pursuant to section 142A.609, subdivision 6;\n(2) for special assessments, the new rate is effective on the date of the finalized adoption decree or the date of the court order that transfers permanent legal and physical custody to a relative;\n(3) for postpermanency reassessments, the new rate is effective on the date that the commissioner signs the amendment to the Northstar Adoption Assistance or Northstar Kinship Assistance benefit agreement.\n(a) The agency as defined in subdivision 7 or 12 that is responsible for completing the initial assessment or reassessment must provide the child's caregiver with written notice of the initial assessment or reassessment.\n(b) Initial assessment notices must be sent within 15 days of completion of the initial assessment and must minimally include the following:\n(1) a summary of the child's completed individual assessment used to determine the initial rating;\n(2) statement of rating and benefit level;\n(3) statement of the circumstances under which the agency must reassess the child;\n(4) procedure to seek reassessment;\n(5) notice that the caregiver has the right to a fair hearing review of the assessment and how to request a fair hearing, consistent with section 256.045, subdivision 3; and\n(6) the name, telephone number, and email, if available, of a contact person at the agency completing the assessment.\n(c) Reassessment notices must be sent within 15 days after the completion of the reassessment and must minimally include the following:\n(1) a summary of the child's individual assessment used to determine the new rating;\n(2) any change in rating and its effective date;\n(3) procedure to seek reassessment;\n(4) notice that if a change in rating results in a reduction of benefits, the caregiver has the right to a fair hearing review of the assessment and how to request a fair hearing consistent with section 256.045, subdivision 3;\n(5) notice that a caregiver who requests a fair hearing of the reassessed rating within ten days may continue at the current rate pending the hearing, but the agency may recover any overpayment; and\n(6) name, telephone number, and email, if available, of a contact person at the agency completing the reassessment.\n(d) Notice is not required for special assessments since the notice is part of the Northstar kinship assistance or adoption assistance negotiated agreement completed according to section 142A.608.\nThe assessment tool established by the commissioner in subdivision 2 determines the monthly benefit level for children in foster care. The monthly payment for Northstar kinship assistance or adoption assistance may be negotiated up to the monthly benefit level under foster care for those children eligible for a payment under section 142A.609, subdivision 1.",
	"repealed": false
}