{
	"id": "221.033",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.033",
	"title": "221.033 REGULATION OF HAZARDOUS MATERIALS.",
	"text": "Except as provided in this section, no person may transport or offer or accept for transportation within the state of Minnesota a hazardous material, hazardous substance, or hazardous waste except in compliance with United States Code, title 49, sections 5101 to 5126 and the provisions of Code of Federal Regulations, title 49, parts 171 to 199, which are incorporated by reference. Those provisions apply to transportation in intrastate commerce to the same extent they apply to transportation in interstate commerce.\n(a) This subdivision applies to persons engaged in intrastate commerce.\n(b) Farmers or their employees transporting diesel fuel, gasoline, agricultural chemicals, or agricultural fertilizers for use on the transporter's farm are not required to comply with the rules incorporated in section 221.0314, subdivisions 2 to 5, for driver qualifications or with the shipping paper requirements of the Code of Federal Regulations, title 49, section 172.200, 177.817, or 397.7, paragraph (b), of the Federal Motor Carrier Safety Regulations when:\n(1) transporting diesel fuel or gasoline in motorized tank truck vehicles of less than 1,500-gallon capacity owned by the transporter, or in tanks securely mounted in other motor vehicles with a gross vehicle weight of less than 10,000 pounds and owned by the transporter; or\n(2) transporting agricultural chemicals and agricultural fertilizers.\n(a) This subdivision applies to persons engaged in intrastate commerce.\n(b) Fertilizer and agricultural chemical retailers or their employees are exempt from the rule in section 221.0314, subdivision 4, requiring that drivers must be at least 21 years of age when:\n(1) the retailer or its employee is transporting fertilizer or agricultural chemicals directly to a farm for on-farm use within a radius of 50 miles of the retailer's business location; and\n(2) the driver employed by the retailer is at least 18 years of age.\n(a) The requirements in Code of Federal Regulations, title 49, sections 180.405, paragraphs (b), (c), (g), (h), and (j) and 180.407, paragraphs (c), (d), clause (1), (e), (f), (g), (h), and (i) do not apply to cargo tanks of up to 3,500 gallons capacity that transport gasoline in intrastate commerce if before providing transportation under this subdivision:\n(1) the owner or operator of the cargo tank provides the commissioner with evidence that the cargo tank was manufactured according to the cargo tank specification regulations in Code of Federal Regulations, title 49, sections 178.340 to 178.341-7, as amended through November 1, 1985;\n(2) a copy of the evidence described in clause (1) is kept in the vehicle to which the cargo tank is attached; and\n(3) the manufacturer's metal certification plate is removed from the cargo tank or covered.\n(b) A cargo tank operated under this subdivision must:\n(1) be visually inspected annually by a person authorized to perform such inspections under Code of Federal Regulations, title 49, section 180.409, and a copy of the annual inspection must be kept in the vehicle; and\n(2) be visually inspected monthly by the operator in a manner prescribed by the commissioner, and a copy of each monthly inspection must be kept at the operator's principal place of business for at least one year beyond the date of the inspection.\n(c) No person may operate a cargo tank described in this subdivision that (1) violates paragraph (a) or (b), or (2) leaks gasoline from any portion of the tank that regularly contains gasoline.\n(d) The commissioner shall keep a record of persons who provide the evidence described in this subdivision.\nMS 2022 [Repealed, 2024 c 104 art 1 s 110]\nA driver of a self-propelled or towed motor vehicle transporting no hazardous material other than materials of trade, as defined in Code of Federal Regulations, title 49, section 171.8, when engaged in intrastate transportation, must be at least 18 years of age. This subdivision does not apply unless the transportation conforms to the requirements of Code of Federal Regulations, title 49, section 173.6.\n(a) This subdivision applies to intrastate commerce.\n(b) A driver who operates a motorized tank truck vehicle with a capacity of less than 3,500 gallons that is used to transport petroleum products must have a valid commercial driver's license with endorsements for hazardous materials and tank vehicles and be at least 18 years of age.\n(c) A driver who operates a vehicle that is used to transport liquefied petroleum gases in nonbulk or bulk packaging as defined in Code of Federal Regulations, title 49, section 171.8, including the transportation of consumer storage tanks in compliance with Code of Federal Regulations, title 49, section 173.315(j), must have a valid commercial driver's license with a hazardous materials endorsement and be at least 18 years of age.\n(d) A driver who operates a vehicle under paragraph (c) must also have a tank vehicle endorsement if the aggregate capacity of the bulk packaging being transported is 1,000 gallons or more.\n(e) Nonbulk or bulk packaging transported under paragraph (c) must have an aggregate capacity of less than 3,500 gallons.\n[Repealed, 2004 c 225 s 15]\nMS 1992 [Repealed, 1994 c 589 s 8]\nMS 1996 [Repealed, 1998 c 310 s 8]",
	"repealed": false
}