{
	"id": "18B.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.28",
	"title": "18B.28 EXPERIMENTAL USE PESTICIDE PRODUCT REGISTRATION.",
	"text": "A person may not use or distribute an experimental use pesticide product in the state until it is registered with the commissioner. Experimental use pesticide product registrations expire on December 31 of each year and may be renewed on or before that date. A substance or mixture of substances being tested only to determine its potential efficacy as a pesticide, or to determine its toxicity or other properties, and not requiring the issuance of an experimental use permit under United States Environmental Protection Agency criteria specified in federal regulations, is not required to be registered.\n(a) After reviewing the application accompanied by the application fee, the commissioner may issue an experimental use pesticide product registration if the commissioner determines that the applicant needs the registration to accumulate information necessary to register a pesticide under section 18B.26. The commissioner may prescribe terms, conditions, and a limited period of time for the experimental use product registration. After an experimental use pesticide product registration is issued, the commissioner may revoke or modify the registration at any time if the commissioner finds that its terms or conditions are being violated or are inadequate to avoid unreasonable adverse effects on the environment.\n(b) The commissioner may deny issuance of an experimental use pesticide product registration permit if the commissioner determines that issuance of a registration is not warranted or that the use to be made of the pesticide under the proposed terms and conditions may cause unreasonable adverse effects on the environment.\nA person must file an application for experimental use pesticide product registration with the commissioner. An application to register an experimental use pesticide product must include:\n(1) the name and address of the applicant;\n(2) a copy of the United States Environmental Protection Agency permit;\n(3) a description of the purpose or objectives of the experimental use;\n(4) a copy of the experimental use pesticide labeling accepted by the United States Environmental Protection Agency;\n(5) the name, address, and telephone number of cooperators or participants in this state;\n(6) the amount of material to be shipped or used in this state;\n(7) information about any intentionally added PFAS in the product, including PFAS ingredients, amount, chemical structure, analytical methods, and purposes for which PFAS are used in the product, including in any product components; and\n(8) other information requested by the commissioner.\n(a) An application for registration of an experimental use pesticide product must be accompanied by a nonrefundable application fee of $150.\n(b) An additional fee of $200 must be paid by the applicant for each pesticide distributed or used in the state before an initial experimental use pesticide product registration was issued for the pesticide.\nBefore approving the issuance of an experimental use pesticide product registration under this section, the commissioner must convene and consider the advice of a panel of outside scientific and health experts. The panel must include but is not limited to representatives of the Department of Health, the Department of Natural Resources, the Pollution Control Agency, and the University of Minnesota.",
	"repealed": false
}