{
	"id": "29.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/29.22",
	"title": "29.22 EGG HANDLERS ANNUAL INSPECTION FEE; DISPOSITION OF FEES.",
	"text": "[Repealed, 1971 c 339 s 27]\nIn addition to the annual food handler's license, required under section 28A.04, there is an annual inspection fee applicable to every person who engages in the business of buying for resale, selling, or trading in eggs except a retail grocer who sells eggs previously candled and graded. The fee must be computed on the basis of the number of cases of shell eggs handled at each place of business during the highest volume month of each licensing year. If a given lot of eggs is moved from one location of business to a second location of business and the food handler's license is held by the same person at both locations, the given lot of eggs must be counted in determining the volume of business on which the inspection fee is based at the first location of business but must not enter into the computation of volume of business for the second location. For the purpose of determining fees, \"case\" means one of 30 dozen capacity. The schedule of fees is as follows:\nEach person subject to the inspection fee in this section shall, under the direction of the commissioner, keep records necessary to accurately determine the volume of shell eggs on which the inspection fee is due and shall prepare annually a written report of the volume upon forms supplied by the commissioner. This report, together with the required inspection fee, must be filed with the department on or before the last day of May of each year.\nThe commissioner has general supervisory powers over the candlers and graders of eggs and may conduct, in collaboration with the College of Agriculture and the Extension Service of the University of Minnesota, an educational and training program to improve the efficiency and quality of the work done by candlers.\nAny person engaged in the business of breaking eggs for resale shall at all times comply with the rules of the department in respect to the conduct of that business. The commissioner shall collect from each egg breaking plant laboratory fees for routine analysis and full reimbursement for services performed by a state inspector assigned to that plant on a continuous basis under section 29.27.\nAll fees collected and all fines paid for a violation of sections 29.21 to 29.27 or rules promulgated under those sections, as well as all license fees and penalties must be deposited in the agricultural fund, and credited to a separate account to be known as the egg law inspection account, which is hereby created, set aside, and appropriated as a revolving account to be used by the department to help defray the expense of inspection, supervision, and enforcement of sections 29.21 to 29.27 and is in addition to and not in substitution for the sums regularly appropriated or otherwise made available for this purpose to the department.",
	"repealed": false
}