{
	"id": "72B.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/72B.041",
	"title": "72B.041 RESIDENT ADJUSTER LICENSE PROCEDURE AND REQUIREMENTS; EXAMINATIONS; FEES.",
	"text": "(a) An individual applying for a resident adjuster license must make application to the commissioner on the appropriate National Association of Insurance Commissioners (NAIC) Uniform Individual Application in a format prescribed by the commissioner and declare under penalty of suspension, revocation, or refusal of the license that the statements made in the application are true, correct, and complete to the best of the individual's knowledge and belief. Before approving the application, the commissioner must find that the individual:\n(1) is at least 18 years of age;\n(2) is eligible to designate this state as the individual's home state;\n(3) is trustworthy, reliable, and of good reputation, evidence of which must be determined by the commissioner;\n(4) has not committed any act that is a ground for probation, suspension, revocation, or refusal of an adjuster's license as set forth in section 72B.08;\n(5) has successfully passed the examination for the lines of authority for which the individual has applied; and\n(6) has paid the fees set forth in subdivision 9.\n(b) A business entity applying for a resident adjuster license must make application to the commissioner on the appropriate NAIC Uniform Business Entity Application in a format prescribed by the commissioner and declare under penalty of suspension, revocation, or refusal of the license that the statements made in the application are true, correct, and complete to the best of the business entity's knowledge and belief. Before approving the application, the commissioner shall find that the business entity:\n(1) is eligible to designate this state as its home state;\n(2) has designated a licensed independent or public adjuster responsible for the business entity's compliance with the insurance laws, rules, and regulations of this state;\n(3) has not committed an act that is a ground for probation, suspension, revocation, or refusal of an adjuster's license as set forth in section 72B.08; and\n(4) has paid the fees set forth in subdivision 9.\n(c) No resident of Canada may be licensed under this section or may designate Minnesota as the applicant's home state, unless the applicant has successfully passed the adjuster examination and has complied with the other applicable provisions of this section, except that such applicant shall not be subject to paragraph (a), clause (2), and section 270C.72, subdivision 4.\n(a) An individual applying for a resident independent or public adjuster license must:\n(1) consent to a criminal history record check;\n(2) submit a fingerprint card in a form acceptable to the commissioner; and\n(3) pay the fee required to perform criminal history record checks with the Minnesota Bureau of Criminal Apprehension and the Federal Bureau of Investigation.\n(b) The commissioner may contract for the collection and transmission of fingerprints required under this chapter and may order the fee for collecting and transmitting fingerprints to be payable directly to the contractor by the applicant. The commissioner may agree to a reasonable fingerprinting fee to be charged by the contractor.\n(c) The commissioner must treat and maintain an applicant's fingerprints and any criminal history record information obtained under this chapter as confidential and must apply security measures consistent with the standards specified by the Criminal Justice Information Services Division of the Federal Bureau of Investigation for the electronic storage of fingerprints and necessary identifying information. The commissioner must limit the use of records solely to the purposes authorized in this chapter. The fingerprints and any criminal history record information must not be subject to subpoena, other than one issued in a criminal action or investigation.\n(d) The commissioner may receive criminal history record information from another government agency in lieu of the Minnesota Bureau of Criminal Apprehension.\n(e) The commissioner may require any documents reasonably necessary to verify the information contained in the application.\n(f) All applicants for a license as a public adjuster must attach to their application evidence that the bonding requirement in subdivision 3 has been satisfied.\n(g) All executive officers and directors of a business entity applying for a resident independent adjuster license to adjust claims relating to portable electronics insurance claims relating to coverage regulated by section 60K.381 and all executive officers and directors of entities and any individuals owning, directly or indirectly, more than 50 percent of the outstanding voting securities of that applicant, are subject to the requirements of this subdivision, paragraphs (a) to (e).\nNo initial or renewal public adjuster's license shall be issued to any applicant unless there is on file with the commissioner a good and sufficient surety bond, issued by an insurer authorized to do business in this state. The bond shall be in the amount of $10,000 with the state of Minnesota as obligee, conditioned for the prompt payment to any person entitled thereto, other than a partner or associate of the applicant, of any amounts received by the applicant or to protect any person other than a partner or associate of the applicant from loss resulting from fraud, dishonesty, forgery or theft in connection with the applicant's duties under sections 72B.01 to 72B.136; provided, however, that the aggregate liability of the surety to all persons for all losses shall, in no event, exceed the amount of such bond. The bond shall remain in effect during the term of the license, or until the surety is released from liability by the commissioner, or until canceled by the surety. The surety may cancel a bond, without prejudice to any liability which occurred prior to the cancellation, by giving at least 30 days' written notice to the commissioner. In the event that the required bond is terminated, the public adjuster's license shall automatically be suspended until a new bond is filed with the commissioner.\n(a) An individual applying for an independent or public adjuster license under this chapter must pass a written examination unless exempt pursuant to subdivision 5. The examination must test the knowledge of the individual concerning the lines of authority for which application is made, the duties and responsibilities of an independent or public adjuster, and the insurance laws and regulations of this state. Examinations required by this subdivision must be developed and conducted under rules and regulations prescribed by the commissioner.\n(b) The commissioner may make arrangements, including contracting with an outside testing service, for administering examinations.\n(c) An individual who fails to appear for the examination as scheduled or fails to pass the examination must reapply for an examination and remit all required fees and forms before being rescheduled for another examination.\n(d) The commissioner may by rule determine the period of time between failure of an examination and reexamination.\n(e) A person shall not be eligible to take an examination if that person's license as an independent adjuster or public adjuster has been revoked in this or any other state within the three years next preceding the date of the application.\n(f) No examination shall be required for the timely renewal of a license, unless the license has been revoked.\n(a) An individual who applies for an adjuster license in this state who is or was licensed in another state for the same lines of authority based on an adjuster examination is not required to complete a prelicensing examination. This exemption is only available if the person is currently licensed in another state or if that state license has expired and the application is received by this state within 90 days of expiration. The applicant must provide certification from the other state that the applicant's license is currently in good standing or was in good standing at the time of expiration or certification from the other state that its producer database records, maintained by the NAIC, its affiliates, or its subsidiaries, indicate that the applicant or the applicant's company is or was licensed in good standing. The certification must be of a license with the same line of authority for which the individual has applied.\n(b) A person licensed as an adjuster in another state based on an adjuster examination who establishes legal residency in this state must make application within 90 days to become a resident adjuster licensee pursuant to this section, with the exception that no prelicensing examination is required of this person.\n(c) A person applying for a license as a crop hail adjuster shall not be required to comply with the requirements of subdivision 4.\n(d) A person applying for the crop line of authority who has satisfactorily completed the National Crop Insurance Services Crop Adjuster Proficiency Program or the loss adjustment training curriculum and competency testing required by the Federal Crop Insurance Corporation Standard Reinsurance Agreement is exempt from the requirements of subdivision 4.\n(a) Initial licenses issued to a business entity under this section are valid for a period not to exceed 24 months. Each initial license must expire on October 31 of the expiration year assigned by the commissioner. Initial licenses issued to an individual adjuster under this chapter before August 1, 2010, are valid for a period not to exceed 24 months and expire on October 31 of the renewal year assigned by the commissioner. Each individual license initially issued or initially renewed on or after August 1, 2010, must expire on the last day of the birth month of the adjuster in the year that will result in the term of the license being at least 12 months, but no more than 24 months. Beginning with the first license expiration on the last day of the birth month of an individual adjuster as set forth in this subdivision, all such licenses must after this date expire biennially on the last day of the birth month of the individual adjuster that is two years subsequent to the preceding expiration date.\n(b) Licenses issued under this section may be renewed upon the timely filing of an application for renewal.\nAn application for renewal of a license issued under sections 72B.01 to 72B.136 shall be on a form prescribed by the commissioner and shall be filed with the commissioner with payment of the renewal fee prior to the expiration date of the license.\nEach licensee or holder of a temporary permit shall give written notice to the commissioner of any change in name, or residence address not later than ten days after such change. The commissioner may, upon receipt of such notice, issue an amendment to the license incorporating such changes.\nA fee of $50 is imposed for each initial license or temporary permit and $50 for each renewal thereof or amendment thereto. A fee of $20 is imposed for the registration of each nonlicensed adjuster who is required to register under section 72B.06. All fees shall be transmitted to the commissioner and shall be payable to the Department of Commerce.\nAll executive officers and directors of a business entity applying for a nonresident independent adjuster license to adjust claims relating to portable electronics insurance claims relating to coverage regulated by section 60K.381 and all executive officers and directors of entities and any individuals owning, directly or indirectly, more than 50 percent of the outstanding voting securities of that applicant, are subject to the requirements of subdivision 2, paragraphs (a) to (e). A nonresident business entity whose home state subjects the applicant to requirements substantially similar to those under subdivision 2 is not required to comply with subdivision 2.",
	"repealed": false
}