{
	"id": "473.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.41",
	"title": "473.41 TRANSIT SHELTERS AND STOPS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Transit authority\" means:\n(1) a statutory or home rule charter city, with respect to rights-of-way at bus stop and train stop locations, transit shelters, and transit passenger seating facilities owned by the city or established pursuant to a vendor contract with the city;\n(2) the Metropolitan Council, with respect to transit shelters and transit passenger seating facilities owned by the council or established pursuant to a vendor contract with the council; or\n(3) a replacement service provider under section 473.388, with respect to rights-of-way at bus stop and train stop locations, transit shelters, and transit passenger seating facilities owned by the provider or established pursuant to a vendor contract with the provider.\n(c) \"Transit shelter\" means a wholly or partially enclosed structure provided for public use as a waiting area in conjunction with light rail transit, bus rapid transit, or regular route transit.\n(a) A transit authority shall establish design specifications for establishment and replacement of its transit shelters, which must include:\n(1) engineering standards, as appropriate;\n(2) maximization of protection from the wind, snow, and other elements;\n(3) to the extent feasible, inclusion of warming capability at each shelter in which there is a proportionally high number of transit service passenger boardings; and\n(4) full accessibility for the elderly and persons with disabilities.\n(b) The council shall consult with the Transportation Accessibility Advisory Committee.\nA transit authority shall ensure transit shelters are maintained in good working order and are accessible to all users of the transit system. This requirement includes but is not limited to:\n(1) keeping transit shelters reasonably clean and free from graffiti; and\n(2) removing snow and ice in a manner that provides accessibility for the elderly and persons with disabilities to be able to enter and exit transit shelters, and board and exit trains at each stop.",
	"repealed": false
}