{
	"id": "299A.955",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.955",
	"title": "299A.955 RESTORATIVE PRACTICES; RESTITUTION PROGRAM.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Juvenile\" has the same meaning as given to the term \"child\" in section 260B.007, subdivision 3.\n(c) \"Juvenile offense\" means a violation of local, state, Tribal, or federal law, other than a juvenile petty offense or a major traffic offense, committed by a juvenile within the boundaries of the state of Minnesota.\n(d) \"Juvenile petty offense\" has the meaning given in section 260B.007, subdivision 16.\n(e) \"Major traffic offense\" has the meaning given in section 260B.225, subdivision 1, paragraph (b).\n(f) \"Victim\" has the meaning given in section 611A.01, paragraph (b).\nThe Office of Restorative Practices must establish a restorative practices restitution grant program. Restorative practices restitution grants must be used to reimburse victims for economic losses or other harm resulting from an act that would constitute a juvenile offense, juvenile petty offense, or major traffic offense committed by a juvenile if the juvenile participates in a restorative process to address the harm.\n(a) A restorative practices initiative is eligible for a grant under this section in any fiscal year in which the Office of Restorative Practices awards the restorative practices initiative a grant under section 142A.76, subdivision 5. A restorative practices initiative may submit an application under this section before the Office of Restorative Practices acts on an application submitted pursuant to section 142A.76, subdivision 5.\n(b) Applicants must submit an application in the form and manner established by the Office of Restorative Practices. Applications must include a letter of support from the restorative practices advisory committee in the jurisdiction where the applicant will operate or, if the restorative practices advisory committee has not been established, at least two letters of support from potential restorative practices advisory committee members, one of whom must be a member described in section 142A.76, subdivision 6, paragraph (a), clause (1), (2), or (5).\n(c) A grant issued under this section may be in an amount of up to 15 percent of the amount awarded to the restorative practices initiative under section 142A.76, subdivision 5.\n(a) A grant recipient must establish policies and procedures to verify that a person is a victim of an act that would constitute a juvenile offense, juvenile petty offense, or major traffic offense committed by a juvenile and the amount of economic loss or other harm sustained by the victim.\n(b) A grant recipient must establish policies and procedures for the payment of reimbursement to victims and to record the amount paid. Payment may be made directly to a victim or, if applicable, to a court administrator or probation officer.\n(c) Policies and procedures established under this subdivision must be approved by the restorative practices advisory committee in the jurisdiction where the restorative practices initiative operates.\n(a) Personal history information and other information collected, used, and maintained by a restorative practices initiative operating a restorative practices restitution program under this section are private data on individuals as defined in section 13.02, subdivision 12, and the grantee shall maintain the data in accordance with the provisions of chapter 13, if:\n(1) the identity and location of any crime victim may be determined from the data; or\n(2) the identity and location of any juvenile who committed an act that would constitute a juvenile offense, juvenile petty offense, or major traffic offense committed by a juvenile may be determined from the data.\n(b) Personal history data and other information collected, used, and maintained by the Office of Restorative Practices are private data on individuals as defined in section 13.02, subdivision 12, if:\n(1) the identity and location of any crime victim may be determined from the data; or\n(2) the identity and location of any juvenile who committed an act that would constitute a juvenile offense, juvenile petty offense, or major traffic offense committed by a juvenile may be determined from the data.\n(c) The Office of Restorative Practices must establish written procedures to ensure that only individuals authorized by law may enter, update, or access data classified as nonpublic or private data on individuals. An authorized individual's ability to enter, update, or access not public data must correspond to the official duties or training level of the individual and to the statutory authorization granting access for that purpose. All queries and responses, and all actions in which not public data are entered, updated, accessed, shared, or disseminated, must be recorded in a data audit trail. Data contained in the audit trail have the same classification as the underlying data tracked by the audit trail.",
	"repealed": false
}