{
	"id": "82.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.67",
	"title": "82.67 AGENCY DISCLOSURE REQUIREMENTS.",
	"text": "A real estate broker or salesperson shall provide to a consumer in the sale and purchase of a residential real property transaction at the first substantive contact with the consumer an agency disclosure form in substantially the form set forth in subdivision 3. The agency disclosure form shall be intended to provide a description of available options for agency and facilitator relationships, and a description of the role of a licensee under each option. The agency disclosure form shall provide a signature line for acknowledgment of receipt by the consumer. The disclosures required by this subdivision apply only to residential real property transactions.\nDisclosures made in accordance with the requirements for disclosure of agency relationships set forth in this chapter are sufficient to satisfy common law disclosure requirements.\nThe agency disclosure form shall be in substantially the form set forth below:\nAGENCY RELATIONSHIPS IN REAL ESTATE TRANSACTIONS\nMinnesota law requires that early in any relationship, real estate brokers or salespersons discuss with consumers what type of agency representation or relationship they desire.(1) The available options are listed below. This is not a contract. This is an agency disclosure form only. If you desire representation, you must enter into a written contract according to state law (a listing contract or a buyer representation contract). Until such time as you choose to enter into a written contract for representation, you will be treated as a customer and will not receive any representation from the broker or salesperson. The broker or salesperson will be acting as a Facilitator (see paragraph IV below), unless the broker or salesperson is representing another party as described below.\nACKNOWLEDGMENT: I/We acknowledge that I/We have been presented with the below-described options. I/We understand that until I/We have signed a representation contract, I/We are not represented by the broker/salesperson. I/We understand that written consent is required for a dual agency relationship. THIS IS A DISCLOSURE ONLY, NOT A CONTRACT FOR REPRESENTATION.\nI.\nSeller's Broker: A broker who lists a property, or a salesperson who is licensed to the listing broker, represents the Seller and acts on behalf of the Seller. A Seller's broker owes to the Seller the fiduciary duties described below.(2) The broker must also disclose to the Buyer material facts as defined in Minnesota Statutes, section 82.68, subdivision 3, of which the broker is aware that could adversely and significantly affect the Buyer's use or enjoyment of the property. If a broker or salesperson working with a Buyer as a customer is representing the Seller, he or she must act in the Seller's best interest and must tell the Seller any information disclosed to him or her, except confidential information acquired in a facilitator relationship (see paragraph IV below). In that case, the Buyer will not be represented and will not receive advice and counsel from the broker or salesperson.\nII.\nBuyer's Broker: A Buyer may enter into an agreement for the broker or salesperson to represent and act on behalf of the Buyer. The broker may represent the Buyer only, and not the Seller, even if he or she is being paid in whole or in part by the Seller. A Buyer's broker owes to the Buyer the fiduciary duties described below.(2) The broker must disclose to the Buyer material facts as defined in Minnesota Statutes, section 82.68, subdivision 3, of which the broker is aware that could adversely and significantly affect the Buyer's use or enjoyment of the property. If a broker or salesperson working with a Seller as a customer is representing the Buyer, he or she must act in the Buyer's best interest and must tell the Buyer any information disclosed to him or her, except confidential information acquired in a facilitator relationship (see paragraph IV below). In that case, the Seller will not be represented and will not receive advice and counsel from the broker or salesperson.\nIII.\nDual Agency-Broker Representing both Seller and Buyer: Dual agency occurs when one broker or salesperson represents both parties to a transaction, or when two salespersons licensed to the same broker each represent a party to the transaction. Dual agency requires the informed consent of all parties, and means that the broker and salesperson owe the same duties to the Seller and the Buyer. This role limits the level of representation the broker and salespersons can provide, and prohibits them from acting exclusively for either party. In a dual agency, confidential information about price, terms, and motivation for pursuing a transaction will be kept confidential unless one party instructs the broker or salesperson in writing to disclose specific information about him or her. Other information will be shared. Dual agents may not advocate for one party to the detriment of the other.(3)\nWithin the limitations described above, dual agents owe to both Seller and Buyer the fiduciary duties described below.(2) Dual agents must disclose to Buyers material facts as defined in Minnesota Statutes, section 82.68, subdivision 3, of which the broker is aware that could adversely and significantly affect the Buyer's use or enjoyment of the property.\nIV.\nFacilitator: A broker or salesperson who performs services for a Buyer, a Seller, or both but does not represent either in a fiduciary capacity as a Buyer's Broker, Seller's Broker, or Dual Agent. THE FACILITATOR BROKER OR SALESPERSON DOES NOT OWE ANY PARTY ANY OF THE FIDUCIARY DUTIES LISTED BELOW, EXCEPT CONFIDENTIALITY, UNLESS THOSE DUTIES ARE INCLUDED IN A WRITTEN FACILITATOR SERVICES AGREEMENT. The facilitator broker or salesperson owes the duty of confidentiality to the party but owes no other duty to the party except those duties required by law or contained in a written facilitator services agreement, if any. In the event a facilitator broker or salesperson, working with a Buyer, shows a property listed by the facilitator broker or salesperson, then the facilitator broker or salesperson must act as a Seller's Broker (see paragraph I above). In the event a facilitator broker or salesperson, working with a Seller, accepts a showing of the property by a Buyer being represented by the facilitator broker or salesperson, then the facilitator broker or salesperson must act as a Buyer's Broker (see paragraph III above).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(1) This disclosure is required by law in any transaction involving property occupied or intended to be occupied by one to four families as their residence.\n(2) The fiduciary duties mentioned above are listed below and have the following meanings:\nLoyalty-broker/salesperson will act only in client(s)' best interest.\nObedience-broker/salesperson will carry out all client(s)' lawful instructions.\nDisclosure-broker/salesperson will disclose to client(s) all material facts of which broker/salesperson has knowledge which might reasonably affect the client's use and enjoyment of the property.\nConfidentiality-broker/salesperson will keep client(s)' confidences unless required by law to disclose specific information (such as disclosure of material facts to Buyers).\nReasonable Care-broker/salesperson will use reasonable care in performing duties as an agent.\nAccounting-broker/salesperson will account to client(s) for all client(s)' money and property received as agent.\n(3) If Seller(s) elect(s) not to agree to a dual agency relationship, Seller(s) may give up the opportunity to sell the property to Buyers represented by the broker/salesperson. If Buyer(s) elect(s) not to agree to a dual agency relationship, Buyer(s) may give up the opportunity to purchase properties listed by the broker.\nIf circumstances create a dual agency situation, the broker must make full disclosure to all parties to the transaction as to the change in relationship of the parties to the broker due to dual agency. A broker, having made full disclosure, must obtain the consent of all parties to these circumstances in residential real property transactions in the purchase agreement in the form set forth below which shall be set off in a boxed format to draw attention to it:\nBroker represents both the seller(s) and the buyer(s) of the property involved in this transaction, which creates a dual agency. This means that broker and its salespersons owe fiduciary duties to both seller(s) and buyer(s). Because the parties may have conflicting interests, broker and its salespersons are prohibited from advocating exclusively for either party. Broker cannot act as a dual agent in this transaction without the consent of both seller(s) and buyer(s).\nSeller(s) and buyer(s) acknowledge that:\n(1) confidential information communicated to broker which regards price, terms, or motivation to buy or sell will remain confidential unless seller(s) or buyer(s) instruct(s) broker in writing to disclose this information. Other information will be shared;\n(2) broker and its salespersons will not represent the interests of either party to the detriment of the other; and\n(3) within the limits of dual agency, broker and its salespersons will work diligently to facilitate the mechanics of the sale.\nWith the knowledge and understanding of the explanation above, seller(s) and buyer(s) authorize(s) and instruct(s) broker and its salespersons to act as dual agents in this transaction.",
	"repealed": false
}