{
	"id": "121A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.23",
	"title": "121A.23 PROGRAMS TO PREVENT AND REDUCE THE RISKS OF SEXUALLY TRANSMITTED INFECTIONS AND DISEASES.",
	"text": "The commissioner of education, in consultation with the commissioner of health, shall assist districts in developing and implementing a program to prevent and reduce the risk of sexually transmitted infections and diseases, including but not exclusive to human immune deficiency virus and human papilloma virus. Each district must have a program that includes at least:\n(1) planning materials, guidelines, and other technically accurate and updated information;\n(2) a comprehensive, technically accurate, and updated curriculum that includes helping students to abstain from sexual activity until marriage;\n(3) cooperation and coordination among districts and SCs;\n(4) a targeting of adolescents, especially those who may be at high risk of contracting sexually transmitted infections and diseases, for prevention efforts;\n(5) involvement of parents and other community members;\n(6) in-service training for appropriate district staff and school board members;\n(7) collaboration with state agencies and organizations having a sexually transmitted infection and disease prevention or sexually transmitted infection and disease risk reduction program;\n(8) collaboration with local community health services, agencies and organizations having a sexually transmitted infection and disease prevention or sexually transmitted infection and disease risk reduction program; and\n(9) participation by state and local student organizations.\nThe department may provide assistance at a neutral site to a nonpublic school participating in a district's program. District programs must not conflict with the health and wellness curriculum developed under Laws 1987, chapter 398, article 5, section 2, subdivision 7.\nIf a district fails to develop and implement a program to prevent and reduce the risk of sexually transmitted infection and disease, the department must assist the service cooperative in the region serving that district to develop or implement the program.\nDistricts may accept funds for sexually transmitted infection and disease prevention programs developed and implemented under this section from public and private sources including public health funds and foundations, department professional development funds, federal block grants or other federal or state grants.",
	"repealed": false
}