{
	"id": "256.4764",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.4764",
	"title": "256.4764 LONG-TERM SERVICES AND SUPPORTS WORKFORCE INCENTIVE GRANTS.",
	"text": "The commissioner of human services shall establish grants for long-term services and supports providers and facilities to assist with recruiting and retaining direct support professionals.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of human services.\n(c) \"Eligible employer\" means an organization enrolled in a Minnesota health care program that is:\n(1) a provider of home and community-based services under chapter 245D;\n(2) a facility certified as an intermediate care facility for persons with developmental disabilities;\n(3) a nursing facility under section 256R.02, subdivision 33;\n(4) a provider of personal care assistance services under section 256B.0659;\n(5) a provider of community first services and supports under section 256B.85;\n(6) a provider of early intensive developmental and behavioral intervention services under section 256B.0949;\n(7) a provider of home care services as defined under section 256B.0651, subdivision 1, paragraph (d);\n(8) an eligible financial management services provider serving people through consumer-directed community supports under chapter 256S and sections 256B.092 and 256B.49, or consumer support grants under section 256.476; or\n(9) a provider of customized living services as defined in section 256S.02.\n(d) \"Eligible worker\" means a worker who earns $30 per hour or less and is currently employed or recruited to be employed by an eligible employer.\n(a) Grantees must use grant money to provide payments to eligible workers for the following purposes:\n(1) retention, recruitment, and incentive payments;\n(2) postsecondary loan and tuition payments;\n(3) child care costs;\n(4) transportation-related costs;\n(5) personal care assistant background study costs; and\n(6) other costs associated with retaining and recruiting workers, as approved by the commissioner.\n(b) Eligible workers may receive cumulative payments up to $1,000 per calendar year from the workforce incentive grant account and all other state money intended for the same purpose. Workers are not eligible for payments under this section if they received payments under section 256.4766.\n(c) The commissioner must develop a grant cycle distribution plan that allows for equitable distribution of money among eligible employers. The commissioner's determination of the grant awards and amounts is final and is not subject to appeal.\nAs a condition of obtaining grant payments under this section, an eligible employer must attest and agree to the following:\n(1) the employer is an eligible employer;\n(2) the total number of eligible employees;\n(3) the employer will distribute the entire value of the grant to eligible workers allowed under this section;\n(4) the employer will create and maintain records under subdivision 6;\n(5) the employer will not use the money appropriated under this section for any purpose other than the purposes permitted under this section; and\n(6) the entire value of any grant amounts will be distributed to eligible workers identified by the employer.\n(a) Each grantee shall prepare, and upon request submit to the commissioner, a distribution plan that specifies the amount of money the grantee expects to receive and how that money will be distributed for recruitment and retention purposes for eligible employees. Within 60 days of receiving the grant, the grantee must post the distribution plan and leave it posted for a period of at least six months in an area of the grantee's operation to which all direct support professionals have access.\n(b) Within 12 months of receiving a grant under this section, each grantee that receives a grant shall submit a report to the commissioner that includes the following information:\n(1) a description of how grant money was distributed to eligible employees; and\n(2) the total dollar amount distributed.\n(c) Failure to submit the report under paragraph (b) may result in recoupment of grant money.\n(a) The commissioner may perform an audit under this section up to six years after a grant is awarded to ensure:\n(1) the grantee used the money solely for allowable purposes under subdivision 3;\n(2) the grantee was truthful when making attestations under subdivision 4; and\n(3) the grantee complied with the conditions of receiving a grant under this section.\n(b) If the commissioner determines that a grantee used grant money for purposes not authorized under this section, the commissioner must treat any amount used for a purpose not authorized under this section as an overpayment. The commissioner must recover any overpayment.\n(a) Notwithstanding any law to the contrary, grant awards under this section must not be considered income, assets, or personal property for purposes of determining eligibility or recertifying eligibility for:\n(1) child care assistance programs under chapter 142E;\n(2) general assistance, Minnesota supplemental aid, and food support under chapter 256D;\n(3) housing support under chapter 256I;\n(4) the Minnesota family investment program and diversionary work program under chapter 142G; and\n(5) economic assistance programs under chapter 256P.\n(b) The commissioner must not consider grant awards under this section as income or assets under section 256B.056, subdivision 1a, paragraph (a), 3, or 3c, or for persons with eligibility determined under section 256B.057, subdivision 3, 3a, 3b, 4, or 9.\n(a) For the purposes of this section, \"subtraction\" has the meaning given in section 290.0132, subdivision 1, and the rules in that subdivision apply for this section. The definitions in section 290.01 apply to this section.\n(b) The amount of a payment received under this section is a subtraction.\n(c) Payments under this section and Laws 2021, First Special Session chapter 7, article 17, section 20, as amended, are excluded from income as defined in sections 290.0674, subdivision 2a, and 290A.03, subdivision 3.\nA workforce incentive grant account is created in the special revenue fund. Appropriations made for grants and payments administered under this section may be transferred to this account. Amounts in the account are appropriated to the commissioner of human services. Appropriations transferred to this account cancel and are returned to the fund of origin on the date the original appropriations would have lapsed.\nThe commissioner must treat grant payments awarded under this section as an applicable credit as defined under section 256R.10, subdivision 6.\nPayments administered under this section, including reimbursements for paid family medical leave premiums, do not constitute a change in a term or condition for individual providers as defined in section 256B.0711 in covered programs and are not subject to the state's obligation to meet and negotiate under chapter 179A.",
	"repealed": false
}