{
	"id": "524.2-804",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-804",
	"title": "524.2-804 REVOCATION BY DISSOLUTION OF MARRIAGE; NO REVOCATION BY OTHER CHANGES OF CIRCUMSTANCES.",
	"text": "Except as provided by the express terms of a governing instrument, other than a trust instrument under section 501C.1207, executed prior to the dissolution or annulment of an individual's marriage, a court order, a contract relating to the division of the marital property made between individuals before or after their marriage, dissolution, or annulment, or a plan document governing a qualified or nonqualified retirement plan, the dissolution or annulment of a marriage revokes any revocable:\n(1) disposition, beneficiary designation, or appointment of property made by an individual to the individual's former spouse in a governing instrument;\n(2) provision in a governing instrument conferring a general or nongeneral power of appointment on an individual's former spouse; and\n(3) nomination in a governing instrument, nominating an individual's former spouse to serve in any fiduciary or representative capacity, including a personal representative, executor, trustee, conservator, agent, or guardian.\nProvisions of a governing instrument are given effect as if the former spouse died immediately before the dissolution or annulment.\nProvisions revoked solely by this section are revived by the individual's remarriage to the former spouse or by a nullification of the dissolution or annulment.\nNo change of circumstances other than as described in this section and in section 524.2-803 effects a revocation.\n(a) A payor or other third party is not liable for having made a payment or transferred an item of property or any other benefit to a beneficiary designated in a governing instrument affected by a dissolution, annulment, or remarriage, or for having taken any other action in good faith reliance on the validity of the governing instrument, before the payor or other third party received written notice of the dissolution, annulment, or remarriage. A payor or other third party is liable for a payment made or other action taken after the payor or other third party received written notice of a claimed forfeiture or revocation under this section.\n(b) Written notice of the dissolution, annulment, or remarriage under paragraph (a) must be delivered to the payor's or other third party's main office or home. Upon receipt of written notice of the dissolution, annulment, or remarriage, a payor or other third party may pay any amount owed or transfer or deposit any item of property held by it to or with the court having jurisdiction of the probate proceedings relating to the decedent's estate or, if no proceedings have been commenced, to or with the court having jurisdiction of probate proceedings relating to decedents' estates located in the county of the decedent's residence. The court shall hold the funds or item of property and, upon its determination under this section, shall order disbursement or transfer in accordance with the determination. Payments, transfers, or deposits made to or with the court discharge the payor or other third party from all claims for the value of amounts paid to or items of property transferred to or deposited with the court.",
	"repealed": false
}