{
	"id": "201.1611",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.1611",
	"title": "201.1611 POSTSECONDARY INSTITUTION AND SCHOOL DISTRICT VOTER REGISTRATION.",
	"text": "(a) All postsecondary institutions that enroll students accepting state or federal financial aid must provide voter registration forms to each student during the fall and spring of each year. In state election years, it must be provided 15 days in advance of the deadline for registering to vote for the state general election. If the voter registration forms are provided electronically, the electronic message must be devoted exclusively to voter registration.\n(b) All school districts must make available paper or electronic voter registration applications each May and September to all students registered as students of the school district who are eligible to register or preregister to vote. A school district has no obligation to provide voter registration applications to students who participate in a postsecondary education option program or who otherwise maintain residence in the district but do not attend a school operated by the district. A school district fulfills its obligation to a student under this section if it provides a voter registration application to the student one time.\n(c) The voter registration forms must contain spaces for the information required in section 201.071, subdivision 1, and applicable rules of the secretary of state. The institutions and school districts may request these forms from the secretary of state. Institutions must consult with their campus student government in determining the most effective means of distributing the forms and in seeking to facilitate election day registration of students under section 201.061, subdivision 3. School districts must advise students that completion of the voter registration application is not a school district requirement.\n(d) The institutions must report to the secretary of state by November 30 of each year on their implementation of this section. At a minimum, the report must include how and when the forms were distributed and the voter engagement plan under subdivision 3, paragraph (b), clause (2). Institutions may include information about methods that were effective in increasing student registrations.\n(e) By February 1 of each year, the secretary of state must report to the chairs and ranking minority members of the legislative committees with jurisdiction over elections on the information under paragraph (d). The secretary must highlight best practices and innovative methods that were most effective in registering students to vote.\nA copy of each completed voter registration form must be sent to the county auditor of the county in which the voter maintains residence or to the secretary of state as soon as possible. All completed voter registration forms must be forwarded no later than 21 days before the general election.\n(a) All postsecondary institutions that enroll students accepting state or federal financial aid must maintain a webpage to share resources to help students determine where and how they are eligible to vote. The webpage must include the following:\n(1) resources from state and local election officials on voter registration and voting requirements including voter registration deadlines; residency requirements; acceptable methods of proving residency for same day registration, as applicable; and absentee voting options;\n(2) applicable deadlines for requesting and submitting an absentee ballot, as well as additional options for early and in-person voting, and voting on election day;\n(3) resources to help students who are registered in another state to apply for absentee ballots in that state, and may include resources from state and local election officials from that state;\n(4) the campus vote coordinator's name and contact information; and\n(5) the voter engagement plan required by paragraph (b), clause (2).\n(b) All postsecondary institutions that enroll students accepting state or federal financial aid must designate a staff person as the campus vote coordinator. The campus vote coordinator must:\n(1) ensure the institution complies with this section; and\n(2) consult with the campus student association to develop a voter engagement plan that identifies goals and activities, resources to accomplish the identified goals and activities, and individual or key departments responsible for executing the identified goals and activities.",
	"repealed": false
}