{
	"id": "15.471",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.471",
	"title": "15.471 DEFINITIONS.",
	"text": "For purposes of this section and sections 15.471 to 15.474, the terms defined in this section have the meanings given them.\n\"Administrative law judge\" means the official assigned to conduct a contested case hearing under chapter 14.\n\"Contested case\" means a proceeding defined in section 14.02, subdivision 3, in which the position of the state is represented by counsel. It does not include a contested case to establish or fix a rate or grant or renew a license.\n\"Expenses\" means the costs incurred by the party in the litigation, including:\n(1) filing fees;\n(2) subpoena fees and mileage;\n(3) transcript costs and court reporter fees;\n(4) expert witness fees;\n(5) the reasonable cost of any study, analysis, engineering report, test, or project;\n(6) photocopying and printing costs;\n(7) postage and delivery costs; and\n(8) service of process fees.\n\"Fees\" means the reasonable attorney fees or reasonable fees charged by a person not an attorney who is authorized by law or rule to represent the party and may include reasonable charges by the party, the party's employee, or agent. The amount of fees must be based upon prevailing market rates for the kind and quality of the services furnished, subject to the following limitations:\n(1) In a court action, an expert witness may not be compensated at a rate in excess of the highest rate of compensation for expert witnesses paid by the state.\n(2) In a contested case proceeding, an expert witness may not be compensated at a rate in excess of the highest rate of compensation for expert witnesses paid by the state agency involved.\n(a) Except as modified by paragraph (b), \"party\" means a person named or admitted as a party, or seeking and entitled to be admitted as a party, in a court action or contested case proceeding, or a person admitted by an administrative law judge for limited purposes, and who is:\n(1) an unincorporated business, partnership, corporation, association, or organization, having not more than 500 employees at the time the civil action was filed or the contested case proceeding was initiated; and\n(2) an unincorporated business, partnership, corporation, association, or organization whose annual revenues did not exceed $7,000,000 at the time the civil action was filed or the contested case proceeding was initiated.\n(b) \"Party\" also includes a partner, officer, shareholder, member, or owner of an entity described in paragraph (a), clauses (1) and (2).\n(c) \"Party\" does not include a person providing services pursuant to licensure or reimbursement on a cost basis by the Department of Health or the Department of Human Services, when that person is named or admitted or seeking to be admitted as a party in a matter which involves the licensing or reimbursement rates, procedures, or methodology applicable to those services.\n\"State\" means the state of Minnesota or an agency or official of the state acting in an official capacity.\n\"Substantially justified\" means that the state's position had a reasonable basis in law and fact, based on the totality of the circumstances before and during the litigation or contested case proceeding.",
	"repealed": false
}