{
	"id": "84.0896",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.0896",
	"title": "84.0896 TRADE IN PROHIBITED ANIMAL PARTS PROHIBITED.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Antique\" means an item that:\n(1) contains no more than 200 grams of prohibited animal part as a fixed component of an item that is not made wholly or partially from a prohibited animal part; and\n(2) is documented to be at least 100 years old.\n(c) \"Prohibited animal part\" means any of the following:\n(1) a tooth or tusk from any species of elephant, hippopotamus, mammoth, mastodon, walrus, whale, or narwhal, or any piece thereof, whether raw or worked;\n(2) a product containing any of the materials described in clause (1);\n(3) a horn; piece of horn; or derivative of a horn, such as a powder, of any species of rhinoceros; and\n(4) a product containing any of the materials described in clause (3).\n(d) \"Sell\" or \"sale\" means an exchange for consideration and includes barter and possession with intent to sell. The term does not include a transfer of ownership by gift, donation, or bequest.\nA person shall not purchase or sell any item that the person knows or should know is a prohibited animal part.\n(a) Subdivision 2 does not prohibit the sale or purchase of a prohibited animal part if the sale or purchase is:\n(1) undertaken as part of law enforcement activities;\n(2) expressly authorized by federal law;\n(3) of an antique;\n(4) of a musical instrument containing a lawfully acquired fixed component made of no more than 200 grams of prohibited animal part; or\n(5) of a prohibited animal part by a bona fide educational or scientific institution that is a nonprofit corporation, as defined in section 501(c)(3) of the Internal Revenue Code.\n(b) Subdivision 2 does not prohibit possession of a cultural artifact containing a prohibited animal part.\nNotwithstanding any other provision of law, a prohibited animal part seized under this section must, upon a conviction, be forfeited to the state and either destroyed or given to a nonprofit corporation, as defined in section 501(c)(3) of the Internal Revenue Code, for an educational or scientific purpose.",
	"repealed": false
}