{
	"id": "381.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/381.12",
	"title": "381.12 SECTION CORNERS PERPETUATED.",
	"text": "When the county board determines that the monuments established by the United States in the public lands survey to mark public land survey corners have been destroyed or are becoming obscure, it may employ a land surveyor licensed under chapter 326 to perpetuate said corners with durable magnetic monuments. The land surveyor shall make full and accurate notes and records from which the entire survey can be retraced, and, no later than one year after perpetuating the corners, shall file the records of such survey and a certificate of location of government corner for each corner, prepared in compliance with subdivision 3. The land surveyor shall file the records and certificate in the office of the county surveyor if an office is maintained in a building maintained by the county for county purposes on a full-time basis, and if not, the land surveyor shall record them in the office of the county recorder. The monuments are prima facie evidence of the original United States public land survey corners.\nThe county board of any county may levy a tax upon all the taxable property in the county for the purpose of defraying the expense incurred, or to be incurred, less any amount received from the public system monument grant program under section 381.125, for:\n(1) the preservation and restoration of monuments under this section;\n(2) the preservation or establishment of control monuments for mapping activities;\n(3) the modernization of county land records through the use of parcel-based land management systems; or\n(4) the establishment of geographic (GIS), land (LIS), management (MIS) information systems.\n(a) Perpetuation of the corners and placing of corner monuments, reference monuments, or witness monuments must be in the manner described in paragraphs (b) to (e).\n(b) At the corner location, a durable magnetic monument must be placed so as not to be disturbed by routine activities.\n(c) For a corner monument set below a paved surface, a supplemental marker that is visible at the surface must be set.\n(d) An access cover or monument box providing access to a monument below a paved surface may be used in lieu of setting a supplemental marker at the surface.\n(e) If it is not practical or safe to set a monument at the corner location, a durable magnetic monument may be set as a witness or reference monument.\n(a) A certificate of location of government corner must be prepared as part of any land survey which includes or requires the use, perpetuation, or restoration of a public land survey corner and one of the following conditions exists:\n(1) there is no certificate of location of government corner for the corner on file in the office of the county surveyor or the county recorder for the county in which the corner is located; or\n(2) the land surveyor who performs the survey accepts a position for the public land survey corner which differs from that shown on a certificate of location of government corner on file in the office of the county surveyor or the county recorder for the county in which the corner is located; or\n(3) the reference ties have been destroyed or differ from those shown on an existing certificate of location of government corner on file in the office of the county surveyor or the county recorder for the county in which the corner is located; or\n(4) the corner, witness, or reference monuments shown on an existing certificate of location of government corner on file in the office of the county surveyor or the county recorder for the county in which the corner is located have been destroyed.\n(b) A certificate of location of government corner must include all the following elements:\n(1) the identity of the corner, as referenced to the public land survey system;\n(2) a description of any record evidence, monument evidence, occupation evidence, parol evidence, or any other material evidence considered by the land surveyor, and whether the monument was found or placed;\n(3) a description of any corner monument, witness monument, or reference monument placed;\n(4) where practicable, reference ties to at least three durable objects;\n(5) a plan view drawing depicting the corner position, relevant monuments, and reference ties in sufficient detail to enable accurate restoration of the corner position;\n(6) a description of any significant discrepancy between the position of the corner as restored and the position of that corner as previously accepted or certified;\n(7) a statement identifying the methods used to restore and perpetuate the corner; and\n(8) the directions and distances to other public land survey corners which were used as evidence or used for proportioning in determining the corner positions.\n(c) The certificate of location of government corner shall be certified according to Minnesota Rules, part 1800.4200, subpart 4, and shall include a statement that the certificate of location of government corner is correct and complete to the best of the land surveyor's knowledge and belief.\n(d) No later than one year after perpetuating or restoring a public land survey corner, the land surveyor shall file or record the certificate of location of government corner in the same manner as required under subdivision 1.\n(e) A reasonable fee for professional services may be paid to the land surveyor filing or recording the certificate of location of government corner with the respective county, on approval and determination of the fee by resolution of the county board.",
	"repealed": false
}