{
	"id": "84A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/84A.31",
	"title": "84A.31 STATE REFORESTATION PROJECTS.",
	"text": "The powers in this section are granted for the purpose of:\n(1) vesting and revesting the state with title to lands suitable primarily for the development of forests and prevention of forest fires, and for experimenting in and practically advancing afforestation and reforestation;\n(2) impounding, controlling, and regulating the water of meandered lakes and the flow of natural streams of the state;\n(3) creating and establishing wild game and fishing reserves; or\n(4) any other public state purpose.\nThe board of county commissioners of any county may by resolution propose that the state take over part of the tax-delinquent lands in the county if the county contains land suitable for the purposes in subdivision 1.\nSpecifically, the board may propose that any \"area in the county consisting of one or more townships, or part of any township, containing such lands be taken over by the state for afforestation, reforestation, flood control projects, wild game and fishing reserves, or other public state purpose, to be managed, controlled, and used for the development of forests and prevention of forest fires, and for the purpose of experimenting in and practically advancing afforestation, reforestation, or for the purpose of impounding, controlling, and regulating the waters of meandered lakes and the flow of natural streams, or for the purpose of creating and establishing wild game and fishing reserves, or for either or any such purposes,\" or for any other public state purpose, on lands to be acquired by the state within such projects, as set forth in this section. Each area must include lands assessed for all or part of the cost of the establishment, construction, or repair of public drainage ditches under state law, and on which the assessments or installments on them are delinquent.\nA copy of the resolutions must be filed with the department and considered and acted upon by the department. If approved by the department, it must then be submitted to, considered, and acted upon by the Executive Council. If approved by the Executive Council, the proposition must be formally accepted by the governor. Acceptance must be communicated in writing to and filed with the auditor of the county.\nState school, swamp, indemnity, and institutional lands that are sold as provided by law and for which certificates of sale have been issued at the time of the passage of the resolution by the county board, and lands owned by the conservator of rural credit are taxable lands within the meaning of this section. If the taxes or ditch lien installments on the lands or the interest of the purchaser in them are delinquent, they are lands on which the taxes are delinquent within the meaning of subdivision 2.",
	"repealed": false
}