{
	"id": "174.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.255",
	"title": "174.255 PARATRANSIT PROGRAM; ACCESSIBILITY; INSURANCE.",
	"text": "The commissioner shall require any paratransit project receiving assistance under section 174.24 that includes the operation of two or more vehicles other than automobiles or taxis to provide at least one vehicle that is accessible to disabled individuals and may require additional accessible vehicles if necessary to serve disabled individuals expected to use the project. A vehicle is accessible if it is equipped to allow transportation of an individual using a wheelchair or using an orthopedic device.\nIn order to reduce the expense of liability insurance required for paratransit projects eligible for assistance under section 174.24, the commissioner and the commissioner of commerce shall investigate the causes of high liability insurance costs and shall take the appropriate administrative action to assist paratransit projects to obtain liability insurance coverage from qualified insurance carriers at the lowest available cost. Appropriate administrative action includes: (1) taking bids from and negotiating and entering into contracts with qualified carriers to provide liability insurance for eligible paratransit projects that wish to be covered, and (2) providing technical and administrative assistance to eligible paratransit projects to assist them in securing low-cost liability insurance.\nA person operating or assisting the operation of a vehicle while employed by a program such as \"project mobility\" may leave the vehicle to enter premises in order to assist a person who does not require emergency ambulance service to gain access and entrance to the vehicle. The assistance shall include assisting through the first entrance to a building. Operators of the special transportation vehicles shall provide the necessary passenger assistance for door-through-door service. Assistance shall also include assisting wheelchair passengers over any exterior steps essential to either departure or destination buildings, subject to both the steps and the wheelchair being in good repair. If an operator or assistant refuses to assist because of the condition of the steps or the wheelchair, the operator of the service shall send letters to the commissioner of transportation and the person denied service detailing the corrective measures necessary to qualify for service.",
	"repealed": false
}