{
	"id": "144.672",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.672",
	"title": "144.672 DUTIES OF COMMISSIONER; RULES.",
	"text": "The commissioner of health shall collect cancer incidence information, analyze the information, and conduct special studies designed to determine the potential public health significance of an increase in cancer incidence.\nThe commissioner shall adopt rules to administer the system, collect information, and distribute data. The rules must include, but not be limited to, the following:\n(1) the type of data to be reported;\n(2) standards for reporting specific types of data;\n(3) payments allowed to hospitals, pathologists, and registry systems to defray their costs in providing information to the system;\n(4) criteria relating to contracts made with outside entities to conduct studies using data collected by the system. The criteria may include requirements for a written protocol outlining the purpose and public benefit of the study, the description, methods, and projected results of the study, peer review by other scientists, the methods and facilities to protect the privacy of the data, and the qualifications of the researcher proposing to undertake the study; and\n(5) specification of fees to be charged under section 13.03, subdivision 3, for all out-of-pocket expenses for data summaries or specific analyses of data requested by public and private agencies, organizations, and individuals, and which are not otherwise included in the commissioner's annual summary reports. Fees collected are appropriated to the commissioner to offset the cost of providing the data.\nThe commissioner of health shall prepare and transmit to the governor and to members of the legislature under section 3.195, a biennial report on the incidence of cancer in Minnesota and a compilation of summaries and reports from special studies and investigations performed to determine the potential public health significance of an increase in cancer incidence, together with any findings and recommendations. The first report shall be delivered by February 1989, with subsequent reports due in February of each of the following odd-numbered years.",
	"repealed": false
}