{
	"id": "297F.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.08",
	"title": "297F.08 CIGARETTE STAMPS.",
	"text": "Except as otherwise provided in this chapter, payment of the tax imposed by this chapter must be evidenced by stamps affixed to each package. Before delivering, or causing to be delivered, a package to any person in this state, a distributor shall firmly affix to each package of cigarettes appropriate stamps in amounts equal to the tax on those cigarettes as provided in this chapter.\nNotwithstanding any other provisions of this chapter, the tax due on the return is based upon actual stamps purchased during the reporting period.\nIn all cases where cigarettes are shipped into this state by any licensed distributor from outside this state, the appropriate stamps must be affixed to packages at the time the package enters the state.\nThe commissioner shall adopt the design of two stamps. One stamp must be designed for application to cigarette packages destined for retail sale on an Indian reservation which is a party to an agreement under section 270C.19, subdivision 2, and only to those packages. A second stamp must be designed for all other cigarette packages subject to the provisions of this chapter. The commissioner shall arrange for the printing of stamps in such amounts and denominations as the commissioner deems necessary.\nMS 2018 [Repealed, 1Sp2019 c 6 art 11 s 20]\nThe provisions of this chapter prescribing the powers and duties of the commissioner with relation to stamps supersede all the provisions of section 16A.56 in conflict.\nThe commissioner shall sell stamps to any person licensed as a distributor. The commissioner shall not sell stamps to any other person. The commissioner may prescribe the method of shipment of the stamps to the distributor as well as the quantities of stamps purchased.\nThe commissioner may sell stamps on a credit basis under conditions prescribed by the commissioner. The commissioner shall recover the actual costs of the stamps from the distributor. The commissioner shall annually establish the maximum amount of stamps that may be purchased each month.\nA cigarette tax stamp revolving account is created. The commissioner shall use the amounts in this fund to purchase stamps for resale. The commissioner shall charge distributors for the tax value of the stamps they receive along with the commissioner's cost to purchase the stamps and ship them to the distributor. The stamp purchase and shipping costs recovered must be credited to the revolving account and are appropriated to the commissioner for the further purchases and shipping costs. The revolving account is initially funded by a $40,000 transfer from the Department of Revenue.\nThe commissioner shall require any person licensed as a distributor to stamp packages with a tax stamping machine, approved by the commissioner, which shall be provided by the distributor. The commissioner shall also supervise and check the operation of the machines and shall provide for the payment of the tax on any package so stamped. If the commissioner finds that a stamping machine is not affixing a legible stamp on the package, the commissioner may order the distributor to immediately cease the stamping process until the machine is functioning properly.\nNo distributor shall resell or transfer any stamps purchased by the distributor from the commissioner. A distributor may transfer another state's stamped cigarettes to another distributor for the purpose of resale in the other state. A distributor who has on hand any uncanceled stamps at the time of discontinuing the business of selling cigarettes may return them to the commissioner and receive a refund of the amount paid for the stamps. Stamps which have become mutilated or unfit for use, or are affixed to cigarettes being returned to the manufacturer, or are affixed to packages which, or the contents of which, have become damaged and unfit for sale, shall be replaced by the commissioner, upon application by the distributor owning the stamps or cigarettes if an investigation discloses that the stamps have not evidenced a taxable transaction, after compliance with rules or orders of the commissioner designed to prevent use of the stamps replaced.\n[Repealed, 2014 c 308 art 9 s 94]\n(a) A person may not transport or cause to be transported from this state cigarettes for sale in another state without first affixing to the cigarettes the stamp required by the state in which the cigarettes are to be sold or paying any other excise tax on the cigarettes imposed by the state in which the cigarettes are to be sold.\n(b) A person may not affix to cigarettes the stamp required by another state or pay any other excise tax on the cigarettes imposed by another state if the other state prohibits stamps from being affixed to the cigarettes, prohibits the payment of any other excise tax on the cigarettes, or prohibits the sale of the cigarettes.\n(c) Not later than 15 days after the end of each calendar quarter, a person who transports or causes to be transported from this state cigarettes for sale in another state shall submit to the commissioner a report identifying the quantity and style of each brand of the cigarettes transported or caused to be transported in the preceding calendar quarter, and the name and address of each recipient of the cigarettes. This reporting requirement only applies to cigarettes manufactured by companies that are not original or subsequent participating manufacturers in the Master Settlement Agreement with other states.\n(d) For purposes of this section, \"person\" has the meaning given in section 297F.01, subdivision 12. Person does not include any common or contract carrier, or public warehouse that is not owned, in whole or in part, directly or indirectly by such person, and does not include a manufacturer that is an original or subsequent participating manufacturer in the Master Settlement Agreement with other states.\nThe commissioner may require the furnishing of a corporate surety bond or a certified check in an amount suitable to guarantee payment of the tax stamps purchased by a distributor. The bond or certified check may be required when the commissioner determines that a distributor is (1) delinquent in the filing of any return required under this chapter, or (2) delinquent in the payment of any uncontested tax liability under this chapter. The distributor shall furnish the bond or certified check for a period of two years, after which, if the distributor has not been delinquent in the filing of any returns required under this chapter, or delinquent in the paying of any tax under this chapter, a bond or certified check is no longer required. The commissioner at any time may apply the bond or certified check to any unpaid taxes or fees, including interest and penalties, owed to the department by the distributor.",
	"repealed": false
}