{
	"id": "469.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.045",
	"title": "469.045 APPEARANCE OF PUBLIC CORPORATION; BOND.",
	"text": "If the public corporation is not a party to the litigation described in section 469.044 it may appear specially for the purpose of making and being heard on such a motion. Three days' notice of hearing on the motion shall be given. If the court determines that loss or damage to the public or taxpayers may result from the pendency of the action or proceeding, the court may require the party who instituted it to give a surety bond, approved by the court or judge, in a penal sum to be determined by the court to protect against loss or damage, whether or not a temporary injunction or restraining order against the corporation has been demanded or ordered. If the bond so ordered is not filed within the reasonable time allowed by the court, the action or proceeding shall be dismissed with prejudice. The bond shall be executed by the party who instituted the litigation or some person for that party as principal and conditioned for the payment to the corporation of any damage the public and taxpayers sustain by reason of the litigation, if the court finally determines that the party was not entitled to the relief sought. The amount of damages may be ascertained by a reference or otherwise as the court shall direct, in which case the sureties shall be concluded as to the amount but the damages shall be recoverable only in an action on the bond. If the party by or for whom the bond is furnished prevails in the litigation, the premium paid on the bond shall be repaid by or taxed against the corporation. During the pendency of the litigation, the court, on motion, may require additional security if found necessary, and upon failure to furnish it shall dismiss the action or proceeding with prejudice. The court may likewise, on motion, reduce the amount of a bond theretofore required or release the bond upon a showing that the amount is excessive or the bond no longer required.",
	"repealed": false
}