{
	"id": "18H.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.03",
	"title": "18H.03 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "The commissioner may employ entomologists, plant pathologists, and other employees necessary to administer this chapter.\n(a) The commissioner may enter and inspect a public or private place that might harbor plant pests and may require that the owner destroy or treat plant pests, plants, or other material.\n(b) If the owner fails to properly comply with a directive of the commissioner within a given period of time, the commissioner may have any necessary work done at the owner's expense. If the owner does not reimburse the commissioner for the expense within a time specified by the commissioner, the expense is a charge upon the county as provided in subdivision 4.\n(c) If a dangerous plant pest infestation or infection threatens plants of an area in the state, the commissioner may take any measures necessary to eliminate or alleviate the danger.\n(d) The commissioner may collect fees required by this chapter.\n(e) The commissioner may issue and enforce a written or printed \"stop-sale\" order to the owner or custodian of any nursery stock if fees required by the nursery are not paid. The commissioner may not be held liable for the deterioration of nursery stock during the period for which it is held pursuant to a stop-sale order.\nThe commissioner may impose a quarantine to restrict or prohibit the transportation of nursery stock, plants, or other materials capable of carrying plant pests into or through any part of the state.\nIf the commissioner incurs an expense in conjunction with carrying out subdivision 2 and is not reimbursed by the owner of the land, the expense is a legal charge against the land. After the expense is incurred, the commissioner shall file verified and itemized statements of the cost of all services rendered with the county auditor of the county in which the land is located. The county auditor shall place a lien in favor of the commissioner against the land involved, certified by the county auditor, and collected according to section 429.101.\nThe commissioner may, by written agreements, delegate specific inspection, enforcement, and other regulatory duties of this chapter to officials of other agencies. This delegation may only be made to a state agency, a political subdivision, or a political subdivision's agency that has signed a joint powers agreement with the commissioner as provided in section 471.59.\nThe commissioner may disseminate information among live plant dealers regarding the treatment of nursery stock to prevent or eliminate the attack of plant pests and diseases.\nThe commissioner may carry out other duties or responsibilities that are of service to the industry or that may be necessary for the protection of the industry.",
	"repealed": false
}