{
	"id": "124D.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.20",
	"title": "124D.20 COMMUNITY EDUCATION REVENUE.",
	"text": "Total community education revenue equals the sum of a district's general community education revenue, youth service program revenue, and youth after-school enrichment revenue.\nTo be eligible for community education revenue, a district must operate a community education program that complies with section 124D.19.\nThe general community education revenue for a district equals $5.42 for fiscal year 2007 through fiscal year 2024 and $6.35 for fiscal year 2025 and later, times the greater of 1,335 or the population of the district. The population of the district is determined according to section 275.14.\nYouth service program revenue is available to a district that has implemented a youth development plan and a youth service program. Youth service revenue equals $1 times the greater of 1,335 or the population of the district.\nIn fiscal year 2003 and thereafter, youth after-school enrichment revenue for a district operating a youth after-school enrichment program under section 124D.19, subdivision 12, equals:\n(1) $1.85 times the greater of 1,335 or the population of the district, as defined in section 275.14, not to exceed 10,000; and\n(2) $0.43 times the population of the district, as defined in section 275.14, in excess of 10,000. Youth after-school enrichment revenue must be reserved for youth after-school enrichment programs.\nTo obtain total community education revenue, a district may levy the amount raised by a maximum tax rate of 0.94 percent through fiscal year 2024, 0.375 percent in fiscal year 2025, 0.3298 percent in fiscal year 2026, and 0.3128 percent in fiscal year 2027 and later, times the adjusted net tax capacity of the district. If the amount of the total community education levy would exceed the total community education revenue, the total community education levy shall be determined according to subdivision 6.\nIf the amount of the community education levy for a district exceeds the district's community education revenue, the amount of the community education levy is limited to the district's community education revenue according to subdivision 1.\nA district's community education aid is the difference between its community education revenue and the community education levy. If the district does not levy the entire amount permitted, the community education aid must be reduced in proportion to the actual amount levied.\n(a) General community education revenue may be used for:\n(1) nonvocational, recreational, and leisure time activities and programs;\n(2) programs for adults with disabilities, if the programs and budgets are approved by the department;\n(3) adult basic education programs, according to section 124D.52;\n(4) summer programs for elementary and secondary pupils;\n(5) implementation of a youth development plan;\n(6) implementation of a youth service program;\n(7) early childhood family education programs, according to section 142D.10;\n(8) school readiness programs, according to section 142D.05; and\n(9) school-age care programs, according to section 124D.19, subdivision 11.\n(b) In addition to money from other sources, a district may use up to ten percent of its community education revenue for equipment that is used exclusively in community education programs. This revenue may be used only for the following purposes:\n(1) to purchase or lease computers and related materials;\n(2) to purchase or lease equipment for instructional programs; and\n(3) to purchase textbooks and library books.\n(c) General community education revenue must not be used to subsidize the direct activity costs for adult enrichment programs. Direct activity costs include, but are not limited to, the cost of the activity leader or instructor, cost of materials, or transportation costs.\nYouth service revenue may be used to implement a youth development plan approved by the school board and to provide a youth service program according to section 124D.19, subdivision 10.\nCommunity education revenue, which includes aids, levies, fees, grants, and all other revenues received by the school district for community education programs, must be maintained in a reserve account within the community service fund.\nMS 2012 [Repealed, 2012 c 239 art 3 s 6]\nMS 2012 [Repealed, 2012 c 239 art 3 s 6]",
	"repealed": false
}