{
	"id": "123B.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.41",
	"title": "123B.41 DEFINITIONS.",
	"text": "As used in sections 123B.40 to 123B.48, the terms defined in this section shall have the meanings ascribed to them.\n(a) \"Textbook\" means any book or book substitute, including electronic books as well as other printed materials delivered electronically, which a pupil uses as a text or text substitute in a particular class or program in the school regularly attended and a copy of which is expected to be available for the individual use of each pupil in this class or program. Textbook includes an online book with an annual subscription cost. Textbook includes a teacher's edition, teacher's guide, or other materials that accompany a textbook that a pupil uses when the teacher's edition, teacher's guide, or other teacher materials are packaged physically or electronically with textbooks for student use.\n(b) For purposes of calculating the annual nonpublic pupil aid entitlement for textbooks, the term shall be limited to books, workbooks, or manuals, whether bound or in loose-leaf form, as well as electronic books and other printed materials delivered electronically, intended for use as a principal source of study material for a given class or a group of students.\n(c) For purposes of sections 123B.40 to 123B.48, the terms \"textbook\" and \"software or other educational technology\" include only such secular, neutral, and nonideological materials as are available, used by, or of benefit to Minnesota public school pupils.\n\"Standardized tests\" means standardized tests and scoring services which are provided by commercial publishing organizations or the state and which are in use in the public schools of Minnesota to measure the progress of pupils in secular subjects.\n\"Pupil support services\" means guidance and counseling services and health services.\n(a) \"Individualized instructional or cooperative learning materials\" means educational materials which:\n(1) are designed primarily for individual pupil use or use by pupils in a cooperative learning group in a particular class or program in the school the pupil regularly attends, including teacher materials that accompany materials that a pupil uses;\n(2) are secular, neutral, nonideological and not capable of diversion for religious use; and\n(3) are available, used by, or of benefit to Minnesota public school pupils.\n(b) Subject to the requirements in paragraph (a), \"individualized instructional or cooperative learning materials\" include, but are not limited to, the following if they do not fall within the definition of \"textbook\" in subdivision 2: published materials; periodicals; documents; pamphlets; photographs; reproductions; pictorial or graphic works; prerecorded video programs; prerecorded tapes, cassettes and other sound recordings; manipulative materials; desk charts; games; study prints and pictures; desk maps; models; learning kits; blocks or cubes; flash cards; individualized multimedia systems; prepared instructional computer software programs; choral and band sheet music; electronic books and other printed materials delivered electronically; and CD-Rom.\n(c) \"Individualized instructional or cooperative learning materials\" do not include instructional equipment, instructional hardware, or ordinary daily consumable classroom supplies.\nFor purposes of sections 123B.42 and 123B.43, \"software or other educational technology\" includes software, programs, applications, hardware, and any other electronic educational technology. Software or other educational technology includes course registration fees for advanced placement courses delivered online.\n\"Pupils\" means elementary and secondary pupils.\n\"Elementary pupils\" means pupils in grades kindergarten through 6; provided, each kindergarten pupil in a half-day program shall be counted as one-half pupil for all computations pursuant to sections 123B.40 to 123B.42, and 123B.44 to 123B.48.\n\"Secondary pupils\" means pupils in grades 7 through 12.\n\"Nonpublic school\" means any school, church or religious organization, or home school wherein a resident of Minnesota may legally fulfill the compulsory instruction requirements of section 120A.22, which is located within the state, and which meets the requirements of Title VI of the Civil Rights Act of 1964 (Public Law 88-352). It does not mean a public school.\n\"Nonsectarian nonpublic school\" means any nonpublic school as defined in subdivision 9, which is not church related, is not controlled by a church, and does not promote a religious belief.\n\"Pupil\" or \"student\" means a child enrolled in a school and is limited to children who are residents, or children of residents, of Minnesota.\n\"Intermediary service area\" means a school administrative unit approved by the commissioner, other than a single school district, including but not limited to the following:\n(a) a service cooperative;\n(b) a cooperative of two or more school districts;\n(c) learning centers; or\n(d) an association of schools or school districts.\n\"Neutral site\" means a public center, a nonsectarian nonpublic school, a mobile unit located off the nonpublic school premises, or any other location off the nonpublic school premises which is neither physically nor educationally identified with the functions of the nonpublic school.\n\"Guidance and counseling services\" means all activities of a licensed counselor in counseling pupils and parents, providing counseling on learning problems, evaluating the abilities of pupils, assisting pupils in personal and social development and providing referral assistance.\n\"Health services\" means physician, dental, nursing or optometric services and health supplies brought to the site by the health professional for pupil usage in the field of physical or mental health; provided the term does not include direct educational instruction, services which are required pursuant to sections 125A.03 to 125A.24, and 125A.65, and 125A.26 to 125A.48, or services which are eligible to receive special education aid pursuant to section 125A.75.",
	"repealed": false
}