{
	"id": "273.1115",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1115",
	"title": "273.1115 AGGREGATE RESOURCE PRESERVATION PROPERTY TAX LAW.",
	"text": "For purposes of this section, \"commercial aggregate deposit\" and \"actively mined\" have the meanings given them in section 273.13, subdivision 23, paragraph (m).\nReal estate is entitled to valuation under this section only if all of the following requirements are met:\n(1) the property is classified as class 1a, 1b, 2a, or 2b property under section 273.13, subdivisions 22 and 23, or the property is classified as class 2e under section 273.13, subdivision 23, and immediately before being classified as class 2e was classified as class 1a or 1b;\n(2) the property is at least ten contiguous acres, when the application is filed under subdivision 3;\n(3) the owner has filed a completed application for deferment as specified in subdivision 3 with the county assessor in the county in which the property is located;\n(4) there are no delinquent taxes on the property; and\n(5) a covenant on the land restricts its use as provided in subdivision 3, clause (4).\nApplication for valuation deferment under this section must be filed by May 1 of the assessment year. Any application filed and granted continues in effect for subsequent years until the property no longer qualifies, provided that supplemental affidavits under subdivision 8 are timely filed. The application must be filed with the assessor of the county in which the real property is located on such form as may be prescribed by the commissioner of revenue. The application must be executed and acknowledged in the manner required by law to execute and acknowledge a deed and must contain at least the following information and any other information the commissioner deems necessary:\n(1) the legal description of the area;\n(2) the name and address of owner;\n(3) a copy of the affidavit filed under section 273.13, subdivision 23, paragraph (m), when property is classified as 2e under section 273.13, subdivision 23, paragraph (m).\nIn other cases, the application must include a similar document with the same information as contained in the affidavit under section 273.13, subdivision 23, paragraph (m); and\n(4) a statement of proof from the owner that the land contains a restrictive covenant limiting its use for the property's surface to that which exists on the date of the application and limiting its future use to the preparation and removal of the commercial aggregate deposit under its surface. To qualify under this clause, the covenant must be binding on the owner or the owner's successor or assignee, and run with the land, except as provided in subdivision 5 allowing for the cancellation of the covenant under certain conditions.\nUpon timely application by the owner as provided in subdivision 3, notwithstanding sections 272.03, subdivision 8, and 273.11, the value of any qualifying land described in subdivision 3 must be valued as if it were agricultural property, using a per acre valuation equal to the current assessment year's average per acre valuation of agricultural land in the county. The assessor shall not consider any additional value resulting from potential alternative and future uses of the property. The buildings located on the land shall be valued by the assessor in the normal manner.\nThe covenant required under subdivision 3 may be canceled in two ways:\n(1) by the owner beginning with the next subsequent assessment year provided that the additional taxes as determined under subdivision 7 are paid by the owner at the time of cancellation; or\n(2) by the city or town in which the property is located beginning with the next subsequent assessment year, if the city council or town board:\n(i) changes the conditional use of the property;\n(ii) revokes the mining permit; or\n(iii) changes the zoning to disallow mining.\nNo additional taxes are imposed on the property under this clause.\nWithin two years of May 30, 2008, a county may, following notice and public hearing, terminate application of this section in the county. The termination is effective upon adoption of a resolution of the county board. A county has 60 days from receipt of the first application for enrollment under this section to notify the applicant and any subsequent applicants of the county's intent to begin the process of terminating application of this section in the county. The county must act on the termination within six months. Upon termination by a vote of the county board, all applications received prior to and during notification of intent to terminate shall be deemed void. If the county board does not act on the termination within six months of notification, all applications for valuation for deferment received shall be deemed eligible for consideration to be enrolled under this section. Following this initial 60-day grace period, a termination applies prospectively and does not affect property enrolled under this section prior to the termination date. A county may reauthorize application of this section by a resolution of the county board revoking the termination.\nWhen real property which has been valued and assessed under this section no longer qualifies, the portion of the land classified under subdivision 2, clause (1), is subject to additional taxes. The additional tax amount is determined by:\n(1) computing the difference between (i) the current year's taxes determined in accordance with subdivision 4, and (ii) an amount as determined by the assessor based upon the property's current year's estimated market value of like real estate at its highest and best use and the appropriate local tax rate; and\n(2) multiplying the amount determined in clause (1) by the number of years the land was in the program under this section. The current year's estimated market value as determined by the assessor must not exceed the market value that would result if the property was sold in an arms-length transaction and must not be greater than it would have been had the actual bona fide sale price of the property been used in lieu of that market value. The additional taxes must be extended against the property on the tax list for the current year, except that interest or penalties must not be levied on these additional taxes if timely paid. The additional tax under this subdivision must not be imposed on that portion of the property which has actively been mined and has been removed from the program based upon the supplemental affidavits filed under subdivision 8.\nWhen any portion of the property begins to be actively mined, the owner must file a supplemental affidavit within 60 days from the day any aggregate is removed stating the number of acres of the property that is actively being mined. The acres actively being mined shall be (1) valued and classified under section 273.13, subdivision 24, in the next subsequent assessment year, and (2) removed from the aggregate resource preservation property tax program under this section. The additional taxes under subdivision 7 must not be imposed on the acres that are actively being mined and have been removed from the program under this section. Copies of the original affidavit and all supplemental affidavits must be filed with the county assessor, the local zoning administrator, and the Department of Natural Resources, Division of Land and Minerals. A supplemental affidavit must be filed each time a subsequent portion of the property is actively mined, provided that the minimum acreage change is five acres, even if the actual mining activity constitutes less than five acres. Failure to file the affidavits timely shall result in the property losing its valuation deferment under this section, and additional taxes must be imposed as calculated under subdivision 7.\nThe additional tax imposed by this section is a lien upon the property assessed to the same extent and for the same duration as other taxes imposed upon property within this state and, when collected, must be distributed in the manner provided by law for the collection and distribution of other property taxes.\nWhen real property qualifying under subdivision 2 is sold, additional taxes must not be extended against the property if the property continues to qualify under subdivision 2, and the new owner files an application with the assessor for continued deferment within 30 days after the sale.",
	"repealed": false
}