{
	"id": "32D.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/32D.19",
	"title": "32D.19 ADULTERATED DAIRY PRODUCTS.",
	"text": "A person may not sell or knowingly buy adulterated dairy products.\nAn article of food for human consumption may not be manufactured from adulterated milk or cream, except as provided in the Federal Food, Drug, and Cosmetic Act, United States Code, title 21, section 301 et seq., and related federal regulations.\nFor purposes of this section, milk is adulterated if it:\n(1) is drawn in a filthy or unsanitary place;\n(2) is drawn from unhealthy or diseased animals;\n(3) contains water in excess of that normally found in milk;\n(4) contains a substance that is not a normal constituent of the milk except as allowed in this chapter; or\n(5) contains drug residues or other chemical or biological substances in amounts above the tolerances or safe levels established by rule.\n(a) Before processing milk, all bulk milk pickup tankers must be tested for the presence of beta lactam drug residues and for other residues as determined necessary by the commissioner. Milk received from a producer in other than a bulk milk pickup tanker is also subject to this section.\n(b) Bulk milk tankers that confirm positive for beta lactam drug residues or other residues must follow up with producer sample testing of all producers contained on the positive load.\n(c) Individual producer samples must be tested for the presence of beta lactam drug residues at least once a month for four out of every six-month period. Results of these tests must be reported to the commissioner as official producer sample results using established electronic reporting procedures.\n(d) Drug residue testing methods must be those approved by the Food and Drug Administration (FDA) and the National Conference of Interstate Milk Shipments or listed in the FDA's current version of M-a-85.\n(e) All drug residue samples testing positive must be reported to the commissioner or the commissioner's designee within 24 hours. The report must include how and where the milk was disposed of, and the volume, the responsible producer, and the possible cause of the violative residue. All milk sample residue results must be recorded and retained for six months by the receiving plant for examination by the commissioner or the commissioner's designee.\n(a) The permit or certification of a milk producer identified as having a positive drug residue is immediately suspended. The producer must not ship milk while the permit or certification is suspended.\n(b) The producer's permit or certification may be reinstated after being sampled by the commissioner or the commissioner's designee and testing negative on the sample.\n(c) A milk producer may not change plants within 30 days, without permission of the commissioner, after receiving notification from the commissioner of a residue violation.\n(d) The producer that is identified with the drug residue violation is responsible for the value of all milk on any load that tests positive for drug residues and any costs associated with its disposal. Payment shall be made to the purchaser of the milk.\n(e) For the first and second violation within a 12-month period, the dairy producer must, within 30 days of the date of the residue:\n(1) meet with the dairy inspector to review potential causes of the adulteration; and\n(2) complete the designated drug residue prevention educational program with a licensed veterinarian and submit the signed certificate to the commissioner.\n(f) Failure to comply with the requirements for the first and second violation listed in paragraph (e) may result in suspension of the producer's permit or certification until the conditions in paragraph (e) are met.\n(g) For the third or subsequent violation within a 12-month period, the commissioner may initiate proceedings for further enforcement action, that may include a penalty of up to a 30-day permit or certification suspension. In lieu of a suspension, the producer may be assessed an administrative penalty of up to $1,000 or the value of milk sold during the intended suspension period.\nA milk producer who violates subdivision 3 is subject to any of the following penalties:\n(1) the permit or certification of a milk producer identified as having adulterated milk is immediately suspended. The producer may not ship milk while the permit or certification is suspended;\n(2) the producer that is identified with the adulterated milk violation is responsible for the value of all milk on any load that is contaminated by the adulterant and any costs associated with its disposal. Payment shall be made to the purchaser of the milk;\n(3) the producer's permit or certification may be reinstated after the commissioner receives adequate verification that the milk is no longer adulterated; and\n(4) the commissioner may, after evaluation of the severity and repetitive nature of the adulteration, initiate additional enforcement action in the form of permit or certification suspension for up to 30 days or in lieu of suspension, an administrative penalty of up to $1,000, or the value of the milk sold during the intended suspension period for each violation.\nA person other than a milk producer who causes milk to be adulterated is subject to a civil penalty of up to $1,000.\nA dairy producer may appeal an adulteration violation by sending written notice to the commissioner within ten days of receipt of the notice of a violation. The appeal must contain a description of why the producer wishes to appeal the violation.",
	"repealed": false
}