{
	"id": "282.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.241",
	"title": "282.241 REPURCHASE AFTER FORFEITURE.",
	"text": "The owner at the time of forfeiture, or the owner's heirs, devisees, or representatives, or any person to whom the right to pay taxes was given by statute, mortgage, or other agreement, may repurchase any parcel of land claimed by the state to be forfeited to the state for taxes unless before the time repurchase is made the parcel is sold under installment payments, or otherwise, by the state as provided by law, or is under mineral prospecting permit or lease, or proceedings have been commenced by the state or any of its political subdivisions or by the United States to condemn the parcel of land. The parcel of land may be repurchased for the sum of all delinquent taxes and assessments computed under section 282.251, together with penalties, interest, and costs, that accrued or would have accrued if the parcel of land had not forfeited to the state. Except for property which was homesteaded on the date of forfeiture, repurchase is permitted during six months only from the date of forfeiture, and in any case only after the adoption of a resolution by the board of county commissioners determining that by repurchase undue hardship or injustice resulting from the forfeiture will be corrected, or that permitting the repurchase will promote the use of the lands that will best serve the public interest. If the county board has good cause to believe that a repurchase installment payment plan for a particular parcel is unnecessary and not in the public interest, the county board may require as a condition of repurchase that the entire repurchase price be paid at the time of repurchase. A repurchase is subject to any easement, lease, or other encumbrance granted by the state before the repurchase, and if the land is located within a restricted area established by any county under Laws 1939, chapter 340, the repurchase must not be permitted unless the resolution approving the repurchase is adopted by the unanimous vote of the board of county commissioners. Notwithstanding the foregoing, any application to repurchase a property that is made available for sale pursuant to section 282.005 must be made before the date of that sale.\nThe person seeking to repurchase under this section shall pay all maintenance costs incurred by the county auditor during the time the property was tax-forfeited.\nA county board may by resolution establish an alternative method of computing the repurchase amount under this subdivision for property homesteaded at the time of forfeiture that has been in forfeited status for more than ten years. Equivalent taxes, penalties, interest, and costs for each year the property was in forfeiture status must be computed using the simple average of the assessor's estimated market value at forfeiture and the assessor's current estimated market value multiplied by the classification rates under current law and applying the current tax, penalty, and interest rates. Those amounts, plus any unpaid special assessments reinstated and included in the purchase price under section 282.251, including the penalties and interest that accrued or would have accrued on the special assessments, computed under current rates, are the repurchase price. The county assessor shall determine the current market value and classification of the property.",
	"repealed": false
}