{
	"id": "272.0295",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.0295",
	"title": "272.0295 SOLAR ENERGY PRODUCTION TAX.",
	"text": "A tax is imposed on the production of electricity from a solar energy generating system used as an electric power source.\n(a) For the purposes of this section, the term \"solar energy generating system\" means a set of devices whose primary purpose is to produce electricity by means of any combination of collecting, transferring, or converting solar generated energy.\n(b) The total size of a solar energy generating system under this subdivision shall be determined according to this paragraph. Unless the systems are interconnected with different distribution systems, the nameplate capacity of a solar energy generating system shall be combined with the nameplate capacity of any other solar energy generating system that:\n(1) is constructed within the same 12-month period as the solar energy generating system; and\n(2) exhibits characteristics of being a single development, including but not limited to ownership structure, an umbrella sales arrangement, shared interconnection, revenue-sharing arrangements, and common debt or equity financing.\nIn the case of a dispute, the commissioner of commerce shall determine the total size of the system and shall draw all reasonable inferences in favor of combining the systems.\nFor the purposes of making a determination under this paragraph, the original construction date of an existing solar energy conversion system is not changed if the system is replaced, repaired, or otherwise maintained or altered.\n(c) In making a determination under paragraph (b), the commissioner of commerce may determine that two solar energy generating systems are under common ownership when the underlying ownership structure contains similar persons or entities, even if the ownership shares differ between the two systems. Solar energy generating systems are not under common ownership solely because the same person or entity provided equity financing for the systems.\n(a) For a solar energy generating system with a capacity exceeding one megawatt alternating current, the tax is $1.20 per megawatt-hour.\n(b) A solar energy generating system with a capacity of one megawatt alternating current or less is exempt from the tax imposed under this section.\nAn owner of a solar energy generating system subject to tax under this section shall file a report with the commissioner of revenue annually on or before January 15 detailing the amount of electricity in megawatt-hours that was produced by the system in the previous calendar year. The commissioner shall prescribe the content, format, and manner of the report pursuant to section 270C.30. The report must contain the information required by the commissioner to determine the tax due to each county under this section for the current year. If an owner of a solar energy generating system subject to taxation under this section fails to file the report by the due date, the commissioner of revenue shall determine the tax based upon the nameplate capacity of the system multiplied by a capacity factor of 30 percent.\n(a) On or before February 28, the commissioner of revenue shall notify the owner of each solar energy generating system of the tax due to each county for the current year and shall certify to the county auditor of each county in which the system is located the tax due from each owner for the current year.\n(b) If the commissioner of revenue determines that the amount of production tax has been erroneously calculated, the commissioner may correct the error. The commissioner must notify the owner of the solar energy generating system of the correction and the amount of tax due to each county and must certify the correction to the county auditor of each county in which the system is located on or before April 1 of the current year. The commissioner may correct errors that are clerical in nature until December 31.\nThe amount of production tax determined under subdivision 5 must be paid to the county treasurer at the time and in the manner provided for payment of property taxes under section 277.01, subdivision 3, and, if unpaid, is subject to the same enforcement, collection, and interest and penalties as delinquent personal property taxes. Except to the extent inconsistent with this section, the provisions of sections 277.01 to 277.24 and 278.01 to 278.14 apply to the taxes imposed under this section, and for purposes of those provisions, the taxes imposed under this section are considered personal property taxes.\nRevenues from the taxes imposed under this section must be part of the settlement between the county treasurer and the county auditor under section 276.09. The revenue must be distributed by the county auditor or the county treasurer to local taxing jurisdictions in which the solar energy generating system is located as follows: 80 percent to counties and 20 percent to cities and townships.\nThe commissioner may, for good cause, extend the time for filing the report required by subdivision 4. The extension must not exceed 15 days.",
	"repealed": false
}