{
	"id": "302A.447",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.447",
	"title": "302A.447 VOTING OF SHARES BY ORGANIZATIONS AND LEGAL REPRESENTATIVES.",
	"text": "Shares of a corporation registered in the name of another domestic or foreign corporation may be voted by the chief executive officer or another legal representative of that domestic or foreign corporation.\nExcept as provided in subdivision 3, shares of a corporation registered in the name of a subsidiary are not entitled to be voted on any matter.\nShares of a corporation in the name of or under the control of the corporation or a subsidiary in a fiduciary capacity are not entitled to be voted on any matter, except to the extent that the settlor or beneficial owner possesses and exercises a right to vote or gives the corporation or, with respect to shares in the name of or under control of a subsidiary, the subsidiary, binding instructions on how to vote the shares.\nShares under the control of a person in a capacity as a personal representative, an administrator, executor, guardian, conservator, or attorney-in-fact may be voted by the person, either in person or by proxy, without registration of those shares in the name of the person. Shares registered in the name of a trustee of a trust or in the name of a custodian may be voted by the person, either in person or by proxy, but a trustee of a trust or a custodian shall not vote shares held by the person unless they are registered in the name of the person.\nShares registered in the name of a trustee in bankruptcy or a receiver may be voted by the trustee or receiver either in person or by proxy. Shares under the control of a trustee in bankruptcy or a receiver may be voted by the trustee or receiver without registering the shares in the name of the trustee or receiver, if authority to do so is contained in an appropriate order of the court by which the trustee or receiver was appointed.\nShares registered in the name of an organization not described in subdivisions 1 to 5 may be voted either in person or by proxy by the legal representative of that organization.\nA shareholder whose shares are pledged may vote those shares until the shares are registered in the name of the pledgee. If the corporation pledges its own shares under section 302A.553, subdivision 1, the corporation shall not be entitled to vote the shares at a meeting or otherwise.",
	"repealed": false
}