{
	"id": "325G.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.16",
	"title": "325G.16 RESTRICTIONS.",
	"text": "In a consumer credit sale, the seller or lessor may not take a negotiable instrument other than a check as evidence of the obligation of the buyer or lessee. A holder is not in good faith if the holder takes a negotiable instrument with notice that it is issued in violation of this section.\nNo contract or obligation relating to a consumer credit sale shall contain any provision by which:\n(a) the consumer agrees not to assert against an assignee any claim or defense arising out of the transaction;\n(b) in the absence of consumer's default, the holder may arbitrarily and without reasonable cause, accelerate the maturity of any part or all of the amount owing thereunder;\n(c) a power of attorney is given to confess judgment in this state, or an assignment of wages is given;\n(d) the seller or holder of the contract or obligation, or a person acting on the seller's or holder's behalf, is given authority to enter upon the consumer's premises unlawfully or to commit any breach of the peace in the repossession of the goods;\n(e) the consumer waives any right of action against the seller or holder of the contract or obligation, or any other person acting on the seller's or holder's behalf, for any illegal act committed in the collection of payments under the contract or obligation or in the repossession of goods;\n(f) the consumer relieves the seller from any liability for any legal remedy which the consumer may have against the seller under the contract or obligation or any separate instrument executed in connection therewith.\nAny assignee of the contract or obligation relating to the consumer credit sale shall be subject to all claims and defenses of the consumer against the seller arising from the sale, notwithstanding any agreement to the contrary. Provided, however, that the assignee's liability under this subdivision shall not exceed the amount owing to the assignee at the time the claim or defense is asserted against the assignee. The rights of the consumer under this subdivision can only be asserted as a matter of defense to or set off against a claim by the assignee.\nAny lease or bailment of goods which constitutes a consumer credit sale shall be deemed to be a sale for all purposes. The interest retained by the bailor or lessor in any such transaction shall be a security interest only.\nAll contracts or obligations in the form of terminable bailment or lease of goods relating to consumer credit sales shall specify whether the goods which are the subject of the sale are new or used.",
	"repealed": false
}