{
	"id": "13.643",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.643",
	"title": "13.643 AGRICULTURAL DATA.",
	"text": "(a) Loan and grant applicant data. The following data on applicants, collected by the Department of Agriculture in its sustainable agriculture grant program under section 17.116, are private or nonpublic: nonfarm income; credit history; insurance coverage; machinery and equipment list; financial information; and credit information requests.\n(b) Farm advocate data. The following data supplied by farmer clients to Minnesota farm advocates and to the Department of Agriculture are private data on individuals: financial history, including listings of assets and debts, and personal and emotional status information.\nThe following data collected and maintained by counties that provide assistance to individual farmers who are experiencing economic or emotional distress are classified as private data: financial history, including listings of assets and debts, and personal and emotional status information.\nThe following data collected and maintained by an agency issuing aquaculture permits under sections 17.47 to 17.498 are classified as private or nonpublic: the names and addresses of customers provided in the permit application.\n[Repealed, 2001 c 202 s 21]\nAll data received by the Department of Agriculture from the United States Department of Health and Human Services, the Food and Drug Administration, and the Agriculture, Food Safety, and Inspection Service that are necessary for the purpose of carrying out the Department of Agriculture's statutory food safety regulatory and enforcement duties are classified as nonpublic data under section 13.02, subdivision 9, and private data on individuals under section 13.02, subdivision 12. This section does not preclude the obligation of the Department of Agriculture to appropriately inform consumers of issues that could affect public health.\n(a) Except for farmed Cervidae premises location data collected and maintained under section 35.155, the following data collected and maintained by the Board of Animal Health related to registration and identification of premises and animals under chapter 35, are classified as private or nonpublic:\n(1) the names and addresses;\n(2) the location of the premises where animals are kept; and\n(3) the identification number of the premises or the animal.\n(b) Except as provided in section 347.58, subdivision 5, data collected and maintained by the Board of Animal Health under sections 347.57 to 347.64 are classified as private or nonpublic.\n(c) The Board of Animal Health may disclose data collected under paragraph (a) or (b) to any person, agency, or to the public if the board determines that the access will aid in the law enforcement process or the protection of public or animal health or safety.\n(a) Except as provided in paragraph (b), the following data created, collected, or maintained by the Department of Agriculture or the University of Minnesota during research, monitoring, or the assessment of farm practices and related to natural resources, the environment, agricultural facilities, or agricultural practices are classified as private or nonpublic:\n(1) names, addresses, telephone numbers, and email addresses of study participants or cooperators;\n(2) location of research, study site, and global positioning system data; and\n(3) data created, collected, or maintained by the University of Minnesota for inclusion on an agricultural data analysis platform maintained and hosted by the University of Minnesota that identify or could identify an individual or business.\n(b) The following data are public:\n(1) location data and unique well numbers for wells and springs unless protected under section 18B.10 or another statute or rule; and\n(2) data from samples collected from a public water supply as defined in section 144.382, subdivision 4.\n(c) The Department of Agriculture or the University of Minnesota may disclose data collected under paragraph (a) if the Department of Agriculture or the University of Minnesota determines that there is a substantive threat to human health and safety or to the environment, or to aid in the law enforcement process. The Department of Agriculture or the University of Minnesota may also disclose data with written consent of the subject of the data.\n(a) The following data collected and maintained by the Department of Agriculture, Minnesota State Colleges and Universities, and any other pass-through recipients about any individual who seeks assistance with a mental or behavioral health issue or who contacts the Minnesota Farm and Rural Helpline are private or nonpublic:\n(1) data that identify the individual; and\n(2) data provided by the individual identifying another person.\n(b) The Department of Agriculture, Minnesota State Colleges and Universities, and any other pass-through recipients may release data collected under this subdivision to appropriate parties in connection with an emergency if knowledge of the data is necessary to protect the health or safety of any person.",
	"repealed": false
}