{
	"id": "237.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.01",
	"title": "237.01 DEFINITIONS.",
	"text": "As used in this chapter, the following terms have the meanings given.\n[Renumbered subd 7]\n\"Independent telephone company\" means a telephone company organized and operating under chapter 301 or 302A or authorized to do business in Minnesota under chapter 303 as of January 1, 1983, and providing local exchange service to fewer than 30,000 subscribers within the state.\n\"Radio common carrier\" means a person, firm, association, or corporation which owns, operates, or otherwise furnishes to the public any paging or other mobile telecommunications service by means of the use of radio signals and connection to a telephone network.\n[Repealed, 1984 c 557 s 4]\n\"Telecommunications carrier\" means a person, firm, association, or corporation authorized to furnish one or more of the following telephone services to the public, but not otherwise authorized to furnish local exchange service: (1) interexchange telephone service; (2) local telephone service pursuant to a certificate granted under the authority of section 237.16, subdivision 4, before August 1, 1995; or (3) local service pursuant to a certificate granted under section 237.16, for the first time after August 1, 1995, except if granted to a successor to a telephone company otherwise authorized to furnish local exchange service. Telecommunications carrier does not include entities that derive more than 50 percent of their revenues from operator services provided to transient locations such as hotels, motels, and hospitals. In addition, telecommunications carrier does not include entities that provide centralized equal access services.\n\"Telecommunications service\" means the offering of telecommunications for a fee directly to the public or to such classes of users as to be effectively available to the public regardless of the facilities used.\n\"Telecommunications service provider\" means any provider of telecommunications service.\n\"Telephone company\" means and applies to any person, firm, association or any corporation, private or municipal, owning or operating any telephone line or telephone exchange for hire, wholly or partly within this state, or furnishing any telephone service to the public.\nA \"telephone company\" does not include a radio common carrier as defined in subdivision 4. A telephone company which also conforms with the definition of a radio common carrier is subject to regulation as a telephone company. However, none of chapter 237 applies to telephone company activities which conform to the definition of a radio common carrier.\nA \"telephone company\" does not include a telecommunications carrier as defined in subdivision 6, except that a telecommunications carrier is a telephone company for the purposes of section 222.36. A telephone company is not subject to section 237.74.\n\"Local exchange carrier\" means a telephone company or telecommunications carrier providing local exchange service.\n\"Wholesale transport provider\" means any person, firm, association, or corporation that carries, delivers, routes, or transports any telecommunications service subject to the commission's jurisdiction, directly or indirectly, but is not certified in Minnesota to provide retail telecommunications service to the public.",
	"repealed": false
}