{
	"id": "62N.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/62N.29",
	"title": "62N.29 GUARANTEEING ORGANIZATION.",
	"text": "(a) A community network may satisfy its net worth and deposit requirements, in whole or in part, through the use of one or more guaranteeing organizations, with the approval of the commissioner, under the conditions permitted in this section. If the guaranteeing organization is used only to satisfy the deposit requirement, the requirements of this section do not apply to the guaranteeing organization.\n(b) For purposes of this section, a \"guaranteeing organization\" means an organization that has agreed to assume the responsibility for the obligation of the community network's net worth requirement.\n(c) Governmental entities, such as counties, may serve as guaranteeing organizations subject to the requirements of this section.\nUpon an order of rehabilitation or liquidation, a guaranteeing organization shall transfer funds to the commissioner in the amount necessary to satisfy the net worth requirement.\n(a) A community network's net worth requirement may be guaranteed provided that the guaranteeing organization:\n(1) transfers into a restricted asset account cash or securities permitted by section 61A.28, subdivisions 2 and 6, in an amount necessary to satisfy the net worth requirement. Restricted asset accounts shall be considered admitted assets for the purpose of determining whether a guaranteeing organization is maintaining sufficient net worth. Permitted securities shall not be transferred to the restricted asset account in excess of the limits applied to the community network, unless approved by the commissioner in advance;\n(2) designates the restricted asset account specifically for the purpose of funding the community network's net worth requirement;\n(3) maintains positive working capital subsequent to establishing the restricted asset account, if applicable;\n(4) maintains net worth, retained earnings, or surplus in an amount in excess of the amount of the restricted asset account, if applicable, and allows the guaranteeing organization:\n(i) to remain a solvent business organization, which shall be evaluated on the basis of the guaranteeing organization's continued ability to meet its maturing obligations without selling substantially all its operating assets and paying debts when due; and\n(ii) to be in compliance with any state or federal statutory net worth, surplus, or reserve requirements applicable to that organization or lesser requirements agreed to by the commissioner; and\n(5) fulfills requirements of clauses (1) to (4) by April 1 of each year.\n(b) The commissioner may require the guaranteeing organization to complete the requirements of paragraph (a) more frequently if the amount necessary to satisfy the net worth requirement increases during the year.\nWhen a guaranteeing organization is a governmental entity, subdivision 3 is not applicable. The commissioner may consider factors which provide evidence that the governmental entity is a financially reliable guaranteeing organization. Similarly, when a guaranteeing organization is a Minnesota-licensed health maintenance organization, health service plan corporation, or insurer, subdivision 3, paragraph (a), clauses (1) and (2), are not applicable.\nThe amount necessary for a guaranteeing organization to satisfy the community network's net worth requirement is the lesser of:\n(1) an amount needed to bring the community network's net worth to the amount required by section 62N.28; or\n(2) an amount agreed to by the guaranteeing organization.\n(a) If a guaranteeing organization guarantees one or more community networks, the guaranteeing organization may calculate the amount necessary to satisfy the community networks' net worth requirements on a consolidated basis.\n(b) Liabilities of the community network to the guaranteeing organization must be subordinated in the same manner as preferred ownership claims under section 60B.44, subdivision 10.\nA written agreement between the guaranteeing organization and the community network must include the commissioner as a party and include the following provisions:\n(1) any or all of the funds needed to satisfy the community network's net worth requirement shall be transferred, unconditionally and upon demand, according to subdivision 2;\n(2) the arrangement shall not terminate for any reason without the commissioner being notified of the termination at least nine months in advance. The arrangement may terminate earlier if net worth requirements will be satisfied under other arrangements, as approved by the commissioner;\n(3) the guaranteeing organization shall pay or reimburse the commissioner for all costs and expenses, including reasonable attorney fees and costs, incurred by the commissioner in connection with the protection, defense, or enforcement of the guarantee;\n(4) the guaranteeing organization shall waive all defenses and claims it may have or the community network may have pertaining to the guarantee including, but not limited to, waiver, release, res judicata, statute of frauds, lack of authority, usury, illegality;\n(5) the guaranteeing organization waives present demand for payment, notice of dishonor or nonpayment and protest, and the commissioner shall not be required to first resort for payment to other sources or other means before enforcing the guarantee;\n(6) the guarantee may not be waived, modified, amended, terminated, released, or otherwise changed except as provided by the guarantee agreement, and as provided by applicable statutes;\n(7) the guaranteeing organization waives its rights under the Federal Bankruptcy Code, United States Code, title 11, section 303, to initiate involuntary proceedings against the community network and agrees to submit to the jurisdiction of the commissioner and Minnesota state courts in any rehabilitation or liquidation of the community network;\n(8) the guarantee shall be governed by and construed and enforced according to the laws of the state of Minnesota; and\n(9) the guarantee must be approved by the commissioner.\nThe community network shall submit to the commissioner the guaranteeing organization's audited financial statements annually by April 1 or at a different date if agreed to by the commissioner. The community network shall also provide other relevant financial information regarding a guaranteeing organization as may be requested by the commissioner.\nNo provider may be compelled to serve as a guaranteeing organization.\nAny or all of the funds in excess of the amounts needed to satisfy the community network's obligations as of the date of an order of liquidation or rehabilitation shall be returned to the guaranteeing organization in the same manner as preferred ownership claims under section 60B.44, subdivision 10.",
	"repealed": false
}