{
	"id": "356.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.001",
	"title": "356.001 PURPOSE OF PUBLIC PLANS.",
	"text": "(a) The public plans and funds specified in subdivision 4 are established to provide for the retirement of their members and to provide funds for the beneficiaries of members in the event of death of a member.\n(b) The public plans and funds are established and must be maintained for the exclusive benefit of the members and the beneficiaries of the members. Except as provided in subdivisions 2 and 3, no part of the moneys of the plans and funds may revert to the plan or fund or be used for or diverted to purposes other than the exclusive benefit of the members or their beneficiaries.\nThe necessary, reasonable, and direct expenses of maintaining, protecting, and administering the public plan or fund, as authorized in the laws governing the plan or fund, must be considered as expenditures for the exclusive benefit of the members or their beneficiaries.\n(a) If a public plan or fund defined in subdivision 4 is terminated or the plan or fund provisions are amended, no part of the moneys held in the plan or fund may be used for or diverted to any purpose other than the exclusive benefit of the members or their beneficiaries, except as provided in this subdivision.\n(b) If a plan or fund is terminated, all affected members have a nonforfeitable interest in their benefits that were accrued and funded to date. The value of the accrued benefits to be credited to the account of each affected member must be calculated as of the date of termination and the funding ratio of the plan or fund must be applied to the accrued benefit of each affected member.\n(c) The board of trustees of the plan or fund shall, as soon as administratively feasible following the termination, pay each eligible member or beneficiary on behalf of a member the amount in the member's account in a lump sum. In the case of a member whose whereabouts is unknown, the board shall notify the member at the last known address by certified mail with return receipt requested advising the member of the member's right to a pending distribution. If the member cannot be located in this manner, the board shall establish a custodial account for the member's benefit in a federally insured bank, savings association, or credit union in which the member's account balance must be deposited. If the board receives proof of death of a member that is satisfactory to the board, the account balance must be paid to the beneficiary of the member.\nThis section applies to all public pension and retirement plans and funds established under the laws of the state of Minnesota that receive contributions from moneys derived from taxation.\nNothing contained in this section may be construed to authorize, or otherwise imply, a legislative policy or intent favoring the termination of any plan or fund to which this section applies.",
	"repealed": false
}