{
	"id": "327.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.73",
	"title": "327.73 UNDESIRABLE GUESTS; EJECTION OF, AND REFUSAL TO ADMIT.",
	"text": "(a) An innkeeper may remove or cause to be removed from a hotel a guest or other person who:\n(1) refuses or is unable to pay for accommodations or services;\n(2) while on the premises of the hotel acts in an obviously intoxicated or disorderly manner, destroys or threatens to destroy hotel property, or causes or threatens to cause a disturbance;\n(3) the innkeeper reasonably believes is using the premises for the unlawful possession or use of controlled substances by the person in violation of chapter 152, or using the premises for the consumption of alcohol by a person under the age of 21 years in violation of section 340A.503;\n(4) the innkeeper reasonably believes has brought property into the hotel that may be dangerous to other persons, such as firearms or explosives;\n(5) violates any federal, state, or local laws, ordinances, or rules relating to the hotel; or\n(6) violates a rule of the hotel that is clearly and conspicuously posted at or near the front desk and on the inside of the entrance door of every guest room.\n(b) If the guest has paid in advance, the innkeeper shall tender to the guest any unused portion of the advance payment at the time of removal.\n(a) An innkeeper may refuse to admit or refuse service or accommodations to a person who:\n(1) while on the premises of the hotel acts in an obviously intoxicated or disorderly manner, destroys or threatens to destroy hotel property, or causes or threatens to cause a public disturbance;\n(2) the innkeeper reasonably believes is seeking accommodations for the unlawful possession or use of controlled substances in violation of chapter 152 or the use of the premises for the consumption of intoxicating liquor by a person under the age of 21 years in violation of section 340A.503; or\n(3) the innkeeper reasonably believes is bringing property into the hotel that may be dangerous to other persons, such as firearms or explosives.\n(b) An innkeeper also may refuse to admit or refuse service or accommodations to a person who refuses or is unable to pay for the accommodations or services. An innkeeper may require the prospective guest to demonstrate an ability to pay. An innkeeper may require a parent or guardian of a minor to accept liability for the proper charges for the minor's accommodation, board, room, lodging, and any damages to the guest room or its furniture or furnishings caused by the minor, and provide a credit card to cover the charges. When the parent or guardian cannot provide a credit card, the innkeeper may require the parent or guardian to make an advance cash deposit to cover the charges for the guest room, plus a cash damage deposit in an amount not exceeding $100 for payment of any additional charges by the minor or any damages to the guest room or its furniture or furnishings. The innkeeper shall refund the damage deposit to the extent it is not used to cover any reasonable charges or damages.\n(c) An innkeeper may limit the number of persons who may occupy a particular guest room in the hotel.\nA guest or person who remains or attempts to remain in a hotel after having been requested to leave for the reason or reasons specified in this section is guilty of a misdemeanor.\nNotwithstanding the above, the removal of or the refusal to admit a guest or person under this section shall not be based on a discriminatory reason otherwise deemed unlawful by section 363A.11 or 363A.19.",
	"repealed": false
}