{
	"id": "18C.425",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.425",
	"title": "18C.425 APPLICATION AND INSPECTION FEES.",
	"text": "(a) An application for a license for each fixed location to be covered by the license within the state must be accompanied by a nonrefundable application fee of $100.\n(b) An application for a license for all fixed locations of a firm outside of the state must be accompanied by a nonrefundable application fee of $100.\n(c) An application for a license to cover mobile mechanical units must be accompanied by a nonrefundable application fee of $100 for the first unit operated by one distributor and $50 for each additional mobile mechanical unit.\nAn application for registration of a specialty fertilizer must be accompanied by a nonrefundable application fee of $100 for each brand and grade to be sold or distributed as provided in section 18C.411.\nAn application for registration of a soil amendment or plant amendment must be accompanied by a nonrefundable application fee of $200 for each brand sold or distributed as provided in section 18C.411.\nAn application for a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment permit must be accompanied by a nonrefundable application fee of $125.\nIf an application for renewal of a registration under section 18C.411 or a license under section 18C.415 is submitted to the commissioner after December 31, an additional late fee of one-half of the amount due must be paid in addition to the application fee before the renewal license or registration may be issued.\n[Repealed, 2007 c 45 art 1 s 66]\n(a) The person who registers and distributes in the state a specialty fertilizer, soil amendment, or plant amendment under section 18C.411 shall pay the inspection fee to the commissioner.\n(b) The person licensed under section 18C.415 who distributes a fertilizer to a person not required to be so licensed shall pay the inspection fee to the commissioner, except as exempted under section 18C.421, subdivision 1, paragraph (b).\n(c) The person responsible for payment of the inspection fees for fertilizers, soil amendments, or plant amendments sold and used in this state must pay the inspection fee set under paragraph (e), and until June 30, 2029, an additional 40 cents per ton, of fertilizer, soil amendment, and plant amendment sold or distributed in this state, with a minimum of $10 on all tonnage reports. Notwithstanding section 18C.131, the commissioner must deposit all revenue from the additional 40 cents per ton fee in the agricultural fertilizer research and education account in section 18C.80. Products sold or distributed to manufacturers or exchanged between them are exempt from the inspection fee imposed by this subdivision if the products are used exclusively for manufacturing purposes.\n(d) A registrant or licensee must retain invoices showing proof of fertilizer, plant amendment, or soil amendment distribution amounts and inspection fees paid for a period of three years.\n(e) By commissioner's order, the commissioner must set the inspection fee at no less than 39 cents per ton and no more than 70 cents per ton. The commissioner must hold a public meeting before increasing the fee by more than five cents per ton.",
	"repealed": false
}