{
	"id": "525A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/525A.23",
	"title": "525A.23 FACILITATION OF ANATOMICAL GIFT FROM DECEDENT WHOSE BODY IS UNDER JURISDICTION OF MEDICAL EXAMINER.",
	"text": "(a) Upon request of a procurement organization, a medical examiner shall release to the procurement organization the name, contact information, and available medical and social history of a decedent whose body is under the jurisdiction of the medical examiner. If the decedent's body or part is medically suitable for transplantation, therapy, research, or education, the medical examiner shall release postmortem examination results to the procurement organization. The procurement organization may make a subsequent disclosure of the postmortem examination results or other information received from the medical examiner only if relevant to transplantation or therapy.\n(b) The medical examiner may conduct a medicolegal examination by reviewing all medical records, laboratory test results, x-rays, other diagnostic results, and other information that any person possesses about a donor or prospective donor whose body is under the jurisdiction of the medical examiner which the medical examiner determines may be relevant to the investigation.\n(c) A person that has any information requested by a medical examiner pursuant to paragraph (b) shall provide that information as expeditiously as possible to allow the medical examiner to conduct the medicolegal investigation within a period compatible with the preservation of parts for the purpose of transplantation, therapy, research, or education.\n(d) If an anatomical gift has been or might be made of a part of a decedent whose body is under the jurisdiction of the medical examiner and a postmortem examination is not required, or the medical examiner determines that a postmortem examination is required but that the recovery of the part that is the subject of an anatomical gift will not interfere with the examination, the medical examiner and procurement organization shall cooperate in the timely removal of the part from the decedent for the purpose of transplantation, therapy, research, or education.\n(e) If an anatomical gift of a part from the decedent under the jurisdiction of the medical examiner has been or might be made, but the medical examiner initially believes that the recovery of the part could interfere with the postmortem investigation into the decedent's cause or manner of death, the medical examiner shall consult with the procurement organization or physician or technician designated by the procurement organization about the proposed recovery. After consultation, the medical examiner may allow the recovery.\n(f) Following the consultation under paragraph (e), in the absence of mutually agreed-upon protocols to resolve conflict between the medical examiner and the procurement organization, if the medical examiner intends to deny recovery of an organ for transplantation, the medical examiner or designee, at the request of the procurement organization, shall attend the removal procedure for the part before making a final determination not to allow the procurement organization to recover the part. During the removal procedure, the medical examiner or designee may allow recovery by the procurement organization to proceed, or, if the medical examiner or designee reasonably believes that the part may be involved in determining the decedent's cause or manner of death, deny recovery by the procurement organization.\n(g) If the medical examiner or designee denies recovery under paragraph (f), the medical examiner or designee shall:\n(1) explain in a record the specific reasons for not allowing recovery of the part;\n(2) include the specific reasons in the records of the medical examiner; and\n(3) provide a record with the specific reasons to the procurement organization.\n(h) If the medical examiner or designee allows recovery of a part under paragraph (d), (e), or (f), the procurement organization, upon request, shall cause the physician or technician who removes the part to provide the medical examiner with a record describing the condition of the part, a biopsy, a photograph, and any other information and observations that would assist in the postmortem examination.\n(i) If a medical examiner or designee is required to be present at a removal procedure under paragraph (f), upon request the procurement organization requesting the recovery of the part shall reimburse the medical examiner or designee for the additional costs incurred in complying with paragraph (f).",
	"repealed": false
}