{
	"id": "359.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/359.085",
	"title": "359.085 STANDARDS OF CONDUCT FOR NOTARIAL ACTS.",
	"text": "In taking an acknowledgment, the notarial officer must determine, either from personal knowledge or from satisfactory evidence, that the person appearing before the officer and making the acknowledgment is the person whose true signature is on the instrument or electronic record.\nIn taking a verification upon oath or affirmation, the notarial officer must determine, either from personal knowledge or from satisfactory evidence, that the person appearing before the officer and making the verification is the person whose true signature is made in the presence of the officer on the statement verified.\nIn witnessing or attesting a signature, the notarial officer must determine, either from personal knowledge or from satisfactory evidence, that the signature is that of the person appearing before the officer and named in the document or electronic record. When witnessing or attesting a signature, the officer must be present when the signature is made.\nIn certifying or attesting a copy of a document, electronic record, or other item, the notarial officer must determine that the proffered copy is a full, true, and accurate transcription or reproduction of that which was copied.\nIn making or noting a protest of a negotiable instrument or electronic record, the notarial officer must determine the matters set forth in section 336.3-505.\nA notarial officer has satisfactory evidence that a person is the person whose true signature is on a document or electronic record if that person (i) is personally known to the notarial officer, (ii) is identified upon the oath or affirmation of a credible witness personally known to the notarial officer, or (iii) is identified on the basis of identification documents.\nA notarial officer may not acknowledge, witness or attest to the officer's own signature, or take a verification of the officer's own oath or affirmation.\n[Repealed, 2007 c 148 art 2 s 84]",
	"repealed": false
}