{
	"id": "148F.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.04",
	"title": "148F.04 SUPERVISED POSTDEGREE PROFESSIONAL PRACTICE.",
	"text": "For the purposes of this section, \"supervision\" means documented interactive consultation, which, subject to the limitations of subdivision 4, paragraph (b), may be conducted in person, by telephone, or by audio or audiovisual electronic device by a supervisor with a supervisee. The supervision must be adequate to ensure the quality and competence of the activities supervised. Supervisory consultation must include discussions on the nature and content of the practice of the supervisee, including, but not limited to, a review of a representative sample of alcohol and drug counseling services in the supervisee's practice.\n\"Postdegree professional practice\" means paid or volunteer work experience and training following graduation from an accredited school or educational program that involves professional oversight by a supervisor approved by the board and that satisfies the supervision requirements in subdivision 4.\nFor the purposes of this section, a supervisor shall:\n(1) be a licensed alcohol and drug counselor or other qualified professional as determined by the board;\n(2) have three years of experience providing alcohol and drug counseling services; and\n(3) have received a minimum of 12 hours of training in clinical and ethical supervision, which may include course work, continuing education courses, workshops, or a combination thereof.\n(a) The content of supervision must include:\n(1) knowledge, skills, values, and ethics with specific application to the practice issues faced by the supervisee, including the core functions in section 148F.01, subdivision 10;\n(2) the standards of practice and ethical conduct, with particular emphasis given to the counselor's role and appropriate responsibilities, professional boundaries, and power dynamics; and\n(3) the supervisee's permissible scope of practice, as defined in section 148F.01, subdivision 18.\n(b) The supervision must be obtained at the rate of one hour of supervision per 40 hours of professional practice, for a total of 50 hours of supervision. The supervision must be evenly distributed over the course of the supervised professional practice. At least 75 percent of the required supervision hours must be received in person. The remaining 25 percent of the required hours may be received by telephone or by audio or audiovisual electronic device. At least 50 percent of the required hours of supervision must be received on an individual basis. The remaining 50 percent may be received in a group setting.\n(c) The supervision must be completed in no fewer than 12 consecutive months and no more than 36 consecutive months.\n(d) The applicant shall include with an application for licensure a verification of completion of the 2,000 hours of supervised professional practice. Verification must be on a form specified by the board. The supervisor shall verify that the supervisee has completed the required hours of supervision according to this section. The supervised practice required under this section is unacceptable if the supervisor attests that the supervisee's performance, competence, or adherence to the standards of practice and ethical conduct has been unsatisfactory.",
	"repealed": false
}