{
	"id": "103E.805",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.805",
	"title": "103E.805 REMOVING PROPERTY FROM DRAINAGE SYSTEM.",
	"text": "After construction of a drainage system, an owner of benefited property may petition the drainage authority to remove property from the drainage system.\nIf the drainage system is under the jurisdiction of a county drainage authority, the petition must be filed with the auditor of the county. If the drainage system is under the jurisdiction of a joint county drainage authority, the petition must be filed with the county having the largest area of property in the drainage system, where the primary drainage system records are kept. If the system is under the jurisdiction of a watershed district, the petition must be filed with the secretary of the district.\n(a) When the petition is filed, the drainage authority in consultation with the auditor or the secretary shall set a time and location for a hearing on the petition and shall give notice of the hearing by mail to the owners of all property benefited by the drainage system, and either in a newspaper of general circulation within the affected drainage area or by publication on a website of the drainage authority.\n(b) At the hearing, the drainage authority shall make findings and shall direct, by order, that the petitioners' property be removed from the drainage system if the drainage authority determines:\n(1) that the waters from the petitioners' property have been diverted from the drainage system, or that the property cannot significantly or regularly use the drainage system;\n(2) that the property is not benefited by the drainage system; and\n(3) that removing the property from the drainage system will not prejudice the property owners and property remaining in the system.\nThe property that has been removed from the drainage system is not affected by the drainage system at any later proceeding for the repair or improvement of the drainage system and a drainage lien or assessment for repairs or improvements may not be made against the property that has been removed on or after the date of the order.\nAn order under this section does not release the property from a drainage lien filed on account of the drainage system before the date of the order. An order under this section does not release the property from any assessment or a drainage lien filed on or after the date of the order for costs incurred on account of the drainage system before the date of the order.",
	"repealed": false
}