{
	"id": "473.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.375",
	"title": "473.375 POWERS AND DUTIES OF COUNCIL; ADVISORY COMMITTEE.",
	"text": "MS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 2014 [Repealed, 2014 c 271 art 3 s 22]\nThe council shall establish a Transportation Accessibility Advisory Committee consisting of 15 members and a chair to advise the council on the development and management of policies regarding accessibility of all aspects of fixed regular route and special transportation services for persons with disabilities. The Transportation Accessibility Advisory Committee shall also advise the council on long-range plans to meet the accessible transportation needs of the disability community. The Transportation Accessibility Advisory Committee must include elderly persons, persons with disabilities, other users of special transportation services, and representatives of appropriate agencies for elderly persons and persons with disabilities. At least half the Transportation Accessibility Advisory Committee members must be persons who are both ADA-certified and users of public transit in the metropolitan area. Two of the appointments to the Transportation Accessibility Advisory Committee must be made by the Council on Disability in consultation with the chair of the Metropolitan Council.\n(a) The council must ensure that vehicle operators who provide bus service receive training on assisting persons with disabilities and mobility limitations to enter and leave the vehicle. The training must cover assistance in circumstances where regular access to or from the vehicle is unsafe due to snow, ice, or other obstructions. This subdivision applies to vehicle operators employed by the Metropolitan Council or by a replacement service provider.\n(b) The council must consult with the Transportation Accessibility Advisory Committee on the training.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe council shall administer a ride-sharing program in the metropolitan area, except for the statewide vanpool leasing program conducted by the commissioner of transportation and shall cooperate with the commissioner in the conduct of ride-sharing activities in areas where the commissioner's programs and the council's program overlap. The council may contract for services in operating the program.\nThe council shall offer, use, and apply its services to assist and advise transit providers in the metropolitan transit area in the planning, promotion, development, operation, and evaluation of programs and projects which are undertaken or proposed to be undertaken by contract with the council, and shall seek out and select recipients of this assistance and advice.\nThe council may provide financial assistance to public transit providers as provided in sections 473.371 to 473.449. The council may not use the proceeds of bonds issued under section 473.39 to provide capital assistance to private, for-profit operators of public transit, unless the operators provide service under a contract with the council, the former regional transit board, or recipients of financial assistance under sections 473.371 to 473.449.\nNo political subdivision within the metropolitan area may apply for federal transit assistance unless its application has been submitted to and approved by the council.\nThe council shall coordinate transit operations within the metropolitan area and shall establish a transit information program to provide transit users with accurate information on transit schedules and service.\nThe council may establish performance standards for recipients of financial assistance.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]",
	"repealed": false
}