{
	"id": "643.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/643.02",
	"title": "643.02 PROCEDURE OF DISTRICT COURT JUDGE IN CHARGE AND DUTY OF SHERIFF.",
	"text": "When any district court judge shall make an order for the transfer of any prisoner as provided in section 643.01, the order shall be made in duplicate by the judge, shall recite therein the name of the court by which the prisoner was sentenced or convicted, the date of sentence or conviction, the general nature of the offense for which sentenced or convicted, the length of the original sentence and the length of the sentence still remaining or the sentencing date if known, and any other facts that will furnish material information regarding the case, and shall direct the superintendent or other keeper of the workhouse, correctional or work farm, or sheriff or other keeper of the county jail to safely keep the prisoner at hard labor for the remainder of the original term of sentence, or until further sentencing proceedings, as stated in the order, unless otherwise released according to law, or the parole rules and regulations of the workhouse, correctional or work farm, or county jail. Both of the orders for transfer of the prisoner to the workhouse, correctional or work farm, or county jail shall be filed forthwith with the sheriff or other keeper of the jail, or superintendent or other keeper of the workhouse, correctional or work farm and the sheriff or other keeper of the jail, or superintendent or other keeper of the workhouse, correctional or work farm shall thereupon retain one of the orders of transfer and shall without delay transfer and deliver the prisoner named in the order, together with the other of the duplicate orders for the transfer of the prisoner to the superintendent or other keeper of the workhouse, correctional or work farm, or sheriff or other keeper of the jail, who shall retain the order and safely keep the prisoner named therein for the remainder of the sentence at hard labor or until further sentencing proceedings, as specified in the order, unless otherwise released as hereinbefore provided. The order for transfer of any prisoner, as hereinbefore mentioned, shall have the same force and effect as the writ of commitment issued by the court which sentenced the prisoner in the first instance or as the order for confinement issued by the court in the first instance, and in addition shall be full authority for the holding and keeping of the prisoner by the superintendent or other keeper of the workhouse, correctional or work farm, or the sheriff or other keeper of the jail, and for the prisoner's apprehension by any peace officer in case of the escape of the prisoner from the workhouse, correctional or work farm, or county jail. On the request of any district court judge of the district in which the workhouse, correctional or work farm, and county jail are located, the sheriff of the county, or superintendent, shall without delay furnish a copy to the judge of any commitment or order in the sheriff's or superintendent's possession.",
	"repealed": false
}