{
	"id": "412.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.521",
	"title": "412.521 POWERS OF BOARD.",
	"text": "In order to carry out the general powers granted in section 412.511, the park board shall have the powers granted in the following subdivisions.\nThe park board may employ necessary personnel and fix their compensation.\nThe park board may construct roadways, paths, buildings, fountains, docks, boathouses, bathhouses, refreshment booths, amusement halls, pavilions, and other necessary structures and improvements in parks. The board may, with the consent of the council, make contracts and leases for the construction and operation of these facilities for terms not exceeding ten years. Every such contract and lease shall provide that the structure shall be operated for the public use and convenience, and that the charges shall be reasonable and it shall reserve to the park board power to prescribe reasonable rules and regulations from time to time for the conduct of the privilege.\nThe park board may purchase all necessary materials, supplies, equipment, and services.\nThe park board shall maintain, beautify, and care for park property.\nThe park board may lease to private clubs the privilege of occupying limited areas in the bed of any navigable lake adjacent to a park for clubhouse purposes for not more than ten years. No clubhouse shall be so located as to interfere with navigation. Every such lease shall reserve to the board full power and authority to make from time to time reasonable rules and regulations with respect to the use of the leased property. The lessee shall have power to retain the clubhouse for the use of its own members and guests.\nThe park board may provide musical and free entertainment for the general public.\nThe park board may regulate the taking of ice from any pond, lake, or other body of water in any park.\nThe park board may perform whatever other acts are reasonable, necessary and proper to carry out the powers granted in section 412.511.",
	"repealed": false
}