{
	"id": "61A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.46",
	"title": "61A.46 NET RATES; RESERVE FUND; LIMITATION OF EXPENSES.",
	"text": "No corporation organized to transact the business of life insurance upon the cooperative or assessment plan, and no such corporation not already admitted to transact business in this state, shall be licensed to transact such life insurance business in this state unless it shall, by its charter, bylaws and policy or certificate contracts, provide for and actually charge and collect from its members, for and on account of the insurance furnished to them, net rates which are at least equal to the rates known as the national fraternal congress rates, with four percent interest. When any such corporation has adopted the use of a net rate not less than the national fraternal congress table of mortality and interest at the rate of four percent, on the full preliminary term plan, and shall set aside the net premium to its mortuary or benefit funds, including reserve or special benefits, for the use and benefit of its members, such corporation shall, on all premiums or assessments collected from and after January 1, 1927, be exempt from the provisions of sections 61A.41 and 61A.44; but it shall keep on deposit, for the use and benefit of all its policyholders, an amount equal to the value of its individual policies, as shown by its annual statement each year, with the commissioner, until the same shall amount to the sum of $25,000. The accretions to the various funds derived from interest, rents, or other sources, less expense incidental to investment supervision, shall also be set aside and appropriated to the fund producing the accretions. Gain from lapses, savings in mortality, surrenders, and changes shall revert to the expense fund. Policies issued by such corporation may contain a provision that in the event of default in premium payments, after premiums shall have been paid for three years, shall secure to the owner of the policy a stipulated form of insurance, the net value of which shall be at least equal to the reserve at the date of default on the policy and on any dividend additions thereto, specifying the mortality table and the rate of interest adopted for computing such reserve, less a sum not more than 2-1/2 percent of the amount insured by the policy, and of any existing dividend additions thereto, and less any existing indebtedness to the company on the policy; and that the policy may be surrendered to the company, at its home office, within one month from date of default for a specified cash value at least equal to the sum which would otherwise be available for the purchase of insurance, and shall stipulate that the company may defer payment for not more than six months after the application therefor is made. This provision shall not be required in term insurance of 20 years or less. Such corporation shall value its policies at the end of each calendar year and show in its annual statement as a reserve liability the amount of such valuation. If infantile insurance is written, it may be valued on the table known as Craig's extension below age ten. If any corporation, society or association operating the business of life or casualty insurance on the assessment plan under any law of this state shall reincorporate under section 61A.39 and in connection with such reincorporation shall provide in its articles or bylaws that this section shall not apply to any class or group of assessment policies in force at the time that such reincorporation becomes effective, then this section shall not apply to such policies; provided that such corporation, society or association shall, in all other operations and as to all other policies, be subject to the provisions of sections 61A.39 to 61A.42 and sections 61A.44 to 61A.50.",
	"repealed": false
}