{
	"id": "60K.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.55",
	"title": "60K.55 FEES.",
	"text": "Each producer licensed under this chapter shall pay a renewal fee as prescribed by subdivision 2.\n(a) In addition to fees provided for examinations and the technology surcharge required under paragraph (d), each insurance producer licensed under this chapter shall pay to the commissioner a fee of:\n(1) $50 for an initial life, accident and health, property, or casualty license issued to an individual insurance producer, and a fee of $50 for each renewal;\n(2) $50 for an initial variable life and variable annuity license issued to an individual insurance producer, and a fee of $50 for each renewal;\n(3) $50 for an initial personal lines license issued to an individual insurance producer, and a fee of $50 for each renewal;\n(4) $50 for an initial limited lines license issued to an individual insurance producer, and a fee of $50 for each renewal;\n(5) $200 for an initial license issued to a business entity, and a fee of $200 for each renewal;\n(6) $500 for an initial surplus lines license, and a fee of $500 for each renewal;\n(7) $100 per location for the initial and renewal of a portable electronics insurance limited lines license issued to a vendor, as defined in section 60K.381, subdivision 1, paragraph (g), engaged in portable electronics transactions at ten or fewer locations in this state as set forth in its application and any subsequent notice under section 60K.381, subdivision 2, paragraph (b); and\n(8) $6,500 for the initial and renewal of a portable electronics insurance limited lines license issued to a vendor, as defined in section 60K.381, subdivision 1, paragraph (g), engaged in portable electronics transactions at more than ten locations in this state as set forth in its application and any subsequent notice under section 60K.381, subdivision 2, paragraph (b).\n(b) Initial licenses issued to a business entity under this chapter and section 60K.381 are valid for a period not to exceed 24 months and expire on October 31 of the renewal year assigned by the commissioner. Initial licenses issued to an individual insurance producer under this chapter before August 1, 2010, are valid for a period not to exceed 24 months and expire on October 31 of the renewal year assigned by the commissioner. Each individual license initially issued or renewed on or after August 1, 2010, expires on the last day of the birth month of the producer in the year that will result in the term of the license being at least 12 months, but no more than 24 months. Beginning with the first license expiration on the last day of the birth month of an individual producer as set forth in this paragraph, all such licenses must after this date expire biennially on the last day of the birth month of the individual producer that is two years subsequent to the preceding expiration date. Each renewal insurance producer license is valid for a period of 24 months.\n(c) All fees are nonreturnable, except that an overpayment of any fee may be refunded upon proper application.\n(d) In addition to the fees required under paragraph (a), individual insurance producers shall pay, for each initial license and renewal, a technology surcharge of up to $40 under section 45.24, unless the commissioner has adjusted the surcharge as permitted under that section.",
	"repealed": false
}