{
	"id": "179A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.18",
	"title": "179A.18 STRIKES AUTHORIZED.",
	"text": "Essential employees may not strike. Except as otherwise provided by subdivision 2 and section 179A.17, subdivision 2, other public employees may strike only under the following circumstances:\n(1)(i) the collective bargaining agreement between their exclusive representative and their employer has expired or, if there is no agreement, impasse under section 179A.17, subdivision 2, has occurred; and\n(ii) the exclusive representative and the employer have participated in mediation over a period of at least 45 days, provided that the mediation period established by section 179A.17, subdivision 2, governs negotiations under that section, and provided that for the purposes of this item the mediation period commences on the day following receipt by the commissioner of a request for mediation; or\n(2) the employer violates section 179A.13, subdivision 2, clause (9); or\n(3) in the case of state employees, (i) the Legislative Coordinating Commission has rejected a negotiated agreement or arbitration decision during a legislative interim; or (ii) the entire legislature rejects or fails to ratify a negotiated agreement or arbitration decision, which has been approved during a legislative interim by the Legislative Coordinating Commission, at a special legislative session called to consider it, or at its next regular legislative session, whichever occurs first.\nExcept as otherwise provided by section 179A.17, subdivision 1, teachers employed by a local school district, other than principals and assistant principals, may strike only under the following circumstances:\n(1)(i) the collective bargaining agreement between their exclusive representative and their employer has expired or, if there is no agreement, impasse under section 179A.17, subdivision 1, has occurred; and\n(ii) the exclusive representative and the employer have participated in mediation over a period of at least 30 days. For the purposes of this item the mediation period commences on the day that a mediator designated by the commissioner first attends a meeting with the parties to negotiate the issues not agreed upon; and\n(iii) neither party has requested interest arbitration or a request for binding interest arbitration has been rejected; or\n(2) the employer violates section 179A.13, subdivision 2, clause (9).\n(a) In addition to the other requirements of this section, no employee may strike unless written notification of intent to strike is served on the employer and the commissioner by the exclusive representative at least ten days prior to the commencement of the strike. For all employees other than teachers, if more than 30 days have expired after service of a notification of intent to strike, no strike may commence until ten days after service of a new written notification. For teachers, no strike may commence more than 25 days after service of notification of intent to strike unless, before the end of the 25-day period, the exclusive representative and the employer agree that the period during which a strike may commence shall be extended for an additional period not to exceed five days. Teachers are limited to one notice of intent to strike for each contract negotiation period, provided, however, that a strike notice may be renewed for an additional ten days, the first five of which shall be a notice period during which no strike may occur, if the following conditions have been satisfied:\n(1) an original notice was provided pursuant to this section;\n(2) a tentative agreement to resolve the dispute was reached during the original strike notice period; and\n(3) such tentative agreement was rejected by either party during or after the original strike notice period.\n(b) The first day of the renewed strike notice period shall commence on the day following the expiration of the previous strike notice period or the day following the rejection of the tentative agreement, whichever is later. Notification of intent to strike under subdivisions 1, clause (1); and 2, clause (1), may not be served until the collective bargaining agreement has expired, or if there is no agreement, on or after the date impasse under section 179A.17 has occurred.",
	"repealed": false
}