{
	"id": "401.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.17",
	"title": "401.17 COMMUNITY SUPERVISION ADVISORY COMMITTEE.",
	"text": "(a) The commissioner must establish a Community Supervision Advisory Committee to develop and make recommendations to the commissioner on standards for probation, supervised release, and community supervision. The committee consists of 19 members as follows:\n(1) two directors appointed by the Minnesota Association of Community Corrections Act Counties;\n(2) two probation directors appointed by the Minnesota Association of County Probation Officers;\n(3) three county commissioner representatives appointed by the Association of Minnesota Counties;\n(4) two behavioral health, treatment, or programming providers who work directly with individuals on correctional supervision, one appointed by the Department of Human Services and one appointed by the Minnesota Association of County Social Service Administrators;\n(5) two representatives appointed by the Minnesota Indian Affairs Council;\n(6) two commissioner-appointed representatives from the Department of Corrections;\n(7) the chair of the statewide Evidence-Based Practice Advisory Committee;\n(8) three individuals who have been supervised, either individually or collectively, under each of the state's three community supervision delivery systems appointed by the commissioner in consultation with the Minnesota Association of County Probation Officers and the Minnesota Association of Community Corrections Act Counties;\n(9) an advocate for victims of crime appointed by the commissioner; and\n(10) a representative from a community-based research and advocacy entity appointed by the commissioner.\n(b) When an appointing authority selects an individual for membership on the committee, the authority must make reasonable efforts to reflect geographic diversity and to appoint qualified members of protected groups, as defined under section 43A.02, subdivision 33.\n(c) Chapter 15 applies to the extent consistent with this section.\n(d) The commissioner must convene the first meeting of the committee on or before October 1, 2023.\n(a) If there is a vacancy, the applicable appointing authority must appoint an individual to fill the vacancy. Committee members may elect any officers and create any subcommittees necessary to efficiently discharge committee duties.\n(b) A member may be removed by the appointing authority at any time at the pleasure of the appointing authority.\n(c) Each committee member must be reimbursed for all reasonable expenses actually paid or incurred by the member while performing official duties in the same manner as other state employees. The public members of the committee must be compensated at the rate of $55 for each day or part of the day spent on committee activities.\n(a) By December 1, 2024, the committee must provide written advice and recommendations to the commissioner on developing policy on:\n(1) statewide supervision standards and definitions to be applied to community supervision provided by CCA and non-CCA jurisdictions;\n(2) requiring CCA and non-CCA jurisdictions to use the same agreed-on risk screener and risk and needs assessment tools as the main supervision assessment methods or a universal five-level matrix allowing for consistent supervision levels and that all tools in use be validated on Minnesota's community supervision population and revalidated every five years;\n(3) requiring the use of assessment-driven, formalized, collaborative case planning to focus case planning goals on identified criminogenic and behavioral health need areas for moderate- and high-risk individuals;\n(4) limiting standard conditions required for all individuals on supervision across all supervision systems and judicial districts, ensuring that conditions of supervision are directly related to the offense of the individual on supervision, and tailoring special conditions to individuals on supervision identified as high risk and high need;\n(5) providing gender-responsive, culturally appropriate services and trauma-informed approaches;\n(6) developing a statewide incentives and sanctions grid to guide responses to client behavior while under supervision to be reviewed and updated every five years to maintain alignment with national best practices;\n(7) developing performance indicators for supervision success and recidivism;\n(8) developing a statewide training, coaching, and quality assurance system overseen by an evidence-based practices coordinator;\n(9) developing methods to evaluate outcomes for services provided by grant recipients under section 244.33, paragraph (c), clause (3);\n(10) devising a plan to eliminate the financial penalty incurred by a jurisdiction that successfully discharges an individual from supervision before the supervision term concludes; and\n(11) establishing a proposed state-level Community Supervision Advisory Board with a governance structure and duties for the board.\n(b) By July 1, 2025, and every four years thereafter, the committee must review and reassess the current workload study published by the commissioner under subdivision 4 and make recommendations to the commissioner based on the committee's review.\n(c) By June 30, 2024, the Community Supervision Advisory Committee must submit a report on supervision fees to the commissioner and the chairs and ranking minority members of the legislative committees with jurisdiction over corrections policy and finance. The committee must collect data on supervision fees and include the data in the report.\n(a) The commissioner, in consultation with the committee, must complete a workload study by October 1, 2024, to develop a capitated rate for equitably funding community supervision throughout the state. The study must indicate what factors go into a capitated rate, including but not limited to the administrative cost of providing supervision and the average daily cost for providing supervision depending on risk level.\n(b) The commissioner is responsible for completing the workload study and submitting it to the legislature in accordance with section 401.10, subdivision 4.\n(a) By June 1, 2024, the advisory committee, in consultation with the Minnesota Counties Computer Cooperative, must create a method to (1) standardize data classifications across the three community supervision systems, and (2) collect data for the commissioner to publish in an annual report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over public safety finance and policy.\n(b) The advisory committee's method, at a minimum, must provide for collecting the following data:\n(1) the number of individuals sentenced to supervision each year;\n(2) the offense levels, offense types, and assessed risk levels for which individuals are sentenced to supervision;\n(3) violation and revocation rates and the identified grounds for the violations and revocations, including final disposition of the violation action such as execution of the sentence, imposition of new conditions, or a custodial sanction;\n(4) the number of individuals granted early discharge from probation;\n(5) the number of individuals restructured on supervision, including imposition of new conditions of release; and\n(6) the number of individuals revoked from supervision and the identified grounds for revocation.\n(c) Beginning January 15, 2025, as part of the report under section 241.21, subdivision 2, the commissioner must include data collected under the committee method established under this subdivision. The commissioner must analyze the collected data by race, gender, and county, including Tribal Nations.\n(d) Nothing in this section overrides the commissioner's authority to require additional data be provided under other law.\n(a) Within 45 days of receiving the committee's recommendations under subdivision 3, the commissioner must respond in writing to the committee's advice and recommendations. The commissioner's response must explain:\n(1) whether the commissioner will adopt policy changes based on the recommendations;\n(2) the timeline for adopting policy changes; and\n(3) why the commissioner will not or cannot adopt any policy changes based on committee recommendations.\n(b) The commissioner must submit the committee's advice and recommendations and the commissioner's response to the chairs and ranking minority members of the legislative committees with jurisdiction over public safety finance and policy. The commissioner may submit the information under this paragraph together with the report under subdivision 5, paragraph (c).\nThe commissioner must provide the committee with a committee administrator, staff support, a meeting room, and access to office equipment and services.",
	"repealed": false
}