{
	"id": "129C.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/129C.26",
	"title": "129C.26 COMPREHENSIVE ARTS PLANNING PROGRAM SITES.",
	"text": "Each site shall receive $1,250 each year for two years. If fewer than 30 sites are selected, each site shall receive an additional proportionate share of money appropriated and not used. Before receiving money for the second year, a long-range plan for arts education must be submitted to the Perpich Center for Arts Education.\nThe center, in consultation with the Comprehensive Arts Planning Program State Steering Committee, must establish criteria for site selection. Criteria shall include at least the following:\n(1) a willingness by the district or group of districts to designate a program chair for comprehensive arts planning with sufficient authority to implement the program;\n(2) a willingness by the district or group of districts to create a committee comprised of school district and community people whose function is to promote comprehensive arts education in the district;\n(3) commitment on the part of committee members to participate in training offered by the Department of Education;\n(4) a commitment of the committee to conduct a needs assessment of arts education;\n(5) commitment by the committee to evaluate its involvement in the program;\n(6) a willingness by the district to adopt a long-range plan for arts education in the district; and\n(7) location of the district or group of districts to assure representation of urban, suburban, and rural districts and distribution of sites throughout the state.\nA district receiving funds must maintain a separate account for the receipt and disbursement of all funds relating to the program. The funds must be spent only for the purpose of arts education programs, including teacher release time.\nA district receiving funds may receive funds for the program from private sources and from other governmental agencies, including any state or federal funds available for arts education.",
	"repealed": false
}