{
	"id": "327B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/327B.08",
	"title": "327B.08 DUTIES.",
	"text": "Prior to the consummation of the sale of any manufactured home where a dealer acts as a broker, the dealer shall disclose in writing to all parties to the transaction all charges, payments, commissions and other fees paid or payable in connection with the transaction. Any commission charged by the dealer shall be expressed both as a dollar amount and as a percentage of the sales price. If the home being sold is located in a manufactured home park, prior to the buyer's signing of the purchase agreement the dealer shall disclose in writing to the buyer the state law concerning the in park sale of manufactured homes. This subdivision does not require any dealer to disclose any consideration received (1) for having acted as an insurance agent, as defined in section 60A.02, subdivision 7, in connection with the transaction, or (2) in return for the dealer having agreed to any contingent liability in connection with the financing of the sale. The commissioner may prescribe a form to be used to comply with this subdivision and may require all dealers to use that form.\nA dealer shall not prohibit, prevent or restrain any party to the brokered sale of a manufactured home from being present at the closing. If a dealer at a closing purports to have authority to act for one of the parties who is not present, the dealer shall exhibit the document granting that authority and shall give a copy of that document to the other parties.\nEach dealer who acts as a broker shall maintain a trust account. A trust account shall not be an interest bearing account except by agreement of the parties and subject to rules of the commissioner.\nA dealer shall deposit all trust funds received in a trust account. A dealer shall not commingle personal funds or other funds with the funds in a trust account, except that a dealer may deposit and maintain a sum from personal funds not to exceed $100 in a trust account, which sum shall be specifically identified and used to pay service charges relating to the trust account.\nAt the time of application for a license or renewal of license, each dealer who acts or intends to act as a broker shall tell the commissioner the name of the financial institutions and the trust account identification numbers used to comply with the provisions of this section. A dealer shall immediately report to the commissioner any change of trust account status including changes in financial institutions, account identification numbers, or additional accounts in the same or another financial institution. No dealer may close an existing trust account without giving ten days' written notice to the commissioner.\n(a) A person acting as a broker shall be considered to have created an agency relationship with the borrower in all cases and shall comply with the following duties:\n(1) brokers shall reasonably act:\n(i) in the borrower's best interest;\n(ii) in the utmost good faith toward borrowers; and\n(iii) so as not to compromise a borrower's right or interest in favor of another's right or interest, including a right or interest of the broker. A broker shall not accept, give, or charge any undisclosed compensation or realize any undisclosed remuneration, either through direct or indirect means, that inures to the benefit of the broker on an expenditure made for the borrower;\n(2) brokers shall carry out all lawful instructions given by borrowers;\n(3) brokers shall disclose to borrowers all material facts of which the broker has knowledge which might reasonably affect the borrower's rights, interests, or ability to receive the borrower's intended benefit from the manufactured home loan, but not facts which are reasonably susceptible to the knowledge of the borrower;\n(4) brokers shall use reasonable care in performing duties; and\n(5) brokers shall account to a borrower for all the borrower's money and property received as an agent.\n(b) The duty of agency does not attach to a broker who is:\n(1) a dealer or retailer;\n(2) a limited dealer or retailer;\n(3) licensed as a sales finance company as defined under section 53C.01, subdivision 12;\n(4) employed by:\n(i) a manufactured home lender;\n(ii) a dealer or retailer;\n(iii) a limited dealer or retailer; or\n(iv) a licensed sales finance company as defined under section 53C.01, subdivision 12;\n(5) a person who has an exclusive contract to act as a broker for:\n(i) a manufactured home lender;\n(ii) a dealer or retailer;\n(iii) a limited dealer or retailer; or\n(iv) a licensed sales finance company as defined under section 53C.01, subdivision 12.\n(c) Nothing in this section prohibits a broker who is bound by the duty of agency from contracting for or collecting a reasonable fee for services rendered and which had been disclosed to the borrower in advance of the provision of such services.\n(d) Nothing in this section requires a broker who is bound by the duty of agency to obtain a loan containing terms or conditions not available to the broker in the broker's usual course of business, or to obtain a loan for the borrower from a manufactured home loan lender with whom the broker does not have a business relationship.",
	"repealed": false
}