{
	"id": "270.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.075",
	"title": "270.075 TAX LEVY.",
	"text": "The commissioner shall determine the rate of tax to be levied and collected against the net tax capacity as determined pursuant to section 270.074, subdivision 3, to generate revenues sufficient to fund the air flight property tax portion of each year's state airport fund appropriation, as certified to the commissioner by the commissioner of transportation. The certification shall be presented to the commissioner prior to December 31 of each year. The property tax portion of the state airport fund appropriation is the difference between the total fund appropriation and the estimated total fund revenues from other sources for the state fiscal year in which the tax is payable and may include a portion of the balance in the state airports fund as determined to be available by the commissioner of transportation. The certification by the commissioner of transportation to the commissioner shall state the total fund appropriation and shall list individually the estimated fund revenues including the account carryover balance in the airport fund. The difference of these amounts shall be shown as the property tax portion of the state airport fund appropriation.\nIf a levy amount has not been certified by December 31 of a levy year, the commissioner shall use the last previous certified amount to determine the rate of tax, and shall notify the chairs and the ranking minority members of the committees of the house of representatives and senate having jurisdiction over the Department of Transportation that a certification was not made under this subdivision.\nAs soon as practicable and not later than March 1 next following the levy of the tax, the commissioner shall give actual notice to the airline company of the net tax capacity and of the tax. The taxes imposed under sections 270.071 to 270.079 shall become due and payable on April 1 following the levy thereof. If any tax is not paid on the due date or, if an appeal is made pursuant to section 270.076, within 60 days after notice of an increased tax, a late payment penalty of five percent of the unpaid tax shall be assessed. If the tax remains unpaid for more than 30 days, an additional penalty of five percent of the unpaid tax is imposed for each additional 30 days or fraction of 30 days that the tax remains unpaid. The penalty imposed under this section must not exceed the lesser of $25,000 or 25 percent of the unpaid tax. The unpaid tax and penalty shall bear interest at the rate specified in section 270C.40 from the time such tax should have been paid until paid. All interest and penalties shall be added to the tax and collected as a part thereof.\nMS 1998 [Repealed, 2000 c 490 art 5 s 40]\nMS 1998 [Repealed, 2000 c 490 art 5 s 40]",
	"repealed": false
}