{
	"id": "82B.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.035",
	"title": "82B.035 EXEMPTION.",
	"text": "This chapter does not apply to a licensed real estate salesperson or broker who, in the ordinary course of the licensee's business, gives a market analysis of the price of real estate, if the market analysis is not referred to or construed as an appraisal.\n(a) This chapter does not apply to a licensed real estate salesperson, broker, or real estate appraiser who prepares a broker price opinion in accordance with section 82.735. In connection with the purchase of a consumer's principal dwelling, a broker price opinion may not be used as the primary basis to determine the value of a parcel of property for the purpose of a loan origination of a residential mortgage loan secured by the parcel of property.\n(b) An appraiser preparing a broker price opinion shall disclose that the appraiser is not acting as an appraiser in preparing the broker price opinion and that the broker price opinion is not an appraisal or appraisal assignment and, therefore, is not subject to USPAP.\nNothing in this chapter shall be construed as requiring the licensing of persons employed and acting in their capacity as assessors for political subdivisions of the state and performing duties enumerated in section 273.061, subdivision 7 or 8.\nThis chapter does not apply to an appraisal, analysis, opinion, or conclusion as to the value of oil, gas, coal, and other mineral resources performed by an engineer registered as provided in sections 326.02 to 326.15 or by a certified professional geologist, unless the appraisal, analysis, opinion, or conclusion of value is performed in connection with a federally related transaction subject to the requirements of United States Code, title 12, section 3331, et seq., the federal Financial Institutions Reform, Recovery, and Enforcement Act of 1989.\nThis chapter does not require persons employed by, or under contract to, the Department of Revenue to be licensed in order to perform, conduct, or assist in, an appraisal done within the scope of their employment or contract duties.",
	"repealed": false
}