{
	"id": "120B.232",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.232",
	"title": "120B.232 CHARACTER DEVELOPMENT EDUCATION.",
	"text": "(a) Character education is the shared responsibility of parents, teachers, and members of the community. The legislature encourages districts to integrate or offer instruction on character education including, but not limited to, character qualities such as attentiveness, truthfulness, respect for authority, diligence, gratefulness, self-discipline, patience, forgiveness, respect for others, peacemaking, and resourcefulness. Instruction should be integrated into a district's existing programs, curriculum, or the general school environment. To the extent practicable, instruction should be integrated into positive behavioral intervention strategies, under section 122A.627. The commissioner shall provide assistance at the request of a district to develop character education curriculum and programs.\n(b) Character development education under paragraph (a) may include a voluntary elementary, middle, and high school program that incorporates the history and values of Congressional Medal of Honor recipients and may be offered as part of the social studies, English language arts, or other curriculum, as a schoolwide character building and veteran awareness initiative, or as an after-school program, among other possibilities.\n(a) Staff development opportunities under section 122A.60 may include training in character development education that incorporates the history and values of Congressional Medal of Honor recipients under subdivision 1, paragraph (b), and is provided without cost to the interested school or district.\n(b) Local continuing education and relicensure committees or other local relicensure committees under section 122A.187, subdivision 3, are encouraged to approve up to six clock hours of continuing education for licensed teachers who complete the training in character development education under paragraph (a).\nThe commissioner must first use federal funds for character development education programs to the extent available under United States Code, title 20, section 7247. Districts may accept funds from private and other public sources for character development education programs developed and implemented under this section, including programs funded through the Congressional Medal of Honor Foundation, among other sources.",
	"repealed": false
}