{
	"id": "469.1733",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1733",
	"title": "469.1733 DISQUALIFIED TAXPAYERS.",
	"text": "An individual or a business is not eligible for the exemptions or credits available under section 272.0212, 469.1732, or 469.1734, if the individual or business owes delinquent amounts under chapter 290, 296A, 297A, 297B, 297F, or 297G or if the individual or business owns property located in the city or county in which the zone is located on which the property taxes are delinquent. Delinquency is determined as of the date of the application for a certificate under section 469.1735, subdivision 1. As a condition of receiving a certificate, the individual or business must authorize the Department of Revenue to disclose information necessary to make the determination under this subdivision notwithstanding any provision of chapter 270B or other law to the contrary.\nIf a business located in the county in which the border city development zone is located relocates from outside a zone into a zone, the business is not eligible for the exemptions or credits available in the border city development zone, unless the governing body of the city, for a business located in an incorporated area, or the county, for a business located outside of an incorporated area, approves the relocation of the business.\n(a) If a business relocates more than 25 full-time equivalent jobs from a location in Minnesota outside of the county in which the zone is located, the business must notify the commissioner of employment and economic development and the city and county governments from which the jobs are being relocated. A business may satisfy the notification requirement by notifying the commissioner of employment and economic development, the city, and county of its intent to transfer jobs to a zone before actually doing so. The business is not eligible for the exemptions and credits available in the border city development zone, if the governing body of the city or county from which the jobs are being relocated adopts a resolution objecting to the relocation within 60 days after its receipt of the notice.\n(b) The business becomes eligible for the exemptions and credits available in the zone when each city and county that objected to the relocation rescinds its objection by resolution.\n(c) A city or county that objects to the relocation of jobs must file a copy of the resolution with the commissioner of employment and economic development and the city that created the border city development zone into which the jobs were or intend to be transferred.",
	"repealed": false
}