{
	"id": "256B.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.761",
	"title": "256B.761 REIMBURSEMENT FOR MENTAL HEALTH SERVICES.",
	"text": "(a) Effective for services rendered on or after July 1, 2001, payment for medication management provided to psychiatric patients, outpatient mental health services, day treatment services, home-based mental health services, and family community support services shall be paid at the lower of (1) submitted charges, or (2) 75.6 percent of the 50th percentile of 1999 charges.\n(b) Effective July 1, 2001, the medical assistance rates for outpatient mental health services provided by an entity that operates: (1) a Medicare-certified comprehensive outpatient rehabilitation facility; and (2) a facility that was certified prior to January 1, 1993, with at least 33 percent of the clients receiving rehabilitation services in the most recent calendar year who are medical assistance recipients, will be increased by 38 percent, when those services are provided within the comprehensive outpatient rehabilitation facility and provided to residents of nursing facilities owned by the entity.\n(c) In addition to rate increases otherwise provided, the commissioner may restructure coverage policy and rates to improve access to adult rehabilitative mental health services under section 256B.0623 and related mental health support services under section 256B.021, subdivision 4, paragraph (f), clause (2). For state fiscal years 2015 and 2016, the projected state share of increased costs due to this paragraph is transferred from adult mental health grants under sections 245.4661 and 256K.10. The transfer for fiscal year 2016 is a permanent base adjustment for subsequent fiscal years. Payments made to managed care plans and county-based purchasing plans under sections 256B.69, 256B.692, and 256L.12 shall reflect the rate changes described in this paragraph.\n(d) Any ratables effective before July 1, 2015, do not apply to early intensive developmental and behavioral intervention (EIDBI) benefits described in section 256B.0949.\n(e) Effective for services rendered on or after January 1, 2024, payment rates for behavioral health services included in the rate analysis required by Laws 2021, First Special Session chapter 7, article 17, section 18, except for adult day treatment services under section 256B.0671, subdivision 3; early intensive developmental and behavioral intervention services under section 256B.0949; and substance use disorder services under chapter 254B, must be increased by three percent from the rates in effect on December 31, 2023. Effective for services rendered on or after January 1, 2025, payment rates for behavioral health services included in the rate analysis required by Laws 2021, First Special Session chapter 7, article 17, section 18; early intensive developmental behavioral intervention services under section 256B.0949; and substance use disorder services under chapter 254B, must be annually adjusted according to the change from the midpoint of the previous rate year to the midpoint of the rate year for which the rate is being determined using the Centers for Medicare and Medicaid Services Medicare Economic Index as forecasted in the fourth quarter of the calendar year before the rate year. For payments made in accordance with this paragraph, if and to the extent that the commissioner identifies that the state has received federal financial participation for behavioral health services in excess of the amount allowed under United States Code, title 42, section 447.321, the state shall repay the excess amount to the Centers for Medicare and Medicaid Services with state money and maintain the full payment rate under this paragraph. This paragraph does not apply to federally qualified health centers, rural health centers, Indian health services, certified community behavioral health clinics, cost-based rates, and rates that are negotiated with the county. This paragraph expires upon legislative implementation of the new rate methodology resulting from the rate analysis required by Laws 2021, First Special Session chapter 7, article 17, section 18.\n(f) Effective January 1, 2024, the commissioner shall increase capitation payments made to managed care plans and county-based purchasing plans to reflect the behavioral health service rate increase provided in paragraph (e). Managed care and county-based purchasing plans must use the capitation rate increase provided under this paragraph to increase payment rates to behavioral health services providers. The commissioner must monitor the effect of this rate increase on enrollee access to behavioral health services. If for any contract year federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed the amount equal to any increase in rates that results from this provision.",
	"repealed": false
}