{
	"id": "116C.842",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.842",
	"title": "116C.842 CONTINGENT PROVISIONS.",
	"text": "[Repealed, 1996 c 428 s 14]\nFollowing Minnesota's designation as a host state by the Interstate Commission, and within 60 days after a compact facility located in the host state immediately preceding Minnesota begins operation, the governor shall, in consultation with the commissioner, establish and appoint the membership of a Facility Siting Policy Development Committee. The committee shall study the issues relevant to developing a facility and make recommendations concerning appropriate facility siting criteria and development requirements. The committee shall number no more than 12 voting members, at least eight of whom shall be individuals with expertise in a range of scientific disciplines relevant to site development. The committee shall include at least one representative each from local government and generators of low-level radioactive waste, and two representatives from public interest groups. In addition, the Environmental Quality Board, the Minnesota Geological Survey, the Departments of Natural Resources, Transportation, and Health, and the agency shall have nonvoting membership on the committee and shall provide information and technical assistance to the committee as needed. The committee shall report its findings and recommendations to the governor and the legislature no later than one year following the establishment of the committee.\n[Repealed, 1996 c 428 s 14]\nThe Environmental Quality Board shall provide administrative assistance to the committee.\n[Repealed, 1996 c 428 s 14]\nThe citizen members of the committee shall be compensated as provided in section 15.0575.\nThe committee is terminated upon reporting its recommendations to the governor and legislature in accordance with subdivision 1a.\nIn the event that Minnesota is designated by the Interstate Commission to be a host state for a regional low-level radioactive waste facility, the provisions of sections 116C.71 to 116C.74 shall not apply to the authorization or siting of that facility, or transportation of wastes to that facility.",
	"repealed": false
}