{
	"id": "245.4907",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4907",
	"title": "245.4907 MENTAL HEALTH CERTIFIED FAMILY PEER SPECIALIST GRANT PROGRAM.",
	"text": "The commissioner of human services must establish a mental health certified peer family specialist grant program to provide funding for training for mental health certified peer family specialists who provide services to support individuals with lived experience of mental illness under section 256B.0616.\nAn eligible applicant is a licensed entity or provider that employs a mental health certified peer family specialist qualified under section 245I.04, subdivision 12, and that provides services to families who have a child:\n(1) with an emotional disturbance or severe emotional disturbance under chapter 245;\n(2) receiving inpatient hospitalization under section 256B.0625, subdivision 1;\n(3) admitted to a residential treatment facility under section 245.4882;\n(4) receiving children's intensive behavioral health services under section 256B.0946;\n(5) receiving day treatment or children's therapeutic services and supports under section 256B.0943; or\n(6) receiving crisis response services under section 256B.0624.\nGrantees must use grant funding to provide training for mental health certified family peer specialists as specified in section 256B.0616, subdivision 5.\n(a) Grantees must provide an annual report to the commissioner for the purposes of evaluating the effectiveness of the grant program. The report must include:\n(1) the number of mental health certified peer specialists who received training using the grant funds under this section; and\n(2) the extent to which individuals receiving family peer services experienced progress on achieving treatment goals and experienced a reduction in hospital admissions.\n(b) The commissioner must submit the results of the evaluation to the chairs and ranking minority members of the legislative committees with jurisdiction over mental health.",
	"repealed": false
}