{
	"id": "275.066",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.066",
	"title": "275.066 SPECIAL TAXING DISTRICTS; DEFINITION.",
	"text": "For the purposes of property taxation and property tax state aids, the term \"special taxing districts\" includes the following entities:\n(1) watershed districts under chapter 103D;\n(2) sanitary districts under sections 442A.01 to 442A.29;\n(3) regional sanitary sewer districts under sections 115.61 to 115.67;\n(4) regional public library districts under section 134.201;\n(5) park districts under chapter 398;\n(6) regional railroad authorities under chapter 398A;\n(7) hospital districts under sections 447.31 to 447.38;\n(8) St. Cloud Metropolitan Transit Commission under sections 458A.01 to 458A.15;\n(9) Duluth Transit Authority under sections 458A.21 to 458A.37;\n(10) regional development commissions under sections 462.381 to 462.398;\n(11) housing and redevelopment authorities under sections 469.001 to 469.047;\n(12) port authorities under sections 469.048 to 469.068;\n(13) economic development authorities under sections 469.090 to 469.1081;\n(14) Metropolitan Council under sections 473.123 to 473.549;\n(15) Metropolitan Airports Commission under sections 473.601 to 473.679;\n(16) Metropolitan Mosquito Control Commission under sections 473.701 to 473.716;\n(17) Morrison County Rural Development Financing Authority under Laws 1982, chapter 437, section 1;\n(18) Croft Historical Park District under Laws 1984, chapter 502, article 13, section 6;\n(19) East Lake County Medical Clinic District under Laws 1989, chapter 211, sections 1 to 6;\n(20) Floodwood Area Ambulance District under Laws 1993, chapter 375, article 5, section 39;\n(21) Middle Mississippi River Watershed Management Organization under sections 103B.211 and 103B.241;\n(22) fire protection and emergency medical services special taxing districts under section 144F.01;\n(23) a county levying under the authority of section 103B.241, 103B.245, or 103B.251;\n(24) Southern St. Louis County Special Taxing District; Chris Jensen Nursing Home under Laws 2003, First Special Session chapter 21, article 4, section 12;\n(25) an airport authority created under section 360.0426; and\n(26) any other political subdivision of the state of Minnesota, excluding counties, school districts, cities, and towns, that has the power to adopt and certify a property tax levy to the county auditor, as determined by the commissioner of revenue.",
	"repealed": false
}