{
	"id": "356.406",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.406",
	"title": "356.406 LOSS OF ENTITLEMENT TO BENEFITS FOR SURVIVOR CAUSING DEATH OF PENSION PLAN MEMBER.",
	"text": "(a) Each of the words or terms defined in this subdivision has the meaning indicated.\n(b) \"Public pension plan\" means any retirement plan or fund enumerated in section 356.20, subdivision 2, or 356.30, subdivision 3, the Bloomington Fire Department Relief Association, any relief association governed by sections 424A.091 to 424A.095, any retirement plan governed by chapter 354B or 354C, the Hennepin County supplemental retirement plan governed by sections 383B.46 to 383B.52, or any housing and redevelopment authority retirement plan.\n(c) \"Public pension plan member\" means a person who is a participant covered by a public pension plan; a former participant of a public pension plan who has sufficient service to be entitled to receive a future retirement annuity or service pension; a recipient of a retirement annuity, service pension, or disability benefit from a public pension plan; or a former participant of a public pension plan who has member or employee contributions to the person's credit in the public pension plan.\n(d) \"Survivor\" means the surviving spouse, a former spouse, a surviving child, a joint annuitant, a designated recipient of a second or remainder portion of an optional annuity form, a beneficiary, or the estate of a deceased public pension plan member, as those terms are commonly understood or defined in the benefit plan document of the public pension plan.\n(e) \"Survivor benefit\" means a surviving spouse benefit, surviving child benefit, second or remainder portion of an optional annuity form, a death benefit, a funeral benefit, or a refund of member or employee contributions payable on account of the death of a public pension plan member as provided for in the benefit plan document of the public pension plan.\nDuring the pendency of a charge of a survivor of a felony that caused the death of a public pension plan member, of criminal liability for a death by wrongful act felony, or of conspiracy to commit a death by wrongful act felony, the entitlement of that survivor to receive a survivor benefit is suspended.\nOn final conviction of a survivor of a felony that caused the death of a public pension plan member, of criminal liability for a death by wrongful act felony, or of conspiracy to commit a death by wrongful act felony, the entitlement of that survivor to receive a survivor benefit is forfeited, including entitlement for any previously suspended survivor benefits under subdivision 2.\nThe charge of one survivor under subdivision 2 or the conviction of one survivor under subdivision 3 does not affect the entitlement of another survivor to a survivor benefit.\nIf monthly benefits or a refund of the balance of a participant or former participant's account have already been paid to an individual who is later charged or convicted as described under this section, the executive director or chief administrative officer of the public pension plan shall attempt to recover the amounts paid. Payment may be made to the next beneficiary or survivor only in an amount equal to the amount recovered and in the amount of any future payments that would legally accrue to another survivor under the applicable laws of the retirement plan.\nIf the benefit plan document governing the public pension plan does not provide for the disposition of forfeited benefits, survivor benefits forfeited under this section must be deposited in the general fund of the state.",
	"repealed": false
}