{
	"id": "346.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/346.41",
	"title": "346.41 RODENTS.",
	"text": "Food must be made available to every pet rodent at least once a day. This food must be fresh, wholesome, palatable, free from contamination, and of sufficient nutritive value to meet the normal daily requirements necessary to maintain the health and condition of the animal.\nA pet rodent must be provided with clean, potable water in sufficient quantity to satisfy the animal's needs or supplied by free choice. Snow or ice is not an adequate water source.\nRodents may be transported only in containers constructed of a smooth, durable material. Containers must:\n(a) be constructed so as to prevent escape or injury by chewing;\n(b) provide fresh air to each contained animal and yet prevent exposure to injurious drafts;\n(c) provide enough space for each animal to stand up, turn around, and obtain necessary food and water;\n(d) have fresh food and water available to each animal during all shipping periods exceeding six hours. Food and water requirements may be met by providing vegetables or fruits sufficient to meet an animal's food and water needs.\nShelters or cages must be constructed in a manner that allows cleaning of the entire surface area. The materials used must be of sufficient strength to prevent escape or injury by chewing and to protect the animal from predators.\nA shelter or cage with a solid bottom must be constructed of materials that are impervious to moisture. A shelter or cage with a wire or mesh bottom must be constructed to allow excreta to pass through the spaces in the wire or mesh. The wire or mesh floor must be constructed to prevent injury to the feet and legs of the animals.\nOutdoor confinement areas must provide sufficient shade to protect the animal from the direct rays of the sun and shelter the animal from rain or snow.\nA shelter or cage must be of sufficient height and have sufficient floor space to allow the caged animals to obtain proper exercise and maintain good health.\nA confinement area must be maintained at a temperature suitable for the confined animal.\nA shelter or cage must provide ventilation to the confined animals. It must be constructed to minimize drafts, odors, and moisture condensation. Additional ventilation must be provided when the ambient temperature rises to a level that may endanger the health of the animal.\nLighting of sufficient intensity and distribution must be available to permit routine inspection and regular cleaning.\nA shelter or cage must be cleaned on a regular basis to prevent the accumulation of excreta, hair, contaminated or wet litter, and uneaten or contaminated food. If the shelter or cage has a solid floor, the floor must be covered with clean, dry bedding which must be changed at least once a week. If the shelter or cage has a wire or mesh floor, the catch pans or troughs under the cage must be cleaned at least once a week. If the cage or shelter becomes soiled or wet to a degree that may be harmful to the caged animals due to water leakage, dead animals, or spoiled foods, the animals must be transferred to clean, dry quarters as soon as possible after discovery of the condition. The shelter or cage, and food and water receptacles, must be regularly cleaned.\nA rodent must be provided with materials that allow necessary chewing to prevent detrimental overgrowth of the animal's teeth.",
	"repealed": false
}