{
	"id": "290A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/290A.25",
	"title": "290A.25 VERIFICATION OF SOCIAL SECURITY OR INDIVIDUAL TAXPAYER IDENTIFICATION NUMBERS.",
	"text": "Annually, the commissioner of revenue shall furnish a list to the county assessor containing the names and Social Security or individual taxpayer identification numbers of persons who have applied for both homestead classification under section 273.13 and a renter's credit under section 290.0693.\nWithin 90 days of the notification, the county assessor shall investigate to determine if the homestead classification was improperly claimed. If the property owner does not qualify, the county assessor shall notify the county auditor who will determine the amount of homestead benefits that has been improperly allowed. For the purpose of this section, \"homestead benefits\" has the meaning given in section 273.124, subdivision 13b. The county auditor shall send a notice to persons who owned the affected property at the time the homestead application related to the improper homestead was filed, demanding reimbursement of the homestead benefits plus a penalty equal to 100 percent of the homestead benefits. The person notified may appeal the county's determination with the Minnesota Tax Court within 60 days of the date of the notice from the county as provided in section 273.124, subdivision 13b.\nIf the amount of homestead benefits and penalty is not paid within 60 days, and if no appeal has been filed, the county auditor shall certify the amount of taxes and penalty to the county treasurer. The county treasurer will add interest to the unpaid homestead benefits and penalty amounts at the rate provided for delinquent personal property taxes for the period beginning 60 days after demand for payment was made until payment. If the person notified is the current owner of the property, the treasurer may add the total amount of benefits, penalty, interest, and costs to the real estate taxes otherwise payable on the property in the following year. If the person notified is not the current owner of the property, the treasurer may collect the amounts due under the Revenue Recapture Act in chapter 270A, or use any of the powers granted in sections 277.20 and 277.21 without exclusion, to enforce payment of the benefits, penalty, interest, and costs, as if those amounts were delinquent tax obligations of the person who owned the property at the time the application related to the improperly allowed homestead was filed. The treasurer may relieve a prior owner of personal liability for the benefits, penalty, interest, and costs, and instead extend those amounts on the tax lists against the property for taxes payable in the following year to the extent that the current owner agrees in writing.\nAny amount of homestead benefits recovered by the county from the property owner shall be distributed to the county, city or town, and school district where the property is located in the same proportion that each taxing district's levy was to the total of the three taxing districts' levy for the current year. Any amount recovered attributable to taconite homestead credit shall be transmitted to the St. Louis County auditor to be deposited in the taconite property tax relief account. Any amount recovered that is attributable to supplemental homestead credit is to be transmitted to the commissioner of revenue for deposit in the general fund of the state treasury. The total amount of penalty collected must be deposited in the county general fund.",
	"repealed": false
}