{
	"id": "115A.565",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.565",
	"title": "115A.565 WASTE REDUCTION, REUSE, RECYCLING, AND COMPOSTING; COMPETITIVE GRANT PROGRAM.",
	"text": "The commissioner must make competitive grants to political subdivisions or federally recognized Tribes for waste reduction, reuse, recycling, and composting of source-separated compostable materials or yard waste. To be eligible for grants under this section, a political subdivision or federally recognized Tribe must be located outside the seven-county metropolitan area and a city must have a population of less than 45,000.\n(a) The commissioner must develop forms and procedures for soliciting and reviewing applications for grants under this section.\n(b) The determination of whether to make a grant under this section is within the discretion of the commissioner, subject to subdivision 4. The commissioner's decisions are not subject to judicial review, except for abuse of discretion.\n(a) If applications for grants exceed the available appropriations, grants must be made for projects that, in the commissioner's judgment, provide the highest return in public benefits.\n(b) To be eligible to receive a grant, a project must:\n(1) be locally administered;\n(2) have an educational component and measurable outcomes;\n(3) request $250,000 or less;\n(4) demonstrate local direct and indirect matching support of at least a quarter amount of the grant request;\n(5) include at least one of the following elements:\n(i) waste reduction;\n(ii) reuse;\n(iii) recycling; or\n(iv) composting of source-separated compostable materials or yard waste; and\n(6) demonstrate that the project will reduce waste generation through waste reduction or reuse or that the project will increase the amount of recyclable materials or source-separated compostable materials diverted from a disposal facility.\nIf a grant is awarded under this section and funds are not encumbered for the grant within four years after the award date, the grant must be canceled.",
	"repealed": false
}