{
	"id": "609.324",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.324",
	"title": "609.324 PATRONS; PROSTITUTES; HOUSING INDIVIDUALS ENGAGED IN PROSTITUTION; PENALTIES.",
	"text": "(a) Whoever intentionally does any of the following may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $40,000, or both:\n(1) engages in prostitution with an individual under the age of 14 years;\n(2) hires or offers or agrees to hire an individual under the age of 14 years to engage in sexual penetration or sexual contact; or\n(3) hires or offers or agrees to hire an individual who the actor reasonably believes to be under the age of 14 years to engage in sexual penetration or sexual contact.\n(b) Whoever intentionally does any of the following may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both:\n(1) engages in prostitution with an individual under the age of 16 years but at least 14 years;\n(2) hires or offers or agrees to hire an individual under the age of 16 years but at least 14 years to engage in sexual penetration or sexual contact; or\n(3) hires or offers or agrees to hire an individual who the actor reasonably believes to be under the age of 16 years but at least 14 years to engage in sexual penetration or sexual contact.\n(c) Whoever intentionally does any of the following may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both:\n(1) engages in prostitution with an individual under the age of 18 years but at least 16 years;\n(2) hires or offers or agrees to hire an individual under the age of 18 years but at least 16 years to engage in sexual penetration or sexual contact; or\n(3) hires or offers or agrees to hire an individual who the actor reasonably believes to be under the age of 18 years but at least 16 years to engage in sexual penetration or sexual contact.\nAny person, other than one related by blood, adoption, or marriage to the minor, who permits a minor to reside, temporarily or permanently, in the person's dwelling without the consent of the minor's parents or guardian, knowing or having reason to know that the minor is engaging in prostitution may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both; except that, this subdivision does not apply to residential placements made, sanctioned, or supervised by a public or private social service agency.\n(a) Whoever, while acting as a patron, intentionally does any of the following is guilty of a gross misdemeanor:\n(1) engages in prostitution with an individual 18 years of age or older; or\n(2) hires, offers to hire, or agrees to hire an individual 18 years of age or older to engage in sexual penetration or sexual contact.\nExcept as otherwise provided in subdivision 4, a person who is convicted of violating this subdivision must, at a minimum, be sentenced to pay a fine of at least $1,500.\n(b) Whoever violates the provisions of this subdivision within ten years of a previous conviction for violating this section or section 609.322 is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\nMS 2020 [Repealed, 1Sp2021 c 11 art 2 s 57]\nThe court may order a person convicted of violating subdivision 2 to perform community work service in lieu of all or a portion of the minimum fine required under those subdivisions if the court makes specific, written findings that the convicted person is indigent or that payment of the fine would create undue hardship for the convicted person or that person's immediate family. Community work service ordered under this subdivision is in addition to any mandatory community work service ordered under subdivision 3.\n(a) When a court sentences a person convicted of violating this section while acting as a patron, the court shall determine whether the person used a motor vehicle during the commission of the offense and whether the person has previously been convicted of violating this section or section 609.322. If the court finds that the person used a motor vehicle during the commission of the offense, it shall forward its finding along with an indication of whether the person has previously been convicted of a prostitution offense to the commissioner of public safety who shall record the finding on the person's driving record. Except as provided in paragraph (b), the finding is classified as private data on individuals, as defined in section 13.02, subdivision 12, but is accessible for law enforcement purposes.\n(b) If the person has previously been convicted of a violation of this section or section 609.322, the finding is public data.\nWhoever, while acting as a prostitute, intentionally does any of the following while in a public place is guilty of a gross misdemeanor:\n(1) engages in prostitution with an individual 18 years of age or older; or\n(2) is hired, offers to be hired, or agrees to be hired by an individual 18 years of age or older to engage in sexual penetration or sexual contact.\n(a) Whoever, while acting as a prostitute, intentionally does any of the following is guilty of a misdemeanor:\n(1) engages in prostitution with an individual 18 years of age or older; or\n(2) is hired, offers to be hired, or agrees to be hired by an individual 18 years of age or older to engage in sexual penetration or sexual contact.\n(b) Whoever violates the provisions of this subdivision within two years of a previous prostitution conviction for violating this section or section 609.322 is guilty of a gross misdemeanor.",
	"repealed": false
}