{
	"id": "240.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.04",
	"title": "240.04 EMPLOYEES.",
	"text": "The director shall perform the following duties:\n(1) take and preserve records of all proceedings before the commission, maintain its books, documents, and records, and make them available for public inspection as the commission directs;\n(2) if so designated by the commission, act as a hearing officer in hearings which need not be conducted under the Administrative Procedure Act to conduct hearings, receive testimony and exhibits, and certify the record of proceedings to the commission;\n(3) act as the commission's chief personnel officer and supervise the employment, conduct, duties, and discipline of commission employees; and\n(4) perform other duties as directed by the commission.\nThe commission may appoint a deputy director who serves in the unclassified service at the commission's pleasure.\nThe commission may employ a director of pari-mutuels who serves in the unclassified service at the commission's pleasure. The director of pari-mutuels shall perform the following duties:\n(1) supervise all forms of pari-mutuel betting on horse racing in the state;\n(2) inspect all machinery;\n(3) make reports on pari-mutuel betting as the commission directs;\n(4) subject to commission approval, appoint assistants to perform duties the commission designates; and\n(5) perform other duties as directed by the commission.\nIf no director of pari-mutuels is appointed the duties of that office are assigned to the executive director. The commission may contract with outside services or personnel to assist the executive director in the performance of these duties.\nThe commission may appoint a director of racing security to serve in the unclassified service at the commission's pleasure. The director of racing security shall enforce all laws and commission rules relating to the security and integrity of racing. The director of racing security and all other persons designated by the commission as security officers have free and open access to all areas of all facilities the commission licenses and may search without a search warrant any part of a licensed racetrack and the person of any licensee of the commission on the premises. The director of racing security may order a licensee to take, at the licensee's expense, security measures necessary to protect the integrity of racing, but the order may be appealed to the commission. Nothing in this chapter prohibits law enforcement authorities and agents from entering, in the performance of their duties, a premises licensed under Laws 1983, chapter 214.\nIf no director of racing security is appointed the duties of that office are assigned to the executive director. The commission may contract with outside services or personnel to assist the executive director in the performance of these duties.\nThe commission may appoint a veterinarian who must be a doctor of veterinary medicine and who serves at its pleasure in the unclassified service. The veterinarian shall, while employed by the commission, perform the following duties:\n(1) supervise the formulation, administration, and evaluation of all medical tests the commission's rules require or authorize;\n(2) advise the commission on all aspects of veterinary medicine relating to its powers and duties; and\n(3) supervise all personnel involved in medical testing, subject to the supervision of the executive director.\nIf no veterinarian is appointed, the duties of that office may be assigned to the executive director. The commission may contract with outside personnel to assist the executive director in the performance of these duties.\nThe commission may require that a licensee reimburse it for the costs of services provided by assistant veterinarians.\nSubject to applicable laws, the commission shall employ and assign duties to other officers, employees, and agents as it deems necessary to discharge its functions.\nThe compensation of all commission employees shall be as provided in chapter 43A.\nThe commission and director may request assistance from any department or agency of the state in fulfilling its duties, and shall make appropriate reimbursement for all such assistance.",
	"repealed": false
}