{
	"id": "60J.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/60J.07",
	"title": "60J.07 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 60J.06 to 60J.11.\n\"Accredited state\" means a state in which the insurance department or regulatory agency has qualified as meeting the minimum financial regulatory standards promulgated and established from time to time by the National Association of Insurance Commissioners (NAIC).\n\"Captive insurer\" means an insurance company owned by another organization whose exclusive purpose is to insure risks of the parent organization and affiliated companies or, in the case of groups and associations, an insurance organization owned by the insureds whose exclusive purpose is to insure risks to member organizations or group members and their affiliates.\n\"Commissioner\" means the commissioner of commerce.\n\"Control\" or \"controlled\" has the meaning given in section 60D.15, subdivision 4.\n\"Controlled insurer\" means a licensed insurer which is controlled, directly or indirectly, by a producer.\n\"Controlling producer\" means a producer who, directly or indirectly, controls an insurer.\n\"Licensed insurer\" or \"insurer\" means any person, firm, association, or corporation licensed to transact a property/casualty insurance business in this state. The following entities are not licensed insurers for the purposes of sections 60J.06 to 60J.11:\n(1) all risk retention groups as defined in the Superfund Amendments Reauthorization Act of 1986, Public Law 99-499, 100 Stat. 1613; the Risk Retention Act, United States Code, title 15, section 3901, et seq.; and chapter 60;\n(2) all residual market pools and joint underwriting authorities or associations; and\n(3) all captive insurers.\n\"Producer\" means an insurance broker or any other person, firm, association, or corporation, when, for any compensation, commission or other thing of value, the person, firm, association, or corporation acts or aids in any manner in soliciting, negotiating, or procuring the making of any insurance contract on behalf of an insured other than the person, firm, association, or corporation.",
	"repealed": false
}