{
	"id": "260.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.55",
	"title": "260.55 EXPENSE OF RETURNING JUVENILES TO STATE, PAYMENT.",
	"text": "The expense of returning juveniles to this state pursuant to the Interstate Compact for Juveniles shall be paid as follows:\n(1) In the case of a runaway, the court making the requisition shall inquire summarily regarding the financial ability of the petitioner to bear the expense and if it finds the petitioner is able to do so, shall order that the petitioner pay all such expenses; otherwise the court shall arrange for the transportation at the expense of the county and order that the county reimburse the person, if any, who returns the juvenile, for actual and necessary expenses; and the court may order that the petitioner reimburse the county for so much of said expense as the court finds the petitioner is able to pay. If the petitioner fails, without good cause, or refuses to pay such sum, the petitioner may be proceeded against for contempt.\n(2) In the case of an escapee or absconder, if the juvenile is in the legal custody of the commissioner of corrections the commissioner shall bear the expense of the juvenile's return; otherwise the appropriate court shall, on petition of the person or agency entitled to the juvenile's custody or charged with the juvenile's supervision, arrange for the transportation at the expense of the county and order that the county reimburse the person, if any, who returns the juvenile, for actual and necessary expenses. In this subsection \"appropriate court\" means the juvenile court which adjudged the juvenile to be delinquent or, if the juvenile is under supervision for another state under Article VII of the compact, then the juvenile court of the county of the juvenile's residence during such supervision.\n(3) In the case of a voluntary return of a runaway without requisition, the person entitled to the juvenile's legal custody shall pay the expense of transportation and the actual and necessary expenses of the person, if any, who returns such juvenile; but if financially unable to pay all the expenses the person may petition the juvenile court of the county of the petitioner's residence for an order arranging for the transportation as provided in paragraph (1). The court shall inquire summarily into the financial ability of the petitioner and, if it finds the petitioner is unable to bear any or all of the expense, the court shall arrange for such transportation at the expense of the county and shall order the county to reimburse the person, if any, who returns the juvenile, for actual and necessary expenses. The court may order that the petitioner reimburse the county for so much of said expense as the court finds the petitioner is able to pay. A petitioner who fails, without good cause, or refuses to pay such sum may be proceeded against for contempt.",
	"repealed": false
}