{
	"id": "290.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.081",
	"title": "290.081 INCOME OF NONRESIDENTS, RECIPROCITY.",
	"text": "(a) The compensation received for the performance of personal or professional services within this state by an individual whose residence, place of abode, and place customarily returned to at least once a month is in another state, shall be excluded from gross income to the extent such compensation is subject to an income tax imposed by the state of residence; provided that such state allows a similar exclusion of compensation received by residents of Minnesota for services performed therein.\n(b) When it is deemed to be in the best interests of the people of this state, the commissioner may determine that the provisions of paragraph (a) shall not apply. As long as the provisions of paragraph (a) apply between Minnesota and Wisconsin, the provisions of paragraph (a) shall apply to any individual who is domiciled in Wisconsin.\n(c) For the purposes of paragraph (a), whenever the Wisconsin tax on Minnesota residents which would have been paid Wisconsin without paragraph (a) exceeds the Minnesota tax on Wisconsin residents which would have been paid Minnesota without paragraph (a), or vice versa, then the state with the net revenue loss calculated under paragraph (e) shall receive from the other state the amount of such loss.\n(d) Payments for amounts calculated under paragraph (c) must equal one-quarter of the estimated annual amount and must be paid at the midpoint of each quarter, on February 15, May 15, August 15, and November 15.\n(e)(1) The commissioner of revenue is authorized to enter into agreements with the state of Wisconsin specifying the reciprocity payment due dates, conditions constituting delinquency, interest rates, and a method for computing interest due.\n(2) For agreements entered into before August 1, 2018, the annual compensation required under paragraph (c) must equal at least the net revenue loss minus up to $3,000,000 per fiscal year.\n(3) For the purposes of this section, \"net revenue loss\" means the difference between the amount of Minnesota income taxes Minnesota forgoes by not taxing Wisconsin residents on income subject to reciprocity and the credit Minnesota would have been required to give under section 290.06, subdivision 22, to Minnesota residents working in Wisconsin had there not been reciprocity.\n(4) All agreements must include provisions:\n(i) providing for a suspension of the agreement if one party to the agreement does not pay in full by a time prescribed in the agreement;\n(ii) setting the interest rate that will be applied, and that interest shall run from the date the payment is due until the day the payment is made, except that interest from the reconciliation payments runs from July 1 of the tax year until paid;\n(iii) stating a time for annual reconciliation must be completed by October 31 of the year following the tax year, and the time for payment of any amounts to be completed by no later than December 1 of the year following the tax year;\n(iv) requiring the parties to jointly conduct updated benchmark studies every five years beginning tax year 2018;\n(v) requiring each party to the agreement to require taxpayers who request exemption from withholding in the state where they work to make an annual application and that a list of participants will be exchanged annually; and\n(vi) that provide that the sum of the amount of the quarterly payments must be a reasonable estimate of the revenue loss as defined in clause (3).\n(f) If an agreement cannot be reached as to the amount of the loss, the commissioner of revenue and the taxing official of the state of Wisconsin shall each appoint a member of a board of arbitration and these members shall appoint the third member of the board. The board shall select one of its members as chair. Such board may administer oaths, take testimony, subpoena witnesses, and require their attendance, require the production of books, papers and documents, and hold hearings at such places as are deemed necessary. The board shall then make a determination as to the amount to be paid the other state which determination shall be final and conclusive.\n(g) The commissioner may furnish copies of returns, reports, or other information to the taxing official of the state of Wisconsin, a member of the board of arbitration, or a consultant under joint contract with the states of Minnesota and Wisconsin for the purpose of making a determination as to the amount to be paid the other state under the provisions of this section. Prior to the release of any information under the provisions of this section, the person to whom the information is to be released shall sign an agreement which provides that the person will protect the confidentiality of the returns and information revealed thereby to the extent that it is protected under the laws of the state of Minnesota.",
	"repealed": false
}