{
	"id": "462A.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.38",
	"title": "462A.38 WORKFORCE AND AFFORDABLE HOMEOWNERSHIP DEVELOPMENT PROGRAM.",
	"text": "A workforce and affordable homeownership development program is established to award homeownership development grants and loans to cities, counties, Tribal governments, nonprofit organizations, cooperatives created under chapter 308A, 308B, or 308C, and community land trusts created for the purposes outlined in section 462A.31, subdivision 1, for development of workforce and affordable homeownership projects. The purpose of the program is to increase the supply of workforce and affordable, owner-occupied multifamily or single-family housing throughout Minnesota.\n[See Note.]\n(a) Grant funds and loans awarded under this program may be used for:\n(1) development costs;\n(2) rehabilitation;\n(3) land development;\n(4) affordability gap; and\n(5) residential housing, including storm shelters and related community facilities.\n(b) A project funded through this program shall serve households that meet the income limits as provided in section 462A.33, subdivision 5, unless a project is intended for the purpose outlined in section 462A.02, subdivision 6.\nThe commissioner shall develop forms and procedures for soliciting and reviewing applications for grants and loans under this section. The commissioner shall consult with interested stakeholders when developing the guidelines and procedures for the program. In making grants and loans, the commissioner shall establish semiannual application deadlines in which grants and loans will be authorized from all or part of the available appropriations.\nAmong comparable proposals, preference must be given to proposals that include contributions from nonstate resources for the greatest portion of the total development cost.\nThe agency shall attempt to make grants and loans in approximately equal amounts to applicants outside and within the metropolitan area, as defined under section 473.121, subdivision 2.\nBeginning January 15, 2024, the commissioner must annually submit a report to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over housing and workforce development specifying the projects that received grants and loans under this section and the specific purposes for which the grant or loan funds were used.\nA workforce and affordable homeownership development account is established in the housing development fund. Money in the account, including interest, is appropriated to the commissioner of the Housing Finance Agency for the purposes of this section. The amount appropriated under this section must supplement traditional sources of funding for this purpose and must not be used as a substitute for traditional sources of funding or to pay debt service on bonds. All loan repayments received under this section are to be deposited into the workforce and affordable homeownership development account in the housing development fund. A borrower under this section may, instead of repaying its loan, spend the money on a qualifying project under subdivision 2.",
	"repealed": false
}