{
	"id": "103F.516",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.516",
	"title": "103F.516 PERMANENT WETLANDS PRESERVE.",
	"text": "Upon application by a landowner, the board may acquire permanent easements and may pay for the cost of related capital improvement projects to preserve or restore wetlands on land containing type 1, 2, 3, 4, 5, or 6 wetlands, as defined in United States Fish and Wildlife Service Circular No. 39 (1971 edition), public waters wetlands, or public waters.\n(a) The nature of property rights acquired in an easement under this section must be consistent with the provisions of section 103F.515, subdivision 4.\n(b) A permanent easement may include four adjacent upland acres of land for each acre of wetlands, public waters wetlands, or public waters included.\n(c) The easement must require that the landowner control noxious weeds in accordance with sections 18.77 to 18.88.\n(d) The permanent easement must be conveyed to the state in recordable form free of any prior title, lien, or encumbrance and must provide for a right of entry by the state for inspection and correction of violations.\n(a) Payment for the conservation easement may be made in ten equal annual payments or, at the option of the landowner, in a lump sum at:\n(1) 50 percent of the township average equalized estimated market value of agricultural property as established by the commissioner of revenue at the time of easement application for wetlands, public waters wetlands, or public waters located outside of the metropolitan counties, as defined in section 473.121, subdivision 4, and wetlands located on agricultural lands within a metropolitan county;\n(2) for wetlands, public waters wetlands, or public waters located on nonagricultural land within the metropolitan county, 20 percent of the township average equalized estimated market value of agricultural property as established by the commissioner of revenue at the time of easement application; or\n(3) for wetlands, public waters wetlands, or public waters connected to a public or private drainage system, an amount determined by the board based on the fair market value of the land if drainage infrastructure were restored.\n(b) Payment for adjacent upland acreage of cropped and noncropped land under subdivision 2, paragraph (b), must be made at 90 percent and 60 percent, respectively, of the township average equalized market value of agricultural land as established by the commissioner of revenue at the time of easement application.\nEnforcement of the permanent easement and violation corrections is governed by section 103F.515, subdivisions 8 and 9.\nA property owner eligible for payments under this section must receive payments to the extent that funds are available. If funds are not available and payments are not made, restrictions on the use of the property owner's wetlands are terminated under this section.",
	"repealed": false
}