{
	"id": "297F.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.11",
	"title": "297F.11 INFORMATIONAL REPORTS; CIGARETTES.",
	"text": "The following persons shall file with the commissioner a monthly informational report in the form and manner prescribed by the commissioner:\n(1) a distributor licensed to ship cigarettes into Minnesota;\n(2) a person who manufactures cigarettes within the state;\n(3) any other person who imports cigarettes into Minnesota; and\n(4) a person who possesses, receives, stores, or warehouses cigarettes in Minnesota, upon which the tax imposed by this chapter has not been paid.\nThe requirement of filing an informational report does not apply to a person conveying or possessing cigarettes described in this chapter, nor to any lawful manufacture of cigarettes within the state for personal consumption.\nNo payment of any tax is required to be remitted with the report required under subdivision 1. The report must be filed on or before the tenth day following the end of each calendar month, regardless of whether or not the person shipped, manufactured, possessed, received, stored, or warehoused any cigarettes into or within Minnesota during the previous month, unless the commissioner determines that a longer filing period is appropriate for a particular person.\nCommon carriers and contract carriers transporting cigarettes into this state shall file with the commissioner reports of all such shipments other than those which are delivered to public warehouses of first destination in this state, licensed under the provisions of chapter 231. The reports must be filed monthly on or before the tenth day of each month and must show with respect to deliveries made in the preceding month: the date, point of origin, point of delivery, name of consignee, the quantity of cigarettes delivered, and any other information the commissioner requires.\nA common carrier or a contract carrier transporting cigarettes into Minnesota shall permit examination by the commissioner of its records relating to the shipment of cigarettes.\nA person who files a cigarette consumer return as required by this chapter may fulfill the requirements of this section by indicating on the cigarette consumer's return which of the items reported on the return were transported into the state by the consumer. The requirement of filing an informational report does not apply to consumers who import fewer than 200 cigarettes into this state.",
	"repealed": false
}