{
	"id": "352.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.95",
	"title": "352.95 DISABILITY BENEFITS.",
	"text": "A covered correctional employee who is determined to have a duty disability, physical or psychological, as defined under section 352.01, subdivision 17b, is entitled to a duty disability benefit. The duty disability benefit must be based on covered correctional service only. The duty disability benefit amount is 50 percent of the average salary defined in section 352.93, plus an additional 2.4 percent if employed as a correctional state employee before July 1, 2010, or 2.2 percent if employed as a correctional state employee after June 30, 2010, for each year of covered correctional service in excess of 20 years, ten months, prorated for completed months.\nA disabled correctional employee may elect the normal disability benefit or an optional annuity as provided in section 352.116, subdivision 3. The election of an optional annuity must be made before commencement of payment of the disability benefit and becomes effective the date on which the disability benefit begins to accrue as provided in subdivision 3. Upon becoming effective, the optional annuity shall begin to accrue on the same date as provided for the disability benefit.\nA covered correctional employee who was hired before July 1, 2009, after rendering at least one year of covered correctional service, or a covered correctional employee who was first hired after June 30, 2009, is vested under section 352.925, and who is determined to have a regular disability, physical or psychological, as defined under section 352.01, subdivision 17c, is entitled to a regular disability benefit. The regular disability benefit must be based on covered correctional service only. The regular disability benefit must be computed as provided in section 352.93, subdivisions 1 and 2. The regular disability benefit of a covered correctional employee who was first hired before July 1, 2009, and who is determined to have a regular disability, physical or psychological, under this subdivision must be computed as though the employee had at least 15 years of covered correctional service.\nNo application for disability benefits may be made until after the last day physically on the job. The disability benefit begins to accrue the day following the last day for which the employee is paid sick leave or annual leave, but not earlier than 180 days before the date the application is filed. A terminated employee must file a written application in an office of the system or with a person authorized by the executive director. Applications must comply with section 352.113, subdivision 2, paragraph (b).\n(a) An applicant shall provide medical, chiropractic, or psychological evidence to support an application for disability benefits. The director may have the employee examined by at least one additional licensed physician, APRN, chiropractor, or psychologist who is designated by the medical adviser. The physicians, APRNs, chiropractors, or psychologists with respect to a mental impairment, shall make written reports to the director concerning the question of the employee's disability, including their expert opinions as to whether the employee has an occupational disability within the meaning of section 352.01, subdivision 17a, and whether the employee has a duty disability, physical or psychological, under section 352.01, subdivision 17b, or has a regular disability, physical or psychological, under section 352.01, subdivision 17c. The director shall also obtain written certification from the employer stating whether or not the employee is on sick leave of absence because of a disability that will prevent further service to the employer performing normal duties as defined in section 352.01, subdivision 17d, or performing less frequent duties as defined in section 352.01, subdivision 17e, and as a consequence, the employee is not entitled to compensation from the employer.\n(b) If, on considering the reports by the physicians, APRNs, chiropractors, or psychologists and any other evidence supplied by the employee or others, the medical adviser finds that the employee has an occupational disability within the meaning of section 352.01, subdivision 17a, the adviser shall make the appropriate recommendation to the director, in writing, together with the date from which the employee has been disabled. The director shall then determine the propriety of authorizing payment of a duty disability benefit or a regular disability benefit as provided in this section.\n(c) Unless the payment of a disability benefit has terminated because the employee no longer has an occupational disability, or because the employee has reached either age 55 or the five-year anniversary of the effective date of the disability benefit, whichever is later, the disability benefit must cease with the last payment which was received by the disabled employee or which had accrued during the employee's lifetime. While disability benefits are paid, the director has the right, at reasonable times, to require the disabled employee to submit proof of the continuance of an occupational disability. If any examination indicates to the medical adviser that the employee no longer has an occupational disability, the disability payment must be discontinued upon the person's reinstatement to state service or within 60 days of the finding, whichever is sooner.\nThe disability benefit paid to a disabled correctional employee under this section terminates at the end of the month in which the employee reaches age 55, or the five-year anniversary of the effective date of the disability benefit, whichever is later. If the disabled correctional employee is still disabled when the employee reaches age 55, or the five-year anniversary of the effective date of the disability benefit, whichever is later, the employee must be deemed to be a retired employee. If the employee had elected an optional annuity under subdivision 1a, the employee shall receive an annuity in accordance with the terms of the optional annuity previously elected. If the employee had not elected an optional annuity under subdivision 1a, the employee may within 90 days of attaining age 55 or reaching the five-year anniversary of the effective date of the disability benefit, whichever is later, either elect to receive a normal retirement annuity computed in the manner provided in section 352.93 or elect to receive an optional annuity as provided in section 352.116, subdivision 3, based on the same length of service as used in the calculation of the disability benefit. Election of an optional annuity must be made within 90 days before attaining age 55 or reaching the five-year anniversary of the effective date of the disability benefit, whichever is later. If an optional annuity is elected, the optional annuity begins to accrue on the first of the month following the month in which the employee reaches age 55 or the five-year anniversary of the effective date of the disability benefit, whichever is later.\nIf the employee is entitled to receive a disability benefit as provided in subdivision 1 or 2 and has credit for less covered correctional service than the length of service upon which the correctional disability benefit is based, and also has credit for regular plan service, the employee is entitled to a disability benefit or deferred retirement annuity based on the regular plan service only for that service which when combined with the correctional service exceeds number of years on which the correctional disability benefit is based. The disabled employee who also has credit for regular plan service must in all respects qualify under section 352.113 for a disability benefit based on the regular plan service, except that the service may be combined to satisfy length of service requirements. Any deferred annuity to which the employee is entitled based on regular plan service must be augmented as provided in section 352.22, subdivision 3a, while the employee is receiving a disability benefit under this section.\nIf the disabled employee resumes gainful work, the disability benefit must be continued in an amount which when added to current earnings and workers' compensation benefits does not exceed the salary rate of the disabled employee at the date of disability as adjusted by the same percentage increase in United States average wages used by Social Security in calculating average indexed monthly earnings for the same period.\nA disability benefit under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}