{
	"id": "325F.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.72",
	"title": "325F.72 DISCLOSURE OF SPECIAL CARE STATUS REQUIRED.",
	"text": "Only assisted living facilities with dementia care licenses under chapter 144G may advertise, market, or otherwise promote the facility as providing specialized care for dementia or related disorders. All assisted living facilities with dementia care licenses shall provide a written disclosure to the following:\n(1) the commissioner of health, if requested;\n(2) the Office of Ombudsman for Long-Term Care; and\n(3) each person seeking placement within a residence, or the person's legal and designated representatives, as those terms are defined in section 144G.08, before an agreement to provide the care is entered into.\nWritten disclosure shall include, but is not limited to, the following:\n(1) a statement of the overall philosophy and how it reflects the special needs of residents with Alzheimer's disease or other dementias;\n(2) the criteria for determining who may reside in the secured dementia care unit as defined in section 144G.08, subdivision 62;\n(3) the process used for assessment and establishment of the service plan, including how the plan is responsive to changes in the resident's condition;\n(4) staffing credentials, job descriptions, and staff duties and availability, including any training specific to dementia;\n(5) physical environment as well as design and security features that specifically address the needs of residents with Alzheimer's disease or other dementias;\n(6) frequency and type of programs and activities for residents of the assisted living facility with dementia care;\n(7) involvement of families in resident care and availability of family support programs;\n(8) fee schedules for additional services to the residents of the secured dementia care unit; and\n(9) a statement that residents will be given a written notice 30 calendar days prior to changes in the fee schedule.\nSubstantial changes to disclosures must be reported to the parties listed in subdivision 1 at the time the change is made.\nThe attorney general may seek the remedies set forth in section 8.31 for repeated and intentional violations of this section. However, no private right of action may be maintained as provided under section 8.31, subdivision 3a.",
	"repealed": false
}