{
	"id": "51A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.13",
	"title": "51A.13 DIRECTORS OF MUTUAL ASSOCIATIONS.",
	"text": "The business of the association shall be directed by a board of directors of not less than five nor more than 15 as determined by, and elected by ballot from among, the members by a plurality of the votes of the members present. If authorized by vote of the members the directors may elect all directors. At all times at least two-thirds of the directors shall be bona fide residents of this state.\nExcept with the written consent of the commissioner, no member shall be eligible for election or shall serve as a director or officer of an association who has been adjudicated a bankrupt or convicted of a criminal offense involving dishonesty or a breach of trust. A director shall automatically cease to be a director on ceasing to be a member, on being adjudicated a bankrupt, or on being convicted of a criminal offense as herein provided, but no action of the board of directors shall be invalidated through the participation of the director in the action. However, if a director becomes ineligible under the terms of this subdivision by reason of the exercise by the association of the right of redemption of savings accounts provided for in section 51A.34, the director shall remain validly in office until the expiration of the term of office or until the director otherwise becomes ineligible, resigns, or is removed, whichever may occur first.\n[Repealed by amendment, 1988 c 666 s 19]\nAt the first annual meeting, the members shall by majority vote divide the directors into three classes of as nearly equal numbers as possible. The term of office of directors of the first class shall expire at the annual meeting next after the first election; of the second class, one year thereafter; and of the third class, two years thereafter; and at each annual election thereafter directors shall be chosen for a full term of three years to succeed those whose terms expire.\nThe authorized number of directors determined by the members within the limits hereinabove specified may subsequently be increased or decreased only by vote of the members.\nIf the members fail to elect a director to fill each vacancy created by any increase, the directors may fill the vacancy by electing a director to serve until the next annual meeting of the members, at which time a director shall be elected to fill the vacancy for the unexpired term for the class of director in which the vacancy exists.\nWhenever under the provisions hereof the number of directors is changed and vacancies caused by the change are filled, the directors so elected shall be classified in accordance with the provisions hereof, so that each of the three classes shall always contain numbers as nearly equal as possible.\nAny vacancy among directors, not so filled by the members, may be filled by a majority vote of the remaining directors, though less than a quorum, by electing a director to serve until the next annual meeting of the members, at which time a director shall be elected to fill the vacancy for the unexpired term for the class of director in which the vacancy exists. In event of a vacancy on the board of directors from any cause, the remaining directors shall have full power and authority to continue direction of the association until the vacancy is filled.",
	"repealed": false
}