{
	"id": "244.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.50",
	"title": "244.50 REALLOCATING EARNED INCENTIVE RELEASE SAVINGS.",
	"text": "The reallocation of earned incentive release savings account is established in the special revenue fund in the state treasury. Funds in the account are appropriated to the commissioner and must be expended in accordance with the allocation established in subdivision 4 after the requirements of subdivision 2 are met. Funds in the account are available until expended.\nOn or before the final closeout date of each fiscal year, the commissioner must certify to Minnesota Management and Budget the earned incentive release savings from the previous fiscal year. The commissioner must provide the detailed calculation substantiating the savings amount, including accounting-system-generated data where possible, supporting the direct-cost per diem and the incarcerated days saved.\nAfter the certification in subdivision 2 is completed, the commissioner must transfer funds from the appropriation from which the savings occurred to the reallocation revenue account according to the allocation in subdivision 4. Transfers must occur by September 1 each year.\nThe commissioner must distribute funds as follows:\n(1) 50 percent must be transferred to the Office of Justice Programs in the Department of Public Safety for crime victim services;\n(2) 25 percent must be transferred to the Community Corrections Act subsidy appropriation and to the Department of Corrections for supervised release and intensive supervision services, based upon a three-year average of the release jurisdiction of supervised releasees and intensive supervised releasees across the state; and\n(3) 25 percent must be transferred to the Department of Corrections for:\n(i) grants to develop and invest in community-based services that support the identified needs of correctionally involved individuals or individuals at risk of becoming involved in the criminal justice system; and\n(ii) sustaining the operation of evidence-based programming in state and local correctional facilities.",
	"repealed": false
}