{
	"id": "375A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.09",
	"title": "375A.09 HOW TO CHANGE THE NUMBER OF COUNTY BOARD MEMBERS.",
	"text": "Notwithstanding any other provision of law specifying the number of members of the board of county commissioners and except as otherwise provided in sections 375A.01 to 375A.13, any county may alter the number of members on the board of county commissioners in accordance with the provisions of this section. Until the adoption of a modification of the number of the members of the board of county commissioners, each county shall elect the number of county commissioners by the method in effect for that county on July 1, 1973. Any of the modifications may be adopted or abandoned by a county by following the procedures set forth in sections 375A.01 to 375A.13.\nAny county may provide that the board of county commissioners shall consist of three, five, seven or nine members.\nEvery county commissioner shall be a resident of the county and shall be a resident of the district from which nominated and elected.\nThe county shall be divided into the number of districts from which commissioners are nominated and elected and the population of the county shall be apportioned to the several districts so that each commissioner represents the same number of persons as nearly as may be possible. When the number of commissioners has been changed, the county board shall proceed to redistrict the county accordingly and it shall follow as nearly as possible the times and procedures specified in section 375.025, including determining the two-year and four-year terms first assigned to districts in order to provide as nearly as possible for an equal number of overlapping four-year terms in the future. The resolution redistricting the county shall be adopted not less than 30 days before the first day candidates may file for the office of county commissioner. Commissioners to be elected pursuant to the modification of the county board shall be elected at the general election following the adoption of the modification.",
	"repealed": false
}