{
	"id": "297G.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.19",
	"title": "297G.19 CRIMINAL PENALTIES.",
	"text": "(a) A person required to file a return, report, or other document with the commissioner who fails to do so is guilty of a misdemeanor.\n(b) A person required to pay or to collect and remit a tax under this chapter, who fails to do so when required, is guilty of a misdemeanor.\n(a) A person required to file a return, report, or other document with the commissioner, who knowingly, rather than accidentally, inadvertently, or negligently, fails to file it when required, is guilty of a gross misdemeanor.\n(b) A person required to pay or to collect and remit a tax under this chapter, who knowingly, rather than accidentally, inadvertently, or negligently, fails to file it when required, is guilty of a gross misdemeanor.\n(a) A person who files with the commissioner a return, report, or other document, known by the person to be fraudulent or false concerning a material matter, is guilty of a felony.\n(b) A person who knowingly aids or assists in, or advises in the preparation or presentation of a return, report, or other document that is fraudulent or false concerning a material matter, whether or not the falsity or fraud is committed with the knowledge or consent of the person authorized or required to present the return, report, or other document, is guilty of a felony.\n(a) A person entering Minnesota from another state who imports or possesses more than one liter, but fewer than 25 liters of untaxed intoxicating liquor, or more than 288 ounces (nine quarts), but fewer than 6,800 ounces (225 quarts) of untaxed fermented malt beverages is guilty of a misdemeanor.\n(b) A person entering Minnesota from another state who imports or possesses 25 liters or more, but fewer than 225 liters of untaxed intoxicating liquor, or 6,800 ounces (225 quarts) or more, but fewer than 34,000 ounces (1,225 quarts) of untaxed fermented malt beverages is guilty of a gross misdemeanor.\n(c) A person entering Minnesota from another state who imports or possesses 225 liters or more of untaxed intoxicating liquor, or 34,000 ounces (1,225 quarts) or more of untaxed fermented malt beverages is guilty of a felony.\n(a) A person entering Minnesota from a foreign country who imports or possesses more than four liters, but fewer than 100 liters of untaxed intoxicating liquor, or more than 320 ounces (ten quarts), but fewer than 8,000 ounces (250 quarts) of untaxed fermented malt beverages is guilty of a misdemeanor.\n(b) A person entering Minnesota from a foreign country who imports or possesses 100 liters or more, but fewer than 500 liters of untaxed intoxicating liquor, or 8,000 ounces (250 quarts) or more, but fewer than 40,000 ounces (1,250 quarts) of untaxed fermented malt beverages is guilty of a gross misdemeanor.\n(c) A person entering Minnesota from a foreign country who imports or possesses 500 liters or more of untaxed intoxicating liquor, or 40,000 ounces (1,250 quarts) or more of untaxed fermented malt beverages is guilty of a felony.\nCriminal penalties imposed by this section are in addition to any civil penalties imposed by this chapter.\nAny violation of this chapter unless otherwise specified is a misdemeanor.\nNotwithstanding section 628.26, or any other provision of the criminal laws of this state, an indictment may be found and filed, or a complaint filed, upon a criminal offense named in this section, in the proper court within six years after the offense is committed.",
	"repealed": false
}