{
	"id": "484.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.72",
	"title": "484.72 ELECTRONIC RECORDING OF COURT PROCEEDINGS.",
	"text": "Except as provided in subdivision 4, electronic recording equipment may be used to record court proceedings in lieu of a court reporter. However, at the request of any party to any proceedings, the court may, in its discretion, require a competent stenographer who meets minimum qualifications promulgated by the supreme court, to make a complete stenographic record of the proceedings.\nThe court shall have the authority to appoint a person or persons to operate and monitor electronic recording equipment. The person or persons may be paid on a salary basis, on a contract basis, or such other basis as the court deems appropriate.\nFor the purpose of this section the state court administrator shall promulgate specifications for acceptable electronic recording equipment used to record court proceedings and minimum qualifications for the persons who operate and monitor the equipment.\nA competent stenographer who meets minimum qualifications promulgated by the supreme court, shall make a complete stenographic record of the following court proceedings:\n(1) Felony and gross misdemeanor offenses, except arraignments and first appearance in district court as specified in rule 8 of the Rules of Criminal Procedure.\n(2) District court jury trials.\n(3) Contested district court trials and fact-finding hearings. Where required by statute or court rule, electronic recording equipment may be used in addition to the services of a competent stenographer.\nIf, when electronic recording equipment is used, a malfunction occurs in the recording process so that the recording is incomplete, the court may declare a mistrial if the malfunction is discovered during the trial. If the malfunction is discovered in the course of preparing a transcript after a verdict has been entered, the court may grant a new trial upon motion of any party.\nNotwithstanding subdivisions 1 and 4, hearings and proceedings conducted in the expedited child support process under section 484.702 may be reported by use of electronic recording equipment provided that the equipment meets the minimum standards promulgated by the state court administrator. Electronic recording equipment must be operated and monitored by a person who meets the minimum qualifications promulgated by the state court administrator.",
	"repealed": false
}