{
	"id": "237.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.231",
	"title": "237.231 SALE OF LOCAL EXCHANGE SERVICE.",
	"text": "A Class A telephone company may not sell a local exchange service territory without receiving the prior consent of the commission. For the purposes of this section, a Class A telephone company is a telephone company which has annual revenues from regulated telecommunication operations of $100,000,000 or more, as defined by the Federal Communications Commission in Code of Federal Regulations, title 47, section 32.11, paragraphs (a)(1) and (e).\nAt least 90 days prior to applying to the commission for consent to a proposed sale or acquisition of a local exchange service, the selling telephone company must provide notice to its customers in that local exchange of its intent to sell and identify the affected local exchange, and the name of the proposed buyer. The notice must be on a separate document and included in the company's monthly billings to customers. The commission must approve the form of all notices.\nAt least 60 days prior to the hearing under subdivision 4, the telephone company proposing the sale of a local exchange service must provide each of its customers with a stamped envelope addressed to the commission and must inform the customer that the customer is encouraged to comment on the quality of service that has been provided in the local exchange service territory by the telephone company over the last 12 months.\nAt least 30 days prior to the commission's deliberations about a proposed sale or acquisition of a local exchange service territory, the commission must hold a public hearing at a location within the affected local exchange service territory allowing the public an opportunity to be heard and to present any concerns or comments.\nThe commission may not give consent to a sale of a service territory unless, at a minimum, it finds all of the following:\n(1) the quality of service provided by the telephone company servicing the local exchange service territory has substantially complied with all applicable quality of service standards adopted by rule by the commission for the previous calendar year;\n(2) the proposed buyer is financially responsible and capable of making necessary investments to maintain quality service at levels required by rule; and\n(3) the proposed buyer demonstrates that it has an adequate number of properly trained employees to maintain service at required levels.\nThe commission shall, as a condition of its consent, require a proposed buyer to enter into binding commitments obligating the buyer to maintain minimum levels of investment and staffing needed to meet the commission's quality of service rules. These commitments are in addition to any other conditions that the commission may impose.",
	"repealed": false
}