{
	"id": "412.701",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.701",
	"title": "412.701 BUDGETING.",
	"text": "The manager shall prepare the estimates for the annual budget. The budget shall be by funds and shall include all the funds of the city, except the funds made up of proceeds of bond issues, utility funds, and special assessment funds, and may include any of such funds at the discretion of the council. The estimates of expenditures for each fund budgeted shall be arranged for each department or division of the city under the following heads: (1) ordinary expenses (for operation, maintenance, and repairs); (2) payment of principal and interest on bonds and other fixed charges; (3) capital outlays (for new construction, new equipment, and all improvements of a lasting character). Ordinary expenses shall be subdivided into: (a) salaries and wages, with a list of all salaried offices and positions, including the salary allowance and the number of persons holding each; (b) other expenses, with sufficient detail to be readily understood. All increases and decreases shall be clearly shown. In parallel columns shall be added the amounts granted and the amounts expended under similar heads for the past two completed fiscal years and the current fiscal year, actual to date and estimated for the balance of the year. In addition to the estimates of expenditures, the budget shall include for each budgeted fund a statement of the revenues which have accrued for the past two completed fiscal years with the amount collected and the uncollected balances together with the same information, based in so far as necessary on estimates, for the current fiscal year, and an estimate of the revenues for the ensuing fiscal year. The statement of revenues for each year shall specify the following items: sums derived from (a) taxation, (b) fees, (c) fines, (d) interest, (e) miscellaneous, not included in the foregoing, (f) sales and rentals, (g) earnings of public utilities and other public service enterprises, (h) special assessments, and (i) sales of bonds and other obligations. Such estimates shall be printed or typewritten and there shall be sufficient copies for each member of the council, for the manager, for the clerk, and three, at least, to be posted in public places in the city. The estimates shall be submitted to the council and shall be made public. The manager may submit with the estimates such explanatory statement or statements as the manager may deem necessary, and during the first three years of operation under Optional Plan B the manager shall be authorized to interpret the requirements of this section as requiring only such comparisons of the city's finances with those of the previous government of the city as may be feasible and pertinent.",
	"repealed": false
}