{
	"id": "216B.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.161",
	"title": "216B.161 AREA DEVELOPMENT RATE PLAN.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them in this subdivision.\n(b) \"Area development rate\" means a rate schedule established by a utility that provides customers within an area development zone service under a base utility rate schedule, except that charges may be reduced from the base rate as agreed upon by the utility and the customer consistent with this section.\n(c) \"Area development zone\" means a contiguous or noncontiguous area designated by an authority or municipality for development or redevelopment and within which one of the following conditions exists:\n(1) obsolete buildings not suitable for improvement or conversion or other identified hazards to the health, safety, and general well-being of the community;\n(2) buildings in need of substantial rehabilitation or in substandard condition; or\n(3) low values and damaged investments.\n(d) \"Authority\" means a rural development financing authority established under sections 469.142 to 469.151; a housing and redevelopment authority established under sections 469.001 to 469.047; a port authority established under sections 469.048 to 469.068; an economic development authority established under sections 469.090 to 469.108; a redevelopment agency as defined in sections 469.152 to 469.165; the Department of Iron Range Resources and Rehabilitation established under section 298.22; a municipality that is administering a development district created under sections 469.124 to 469.133 or any special law; a municipality that undertakes a project under sections 469.152 to 469.165, except a town located outside the metropolitan area as defined in section 473.121, subdivision 2, or with a population of 5,000 persons or less; or a municipality that exercises the powers of a port authority under any general or special law.\n(e) \"Municipality\" means a city, however organized, and, with respect to a project undertaken under sections 469.152 to 469.165, \"municipality\" has the meaning given in sections 469.152 to 469.165, and, with respect to a project undertaken under sections 469.142 to 469.151 or a county or multicounty project undertaken under sections 469.004 to 469.008, also includes any county.\nThe commission may allow gas or electric public utilities to offer area development rates. The program must be designed to assist industrial revitalization projects located within the service area of the participating utility.\nAn area development rate offered under this section must:\n(1) be offered for a specified length of time to be determined by the commission;\n(2) be offered as a supplement to other development incentives offered by the authority or municipality in which the rate is available;\n(3) be available only to new or expanding manufacturing or wholesale trade customers;\n(4) be designed to recover at least the incremental cost of providing service to the participating customers;\n(5) be offered in a fixed number of area development zones; and\n(6) include a provision that the utility provide participating customers with an energy audit and inform those customers of all existing energy conservation programs available from the utility.\nRecovery of costs under clause (4) must not be from residential customers. A utility within a general rate case, may seek recovery of the difference in revenue collected under the area development plan rate and what would have been collected under the standard tariff.\n[Repealed by amendment, 1995 c 9 s 1]",
	"repealed": false
}