{
	"id": "352.955",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.955",
	"title": "352.955 TRANSFER OF PRIOR MSRS-GENERAL SERVICE CREDIT.",
	"text": "(a) An eligible employee described in paragraph (b) may elect to transfer service credit in the general state employees retirement plan of the Minnesota State Retirement System to the correctional state employees retirement plan for eligible prior correctional employment.\n(b) An eligible employee is a person who is covered by legislation implementing the recommendations under section 352.91, subdivision 4a.\n(c) Eligible prior correctional employment is employment covered by the general state employees retirement plan of the Minnesota State Retirement System, is continuous service, and is certified by the commissioner of corrections and the Direct Care and Treatment executive board, whichever applies, and by the commissioner of management and budget to the executive director of the Minnesota State Retirement System as service that would qualify for correctional state employees retirement plan coverage under section 352.91, if the service had been rendered after the date of coverage transfer.\n(d) The election to transfer past service credit under this section must be made in writing by the applicable person on a form prescribed by the executive director of the Minnesota State Retirement System and must be filed with the executive director of the Minnesota State Retirement System on or before the one year anniversary of the coverage transfer or the date of the eligible employee's termination of state employment, whichever is earlier.\n[Repealed, 2013 c 111 art 2 s 33]\n(a) An eligible employee who is transferred to plan coverage and who elects to transfer past service credit under this section must pay an additional member contribution for that prior service period. The additional member contribution is the amount computed under paragraph (b), plus the greater of the amount computed under paragraph (c), or 40 percent of the unfunded actuarial accrued liability attributable to the past service credit transfer.\n(b) The executive director shall compute, for the most recent 12 months of service credit eligible for transfer, or for the entire period eligible for transfer if less than 12 months, the difference between the employee contribution rate or rates for the general state employees retirement plan and the employee contribution rate or rates for the correctional state employees retirement plan applied to the eligible employee's salary during that transfer period, plus compound interest at the applicable monthly rate or rates specified in section 356.59, subdivision 2.\n(c) The executive director shall compute, for any service credit being transferred on behalf of the eligible employee and not included under paragraph (b), the difference between the employee contribution rate or rates for the general state employees retirement plan and the employee contribution rate or rates for the correctional state employees retirement plan applied to the eligible employee's salary during that transfer period, plus compound interest at the applicable monthly rate or rates specified in section 356.59, subdivision 2.\n(d) The executive director shall compute an amount using the process specified in paragraph (b), but based on differences in employer contribution rates between the general state employees retirement plan and the correctional state employees retirement plan rather than employee contribution rates.\n(e) The executive director shall compute an amount using the process specified in paragraph (c), but based on differences in employer contribution rates between the general state employees retirement plan and the correctional state employees retirement plan rather than employee contribution rates.\n(f) The additional equivalent member contribution under this subdivision must be paid in a lump sum. Payment must accompany the election to transfer the prior service credit. No transfer election or additional equivalent member contribution payment may be made by a person or accepted by the executive director after the one year anniversary date of the effective date of the retirement coverage transfer, or the date on which the eligible employee terminates state employment, whichever is earlier.\n(g) If an eligible employee elects to transfer past service credit under this section and pays the additional equivalent member contribution amount under paragraph (a), the applicable department shall pay an additional equivalent employer contribution amount. The additional employer contribution is the amount computed under paragraph (d), plus the greater of the amount computed under paragraph (e), or 60 percent of the unfunded actuarial accrued liability attributable to the past service credit transfer.\n(h) The unfunded actuarial accrued liability attributable to the past service credit transfer is the present value of the benefit obtained by the transfer of the service credit to the correctional state employees retirement plan reduced by the amount of the asset transfer under subdivision 4, by the amount of the member contribution equivalent payment computed under paragraph (b), and by the amount of the employer contribution equivalent payment computed under paragraph (d).\n(i) The additional equivalent employer contribution under this subdivision must be paid in a lump sum and must be paid within 30 days of the date on which the executive director of the Minnesota State Retirement System certifies to the applicable department that the employee paid the additional equivalent member contribution.\nAssets related to the transferred service credit of an eligible employee must be transferred from the general state employees retirement fund to the correctional state employees retirement fund in an amount equal to the present value of benefits earned under the general state employees retirement plan by the eligible employee transferring past service to the correctional state employees retirement plan, as determined by the actuary retained under section 356.214, multiplied by the accrued liability funding ratio of the active members of the general state employees retirement plan as derived from the most recent actuarial valuation prepared under section 356.215. The transfer of assets must be made within 45 days after the coverage transfer election is made.\nUpon the transfer of assets under subdivision 4, the service credit in the general state employees retirement plan of the Minnesota State Retirement System related to the period being transferred is forfeited and may not be reinstated. The transferred service credit and the transferred assets must be credited to the correctional state employees retirement plan and fund, respectively.\nThe applicable department shall pay the cost of the actuarial calculations required by this section as billed by the executive director of the Minnesota State Retirement System.",
	"repealed": false
}