{
	"id": "144.1481",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1481",
	"title": "144.1481 RURAL HEALTH ADVISORY COMMITTEE.",
	"text": "The commissioner of health shall establish a Rural Health Advisory Committee. The committee shall consist of the following 22 members, all of whom must reside outside the seven-county metropolitan area, as defined in section 473.121, subdivision 2:\n(1) two members from the house of representatives of the state of Minnesota, one from the majority party and one from the minority party;\n(2) two members from the senate of the state of Minnesota, one from the majority party and one from the minority party;\n(3) a volunteer member of an ambulance service based outside the seven-county metropolitan area;\n(4) a representative of a hospital located outside the seven-county metropolitan area;\n(5) a representative of a nursing home located outside the seven-county metropolitan area;\n(6) a medical doctor or doctor of osteopathic medicine licensed under chapter 147;\n(7) a dentist licensed under chapter 150A;\n(8) an allied dental personnel as defined in Minnesota Rules, part 3100.0100, subpart 5;\n(9) an advanced practice professional;\n(10) a registered nurse or licensed practical nurse;\n(11) a licensed health care professional from an occupation not otherwise represented on the committee;\n(12) a representative of an institution of higher education located outside the seven-county metropolitan area that provides training for rural health care providers;\n(13) a member of a Tribal Nation;\n(14) a representative of a local public health agency or community health board;\n(15) a health professional or advocate with experience working with people with mental illness;\n(16) a representative of a community organization that works with individuals experiencing health disparities;\n(17) an individual with expertise in economic development, or an employer working outside the seven-county metropolitan area;\n(18) two consumers, at least one of whom must be from a community experiencing health disparities; and\n(19) one consumer who is an advocate for persons who are developmentally disabled.\nThe commissioner will make recommendations for committee membership. Committee members will be appointed by the governor. In making appointments, the governor shall ensure that appointments provide geographic balance among those areas of the state outside the seven-county metropolitan area. The chair of the committee shall be elected by the members. The advisory committee is governed by section 15.059, except that the members do not receive per diem compensation.\nThe advisory committee shall:\n(1) advise the commissioner and other state agencies on rural health issues;\n(2) provide a systematic and cohesive approach toward rural health issues and rural health care planning, at both a local and statewide level;\n(3) develop and evaluate mechanisms to encourage greater cooperation among rural communities and among providers;\n(4) recommend and evaluate approaches to rural health issues that are sensitive to the needs of local communities; and\n(5) develop methods for identifying individuals who are underserved by the rural health care system.\nThe commissioner shall provide the advisory committee with staff support, office space, and access to office equipment and services.",
	"repealed": false
}