{
	"id": "125A.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.75",
	"title": "125A.75 SPECIAL EDUCATION PROGRAMS; APPROVAL; AID PAYMENTS; TRAVEL AID; LITIGATION COSTS.",
	"text": "The state must pay each district one-half of the sum actually expended by a district, based on mileage, for necessary travel of essential personnel providing home-based or community-based services to children with a disability under age five and their families.\nThe aids provided for children with a disability must be paid to the district providing the special instruction and services. General education aid must be paid to the district of the pupil's residence. The total amount of aid paid may not exceed the amount expended for children with a disability in the year for which the aid is paid.\nThe state must pay each district the actual cost incurred in providing instruction and services for a child whose district of residence has been determined by section 125A.17 or 125A.51, paragraph (b), and who is temporarily placed in a state institution, a licensed residential facility, or foster facility for care and treatment. The regular education program at the facility must be an approved program according to section 125A.515.\nUpon following the procedure specified by the commissioner, the district may bill the state the actual cost incurred in providing the services including transportation costs and a proportionate amount of capital expenditures and debt service, minus the amount of the basic revenue, as defined in section 126C.10, subdivision 2, of the district for the child and the special education aid, transportation aid, and any other aid earned on behalf of the child. The limit in subdivision 2 applies to aid paid pursuant to this subdivision.\nTo the extent possible, the commissioner shall obtain reimbursement from another state for the cost of serving any child whose parent or guardian resides in that state. The commissioner may contract with the appropriate authorities of other states to effect reimbursement. All money received from other states must be paid to the state treasury and placed in the general fund.\nBefore June 1 of each year, each district providing special instruction and services to children with a disability, including children eligible for Part C, as defined in section 125A.02, subdivision 1, and section 125A.27, subdivision 8, must submit to the commissioner an application for approval of these programs and their budgets for the next fiscal year. The application must include an enumeration of the costs proposed as eligible for state aid pursuant to this section and of the estimated number and grade level of children with a disability in the district who will receive special instruction and services during the next fiscal year. The application must also include any other information deemed necessary by the commissioner for the calculation of state aid and for the evaluation of the necessity of the program, the necessity of the personnel to be employed in the program, for determining the amount which the program will receive from grants from federal funds, or special grants from other state sources, and the program's compliance with the rules and standards of the Department of Education. The commissioner shall review each application to determine whether the program and the personnel to be employed in the program are actually necessary and essential to meet the district's obligation to provide special instruction and services to children with a disability pursuant to sections 125A.03 to 125A.24, 125A.259 to 125A.48, and 125A.65. The commissioner shall not approve aid pursuant to this section for any program or for the salary of any personnel determined to be unnecessary or unessential on the basis of this review. The commissioner may withhold all or any portion of the aid for programs which receive grants from federal funds, or special grants from other state sources. By August 31 the commissioner shall approve, disapprove, or modify each application, and notify each applying district of the action and of the estimated amount of aid for the programs. The commissioner shall provide procedures for districts to submit additional applications for program and budget approval during the fiscal year, for programs needed to meet any substantial changes in the needs of children with a disability in the district. Notwithstanding the provisions of section 127A.42, the commissioner may modify or withdraw the program or aid approval and withhold aid pursuant to this section without proceeding according to section 127A.42 at any time the commissioner determines that the program does not comply with rules of the Department of Education or that any facts concerning the program or its budget differ from the facts in the district's approved application.\nWhen planning programs for the education of children with a disability in the regular classroom, school districts are encouraged to consider the size of the regular class and to provide the support services necessary to ensure successful mainstreaming.\n[Repealed, 2007 c 146 art 3 s 25]\n[Repealed, 1Sp2017 c 5 art 4 s 13]\n[Repealed, 1Sp2005 c 5 art 3 s 19]\nMS 2018 [Repealed, 1Sp2019 c 11 art 1 s 26]",
	"repealed": false
}