{
	"id": "462A.2095",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.2095",
	"title": "462A.2095 RENT ASSISTANCE PROGRAM.",
	"text": "(a) The state rent assistance account is established as a separate account in the housing development fund. Money in the account is appropriated to the agency for grants to program administrators for the purposes specified in this section.\n(b) Money deposited in the account under section 297A.9925 is for grants to program administrators in the metropolitan counties as defined in section 473.121, subdivision 4.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Eligible household\" means a household with an annual income of up to 50 percent of the area median income as determined by the United States Department of Housing and Urban Development, adjusted for family size, that is paying more than 30 percent of the household's annual income on rent. Eligibility is determined at the time a household first receives rent assistance under this section. Eligibility shall be recertified every year thereafter. Eligible household does not include a household receiving federal tenant-based or project-based assistance under Section 8 of the United States Housing Act of 1937, as amended.\n(c) \"Program administrator\" means:\n(1) a housing and redevelopment authority or other local government agency or authority that administers federal tenant-based or project-based assistance under Section 8 of the United States Housing Act of 1937, as amended;\n(2) a Tribal government or Tribally designated housing entity; or\n(3) if there is no entity under clause (1) or (2) with the capacity to administer the program, a nongovernmental organization determined by the agency to have the capacity to administer the program.\n(a) The agency may make grants to program administrators to provide rental assistance for eligible households. For both tenant-based and project-based assistance, program administrators shall pay assistance directly to housing providers. Rental assistance may be provided in the form of tenant-based assistance or project-based assistance. Notwithstanding the amounts awarded under subdivision 1, paragraph (b), and to the extent practicable, the agency must make grants statewide in proportion to the number of households eligible for assistance in each county according to the most recent American Community Survey of the United States Census Bureau.\n(b) The program administrator may use its existing procedures to administer the rent assistance program or may develop alternative procedures with the goals of reaching households most in need and incentivizing landlord participation. The agency must approve a program administrator's alternative procedures. Priority for rental assistance shall be given to households with children 18 years of age and under, and annual incomes of up to 30 percent of the area median income. Program administrators may establish additional priority populations based on local need.\nA program administrator may provide tenant-based or project-based vouchers in amounts equal to the difference between 30 percent of household income and the rent charged, plus an allowance for utilities if not included in rent. A program administrator may not provide assistance that is more than the difference between 30 percent of the tenant's gross income and 120 percent of the payment standard, plus utilities, as established by the local public housing authority, unless otherwise authorized by the agency.\nThe agency shall consult with public housing authorities to determine the amount of administrative fees, including start-up costs, to pay to program administrators.\n(a) Notwithstanding any law to the contrary, payments under this section must not be considered income, assets, or personal property for purposes of determining eligibility or recertifying eligibility for state public assistance, including but not limited to:\n(1) child care assistance programs under chapter 142E;\n(2) general assistance, Minnesota supplemental aid, and food support under chapter 256D;\n(3) housing support under chapter 256I;\n(4) Minnesota family investment program and diversionary work program under chapter 142G; and\n(5) economic assistance programs under chapter 256P.\n(b) The commissioner of human services must not consider rent assistance grant money under this section as income or assets under section 256B.056, subdivision 1a, paragraph (a); subdivision 3; or subdivision 3c, or for persons with eligibility determined under section 256B.057, subdivision 3, 3a, or 3b.\nThe agency may direct program administrators to comply with applicable sections of Code of Federal Regulations, title 24, parts 982 and 983.",
	"repealed": false
}