{
	"id": "125A.744",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.744",
	"title": "125A.744 STATEWIDE DATA MANAGEMENT SYSTEM TO MAXIMIZE MEDICAL ASSISTANCE REIMBURSEMENT.",
	"text": "For purposes of this section, cooperative unit has the meaning given in section 123A.24, subdivision 2.\nThe commissioner of education, in cooperation with the commissioner of human services, shall develop a statewide data management system using the educational data reporting system or other existing data management system for school districts and cooperative units to use to maximize medical assistance reimbursement for health and health-related services provided under individualized education programs and individual family service plans. The system must be appropriately integrated with state and local existing and developing human services and education data systems. The statewide data management system must enable school district and cooperative unit staff to:\n(1) establish medical assistance billing systems or improve existing systems;\n(2) understand the appropriate medical assistance billing codes for services provided under individualized education programs and individual family service plans;\n(3) comply with the Individuals with Disabilities Education Act, Public Law 105-17;\n(4) contract with billing agents; and\n(5) carry out other activities necessary to maximize medical assistance reimbursement.\nConsistent with section 256B.0625, subdivision 26, school districts may enroll as medical assistance providers or subcontractors and bill the Department of Human Services under the medical assistance fee for service claims processing system for special education services which are covered services under chapter 256B, which are provided in the school setting for a medical assistance recipient, and for whom the district has secured informed consent consistent with section 13.05, subdivision 4, paragraph (d), and section 256B.77, subdivision 2, paragraph (p), to bill for each type of covered service. School districts shall be reimbursed by the commissioner of human services for the federal share of individualized education program health-related services that qualify for reimbursement by medical assistance, minus up to five percent retained by the commissioner of human services for administrative costs, not to exceed $450,000 per fiscal year. The commissioner may withhold up to five percent of each payment to a school district. Following the end of each fiscal year, the commissioner shall settle up with each school district in order to ensure that collections from each district for departmental administrative costs are made on a pro rata basis according to federal earnings for these services in each district. A school district is not eligible to enroll as a home care provider or a personal care provider organization for purposes of billing home care services under sections 256B.0651, 256B.0653, and 256B.0654 until the commissioner of human services issues a bulletin instructing county public health nurses on how to assess for the needs of eligible recipients during school hours. To use home care nursing services or personal care services at school, the recipient or responsible party must provide written authorization in the care plan identifying the chosen provider and the daily amount of services to be used at school.",
	"repealed": false
}