{
	"id": "103D.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.315",
	"title": "103D.315 MANAGERS.",
	"text": "Each manager must take and sign the oath defined in the Minnesota Constitution, article V, section 6. The signed oath must be filed with the board.\n(a) Each manager must file a bond with the board before assuming the manager's duties. The bond may be:\n(1) a personal bond for each manager;\n(2) a schedule or position bond or undertaking by the managers of the watershed district; or\n(3) a single corporate surety fidelity, schedule or position bond or undertaking covering all managers and employees of the watershed district, including officers and employees required by law to furnish an individual bond or undertaking.\n(b) The amount of the bond for managers is $1,000, unless increased by the board. The amount of the bond for officers and employees of the watershed district is the amount set by law or by the person or board authorized to set the amounts.\n(c) The bond must be conditioned substantially as provided in section 574.13.\n(d) The premium for the bond must be paid by the watershed district.\nAfter filing the bond, the managers must elect different managers as president, secretary, and treasurer. The managers must fill vacancies occurring in the officers' positions. The managers must provide the necessary books, records, furniture, and equipment for the officers to perform their official duties.\nMS 2022 [Repealed, 2024 c 90 art 3 s 88]\nThe managers must keep efficient records of all proceedings, minutes, certificates, contracts, bonds of the board's employees, and all other business transacted or action taken by the managers. The records must be open to inspection by the property owners within the watershed district and all other interested parties at all reasonable times.\nThe term of office for a manager is three years except for the first board of managers appointed by the state board and the first board appointed by the county board. A manager's term continues until a successor is appointed and qualified.\nThe provisions of section 351.02 regarding vacancies apply to members of the board of managers.\nThe compensation of managers for meetings and for performance of other necessary duties may not exceed $125 a day. Managers are entitled to reimbursement for traveling and other necessary expenses incurred in the performance of official duties.\n(a) Within 30 days after the first board of managers has received notice by personal service of their selection, the managers must meet at the watershed district's principal place of business.\n(b) At the first meeting, the managers must take the oath under subdivision 1, provide a bond under subdivision 2, elect officers under subdivision 3, and appoint an advisory committee under section 103D.331.\nThe managers shall meet annually and at other necessary times to transact the business of the watershed district. A meeting may be called at any time at the request of any manager according to chapter 13D.\nThe managers shall adopt bylaws for the administration of the business and affairs of the watershed district. Bylaws adopted under this subdivision are not subject to section 103D.341.",
	"repealed": false
}