{
	"id": "135A.1582",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.1582",
	"title": "135A.1582 PROTECTIONS FOR PREGNANT AND PARENTING STUDENTS.",
	"text": "(a) For the purpose of this section, the following term has the meaning given.\n(b) \"Parenting student\" means a student enrolled at a public college or university who is the parent or legal guardian of or can claim as a dependent a child under the age of 18.\n(a) A Minnesota state college or university may not require and the University of Minnesota is requested not to require a pregnant or parenting student, solely because of the student's status as a pregnant or parenting student or due to issues related to the student's pregnancy or parenting, to:\n(1) take a leave of absence or withdraw from the student's degree or certificate program;\n(2) limit the student's studies;\n(3) participate in an alternative program;\n(4) change the student's major, degree, or certificate program; or\n(5) refrain from joining or cease participating in any course, activity, or program at the college or university.\n(b) A Minnesota state college or university shall provide and the University of Minnesota is requested to provide reasonable modifications to a pregnant student, including modifications that:\n(1) would be provided to a student with a temporary medical condition; or\n(2) are related to the health and safety of the student and the student's unborn child, such as allowing the student to maintain a safe distance from substances, areas, and activities known to be hazardous to pregnant women or unborn children.\n(c) A Minnesota state college or university must and the University of Minnesota is requested to, for reasons related to a student's pregnancy, childbirth, or any resulting medical status or condition:\n(1) excuse the student's absence;\n(2) allow the student to make up missed assignments or assessments;\n(3) allow the student additional time to complete assignments in the same manner as the institution allows for a student with a temporary medical condition; and\n(4) provide the student with access to instructional materials and video recordings of lectures for classes for which the student has an excused absence under this section to the same extent that instructional materials and video recordings of lectures are made available to any other student with an excused absence.\n(d) A Minnesota state college or university must and the University of Minnesota is requested to allow a pregnant or parenting student to:\n(1) take a leave of absence; and\n(2) if in good academic standing at the time the student takes a leave of absence, return to the student's degree or certificate program in good academic standing without being required to reapply for admission.\n(e) If a public college or university provides early registration for courses or programs at the institution for any group of students, the Minnesota state college or university must provide and the University of Minnesota is requested to provide early registration for those courses or programs for pregnant or parenting students in the same manner.\nEach Minnesota state college or university must adopt and the University of Minnesota is requested to adopt a policy for students on pregnancy and parenting discrimination. The policy must:\n(1) include the contact information of the Title IX coordinator who is the designated point of contact for a student requesting each protection or modification under this section. Contact information must include the Title IX coordinator's name, phone number, email, and office;\n(2) be posted in an easily accessible, straightforward format on the college or university's website; and\n(3) be made available annually to faculty, staff, and employees of the college or university.\nThe commissioner of the Office of Higher Education must, in consultation with the Board of Trustees of the Minnesota State Colleges and Universities and the Board of Regents of the University of Minnesota, establish guidelines, as necessary, to administer this section. The guidelines must establish minimum periods for which a pregnant or parenting student must be given a leave of absence under subdivision 2, paragraph (d). In establishing the minimum periods, the Office of Higher Education shall consider the maximum amount of time a student may be absent without significantly interfering with the student's ability to complete the student's degree or certificate program.",
	"repealed": false
}