{
	"id": "507.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.093",
	"title": "507.093 STANDARDS FOR DOCUMENTS TO BE RECORDED OR FILED.",
	"text": "The following standards are imposed on documents to be recorded with the county recorder or the registrar of titles other than by electronic means as provided in section 507.24, except as provided in sections 505.021, subdivision 1, and 505.04 for plats; 508.47, subdivision 4, and 508A.47, subdivision 4, for registered land surveys; and 515B.2-110(c) and 515B.2-1101(c) for common interest community plats:\n(1) The document shall consist of one or more individual sheets measuring no larger than 8.5 inches by 14 inches.\n(2) The form of the document shall be printed, typewritten, or computer generated in black ink and the form of the document shall not be smaller than 8-point type.\n(3) The document shall be on white paper of not less than 20-pound weight with no background color or images and, except for the first page, shall have a border of at least one-half inch on the top, bottom, and each side.\n(4) The first page of the document shall contain a blank space at the top measuring three inches, as measured from the top of the page, and a border of one-half inch on each side and the bottom. The right half of the blank space shall be reserved for recording information and the left half shall be reserved for tax certification. Any person may attach an administrative page before the first page of the document to accommodate this standard. The administrative page may contain the document title, document date, and, if applicable, the grantor and grantee, and shall be deemed part of the document when recorded.\n(5) The title of the document shall be prominently displayed at the top of the first page below the blank space referred to in clause (4), or on the administrative page.\n(6) No additional sheet shall be attached or affixed to a page that covers up any information or printed part of the form.\n(7) A document presented for recording must be sufficiently legible to reproduce a readable copy using the county recorder's or registrar of title's current method of reproduction.",
	"repealed": false
}