{
	"id": "115E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/115E.04",
	"title": "115E.04 PREVENTION AND RESPONSE PLANS.",
	"text": "Persons required to show specific preparedness under section 115E.03, subdivision 2, shall prepare and maintain a prevention and response plan for a worst case discharge. The plan must:\n(1) describe how it is consistent with the requirements of the national or area contingency plans developed under the Oil Pollution Act of 1990;\n(2) describe the measures taken to prevent discharges from occurring, including prevention of a worst case discharge, prevention of discharges of lesser magnitude, and prevention of discharges similar to those that have occurred from the vessel or facility during its history of operation;\n(3) identify the individual or individuals having full authority to implement response actions, and those individuals' qualifications and titles;\n(4) identify how communication and incident command relationships will be established between the individuals in command of a vessel or facility response and the following persons:\n(i) individuals in the employ of the owner or operator of the vessel or facility who are responding to the discharge;\n(ii) appropriate federal, state, and local officials; and\n(iii) other persons providing emergency response equipment and personnel;\n(5) describe the facility or vessel and identify the locations and characteristics of potential worst case discharges from the vessel or facility;\n(6) identify the means under section 115E.03, subdivision 4, that will be used to satisfy the requirement to have adequate equipment and personnel to respond to a worst case discharge;\n(7) contain copies of contracts, correspondence, or other documents showing that adequate personnel and equipment as described in section 115E.03, subdivision 4, will be available to respond to a worst case discharge;\n(8) describe the actions that will be taken by the persons described in section 115E.03, subdivision 4, in the event of a worst case discharge; and\n(9) describe the training, equipment testing, periodic drills, and unannounced drills that will be used to ensure that the persons and equipment described in section 115E.03, subdivision 4, are ready for response.\nA plan submitted to the federal government under the Oil Pollution Act of 1990 or prepared under other law may be used to satisfy the requirements in clauses (1) to (9) provided that the information required by clauses (1) to (9) is included in the plan.\n(a) A person required to be prepared under section 115E.03, other than a person who owns or operates a motor vehicle, rolling stock, or a facility that stores less than 250,000 gallons of oil or a hazardous substance, shall complete the response plan required by this section by March 1, 1993, unless one of the commissioners orders the person to demonstrate preparedness at an earlier date under section 115E.05.\n(b) A person who owns or operates a motor vehicle, rolling stock, or a facility that stores less than 250,000 gallons of oil or a hazardous substance shall complete the response plan required by this section by January 1, 1994.\n(c) Plans required under section 115E.04 or 115E.045 must be updated every three years. Plans must be updated before three years following a significant discharge, upon significant change in vessel or facility operation or ownership, upon significant change in the national or area contingency plans under the Oil Pollution Act of 1990, or upon change in the capabilities or role of a person named in a plan who has an important response role.\n(a) The commissioner of public safety must be notified when any of the following takes place:\n(1) submission of the plan to the federal government;\n(2) granting of exemptions or extensions of time by the federal government for submission of the plan; or\n(3) completion of the plan if submission to the federal government is not required.\n(b) Notification under this subdivision must be on a form prescribed by the commissioner of public safety and must include:\n(1) a description of the facility or vessel;\n(2) a description of the activities involving oil or hazardous substances;\n(3) a description of the types of materials being handled, including whether agricultural chemicals are involved; and\n(4) other information required by the commissioner.\n(c) The commissioner of public safety shall transmit a copy of the notification to the other commissioners as appropriate, depending on the types of materials involved.\n(a) A person required to show specific preparedness under section 115E.03, subdivision 2, must submit a copy of the prevention and response plan to any of the commissioners who request it and to an official of a political subdivision with appropriate jurisdiction upon the official's request, or the plan and equipment and material named in the plan may be examined upon the request of an authorized agent of a commissioner or official.\n(b) Upon the request of one or more of the commissioners, a person shall demonstrate the adequacy of prevention and response plans and preparedness measures by conducting announced or unannounced drills, calling persons and organizations named in a prevention and response plan and verifying roles and capabilities, locating and testing response equipment, questioning response personnel, or other means that in the judgment of the requesting commissioner demonstrate preparedness. Before requesting an unannounced drill, the requesting commissioner shall notify the other commissioners that a drill will be requested and invite them to participate in or witness the drill. If an unannounced drill is conducted to the satisfaction of the commissioners, the person conducting the drill may not be required to conduct an additional unannounced drill in the same calendar year.\nThe commissioner of the Pollution Control Agency, the Department of Agriculture, or the Department of Public Safety may establish, or a local official may request a commissioner to establish, a citizens advisory group following a discharge of oil or a hazardous substance. The purpose of the citizens advisory group is to facilitate exchange of information and concerns related to the discharge and response between the owner or operator of the vessel or facility, the governmental responders, and the affected members of the public.",
	"repealed": false
}