{
	"id": "128D.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/128D.16",
	"title": "128D.16 SHORT-TERM BORROWING.",
	"text": "The board of education of the special independent school district of Minneapolis may borrow money upon negotiable promissory notes or certificates of indebtedness, in the manner and subject to the limitations set forth in this section, for the purpose of anticipating general taxes theretofore levied by the school district for school purposes, but the aggregate of such borrowing remaining unpaid at any time shall never exceed 50 percent of such taxes which are due and payable and remaining unpaid in the calendar year the borrowing is made, and as to which no penalty for nonpayment or delinquency has attached.\nThe school board may also borrow money in the manner and subject to the limitations hereinafter set forth in anticipation of receipt of state aid for schools and of federal school aids to be distributed by or through the Department of Education, but the aggregate of such borrowings remaining unpaid at any time shall never exceed 75 percent of such aids which are receivable by said school district in the calendar school year (from July 1 to the following June 30) in which the money is borrowed, as estimated and certified by the commissioner of education.\nUpon the passage of a resolution adopted by a vote of at least two-thirds of its members, which resolution specifies the amount and purposes for which it deems such borrowing is necessary, the board may authorize and effect such borrowing as provided for in subdivisions 1 and 2, and may issue certificates of indebtedness for the same. The board shall fix the amount, date, maturity, form, denomination, and other details of such certificates, not inconsistent herewith, and shall fix the date and place for receipt of bids for the purchase thereof and direct the clerk to give notice thereof.\nSuch certificates not in default shall not be deemed net debt under any law limiting indebtedness.\nThe proceeds of the current tax levies and future state aid receipts or other school funds which may become available shall be applied to the extent necessary to repay such certificates.\nThe full faith and credit of the school district shall be pledged to their payment.\nThey shall mature not later than the anticipated date of receipt in full of school taxes for the current year or of the aids so anticipated as estimated by the commissioner of education, but in no event shall tax anticipation certificates mature later than three months after the close of the calendar year or school aid anticipation certificates later than three months after the close of the school year in which they are issued, respectively.\nThe certificates shall be sold at not less than par.\nThe certificates shall bear interest after maturity until paid at the rate they bore before maturity, and any interest accruing before or after maturity shall be paid from school funds as is provided for in subdivisions 1 and 2.\nThe clerk of the board shall give notice of the proposed sale, calling for bids thereon at the time and place so specified, by at least one publication in a daily newspaper published in the school district, at least three days before such date of sale. At the time and place so fixed, such certificates may be sold by the officers of the board designated in the resolution to the bidder who will agree to purchase the same on terms deemed most favorable to the school district. Such certificates shall be signed in behalf of the school district by the chairman and clerk and countersigned by the treasurer and delivered by the treasurer upon receipt of the purchase price thereof.\nThe moneys so received shall be disbursed solely for the purposes for which such taxes are levied or aids are receivable. The purchaser of such certificates shall not be obligated to see to such application of the proceeds.",
	"repealed": false
}