{
	"id": "136A.672",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.672",
	"title": "136A.672 STUDENT COMPLAINTS.",
	"text": "The office has the authority to review and take appropriate action on student complaints from schools covered under the provisions of sections 136A.61 to 136A.71.\nA complaint must be in writing, be signed by a student, and state how the school's policies and procedures or sections 136A.61 to 136A.71 were violated. Student complaints shall be limited to complaints that occurred within six years from the date the concern should have been discovered with reasonable effort and after the student has utilized the school's internal complaint process. Students do not have to utilize a school's internal complaint process before the office has authority when the student is alleging fraud or misrepresentation. The office shall not investigate grade disputes, student conduct proceedings, disability accommodation requests, and discrimination claims, including Title IX complaints.\nThe office shall initiate an investigation upon receipt of a complaint within the authority of subdivision 2. A school involved in an investigation shall be informed of the alleged violations and the processes of the investigation. A school involved in an investigation shall respond to the alleged violations and provide requested documentation to the office. Upon completing an investigation, the office shall inform the school and the student of the investigation outcome.\nIf violations are found, the office may require remedial action by the school or assign a penalty under section 136A.705. Remedial action may include student notification of violations, adjustments to the school's policies and procedures, and tuition or fee refunds to impacted students.\nAny order requiring remedial action by the school or assigning a penalty under section 136A.705 is appealable in accordance with chapter 14. The request for an appeal must be made in writing to the office within 30 days of the date the school is notified of the action of the office. The court shall award costs and reasonable attorney fees in a contested chapter 14 hearing to the office if: (1) the office substantially prevails on the merits in an action brought under this section; and (2) the school has a net income from student tuition, fees, and other required institutional charges collected from the last fiscal year of $1,000,000 or greater.\nStudent complaint data are private data on individuals, as defined in section 13.02, subdivision 12. The office may disclose student complaint data as provided in section 136A.64, subdivision 5.",
	"repealed": false
}