{
	"id": "142G.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.01",
	"title": "142G.01 ESTABLISHING MINNESOTA FAMILY INVESTMENT PROGRAM.",
	"text": "This chapter and chapter 256K may be cited as the Minnesota family investment program (MFIP). MFIP is the statewide implementation of components of the Minnesota family investment plan (MFIP) authorized and formerly codified in section 256.031 and Minnesota family investment plan-Ramsey County (MFIP-R) formerly codified in section 256.047.\n[See Note.]\nThe Personal Responsibility and Work Opportunity Reconciliation Act of 1996, Public Law 104-193, eliminates the entitlement program of aid to families with dependent children (AFDC) and replaces it with block grants to states for temporary assistance for needy families (TANF). TANF provides cash assistance for a limited time to families with children and to pregnant women. Minnesota's TANF assistance will be provided through a statewide expansion of MFIP. The modifications specified in this chapter are necessary to comply with the new federal law and to improve MFIP. Eligible applicants and recipients of AFDC, family general assistance, and the Supplemental Nutrition Assistance Program (SNAP) benefits will be converted to the MFIP program. Any new application received for family cash assistance will be processed under the rules of this chapter.\nMFIP-S replaces eligibility for families with children and pregnant women under the general assistance program, governed by sections 256D.01 to 256D.21 and Minnesota Rules, parts 9500.1200 to 9500.1261.\nThe commissioner of children, youth, and families may negotiate and obtain changes in the federal waivers and terms and conditions contained in MFIP, MFIP-R, and MFIP-S. The commissioner may also terminate federal waivers by directing so in the applicable state plan.\nThe commissioner shall not move programs or activities funded with MFIP or TANF maintenance of effort funds to other funding sources without legislative approval.\nThe MFIP program must be administered in a way that, in addition to the county agency, other sectors in the community such as employers from the public and private sectors, not-for-profit organizations, educational and social service agencies, program participants, labor unions, and neighborhood associations are involved.\nThe county agency must cooperate with tribal governments in the implementation of MFIP to ensure that the program meets the special needs of persons living on Indian reservations. This cooperation must include, but is not limited to, the sharing of MFIP duties including initial screening, orientation, assessments, and provision of employment and training services. The county agency shall encourage tribal governments to assume duties related to MFIP and shall work cooperatively with tribes that have assumed responsibility for a portion of the MFIP program to expand tribal responsibilities, if that expansion is requested by the tribe.\nChildren who receive assistance under this chapter, in which the assistance unit does not include a caregiver, but only includes a minor child, shall become part of the program established under this chapter.",
	"repealed": false
}