{
	"id": "136F.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.06",
	"title": "136F.06 POWERS AND DUTIES.",
	"text": "The board shall possess all powers necessary to govern the state colleges and universities and all related property. Those powers shall include, but are not limited to, those enumerated in this section. The board shall prescribe conditions of admission, set tuition and fees, approve programs of study and requirements for completion of programs, approve the awarding of appropriate certificates, diplomas, and degrees, enter into contracts and other agreements, and adopt suitable policies for the institutions it governs. To the extent practicable in protecting statewide interests, the board shall provide autonomy to the campuses while holding them accountable for their decisions. Sections 14.01 to 14.47 do not apply to policies and procedures of the board.\nThe board shall have the authority needed to operate and govern the state colleges and universities unless otherwise directed or prohibited by law. The board is responsible for its operations and necessary decisions unless these are specifically delegated by law to a state department or agency.\nNotwithstanding chapter 16B, the board may select the location for its central office.\nThe board must identify colleges offering flexible academic programs that accommodate the needs of laid-off workers and assist its other institutions in determining whether to offer similar programs. Colleges must increase the number of certificate programs available to meet the needs of unemployed Minnesotans.\nNotwithstanding any law or policy to the contrary, the board shall streamline services provided through the system's central service office to reduce expenditures, better target the use of state resources, and provide services at the most appropriate and efficient level so as not to duplicate any services provided at the institutional level. These actions must be implemented so as to achieve budgetary savings and efficiencies in delivery of services and the accomplishment of the academic mission. The board must revise any board policies in a way that is consistent with the requirements of this section.",
	"repealed": false
}