{
	"id": "297E.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.02",
	"title": "297E.02 TAX IMPOSED.",
	"text": "A tax is imposed on all lawful gambling other than (1) paper or electronic pull-tab deals or games; (2) tipboard deals or games; (3) electronic linked bingo; and (4) items listed in section 297E.01, subdivision 8, clauses (4) and (5), at the rate of 8.5 percent on the gross receipts as defined in section 297E.01, subdivision 8, less prizes actually paid. The tax imposed by this subdivision is in lieu of the tax imposed by section 297A.62 and all local taxes and license fees except a fee authorized under section 349.16, subdivision 8, or a tax authorized under section 349.213, subdivision 3.\nThe tax imposed under this subdivision is payable by the organization or party conducting, directly or indirectly, the gambling.\nAn organization's receipts from lawful gambling that are excluded or exempt from licensing under section 349.166, are not subject to the tax imposed by this section or section 297A.62. This exclusion from tax is only valid if at the time of the event giving rise to the tax the organization either has an exclusion under section 349.166, subdivision 1, or has applied for and received a valid exemption from the lawful gambling control board.\nAn organization may claim a credit equal to the tax reported under subdivision 1 resulting from a raffle the net proceeds of which have been used exclusively for the purposes of section 349.12, subdivision 25, paragraph (a), clause (2). The organization claiming the credit must do so on the monthly gambling tax return on which the raffle activity is reported under subdivision 1.\n(a) Taxes imposed by this section are due and payable to the commissioner when the gambling tax return is required to be filed. Distributors must file their monthly sales figures with the commissioner on a form prescribed by the commissioner. Returns covering the taxes imposed under this section must be filed with the commissioner on or before the 20th day of the month following the close of the previous calendar month. The commissioner shall prescribe the content, format, and manner of returns or other documents pursuant to section 270C.30. The proceeds, along with the revenue received from all license fees and other fees under sections 349.11 to 349.191, 349.211, and 349.213, must be paid to the commissioner of management and budget for deposit in the general fund.\n(b) The sales tax imposed by chapter 297A on the sale of pull-tabs and tipboards by the distributor is imposed on the retail sales price. The retail sale of pull-tabs or tipboards by the organization is exempt from taxes imposed by chapter 297A and is exempt from all local taxes and license fees except a fee authorized under section 349.16, subdivision 8.\n(c) One-half of one percent of the revenue deposited in the general fund under paragraph (a), is appropriated to the commissioner of human services for the compulsive gambling treatment program established under section 245.98. One-half of one percent of the revenue deposited in the general fund under paragraph (a), is appropriated to the commissioner of human services for a grant to the state affiliate recognized by the National Council on Problem Gambling to increase public awareness of problem gambling, education and training for individuals and organizations providing effective treatment services to problem gamblers and their families, and research relating to problem gambling. Money appropriated by this paragraph must supplement and must not replace existing state funding for these programs.\n(d) The commissioner of human services must provide to the state affiliate recognized by the National Council on Problem Gambling a monthly statement of the amounts deposited under paragraph (c). Beginning January 1, 2022, the commissioner of human services must provide to the chairs and ranking minority members of the legislative committees with jurisdiction over treatment for problem gambling and to the state affiliate recognized by the National Council on Problem Gambling an annual reconciliation of the amounts deposited under paragraph (c). The annual reconciliation under this paragraph must include the amount allocated to the commissioner of human services for the compulsive gambling treatment program established under section 245.98, and the amount allocated to the state affiliate recognized by the National Council on Problem Gambling.\n[Repealed, 2012 c 299 art 4 s 66]\n[Renumbered 349.213, subd 3]\n(a) In addition to the taxes imposed under subdivision 1, a tax is imposed on the combined net receipts of the organization. As used in this section, \"combined net receipts\" is the sum of the organization's gross receipts from lawful gambling less gross receipts directly derived from the conduct of paper bingo, raffles, and paddlewheels, as defined in section 297E.01, subdivision 8, and less the net prizes actually paid, other than prizes actually paid for paper bingo, raffles, and paddlewheels, for the fiscal year. The combined net receipts of an organization are subject to a tax computed according to the following schedule:\n(b) Gross receipts derived from sports-themed tipboards are exempt from taxation under this section. For purposes of this paragraph, a sports-themed tipboard means a sports-themed tipboard as defined in section 349.12, subdivision 34, under which the winning numbers are determined by the numerical outcome of a professional sporting event.\nIf a licensed distributor cannot account for a pull-tab game, an electronic pull-tab game, a tipboard deal, a raffle board, paddletickets, an electronic linked bingo game, bingo paper sheets, or linked bingo paper sheets, the distributor must report the sheets, games, or boards to the commissioner as lost and remit a tax of six percent on the ideal gross of the sheets, games, or boards.\n(a) In addition to penalties or criminal sanctions imposed by this chapter, a person, organization, or business entity possessing or selling a pull-tab, electronic pull-tab game, raffle board, or tipboard upon which the tax imposed by this chapter has not been paid is liable for a tax of six percent of the ideal gross of each pull-tab, electronic pull-tab game, raffle board, or tipboard. The tax on a partial deal must be assessed as if it were a full deal.\n(b) In addition to penalties and criminal sanctions imposed by this chapter, a person (1) not licensed by the board who conducts bingo, linked bingo, electronic linked bingo, raffles, or paddlewheel games, or (2) who conducts gambling prohibited under sections 609.75 to 609.763, other than activities subject to tax under section 297E.03, is liable for a tax of six percent of the gross receipts from that activity.\n(c) The tax may be assessed by the commissioner. An assessment must be considered a jeopardy assessment or jeopardy collection as provided in section 270C.36. The commissioner shall assess the tax based on personal knowledge or information available to the commissioner. The commissioner shall mail to the taxpayer at the taxpayer's last known address, or serve in person, a written notice of the amount of tax, demand its immediate payment, and, if payment is not immediately made, collect the tax by any method described in chapter 270C, except that the commissioner need not await the expiration of the times specified in chapter 270C. The tax assessed by the commissioner is presumed to be valid and correctly determined and assessed. The burden is upon the taxpayer to show its incorrectness or invalidity. The tax imposed under this subdivision does not apply to gambling that is exempt from taxation under subdivision 2.\n(d) A person, organization, or business entity conducting gambling activity under this subdivision must file monthly tax returns with the commissioner, in the form required by the commissioner. The returns must be filed on or before the 20th day of the month following the month in which the gambling activity occurred. The tax imposed by this section is due and payable at the time when the returns are required to be filed.\n(e) Notwithstanding any law to the contrary, neither the commissioner nor a public employee may reveal facts contained in a tax return filed with the commissioner of revenue as required by this subdivision, nor can any information contained in the report or return be used against the tax obligor in any criminal proceeding, unless independently obtained, except in connection with a proceeding involving taxes due under this section, or as provided in section 270C.055, subdivision 1. However, this paragraph does not prohibit the commissioner from publishing statistics that do not disclose the identity of tax obligors or the contents of particular returns or reports. Any person violating this paragraph is guilty of a gross misdemeanor.\nThe tax imposed by this section, and interest and penalties imposed with respect to it, are a personal debt of the person required to file a return from the time the liability for it arises, irrespective of when the time for payment of the liability occurs. The debt must, in the case of the executor or administrator of the estate of a decedent and in the case of a fiduciary, be that of the person in the person's official or fiduciary capacity only unless the person has voluntarily distributed the assets held in that capacity without reserving sufficient assets to pay the tax, interest, and penalties, in which event the person is personally liable for any deficiency.\nAll records concerning the administration of the taxes under this chapter are classified as public information.\nA person who has, under this chapter, paid to the commissioner an amount of tax for a period in excess of the amount legally due for that period, may file with the commissioner a claim for a refund of the excess. The amount necessary to pay the refunds under this subdivision is appropriated from the general fund to the commissioner.\nIf a defective deal registered with the board or bar coded in accordance with this chapter and chapter 349 is returned to the manufacturer, the distributor shall submit to the commissioner of revenue certification from the manufacturer that the deal was returned and in what respect it was defective. The certification must be on a form prescribed by the commissioner and must contain additional information the commissioner requires.\nThe commissioner may require under this subdivision that all defective and returned pull-tabs, tipboards, paddle tickets, paper bingo sheets, and linked bingo paper sheets be set aside for inspection by the commissioner's employee.\nReductions in previously paid taxes authorized by this subdivision must be made when and in the manner prescribed by the commissioner.",
	"repealed": false
}