{
	"id": "138.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.37",
	"title": "138.37 OWNERSHIP, CUSTODY AND USE OF OBJECTS AND DATA.",
	"text": "The state reserves to itself the title to all objects found and data gathered in field archaeology, except as provided in subdivisions 2 and 3. Although a license may name a custodian other than the state archaeologist, title to the objects and data nevertheless is reserved to the state, and physical possession of them reverts to the state if the custodian named ceases to exist, or if the state archaeologist finds that the custodian is not properly caring for them or keeping them conveniently available for study by students of archaeology.\nThe director of the Minnesota Historical Society, with the approval of the state archaeologist, may agree for the state with an agency of another state, or with a school or scientific institution of another state, to permit qualified persons acting for the nonresident agency, school, or institution to be licensed to engage in field archaeology in this state. Under such an agreement, the director of the historical society and the state archaeologist shall, at the time the license is issued, determine the disposition of the objects found.\nIf the best interests of this state are deemed served thereby, the state archaeologist, with the approval of the director of the historical society, may barter one or more objects belonging to this state for one or more objects belonging to another state, a private person, or any school, scientific institution, or other body having title thereto; and the state archaeologist, with the approval of the director of the historical society, may dispose of one or more objects belonging to this state. The state archaeologist and director of the Minnesota Historical Society may accept on behalf of the state any gift of an object, of data, or of any deed to a privately owned site if they deem the gift valuable to the state under the provisions of sections 138.31 to 138.42; they may also accept any gift of money to be used for one or more of the purposes covered by sections 138.31 to 138.42, but shall be held strictly accountable to the state for the use made of any such gift of money.",
	"repealed": false
}