{
	"id": "60C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/60C.03",
	"title": "60C.03 DEFINITIONS.",
	"text": "For the purposes of this chapter, the following terms have the meanings given in this section.\n\"Account\" means any of the five accounts created under section 60C.04.\n\"Association\" means the Minnesota Insurance Guaranty Association created under section 60C.04.\n\"Net direct written premiums\" means direct gross premiums written in this state on surety bonds and insurance policies not excepted from the scope of this chapter by section 60C.02, less return premiums thereon and dividends paid or credited to policyholders on such direct business.\n\"Person\" means any individual, corporation, partnership, association, or voluntary organization, and includes governmental entities.\n\"Member insurer\" means any person, including reciprocals or interinsurance exchanges operating under chapter 71A and township mutual fire insurance companies operating under sections 67A.01 to 67A.26, who (1) writes any kind of insurance not excepted from the scope of this chapter by section 60C.02, and (2) is licensed to transact insurance business in this state, except any nonprofit service plan incorporated or operating under sections 62C.01 to 62C.23 and any health plan incorporated under chapter 317A, and includes an insurer whose license or certificate of authority in this state may have been suspended, revoked, not renewed, or voluntarily withdrawn.\nAn insurer ceases to be a member insurer the day following the termination or expiration of its license to transact the kinds of insurance to which this chapter applies. The insurer remains liable as a member insurer for any and all obligations, including obligations for assessments levied before the termination or expiration with respect to an insurer that became an insolvent insurer before the termination or expiration of the insurer's license.\n\"Resident\" means:\n(a) an individual person who fixes habitation in this state without any intention of removing therefrom and who, whenever absent therefrom, intends to return; or\n(b) any other person whose principal place of business is located in this state at the time of the insured event.\n\"Insolvent insurer\" means an insurer licensed to transact insurance in this state, either at the time the policy was issued, or when the insured event occurred, and against whom a final order of liquidation has been entered after April 30, 1979, with a finding of insolvency by a court of competent jurisdiction in the insurer's state of domicile. An insurer placed under administrative supervision under sections 60G.01 to 60G.09 or determined to be in hazardous financial condition under sections 60G.20 to 60G.22 is not an insolvent insurer as a result of that placement or determination.\n\"Affiliate\" means a person other than a natural person who directly, or indirectly, through one or more intermediaries, controls, is controlled by, or is under common control with another person.\n\"Financial guaranty insurance\" includes any insurance under which loss is payable upon proof of occurrence of any of the following events to the damage of an insured claimant or obligee:\n(1) failure of any obligor or obligors on any debt instrument or other monetary obligation, including common or preferred stock, to pay when due the principal, interest, dividend or purchase price of such instrument or obligation, whether such failure is the result of a financial default or insolvency and whether or not such obligation is incurred directly or as guarantor by, or on behalf of, another obligor which has also defaulted;\n(2) changes in the level of interest rates whether short term or long term, or in the difference between interest rates existing in various markets;\n(3) changes in the rate of exchange or currency, or from the inconvertibility of one currency into another for any reason; and\n(4) changes in the value of specific assets or commodities, or price levels in general.\n\"Ocean marine insurance\" means a form of insurance, regardless of the name, label, or marketing designation of the insurance policy, that insures against maritime perils or risks and other related perils or risks, that are usually insured against by traditional marine insurance, such as hull and machinery, marine builders risk, and marine protection and indemnity. Perils and risks insured against include without limitation loss, damage, expense, or legal liability of the insured for loss, damage, or expense arising out of or incident to ownership, operation, chartering, maintenance, use, repair, or construction of a vessel, craft, or instrumentality in use in ocean or inland waterways for commercial purposes, including liability of the insured for personal injury, illness, or death or for loss or damage to the property of the insured or another person.",
	"repealed": false
}