{
	"id": "124D.8955",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.8955",
	"title": "124D.8955 PARENT AND FAMILY INVOLVEMENT POLICY.",
	"text": "(a) In order to promote and support student achievement, a local school board is encouraged to formally adopt and implement a parent and family involvement policy that promotes and supports:\n(1) oral and written communication between home and school that is regular, two-way, meaningful, and in families' native language;\n(2) parenting skills;\n(3) parents and caregivers who play an integral role in assisting student learning and learn about fostering students' academic success and learning at home and school;\n(4) welcoming parents in the school and using networks that support families' cultural connections, seeking their support and assistance;\n(5) partnerships with parents in the decisions that affect children and families in the schools; and\n(6) providing community resources to strengthen schools, families, and student learning, including establishing a safe and supportive school climate by developing and implementing prevention and intervention programs on prohibited conduct under section 121A.031.\n(b) A school board that implements a parent and family involvement policy under paragraph (a) must convene an advisory committee composed of an equal number of resident parents who are not district employees and school staff to make recommendations to the board on developing and evaluating the board's parent and family involvement policy. If possible, the advisory committee must represent the diversity of the district. The advisory committee must consider the district's demographic diversity and barriers to parent involvement when developing its recommendations. The advisory committee must recommend to the school board and district or school how programs serving children and adolescents can collaborate on:\n(1) understanding child and adolescent development;\n(2) encouraging healthy communication between parents and children;\n(3) managing students' behavior through positive reinforcement;\n(4) establishing expectations for student behavior;\n(5) providing media and Internet limits and supervision; and\n(6) promoting resilience and reducing risks for children.\nThe advisory committee must present its recommendations to the board for board consideration.\n(c) The board must consider research-based best practices when implementing this policy.\n(d) The board periodically must review this policy to determine whether it is aligned with the most current research findings on parent involvement policies and practices and how effective the policy is in supporting increased student achievement.\n(e) Nothing in this section obligates a school district to exceed any parent or family involvement requirement under federal law.",
	"repealed": false
}