{
	"id": "473.621",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.621",
	"title": "473.621 POWERS OF CORPORATION.",
	"text": "MS 1976 [Repealed, 1977 c 417 s 14]\nThe commission shall be held accountable to the legislature in its activities, plans, policies, and programs. It shall report each session to appropriate committees of the legislature as to its activities, plans, policies, and programs and shall make other reports and recommendations which the legislature or its committees deem appropriate.\nThe corporation shall report to the legislature by March 30 of each year concerning operations at Minneapolis-St. Paul International Airport and each reliever airport. Regarding Minneapolis-St. Paul International Airport, the report must include the number of aircraft operations and passenger enplanements at the airport in the preceding year, current airport capacity in terms of operations and passenger enplanements, average length of delay statistics, and technological developments affecting aviation and their effect on operations and capacity at the airport. The report must include the aircraft operations, based aircraft, and status of major development programs at each reliever airport.\nThe corporation shall have the use, management, operation, regulation, policing, and control of any or all airports owned by either the city of Minneapolis or St. Paul, whether the airport or title thereto is held in the name of the city, the council, a board of park commissioners, or any other body. Consent by each city, the council, the board of park commissioners, and any other agency, board, or department thereof to the use, management, operation, regulation, policing, and control is conclusively presumed to have been given by the appointment of commissioners pursuant to the provisions of Laws 1943, chapter 500. Authority is granted to the mayor and council of each city and any board or commission having jurisdiction of airports in either city to give consent in that manner. The corporation may exercise all the powers granted to it with reference to any airport property over which it has jurisdiction pursuant to this subdivision, except the right of leasing or disposing of the fee title to the lands included therein, without the payment of any rental. The title to the fee of the land shall remain in the city, or agency, board, or department of the city. The action to be taken pursuant to this subdivision is declared to be necessary in order to provide an integrated airports system and enable the corporation to carry out the public and governmental purposes of Laws 1943, chapter 500. The corporation shall not close any existing airport in either city to air freight commerce consigned to or originating in the city unless and until it provides for the city freight airport facilities which are, in the judgment of the corporation and except as they may be restricted by government use, substantially equal to the existing freight airport facilities in safety and convenience to businesses and industries of the city. For the purpose of this subdivision, \"airport\" shall include only the lands, buildings, and equipment acquired for use primarily for any airport over which the corporation has jurisdiction pursuant to this subdivision.\nThe authority in subdivision 2, granted to the corporation is not conditioned upon the receipt of any appropriation provided for in Laws 1943, chapter 500. Each city involved, or any board or commission of such city, shall pay the balance due on its bonds which have prior to the enactment of Laws 1943, chapter 500, been issued pursuant to law or charter to secure funds for the acquisition, establishment, construction, enlargement or improvement of the airports to be taken over as provided in subdivision 2, according to the terms of such bonds. The corporation created by Laws 1943, chapter 500, may, if it shall so determine, assume the payment of part or all of the balance due on such bonds at the time of its taking over the use, management, operation, regulation, policing and control of such airports.\nThe corporation may provide, in addition to airports existing at the time of the passage of Laws 1943, chapter 500, at least one major or primary metropolitan airport which shall be as nearly equidistant from the city halls of both cities as possible. All other new airports to be constructed shall be so located that the airport system of the corporation as a whole shall be of substantially equal convenience to both cities. It shall put all airports and other facilities to their maximum use for passenger, mail, express, freight, and other air transportation operations as the needs therefor develop, and shall encourage the establishment of related aircraft industries.\nThe investment of the cities of Minneapolis and St. Paul in the metropolitan airports system, from the date of the original enactment of this section to January 1, 1973, includes the land comprising airports owned by them and taken over pursuant to subdivision 2, and taxes levied on property within the cities in the years 1944 to 1969, the proceeds of which, together with revenues of the system and federal funds, were expended for the operation, administration, maintenance, improvement, and extension of the system and the service of debt incurred for such improvement and extension, including improvement of the city lands. The aggregate amount of such taxes was $19,816,873, of which $7,294,022 would have been assessed and extended against property outside the cities if the entire metropolitan area, which will be taxable by the corporation in 1974 and subsequent years under section 473.661, had been within its taxing jurisdiction when those levies were made. If it should become necessary for the corporation to levy any such taxes for any purpose other than the payment of bonds and interest, they shall be extended and assessed exclusively against taxable property outside the cities until the total amount so assessed and extended equals $7,294,022. In the event that the airport land owned by either city should no longer be used for airport purposes, the corporation's control thereof shall cease, and title to the land and all improvements shall be and remain in the city, but the city shall become liable to the corporation for the repayment, without interest, of an amount of the taxes so paid which is proportionate to its own share of the cities' original investment, being 60 percent for Minneapolis and 40 percent for St. Paul. In the event that any other land or improvements owned or controlled by the corporation should ever cease to be used for airport purposes, all income therefrom and all proceeds received upon disposal thereof shall continue to be used for purposes of the metropolitan airports system, subject to federal laws and regulations governing such disposal; or if the operation of the system should ever be terminated, all such income and proceeds shall be distributed to the seven counties in the metropolitan area, in amounts proportionate to the net tax capacity of taxable property in each county at the time of such distribution.\nAll Minneapolis-St. Paul International Airport capital projects of the commission requiring the expenditure of more than $5,000,000 shall be submitted to the Metropolitan Council for review. All other capital projects of the commission requiring the expenditure of more than $2,000,000 shall be submitted to the Metropolitan Council for review. No such project that has a significant effect on the orderly and economic development of the metropolitan area may be commenced without the approval of the Metropolitan Council. In addition to any other criteria applied by the Metropolitan Council in reviewing a proposed project, the council shall not approve a proposed project unless the council finds that the commission has completed a process intended to provide affected municipalities the opportunity for discussion and public participation in the commission's decision-making process. An \"affected municipality\" is any municipality that (1) is adjacent to a commission airport, (2) is within the noise zone of a commission airport, as defined in the Metropolitan Development Guide, or (3) has notified the commission's secretary that it considers itself an \"affected municipality.\" The council must at a minimum determine that the commission:\n(a) provided adequate and timely notice of the proposed project to each affected municipality;\n(b) provided to each affected municipality a complete description of the proposed project;\n(c) provided to each affected municipality notices, agendas, and meeting minutes of all commission meetings, including advisory committee meetings, at which the proposed project was to be discussed or voted on in order to provide the municipalities the opportunity to solicit public comment and participate in the project development on an ongoing basis; and\n(d) considered the comments of each affected municipality.\nFor purposes of this section, capital projects having a significant effect on the orderly and economic development of the metropolitan area shall be deemed to be the following:\n(a) the location of a new airport,\n(b) a new runway at an existing airport,\n(c) a runway extension at an existing airport,\n(d) runway strengthening other than routine maintenance to determine compliance with Federal Air Regulation, part 36,\n(e) construction or expansion of passenger handling or parking facilities which would permit a 25 percent or greater increase in passenger enplanement levels,\n(f) land acquisition associated with any of the above items or which would cause relocation of residential or business activities.",
	"repealed": false
}