{
	"id": "116D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/116D.11",
	"title": "116D.11 REPORT PREPARATION.",
	"text": "Each department or agency of the state, as designated by the governor, shall assist in the preparation of the strategy report. Each designated department or agency shall prepare a preliminary strategy report relating to those programs or policies over which the department or agency has jurisdiction. Each preliminary strategy report shall:\n(1) describe concisely the existing policies and programs of the department or agency as they relate to the issues listed in section 116D.10, clause (1);\n(2) describe concisely and evaluate the long-term objectives of the department or agency as they relate to the issues listed in section 116D.10, clause (1);\n(3) identify and make proposals about the development of department or agency financial management budgets as they relate to the issues listed in section 116D.10, clause (1);\n(4) describe concisely the strategy and procedure of the department or agency to recruit, select, and train personnel to carry out department or agency goals and functions as they relate to the issues listed in section 116D.10, clause (1);\n(5) identify and make proposals to eliminate duplicative and unnecessary programs or systems, including encouraging departments and agencies to share systems or programs that have sufficient capacity to perform the functions needed as they relate to the issues listed in section 116D.10, clause (1); and\n(6) establish two-year quantitative goals for policy implementation.\nThe Environmental Quality Board shall have the primary responsibility for preparing the energy and environmental strategy report of the state, as required by section 116D.10. The board shall assemble all preliminary reports prepared pursuant to subdivision 1 under a timetable established by the board and shall use the preliminary reports in the preparation of the draft energy and environmental strategy report of the state. Each department or agency designated by the governor to prepare a preliminary strategy report shall submit a copy of the preliminary strategy report to the governor and to the board at the same time.\nOn or before October 1 of each odd-numbered year, the Environmental Quality Board shall transmit to the governor a draft of the written report on the energy and environmental strategy of the state. The governor may change the report and may request additional information or data from any department or agency of the state responsible for issues listed in section 116D.10, clause (1). Any such requested additional information or data shall be prepared and submitted promptly to the governor.\n[Repealed, 1997 c 7 art 2 s 67]",
	"repealed": false
}