{
	"id": "142A.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.44",
	"title": "142A.44 GREAT START SCHOLARSHIPS PROGRAM.",
	"text": "The commissioner of children, youth, and families, in collaboration with the commissioner of education and the commissioner of human services, shall develop and, to the extent funds are available and notwithstanding federal and state laws to the contrary, implement a plan for the great start scholarships program to ensure affordable access to high-quality early care and learning for children from birth to kindergarten entry.\nIn developing the plan and implementing the program under this section, the commissioner shall:\n(1) identify ways to integrate the functions, administrative structures, and funding mechanisms of early care and learning programs administered by the state with the great start scholarships program;\n(2) consider the recommendations made by the Great Start for All Minnesota Children Task Force under Laws 2021, First Special Session chapter 7, article 14, section 18, subdivision 2;\n(3) create a process and timeline to transition the following families to the great start scholarships program by July 1, 2028:\n(i) families with at least one child receiving an early learning scholarship under section 142D.25; and\n(ii) families with at least one child who is not yet in kindergarten and is receiving child care assistance under section 142E.04 or 142E.08 for care received from a provider licensed under Minnesota Rules, chapter 9502 or 9503, or Tribally licensed, or a Head Start program that has a rating under section 142D.13;\n(4) create mechanisms for members of local communities, including families and members of the early care and learning workforce, to have input in decisions regarding needs and preferences for early care and learning options;\n(5) develop a proposed method for funding early care and learning slots in response to local need through contracts with eligible providers that may be used to deliver services that meet quality and compensation standards with the intent to build early care and learning capacity statewide for children from birth to kindergarten entry; and\n(6) consider how to maximize available federal resources while maintaining access to child care assistance funding under sections 142E.04 or 142E.08 for school-age children. The commissioner, in consultation with an appropriate state agency, may seek federal technical assistance or outside consultation as necessary to provide minimally burdensome program access to all participating families.\nThe great start scholarships program must include at a minimum:\n(1) a method to provide financial assistance to families voluntarily participating in the program;\n(2) family eligibility for any qualifying family that has at least one child who is not yet in kindergarten;\n(3) provider eligibility for:\n(i) any program licensed under Minnesota Rules, chapter 9502 or 9503, or Tribally licensed, that participates in the quality rating and improvement system under section 142D.13; and\n(ii) any school-based program and Head Start program that has a rating under section 142D.13;\n(4) a unified, integrated, and simple online application process that utilizes administrative data to ease qualification and benefit determination and meet federal reporting requirements;\n(5) an electronic attendance tracking system that is integrated, to the extent practicable, and payments system to safeguard program integrity and streamline billing and payment processes for providers; and\n(6) a schedule for family contributions and provider payments that ensures that no participating family pays more than seven percent of annual income for early care and learning services for children from birth to kindergarten entry. Family contributions and provider payments may vary by family income, program quality, geography, and need for compensatory services, and may take into consideration the results of the market rate survey under section 142E.02, subdivision 7; information from cost estimation models for providing early care and learning in the state; and cost information gathered through contracts under subdivision 2, clause (5).\n(a) By July 1, 2028, to the extent funding is appropriated and notwithstanding federal and state laws to the contrary, the commissioner shall have in place the administrative structures and systems needed for the great start scholarships program to meet the operational needs of participating families and eligible providers.\n(b) By July 1, 2026, the commissioner, in consultation with the commissioners of education and human services, must submit a report to the legislative committees with jurisdiction over early care and learning on the status of planning for the program under this section. The report must:\n(1) include information on progress made and work underway to develop the program;\n(2) provide details about the administrative structures, systems, and funding needed to meet the needs of families and providers who may participate in the program; and\n(3) identify any statutory or regulatory changes necessary for implementation of the program.",
	"repealed": false
}