{
	"id": "524.5-502",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-502",
	"title": "524.5-502 COMPENSATION AND EXPENSES.",
	"text": "(a) The court may authorize a proceeding under this article to proceed in forma pauperis, as provided in chapter 563.\n(b) In proceedings under this article, a lawyer or health professional rendering necessary services with regard to the appointment of a guardian or conservator, the administration of the estate or personal affairs of the person subject to conservatorship, or the restoration of that person's capacity or termination of the protective proceeding shall be entitled to compensation from the estate of the person subject to guardianship or conservatorship or from the county having jurisdiction over the proceedings if the person subject to guardianship or conservatorship is indigent. When the court determines that other necessary services have been provided for the benefit of the person subject to guardianship or conservatorship by a lawyer or health professional, the court may order fees to be paid from the estate of the person subject to guardianship or conservatorship or from the county having jurisdiction over the proceedings if the person subject to guardianship or conservatorship is indigent. If, however, the court determines that a petitioner, guardian, or conservator has not acted in good faith, the court shall order some or all of the fees or costs incurred in the proceedings to be borne by the petitioner, guardian, or conservator not acting in good faith. In determining compensation for a guardian or conservator of an indigent person, the court shall consider a fee schedule recommended by the Board of County Commissioners. The fee schedule may also include a maximum compensation based on the living arrangements of the person subject to guardianship or conservatorship. If these services are provided by a public or private agency, the county may contract on a fee-for-service basis with that agency.\n(c) When the court determines that a guardian or conservator has rendered necessary services or has incurred necessary expenses for the benefit of the person subject to guardianship or conservatorship, the court may order reimbursement or compensation to be paid from the estate of the person subject to guardianship or conservatorship or from the county having jurisdiction over the guardianship or protective proceeding if the person subject to guardianship or conservatorship is indigent. The court may not deny an award of fees solely because the person subject to guardianship or conservatorship is a recipient of medical assistance. In determining compensation for a guardian or conservator of an indigent person, the court shall consider a fee schedule recommended by the Board of County Commissioners. The fee schedule may also include a maximum compensation based on the living arrangements of the person subject to guardianship or conservatorship. If these services are provided by a public or private agency, the county may contract on a fee-for-service basis with that agency.\n(d) The court shall order reimbursement or compensation if the guardian or conservator requests payment and the guardian or conservator was nominated by the court or by the county adult protection unit because no suitable relative or other person was available to provide guardianship or protective proceeding services necessary to prevent maltreatment of a vulnerable adult, as defined in section 626.5572, subdivision 15. In determining compensation for a guardian or conservator of an indigent person, the court shall consider a fee schedule recommended by the Board of County Commissioners. The fee schedule may also include a maximum compensation based on the living arrangements of the person subject to guardianship or conservatorship. If these services are provided by a public or private agency, the county may contract on a fee-for-service basis with that agency.\n(e) When a county employee serves as a guardian or conservator as part of employment duties, the court shall order compensation if the guardian or conservator performs necessary services that are not compensated by the county. The court may order reimbursement to the county from the estate of the person subject to conservatorship for compensation paid by the county for services rendered by a guardian or conservator who is a county employee but only if the county shows that after a diligent effort it was unable to arrange for an independent guardian or conservator.",
	"repealed": false
}