{
	"id": "358.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.115",
	"title": "358.115 UNSWORN FOREIGN DECLARATIONS.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Boundaries of the United States\" means the geographic boundaries of the United States, Puerto Rico, the United States Virgin Islands, and any territory or insular possession subject to the jurisdiction of the United States.\n(c) \"Law\" includes the federal or a state constitution, a federal or state statute, a judicial decision or order, a rule of court, an executive order, and an administrative rule, regulation, or order.\n(d) \"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n(e) \"Sign\" means, with present intent to authenticate or adopt a record:\n(1) to execute or adopt a tangible symbol; or\n(2) to attach to or logically associate with the record an electronic symbol, sound, or process.\n(f) \"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.\n(g) \"Sworn declaration\" means a declaration in a signed record given under oath. The term includes a sworn statement, verification, certificate, and affidavit.\n(h) \"Unsworn declaration\" means a declaration in a signed record that is not given under oath, but is given under penalty of perjury.\nThis section applies to an unsworn declaration by a declarant who at the time of making the declaration is physically located outside the boundaries of the United States whether or not the location is subject to the jurisdiction of the United States. This section does not apply to a declaration by a declarant who is physically located on property that is within the boundaries of the United States and subject to the jurisdiction of another country or federally recognized Indian tribe.\n(a) Except as otherwise provided in paragraph (b), if a state law requires or permits use of a sworn declaration, an unsworn declaration meeting the requirements of this section has the same effect as a sworn declaration.\n(b) This section does not apply to:\n(1) a deposition;\n(2) an oath of office;\n(3) an oath required to be given before a specified official other than a notary public;\n(4) a document intended for recording in the real estate records in the office of the county recorder or registrar of titles;\n(5) an oath under section 524.2-504; or\n(6) a power of attorney.\nIf a state law requires that a sworn declaration be presented in a particular medium, an unsworn declaration must be presented in that medium.\nAn unsworn declaration under this section must be in substantially the following form:\nI declare under penalty of perjury under the law of Minnesota that the foregoing is true and correct, and that I am physically located outside the geographic boundaries of the United States, Puerto Rico, the United States Virgin Islands, and any territory or insular possession subject to the jurisdiction of the United States.\nThis section modifies, limits, and supersedes the federal Electronic Signatures in Global and National Commerce Act, United States Code, title 15, section 7001, et seq., but does not modify, limit, or supersede section 101(c) of that act, United States Code, title 15, section 7001(c), or authorize electronic delivery of any of the notices described in section 103(b) of that act, United States Code, title 15, section 7003(b).\nThis section may be cited as the \"Uniform Unsworn Foreign Declarations Act.\"",
	"repealed": false
}