{
	"id": "60A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.13",
	"title": "60A.13 ANNUAL STATEMENT, INQUIRIES, RENEWAL LICENSES.",
	"text": "Every insurance company, including fraternal benefit societies, and reciprocal exchanges, doing business in this state, shall file with the commissioner, annually, on or before March 1, the appropriate verified National Association of Insurance Commissioners' annual statement blank, prepared in accordance with the association's instructions handbook and following those accounting procedures and practices prescribed by the association's accounting practices and procedures manual, unless the commissioner requires or finds another method of valuation reasonable under the circumstances. Another method of valuation permitted by the commissioner must be at least as conservative as those prescribed in the association's manual. All companies required to file an annual statement under this subdivision may also be required to file with the commissioner and the National Association of Insurance Commissioners a copy of their annual statement in an electronic form prescribed by the commissioner. All Minnesota domestic insurers required to file annual statements under this subdivision must also file quarterly statements with the commissioner for the first, second, and third calendar quarter on or before 45 days after the end of the applicable quarter, prepared in accordance with the association's instruction handbook. All companies required to file quarterly statements under this subdivision may also be required to file the quarterly statements with the commissioner and the National Association of Insurance Commissioners in an electronic form prescribed by the commissioner. In addition, the commissioner may require the filing of any other information determined to be reasonably necessary for the continual enforcement of these laws. The statement may be limited to the insurer's business and condition in the United States unless the commissioner finds that the business conducted outside the United States may detrimentally affect the interests of policyholders in this state. The statements shall also contain a verified schedule showing all details required by law for assessment and taxation. The statement or schedules shall be in the form and shall contain all matters the commissioner may prescribe, and it may be varied as to different types of insurers so as to elicit a true exhibit of the condition of each insurer.\n[Repealed, 1993 c 375 art 2 s 36]\nThe commissioner may also address to any insurer, including fraternal benefit societies, township mutuals and interinsurance exchanges, or its officers, any inquiry in relation to its transactions or conditions, or any matter connected therewith. Every insurer, or person so addressed, shall reply in writing to such inquiry promptly and truthfully, and such reply shall be verified, if required by the commissioner, by such individual or by such officer or officers of an insurer as the commissioner shall designate.\n[Repealed, 1978 c 793 s 98]\n[Repealed, 1993 c 299 s 33]\n[Repealed, 1978 c 793 s 98]\n[Repealed, 2007 c 13 art 2 s 3]\nThe license issued by the commissioner is perpetual and is considered renewed annually on June 1 upon payment of the renewal license fee, the annual filing fee, and all other fees required by section 60A.14.\nNo company shall transact any new business in this state after May 31 in any year unless it shall have previously transmitted its annual statement to the commissioner and filed a copy of its statement with the National Association of Insurance Commissioners. The commissioner may by order annually require that each insurer pay the required fee to the National Association of Insurance Commissioners for the filing of annual statements, but the fee shall not be more than 50 percent greater than the fee set by the National Association of Insurance Commissioners. Failure to file the annual statement with the commissioner or the National Association of Insurance Commissioners is a violation of section 72A.061, subdivision 1. The fee shall be based on the relative premium volume of each insurer.\nTo file statement. No fraternal benefit society, nor any social corporation paying only sick benefits not exceeding $250 in any one year, or funeral benefits, or aiding those dependent on a member not more than $350, nor any subordinate lodge or council which is, or whose members are, assessed for benefits which are payable by a grand body, shall be required to make such statements.\n[Repealed, 1996 c 446 art 2 s 11]",
	"repealed": false
}