{
	"id": "169.974",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.974",
	"title": "169.974 OPERATION OF MOTORCYCLE; MOTOR SCOOTER; MOTOR BIKE.",
	"text": "Motorcycles as used herein shall mean the vehicles defined in section 169.011, subdivision 44.\n(a) A person must not operate a motorcycle on any street or highway without having a valid driver's license with a motorcycle endorsement as provided by law. A person may operate an autocycle without a motorcycle endorsement if the person has a valid driver's license issued under section 171.02.\n(b) The commissioner of public safety must issue a motorcycle endorsement only if the applicant (1) has in possession a valid motorcycle instruction permit as provided in paragraph (c), (2) has passed a written examination and road test administered by the Department of Public Safety for the endorsement, and (3) in the case of applicants under 18 years of age, presents a certificate or other evidence of having successfully completed an approved motorcycle driver's safety course in this or another state, in accordance with rules adopted by the commissioner of public safety for courses offered by a public, private, or commercial school or institute. The commissioner of public safety may waive the road test for any applicant on determining that the applicant possesses a valid license to operate a motorcycle issued by a jurisdiction that requires a comparable road test for license issuance.\n(c) The commissioner of public safety must issue a motorcycle instruction permit to any person over 16 years of age who (1) is in possession of a valid driver's license, (2) is enrolled in an approved motorcycle driver's safety course, and (3) has passed a written examination for the permit and paid a fee prescribed by the commissioner of public safety. A motorcycle instruction permit is effective for one year and may be renewed under rules prescribed by the commissioner of public safety.\n(d) A person who is operating by virtue of a motorcycle instruction permit must not:\n(1) carry any passengers on the streets and highways of this state on the motorcycle while the person is operating the motorcycle;\n(2) drive the motorcycle at night; or\n(3) drive the motorcycle without wearing protective headgear that complies with standards established by the commissioner of public safety.\n(e) Notwithstanding paragraphs (a) to (d), the commissioner of public safety may issue a special motorcycle permit, restricted or qualified as the commissioner of public safety deems proper, to any person demonstrating a need for the permit and unable to qualify for a driver's license.\n(a) Any motorcycle with a seat designed or suited for use by a passenger must be equipped with footrests or floorboards for the passenger.\n(b) No person shall operate any motorcycle on the streets and highways unless such motorcycle is equipped with:\n(1) at least one rear view mirror so attached and adjusted as to reflect to the operator a view of the roadway for a distance of at least 200 feet to the rear of the motorcycle; and\n(2) not less than one horn that is audible at a distance of at least 200 feet under normal conditions.\n(c) All other applicable provisions of this chapter pertaining to motorcycle and other motor vehicle equipment shall apply to motorcycles, except those which by their nature have no application.\n(a) No person under the age of 18 shall operate or ride a motorcycle on the streets and highways of this state without wearing protective headgear that complies with standards established by the commissioner of public safety; and no person shall operate a motorcycle without wearing an eye-protective device.\n(b) The provisions of this subdivision do not apply to (1) persons during their participation in a parade for which parade a permit or other official authorization has been granted by a local governing body or other governmental authority, or (2) persons riding within an enclosed cab autocycle.\n(a) An operator of a motorcycle must ride only upon a permanent and regular seat which is attached to the vehicle for that purpose. No other person may ride on a motorcycle, except that passengers may ride (1) upon a permanent and regular operator's seat if designed for two persons, (2) upon additional seats attached to or in the vehicle, or (3) in a sidecar attached to the vehicle. The operator of a motorcycle is prohibited from carrying passengers in a number in excess of the designed capacity of the motorcycle or sidecar attached to it. A passenger is prohibited from being carried in a position that interferes with the safe operation of the motorcycle or the view of the operator.\n(b) No person may ride upon a motorcycle as a passenger unless the person can reach the footrests or floorboards with both feet.\n(c) Except for passengers of sidecars, drivers and passengers of three-wheeled motorcycles, and persons in an autocycle, no person may operate or ride upon a motorcycle except while sitting astride the seat, facing forward, with one leg on either side of the motorcycle.\n(d) No person may operate a motorcycle while carrying animals, packages, bundles, or other cargo that prevent the person from keeping both hands on the handlebars.\n(e) Motorcycles may, with the consent of both drivers, be operated not more than two abreast in a single traffic lane if the vehicles fit safely within the designated space of the lane.\n(f) Except under the conditions specified in paragraph (g), no person may operate a motorcycle:\n(1) between lanes of moving or stationary vehicles headed in the same direction of travel;\n(2) abreast of moving or stationary vehicles within the same traffic lane; or\n(3) to overtake or pass another vehicle within the same traffic lane.\n(g) A person may operate a motorcycle and overtake and pass another vehicle in the same direction of travel and within the same traffic lane if the motorcycle is operated:\n(1) at not more than 25 miles per hour; and\n(2) no more than 15 miles per hour over the speed of traffic in the relevant traffic lanes.\n(h) Motor vehicles including motorcycles are entitled to the full use of a traffic lane and no motor vehicle may be driven or operated in a manner so as to deprive a motorcycle of the full use of a traffic lane.\n(i) A person operating a motorcycle upon a roadway must be granted the rights and is subject to the duties applicable to a motor vehicle as provided by law, except as to those provisions which by their nature can have no application.\n(j) Paragraphs (e) and (f) of this subdivision do not apply to police officers in the performance of their official duties.\n(k) No person may operate a motorcycle on a street or highway unless the headlight or headlights are lighted at all times the motorcycle is so operated.\n(l) A person parking a motorcycle on the roadway of a street or highway must:\n(1) if parking in a marked parking space, park the motorcycle completely within the marked space; and\n(2) park the motorcycle in such a way that the front of the motorcycle is pointed or angled toward the nearest lane of traffic to the extent practicable and necessary to allow the operator to (i) view any traffic in both directions of the street or highway without having to move the motorcycle into a lane of traffic and without losing balance or control of the motorcycle, and (ii) ride the motorcycle forward and directly into a lane of traffic when the lane is sufficiently clear of traffic.\n[See Note.]\n[Repealed, 1999 c 230 s 46]\nAfter December 31, 1978, noise rules adopted by the Pollution Control Agency for motor vehicles pursuant to section 169.693 shall also apply to motorcycles.",
	"repealed": false
}