{
	"id": "244.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.11",
	"title": "244.11 APPELLATE REVIEW OF SENTENCE.",
	"text": "An appeal to the court of appeals may be taken by the defendant or the state from any sentence imposed or stayed by the district court according to the Rules of Criminal Procedure for the district court of Minnesota. Except as otherwise provided in subdivision 3, a dismissal or a resolution of an appeal brought under this section shall not prejudice an appeal brought under any other section or rule.\n(a) When an appeal taken under this section is filed, the court administrator of the district court shall certify the transcript of the proceedings and any files or records relating to the defendant, the offense, and the sentence imposed or stayed, that the supreme court by rule or order may require.\n(b) On an appeal pursuant to this section, the court may review the sentence imposed or stayed to determine whether the sentence is inconsistent with statutory requirements, unreasonable, inappropriate, excessive, unjustifiably disparate, or not warranted by the findings of fact issued by the district court. This review shall be in addition to all other powers of review presently existing. The court may dismiss or affirm the appeal, vacate or set aside the sentence imposed or stayed and direct entry of an appropriate sentence or order further proceedings to be had as the court may direct.\n(a) As used in this subdivision, \"appeal\" means:\n(1) an appeal of a sentence under rule 28 of the Rules of Criminal Procedure; and\n(2) an appeal from a denial of a sentence modification motion brought under rule 27.03, subdivision 9, of the Rules of Criminal Procedure.\n(b) If a defendant agrees to a plea agreement and is given a stayed sentence, which is a dispositional departure from the presumptive sentence under the Minnesota Sentencing Guidelines, the defendant may appeal the sentence only if the appeal is taken:\n(1) within 90 days of the date sentence was pronounced; or\n(2) before the date of any act committed by the defendant resulting in revocation of the stay of sentence;\nwhichever occurs first.\n(c) A defendant who is subject to paragraph (b) who has failed to appeal as provided in that paragraph may not file a petition for postconviction relief under chapter 590 regarding the sentence.\n(d) Nothing in this subdivision shall be construed to:\n(1) alter the time period provided for the state to appeal a sentence under rule 28 of the Rules of Criminal Procedure; or\n(2) affect the court's authority to correct errors under rule 27.03, subdivision 10, of the Rules of Criminal Procedure.\n[See Note.]\nThis section shall not be construed to confer or enlarge any right of a defendant to be released pending an appeal.",
	"repealed": false
}