{
	"id": "13.465",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.465",
	"title": "13.465 FAMILY AND DOMESTIC RELATIONS DATA CODED ELSEWHERE.",
	"text": "The sections referred to in subdivisions 2 to 15 are codified outside this chapter. Those sections classify domestic relations data as other than public, place restrictions on access to government data, or involve data sharing.\nCertain data regarding the location of parties in connection with child support proceedings are governed by sections 257.70; 518.005, subdivision 5; and 518A.82, subdivision 8. Certain data regarding the suspension of licenses of persons owing child support are governed by section 518A.70, and certain data on newly hired employees maintained by the public authority for support enforcement are governed by section 142A.29.\nAccess to records held by a court or other agency concerning artificial insemination performed on a married woman with her spouse's consent is governed by section 257.56, subdivision 1.\nInspection of records in parentage actions held by the court, the commissioner of children, youth, and families, or elsewhere is governed by section 257.70.\nData related to background checks of prospective adoptive parents are governed by section 259.41, subdivision 3.\nCertain data that may be disclosed to a prospective adoptive parent is governed by section 260C.613, subdivision 2.\nData in the fathers' adoption registry are classified under section 259.52, subdivision 4.\nRecords of adoption held by the commissioner of children, youth, and families are classified, and access to them is governed by section 259.79, subdivisions 1 and 3.\nVarious adoption records are classified under section 259.53, subdivision 1. Access to the original birth record of a person who has been adopted is governed by section 144.2252.\nCertain data involving participation in a parent education program are governed by section 518.157, subdivision 5.\nCertain data involving visitation dispute resolution are governed by section 518.1751, subdivision 4a.\nCourt records of child custody proceedings may be sealed as provided in section 518.168.\nCertain data provided by an applicant or recipient of child support enforcement services are classified under section 518A.47.\nChild custody or visitation mediation records are classified under section 518.619, subdivision 5.\nCourt records on the location or residence of a petitioner in a domestic abuse proceeding are governed by section 518B.01, subdivision 3b.\nAccess to data for background studies required by the court under section 524.5-118, is governed by that section.",
	"repealed": false
}