{
	"id": "115A.1318",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1318",
	"title": "115A.1318 RESPONSIBILITIES.",
	"text": "(a) In addition to fulfilling the requirements of sections 115A.1310 to 115A.1330, a manufacturer must comply with paragraphs (b) to (f).\n(b) A manufacturer must annually recycle or arrange for the collection and recycling of an amount of video display devices as determined by the agency in section 115A.1320, subdivision 1. A manufacturer must assume all financial responsibility associated with transporting and recycling covered electronic devices that are used to meet the manufacturer's recycling obligation determined under section 115A.1320 or that are counted as phase I or II recycling credits, including any necessary supplies. This excludes costs that are associated with receiving and aggregating covered electronic devices from households and all the activities up to the time that covered electronic devices are loaded for transport to a recycler or arranged for transportation to a recycler.\n(c) The obligations of a manufacturer apply only to video display devices received from households and do not apply to video display devices received from sources other than households.\n(d) A manufacturer must conduct and document due diligence assessments of collectors and recyclers it contracts with, including an assessment of items specified under subdivision 2. A manufacturer is responsible for maintaining, for a period of three years, documentation that all covered electronic devices recycled, partially recycled, or sent to downstream recycling operations comply with the requirements of subdivision 2.\n(e) A manufacturer must provide the agency with contact information for a person who can be contacted regarding the manufacturer's activities under sections 115A.1310 to 115A.1320.\n(f) Only the covered electronic devices that are recycled by a registered recycler that is certified by an ANSI-ASQ National Accreditation Board-accredited third-party certification body to an environmentally sound management standard are eligible to meet the manufacturer's obligation.\n(a) Collection sites must be:\n(1) staffed; and\n(2) open to the public at a frequency adequate to meet the needs of the area being served.\n(b) A collector may limit the number of covered electronic devices or covered electronic devices by product type accepted per customer per day or per delivery at a collection site or service.\n(c) A collector must use only registered recyclers.\n(a) As part of the report submitted under section 115A.1316, subdivision 2, a recycler must certify, except as provided in paragraph (b), that facilities that recycle covered electronic devices, including all downstream recycling operations:\n(1) use only registered collectors;\n(2) comply with all applicable health, environmental, safety, and financial responsibility regulations;\n(3) are licensed by all applicable governmental authorities;\n(4) use no prison labor to recycle video display devices;\n(5) possess liability insurance of not less than $1,000,000 for environmental releases, accidents, and other emergencies;\n(6) provide a report annually to each registered collector regarding the video display devices received from that entity; and\n(7) do not charge collectors for transporting, recycling, or any necessary supplies related to transporting or recycling covered electronic devices that meet a manufacturer's recycling obligation as determined under section 115A.1320, unless otherwise mutually agreed upon.\n(b) A nonprofit corporation that contracts with a correctional institution to refurbish and reuse donated computers in schools is exempt from paragraph (a), clauses (4) and (5).\n(c) Except to the extent otherwise required by law and unless agreed upon otherwise by the recycler or manufacturer, a recycler has no responsibility for any data that may be contained in a covered electronic device if an information storage device is included in the covered electronic device.\nA retailer who sells new video display devices shall provide information to households describing where and how they may recycle video display devices and advising them of opportunities and locations for the convenient collection of video display devices for the purpose of recycling. This requirement may be met by providing to households the agency's toll-free number and website address. Retailers selling through catalogs or the Internet may meet this requirement by including the information in a prominent location on the retailer's website.",
	"repealed": false
}