{
	"id": "273.372",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.372",
	"title": "273.372 PROCEEDINGS AND APPEALS; UTILITY OR RAILROAD VALUATIONS.",
	"text": "(a) As provided in this section, an appeal by a utility or railroad company concerning property for which the commissioner of revenue has provided the city or county assessor with valuations by order, or for which the commissioner has recommended values to the city or county assessor, must be brought against the commissioner, and not against the county or taxing district where the property is located.\n(b) This section governs administrative appeals and appeals to court of a claim that utility or railroad operating property has been partially, unfairly, or unequally assessed, or assessed at a valuation greater than its real or actual value, misclassified, or that the property is exempt. This section applies only to property described in sections 270.81, subdivision 1, 273.33, 273.35, 273.36, and 273.37, and only with regard to taxable net tax capacities that have been provided to the city or county by the commissioner and which have not been changed by city or county. If the taxable net tax capacity being appealed is not the taxable net tax capacity established by the commissioner, or if the appeal claims that the tax rate applied against the parcel is incorrect, or that the tax has been paid, this section does not apply.\n(a) In all appeals to court that are required to be brought against the commissioner under this section, the petition initiating the appeal must be served on the commissioner and must be filed with the Tax Court in Ramsey County, as provided in paragraph (b) or (c).\n(b) If the appeal to court is from an order of the commissioner, it must be brought under chapter 271 and filed within the time period prescribed in section 271.06, subdivision 2, except that when the provisions of this section conflict with chapter 271 or 278, this section prevails. In addition, the petition must include all the parcels encompassed by that order which the petitioner claims have been partially, unfairly, or unequally assessed, assessed at a valuation greater than their real or actual value, misclassified, or are exempt. For this purpose, an order of the commissioner is either (1) a certification or notice of value by the commissioner for property described in subdivision 1, or (2) the final determination by the commissioner of an administrative appeal described in subdivision 4.\n(c) If the appeal is from the tax that results from implementation of the commissioner's order, certification, or recommendation, it must be brought under chapter 278, and the provisions in that chapter apply, except that service shall be on the commissioner only and not on the local officials specified in section 278.01, subdivision 1, and if any other provision of this section conflicts with chapter 278, this section prevails. In addition, the petition must include either all the utility parcels or all the railroad parcels in the state in which the petitioner claims an interest and which the petitioner claims have been partially, unfairly, or unequally assessed, assessed at a valuation greater than their real or actual value, misclassified, or are exempt.\nUpon filing of any appeal in court by a utility company or railroad against the commissioner pursuant to this section, the commissioner shall give notice by first class mail to the county auditor of each county where property included in the petition is located.\n(a) Companies that submit the reports under section 270.82 or 273.371 by the date specified in that section, or by the date specified by the commissioner in an extension, may appeal administratively to the commissioner prior to bringing an action in court.\n(b) Companies must file a written request for an appeal with the commissioner within 30 days after the notice date of the commissioner's valuation certification or other notice to the company. For purposes of this section, \"notice date\" means the notice date of the valuation certification, commissioner's order, recommendation, or other notice.\n(c) The appeal need not be in any particular form but must contain the following information:\n(1) name and address of the company;\n(2) the date;\n(3) its Minnesota identification number;\n(4) the assessment year or period involved;\n(5) the findings in the valuation that the company disputes;\n(6) a summary statement specifying its reasons for disputing each item; and\n(7) the signature of the company's duly authorized agent or representative.\n(d) When requested in writing and within the time allowed for filing an administrative appeal, the commissioner may extend the time for filing an appeal for a period of not more than 15 days from the expiration of the time for filing the appeal.\n(e) The commissioner shall conduct the conference either in person or by telephone upon the commissioner's entire files and records and such further information as may be offered. The conference must be held no later than 20 days after the date of the request for an appeal. Within 30 days after the conference the commissioner shall make a final determination of the matter and shall notify the company promptly of the determination. The conference is not a contested case hearing subject to chapter 14.\nWhen it appears to be in the best interest of the state, the commissioner may settle any matter under consideration regarding an appeal filed under this section. The agreement must be in writing and signed by the commissioner and the company or the company's authorized representative. The agreement is final and conclusive, and except upon a showing of fraud, malfeasance, or misrepresentation of a material fact, the case may not be reopened as to the matters agreed upon.\nIf a taxpayer files an administrative appeal from an order of the commissioner and also files an appeal to the Tax Court for that same order of the commissioner, the administrative appeal is dismissed and the commissioner is no longer required to make the determination of appeal under subdivision 4.",
	"repealed": false
}