{
	"id": "323A.0105",
	"url": "https://www.revisor.mn.gov/statutes/cite/323A.0105",
	"title": "323A.0105 EXECUTION, FILING, AND RECORDING OF STATEMENTS.",
	"text": "(a) A statement may be filed in the office of the secretary of state. A certified copy of a statement that is filed in an office in another state may be filed in the office of the secretary of state. Either filing has the effect provided in this chapter with respect to partnership property located in or transactions that occur in this state.\n(b) A certified copy of a statement that has been filed and has been recorded has the effect provided for recorded statements in this chapter. A recorded statement that is not a certified copy of a statement filed in the office of the secretary of state does not provide knowledge or notice and does not have the effect provided for recorded statements in this chapter.\n(c) A statement filed by a partnership must be executed by at least two partners. Other statements must be executed by a partner or other person authorized by this chapter. An individual who executes a statement as, or on behalf of, a partner or other person named as a partner in a statement shall personally declare under penalty of perjury that the contents of the statement are accurate.\n(d) A person authorized by this chapter to file a statement may amend or cancel the statement by filing an amendment or cancellation that names the partnership, identifies the statement, and states the substance of the amendment or cancellation.\n(e) A person who files a statement pursuant to this section shall promptly send a copy of the statement to every nonfiling partner and to any other person named as a partner in the statement. Failure to send a copy of a statement to a partner or other person does not limit the effectiveness of the statement as to a person not a partner.\n(f) A statement will be filed as a supplement to any limited liability partnership registration on file, or if no registration has been filed, as a supplement to any assumed name filing for the partnership pursuant to sections 333.001 to 333.06. If there is neither a limited liability partnership registration nor an assumed name on file, the person filing the statement must also file one of the following:\n(i) a limited liability partnership statement of qualification on behalf of the partnership; or\n(ii) an assumed name filing on behalf of the partners pursuant to sections 333.001 to 333.06.",
	"repealed": false
}