{
	"id": "120B.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.022",
	"title": "120B.022 ELECTIVE STANDARDS.",
	"text": "A district must establish and regularly review its own standards for career and technical education (CTE) programs. Standards must align with CTE frameworks developed by the Department of Education, standards developed by national CTE organizations, or recognized industry standards. A district must use the current world languages standards developed by the American Council on the Teaching of Foreign Languages. A school district must offer courses in all elective subject areas.\n(a) World languages teachers and other school staff should develop and implement world languages programs that acknowledge and reinforce the language proficiency and cultural awareness that non-English language speakers already possess, and encourage students' proficiency in multiple world languages. Programs under this section must encompass Indigenous American Indian languages and cultures, among other world languages and cultures. The department shall consult with postsecondary institutions in developing related professional development opportunities for purposes of this section.\n(b) Any Minnesota public, charter, or nonpublic school may award Minnesota World Language Proficiency Certificates consistent with this subdivision.\n(c) The Minnesota World Language Proficiency Certificate recognizes students who demonstrate an overall intermediate-low or intermediate-mid level of proficiency on the ACTFL's scale of levels of proficiency. A student's level of proficiency is derived from assessment in the domains of listening, reading, speaking, and writing on a valid and reliable assessment tool.\n(a) Consistent with efforts to strive for comprehensive achievement and civic readiness under sections 120B.11 and 124E.03, subdivision 2, paragraph (i), and close the academic achievement and opportunity gap under sections 124D.861 and 124D.862, voluntary state bilingual and multilingual seals are established to recognize graduating high school students in any school district, charter school, or nonpublic school who demonstrate particular levels of proficiency in one or more languages other than English. The levels of proficiency established under this subdivision are based on the ACTFL's proficiency guidelines. A student is eligible for a seal in a language other than English if the student demonstrates proficiency derived from assessment in the domains of listening, reading, speaking, and writing on an assessment aligned with ACTFL proficiency guidelines or on an equivalent valid and reliable assessment at a level required under paragraph (c). Indigenous American Indian languages and American Sign Language are languages other than English for purposes of this subdivision and world languages for purposes of subdivision 1a.\n(b) In addition to paragraph (a), to be eligible to receive a seal students must satisfactorily complete all required English language arts credits.\n(c) Consistent with this subdivision, a high school student who demonstrates an overall intermediate high ACTFL level of proficiency derived from assessment in the domains of listening, reading, speaking, and writing in one language in addition to English is eligible to receive the state bilingual gold seal. A high school student who demonstrates an overall intermediate high ACTFL level of proficiency derived from assessment in the domains of listening, reading, speaking, and writing in more than one language in addition to English is eligible to receive the state multilingual gold seal. A high school student who demonstrates an overall advanced-low or above ACTFL level of proficiency derived from assessment in the domains of listening, reading, speaking, and writing in one language in addition to English is eligible to receive the state bilingual platinum seal. A high school student who demonstrates an overall advanced-low or above ACTFL level of proficiency derived from assessment in the domains of listening, reading, speaking, and writing in more than one language in addition to English is eligible to receive the state multilingual platinum seal.\n(d) School districts and charter schools may give students periodic opportunities to demonstrate their level of proficiency in listening, speaking, reading, and writing in a language in addition to English. Where valid and reliable assessments are unavailable, a school district or charter school may rely on evaluators trained in assessing under ACTFL proficiency guidelines to assess a student's level of non-English language proficiency under this section. School districts and charter schools must maintain appropriate records to identify high school students eligible to receive the state bilingual or multilingual gold and platinum seals upon graduation. The school district or charter school must notate the appropriate seal to the transcript of each high school student who meets the requirements of this subdivision and may affix the seal to the student's diploma. A school district or charter school must not charge the high school student a fee for this seal.\n(e) A school district or charter school may award elective course credits in world languages to a student who demonstrates the requisite proficiency in a language other than English under this section.\n(f) A school district or charter school may award community service credit to a student who demonstrates an overall intermediate high or above ACTFL level of proficiency derived from assessment in the domains of listening, reading, speaking, and writing in a language other than English and who participates in community service activities that are integrated into the curriculum, involve the participation of teachers, and support biliteracy in the school or local community.\n(g) The commissioner must list on the web page the assessments that are aligned to ACTFL proficiency guidelines, and establish guidelines on interpreting the scores or ratings from approved assessments.\n(h) By August 1, 2015, the colleges and universities of the Minnesota State Colleges and Universities system must establish criteria to translate the seals into college credits based on the world language course equivalencies identified by the Minnesota State Colleges and Universities faculty and staff and, upon request from an enrolled student, the Minnesota State Colleges and Universities may award foreign language credits to a student who received a Minnesota World Language Proficiency Certificate or Minnesota Bilingual or Multilingual Seals under subdivision 1a. A student who demonstrated the requisite level of language proficiency in grade 10, 11, or 12 to receive a seal or certificate and is enrolled in a Minnesota State Colleges and Universities institution must request college credits for the student's seal or proficiency certificate within three academic years after graduating from high school. The University of Minnesota is encouraged to award students foreign language academic credits consistent with this paragraph.\nA district must use a locally selected assessment to determine if a student has achieved an elective standard.",
	"repealed": false
}