{
	"id": "386.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/386.66",
	"title": "386.66 BOND OR ABSTRACTER'S LIABILITY INSURANCE POLICY.",
	"text": "Before a license shall be issued, the applicant shall file with the commissioner an annual bond or abstracter's liability insurance policy for each license year, to be approved by the commissioner, running to the state of Minnesota in the penal sum of at least $100,000 conditioned for the payment by such abstracter of any damages that may be sustained by or accrue to any person by reason of or on account of any error, deficiency or mistake arising wrongfully or negligently in any abstract, or continuation thereof, or in any certificate showing ownership of, or interest in, or liens upon any lands in the state of Minnesota, whether registered or not, made by and issued by such abstracter, provided however, that the aggregate liability of the surety to all persons under such bond shall in no event exceed the amount of such bond. If the applicant intends to engage in the business of abstracting in any county having more than 200,000 inhabitants, the bond or insurance policy required herein shall be in the penal sum of at least $250,000. Applicants that are title insurers regulated by chapter 68A and licensed pursuant to sections 60A.02 and 60A.06, subdivision 1, clause (7), and their employees or those having cash or securities on deposit with the state of Minnesota in an amount equal to the said bond or insurance policy shall be exempt from furnishing the bond or an insurance policy herein required but shall be liable to the same extent as if a bond or insurance policy has been given and filed. The bond or insurance policy required hereunder shall be written by some surety or other company authorized to do business in this state issuing bonds or abstracter's liability insurance policies and shall be issued for a period of one or more years, and renewed for one year at the date of expiration as principal continues in business.",
	"repealed": false
}