{
	"id": "147F.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/147F.05",
	"title": "147F.05 UNLICENSED PRACTICE PROHIBITED; PROTECTED TITLES AND RESTRICTIONS ON USE.",
	"text": "No individual may use the title \"genetic counselor,\" \"licensed genetic counselor,\" \"gene counselor,\" \"genetic consultant,\" \"genetic assistant,\" \"genetic associate,\" or any words, letters, abbreviations, or insignia indicating or implying that the individual is eligible for licensure by the state as a genetic counselor unless the individual has been licensed as a genetic counselor according to this chapter.\nEffective January 1, 2018, no individual may practice genetic counseling unless the individual is licensed as a genetic counselor under this chapter except as otherwise provided under this chapter.\n(a) Nothing in this chapter shall be construed to prohibit or restrict the practice of any profession or occupation licensed or registered by the state by an individual duly licensed or registered to practice the profession or occupation or to perform any act that falls within the scope of practice of the profession or occupation.\n(b) Nothing in this chapter shall be construed to require a license under this chapter for:\n(1) an individual employed as a genetic counselor by the federal government or a federal agency if the individual is providing services under the direction and control of the employer;\n(2) a student or intern, having graduated within the past six months, or currently enrolled in an ACGC-accredited genetic counseling educational program providing genetic counseling services that are an integral part of the student's or intern's course of study, are performed under the direct supervision of a licensed genetic counselor or physician who is on duty in the assigned patient care area, and the student is identified by the title \"genetic counseling intern\";\n(3) a visiting ABGC- or ABMG-certified genetic counselor working as a consultant in this state who permanently resides outside of the state, or the occasional use of services from organizations from outside of the state that employ ABGC- or ABMG-certified genetic counselors. This is limited to practicing for 30 days total within one calendar year. Certified genetic counselors from outside of the state working as a consultant in this state must be licensed in their state of residence if that credential is available; or\n(4) an individual who is licensed to practice medicine under chapter 147.\nAn individual who violates this section is guilty of a misdemeanor and shall be subject to sanctions or actions according to section 214.11.",
	"repealed": false
}