{
	"id": "477A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.36",
	"title": "477A.36 STATEWIDE LOCAL HOUSING AID.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"City distribution factor\" means the number of households in a tier I city that are cost-burdened divided by the total number of households that are cost-burdened in Minnesota tier I cities. The number of cost-burdened households shall be determined using the most recent estimates or experimental estimates provided by the American Community Survey of the United States Census Bureau as of May 1 of the aid calculation year.\n(c) \"Cost-burdened household\" means a household in which gross rent is 30 percent or more of household income or in which homeownership costs are 30 percent or more of household income.\n(d) \"County distribution factor\" means the number of households in a county that are cost-burdened divided by the total number of households in Minnesota that are cost-burdened. The number of cost-burdened households shall be determined using the most recent estimates or experimental estimates provided by the American Community Survey of the United States Census Bureau as of May 1 of the aid calculation year.\n(e) \"Eligible Tribal Nation\" means any of the 11 federally recognized Indian Tribes located in Minnesota which submit an application under subdivision 6, paragraph (g).\n(f) \"Locally funded housing expenditures\" means expenditures of the aid recipient, including expenditures by a public corporation or legal entity created by the aid recipient, that are:\n(1) funded from the recipient's general fund, a property tax levy of the recipient or its housing and redevelopment authority, or unrestricted money available to the recipient, but not including tax increments; and\n(2) expended on one of the following qualifying activities:\n(i) financial assistance to residents in arrears on rent, mortgage, utilities, or property tax payments;\n(ii) support services, case management services, and legal services for residents in arrears on rent, mortgage, utilities, or property tax payments;\n(iii) down payment assistance or homeownership education, counseling, and training;\n(iv) acquisition, construction, rehabilitation, adaptive reuse, improvement, financing, and infrastructure of residential dwellings;\n(v) costs of operating emergency shelter, transitional housing, supportive housing, or publicly owned housing, including costs of providing case management services and support services; and\n(vi) rental assistance.\n(g) \"Population\" has the meaning given in section 477A.011, subdivision 3.\n(h) \"Tier I city\" means a statutory or home rule charter city that is a city of the first, second, or third class and is not located in a metropolitan county, as defined by section 473.121, subdivision 4.\n(i) \"Tier II city\" means a statutory or home rule charter city that is a city of the fourth class and is not located in a metropolitan county, as defined by section 473.121, subdivision 4.\n(a) Each county shall receive the sum of:\n(1) 0.6 percent of the total amount available to counties under this section; plus\n(2) the product of:\n(i) the county distribution factor; multiplied by\n(ii) the total amount available to counties under this section minus the product of clause (1) multiplied by the number of Minnesota counties.\n(b) The commissioner of revenue shall determine the amount of funding available to a tier I city under this section by multiplying the city's city distribution factor and the amount of funding available to tier I cities under this section.\n(c) The commissioner of revenue shall determine the amount of funding available to an eligible Tribal Nation by dividing the amount of money available for aid to Tribal Nations under this section by the number of eligible Tribal Nations that have applied to receive an aid distribution under this section.\n(a) The commissioner of the Minnesota Housing Finance Agency shall establish a program to award grants of at least $25,000 to tier II cities. The agency shall develop program guidelines and criteria in consultation with the League of Minnesota Cities. Notwithstanding section 16C.06, the commissioner may use a formula to determine the amounts of awards to tier II cities applying for funding under this section. Awards may be made in conjunction with funding awards under other agency programs that serve tier II cities.\n(b) Among comparable proposals, the agency shall prioritize grants to tier II cities that have a higher proportion of cost-burdened households.\n(c) A grantee must use its grant on a qualifying project.\n(d) In making grants, the agency shall determine the circumstances, terms, and conditions under which all or any portion thereof will be repaid and shall determine the appropriate security should repayment be required. Any repaid funds shall be returned to the account or accounts established pursuant to paragraph (e).\n(e) The agency shall establish a bookkeeping account or accounts in the housing development fund for money distributed to the agency for grants under this subdivision. By May 1 of each year, the Minnesota Housing Finance Agency shall report to the Department of Revenue on the amount in the account or accounts.\n(a) Qualifying projects shall include:\n(1) emergency rental assistance for households earning less than 80 percent of area median income as determined by the United States Department of Housing and Urban Development;\n(2) financial support to nonprofit affordable housing providers in their mission to provide safe, dignified, affordable and supportive housing;\n(3) outside the metropolitan counties as defined in section 473.121, subdivision 4, development of market rate residential rental properties, as defined in section 462A.39, subdivision 2, paragraph (d), if the relevant unit of government submits with the report required under subdivision 6 a resolution and supporting documentation showing that the area meets the requirements of section 462A.39, subdivision 4, paragraph (a);\n(4) projects designed for the purpose of construction, acquisition, rehabilitation, demolition or removal of existing structures, construction financing, permanent financing, interest rate reduction, refinancing, and gap financing of housing to provide affordable housing to households that have incomes which do not exceed, for homeownership projects, 115 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development and, for rental housing projects, 80 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development, except that the housing developed or rehabilitated with funds under this section must be affordable to the local work force;\n(5) financing the operations and management of financially distressed residential properties;\n(6) funding of supportive services or staff of supportive services providers for supportive housing as defined in section 462A.37, subdivision 1. Financial support to nonprofit housing providers to finance supportive housing operations may be awarded as a capitalized reserve or as an award of ongoing funding; and\n(7) costs of operating emergency shelter facilities, including the costs of providing services.\n(b) Recipients must prioritize projects that provide affordable housing to households that have incomes that do not exceed, for homeownership projects, 80 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development, and for rental housing projects, 50 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development. Priority may be given to projects that: reduce disparities in home ownership; reduce housing cost burden, housing instability, or homelessness; improve the habitability of homes; create accessible housing; or create more energy- or water-efficient homes.\n(c) Gap financing is either:\n(1) the difference between the costs of the property, including acquisition, demolition, rehabilitation, and construction, and the market value of the property upon sale; or\n(2) the difference between the cost of the property and the amount the targeted household can afford for housing, based on industry standards and practices.\n(d) If aid under this section is used for demolition or removal of existing structures, the cleared land must be used for the construction of housing to be owned or rented by persons who meet the income limits of paragraph (a).\n(e) If an aid recipient uses the aid on new construction of a building containing more than four units, the loan recipient must construct, convert, or otherwise adapt the building to include:\n(1) the greater of: (i) at least one unit; or (ii) at least five percent of units that are accessible units, and each accessible unit includes at least one roll-in shower, water closet, and kitchen work surface meeting the requirements of section 1002 of the current State Building Code Accessibility Provisions for Dwelling Units in Minnesota; and\n(2) the greater of: (i) at least one unit; or (ii) at least five percent of units that are sensory-accessible units that include:\n(A) soundproofing between shared walls for first and second floor units;\n(B) no florescent lighting in units and common areas;\n(C) low-fume paint;\n(D) low-chemical carpet; and\n(E) low-chemical carpet glue in units and common areas.\nNothing in this paragraph relieves a project funded by this section from meeting other applicable accessibility requirements.\n(a) Any funds distributed under this section must be spent on a qualifying project. If a tier I city or county demonstrates to the Minnesota Housing Finance Agency that the tier I city or county cannot expend funds on a qualifying project by the deadline imposed by paragraph (b) due to factors outside the control of the tier I city or county, funds shall be considered spent on a qualifying project if the funds are transferred to a local housing trust fund. Funds transferred to a local housing trust fund must be spent on a project or household that meets the affordability requirements of subdivision 4, paragraph (a).\n(b) Funds must be spent by December 31 in the third year following the year after the aid was received. The requirements of this paragraph are satisfied if funds are:\n(1) committed to a qualifying project by December 31 in the third year following the year after the aid was received; and\n(2) expended by December 31 in the fourth year following the year after the aid was received.\n(c) An aid recipient may not use aid funds to reimburse itself for prior expenditures.\n(a) As a condition of receiving aid under this section, a recipient must commit to using money to supplement, not supplant, existing locally funded housing expenditures, so that the recipient is using the funds to create new or to expand existing housing programs.\n(b) In the annual report required under subdivision 6, a recipient must certify compliance with this subdivision, including an accounting of locally funded housing expenditures in the prior fiscal year. In an aid recipient's first report to the Minnesota Housing Finance Agency, the aid recipient must document its locally funded housing expenditures in the two prior fiscal years. If a recipient reduces one of its locally funded housing expenditures, the recipient must detail the expenditure, the amount of the reduction, and the reason for the reduction. The certification required under this paragraph must be made available publicly on the recipient's website.\n(a) The commissioner of revenue must compute the amount of aid payable to each aid recipient under this section. Beginning with aids payable in calendar year 2024, before computing the amount of aid for counties and after receiving the report required by subdivision 3, paragraph (e), the commissioner shall compute the amount necessary to increase the amount in the account or accounts established under that paragraph to $1,250,000. The amount calculated under the preceding sentence shall be deducted from the amount available to counties for the purposes of certifying the amount of aid to be paid to counties in the following year. By August 1 of each year, the commissioner must certify the amount to be paid to each tier I city and county in the following year. The commissioner must pay statewide local housing aid to tier I cities and counties annually at the times provided in section 477A.015. Before paying the first installment of aid annually, the commissioner of revenue shall transfer to the Minnesota Housing Finance Agency from the funds available for counties, for deposit in the account or accounts established under subdivision 3, paragraph (e), the amount computed in the prior year to be necessary to increase the amount in the account or accounts established under that paragraph to $1,250,000.\n(b) Beginning in 2025, aid recipients shall submit a report annually, no later than December 1 of each year, to the Minnesota Housing Finance Agency. The report shall include documentation of the location of any unspent funds distributed under this section and of qualifying projects completed or planned with funds under this section. If an aid recipient fails to submit a report, fails to spend funds within the timeline imposed under subdivision 5, paragraph (b), uses funds for a project that does not qualify under this section, or if an aid recipient fails to meet the requirements of subdivision 5a, the Minnesota Housing Finance Agency shall notify the Department of Revenue and the aid recipient must repay funds under paragraph (c) by February 15 of the following year.\n(c) By May 15, after receiving notice from the Minnesota Housing Finance Agency, an aid recipient must pay to the Minnesota Housing Finance Agency funds the aid recipient received under this section if the aid recipient:\n(1) fails to spend the funds within the time allowed under subdivision 5, paragraph (b);\n(2) spends the funds on anything other than a qualifying project;\n(3) fails to submit a report documenting use of the funds; or\n(4) fails to meet the requirements of subdivision 5a.\n(d) The commissioner of revenue must stop distributing funds to an aid recipient that requests in writing that the commissioner stop payment or that the Minnesota Housing Finance Agency reports to have, in three consecutive years, failed to use funds, misused funds, or failed to report on its use of funds. A request to stop payment under this paragraph must be submitted to the commissioner in the form and manner prescribed by the commissioner on or before May 1 of the year prior to the aids payable year in which the aid recipient wants the commissioner to stop payment of aid. The commissioner shall not stop payment based on a request received after May 1 until aids payable based on certification in the following calendar year.\n(e) The commissioner may resume distributing funds to an aid recipient to which the commissioner has stopped payments in the year following the August 1 after the Minnesota Housing Finance Agency certifies that the city or county has submitted documentation of plans for a qualifying project. The commissioner may resume distributing funds to an aid recipient to which the commissioner has stopped payments at the request of the recipient in the year following the August 1 after the Minnesota Housing Finance Agency certifies that the recipient has submitted documentation of plans for a qualifying project.\n(f) By June 1, any funds paid to the Minnesota Housing Finance Agency under paragraph (c) must be deposited in the housing development fund. Funds deposited under this paragraph are appropriated to the commissioner of the Minnesota Housing Finance Agency for use on the family homeless prevention and assistance program under section 462A.204, the economic development and housing challenge program under section 462A.33, and the workforce and affordable homeownership development program under section 462A.38.\n(g) An eligible Tribal Nation may choose to receive an aid distribution under this section by submitting an application under this subdivision. An eligible Tribal Nation which has not received a distribution in a prior aids payable year may elect to begin participation in the program by submitting an application in the manner and form prescribed by the commissioner of revenue by January 15 of the aids payable year. In order to receive a distribution, an eligible Tribal Nation must certify to the commissioner of revenue the most recent estimate of the total number of enrolled members of the eligible Tribal Nation. The information must be annually certified by March 1 in the form prescribed by the commissioner of revenue. The commissioner of revenue must annually calculate and certify the amount of aid payable to each eligible Tribal Nation on or before August 1 of the aids payable year. The commissioner of revenue must pay statewide local housing aid to eligible Tribal Nations annually by December 27 of the year the aid is certified.\n[See Note.]\nA county that receives funding under this section shall regularly consult with the cities in the jurisdictions of which its qualifying projects are planned or located.\n(a) $6,800,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to counties as required under this section.\n(b) $2,000,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to tier I cities as required under this section.\n(c) $1,200,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to eligible Tribal Nations as required under this section.\n(d) In fiscal years 2024 and 2025 only, an additional $8,500,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to counties as required under this section. In fiscal years 2024 and 2025 only, an additional $2,500,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to tier I cities as required under this section. In fiscal years 2024 and 2025 only, an additional $1,500,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to eligible Tribal Nations as required under this section. In fiscal years 2024 and 2025 only, the commissioner shall transfer from the funds available to counties to the Minnesota Housing Finance Agency a sum sufficient to increase the amount in the account or accounts established under subdivision 3, paragraph (e), to $2,250,000. For aids payable in 2023 only, the commissioner may compute the amount of aid to be paid to aid recipients as late as August 1, 2023, and may make payments of aid under this section in one installment on December 26.",
	"repealed": false
}