{
	"id": "3.7393",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.7393",
	"title": "3.7393 CONSIDERATION AND PAYMENT OF CLAIMS.",
	"text": "The chief justice of the supreme court shall establish a special master panel to consider claims, make offers of settlement, and enter into settlement agreements with survivors on behalf of the state. The panel must be established by June 30, 2008. The panel must consist of three attorneys. Members of the panel must have experience in legal issues involving the settlement of tort claims and the determination of damages. The chief justice shall designate a member of the panel to serve as chair of the panel. The chief justice shall determine the pay and expenses to be received by the panel.\nWithin the limits of available appropriations, the state court administrator, in consultation with the panel, shall hire employees or retain consultants necessary to assist the panel in performing its duties under this section. Employees are in the unclassified state civil service. The panel may also use consultants who are under a contract with the state or current state employees to assist the panel in processing claims under this section.\n(a) Records of the panel related to a claim filed by a survivor, an offer of settlement, or an acceptance or rejection of an offer are not accessible to the public except for:\n(1) the name of the survivor; and\n(2) the terms of any written settlement agreement between the survivor and the state.\n(b) Records created by a member of the panel related to the member's service as a member of the panel are not discoverable in any civil or administrative proceeding except a record relating to any statement or conduct that may constitute a crime.\nConsistent with sections 3.7391 to 3.7395, the panel may adopt and modify procedures, rules, and forms for considering claims, making offers of settlement, entering into settlement agreements, and considering requests for and making supplemental payments. The panel must allow each survivor to appear in person before the panel or one of its members.\nThe state court administrator shall forward documentation of salaries, expenses, and administrative costs under this section to the commissioner of management and budget for payment of those amounts.\n(a) Members of the panel and employees and consultants acting under the direction of the panel are absolutely immune from civil liability for any act or omission occurring within the scope of the performance of their duties under this section.\n(b) Members of the panel, employees, and consultants acting under the direction of the panel are employees of the state for purposes of section 3.736, subdivision 9.\nA member of the panel must not testify in any civil or administrative proceeding regarding any matter involving or arising out of the member's service as a member of the panel, except as to a statement or conduct that may constitute a crime.\nThe panel shall consider claims, make offers of settlement, and enter into settlement agreements with survivors as provided in this section. The panel must not consider negligence or any other theory of liability. The panel shall make offers of settlement and supplemental payments under this section with the assumption that no future appropriation will be available for these purposes and shall include a notice of this provision when making settlement offers.\n(a) An offer of settlement made to a survivor under this section is considered for all purposes to be an offer to the survivor to settle a legal claim.\n(b) A determination by the panel regarding an offer of settlement or settlement agreement or a supplemental payment is final and not subject to judicial review.\n(c) The amount of damages incurred by a survivor calculated by the panel pursuant to subdivision 10 may not be used in a subsequent court proceeding in evidence or otherwise to determine any rights, duties, or responsibilities of the state or any other party.\nIn order to be eligible to receive an offer of settlement or enter into a settlement agreement under this section or to receive a supplemental payment under subdivision 12, a survivor must file a claim with the panel by October 15, 2008. Any offer of settlement must be made by February 28, 2009. A survivor must accept or reject the offer of settlement within 45 days after receiving the offer. Failure to accept an offer within 45 days is a rejection. A survivor who is eligible to receive a supplemental payment under subdivision 12 may choose to wait until the survivor's supplemental payment is calculated before accepting or rejecting an offer of settlement, provided that a survivor may not accept an offer of settlement later than 45 days after receiving notice of the proposed supplemental payment award. The decision to accept or reject an offer is irrevocable. The panel must notify a survivor of the deadlines for response to an offer of settlement as provided in this subdivision.\nThe panel shall determine the total damages incurred by a survivor. The amount of an offer of settlement under this section must be calculated based on the total damages, less:\n(1) payments made to the survivor up to the date the settlement offer is made from the collateral sources referred to in section 548.251, subdivision 1;\n(2) any payment made to the survivor from the emergency relief fund; and\n(3) any payments made or required to be made to the survivor by a third-party tortfeasor under the terms of a settlement or other agreement with the survivor that exists at the time the offer is made or a final judgment in favor of the survivor concerning claims of the survivor that relate to, involve, or arise out of the catastrophe.\n(a) The amount of an offer of settlement or payment required by a settlement agreement must not exceed $400,000. This limitation does not apply to a supplemental payment made under subdivision 12. An offer of settlement must be accompanied by a notice to the survivor of the remainder of the amount calculated under subdivision 10 that is not included in the offer because of the limitation under this paragraph and the amount of the remainder for which a supplemental payment may be awarded.\n(b) Notwithstanding section 3.736, subdivision 4, clause (e), or 466.04, subdivision 1, paragraph (a), clause (5), the $1,000,000 limitation on state or municipal liability for claims arising out of a single occurrence otherwise applicable to the catastrophe does not apply to payments made to survivors under this section. The amount that may be paid by the state is limited by the appropriations for this purpose.\n(a) For purposes of this subdivision, \"uncompensated medical expenses\" means:\n(1) medical expenses less payments made to a survivor from collateral sources referred to in section 548.251, subdivision 1, that provide payments for medical expenses; and\n(2) the present value of premiums, deductibles, and coinsurance payments for high-risk health plan coverage offered by the Minnesota Comprehensive Health Association or by another similar health plan.\n(b) A survivor is eligible for a supplemental payment if the offer of settlement calculation for the survivor, as provided in subdivision 10, exceeds $400,000. The supplemental payment must be calculated based solely on that portion of the uncompensated medical expenses, loss of income, future earning capacity, or other financial support for which compensation was not received under the offer of settlement or settlement agreement under subdivision 11. A supplemental payment may only be made to a survivor who has accepted an offer of settlement, entered into a settlement agreement, and executed a release under subdivision 13. Consistent with the requirements of this section, the panel shall establish necessary procedures and timelines for the award of supplemental payments. A supplemental payment may be made only for the following purposes, in the following order of priority:\n(1) to pay uncompensated medical expenses in excess of those paid from the first $400,000; and\n(2) to pay for loss of income, future earning capacity, or other financial support not included in the first $400,000.\nNo payment may be made to a survivor for loss of income under clause (2) unless and until all survivors have been fully paid for all medical expenses for which they are eligible under clause (1).\n(c) If the available appropriation is insufficient to make full awards to all survivors eligible for a supplemental payment, the panel may award the payments based on a uniform percentage of the amount that is less than the full amount eligible for a supplemental payment or take other steps the panel considers necessary to ensure that the available appropriation is equitably distributed among all survivors who have requested and qualify for a supplemental payment, subject to the order of priority under this subdivision.\nA survivor who accepts an offer of settlement from the panel must agree in writing and in a form developed by the panel, with the approval of the attorney general, to release the state and every municipality of this state and their employees from liability, including claims for damages, arising from the catastrophe and to cooperate with the state in pursuing claims the state may have against any other party. The release must also provide that the survivor will indemnify the state, a municipality, and their employees from any claim of contribution or indemnity, or both, made by other persons against the state, a municipality, and their employees and that the survivor will satisfy any judgment obtained by the survivor in an action against other persons to the extent of the release, if the claim or judgment relates in any way to a claim of the survivor arising from the catastrophe. The release must provide for the subrogation interest of the state under section 3.7394, subdivision 5. A survivor who previously has commenced an administrative, court, or other action against the state or a municipality of the state or their employees seeking recovery from loss resulting from the catastrophe must agree to dismiss or otherwise withdraw the action before receiving compensation under this section.\nThe panel shall promptly forward to the commissioner of management and budget documentation of each settlement agreement that has been entered into under this section. Except as provided in section 3.7394, subdivision 4, paragraph (b), the commissioner of management and budget shall pay the agreed amount within 45 days after receiving the documentation and in the order in which the documentation from the panel was received.\n(a) A survivor may elect not to file a claim with the panel or not to accept an offer of settlement from the panel. A survivor who elects not to file a claim with the panel or not to accept an offer of settlement has not waived any legal rights that may be asserted against the state or a municipality or their employees and may proceed with a claim in district court.\n(b) If a survivor elects not to accept an offer of settlement, the state or a municipality or their employees may not use any data provided by the survivor to the panel in a subsequent legal proceeding. The state or a municipality or their employees may obtain information, including data provided to the panel, through discovery or other legal processes.",
	"repealed": false
}