{
	"id": "82A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/82A.11",
	"title": "82A.11 SALES CONTRACT; RESCISSION.",
	"text": "Every membership camping contract shall be in writing.\n[Repealed, 2014 c 222 art 1 s 58]\nA purchaser has an unconditional right to rescind any membership camping contract, or revoke any offer, at any time prior to or within five business days after the date the purchaser actually receives a legible copy of the binding contract. Predating of a document does not affect the time in which the right to rescind may be exercised.\nEach membership camping contract shall be prominently labeled and captioned that it is a document taken in connection with a sale of membership camping contracts under this chapter.\nEach membership camping contract shall contain the following notice which shall be in at least 10-point type, stating:\n\"You are entitled to rescind this agreement for any reason within five business days from the day you actually receive a legible copy of this document signed by all parties. The rescission must be in writing and sent by certified mail to the membership camping operator along with this agreement and any membership card issued to you or your family at the address stated in this document. Upon rescission, you will receive a refund of all money paid within 30 days after the membership camping operator receives notice of your rescission.\"\nThe operator or broker may impose a fee of not more than $25 for processing of a rescission. If the operator or broker does so, it shall add the following clause to the notice: \"provided that the membership camping operator (or broker, if the seller is a broker) may retain a processing fee of $......,\" and insert the amount of the charge to be imposed.\nIn the event the membership camping contract is sold by a broker or the broker's salesperson, the above notice shall be modified to substitute the name of the broker for \"membership camping operator.\"\nRescission occurs when the purchaser gives written notice of rescission, whether or not the membership camping contract or any membership card accompanies the notice, to the membership camping operator or the broker at the address stated in the contract. Notice of rescission, if given by mail, is effective when the purchaser deposits a certified letter properly addressed and postage prepaid in a mailbox. A notice of rescission given by the purchaser need not take a particular form and is sufficient if it indicates by any form of written expression the intention of the purchaser not to be bound by the membership camping contract.\nNo act of a purchaser shall be effective to waive the right to rescind as provided in this section.\nA membership camping contract that may be transferred by descent or devise must provide that the heir or devisee may cancel the contract. Cancellation of the contract relieves the heir or devisee of any further obligations under the contract.",
	"repealed": false
}