{
	"id": "16B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.31",
	"title": "16B.31 COMMISSIONER MUST APPROVE PLANS.",
	"text": "(a) The commissioner shall (1) have plans and specifications prepared for the construction, alteration, or enlargement of all state buildings, structures, and other improvements except highways and bridges, and except for buildings and structures under the control of the Board of Regents of the University of Minnesota or of the Board of Trustees of the Minnesota State Colleges and Universities; (2) approve those plans and specifications; (3) advertise for bids and award all contracts in connection with the improvements; (4) supervise and inspect all work relating to the improvements; (5) approve all lawful changes in plans and specifications after the contract for an improvement is let; and (6) approve estimates for payment. This subdivision does not apply to the construction of the Zoological Gardens.\n(b) MS 2002 [Expired]\n(c) MS 2002 [Expired]\n(d) Notwithstanding any other law to the contrary, the commissioner may:\n(1) use a design-build method of project delivery and award a design-build contract as provided in sections 16C.32 and 16C.33;\n(2) use a construction manager at risk method of project delivery and award a construction manager at risk contract on the basis of the selection criteria described in section 16C.34; or\n(3) use a job order contracting contractor selection as described in section 16C.35.\n(e) The commissioner may require a primary designer and a construction manager at risk, by contract, to cooperate in the design, planning and scheduling, and construction process. The contract must not make the primary designer or construction manager at risk a subcontractor or joint venture partner to the other or limit the primary designer's or construction manager at risk's independent obligations to the commissioner.\n(f) For projects undertaken by the Minnesota State Colleges and Universities system, the powers and duties granted in paragraphs (d) and (e) may be exercised by its board of trustees.\nPlans must be paid for out of money appropriated for the purpose of improving or constructing the building. No part of the balance may be expended until the commissioner has secured suitable plans and specifications, prepared by a competent architect or engineer, and accompanied by a detailed statement of the cost, quality, and description of all material and labor required for the completion of the work. No plan may be adopted, and no improvement made or building constructed by the commissioner or any other agency to whom an appropriation is made for a capital improvement, that contemplates the expenditure for its completion of more money than the appropriation for it, unless otherwise provided in this section or the act making the appropriation. The commissioner or other agency may not direct or permit any expenditure beyond that appropriated, and any agent of the commissioner violating this provision is guilty of a gross misdemeanor.\n(a) Application for aid. The commissioner, or any other agency to whom an appropriation is made for a capital improvement, shall apply for the maximum federal share for each project.\n(b) Acceptance of aid. The commissioner is the state agency empowered to accept money provided for or made available to this state by the United States of America or any federal department or agency for the construction and equipping of any building for state purposes not otherwise provided for by law, other than University of Minnesota buildings, in accordance with the provisions of federal law and any rules or regulations promulgated under federal law. The commissioner may do whatever is required of this state by federal law, rules, and regulations in order to obtain the federal money.\n(c) Federal funds considered part of appropriation. The commissioner may after consultation with the chairs of the senate Finance Committee and house of representatives Ways and Means Committee, adopt a plan, provide for an improvement, or construct a building that contemplates expenditure for its completion of more money than the appropriation for it, if the excess money is provided by the United States government and granted to the state of Minnesota under federal law or any rule or regulation promulgated under federal law. This federal money, for the purpose of this section, is a part of the appropriation for the project.\n(d) Delayed federal money. If an amount is payable to a creditor of the state from a project account which is financed partly with federal money and the project is included in appropriations made to the commissioner for public buildings and equipment, and the amount cannot be paid on time because of a deficiency of money in the project account caused by a delay in the receipt of federal money, the commissioner may provide money needed to pay the amount by temporarily transferring the sum to the project account from any other appropriation made to the commissioner in the same act. Required money for a payment is appropriated for that purpose. When the delayed federal money is received, the commissioner shall have the amount of money transferred returned to the account from which it came.\n(a) Comprehensive use plan; competitions. Notwithstanding any provision of this section to the contrary, plans for proposed new buildings and for features of existing public buildings in the Capitol Area which the Capitol Area Architectural and Planning Board consider to possess architectural significance are subject to sections 15B.03, subdivision 3; 15B.08, subdivision 2; 15B.10; and 15B.15, subdivision 4.\n(b) Approval required. The preparation of plans and specifications for the Capitol Area, as defined in section 15B.02, may not be initiated, contracted for, or conducted without consultation with the Capitol Area Architectural and Planning Board to the extent the plans and specifications involve the public and ceremonial areas and the exterior of the Capitol building and the lobbies, public concourses, and other features of other public buildings in the Capitol Area which the Capitol Area Architectural and Planning Board considers to have architectural significance. The commissioner may not approve or adopt plans or specifications for the Capitol Area unless they have been approved by the Capitol Area Architectural and Planning Board. The Capitol Area Architectural and Planning Board must also be advised of and approve changes in plans and specifications which affect projects within the Capitol Area.\nIf money has been appropriated to the commissioner to acquire lands or sites for public buildings or real estate, the acquisition may be by gift, purchase, or condemnation proceedings. Condemnation proceedings must be under chapter 117.\n(a) The commissioner of administration, in cooperation with the commissioner of management and budget shall:\n(1) establish a state building classification system for state-owned buildings, with each class representing a different quality of building construction, to be incorporated into the capital budget format and instructions; and\n(2) create and maintain an inventory of all major state buildings and office space owned or leased by the state, including a classification system on the condition and suitability of each major building.\n(b) The commissioner of administration shall present to the legislature a supportable cost analysis whenever the commissioner proposes, for the purpose of providing state agency office space, to:\n(1) enter into a lease for more than 50,000 square feet or for more than ten years;\n(2) enter into a lease-purchase agreement or an agreement to lease with option to buy property;\n(3) purchase an existing building; or\n(4) construct a new building.\nNotwithstanding any law to the contrary, the Department of Administration may keep money received from successful litigations by or against the department involving capital improvements to state buildings. Awards made to the state or the department resulting from litigation against or by the department must be kept by the department to the credit of the account or accounts from which the litigation and capital improvement project were originally funded. Awards may be used to pay for litigation costs and the cost to correct the deficiencies which were the subject of the litigation. The department shall report on any awards it receives as part of its biennial budget request.",
	"repealed": false
}