{
	"id": "216A.037",
	"url": "https://www.revisor.mn.gov/statutes/cite/216A.037",
	"title": "216A.037 EX PARTE COMMUNICATIONS; CODE OF CONDUCT; RULES.",
	"text": "(a) The commission shall adopt rules under chapter 14 prescribing permissible and impermissible ex parte communications. The ex parte rules may prohibit only ex parte communications, directly or indirectly, between a commissioner and a participant or party under the commission's rules of practice and procedure relating to:\n(1) a material issue during a pending contested case proceeding;\n(2) a material issue in a rulemaking proceeding after the beginning of commission deliberations;\n(3) a material issue in a disputed formal petition; and\n(4) any other communication impermissible by law.\n(b) The commission may apply ex parte prohibitions, prospectively and after notice to affected parties, to other commission proceedings as the commission deems necessary.\n(c) A contested case is pending from the time the commission refers the matter to the Office of Administrative Hearings until the commission has issued its final order, and the time to petition for reconsideration has expired or the commission has issued an order finally disposing an application for reconsideration, whichever is later.\n(d) Commission staff and consultants that perform environmental review and other activities identified in chapters 216G and 216I are not parties, participants, or decision making personnel, as defined under Minnesota Rules, part 7845.7000.\n[See Note.]\nA commissioner shall not communicate, directly or indirectly, with a person or entity who is a party to a pending proceeding before the commission regarding past or future benefits or compensation to be received from that person or entity. The commission may dismiss a proceeding if an applicant, petitioner, or complainant violates this subdivision.\nExcept as limited by subdivision 1, the commission shall adopt rules prescribing a code of conduct for commissioners and employees of the commission. The code of conduct must include standards to preserve the quasi-judicial function of the commission.\n(a) Any person seeking sanctions for alleged violations of the rules adopted under this section may file a complaint with the commission.\n(b) A complaint seeking sanctions must include the following information: the name and address of the complainant; the name and address of complainant's counsel, if any; the name and address of each person alleged to have violated the ex parte prohibition (respondents); the name and address of each respondent's counsel, if known; the facts constituting the alleged violation; and the sanctions sought by the complainant.\n(c) A complaint filed under this section must be filed with the commission and mailed to each respondent, the department, the Office of the Attorney General, and all persons on the commission's service list for the proceeding.\n(d) Within seven days of service of the complaint, a respondent shall file an answer with the commission and serve it on the complainant, the department, the Office of the Attorney General, and all persons on the commission's service list for the proceeding.\n(e) The commission shall refer the complaint and any reply to the Office of Administrative Hearings.\n(f) The administrative law judge assigned to the ex parte complaint proceeding by the Office of Administrative Hearings shall conduct a hearing investigation and shall issue a report within 30 days after the matter is referred. If the administrative law judge determines that the report cannot be properly completed within that time period, the judge shall report that fact to the commission within the 30-day period and shall file a final report within a reasonable time thereafter, no later than 60 days after the referral to the Office of Administrative Hearings.\n(g) The report of the administrative law judge shall describe the relevant facts of the case and shall set forth the judge's findings as to whether ex parte violations occurred. The findings and decisions of the judge as to whether ex parte violations have occurred are binding on the commission. The judge shall also discuss and make recommendations regarding the imposition of sanctions in accordance with paragraph (h). The judge shall include in the report a discussion of the recusal of any commissioner or the removal of decision-making personnel from this case.\n(h) In the report under paragraph (g), the administrative law judge may only recommend that the commission impose one of the following sanctions if the judge finds that the condition specified for the sanction is met:\n(1) dismiss the proceeding if the prohibited ex parte communication has so prejudiced the proceeding that the commission cannot consider it impartially;\n(2) issue an adverse ruling on a pending issue that is the subject of the prohibited ex parte communication if other parties are prejudiced by the prohibited ex parte communication;\n(3) strike evidence or pleadings if the evidence or pleadings are tainted by the prohibited ex parte communication; or\n(4) issue a public statement of censure, if the prohibited ex parte communication is determined to be part of a continuing pattern of improper ex parte communication or if the prohibited ex parte violation consists of a single prohibited communication and mitigating circumstances exist that:\n(i) negate the need for a more severe sanction;\n(ii) do not prejudice the proceeding to the extent that the commission is unable to consider it impartially;\n(iii) do not prejudice other parties; or\n(iv) do not taint the evidence or pleadings.\n(i) If the administrative law judge finds the complainant's allegation of an ex parte violation was interposed for any improper purpose, such as to harass or cause unnecessary delay or needless increase in the cost of the proceeding, the judge may recommend that the commission issue an appropriate sanction against the complainant.",
	"repealed": false
}