{
	"id": "103I.681",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.681",
	"title": "103I.681 PERMIT FOR UNDERGROUND STORAGE OF GAS OR LIQUID.",
	"text": "(a) The state, a person, partnership, association, private or public corporation, county, municipality, or other political subdivision of the state may not displace groundwater in consolidated or unconsolidated formations by the underground storage of a gas or liquid under pressure without an underground storage permit from the commissioner of natural resources.\n(b) The state, a person, a public corporation, county, municipality, or other political subdivision of the state may not store a gas or liquid, except water, below the natural surface of the ground by using naturally occurring rock materials as a storage reservoir without an underground storage permit from the commissioner of natural resources.\n(a) A person may apply for an underground storage permit by filing an application form with the commissioner of natural resources accompanied by the application fee and maps, plans, and specifications describing the proposed displacement of groundwater and the underground storage of gases or liquids and other data required by the commissioner.\n(b) The commissioner of natural resources shall prescribe the application form to apply for an underground storage permit.\n(c) The commissioner of natural resources may require an applicant to demonstrate to the commissioner that the applicant has adequately provided a method to ensure payment of any damages resulting from the operation of a gas or liquid storage reservoir.\n(a) An underground storage permit allowing displacement of groundwater may not be issued by the commissioner of natural resources without holding a public hearing on the issuance of the permit.\n(b) By 20 days after receiving a complete application, the commissioner of natural resources shall set a time and location for the hearing.\nThe hearing notice must:\n(1) state the date, place, and time of the hearing;\n(2) show the location of groundwater and surface water and property affected by the proposed underground storage;\n(3) be published by the applicant, or by the commissioner of natural resources if the proceeding is initiated by the commissioner of natural resources, once each week for two successive weeks in a legal newspaper that is published in the county where a part or all of the affected groundwater or surface waters are located; and\n(4) be mailed by the commissioner of natural resources to the county auditor and the chief executive official of an affected municipality.\n(a) The hearing must be public and conducted by the commissioner of natural resources or a referee appointed by the commissioner.\n(b) Affected persons must have an opportunity to be heard. Testimony must be taken under oath and the parties must have the right of cross-examination. The commissioner of natural resources shall provide a stenographer, at the expense of the applicant, to take testimony and a record of the testimony, and all proceedings at the hearing shall be taken and preserved.\n(c) The commissioner of natural resources is not bound by judicial rules of evidence or of pleading and procedure.\nThe commissioner of natural resources may subpoena and compel the attendance of witnesses and the production of books and documents material to the purposes of the hearing. Disobedience of a subpoena, or refusal to be sworn, or refusal to answer as a witness, is punishable as contempt in the same manner as a contempt of the district court. The commissioner of natural resources must file a complaint of the disobedience with the district court of the county where the disobedience or refusal occurred.\nAn order granting a permit for the proposed storage may not be issued unless it contains and is based on a finding stating:\n(1) the proposed storage will be confined to geological stratum or strata lying more than 500 feet below the surface of the soil;\n(2) the proposed storage will not substantially impair or pollute groundwater or surface water; and\n(3) the public convenience and necessity of a substantial portion of the gas-consuming public in the state will be served by the proposed project.\nThe order granting the permit must contain conditions and restrictions that will reasonably protect:\n(1) private property or an interest not appropriated;\n(2) the rights of the property owners and owners of an interest in property located within the boundaries of the proposed storage area, or persons claiming under the owners, to explore for, drill for, produce or develop for the recovery of oil or gas or minerals under the property, and to drill wells on the property to develop and produce water; provided that the exploration, drilling, producing, or developing complies with orders and rules of the commissioner of natural resources that protect underground storage strata or formations against pollution and against the escape of gas; and\n(3) public resources of the state that may be adversely affected by the proposed project.\n(a) The commissioner of natural resources shall mail notice of any findings, conclusions, and orders made after the hearing to:\n(1) the applicant;\n(2) parties who entered an appearance at the hearing;\n(3) the county auditor; and\n(4) the chief executive officer of an affected municipality.\n(b) The commissioner of natural resources must publish notice of findings, conclusions, and orders made after the hearing at least once each week for two successive weeks in a legal newspaper in the county where a part or all of the proposed project is located. The costs of the publication must be paid by the applicant.\nAn interested party may appeal the determination of the commissioner of natural resources to the court of appeals in accordance with the provisions of chapter 14.\n(a) The commissioner of natural resources shall adopt a permit fee schedule under chapter 14. The schedule may provide minimum fees for various classes of permits, and additional fees, which may be imposed subsequent to the application, based on the cost of receiving, processing, analyzing, and issuing the permit, and the actual inspecting and monitoring of the activities authorized by the permit, including costs of consulting services.\n(b) A fee may not be imposed on a state or federal governmental agency applying for a permit.\n(c) The fee schedule may provide for the refund of a fee, in whole or in part, under circumstances prescribed by the commissioner of natural resources. Fees received must be deposited in the state treasury and credited to an account in the natural resources fund. Permit fees received are appropriated annually from the natural resources fund to the commissioner of natural resources for the costs of inspecting and monitoring the activities authorized by the permit, including costs of consulting services.",
	"repealed": false
}