{
	"id": "115B.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.39",
	"title": "115B.39 LANDFILL CLEANUP PROGRAM; ESTABLISHMENT.",
	"text": "The landfill cleanup program is established to provide environmental response at qualified facilities and is to be administered by the commissioner.\n(a) In addition to the definitions in this subdivision, the definitions in sections 115A.03 and 115B.02 apply to sections 115B.39 to 115B.445, except as specifically modified in this subdivision.\n(b) \"Cleanup order\" means a consent order between responsible persons and the agency or an order issued by the United States Environmental Protection Agency under section 106 of the federal Superfund Act.\n(c) \"Closure\" means actions to prevent or minimize the threat to public health and the environment posed by a mixed municipal solid waste disposal facility that has stopped accepting waste by controlling the sources of releases or threatened releases at the facility. \"Closure\" includes removing contaminated equipment and liners; applying final cover; grading and seeding final cover; installing wells, borings, and other monitoring devices; constructing groundwater and surface water diversion structures; and installing gas control systems and site security systems, as necessary. The commissioner may authorize use of final cover that includes processed materials that meet the requirements in Code of Federal Regulations, title 40, section 503.32, paragraph (a).\n(d) \"Closure upgrade\" means construction activity that will, at a minimum, modify an existing cover so that it satisfies current rule requirements for mixed municipal solid waste land disposal facilities.\n(e) \"Contingency action\" means organized, planned, or coordinated courses of action to be followed in case of fire, explosion, or release of solid waste, waste by-products, or leachate that could threaten human health or the environment.\n(f) \"Corrective action\" means steps taken to repair facility structures including liners, monitoring wells, separation equipment, covers, and aeration devices and to bring the facility into compliance with design, construction, groundwater, surface water, and air emission standards.\n(g) \"Custodial\" or \"custodial care\" means actions taken for the care, maintenance, and monitoring of closure actions at a mixed municipal solid waste disposal facility after completion of the postclosure period.\n(h) \"Decomposition gases\" means gases produced by chemical or microbial activity during the decomposition of solid waste.\n(i) \"Dump materials\" means nonhazardous mixed municipal solid wastes disposed at a Minnesota waste disposal site other than a qualified facility prior to 1973.\n(j) \"Environmental response action\" means response action at a qualified facility or priority qualified facility, including corrective action, closure, postclosure care; contingency action; environmental studies, including remedial investigations and feasibility studies; engineering, including remedial design; removal; remedial action; site construction; and other similar cleanup-related activities.\n(k) \"Environmental response costs\" means:\n(1) costs of environmental response action, not including legal or administrative expenses; and\n(2) costs required to be paid to the federal government under section 107(a) of the federal Superfund Act, as amended.\n(l) \"Owner or operator of a priority qualified facility\" means a person, personal representative, trustee, beneficiary, partnership, sole proprietorship, firm, limited liability company, cooperative, association, corporation, or other entity that:\n(1) has possession of, holds title to, or owns a controlling interest in a priority qualified facility;\n(2) participates in decision making related to compliance with federal and state environmental laws and regulations for a priority qualified facility; or\n(3) has authority or control to make decisions regarding state and federal environmental laws and regulations for a priority qualified facility.\n(m) \"Priority qualified facility\" means:\n(1) a qualified facility:\n(i) that is listed on the National Priorities List pursuant to the federal Comprehensive Environmental Response, Compensation, and Liability Act;\n(ii) that is listed on the Permanent List of Priorities pursuant to the Minnesota Environmental Response and Liability Act;\n(iii) for which a binding agreement pursuant to section 115B.40, subdivision 4, has not been entered into between the owner or operator of the qualified facility and the commissioner; and\n(iv) that is not an excluded facility pursuant to section 115B.405; and\n(2) property located within 750 feet from the boundary of a facility described in clause (1), including any contiguous property:\n(i) that is listed on the Permanent List of Priorities pursuant to the Minnesota Environmental Response and Liability Act, as of May 31, 2017;\n(ii) where mixed municipal solid waste was disposed of within the boundaries of the property, which disposal did not occur under a permit from the agency; and\n(iii) for which the commissioner determines an environmental response action is necessary to protect public health or welfare or the environment at and in the vicinity of the facility described in clause (1).\n(n) \"Postclosure\" or \"postclosure care\" means actions taken for the care, maintenance, and monitoring of closure actions at a mixed municipal solid waste disposal facility.\n(o) \"Qualified facility\" means a mixed municipal solid waste disposal facility as described in the most recent agency permit, including adjacent property used for solid waste disposal that did not occur under a permit from the agency, that:\n(1)(i) is or was permitted by the agency;\n(ii) stopped accepting solid waste, except demolition debris, for disposal by April 9, 1994; and\n(iii) stopped accepting demolition debris for disposal by June 1, 1994, except that demolition debris may be accepted until May 1, 1995, at a permitted area where disposal of demolition debris is allowed, if the area where the demolition debris is deposited is at least 50 feet from the fill boundary of the area where mixed municipal solid waste was deposited;\n(2) is or was permitted by the agency and\n(i) stopped accepting waste by January 1, 2000, except that demolition debris, industrial waste, and municipal solid waste combustor ash may be accepted until January 1, 2001, at a permitted area where disposal of such waste is allowed, if the area where the waste is deposited is at least 50 feet from the fill boundary of the area where mixed municipal solid waste was deposited; or\n(ii) stopped accepting waste by January 1, 2019, and is located in a county that meets all applicable recycling goals in section 115A.551 and that has arranged for all mixed municipal solid waste generated in the county to be delivered to and processed by a resource recovery facility located in the county for at least 20 years; or\n(3) is or was permitted by the agency and stopped accepting waste for disposal by January 1, 2009, and for which the postclosure care period ended on July 26, 2013.",
	"repealed": false
}