{
	"id": "245.696",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.696",
	"title": "245.696 ADDITIONAL DUTIES OF COMMISSIONER.",
	"text": "A Behavioral Health Division is created in the Department of Human Services. The division shall enforce and coordinate the laws administered by the commissioner of human services, relating to mental illness, which the commissioner assigns to the division. The Behavioral Health Division shall be under the supervision of an assistant commissioner of behavioral health appointed by the commissioner. The commissioner, working with the assistant commissioner of behavioral health, shall oversee and coordinate services to people with mental illness in community programs throughout the state.\nIn addition to the powers and duties already conferred by law, the commissioner of human services shall:\n(1) review and evaluate local programs and the performance of administrative and mental health personnel and make recommendations to county boards and program administrators;\n(2) provide consultative staff service to communities and advocacy groups to assist in ascertaining local needs and in planning and establishing community mental health programs;\n(3) employ qualified personnel to implement this chapter;\n(4) adopt rules for minimum standards in community mental health services as directed by the legislature;\n(5) cooperate with the commissioners of health and employment and economic development to coordinate services and programs for people with mental illness;\n(6) evaluate the needs of people with mental illness as they relate to assistance payments, medical benefits, nursing home care, and other state and federally funded services;\n(7) provide data and other information, as requested, to the Advisory Council on Mental Health;\n(8) develop and maintain a data collection system to provide information on the prevalence of mental illness, the need for specific mental health services and other services needed by people with mental illness, funding sources for those services, and the extent to which state and local areas are meeting the need for services;\n(9) apply for grants and develop pilot programs to test and demonstrate new methods of assessing mental health needs and delivering mental health services;\n(10) study alternative reimbursement systems and make waiver requests that are deemed necessary by the commissioner;\n(11) provide technical assistance to county boards to improve fiscal management and accountability and quality of mental health services, and consult regularly with county boards, public and private mental health agencies, and client advocacy organizations for purposes of implementing this chapter;\n(12) promote coordination between the mental health system and other human service systems in the planning, funding, and delivery of services; entering into cooperative agreements with other state and local agencies for that purpose as deemed necessary by the commissioner;\n(13) conduct research regarding the relative effectiveness of mental health treatment methods as the commissioner deems appropriate, and for this purpose, enter treatment facilities, observe clients, and review records in a manner consistent with the Minnesota Government Data Practices Act, chapter 13;\n(14) enter into contracts and promulgate rules the commissioner deems necessary to carry out the purposes of this chapter; and\n(15) administer county mental health grants on a calendar year basis, unless that procedure hinders the achievement of the purposes of a particular grant.",
	"repealed": false
}