{
	"id": "160.2325",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.2325",
	"title": "160.2325 HIGHWAYS FOR HABITAT PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Integrated roadside vegetation management\" means an approach to right-of-way maintenance that combines a variety of techniques based on sound ecological principles, which establish and maintain safe, healthy, and functional roadsides. Integrated roadside vegetation management includes but is not limited to judicious use of herbicides, spot mowing, biological control, prescribed burning, mechanical tree and brush removal, erosion prevention and treatment, and prevention and treatment of other right-of-way disturbances.\n(c) \"Program\" means the highways for habitat program established in this section.\nThe commissioner must establish a highways for habitat program to enhance roadsides with pollinator and other wildlife habitat and vegetative buffers.\n(a) The commissioner, in consultation with native habitat biologists and ecologists, must develop standards and best management practices for integrated roadside vegetation management under the program.\n(b) The standards and best management practices must, to the extent practicable, include:\n(1) guidance on seed and vegetation selection based on the Board of Water and Soil Resources' native vegetation establishment and enhancement guidelines;\n(2) requirements for roadside vegetation management protocols that avoid the use of pollinator lethal insecticides as defined under section 18H.02, subdivision 28a;\n(3) practices that are designed to avoid habitat destruction and protect nesting birds, pollinators, and other wildlife, except as necessary to control noxious weeds as provided under section 160.23; and\n(4) identification of appropriate right-of-way tracts for wildflower and native habitat establishment.\n(a) By January 15 of each odd-numbered year, the commissioner must submit a performance report on the program to the chairs and ranking minority members of the legislative committees having jurisdiction over transportation policy and finance. At a minimum, the report must include:\n(1) information that details the department's progress on implementing the highways for habitat program;\n(2) a fiscal review that identifies expenditures under the program; and\n(3) an investment plan for each district of the department for the next biennium.\n(b) The performance report must be reviewed by the department's chief engineer.\n(c) This subdivision expires December 31, 2033.",
	"repealed": false
}