{
	"id": "297A.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.67",
	"title": "297A.67 GENERAL EXEMPTIONS.",
	"text": "The gross receipts from the sale and purchase of, and storage, distribution, use, or consumption of the items contained in this section are specifically exempted from the taxes imposed by this chapter.\nExcept as otherwise provided in this subdivision, food and food ingredients are exempt. For purposes of this subdivision, \"food\" and \"food ingredients\" mean substances, whether in liquid, concentrated, solid, frozen, dried, or dehydrated form, that are sold for ingestion or chewing by humans and are consumed for their taste or nutritional value. Food and food ingredients exempt under this subdivision do not include candy, soft drinks, dietary supplements, and prepared foods. Food and food ingredients do not include alcoholic beverages, tobacco, taxable cannabis products, medical cannabis flower, and medical cannabinoid products. For purposes of this subdivision, \"alcoholic beverages\" means beverages that are suitable for human consumption and contain one-half of one percent or more of alcohol by volume. For purposes of this subdivision, \"tobacco\" means cigarettes, cigars, chewing or pipe tobacco, or any other item that contains tobacco. For purposes of this subdivision, \"taxable cannabis product\" has the meaning given in section 295.81, subdivision 1, paragraph (r), \"medical cannabis flower\" has the meaning given in section 342.01, subdivision 54, and \"medical cannabinoid product\" has the meaning given in section 342.01, subdivision 52. For purposes of this subdivision, \"dietary supplements\" means any product, other than tobacco, intended to supplement the diet that:\n(1) contains one or more of the following dietary ingredients:\n(i) a vitamin;\n(ii) a mineral;\n(iii) an herb or other botanical;\n(iv) an amino acid;\n(v) a dietary substance for use by humans to supplement the diet by increasing the total dietary intake; and\n(vi) a concentrate, metabolite, constituent, extract, or combination of any ingredient described in items (i) to (v);\n(2) is intended for ingestion in tablet, capsule, powder, softgel, gelcap, or liquid form, or if not intended for ingestion in such form, is not represented as conventional food and is not represented for use as a sole item of a meal or of the diet; and\n(3) is required to be labeled as a dietary supplement, identifiable by the supplement facts box found on the label and as required pursuant to Code of Federal Regulations, title 21, section 101.36.\nTangible personal property purchased with Supplemental Nutrition Assistance Program (SNAP) benefits, coupons, or vouchers issued by the federal government under the SNAP is exempt. This exemption also applies to food purchased under the Special Supplemental Food Program for Women, Infants, and Children. The exemption provided by this subdivision is effective and applies only to the extent required by federal law.\nPrepared food, candy, and soft drinks served to patients, inmates, or persons residing at hospitals, sanitariums, nursing homes, senior citizen homes, and correctional, detention, and detoxification facilities are exempt. Taxable food sold through vending machines is not exempt.\nPrepared food, candy, and soft drinks served at public and private elementary, middle, or secondary schools as defined in section 120A.05 are exempt. Prepared food, candy, and soft drinks served to students at a college, university, or private career school under a board contract are exempt. Taxable food sold through vending machines is not exempt.\n(a) Prepared food, candy, and soft drinks purchased for and served exclusively to individuals who are 60 years of age or over and their spouses or to persons with a disability and their spouses by governmental agencies, nonprofit organizations, or churches, or pursuant to any program funded in whole or in part through United States Code, title 42, sections 3001 through 3045, wherever delivered, prepared, or served, are exempt. Taxable food sold through vending machines is not exempt.\n(b) Prepared food, candy, and soft drinks purchased for and served exclusively to children who are less than 14 years of age or children with a disability who are less than 16 years of age and who are attending a child care or early childhood education program, are exempt if they are:\n(1) purchased by a nonprofit child care facility that is exempt under section 297A.70, subdivision 4, and that primarily serves families with income of 250 percent or less of federal poverty guidelines; and\n(2) prepared at the site of the child care facility.\n(a) Sales of the following drugs and medical devices for human use are exempt:\n(1) drugs, including over-the-counter drugs;\n(2) single-use finger-pricking devices for the extraction of blood and other single-use devices and single-use diagnostic agents used in diagnosing, monitoring, or treating diabetes;\n(3) insulin and medical oxygen for human use, regardless of whether prescribed or sold over the counter;\n(4) prosthetic devices;\n(5) durable medical equipment for home use only;\n(6) mobility enhancing equipment;\n(7) prescription corrective eyeglasses; and\n(8) kidney dialysis equipment, including repair and replacement parts.\n(b) Items purchased in transactions covered by:\n(1) Medicare as defined under title XVIII of the Social Security Act, United States Code, title 42, section 1395, et seq.; or\n(2) Medicaid as defined under title XIX of the Social Security Act, United States Code, title 42, section 1396, et seq.\n(c) For purposes of this subdivision:\n(1) \"Drug\" means a compound, substance, or preparation, and any component of a compound, substance, or preparation, other than food and food ingredients, dietary supplements, taxable cannabis products as defined under section 295.81, subdivision 1, paragraph (r), or alcoholic beverages that is:\n(i) recognized in the official United States Pharmacopoeia, official Homeopathic Pharmacopoeia of the United States, or official National Formulary, and supplement to any of them;\n(ii) intended for use in the diagnosis, cure, mitigation, treatment, or prevention of disease; or\n(iii) intended to affect the structure or any function of the body.\n(2) \"Durable medical equipment\" means equipment, including repair and replacement parts, including single-patient use items, but not including mobility enhancing equipment, that:\n(i) can withstand repeated use;\n(ii) is primarily and customarily used to serve a medical purpose;\n(iii) generally is not useful to a person in the absence of illness or injury; and\n(iv) is not worn in or on the body.\nFor purposes of this clause, \"repair and replacement parts\" includes all components or attachments used in conjunction with the durable medical equipment, including repair and replacement parts which are for single patient use only.\n(3) \"Mobility enhancing equipment\" means equipment, including repair and replacement parts, but not including durable medical equipment, that:\n(i) is primarily and customarily used to provide or increase the ability to move from one place to another and that is appropriate for use either in a home or a motor vehicle;\n(ii) is not generally used by persons with normal mobility; and\n(iii) does not include any motor vehicle or equipment on a motor vehicle normally provided by a motor vehicle manufacturer.\n(4) \"Over-the-counter drug\" means a drug that contains a label that identifies the product as a drug as required by Code of Federal Regulations, title 21, section 201.66. The label must include a \"drug facts\" panel or a statement of the active ingredients with a list of those ingredients contained in the compound, substance, or preparation. Over-the-counter drugs do not include grooming and hygiene products, regardless of whether they otherwise meet the definition. \"Grooming and hygiene products\" are soaps, cleaning solutions, shampoo, toothpaste, mouthwash, antiperspirants, and suntan lotions and sunscreens.\n(5) \"Prescribed\" and \"prescription\" means a direction in the form of an order, formula, or recipe issued in any form of oral, written, electronic, or other means of transmission by a duly licensed health care professional.\n(6) \"Prosthetic device\" means a replacement, corrective, or supportive device, including repair and replacement parts, worn on or in the body to:\n(i) artificially replace a missing portion of the body;\n(ii) prevent or correct physical deformity or malfunction; or\n(iii) support a weak or deformed portion of the body.\nProsthetic device does not include corrective eyeglasses.\n(7) \"Kidney dialysis equipment\" means equipment that:\n(i) is used to remove waste products that build up in the blood when the kidneys are not able to do so on their own; and\n(ii) can withstand repeated use, including multiple use by a single patient, notwithstanding the provisions of clause (2).\n(8) A transaction is covered by Medicare or Medicaid if any portion of the cost of the item purchased in the transaction is paid for or reimbursed by the federal government or the state of Minnesota pursuant to the Medicare or Medicaid program, by a private insurance company administering the Medicare or Medicaid program on behalf of the federal government or the state of Minnesota, or by a managed care organization for the benefit of a patient enrolled in a prepaid program that furnishes medical services in lieu of conventional Medicare or Medicaid coverage pursuant to agreement with the federal government or the state of Minnesota.\nAccessories and supplies required for the effective use of durable medical equipment for home use only or purchased in a transaction covered by Medicare or Medicaid, that are not already exempt under subdivision 7, are exempt. Accessories and supplies for the effective use of a prosthetic device, that are not already exempt under subdivision 7, are exempt. For purposes of this subdivision \"durable medical equipment,\" \"prosthetic device,\" \"Medicare,\" and \"Medicaid\" have the definitions given in subdivision 7.\n(a) Clothing is exempt. For purposes of this subdivision, \"clothing\" means all human wearing apparel suitable for general use.\n(b) Clothing includes, but is not limited to, aprons, household and shop; athletic supporters; baby receiving blankets; bathing suits and caps; beach capes and coats; belts and suspenders; boots; coats and jackets; costumes; children and adult diapers, including disposable; ear muffs; footlets; formal wear; garters and garter belts; girdles; gloves and mittens for general use; hats and caps; hosiery; insoles for shoes; lab coats; neckties; overshoes; pantyhose; rainwear; rubber pants; sandals; scarves; shoes and shoe laces; slippers; sneakers; socks and stockings; steel-toed boots; underwear; uniforms, athletic and nonathletic; and wedding apparel.\n(c) Clothing does not include the following:\n(1) belt buckles sold separately;\n(2) costume masks sold separately;\n(3) patches and emblems sold separately;\n(4) sewing equipment and supplies, including but not limited to, knitting needles, patterns, pins, scissors, sewing machines, sewing needles, tape measures, and thimbles;\n(5) sewing materials that become part of clothing, including but not limited to, buttons, fabric, lace, thread, yarn, and zippers;\n(6) clothing accessories or equipment;\n(7) sports or recreational equipment;\n(8) protective equipment; and\n(9) fur clothing as defined in section 297A.61, subdivision 46.\nFor purposes of this subdivision, \"clothing accessories or equipment\" means incidental items worn on the person or in conjunction with clothing. Clothing accessories and equipment include, but are not limited to, briefcases; cosmetics; hair notions, including barrettes, hair bows, and hairnets; handbags; handkerchiefs; jewelry; nonprescription sunglasses; umbrellas; wallets; watches; and wigs and hairpieces. \"Sports or recreational equipment\" means items designed for human use and worn in conjunction with an athletic or recreational activity that are not suitable for general use. Sports and recreational equipment includes, but is not limited to, ballet and tap shoes; cleated or spiked athletic shoes; gloves, including, but not limited to, baseball, bowling, boxing, hockey, and golf gloves; goggles; hand and elbow guards; life preservers and vests; mouth guards; roller and ice skates; shin guards; shoulder pads; ski boots; waders; and wetsuits and fins. \"Protective equipment\" means items for human wear and designed as protection of the wearer against injury or disease or as protection against damage or injury of other persons or property but not suitable for general use. Protective equipment includes, but is not limited to, breathing masks; clean room apparel and equipment; ear and hearing protectors; face shields; finger guards; hard hats; helmets; paint or dust respirators; protective gloves; safety glasses and goggles; safety belts; tool belts; and welders gloves and masks.\nBreast pumps, baby bottles and nipples, pacifiers, teething rings, and infant syringes are exempt.\nCaskets and burial vaults for human burial are exempt.\nAutomobiles or other conveyances are exempt if the purchaser is assisted by a grant from the United States in accordance with United States Code, title 38, section 3902.\nParts, accessories, and labor charges that are used solely to modify a motor vehicle to make it accessible to persons with a disability are exempt.\nTextbooks, including digital books, that are prescribed for use in conjunction with a course of study in a school, college, university, and private career school to students who are regularly enrolled at such institutions are exempt. For purposes of this subdivision (1) a \"school\" is as defined in section 120A.22, subdivision 4; and (2) \"private career school\" means a school licensed under section 136A.822.\nInstructional materials, other than textbooks, that are prescribed for use in conjunction with a course of study in a postsecondary school, college, university, or private career school to students who are regularly enrolled at such institutions are exempt. For purposes of this subdivision, \"instructional materials\" means materials required to be used directly in the completion of the course of study, including, but not limited to, interactive CDs, tapes, digital audio works, digital audiovisual works, and computer software.\nInstructional materials do not include general reference works or other items incidental to the instructional process such as pens, pencils, paper, folders, or computers. For purposes of this subdivision, \"school\" and \"private career school\" have the meanings given in subdivision 13.\nComputers and related computer software sold by a school, college, university, or private career school to students who are enrolled at the institutions are exempt if:\n(1) the use of the computer, or of a substantially similar model of computer, and the related computer software is prescribed by the institution in conjunction with a course of study; and\n(2) each student of the institution, or of a unit of the institution in which the student is enrolled, is required by the institution to have such a computer and related software as a condition of enrollment.\nFor the purposes of this subdivision, \"school\" and \"private career school\" have the meanings given in subdivision 13.\nResidential heating fuels are exempt as follows:\n(1) all fuel oil, coal, wood, steam, hot water, propane gas, and L.P. gas sold to residential customers for residential use;\n(2) for the billing months of November, December, January, February, March, and April, natural gas sold for residential use to customers who are metered and billed as residential users and who use natural gas for their primary source of residential heat; and\n(3) for the billing months of November, December, January, February, March, and April, electricity sold for residential use to customers who are metered and billed as residential users and who use electricity for their primary source of residential heat.\nWater services for residential use are exempt regardless of how the services are billed.\nSanitary napkins, tampons, or similar items used for feminine hygiene are exempt.\nUsed motor oils are exempt.\nCross-country ski passes issued under sections 85.40 to 85.43 are exempt.\nManufactured homes, as defined in section 327.31, subdivision 6, to be used by the purchaser for residential purposes are exempt, unless the sale is the first retail sale of the manufactured home in this state.\nA purchase subject to use tax under section 297A.63 is exempt if (1) the purchase is made by an individual for personal use, and (2) the total purchases that are subject to the use tax do not exceed $770 in the calendar year. For purposes of this subdivision, \"personal use\" includes purchases for gifts. If an individual makes purchases subject to use tax of more than $770 in the calendar year, the individual must pay the use tax on the entire amount. This exemption does not apply to purchases made from retailers who are required or registered to collect taxes under this chapter.\n[Repealed, 2008 c 154 art 12 s 41]\nIsolated and occasional sales in Minnesota not made in the normal course of business of selling that kind of property or service are exempt. The storage, use, or consumption of property or services acquired as a result of such a sale is exempt. This exemption does not apply to sales of tangible personal property primarily used in a trade or business.\n[Repealed, 2009 c 88 art 8 s 5]\nLawn care and related services used in the maintenance of cemetery grounds are exempt. For purposes of this subdivision, \"lawn care and related services\" means the services listed in section 297A.61, subdivision 3, paragraph (g), clause (6), item (vi), and \"cemetery\" means a cemetery for human burial.\nThe amount allowed as a credit against the sales price for tangible personal property taken in trade for resale is exempt.\nSewing materials are exempt. For purposes of this subdivision \"sewing materials\" mean fabric, thread, zippers, interfacing, buttons, trim, and other items that are usually directly incorporated into the construction of clothing, as defined in subdivision 8, regardless of whether it is actually used for making clothing. It does not include batting, foam, or fabric specifically manufactured for arts and craft projects, or other materials for craft projects.\nThe following sales to or use by an ambulance service licensed under section 144E.10 are exempt:\n(1) supplies and equipment used to provide medical care; and\n(2) repair and replacement parts for ambulances and vehicles equipped and specifically intended for emergency response.\nA solar energy system, as defined in section 216C.06, subdivision 17, is exempt.\nMotor vehicles taxable under the provisions of chapter 297B are exempt.\nThe loan of a vehicle by a motor vehicle dealer to a customer as a replacement for a vehicle being serviced or repaired is exempt if the vehicle is loaned pursuant to a warranty included in the original purchase price of the vehicle being serviced or repaired.\nCigarettes upon which a tax has been imposed under section 297F.25 are exempt.\nThe charge for a live or prerecorded presentation, such as a lecture, seminar, workshop, or course, where participants access the presentation as a digital audio work or digital audiovisual work, and are connected to the presentation via the Internet, telecommunications equipment, or other device that transfers the presentation electronically, is exempt if:\n(1) participants and the presenter, during the time that participants access the presentation, are able to give, receive, and discuss the presentation with each other, although the amount of interaction and when in the presentation the interaction occurs may be limited by the presenter; and\n(2) for those presentations where participants are given the option to attend the same presentation in person:\n(i) any limitations on the amount of interaction and when it occurs during the presentation are the same for those participants accessing the presentation electronically as those attending in person; and\n(ii) the admission to the in-person presentation is not subject to tax under this chapter.\n(a) Precious metal bullion is exempt. For purposes of this subdivision, \"precious metal bullion\" means bars or rounds that consist of 99.9 percent or more by weight of either gold, silver, platinum, or palladium and are marked with weight, purity, and content.\n(b) The exemption under this subdivision does not apply to sales and purchases of jewelry, works of art, or scrap metal.\n(c) The intent of this subdivision is to eliminate the difference in tax treatment between the sale of precious metal bullion and the sale of stock, bullion ETFs, bonds, and other investment instruments.\nThe sale of the privilege of admission under section 297A.61, subdivision 3, paragraph (g), clause (1), to a place of amusement or athletic event does not include consideration paid for a license to use a private suite, private skybox, or private box seat, and the sale of the license is exempt provided that: (1) the lessee may use the private suite, private skybox, or private box seat by mutual arrangement with the lessor on days when there is no amusement or athletic event; and (2) the sales price for the privilege of admission is equal to or greater than the highest priced general admission ticket for the closest seat not in the private suite, private skybox, or private box seat.\nThe sale of the privilege of admission under section 297A.61, subdivision 3, paragraph (g), clause (1), does not include consideration paid for a stadium builder's license authorized under section 473J.15, subdivision 14, and the sale of the license is exempt.\n(a) Purchases of herbicides authorized for use pursuant to an invasive aquatic plant management permit as defined under section 103G.615 are exempt if purchased by:\n(1) a lakeshore property owner;\n(2) an association of lakeshore property owners organized under chapter 317A; or\n(3) a contractor hired by a lakeshore owner or association to provide invasive aquatic plant management under the permit.\n(b) For purposes of this subdivision, \"herbicides\" means a substance or mixture of substances intended for use as a plant regulator, defoliant, or desiccant that are:\n(1) labeled for use in water;\n(2) registered for use in this state by the Department of Agriculture under section 18B.26; and\n(3) listed as one of the herbicides proposed for use on the invasive aquatic plant management permit.\nThe sale of a right to purchase the privilege of admission to a college or university athletic event in a preferred viewing location for a season of a particular athletic event is exempt provided that:\n(1) the consideration paid for the right to purchase is used entirely to support student scholarships, wellness, and academic costs; and\n(2) the admission price is equal to or greater than the highest priced general admission ticket for the closest seat not in the preferred viewing location.\nThe sale of a taxable cannabis product, as defined in section 295.81, subdivision 1, paragraph (r), that is made on Tribally regulated land as defined in section 3.9228, subdivision 1, by a cannabis business licensed by a Minnesota Tribal government, as defined in section 3.9228, subdivision 1, paragraph (f), is exempt.\n(a) Secure firearm storage units are exempt. For the purposes of this subdivision:\n(1) \"secure firearm storage unit\" means a container that is fully enclosed and locked by a padlock, keylock, combination lock, or similar locking device, and is either specifically designed for the safe storage of firearms or sold for that purpose by a federally licensed firearms dealer; and\n(2) \"firearm\" has the meaning provided in section 97A.015, subdivision 19.\n(b) The seller of a secure firearm storage unit must neither collect, nor transmit to any private or public entity, any personal data of or information about a purchaser resulting from a sale eligible for the exemption under this subdivision.",
	"repealed": false
}