{
	"id": "572B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/572B.07",
	"title": "572B.07 MOTION TO COMPEL OR STAY ARBITRATION.",
	"text": "(a) On motion of a person showing an agreement to arbitrate and alleging another person's refusal to arbitrate pursuant to the agreement, the court shall order the parties to arbitrate if the refusing party does not appear or does not oppose the motion. If the refusing party opposes the motion, the court shall proceed summarily to decide the issue. Unless the court finds that there is no enforceable agreement to arbitrate, it shall order the parties to arbitrate. If the court finds that there is no enforceable agreement, it may not order the parties to arbitrate.\n(b) On motion of a person alleging that an arbitration proceeding has been initiated or threatened but that there is no agreement to arbitrate, the court shall proceed summarily to decide the issue. If the court finds that there is an enforceable agreement to arbitrate, it shall order the parties to arbitrate. If the court finds that there is no enforceable agreement, it may not order the parties to arbitrate.\n(c) The court may not refuse to order arbitration because the claim subject to arbitration lacks merit or grounds for the claim have not been established.\n(d) If a proceeding involving a claim referable to arbitration under an alleged agreement to arbitrate is pending in court, a motion under this section must be filed in that court. Otherwise, a motion under this section may be filed in any court as required by section 572B.27.\n(e) If a party files a motion with the court to order arbitration under this section, the court shall on just terms stay any judicial proceeding that involves a claim alleged to be subject to the arbitration until the court renders a final decision under this section.\n(f) If the court orders arbitration, the court shall on just terms stay any judicial proceeding that involves a claim subject to the arbitration. If a claim subject to the arbitration is severable, the court may sever it and limit the stay to that claim.",
	"repealed": false
}