{
	"id": "308B.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.311",
	"title": "308B.311 AGRICULTURAL PRODUCT MARKETING CONTRACTS.",
	"text": "A cooperative and its patron member or patron may make and execute a marketing contract, requiring the patron member or patron to sell a specified portion of the patron member's or patron's agricultural product or specified commodity produced from a certain area exclusively to or through the cooperative or facility established by the cooperative.\nIf a sale is contracted to the cooperative, the sale shall transfer title to the product absolutely, except for a recorded lien or security interest against the agricultural products of the patron member or patron in the state central notification system and liens granted against farm products under federal law, to the cooperative on delivery of the product or at another specified time if expressly provided in the contract. The contract may allow the cooperative to sell or resell the product of its patron member or patron with or without taking title to the product, and pay the resale price to the patron member or patron, after deducting all necessary selling, overhead, and other costs and expenses, including other proper reserves and interest.\nA single term of a marketing contract shall not exceed ten years, but a marketing contract may be made self-renewing for periods not exceeding five years each, subject to the right of either party to terminate by giving written notice of the termination during a period of the current term as specified in the contract.\nThe bylaws or the marketing contract, or both, may set a specific sum as liquidated damages to be paid by the patron member or patron to the cooperative for breach of any provision of the marketing contract regarding the sale or delivery or withholding of a product and may provide that the member or patron shall pay the costs, premiums for bonds, expenses, and fees if an action is brought on the contract by the cooperative. The remedies for breach of contract are valid and enforceable in the courts of this state. The provisions shall be enforced as liquidated damages and are not considered a penalty.\nIf there is a breach or threatened breach of a marketing contract by a patron member or patron, the cooperative is entitled to an injunction to prevent the further breach of the contract and to a decree of specific performance of the contract. Pending the adjudication of the action after filing a complaint showing the breach or threatened breach and filing a sufficient bond, the cooperative is entitled to a temporary restraining order and preliminary injunction against the patron member or patron.\nAny person who knowingly induces or attempts to induce any patron member or patron of a cooperative organized under this chapter to breach a marketing contract with the cooperative, or who maliciously and knowingly spreads false reports about the cooperative's finances or management, is guilty of a misdemeanor and subject to a fine of not less than $100, and not more than $1,000, for each such offense.\nIn addition to the penalty provided in subdivision 6, the person may be liable to the cooperative for civil damages for any violation of subdivision 6. Each violation shall constitute a separate offense.",
	"repealed": false
}