{
	"id": "201.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.161",
	"title": "201.161 AUTOMATIC VOTER REGISTRATION.",
	"text": "(a) Except as otherwise provided in this section, an individual must be registered to vote if the individual is eligible to vote under section 201.014 and properly completes and submits one of the following applications, if the application includes documentation or verification of United States citizenship or records reflect that the applicant provided proof of citizenship during a previous agency transaction:\n(1) an application for a new or renewed Minnesota driver's license or identification card;\n(2) an initial or renewal application for MinnesotaCare under chapter 256L or medical assistance under chapter 256B; or\n(3) an application for benefits or services to a state agency participating under subdivision 5.\n(b) If a registered voter supplies a different name or address as part of an application under this subdivision from the name and address in the voter registration record, the registrant's voter registration record must be updated to reflect the name or address information provided.\nUpon receipt of the registration information, the county auditor must queue for mailing in the statewide voter registration system a notice to the individual that provides an opportunity to decline the registration. The secretary of state must promptly mail all notices queued in the statewide voter registration system. An individual must not be registered if the individual declines to be registered within 20 days of the date of the mailing of the notice under this section. An otherwise eligible individual who declines to register must be offered a new registration opportunity with each qualifying application submitted under subdivision 1. The notice must be drafted to ensure maximum language access consistent with maintaining readability, and at a minimum must identify a website where the materials are made available in the ten most common languages for which translation is needed by voters.\n(a) The commissioner of public safety, in consultation with the secretary of state, must change the applications for an original, duplicate, or change of address driver's license or identification card so that any forms where applicants may provide documentation of United States citizenship contain spaces for all information required to register to vote, as prescribed by the secretary of state. Unless the applicant has provided an address other than the applicant's address of residence under section 171.12, subdivision 7, paragraph (d), the commissioner must transmit the information daily by electronic means to the secretary of state. Pursuant to the Help America Vote Act of 2002, Public Law 107-252, the computerized driver's license record containing the voter's name, address, date of birth, citizenship, driver's license number or state identification number, county, and city or town must be made available for access by the secretary of state and interaction with the statewide voter registration system. The commissioner must submit data to the secretary of state identifying the total number of individuals that completed qualifying transactions under this section and the total number of individuals whose records were ultimately transferred for registration. At a minimum, the commissioner must submit the data to the secretary of state on the same day each month. The secretary of state must publish a monthly report of this data.\n(b) An applicant's information must not be transmitted to the secretary of state under this section unless the applicant provides documentation of United States citizenship or records maintained by the Department of Public Safety indicate that the applicant provided documentation demonstrating United States citizenship as part of a previous license or identification card transaction. If the applicant does not provide or has not previously provided documentation of United States citizenship, the commissioner must provide information during the transaction regarding voter registration and eligibility criteria. If the applicant provides documentation during the transaction indicating that the applicant is not a United States citizen, the applicant's information must not be transmitted to the secretary of state and the applicant must not be offered a voter registration opportunity.\n(c) No applicant may be registered to vote under this subdivision until:\n(1) the commissioner of public safety has certified that the department's systems have been tested and can accurately provide the required data and accurately exclude from transmission data on individuals who have not provided documentary evidence of United States citizenship; and\n(2) the secretary of state has certified that the system for automatic registration of those applicants has been tested and is capable of properly determining whether an applicant is eligible to submit a voter registration application.\nThe department's systems must be tested and accurately provide the necessary data no later than December 1, 2023.\n(d) For purposes of this section, \"driver's license\" includes any instruction permit, provisional license, limited license, restricted license, or operator's permit issuable by the commissioner of public safety under chapter 171.\n(a) If permitted by the federal government, the commissioner of human services, in consultation with the secretary of state, must ensure the applications described in subdivision 1, paragraph (a), clause (2), also serve as voter registration applications for applicants 18 years of age or older whose United States citizenship has been verified as part of the application. The commissioner must transmit information required to register to vote, as prescribed by the secretary of state, daily by electronic means to the secretary of state for an individual whose United States citizenship has been verified. The commissioner must submit data to the secretary of state identifying the total number of individuals who completed qualifying transactions under this section and the total number of individuals whose records were ultimately transferred for registration. At a minimum, the commissioner must submit the data to the secretary of state on the same day each month.\n(b) No applicant may be registered to vote under this subdivision until (1) the commissioner of human services has certified that the department's systems have been tested and can accurately provide the required data and accurately exclude from transmission data on individuals who have not provided documentary evidence of United States citizenship, and (2) the secretary of state has certified that the system for automatic registration of those applicants has been tested and is capable of properly determining whether an applicant is eligible to vote. The department's systems must be tested and accurately provide the necessary data no later than September 30 of the year following the year in which federal approval or permission is given, contingent on appropriations being available for this purpose.\n(a) The commissioner of management and budget must, in consultation with the secretary of state, identify any other state agency that is eligible to implement automatic voter registration. The commissioner must consider a state agency eligible if the agency collects, processes, or stores the following information as part of providing assistance or services: name, residential address, date of birth, and citizenship verification. An eligible agency must submit a report to the governor and secretary of state no later than December 1, 2024, describing steps needed to implement automatic voter registration, barriers to implementation and ways to mitigate them, and applicable federal and state privacy protections for the data under consideration. By June 1, 2025, the governor, at the governor's sole discretion, must make final decisions, as to which agencies will implement automatic voter registration by December 31, 2025, and which agencies could implement automatic voter registration if provided with additional resources or if the legislature changed the law to allow data to be used for automatic voter registration. The governor must notify the commissioner of management and budget of the governor's decisions related to automatic voter registration. By October 1, 2025, the commissioner of management and budget must report to the chairs and ranking minority members of the legislative committees with jurisdiction over election policy and finance. The report must include:\n(1) the agencies that will implement automatic voter registration by December 31, 2025;\n(2) the agencies which could implement automatic voter registration if provided with additional resources and recommendations on the necessary additional resources; and\n(3) the agencies that could implement automatic voter registration if the legislature changed the law to allow data to be used for voter registration and recommendations on how the law could be changed to allow the use of the data for this purpose.\n(b) An agency may not begin verifying citizenship as part of an agency transaction for the sole purpose of providing automatic voter registration. Once an agency has implemented automatic voter registration, it must continue to provide automatic voter registration unless otherwise expressly required by law. For each individual whose United States citizenship has been verified, the commissioner or agency head must transmit information required to register to vote, as prescribed by the secretary of state, to the secretary of state by electronic means. The governor must determine the frequency of the transmissions for each agency.\n(c) No applicant may be registered to vote under this subdivision until (1) the agency's commissioner or agency head has certified that the necessary systems have been tested and can accurately provide the required data and accurately exclude from transmission data on individuals whose United States citizenship has not been verified, and (2) the secretary of state has certified that the system for automatic registration of those applicants has been tested and is capable of properly determining whether an applicant is eligible to vote.\n(a) The secretary of state must compare all application information submitted under this section with the information received under section 201.145 to determine whether an applicant is eligible to vote. If an applicant appears on the list of individuals who are ineligible to vote, the secretary of state must not process the application further and must not share the applicant's information with the county for registration. For applicants who do not appear to be ineligible to vote, the secretary of state must determine whether the applicant whose information is submitted under this section is currently registered in the statewide voter registration system.\n(b) If the applicant is not currently registered in the statewide voter registration system, the secretary of state must transmit the registration daily by electronic means to the county auditor of the county where the voter resides.\n(c) Any data regarding applicants who the secretary determines are not eligible to vote are private data on individuals, as defined in section 13.02, subdivision 12.\n(d) The county auditor must cancel the voter's record in the statewide voter registration system upon receipt of a written request, signed by the voter, that the registration be removed.\nThe transfer of an individual's record under this section does not constitute an attempt to register to vote or a completion of a voter registration form by that individual. If such a registration is processed by the state, it is presumed to have been officially authorized by the state. This subdivision does not apply to an individual who knowingly and willfully makes a false statement to effectuate voter registration or who intentionally takes voluntary action to register to vote or vote knowing of the individual's ineligibility to vote.\nUnless the applicant declines registration, the effective date is the date that the county auditor processes the application. This subdivision does not limit the ability of a person to register to vote on election day as provided in section 201.061, subdivision 3. Any person who submits a qualifying application under subdivision 1 that is dated during the 20 days before an election must be provided, at the time of application, with a notice advising the applicant of the procedures to register to vote on election day.",
	"repealed": false
}