{
	"id": "270C.726",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.726",
	"title": "270C.726 POSTING OF TAX DELINQUENCY; SALE OF CANNABIS.",
	"text": "(a) Pursuant to the authority to disclose under section 270B.12, subdivision 4a, the commissioner shall, by the 15th of each month, submit to the Office of Cannabis Management a list of all taxpayers subject to the tax imposed by section 295.81 that are required to pay, withhold, or collect the tax imposed by section 290.02, 290.0922, 290.92, 290.9727, 290.9728, 290.9729, 295.81, or 297A.62; or a local sales and use tax payable to, or administered and collected by, the commissioner, and who are ten days or more delinquent in either filing a tax return or paying the tax.\n(b) The commissioner is under no obligation to list a taxpayer whose business is inactive. At least ten days before notifying the Office of Cannabis Management, the commissioner shall notify the taxpayer of the intended action.\n(c) The Office of Cannabis Management shall post the list required by this section on the Office of Cannabis Management website. The list must prominently show the date of posting. If a previously listed taxpayer files all returns and pays all taxes specified in this subdivision then due, the commissioner shall notify the Office of Cannabis Management within two business days.\nBeginning the third business day after the list is posted, no cannabis cultivator, cannabis manufacturer, cannabis microbusiness, cannabis mezzobusiness, medical cannabis combination business, cannabis wholesaler, or industrial hemp grower as defined in chapter 342 may sell or deliver any product to a taxpayer included on the posted list.\nA cannabis cultivator, cannabis manufacturer, cannabis microbusiness, cannabis mezzobusiness, medical cannabis combination business, cannabis wholesaler, or industrial hemp grower as defined in chapter 342 who violates subdivision 2 is subject to the penalties provided in sections 342.19 and 342.21.",
	"repealed": false
}