{
	"id": "352.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.041",
	"title": "352.041 LEAVE OF ABSENCE FOR EMPLOYMENT BY POLITICAL SUBDIVISION.",
	"text": "(a) An employee covered by the general state employees retirement plan who is given a leave of absence for employment by a political subdivision of the state remains a member of the plan and must continue to pay member contributions into the general state employees retirement fund for the period of leave.\n(b) Upon payment of member contributions, the employee must be given allowable service credit as a state employee on the records of the retirement plan as though the employee had received salary from the state during the leave. Payments into the retirement fund must be at the rate required in section 352.04, subdivision 2, and must be based upon the salary received from the political subdivision.\nThe officer or employee who is authorized by law to pay salaries to employees of the political subdivision which is employing a state employee must deduct employee contributions for the general state employees retirement plan under section 352.04, subdivision 2, from the salary of each employee who is on leave of absence from state service on each payroll abstract and must pay the sum to the director following the conclusion of each pay period.\nThe officer or employee who is authorized by law to pay salaries to employees of the political subdivision which is employing a state employee covered by the general state employees retirement plan also must have employer contributions made to the general state employees retirement fund following the conclusion of each payroll abstract in the amount required by section 352.04, subdivision 3. These contributions must be charged to the political subdivision as an administrative cost.\n[Repealed, 1963 c 383 s 59]\n(a) Every political subdivision which is employing a state employee covered by the system on leave of absence from state service for employment by a political subdivision of the state must pay into the general state employees retirement fund the amount of the employer contribution required by law for state employees covered by the system under section 352.04, subdivision 3.\n(b) Employing political subdivisions other than school districts may levy taxes necessary for the payment of employer contributions without limitation as to rate or amount. The levy of the taxes does not reduce the amount of other taxes that may be levied by political subdivisions other than school districts which are subject to any limitation.\n[Repealed, 1983 c 128 s 36]\n[Repealed, 1963 c 383 s 59]",
	"repealed": false
}