{
	"id": "256R.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.04",
	"title": "256R.04 PROHIBITED PRACTICES.",
	"text": "A nursing facility is not eligible to receive medical assistance payments unless it refrains from all of the following:\n(1) charging, soliciting, accepting, or receiving from an applicant for admission to the facility, or from anyone acting on behalf of the applicant, as a condition of admission, expediting the admission, or as a requirement for the individual's continued stay, any fee, deposit, gift, money, donation, or other consideration not otherwise required as payment under the Medicaid state plan;\n(2) requiring an individual, or anyone acting on behalf of the individual, to loan any money to the nursing facility;\n(3) requiring an individual, or anyone acting on behalf of the individual, to promise to leave all or part of the individual's estate to the facility; or\n(4) requiring a third-party guarantee of payment to the facility as a condition of admission, expedited admission, or continued stay in the facility.\nNothing in this subdivision prohibits discharge for nonpayment of services in accordance with state and federal regulations.\n(a) A nursing facility is not eligible to receive medical assistance payments unless it refrains from requiring any resident of the nursing facility to utilize a vendor of health care services chosen by the nursing facility.\n(b) A nursing facility may require a resident to use pharmacies that utilize unit dose packing systems approved by the Minnesota Board of Pharmacy, and may require a resident to use pharmacies that are able to meet the federal regulations for safe and timely administration of medications such as systems with specific number of doses, prompt delivery of medications, or access to medications on a 24-hour basis. Notwithstanding the provisions of this subdivision, nursing facilities shall not restrict a resident's choice of pharmacy because the pharmacy utilizes a specific system of unit dose drug packing.\nA nursing facility is not eligible to receive medical assistance payments unless it refrains from providing differential treatment on the basis of status with regard to public assistance.\nA nursing facility is not eligible to receive medical assistance payments unless it refrains from discriminating in admissions, services offered, or room assignment on the basis of status with regard to public assistance or refusal to purchase special services. Admissions discrimination shall include, but is not limited to:\n(1) basing admissions decisions upon assurance by the applicant to the nursing facility, or the applicant's guardian or conservator, that the applicant is neither eligible for nor will seek public assistance for payment of nursing facility care costs; and\n(2) engaging in preferential selection from waiting lists based on an applicant's ability to pay privately or an applicant's refusal to pay for a special service.\nThe collection and use by a nursing facility of financial information of any applicant pursuant to a preadmission screening program established by law shall not raise an inference that the nursing facility is utilizing that information for any purpose prohibited by this subdivision.\nA nursing facility is not eligible to receive medical assistance payments unless it refrains from requiring any vendor of medical care as defined by section 256B.02, subdivision 7, who is reimbursed by medical assistance under a separate fee schedule, to pay any amount based on utilization or service levels or any portion of the vendor's fee to the nursing facility except as payment for renting or leasing space or equipment or purchasing support services from the nursing facility as limited by section 256R.54. All agreements must be disclosed to the commissioner upon request of the commissioner. Nursing facilities and vendors of ancillary services that are found to be in violation of this subdivision shall each be subject to an action by the state of Minnesota or any of its subdivisions or agencies for treble civil damages on the portion of the fee in excess of that allowed by this subdivision and section 256R.54. Damages awarded must include three times the excess payments together with costs and disbursements including reasonable attorney fees or their equivalent.\nA nursing facility is not eligible to receive medical assistance payments unless it refrains from refusing, for more than 24 hours, to accept a resident returning to the same bed or a bed certified for the same level of care, in accordance with a physician's order authorizing transfer, after receiving inpatient hospital services.\nFor a period not to exceed 180 days, the commissioner may continue to make medical assistance payments to a nursing facility which is in violation of this section if extreme hardship to the residents would result. In these cases the commissioner shall issue an order requiring the nursing facility to correct the violation. The nursing facility shall have 20 days from its receipt of the order to correct the violation. If the violation is not corrected within the 20-day period the commissioner may reduce the payment rate to the nursing facility by up to 20 percent. The amount of the payment rate reduction shall be related to the severity of the violation and shall remain in effect until the violation is corrected. The nursing facility may appeal the commissioner's action pursuant to the provisions of chapter 14 pertaining to contested cases. An appeal shall be considered timely if written notice of appeal is received by the commissioner within 20 days of notice of the commissioner's proposed action.\nIn the event that the commissioner determines that, due to a violation of this section, a nursing facility is not eligible for reimbursement for a resident who is eligible for medical assistance, the commissioner may authorize the nursing facility to receive reimbursement on a temporary basis until the resident can be relocated to a participating nursing facility.",
	"repealed": false
}