{
	"id": "383A.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.75",
	"title": "383A.75 JOINT PROPERTY TAX ADVISORY COMMITTEE.",
	"text": "There is created the joint property tax advisory committee.\nThe membership of the committee consists of the mayor and up to three members of the city council of the city of St. Paul; the county manager and up to three members of the county board of Ramsey County; and the superintendent and up to three members of the Board of Education of Independent School District No. 625. The chair of the Ramsey County league of local governments shall be a nonvoting ex officio member. The committee shall be convened by the mayor of St. Paul, and at the first meeting, the chair for the first year must be determined by lot, and thereafter, the chair must annually rotate among the mayor or designee, the superintendent or designee, and the county manager or designee.\nThe committee is authorized to and shall meet from time to time to make appropriate recommendations for the efficient and effective use of property tax dollars raised by the jurisdictions for programs, buildings, and operations. In addition, the committee shall:\n(1) identify trends and factors likely to be driving budget outcomes over the next five years with recommendations for how the jurisdictions should manage those trends and factors to increase efficiency and effectiveness;\n(2) agree, by October 1 of each year, on the appropriate level of overall property tax levy for the three jurisdictions and publicly report such to the governing bodies of each jurisdiction for ratification or modification by resolution; and\n(3) identify, by December 31 of each year, areas of the budget to be targeted in the coming year for joint review to improve services or achieve efficiencies.\nIn carrying out its duties, the committee shall consult with public employees of each jurisdiction and with other stakeholders of the city, county, and school district, as appropriate.\nThe committee must be staffed by employees as designated by each jurisdiction. The committee may also seek public or private funding from any source to assist its work and may utilize volunteer help as appropriate.\nThe committee may use public or private funding to recognize or reward efforts by local government employees to restructure service delivery to improve efficiency or achieve cost savings.",
	"repealed": false
}