{
	"id": "355.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/355.02",
	"title": "355.02 AGREEMENTS.",
	"text": "(a) The director, with the approval of the governor, is hereby authorized to enter into an agreement on behalf of the state, its political subdivisions, and its other governmental employers, with the federal Secretary of Health and Human Services, consistent with the terms and provisions of this chapter, for the purpose of extending the benefits of the federal old age, survivors, and disability insurance system to employees of the state or any political subdivision thereof who hold positions covered by a retirement system with respect to services specified in the agreement which constitute \"employment.\"\n(b) The agreement may contain those provisions relating to coverage, benefits, contributions, effective date, modification and termination of the agreement, administration, and other appropriate provisions as the director and the federal Secretary of Health and Human Services shall agree upon, but, except as may be otherwise required by or under the Social Security Act as to the services to be covered, such agreement must provide in effect that:\n(1) benefits will be provided for employees whose services are covered by the agreement (and their dependents and survivors) on the same basis as though those services constituted employment within the meaning of title II of the Social Security Act;\n(2) the state or other employer will pay to the federal Secretary of the Treasury, at such time or times as may be prescribed under the Social Security Act, contributions with respect to wages, equal to the sum of the taxes which would be imposed by the Federal Insurance Contributions Act if the services covered by the agreement constituted employment within the meaning of that act;\n(3) the agreement is effective with respect to services in employment covered by the agreement performed after a date specified therein; and\n(4) all services which constitute employment and are performed in the employ of the state or any of its political subdivisions by employees thereof, may be covered by the agreement.\n(a) Any instrumentality jointly created by this state and any other state or states is authorized, upon the granting of like authority by the other state or states, to:\n(1) enter into an agreement with the federal Secretary of Health and Human Services whereby the benefits of the federal old age, survivors, and disability insurance system are extended to employees of the instrumentality;\n(2) require its employees to pay (and for that purpose to deduct from their wages) contributions equal to the amounts which they would be required to pay under section 355.03, subdivision 1, if they were covered by an agreement made under subdivision 1; and\n(3) make payments to the federal secretary of the treasury in accordance with that agreement, including payments from its own funds, and otherwise to comply with those agreements.\n(b) The agreements must, to the extent practicable, be consistent with the terms and provisions of subdivision 1 and other provisions of this chapter.\n(a) The following groups having coverage under a retirement plan in section 356.30, subdivision 3, except clauses (4) and (7) must be covered by an agreement or a modification to an agreement between the director and the federal Secretary of Health and Human Services:\n(1) constitutional officers;\n(2) Duluth teachers;\n(3) educational employees;\n(4) higher education employees;\n(5) hospital employees;\n(6) judges;\n(7) legislators;\n(8) Minneapolis teachers;\n(9) public employees;\n(10) St. Paul teachers; and\n(11) state employees.\n(b) The following groups must be covered prospectively following the referendum in subdivision 4 and the modification to the state Social Security agreement under subdivision 1:\n(1) special authority or district employees in positions covered by a retirement plan provided by the employer; and\n(2) local elected officials of a local governmental subdivision or of a special authority or district holding positions covered by the defined contribution plan under chapter 353D.\n(c) Each local governmental subdivision or special authority or district desiring inclusion in the state Social Security agreement for groups covered by paragraph (b) must request such coverage by submitting a formal resolution to the director, including therein the desired starting date for Social Security coverage.\n(d) For purposes of paragraph (b), clause (2), the defined contribution plan of the Public Employees Retirement Association is considered a separate retirement system with respect to each local governmental subdivision or special authority or district, and the elected officials in a local governmental subdivision or in a special authority or district must be treated separately and independently from the other governmental subdivisions.\nThe director shall authorize and supervise a referendum under section 218(d)(6)(C) of the Social Security Act to be held on the date or dates set by the local governmental subdivision or by the special authority or district desiring inclusion under subdivision 3, paragraph (b). The referendum must permit each eligible employee the opportunity to elect Social Security coverage. The notice of referendum required by section 218(d) of the Social Security Act must contain a statement sufficient to inform the person of the rights which accrue under the Social Security Act and the employee contribution rates applicable to the program. The cost of the referendum must be borne by the governmental subdivision. The director, on receiving satisfactory evidence that the conditions required by section 218 of the Social Security Act have been met, must so certify to the Secretary of Health and Human Services.\nAn employee or elected official who elects Social Security coverage under subdivision 4 may obtain retroactive coverage for the period specified in the modification of the agreement if the individual is employed by the local governmental subdivision or by the special authority or district on the date of the modification of the agreement. The employee or elected official must pay an amount equal to the taxes which would have been imposed on the person by the Federal Insurance Contributions Act had the service been covered at the time performed. The employing local governmental subdivision or special authority or district must pay the necessary employer contributions for the retroactive period. Nothing in this section requires an employee or elected official to elect retroactive Social Security coverage.",
	"repealed": false
}