{
	"id": "270C.9901",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.9901",
	"title": "270C.9901 ASSESSOR ACCREDITATION; WAIVER.",
	"text": "Every individual who appraises or physically inspects real property for the purpose of determining its valuation or classification for property tax purposes must obtain licensure as an accredited Minnesota assessor from the State Board of Assessors by July 1, 2022, or within five years of that person having become licensed as a certified Minnesota assessor, whichever is later.\n(a) An individual may apply to the State Board of Assessors for a waiver from licensure as an accredited Minnesota assessor as required by subdivision 1 if the individual:\n(1) was first licensed as a certified Minnesota assessor before July 1, 2004;\n(2) has had an assessor license since July 1, 2004;\n(3) has successfully passed a comprehensive examination substantially equivalent to the requirements by the State Board of Assessors for the accredited Minnesota assessor license designation before May 1, 2020; and\n(4) submits an application to the State Board of Assessors no later than July 1, 2022.\nThe examination can only be taken once to fulfill the requirements of the waiver.\n(b) The commissioner of revenue, in consultation with the State Board of Assessors and the Minnesota Association of Assessing Officers, must determine the contents of the waiver application and the comprehensive examination.\n(c) A county assessor in any jurisdiction assessed by an applicant may submit additional information to the State Board of Assessors to be considered as part of the waiver review proceedings.\n(d) The State Board of Assessors must not grant a waiver unless the applicant has met the requirements in paragraph (a) and has the ability to perform the duties of assessment required in each jurisdiction in which the applicant appraises or physically inspects real property for the purposes of determining its valuation or classification for property tax purposes.\n(e) An individual granted a waiver under this subdivision is allowed to continue assessment duties at the individual's licensure level, provided the individual complies with the continuing education requirements for the accredited Minnesota assessor designation as prescribed by the State Board of Assessors.\n(f) An individual granted a waiver under this section:\n(1) is not considered to have achieved the designation as an accredited Minnesota assessor and may not represent himself or herself as an accredited Minnesota assessor; and\n(2) is not authorized to value income-producing property as defined in section 273.11, subdivision 13, unless the individual meets the requirements of that section.\n(g) A waiver granted by the State Board of Assessors under this section remains in effect unless the individual's licensure is revoked. If the individual's licensure is revoked, the waiver is void and the individual is subject to the requirements of subdivision 1.\n(h) A decision of the State Board of Assessors to grant or deny a waiver under this subdivision is final and is not subject to appeal.\n(i) Waivers granted under this subdivision expire on June 30, 2032.\n(j) This subdivision expires July 1, 2032.",
	"repealed": false
}