{
	"id": "117.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/117.041",
	"title": "117.041 ENTRY FOR SURVEY OR ENVIRONMENTAL TESTING.",
	"text": "For the purpose of making surveys and examinations relative to any proceedings under this chapter, it shall be lawful to enter upon any land, doing no unnecessary damage.\n(a) A state agency by order of the commissioner or a political subdivision by resolution may enter property for purposes of investigation, monitoring, testing, surveying, boring, or other similar activities necessary or appropriate to identify the existence and extent of a release or threat of release of a hazardous substance, pollutant, or contaminant if:\n(1) the state agency or political subdivision has reason to believe that acquisition of the property may be required pursuant to eminent domain proceedings;\n(2) the state agency or political subdivision has reason to believe that a hazardous substance, pollutant, or contaminant is present on the property or the release of a hazardous substance, pollutant, or contaminant may have occurred or is likely to occur on the property; and\n(3) entry on the property for environmental testing is rationally related to health, safety, or welfare concerns of the state agency or political subdivision in connection with possible eminent domain proceedings.\n(b) At least ten days before entering the property, the state agency or political subdivision must serve notice on the property owner requesting permission to enter the property, stating the approximate time and purpose of the entry, and giving the owner the option of refusing entry. The notice shall also give the owner the option of requesting an equal amount of any sample or portion taken from the property and a copy of any data obtained or report issued. If the property owner refuses to consent to the entry, the state agency or political subdivision must apply for a court order authorizing the entry and the removal of any sample or portion from the property, giving notice of the court order to the property owner. The court shall issue an order if the state agency or political subdivision meets the standards in paragraph (a). Notices under this paragraph must be served in the same manner as a summons in a civil action.\n(c) The state agency or political subdivision must do no unnecessary damage to the property and shall restore the property to substantially the same condition in which it was found. If the state agency or political subdivision removes a sample or portion of the property for investigation, monitoring, or testing, or obtains any data or issues any report, it must give the property owner an equal amount of the sample or portion and a copy of any data or report, if requested by the property owner, and must permit the property owner to perform independent investigation, monitoring, or testing of the sample or portion.\n(d) The results of testing performed under paragraph (a) must be included in any environmental assessment worksheet or environmental impact statement that the state agency or political subdivision is required to prepare under chapter 116D.\n(a) A state agency by order of the commissioner or a political subdivision by resolution may enter property for purposes of investigation, monitoring, testing, surveying, boring, or other similar activities necessary or appropriate to perform geotechnical investigations.\n(b) At least ten days before entering the property, the state agency or political subdivision must serve notice on the property owner requesting permission to enter the property, stating the approximate time and purpose of the entry, and giving the owner the option of refusing entry. If the property owner refuses to consent to the entry, the state agency or political subdivision must apply for a court order authorizing the entry and the removal of any sample or portion from the property, giving notice of the court order to the property owner. The court shall issue an order if the state agency or political subdivision meets the standards in paragraph (a). Notices under this paragraph must be served in the same manner as a summons in a civil action.\n(c) The state agency or political subdivision must not cause any unnecessary damage to the property and must compensate the property owner for any damages actually incurred as a result of the geotechnical investigations.",
	"repealed": false
}