{
	"id": "97A.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.045",
	"title": "97A.045 COMMISSIONER; GENERAL POWERS AND DUTIES.",
	"text": "(a) The commissioner shall do all things the commissioner determines are necessary to preserve, protect, and propagate desirable species of wild animals. The commissioner shall make special provisions for the management of fish and wildlife to ensure recreational opportunities for anglers and hunters. The commissioner shall acquire wild animals for breeding or stocking and may dispose of or destroy undesirable or predatory wild animals and their dens, nests, houses, or dams.\n(b) Notwithstanding chapters 17 and 35, the commissioner, in consultation with the commissioner of agriculture and the executive director of the Board of Animal Health, may capture or control nonnative or domestic animals that are released, have escaped, or are otherwise running at large and causing damage to natural resources or agricultural lands, or that are posing a threat to wildlife, domestic animals, or human health. The commissioner may work with other agencies to assist in the capture or control and may authorize persons to take such animals.\n(a) The commissioner may protect a species of wild animal in addition to the protection provided by the game and fish laws, by further limiting or closing seasons or areas of the state, or by reducing limits in areas of the state, if the commissioner determines the action is necessary to prevent unnecessary depletion or extinction, or to promote the propagation and reproduction of the animal.\n(b) The commissioner may protect a species of wild animal in the state by emergency rule adopted under section 84.027, subdivision 13, by prohibiting or allowing taking of the animal whether or not the animal is protected under the game and fish laws. The commissioner must make findings of the necessity of a rule authorized under this paragraph and may authorize taking by special permit with or without fee under conditions prescribed in the rule by the commissioner.\n(c) The commissioner may protect a species of wild animal in the state by emergency rule adopted under section 84.027, subdivision 13, by allowing importation, transportation, or possession of the wild animal or prohibiting these activities except by special permit with or without fee under conditions prescribed in the rule by the commissioner.\nIf the statutory opening date of a season for taking protected wild animals, except a season prescribed under federal regulations, is not on a Saturday, the commissioner may designate the nearest Saturday to the statutory date as the opening day of the season. If the statutory closing date falls on a Saturday, the commissioner may extend it through the following day.\nThe commissioner may regulate the taking, possession, and transportation of wild animals from state and international boundary waters. The rules may include:\n(1) special seasons for taking fish; and\n(2) restrictions on the limits of fish that may be taken, possessed, or transported from international boundary waters by a person possessing both a Minnesota angling license and an angling license from an adjacent Canadian province.\n(a) Except as provided in paragraph (b), the commissioner may prescribe the form of permits, licenses, and tags issued under the game and fish laws.\n(b) The commissioner must offer an applicant for an angling, trapping, or hunting license, including a special permit issued under section 97A.401, the option of receiving the license in either a paper or paperless format and must provide an applicant with a paperless license unless the applicant requests a paper license. This paragraph applies to both annual and lifetime licenses. The commissioner must ensure that a person authorized to issue an annual license described in this paragraph has the ability to issue paperless licenses.\n[See Note.]\nThe commissioner shall collect, compile, publish, and disseminate statistics, bulletins, and information related to conservation.\n(a) The commissioner shall encourage the purchase of:\n(1) Minnesota migratory-waterfowl stamps by nonhunters interested in migratory waterfowl preservation and habitat development;\n(2) pheasant stamps by persons interested in pheasant habitat improvement;\n(3) trout-and-salmon stamps by persons interested in trout and salmon stream and lake improvement;\n(4) turkey stamps by persons interested in stamp collecting; and\n(5) walleye stamps by persons interested in walleye stocking and stamp collecting.\n(b) The commissioner shall make rules governing contests for selecting a design for each stamp, including those stamps not required to be in possession while taking game or fish. The commissioner shall ensure that stamp design and characteristics are consistent with the design and characteristics that are sought by pictorial-stamp collectors.\n[Repealed, 2012 c 277 art 1 s 91]\nIn addition to notice requirements under chapter 14, the commissioner shall attempt to notify persons or groups of persons affected by rules adopted under the game and fish laws by public announcements, press releases, and other appropriate means as determined by the commissioner.\n(a) The commissioner may enter into reciprocal agreements with game and fish authorities in other states and the United States government to provide for:\n(1) revocation of the appropriate Minnesota game and fish licenses of Minnesota residents for violations of game and fish laws committed in signatory jurisdictions that result in license revocation in that jurisdiction;\n(2) reporting convictions and license revocations of residents of signatory states for violations of game and fish laws of Minnesota to game and fish authorities in the nonresident's state of residence; and\n(3) release upon signature without posting of bail for residents of signatory states accused of game and fish law violations in this state, providing for recovery, in the resident jurisdiction, of fines levied if the citation is not answered in this state.\n(b) As used in this subdivision, \"conviction\" includes a plea of guilty or a forfeiture of bail.\n(a) If the commissioner determines that action is necessary to prevent or control a wildlife disease, the commissioner may prevent or control wildlife disease in a species of wild animal in addition to the protection provided by the game and fish laws by further limiting, closing, expanding, or opening seasons or areas of the state; by reducing or increasing limits in areas of the state; by establishing disease management zones; by authorizing free licenses; by allowing shooting from motor vehicles by persons designated by the commissioner; by issuing replacement licenses for sick animals; by requiring sample collection from hunter-harvested animals; by limiting wild animal possession, transportation, and disposition; and by restricting wildlife feeding.\n(b) The commissioner shall restrict wildlife feeding within the modified accredited bovine tuberculosis zone proposed by the Board of Animal Health. In addition to any other penalties provided by law, a person who violates wildlife feeding restrictions required under this paragraph may not obtain a hunting license to take a wild animal for two years after the date of conviction.\n(c) The commissioner may prevent or control wildlife disease in a species of wild animal in the state by posting restrictions on public access to active disease areas or by emergency rule adopted under section 84.027, subdivision 13.\nNotwithstanding section 16A.1283, the commissioner may, by written order published in the State Register, establish fees providing for the use of state wildlife management area or aquatic management area lands for specific purposes, including dog trials, special events, and commercial uses. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n[Repealed, 2012 c 277 art 1 s 91]",
	"repealed": false
}