{
	"id": "469.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.056",
	"title": "469.056 EMPLOYEES; CONTRACTS; AUDITS.",
	"text": "A port authority may employ or contract for the engineering, legal, technical, clerical, stenographic, accounting, and other assistance it considers advisable. An employee of a port authority under this chapter is an \"employee\" under section 355.01, subdivision 2e, and by appropriate action of the port authority is entitled to benefits under that section.\nA port authority may contract to erect, repair, maintain or operate docks, warehouses, terminals, elevators, or other structures on or in connection with property it owns or controls. The authority may contract or arrange with the federal government, or any of its departments, with persons, public corporations, the state, or any of its political subdivisions, commissions, or agencies, for separate or joint action, on any matter related to using the authority's powers or doing its duties. The authority may contract to purchase and sell real and personal property. An obligation or expense must not be incurred unless existing appropriations together with the reasonably expected revenue of the port authority from other sources are sufficient to discharge the obligation or pay the expense when due. The state and its municipal subdivisions are not liable on the obligations. Notwithstanding section 16A.695, for leases or management contracts entered into with respect to property acquired or bettered with the proceeds of state general obligation bonds: (1) a seaway port authority may meet its obligations and expenses of operating and reinvest in capital improvements by retaining revenues received under the leases or management contracts and is not required to pay lease or management contract revenues to the commissioner of management and budget; and (2) the lease or management contract entered into by a seaway port authority must not be canceled or terminated as a result of changes or termination by the state in the governmental program of the seaway port authority unless compensation is paid as provided by law.\nA seaway port authority may employ a certified public accountant to annually examine and audit its books. The report of the exam and audit must be sent to the state auditor. The state auditor shall review the report and may accept it or in the public interest examine the books further.\nAt the request of the city or upon the auditor's initiative, the state auditor may make a legal compliance examination of the authority for that city. Each authority examined must pay the total cost of the examination, including the salaries paid to the examiners while actually engaged in making the examination. The state auditor may bill monthly or at the completion of the audit. All collections received must be deposited in the general fund.\nThe financial statements of the authority must be prepared, audited, filed, and published or posted in the manner required for the financial statements of the city that established the authority. The financial statements must permit comparison and reconciliation with the city's accounts and financial reports. The report must be filed with the state auditor by June 30 of each year. The auditor shall review the report and may accept it or, in the public interest, audit the books of the authority.",
	"repealed": false
}