{
	"id": "197.775",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.775",
	"title": "197.775 HIGHER EDUCATION FAIRNESS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of veterans affairs.\n(c) \"State college or university\" means a unit of the University of Minnesota or Minnesota State Colleges and Universities.\n(d) \"Veteran\" includes the definition provided in section 197.447, and also includes any person serving in active service, as defined in section 190.05, subdivision 5.\n(a) Minnesota State Colleges and Universities must recognize courses and award educational credits for courses that were part of a veteran's military training or service if the courses meet the standards of the American Council on Education or equivalent standards for awarding academic credits. In recognizing courses and awarding educational credits, consideration must be given to academic skills developed in all aspects of the training or service course curriculum, and may not be limited solely to the physical fitness or activity components of the course.\n(b) The University of Minnesota and private colleges and universities in Minnesota are encouraged to recognize courses and award educational credits for courses that were part of a veteran's military training or service if the courses meet the standards of the American Council on Education or equivalent standards for awarding academic credits. In recognizing courses and awarding educational credits, the University of Minnesota and private colleges and universities in Minnesota are encouraged to consider academic skills developed in all aspects of the training or service course curriculum, and not limit consideration solely to the physical fitness or activity components of the course.\n(a) With the policy in this subdivision, the state recognizes veterans' selfless sacrifices in service to our nation, and their varied and specialized military education and training, as well as the need for their timely and meaningful reintegration into civilian society. The state also recognizes the special value of veterans in furthering the goal of creating a diverse student population in the state's postsecondary institutions.\n(b) Minnesota State Colleges and Universities must adopt a policy recognizing, for applicants who are veterans, the applicant's veteran status as a positive factor in determining whether to grant admission to a graduate or professional academic degree program. The Board of Trustees must report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over higher education policy and finance annually by February 15 on the number of veterans who apply for a graduate or professional academic degree program and the number accepted.\n(c) The University of Minnesota, and private colleges and universities in Minnesota, are encouraged to adopt a policy recognizing, for applicants who are veterans, the applicant's veteran status as a positive factor in determining whether to grant admission to an undergraduate, graduate, or professional academic degree program.\nA state college or university must treat a veteran as a Minnesota resident for purposes of determining the veteran's undergraduate tuition rate. A state college or university must treat a veteran as a Minnesota resident for purposes of determining the veteran's graduate school tuition rate if the veteran was a Minnesota resident on entering military service and starts attending the state college or university graduate program within two years of completing military service.\nA state college or university may not assess late fees or other late charges for veterans who are eligible to receive federal or state educational assistance and who have applied for that assistance but not yet received it, nor may they prevent these students from registering for a subsequent term because of outstanding tuition charges that arise from delayed federal or state payments. The state college or university may request without delay the amount of tuition above expected federal and state educational assistance and may require payment of the full amount of tuition owed by the veteran within 30 days of receipt of the expected federal or state educational assistance.",
	"repealed": false
}