{
	"id": "103I.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.205",
	"title": "103I.205 WELL CONSTRUCTION.",
	"text": "(a) Except as provided in paragraph (d), a person may not construct a water-supply, dewatering, or environmental well until a notification of the proposed well on a form prescribed by the commissioner is filed with the commissioner with the filing fee in section 103I.208, and, when applicable, the person has met the requirements of paragraph (e). If after filing the well notification an attempt to construct a well is unsuccessful, a new notification is not required unless the information relating to the successful well has substantially changed. A notification is not required prior to construction of a temporary boring.\n(b) The property owner, the property owner's agent, or the licensed contractor where a well is to be located must file the well notification with the commissioner.\n(c) The well notification under this subdivision preempts local permits and notifications, and counties or home rule charter or statutory cities may not require a permit or notification for wells unless the commissioner has delegated the permitting or notification authority under section 103I.111.\n(d) A person who is an individual that constructs a drive point water-supply well on property owned or leased by the individual for farming or agricultural purposes or as the individual's place of abode must notify the commissioner of the installation and location of the well. The person must complete the notification form prescribed by the commissioner and mail it to the commissioner by ten days after the well is completed. A fee may not be charged for the notification. A person who sells drive point wells at retail must provide buyers with notification forms and informational materials including requirements regarding wells, their location, construction, and disclosure. The commissioner must provide the notification forms and informational materials to the sellers.\n(e) When the operation of a well will require an appropriation permit from the commissioner of natural resources, a person may not begin construction of the well until the person submits the following information to the commissioner of natural resources:\n(1) the location of the well;\n(2) the formation or aquifer that will serve as the water source;\n(3) the maximum daily, seasonal, and annual pumpage rates and volumes that will be requested in the appropriation permit; and\n(4) other information requested by the commissioner of natural resources that is necessary to conduct the preliminary assessment required under section 103G.287, subdivision 1, paragraph (c).\nThe person may begin construction after receiving preliminary approval from the commissioner of natural resources.\nThe commissioner may adopt rules that modify the procedures for filing a well notification or well or boring permit if conditions occur that:\n(1) endanger the public health and welfare or cause a need to protect the groundwater; or\n(2) require the environmental well contractor, limited well/boring contractor, or well contractor to begin constructing a well or boring before obtaining a permit or notification.\n(a) Except as provided under paragraph (b), a well that is not in use must be sealed or have a maintenance permit.\n(b) If an environmental well or a dewatering well is not sealed by 14 months after completion of construction, the owner of the property on which the well is located must obtain and annually renew a maintenance permit from the commissioner.\n(a) Except as provided in paragraph (b), (c), (d), or (e), section 103I.401, subdivision 2, or 103I.601, subdivision 2, a person may not drill, construct, repair, or seal a well or boring unless the person has a well contractor's license in possession.\n(b) A person may construct, repair, and seal an environmental well or temporary boring if the person:\n(1) is a professional engineer licensed under sections 326.02 to 326.15 in the branches of civil or geological engineering;\n(2) is a hydrologist or hydrogeologist certified by the American Institute of Hydrology;\n(3) is a professional geoscientist licensed under sections 326.02 to 326.15;\n(4) is a geologist certified by the American Institute of Professional Geologists; or\n(5) meets the qualifications established by the commissioner in rule.\nA person must be licensed by the commissioner as an environmental well contractor on forms provided by the commissioner.\n(c) A person may do the following work with a limited well/boring contractor's license in possession. A separate license is required for each of the four activities:\n(1) installing, repairing, and modifying well screens, pitless units and pitless adaptors, well pumps and pumping equipment, and well casings from the pitless adaptor or pitless unit to the upper termination of the well casing;\n(2) sealing wells and borings;\n(3) constructing, repairing, and sealing dewatering wells; or\n(4) constructing, repairing, and sealing bored geothermal heat exchangers.\n(d) A person may construct, repair, and seal an elevator boring with an elevator boring contractor's license.\n(e) Notwithstanding other provisions of this chapter requiring a license, a license is not required for a person who complies with the other provisions of this chapter if the person is:\n(1) an individual who constructs a water-supply well on land that is owned or leased by the individual and is used by the individual for farming or agricultural purposes or as the individual's place of abode; or\n(2) an individual who performs labor or services for a contractor licensed under the provisions of this chapter in connection with the construction, sealing, or repair of a well or boring at the direction and under the personal supervision of a contractor licensed under the provisions of this chapter.\nAt-grade environmental wells are authorized without variance and may be installed for the purpose of evaluating groundwater conditions or for use as a leak detection device. An at-grade environmental well must be installed in accordance with the rules of the commissioner. The at-grade environmental wells must be installed with an impermeable double locking cap approved by the commissioner and must be labeled environmental or monitoring wells.\n(a) A person may not place, construct, or install an actual or potential source of contamination, building, gas pipe, liquid propane tank, or electric line any closer to a well or boring than the isolation distances prescribed by the commissioner by rule unless a variance has been prescribed by rule.\n(b) The commissioner shall establish by rule reduced isolation distances for facilities which have safeguards in accordance with sections 18B.01, subdivision 26, and 18C.005, subdivision 29.\nAfter a well has been constructed, the person constructing the well must attach a label to the well showing the unique well number.\nA person may not construct or have constructed a well for the person's own use on the property of another until the owner of the property on which the well is to be located and the intended well user sign a written agreement that identifies which party will be responsible for obtaining all permits or filing notification, paying applicable fees and for sealing the well. If the property owner refuses to sign the agreement, the intended well user may, in lieu of a written agreement, state in writing to the commissioner that the well user will be responsible for obtaining permits, filing notification, paying applicable fees, and sealing the well. Nothing in this subdivision eliminates the responsibilities of the property owner under this chapter, or allows a person to construct a well on the property of another without consent or other legal authority.\nWithin 60 days after completion or sealing of a well or boring, the person doing the work must submit a verified report to the commissioner containing the information specified by rules adopted under this chapter.\nWithin 30 days after receiving the report, the commissioner shall send or otherwise provide access to a copy of the report to the commissioner of natural resources, to the local soil and water conservation district where the well is located, and to the director of the Minnesota Geological Survey.",
	"repealed": false
}