{
	"id": "89A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/89A.01",
	"title": "89A.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following terms, for the purpose of this chapter, have the meanings given.\n\"Advisory committee\" means the Forest Resources Research Advisory Committee established under section 89A.08.\n\"Biological diversity\" means the variety and abundance of species, their genetic composition, and the communities and landscapes in which they occur, including the ecological structures, functions, and processes occurring at all of these levels.\n\"Commissioner\" means the commissioner of natural resources or agent of the commissioner.\n\"Council\" means the Minnesota Forest Resources Council established by section 89A.03.\n\"Department\" means the Department of Natural Resources.\n\"Forest resources\" has the meaning given in section 89.001, subdivision 8.\n\"Guidelines\" means the comprehensive timber harvesting and forest management guidelines developed under section 89A.05.\n\"Landscape\" means a heterogeneous land area composed of interacting sustainable forest resources that are defined by natural features and socially defined attributes.\n\"Landscape-level\" means typically long-term or broad-based efforts that may require extensive analysis or planning over large areas that may involve or require coordination across land ownerships.\n\"Peer review\" means a scientifically based review conducted by individuals with substantial knowledge and experience in the subject matter.\n\"Regional committee\" means a regional forest resources committee established under section 89A.06.\n\"Site-level\" means efforts affecting operational procedures used in the planning and implementation of timber harvesting and forest management activities on an individual site or local scale.\n\"Sustainable\" means meeting the needs of the present without compromising the ability of future generations to meet their own needs.",
	"repealed": false
}