{
	"id": "60C.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/60C.11",
	"title": "60C.11 EFFECT OF PAID CLAIMS.",
	"text": "The rights under the policy of a person recovering under this chapter shall be deemed to have been assigned by the person to the association to the extent of the recovery.\nEvery insured or claimant seeking the protection of this chapter shall cooperate with the association to the same extent as the insured would have been required to cooperate with the insurer.\nThe association has no cause of action against the insured of the insurer for any sums it has paid out except the causes of action the insurer would have had if the sums had been paid by the insurer.\nIn the case of an insurer operating on a plan with assessment liability, payments of claims of the association do not operate to reduce the liability of insureds to the receiver, liquidator or statutory successor for unpaid assessments.\nThe expenses of the association or similar organization in handling claims are accorded the same priority as the liquidator's expenses. The association and a similar organization in another state must be recognized as claimants in the liquidation of an insolvent insurer for amounts paid by them on covered claims as determined under this chapter or similar laws in other states and must receive dividends and other distributions at the priority set forth in chapter 60B. The receiver, liquidator, or statutory successor of an insolvent insurer is bound by determinations of covered claim eligibility under this chapter and by settlements of claims made by the association or a similar organization in another state. The court having jurisdiction shall grant the claims priority equal to that which the claimant would have been entitled against the assets of the insolvent insurer in the absence of this chapter.\nThe association shall periodically file with the receiver or liquidator of the insurer statements of the covered claims paid by the association and estimates of anticipated claims against the association which shall preserve the rights of the association against the assets of the insurer.\nThe association may recover the amount of any covered claim including claim handling expenses paid, resulting from insolvencies which occur after July 31, 1996, on behalf of an insured who has a net worth of $25,000,000 as provided in section 60C.09, subdivision 2, clause (3), on December 31 of the year immediately preceding the date the insurer becomes an insolvent insurer and whose liability obligations to other persons are satisfied in whole or in part by payments made under this chapter.",
	"repealed": false
}