{
	"id": "16C.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.35",
	"title": "16C.35 JOB ORDER CONTRACTING.",
	"text": "The commissioner may undertake construction utilizing job order contracting for projects that do not exceed a construction cost of $250,000.\n(a) The commissioner is authorized to issue a request for qualifications that includes the criteria that will be used for the projects, provided that these criteria do not unduly restrict competition, nor impose conditions beyond reasonable requirements to ensure maximum participation of all qualified contractors, and does not relate to the collective bargaining status of the contractor.\n(b) The request for qualifications must be publicized in a manner designated by the commissioner that ensures open and unrestricted access for any potential responder. To the extent practical, this must include posting on a state website. To the extent practical, the commissioner must give notice to representatives of targeted group businesses designated under section 16C.16.\n(a) The commissioner shall review the responses to the request for qualifications and determine responder's ability to enter into the master contract that will be utilized for the projects. The commissioner shall establish a list of qualified contractors based on the proposers' ability to enter into a master contract as described in the request for qualifications.\n(b) The commissioner shall enter into master contracts with all qualified contractors.\n(c) The commissioner shall establish procedures to allow firms to submit qualifications at least annually to allow placement on the list of contractors qualified to enter into a master contract.\nThe commissioner shall request bids for construction services for any project using job order contracting from qualified contractors as follows:\n(1) for construction projects up to a maximum cost of $50,000, the commissioner shall request a minimum of two bids;\n(2) for construction projects with a cost greater than $50,000, but less than or equal to $100,000, the commissioner shall request a minimum of three bids;\n(3) for construction projects with a cost greater than $100,000 but less than or equal to $250,000, the commissioner shall request a minimum of four bids.\nThe commissioner shall select the contractor who submits the lowest price bid for the construction services proposed.\nThe commissioner in requesting bidding for projects using job order contracting as described in this section shall develop a system to ensure a reasonable opportunity for all qualified contractors to bid on construction services on a periodic basis.",
	"repealed": false
}