{
	"id": "260C.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.82",
	"title": "260C.82 POWERS OF FOSTER YOUTH OMBUDSPERSON; INVESTIGATION; ACTION ON COMPLAINTS; RECOMMENDATIONS.",
	"text": "For purposes of this section, \"agency\" means the divisions, officials, or employees of the Minnesota Department of Children, Youth, and Families, the responsible social services agency, or a licensed child-placing agency.\n(a) The foster youth ombudsperson may:\n(1) establish a complaint process, including how a person may make a complaint and how the ombudsperson may review and act upon the complaint;\n(2) determine the scope and manner of the ombudsperson's and staff's investigations;\n(3) make conclusions, recommendations, and proposals to the governor or to the legislature, provided that the governor or legislature may request and receive information from the ombudsperson at any time;\n(4) investigate, upon a complaint or upon personal initiative, any action of an agency, including a request from a youth in foster care to examine the physical placement where the child resides;\n(5) request and be given access to information from an agency that is necessary for performing the ombudsperson's responsibilities;\n(6) subpoena any person to appear, give testimony, or produce documents or other evidence that the ombudsperson considers relevant to a matter under inquiry and may petition a state district court to seek enforcement of a subpoena. Any witness at a hearing or before an investigation has the same privileges reserved to a witness in the courts or under the laws of this state; and\n(7) be present at court hearings, conferences, meetings, and deliberations when a youth in foster care requests the ombudsperson's presence.\n(b) Neither the ombudsperson nor any member of the ombudsperson's staff shall be compelled to testify or to produce evidence in any judicial or administrative proceeding with respect to any matter involving the exercise of the ombudsperson's official duties.\nNo proceeding or civil action except removal from office or a proceeding brought pursuant to chapter 13 shall be commenced against the foster youth ombudsperson for actions taken under sections 260C.80 to 260C.82, unless the act or omission demonstrates malicious intent or was grossly negligent.\n(a) The ombudsperson may receive a complaint from any source concerning the health, safety, or welfare of a youth in foster care. The ombudsperson may, at the request of another or on the ombudsperson's own initiative, investigate any action of an agency or a family foster home, custodian, parent, or facility licensed by the state, including a residential treatment facility and secured detention facility. The ombudsperson may exercise powers without regard to the finality of any action. The ombudsperson may require a complainant to pursue other remedies or channels of complaint open to the complainant before accepting or investigating a complaint. After completing the investigation of a complaint, the ombudsperson shall inform the complainant, the agency, and any person who is the subject of the investigation of the action taken.\n(b) A facility or family foster home must immediately forward any letter to the ombudsperson from a person in the facility or family foster home. The facility or family foster home must not open any letter to the ombudsperson from a person at the facility or foster home. A facility or family foster home must deliver any mail or forward any email from the ombudsperson to a person in the facility or family foster home immediately after the facility or family foster home receives the mail or email. A facility or family foster home must not punish a person for making a complaint to the ombudsperson. A facility or family foster home must not unfavorably alter the conditions of a person's placement as a consequence for making a complaint to the ombudsperson.\n(a) If the ombudsperson considers a complaint to be valid, the ombudsperson may recommend that an agency or a judicial officer:\n(1) consider the matter further;\n(2) modify or cancel the agency's or judicial officer's actions;\n(3) change a ruling or explain an action; or\n(4) take any other step that the ombudsperson recommends to provide direction or require action by a facility, placement, or custodian providing a residence to the complainant.\n(b) If the ombudsperson requests, the agency shall, within the time that the ombudsperson specifies, inform the ombudsperson about the action taken based on the ombudsperson's recommendations or the reasons for not complying with the ombudsperson's recommendations. If the ombudsperson has the reason to believe that any person, including a public official, has acted in a manner warranting criminal or disciplinary proceedings, the ombudsperson may refer the matter to the appropriate authorities. If the ombudsperson believes that an action upon which a valid complaint is founded had a statutory basis, and that the statute produced results or effects that were unfair or otherwise objectionable, the ombudsperson shall bring to the attention of the governor and the legislature the ombudsperson's view concerning desirable statutory change.\nThe ombudsperson may apply for and receive grants from public and private entities for the purposes of carrying out the ombudsperson's powers and duties under this section.\nState district courts may and administrative agencies must provide the foster youth ombudsperson with access to juvenile court data, foster care placement data, and medical data maintained by an agency and classified as private data on individuals or confidential data on individuals when access to the data is necessary for the ombudsperson to perform the ombudsperson's duties under sections 260C.80 to 260C.82.",
	"repealed": false
}