{
	"id": "325F.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.171",
	"title": "325F.171 CRIB SAFETY.",
	"text": "(a) \"Commercial user\" means any person who deals in cribs or who otherwise by one's occupation holds oneself out as having knowledge or skill peculiar to cribs, or any person who is in the business of remanufacturing, retrofitting, selling, leasing, subletting, or otherwise placing cribs in the stream of commerce.\n(b) \"Infant\" means any person less than 35 inches tall and less than three years of age.\n(c) \"Crib\" means a bed or containment designed to accommodate an infant.\n(d) \"Full-size crib\" means a full-size crib as defined in Code of Federal Regulations, title 16, section 1508.3, regarding the requirements for full-size cribs.\n(e) \"Non-full-size crib\" means a non-full-size crib as defined in Code of Federal Regulations, title 16, section 1509.2, regarding the requirements for non-full-size cribs.\n(f) \"Place in the stream of commerce\" means to sell, offer for sale, give away, offer to give away, or allow to use.\n(a) No commercial user may remanufacture, retrofit, sell, contract to sell or resell, lease, sublet, or otherwise place any unsafe crib in the stream of commerce on or after January 1, 2006.\n(b) On or after January 1, 2006, no person operating a hotel, motel, or lodging establishment shall provide any unsafe crib to any guest, either with or without charge, for use during the guest's stay. For the purposes of this paragraph, \"hotel,\" \"motel,\" and \"lodging establishment\" have the meanings given them in section 157.15.\n(c) A crib is presumed to be unsafe for purposes of this section if it does not conform to the standards endorsed or established by the United States Consumer Product Safety Commission, including but not limited to Code of Federal Regulations, title 16, and ASTM International, as follows:\n(1) Code of Federal Regulations, title 16, part 1508, and any regulations adopted to amend or supplement the regulations;\n(2) Code of Federal Regulations, title 16, part 1509, and any regulations adopted to amend or supplement the regulations;\n(3) Code of Federal Regulations, title 16, part 1303, and any regulations adopted to amend or supplement the regulations;\n(4) the following standards and specifications of ASTM International for corner posts of baby cribs and structural integrity of baby cribs:\n(i) ASTM F 966 (corner post standard);\n(ii) ASTM F 1169 (structural integrity of full-size baby cribs);\n(iii) ASTM F 1822 (non-full-size cribs).\n(d) A crib is exempt from the provisions of this section if it is not intended for use by an infant; and at the time of selling, contracting to resell, leasing, subletting, or otherwise placing the crib in the stream of commerce, the commercial user attaches a written notice to the crib declaring that it is not intended to be used for an infant and is unsafe for use by an infant. A commercial user who complies with this paragraph is not liable for use of the crib contrary to the notice provided.\n(a) An unsafe crib, as determined under subdivision 2, may be retrofitted if the retrofit has been approved by the United States Consumer Product Safety Commission. A retrofitted crib may be sold if it is accompanied at the time of sale by a notice stating that it is safe to use for a child under three years of age. The commercial user is responsible for ensuring that the notice is present with the retrofitted crib at the time of sale. The notice must include:\n(1) a description of the original problem that made the crib unsafe;\n(2) a description of the retrofit that explains how the original problem was eliminated and declares that the crib is now safe to use for a child under three years of age; and\n(3) the name and address of the commercial user who accomplished the retrofit certifying that the work was done along with the name and model number of the crib.\n(b) A retrofit is exempt from this section if:\n(1) the retrofit is for a crib that requires assembly by the consumer, the approved retrofit is provided with the product by the commercial user, and the retrofit is accompanied at the time of sale by instructions explaining how to apply the retrofit; or\n(2) the seller of a previously unsold product accomplishes the retrofit prior to sale.\nA commercial user does not violate this section if the crib placed in the stream of commerce by the commercial user was not included on the Consumer Product Safety Commission's list during the entire 14-day period before this placement.\nThis section may be enforced as provided under sections 45.027, subdivisions 1 to 6, 325F.10 to 325F.12, and 325F.14 to 325F.16.",
	"repealed": false
}