{
	"id": "354.444",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.444",
	"title": "354.444 RETURN TO WORK AGREEMENT.",
	"text": "Notwithstanding any other provisions in this chapter, an eligible person as specified in subdivision 2 is authorized to commence receipt of a retirement annuity from the association and enter into an agreement to return to work. This provision must be administered in accordance with the federal Internal Revenue Code and applicable rulings.\nAn eligible person is a person who:\n(1) is a teacher as defined by section 354.05, subdivision 2, who is at least age 62;\n(2) enters into a written agreement with the employing unit to return to work; and\n(3) retires under the provisions of section 354.44 and begins to draw an annuity from the Teachers Retirement Association.\nParticipation, the amount of time worked, and the duration of participation under this section must be mutually agreed upon by the employing unit and the employee. The employing unit may require up to a one-year notice of intent to participate in the program as a condition of participation. The employing unit shall determine the time of year the employee shall work. Unless otherwise specified in this section, the employing unit may not require a person to waive any rights under a collective bargaining agreement as a condition of participation under this section.\nFor purposes of this section, \"employing unit\" does not include the Minnesota State Colleges and Universities system.\nNotwithstanding any law to the contrary, an eligible person under this section may not, based on employment to which this section applies, contribute to or earn further service credit in the Teachers Retirement Association.\nA participant in the program specified in this section must apply for a retirement annuity under the application procedure specified in section 354.44, subdivisions 3 and 4. A copy of the written agreement with the employing unit must be included with the person's retirement annuity application. This written agreement must include the termination date and reemployment date. The filing of the initial executed agreement must occur before reemployment under the agreement commences. The reemployment date must be after the member's accrual date.\nFor purposes of the annuity deferral under section 354.44, subdivision 5, an eligible person under this section is a reemployed annuitant.\nA person who returns to work under this section is a member of the appropriate bargaining unit and is covered by the appropriate collective bargaining contract. Except as provided in this section, the person's coverage is subject to any part of the contract limiting rights of part-time employees.",
	"repealed": false
}