{
	"id": "142A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.20",
	"title": "142A.20 ADMINISTRATIVE AND JUDICIAL REVIEW OF CHILDREN, YOUTH, AND FAMILIES MATTERS.",
	"text": "All state agency hearings under subdivision 2 must be heard by a human services judge pursuant to sections 256.045 and 256.0451.\nState agency hearings are available for the following:\n(1) any person:\n(i) applying for, receiving, or having received public assistance or a program of social services administered by the commissioner or a county agency on behalf of the commissioner or the federal Food and Nutrition Act; and\n(ii) whose application for assistance is denied, not acted upon with reasonable promptness, or whose assistance is suspended, reduced, terminated, or claimed to have been incorrectly paid;\n(2) any person whose claim for foster care payment according to a placement of the child resulting from a child protection assessment under chapter 260E is denied or not acted upon with reasonable promptness, regardless of funding source;\n(3) any person to whom a right of appeal according to this section is given by other provision of law; and\n(4) any person with an outstanding debt resulting from receipt of public assistance or the federal Food and Nutrition Act who is contesting a setoff claim by the commissioner of children, youth, and families or a county agency. The scope of the appeal is the validity of the claimant agency's intention to request a setoff of a refund under chapter 270A against the debt.\n(a) A state human services judge shall conduct a hearing on an appeal of a matter listed in subdivision 2 and shall recommend an order to the commissioner of children, youth, and families. The recommended order must be based on all relevant evidence and must not be limited to a review of the propriety of the state or county agency's action. A state human services judge may take official notice of adjudicative facts. The commissioner of children, youth, and families may accept the recommended order of a state human services judge and issue the order to the county agency and the applicant, recipient, or former recipient. If the commissioner refuses to accept the recommended order of the state human services judge, the commissioner shall notify the petitioner or the agency of the commissioner's refusal and shall state reasons for the refusal. The commissioner shall allow each party ten days' time to submit additional written argument on the matter. After the expiration of the ten-day period, the commissioner shall issue an order on the matter to the petitioner and the agency.\n(b) A party aggrieved by an order of the commissioner may appeal under subdivision 5 or request reconsideration by the commissioner within 30 days after the date the commissioner issues the order. The commissioner may reconsider an order upon request of any party or on the commissioner's own motion. A request for reconsideration does not stay implementation of the commissioner's order. The person seeking reconsideration has the burden to demonstrate why the matter should be reconsidered. The request for reconsideration may include legal argument and proposed additional evidence supporting the request. If proposed additional evidence is submitted, the person must explain why the proposed additional evidence was not provided at the time of the hearing. If reconsideration is granted, the other participants must be sent a copy of all material submitted in support of the request for reconsideration and must be given ten days to respond. Upon reconsideration, the commissioner may issue an amended order or an order affirming the original order.\n(c) Any order of the commissioner issued under this subdivision shall be conclusive upon the parties unless appeal is taken in the manner provided by subdivision 5. Any order of the commissioner is binding on the parties and must be implemented by the state agency or a county agency until the order is reversed by the district court or unless the commissioner or a district court orders monthly assistance or aid or services paid or provided under subdivision 8.\n(d) A vendor under contract with a county agency to provide social services is not a party and may not request a hearing or seek judicial review of an order issued under this section, unless assisting a recipient as provided in section 256.045, subdivision 4.\n(a) The commissioner may initiate a review of any action or decision of a county agency and direct that the matter be presented to a state human services judge for a hearing held under subdivision 2 or section 256.045, subdivision 3b. In all matters dealing with children, youth, and families committed by law to the discretion of the county agency, the commissioner's judgment may be substituted for that of the county agency. The commissioner may order an independent examination when appropriate.\n(b) Any party to a hearing held pursuant to subdivision 2 or section 256.045, subdivision 3b, may request that the commissioner issue a subpoena to compel the attendance of witnesses and the production of records at the hearing. A local agency may request that the commissioner issue a subpoena to compel the release of information from third parties prior to a request for a hearing under section 256.0451 upon a showing of relevance to such a proceeding. The issuance, service, and enforcement of subpoenas under this subdivision is governed by section 357.22 and the Minnesota Rules of Civil Procedure.\nAny party who is aggrieved by an order of the commissioner of children, youth, and families may appeal the order to the district court of the county responsible for furnishing assistance, or, in appeals under section 256.045, subdivision 3b, the county where the maltreatment occurred, by serving a written copy of a notice of appeal upon the commissioner and any adverse party of record within 30 days after the date the commissioner issued the order, the amended order, or order affirming the original order, and by filing the original notice and proof of service with the court administrator of the district court. Service may be made personally or by mail; service by mail is complete upon mailing. The court administrator shall not require a filing fee in appeals taken pursuant to this subdivision, except for appeals taken under section 256.045, subdivision 3b. The commissioner may elect to become a party to the proceedings in the district court. Except for appeals under section 256.045, subdivision 3b, any party may demand that the commissioner furnish all parties to the proceedings with a copy of the decision, and a transcript of any testimony, evidence, or other supporting papers from the hearing held before the state human services judge, by serving a written demand upon the commissioner within 30 days after service of the notice of appeal. Any party aggrieved by the failure of an adverse party to obey an order issued by the commissioner under subdivision 3 may compel performance according to the order in the manner prescribed in sections 586.01 to 586.12.\nAny party may obtain a hearing at a special term of the district court by serving a written notice of the time and place of the hearing at least ten days prior to the date of the hearing. The court may consider the matter in or out of chambers, and shall take no new or additional evidence unless it determines that such evidence is necessary for a more equitable disposition of the appeal.\nAny party aggrieved by the order of the district court may appeal the order as in other civil cases. Except for appeals under section 256.045, subdivision 3b, no costs or disbursements shall be taxed against any party nor shall any filing fee or bond be required of any party.\nIf the commissioner of children, youth, and families or district court orders monthly assistance or aid or services paid or provided in any proceeding under this section, it shall be paid or provided pending appeal to the commissioner of children, youth, and families, district court, court of appeals, or supreme court. The state or county agency has a claim for Supplemental Nutrition Assistance Program (SNAP) benefits or cash payments made to or on behalf of a recipient or former recipient while an appeal is pending if the recipient or former recipient is determined ineligible for SNAP benefits or cash payments as a result of the appeal.",
	"repealed": false
}