{
	"id": "216D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/216D.08",
	"title": "216D.08 CIVIL PENALTIES; PROCEEDS TO SAFETY ACCOUNT; RULES.",
	"text": "A person who is engaged in excavation for remuneration or an operator other than an operator subject to section 299F.59, subdivision 1, who violates sections 216D.01 to 216D.07 is subject to a civil penalty to be imposed by the commissioner not to exceed $1,000 for each violation per day of violation. An operator subject to section 299F.59, subdivision 1, who violates sections 216D.01 to 216D.07 is subject to a civil penalty to be imposed under section 299F.60. The district court may hear, try, and determine actions commenced under this section. Trials under this section must be to the court sitting without a jury. If the fine exceeds the maximum limit for conciliation court, the person appealing the fine may request the commissioner to conduct an administrative hearing under chapter 14.\nThe commissioner may negotiate a compromise settlement of a civil penalty. In determining the amount of the penalty, or the amount of the compromise settlement, the commissioner shall consider the appropriateness of the penalty to the size of the business of the person charged, the gravity of the violation, and the good faith of the person charged in attempting to achieve compliance, after notification of a violation. Unless the commissioner chooses to proceed in district court under subdivision 1, the contested case and judicial review provisions of chapter 14 apply to the orders of the commissioner imposing a penalty under sections 216D.01 to 216D.07. The amount of the penalty, when finally determined, may be deducted from sums owing by the state of Minnesota to the person charged.\nPenalties collected under this section must be deposited in the state treasury and credited to the pipeline safety account to be applied to the reduction of expenses or costs assessed by the commissioner against persons regulated under this chapter. Penalties collected under this section are annually appropriated to the commissioner of public safety.\nThe commissioner shall adopt rules establishing reasonable guidelines for imposing penalties. The rules must provide for notice that a penalty is assessed and may exempt activities from penalties unless the excavator or operator as defined in this section has evidenced a course of action in disregard of this chapter.",
	"repealed": false
}