{
	"id": "268.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.07",
	"title": "268.07 BENEFIT ACCOUNT.",
	"text": "(a) An application for unemployment benefits may be filed in person, by mail, or by electronic transmission as the commissioner may require. The applicant must be unemployed at the time the application is filed and must provide all requested information in the manner required. If the applicant is not unemployed at the time of the application or fails to provide all requested information, the communication is not an application for unemployment benefits.\n(b) The commissioner must examine each application for unemployment benefits to determine the base period and the benefit year, and based upon all the covered employment in the base period the commissioner must determine the weekly unemployment benefit amount available, if any, and the maximum amount of unemployment benefits available, if any. The determination, which is a document separate and distinct from a document titled a determination of eligibility or determination of ineligibility issued under section 268.101, must be titled determination of benefit account. A determination of benefit account must be sent to the applicant and all base period employers, by mail or electronic transmission.\n(c) If a base period employer did not provide wage detail information for the applicant as required under section 268.044, the commissioner may accept an applicant certification of wage credits, based upon the applicant's records, and issue a determination of benefit account.\n(d) The commissioner may, at any time within 24 months from the establishment of a benefit account, reconsider any determination of benefit account and make an amended determination if the commissioner finds that the wage credits listed in the determination were incorrect for any reason. An amended determination of benefit account must be promptly sent to the applicant and all base period employers, by mail or electronic transmission. This subdivision does not apply to documents titled determinations of eligibility or determinations of ineligibility issued under section 268.101.\n(e) If an amended determination of benefit account reduces the weekly unemployment benefit amount or maximum amount of unemployment benefits available, any unemployment benefits that have been paid greater than the applicant was entitled is an overpayment of unemployment benefits. A determination or amended determination issued under this section that results in an overpayment of unemployment benefits must set out the amount of the overpayment and the requirement under section 268.18, subdivision 1, that the overpaid unemployment benefits must be repaid.\n(a) Unless paragraph (b) applies, to establish a benefit account an applicant must have wage credits of at least 5.3 percent of the state's average annual wage rounded down to the next lower $100.\n(b) To establish a new benefit account following the expiration of the benefit year on a prior benefit account, an applicant must have performed actual work in subsequent covered employment and have been paid wages in one or more completed calendar quarters that started after the effective date of the prior benefit account. The wages paid for that employment must be at least enough to meet the requirements of paragraph (a). A benefit account under this paragraph may not be established effective earlier than the Sunday following the end of the most recent completed calendar quarter in which the requirements of paragraph (a) were met. An applicant may not establish a second benefit account as a result of one loss of employment.\n[Repealed by amendment, 1996 c 417 s 9]\n(a) If an applicant has established a benefit account under subdivision 2, the weekly unemployment benefit amount available during the applicant's benefit year is the higher of:\n(1) 50 percent of the applicant's average weekly wage during the base period, to a maximum of 66-2/3 percent of the state's average weekly wage; or\n(2) 50 percent of the applicant's average weekly wage during the high quarter, to a maximum of 43 percent of the state's average weekly wage.\nThe applicant's average weekly wage under clause (1) is computed by dividing the total wage credits by 52. The applicant's average weekly wage under clause (2) is computed by dividing the high quarter wage credits by 13.\n(b) The state's maximum weekly benefit amount, computed in accordance with section 268.035, subdivision 23, applies to a benefit account established effective on or after the last Sunday in October. Once established, an applicant's weekly unemployment benefit amount is not affected by the last Sunday in October change in the state's maximum weekly unemployment benefit amount.\n(c) The maximum amount of unemployment benefits available on any benefit account is the lower of:\n(1) 33-1/3 percent of the applicant's total wage credits; or\n(2) 26 times the applicant's weekly unemployment benefit amount.\n[Repealed by amendment, 2010 c 347 art 2 s 11]\n(a) A determination or amended determination of benefit account is final unless an applicant or base period employer within 45 calendar days after the sending of the determination or amended determination files an appeal. Every determination or amended determination of benefit account must contain a prominent statement indicating in clear language the consequences of not appealing. Proceedings on the appeal are conducted in accordance with section 268.105.\n(b) Any applicant or base period employer may appeal from a determination or amended determination of benefit account on the issue of whether services performed constitute employment, whether the employment is covered employment, and whether money paid constitutes wages.\n(a) An application for unemployment benefits is effective the Sunday of the calendar week that the application was filed. An application for unemployment benefits may be backdated one calendar week before the Sunday of the week the application was actually filed if the applicant requests the backdating within seven calendar days of the date the application is filed. An application may be backdated only if the applicant was unemployed during the period of the backdating. If an individual attempted to file an application for unemployment benefits, but was prevented from filing an application by the department, the application is effective the Sunday of the calendar week the individual first attempted to file an application.\n(b) A benefit account established under subdivision 2 is effective the date the application for unemployment benefits was effective.\n(c) A benefit account, once established, may later be withdrawn only if:\n(1) the applicant has not been paid any unemployment benefits on that benefit account; and\n(2) a new application for unemployment benefits is filed and a new benefit account is established at the time of the withdrawal.\nA benefit account may be withdrawn after the expiration of the benefit year, and the new work requirements of subdivision 2, paragraph (b), do not apply if the applicant was not paid any unemployment benefits on the benefit account that is being withdrawn.\nA determination or amended determination of eligibility or ineligibility issued under section 268.101, that was sent before the withdrawal of the benefit account, remains in effect and is not voided by the withdrawal of the benefit account.\n(d) An application for unemployment benefits is not allowed before the Sunday following the expiration of the benefit year on a prior benefit account. Except as allowed under paragraph (c), an applicant may establish only one benefit account each 52 calendar weeks. This paragraph applies to benefit accounts established under any federal law or the law of any other state.\nMS 1949 [Repealed, 1951 c 442 s 3]\nMS 1980 [Repealed, 1Sp1982 c 1 s 43]\n[Repealed, 1975 c 336 s 25]\n[Repealed, 1947 c 32 s 9]",
	"repealed": false
}