{
	"id": "256.959",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.959",
	"title": "256.959 DENTAL PRACTICE DONATION PROGRAM.",
	"text": "The commissioner of human services shall establish a dental practice donation program that coordinates the donation of a qualifying dental practice to a qualified charitable organization and assists in locating a dentist licensed under chapter 150A who wishes to maintain the dental practice.\nTo qualify for the dental practice donation program, a dental practice must meet the following requirements:\n(1) the dental practice must be owned by the donating dentist;\n(2) the dental practice must be located in a designated underserved area of the state as defined by the commissioner; and\n(3) the practice must be equipped with the basic dental equipment necessary to maintain a dental practice as determined by the commissioner.\nThe commissioner shall establish a procedure for dentists to donate their dental practices to a qualified charitable organization. The commissioner shall authorize a practice for donation only if it meets the requirements of subdivision 2 and there is a licensed dentist who is interested in entering into an agreement as described in subdivision 4. Upon donation of the practice, the commissioner shall provide the donating dentist with a statement verifying that a donation of the practice was made to a qualifying charitable organization for purposes of state and federal income tax returns.\n(a) A dentist accepting the donated practice must enter into an agreement with the qualified charitable organization to maintain the dental practice for a minimum of five years at the donated practice site and to provide services to underserved populations up to a preagreed percentage of patients served.\n(b) The agreement must include the terms for the recovery of the donated dental practice if the dentist accepting the practice does not fulfill the service commitment required under this subdivision.\n(c) Any costs associated with operating the dental practice during the service commitment time period are the financial responsibility of the dentist accepting the practice.",
	"repealed": false
}