{
	"id": "214.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.12",
	"title": "214.12 CONTINUING EDUCATION.",
	"text": "The health-related and non-health-related licensing boards may promulgate by rule requirements for renewal of licenses designed to promote the continuing professional competence of licensees. These requirements of continuing professional education or training shall be designed solely to improve professional skills and shall not exceed an average attendance requirement of 50 clock hours per year. All requirements promulgated by the boards shall be effective commencing January 1, 1977, or at a later date as the board may determine. The 50 clock hour limitation shall not apply to the Professional Educator Licensing and Standards Board.\nMS 1998 [Repealed, 1999 c 5 s 1]\nThe Board of Medical Practice and the Board of Nursing shall require by rule that family practitioners, pediatricians, obstetricians and gynecologists, and other licensees who have primary responsibility for diagnosing and treating fetal alcohol syndrome in pregnant women or children receive education on the subject of fetal alcohol syndrome and fetal alcohol effects, including how to: (1) screen pregnant women for alcohol abuse; (2) identify affected children; and (3) provide referral information on needed services.\nThe health-related licensing boards that regulate professions that serve caregivers at risk of depression, or their children, including behavioral health and therapy, chiropractic, marriage and family therapy, medical practice, nursing, psychology, and social work, shall provide educational materials to licensees on the subject of parental depression and its potential effects on children if unaddressed, including how to:\n(1) screen mothers for depression;\n(2) identify children who are affected by their mother's depression; and\n(3) provide treatment or referral information on needed services.\nThe health-related licensing boards shall include information regarding the health professionals services program on their websites.\nMS 2020 [Expired, 2019 c 63 art 2 s 10]",
	"repealed": false
}