{
	"id": "299J.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/299J.04",
	"title": "299J.04 DUTIES OF OFFICE OF PIPELINE SAFETY.",
	"text": "The commissioner shall:\n(1) enforce sections 216D.01 to 216D.09, as provided in sections 216D.08 and 216D.09;\n(2) maintain a database of all pipeline and LNG facility emergency releases;\n(3) inspect, as necessary, any record, map, or written procedure required by sections 299J.01 to 299J.17 to be kept by a pipeline operator concerning the reporting of emergency releases, and the design, construction, testing, or operation and maintenance of pipelines and LNG facilities; and\n(4) adopt rules to implement sections 299J.01 to 299J.17.\nThe rules adopted under clause (4) must treat separately and distinguish between hazardous liquid and gas pipelines and must be compatible with federal laws and regulations.\n(a) The commissioner shall seek and accept federal designation of the office's pipeline inspectors as federal agents for the purposes of enforcement of the federal Hazardous Liquid Pipeline Safety Act, United States Code, title 49, sections 2001 to 2014, the federal Natural Gas Pipeline Safety Act, United States Code, title 49, sections 1671 to 1686, and federal rules adopted to implement those acts. The commissioner shall establish and submit to the United States Secretary of Transportation an inspection program that complies with requirements for delegated interstate agent inspection authority.\n(b) To the extent that federal delegation of interstate agent inspection authority permits, the inspection program for interstate pipelines and LNG facilities must be the same as the inspection program for intrastate pipelines and LNG facilities. If the United States Secretary of Transportation delegates inspection authority to the state as provided in this subdivision, the commissioner, at a minimum, shall do the following to carry out the delegated federal authority:\n(1) inspect pipelines and LNG facilities periodically as specified in the inspection program;\n(2) collect inspection fees;\n(3) order and oversee the testing of pipelines and LNG facilities as authorized by federal law and regulations; and\n(4) file reports with the United States Secretary of Transportation as required to maintain the delegated inspection authority.\n[Repealed by amendment, 1989 c 244 s 20]\n[Repealed by amendment, 1989 c 244 s 20]",
	"repealed": false
}