{
	"id": "138.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.40",
	"title": "138.40 COOPERATION OF STATE AGENCIES; DEVELOPMENT PLANS.",
	"text": "The Department of Natural Resources, the Department of Transportation, and all other state agencies whose activities may be affected, shall cooperate with the historical society, the State Historic Preservation Office, and the state archaeologist to carry out the provisions of sections 138.31 to 138.42 and the rules issued thereunder, but sections 138.31 to 138.42 are not meant to burden persons who wish to use state property for recreational and other lawful purposes or to unnecessarily restrict the use of state property.\nState and other governmental agencies shall comply with and aid in the enforcement of provisions of sections 138.31 to 138.42. Conservation officers and other enforcement officers of the Department of Natural Resources shall enforce the provisions of sections 138.31 to 138.42 and report violations to the state archeologist. When archaeological or historic sites are known or, based on scientific investigations are predicted to exist on public lands or waters, the agency or department controlling said lands or waters shall use the professional services of archaeologists from the University of Minnesota, Minnesota Historical Society, or other qualified professional archaeologists, to preserve these sites. In the event that archaeological excavation is required to protect or preserve these sites, state and other governmental agencies may use their funds for such activities.\nWhen significant archaeological or historic sites are known or, based on scientific investigations, are predicted to exist on public lands or waters, the agency or department controlling said lands or waters shall submit construction or development plans to the state archaeologist and the State Historic Preservation Office for review prior to the time bids are advertised. The state archaeologist and the State Historic Preservation Office shall promptly review such plans and within 30 days of receiving the plans shall make recommendations for the preservation of archaeological or historic sites which may be endangered by construction or development activities. When archaeological or historic sites are related to Indian history or religion, the state archaeologist shall submit the plans to the Indian Affairs Council for the council's review and recommend action.",
	"repealed": false
}