{
	"id": "246B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/246B.01",
	"title": "246B.01 MINNESOTA SEX OFFENDER PROGRAM; DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Civilly committed sex offender\" means a person who is admitted to the Minnesota Sex Offender Program under chapter 253D for the purpose of assessment, diagnosis, care, treatment, supervision, or other services provided by the Minnesota Sex Offender Program.\n\"Civilly committed sex offender's county\" means the county of financial responsibility under chapter 256G, except that when a civilly committed sex offender with no residence in this state is committed while serving a sentence at a penal institution, it means the county from which the civilly committed sex offender was sentenced.\n\"Executive board\" has the meaning given in section 246C.015.\n\"Community preparation services\" means specialized residential services or programs operated or administered by the Minnesota Sex Offender Program outside of a secure treatment facility. Community preparation services are designed to assist civilly committed sex offenders in developing the appropriate skills and resources necessary for an eventual successful reintegration into a community. A civilly committed sex offender may be placed in community preparation services only upon an order of the judicial appeal panel under section 253B.19.\n\"Cost of care\" means the executive board's charge for housing and treatment services provided to any person admitted to the Minnesota Sex Offender Program.\nFor purposes of this subdivision, \"charge for housing and treatment services\" means the cost of services, treatment, maintenance, bonds issued for capital improvements, depreciation of buildings and equipment, and indirect costs related to the operation of state facilities. The executive board may determine the charge for services on an anticipated average per diem basis as an all-inclusive charge per facility.\n\"Executive director\" means the person who is charged with overall responsibility for the operation of the Minnesota Sex Offender Program, or the person's designee.\n\"Local social services agency\" means the local social services agency of the civilly committed sex offender's county as defined in subdivision 1b and of the county of commitment, and any other local social services agency possessing information regarding, or requested by the executive board to investigate, the financial circumstances of a civilly committed sex offender.\n\"Sexual psychopathic personality\" has the meaning given in section 253D.02, subdivision 15.\n\"Sexually dangerous person\" has the meaning given in section 253D.02, subdivision 16.",
	"repealed": false
}