{
	"id": "56.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/56.10",
	"title": "56.10 GENERAL OVERSIGHT AND ADMINISTRATION.",
	"text": "For the purpose of discovering violations of this chapter or securing information lawfully required by the commissioner hereunder, the commissioner may, at any time, either personally or by a person or persons duly designated, investigate the loans and business and examine the books, accounts, records, and files used therein, of every licensee and of every person who shall be engaged in the business described in section 56.01, whether the person shall act or claim to act as principal or agent, or under or without the authority of this chapter. For that purpose the commissioner and a duly designated representative shall have free access to the offices and places of business, books, accounts, papers, records, files, safes, and vaults of all such persons. The commissioner and all persons duly designated shall have authority to require the attendance of and to examine, under oath, all persons whomsoever whose testimony the commissioner may require relative to the loan or the business or to the subject matter of any examination, investigation, or hearing. Upon written agreement with the licensee, the commissioner may conduct examinations applying the procedures for purposes of this subdivision and section 46.04, subdivision 1, to facilitate the qualifications of the licensee to participate in the United States Small Business Administration loan guarantee or similar programs.\nEach licensee shall pay to the commissioner such amount as may be required under section 46.131, and the commissioner may maintain an action for the recovery of such costs in any court of competent jurisdiction.\nThe commissioner may honor requests from interested parties for interpretive opinions in connection with the administration of this chapter. No provision of this chapter or of any other chapter to which this chapter refers which imposes any penalty shall apply to any act done or omitted to be done in conformity with any written interpretive opinion of the commissioner, notwithstanding that such written interpretive opinion may, after such act or omission, be amended or rescinded or be determined by judicial or other authority to be invalid for any reason.",
	"repealed": false
}