{
	"id": "124E.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.07",
	"title": "124E.07 BOARD OF DIRECTORS.",
	"text": "Before entering into a contract or other agreement for professional or other services, goods, or facilities, the operators authorized to organize and operate a school must establish a board of directors composed of at least five members. The initial board members must not be related parties. The initial board continues to serve until a timely election for members of the ongoing charter school board of directors is held according to the school's articles and bylaws under subdivision 4. The initial board of directors and school developers must comply with the training requirements in subdivision 7 upon the incorporation of the school.\nThe initial board must begin the transition to the ongoing board structure by the end of the first year of operation and complete the transition by the end of the second year of operation. The terms of board members shall begin on July 1. Terms shall be no less than two years. The bylaws shall set the number of terms an individual may serve on the board and as an officer of the board. Board elections must be held during the school year but may not be conducted on days when the school is closed.\n(a) The ongoing charter school board of directors shall have at least five members. The board members must not be related parties. The ongoing board must include: (1) at least one licensed teacher; (2) at least one parent or legal guardian of a student enrolled in the charter school who is not an employee of the charter school; and (3) at least one interested community member. A community member serving on the board must reside in Minnesota, must not have a child enrolled in the school, and must not be an employee of the charter school.\n(b) To serve as a licensed teacher on a charter school board, an individual must:\n(1) be employed by the school or provide at least 720 hours of service under a contract between the charter school and a teacher cooperative;\n(2) be a qualified teacher as defined under section 122A.16, either serving as a teacher of record in a field in which the individual has a field license, or providing services to students the individual is licensed to provide; and\n(3) not serve in an administrative or supervisory capacity for more than 240 hours in a school calendar year.\n(c) The board structure must be defined in the bylaws. The board structure may (1) be a majority of teachers under paragraph (b), (2) be a majority of parents, (3) be a majority of community members, or (4) have no clear majority.\n(d) The chief administrator may only serve as an ex-officio nonvoting board member. No charter school employees shall serve on the board other than teachers under paragraph (b).\n(e) A contractor providing facilities, goods, or services to a charter school must not serve on the board of directors. In addition, an individual is prohibited from serving as a member of the charter school board of directors if: (1) the individual, an immediate family member, or the individual's partner is a full or part owner or principal with a for-profit or nonprofit entity or independent contractor with whom the charter school contracts, directly or indirectly, for professional services, goods, or facilities; or (2) an immediate family member is an employee of the school. An individual may serve as a member of the board of directors if no conflict of interest exists under this paragraph, consistent with this section.\n(f) A violation of paragraph (e) renders a contract voidable at the option of the commissioner or the charter school board of directors. A member of a charter school board of directors who violates paragraph (e) is individually liable to the charter school for any damage caused by the violation.\n(g) Any employee, agent, contractor, or board member of the authorizer who participates in initially reviewing, approving, overseeing, evaluating, renewing, or not renewing the charter school is ineligible to serve on the board of directors of a school chartered by that authorizer.\n(h) An individual is prohibited from serving on more than one charter school board at the same time in either an elected or ex-officio capacity, except that an individual serving as an administrator serving more than one school under section 124E.12, subdivision 2, paragraph (f), may serve on each board as an ex-officio member.\nBoard bylaws shall outline the process and procedures for changing the board's governance structure, consistent with chapter 317A. A board may change its governance structure only:\n(1) by a majority vote of the board of directors;\n(2) by a majority vote of the licensed teachers employed by the school as teachers who provide instruction to students, including licensed teachers providing instruction under a contract between the school and a cooperative; and\n(3) with the authorizer's approval.\nAny change in board governance structure must conform with the board composition established under this section.\n(a) Staff members employed at the school, including teachers providing instruction under a contract with a cooperative, members of the board of directors, and all parents or legal guardians of children enrolled in the school are the voters eligible to elect the members of the school's board of directors.\n(b) The board of directors must establish and publish election policies and procedures on the school's website.\n(c) The board of directors must notify eligible voters of the school board election dates and voting procedures at least 30 calendar days before the election and post this information on the school's website.\n(d) The board of directors must notify eligible voters of the candidates' names, biographies, and candidate statements at least ten calendar days before the election and post this information on the school's website.\n(a) The board of directors also shall decide and is responsible for all decision making on policy matters related to operating the school, including budgeting, curriculum programming, personnel, and operating procedures. The board must adopt personnel evaluation policies and practices that, at a minimum:\n(1) carry out the school's mission and goals;\n(2) evaluate how charter contract goals and commitments are executed;\n(3) evaluate student achievement, postsecondary and workforce readiness, and student engagement and connection goals;\n(4) establish a teacher evaluation process under section 124E.03, subdivision 2, paragraph (h); and\n(5) provide professional development related to the individual's job responsibilities.\n(b) The board must adopt a nepotism policy that prohibits the employment of immediate family members of a board member, a school employee, or a teacher who provides instruction under a contract between the charter school and a cooperative. The board may waive this policy if: (1) the position is publicly posted for 20 business days; and (2) a two-thirds majority of the remaining board of directors who are not immediate family members of an applicant vote to approve the hiring. A board member, school employee, or teacher under contract with a cooperative must not be involved in an interview, selection process, hiring, supervision, or evaluation of an employee who is an immediate family member.\n(a) Every charter school board member and nonvoting ex-officio member who is a charter school director or chief administrator must attend board training.\n(b) Prior to beginning their term, a new board member must complete training on a charter school board's role and responsibilities, open meeting law, and data practices law. An ex-officio member, who is a charter school director or chief administrator, must complete this training within three months of starting employment at the school.\n(c) A new board member must complete training on employment policies and practices under chapter 181; public school funding and financial management; and the board's roles and responsibilities regarding student success, achievement, and performance within 12 months of being seated on the board or the individual is automatically ineligible to continue to serve as a board member. A board member who does not complete training within the 12-month period is ineligible to be elected or appointed to a charter school board for a period of 18 months.\n(d) Every charter school board member must complete annual training throughout the member's term based on an annual assessment of the training needs of individual members and the full board. Ongoing training includes but is not limited to budgeting, financial management, recruiting and hiring a charter school director or chief administrator, evaluating a charter school director or chief administrator, governance-management relationships, student support services, student discipline, state standards, cultural diversity, succession planning, strategic planning, program oversight and evaluation, compensation systems, human resources policies, effective parent and community relationships, authorizer contract and relationships, charter school law, legal liability, board recruitment and elections, board meetings and operations, policy development and review, and school health and safety.\n(e) The organization or person providing training under paragraphs (b), (c), and (d) must certify the individual's completion of the training provided.\n(f) The charter school is responsible for covering the costs related to board training. The charter school must include in its annual report the training each board member completed during the previous year.\n(g) The board must ensure that an annual assessment of the board's performance is conducted and the results are reported in the school's annual report.\n(a) Board of director meetings must comply with chapter 13D governing open meetings.\n(b) A charter school shall publish and maintain on the school's official website: (1) the meeting minutes of the board of directors and of members and committees having board-delegated authority, within 30 days following the earlier of the date of board approval or the next regularly scheduled meeting, and for at least 365 days from the date of publication; (2) directory information for the board of directors and for the members of committees having board-delegated authority; and (3) identifying and contact information for the school's authorizer.\n(c) A charter school must include identifying and contact information for the school's authorizer in other school materials it makes available to the public.",
	"repealed": false
}