{
	"id": "41B.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.055",
	"title": "41B.055 LIVESTOCK EQUIPMENT LOAN PROGRAM.",
	"text": "The authority must establish and implement a livestock equipment loan program to help finance the purchase of livestock-related equipment and make livestock facilities improvements.\nNotwithstanding section 41B.03, to be eligible for this program a borrower must:\n(1) be a resident of Minnesota or general partnership or a family farm corporation, authorized farm corporation, family farm partnership, or authorized farm partnership as defined in section 500.24, subdivision 2;\n(2) be the principal operator of a livestock farm;\n(3) have a total net worth, including assets and liabilities of the borrower's spouse and dependents, no greater than the amount stipulated in section 41B.03, subdivision 3;\n(4) demonstrate an ability to repay the loan; and\n(5) hold an appropriate feedlot registration or be using the loan under this program to meet registration requirements.\n(a) The authority may participate in a livestock equipment loan equal to 90 percent of the purchased equipment value with an eligible lender to a farmer who is eligible under subdivision 2. Participation is limited to 45 percent of the principal amount of the loan or $100,000, whichever is less. The interest rates and repayment terms of the authority's participation interest may differ from the interest rates and repayment terms of the lender's retained portion of the loan, but the authority's interest rate must not exceed three percent. The authority may review the interest annually and make adjustments as necessary.\n(b) Standards for loan amortization must be set by the Rural Finance Authority and must not exceed ten years.\n(c) Security for a livestock equipment loan must be a personal note executed by the borrower and whatever other security is required by the eligible lender or the authority.\n(d) Refinancing of existing debt is not an eligible purpose.\n(e) The authority may impose a reasonable, nonrefundable application fee for a livestock equipment loan. The authority may review the fee annually and make adjustments as necessary. The initial application fee is $50. Application fees received by the authority must be deposited in the Rural Finance Authority administrative account established in section 41B.03.\n(f) Loans under this program must be made using money in the revolving loan account established in section 41B.06.\nMoney may be used for loans for the acquisition of equipment for animal housing, confinement, animal feeding, milk production, and waste management, including the following, if related to animal husbandry:\n(1) fences;\n(2) watering facilities;\n(3) feed storage and handling equipment;\n(4) milking parlors;\n(5) milking equipment, including robotic equipment;\n(6) scales;\n(7) milk storage and cooling facilities;\n(8) manure pumping and storage facilities;\n(9) capital investment in pasture;\n(10) hoop barns;\n(11) portable structures;\n(12) hay and forage equipment; and\n(13) related structural work for the installation of equipment.",
	"repealed": false
}