{
	"id": "260E.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.34",
	"title": "260E.34 IMMUNITY.",
	"text": "(a) The following persons are immune from any civil or criminal liability that otherwise might result from the person's actions if the person is acting in good faith:\n(1) a person making a voluntary or mandated report under this chapter or assisting in an assessment under this chapter;\n(2) a person with responsibility for performing duties under this section or supervisor employed by a local welfare agency, the commissioner of an agency responsible for operating or supervising a licensed or unlicensed day care facility, residential facility, agency, hospital, sanitarium, or other facility or institution required to be licensed or certified under sections 144.50 to 144.58; 241.021; 245A.01 to 245A.16; or chapter 142B or 142C; or a school as defined in section 120A.05, subdivisions 9, 11, and 13; and chapter 124E; or a nonlicensed personal care provider organization as defined in section 256B.0625, subdivision 19a, complying with sections 260E.23, subdivisions 2 and 3, and 260E.30; and\n(3) a public or private school, facility as defined in section 260E.03, or the employee of any public or private school or facility who permits access by a local welfare agency, the Department of Education, or a local law enforcement agency and assists in an investigation or assessment pursuant to this chapter.\n(b) A person who is a supervisor or person with responsibility for performing duties under this chapter employed by a local welfare agency; the commissioner of human services; the commissioner of children, youth, and families; or the commissioner of education complying with this chapter or any related rule or provision of law is immune from any civil or criminal liability that might otherwise result from the person's actions if the person is (1) acting in good faith and exercising due care, or (2) acting in good faith and following the information collection procedures established under section 260E.20, subdivision 3.\n(c) Any physician or other medical personnel administering a toxicology test under section 260E.32 to determine the presence of a controlled substance in a pregnant woman, in a woman within eight hours after delivery, or in a child at birth or during the first month of life is immune from civil or criminal liability arising from administration of the test if the physician ordering the test believes in good faith that the test is required under this section and the test is administered in accordance with an established protocol and reasonable medical practice.\n(d) This section does not provide immunity to any person for failure to make a required report or for committing maltreatment.\n(e) If a person who makes a voluntary or mandatory report under section 260E.06 prevails in a civil action from which the person has been granted immunity under this section, the court may award the person attorney fees and costs.",
	"repealed": false
}