{
	"id": "273.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.165",
	"title": "273.165 TAXATION OF SEPARATE MINERAL INTERESTS AND UNMINED IRON ORE.",
	"text": "\"Mineral interest,\" for the purpose of this subdivision, means an interest in any minerals, including but not limited to gas, coal, oil, or other similar interest in real estate, which is owned separately and apart from the fee title to the surface of such real property. Mineral interests which are recorded in the office of either the county recorder or registrar of titles, whether or not filed pursuant to sections 93.52 to 93.551, are taxed as provided in this subdivision unless specifically excluded by this subdivision. A tax of 40 cents per acre or portion of an acre of mineral interest is imposed and is payable annually. If an interest is a fractional undivided interest in an area, the tax due on the interest per acre or portion of an acre is equal to the product obtained by multiplying the fractional interest times 40 cents, computed to the nearest cent. However, the minimum annual tax on any mineral interest is $3.20. No such tax on mineral interests is imposed on the following: (1) mineral interests valued and taxed under other laws relating to the taxation of minerals, gas, coal, oil, or other similar interests; or (2) mineral interests which are exempt from taxation pursuant to constitutional or related statutory provisions. Taxes received under this subdivision must be apportioned to the taxing districts included in the area taxed in the same proportion as the surface interest local tax rate of a taxing district bears to the total local tax rate applicable to surface interests in the area taxed. The tax imposed by this subdivision is not included within any limitations as to rate or amount of taxes which may be imposed in an area to which the tax imposed by this subdivision applies. The tax imposed by this subdivision does not cause the amount of other taxes levied or to be levied in the area, which are subject to any such limitation, to be reduced in any amount. Twenty percent of the revenues received from the tax imposed by this subdivision must be distributed under the provisions of section 116J.64.\nUnmined iron ore included in class 5, paragraph (b), must be assessed with and as a part of the real estate in which it is located, but its net tax capacity would be as established in section 273.13, subdivision 31. The real estate in which iron ore is located, other than the ore, must be classified and assessed in accordance with the provisions of the appropriate classes. In assessing any tract or lot of real estate in which iron ore is known to exist, the assessable net tax capacity of the ore exclusive of the land in which it is located, and the assessable net tax capacity of the land exclusive of the ore must be determined and set down separately and the aggregate of the two must be assessed against the tract or lot.",
	"repealed": false
}