{
	"id": "146.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/146.23",
	"title": "146.23 MANUAL OR MECHANICAL THERAPY.",
	"text": "\"Manual therapy\" or \"mechanical therapy\" as used in this section means manipulation or adjusting joint articulation without anesthesia.\nA person regulated under this chapter who is not otherwise authorized to provide manual therapy or mechanical therapy, intending to directly treat or normalize abnormal or dysfunctional articulations of the human body must be certified by the state board which regulates the person's practice as successfully completing training in manual or mechanical therapy at a level of not less than: (1) 555 hours of training to include lecture and supervised laboratory training; (2) 315 hours in the area of radiographic interpretation; and (3) 1,155 hours of supervised work in an outpatient setting. The training must be provided by an institution which is fully accredited in the area of chiropractic, medicine, osteopathic medicine, or physical therapy.\nBefore manual therapy or mechanical therapy is provided, a person licensed by a particular board of examiners to diagnose another person for any disease, injury, defect, deformity, or infirmity of the body must determine that the person to receive therapy does not have a condition that would contraindicate the therapy. If the person making the diagnosis is not also performing the therapy, that person must give a written diagnosis report prior to the initiation of therapy to the person performing the therapy and is responsible for ensuring that the person performing the therapy has complied with the training requirements under subdivision 2.\nAny board that regulates persons affected by this section may adopt rules for the purposes of this section.\nA person who violates this section is subject to disciplinary action by the board that regulates the person's practice.\nNothing in this section expands or limits the scope of practice of licensed physical therapists or occupational therapists certified by the American Occupational Therapy Certification Board.\nThe provisions of subdivision 2 do not apply to physicians and doctors of osteopathic medicine licensed under chapter 147.",
	"repealed": false
}