{
	"id": "260.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.67",
	"title": "260.67 TRANSFER OF PERMANENT LEGAL AND PHYSICAL CUSTODY; TERMINATION OF PARENTAL RIGHTS; CHILD PLACEMENT PROCEEDINGS.",
	"text": "Consistent with section 260C.513, if an African American or disproportionately represented child cannot be returned to the child's parent, permanency placement with a relative is preferred. The court shall consider the requirements of and responsibilities under section 260.012, paragraph (a), and, if possible and if requirements under section 260C.515, subdivision 4, are met, transfer permanent legal and physical custody of the child to:\n(1) a noncustodial parent under section 260C.515, subdivision 4, if the child cannot return to the care of the parent or custodian from whom the child was removed or who had legal custody at the time that the child was placed in foster care; or\n(2) a willing and able relative, according to the requirements of section 260C.515, subdivision 4. When the responsible social services agency is the petitioner, prior to the court ordering a transfer of permanent legal and physical custody to a relative, the responsible social services agency must inform the relative of Northstar kinship assistance benefits and eligibility requirements and of the relative's ability to apply for benefits on behalf of the child under chapter 256N.\n(a) A court shall not terminate the parental rights of a parent of an African American or a disproportionately represented child based solely on the parent's failure to complete case plan requirements.\n(b) Except as provided in paragraph (c), a court shall not terminate the parental rights of a parent of an African American or a disproportionately represented child in a child placement proceeding unless the allegations against the parent involve sexual abuse; egregious harm as defined in section 260C.007, subdivision 14; murder in the first, second, or third degree under section 609.185, 609.19, or 609.195; murder of an unborn child in the first, second, or third degree under section 609.2661, 609.2662, or 609.2663; manslaughter of an unborn child in the first or second degree under section 609.2664 or 609.2665; domestic assault by strangulation under section 609.2247; felony domestic assault under section 609.2242 or 609.2243; kidnapping under section 609.25; solicitation, inducement, and promotion of prostitution under section 609.322, subdivision 1, and subdivision 1a if one or more aggravating factors are present; criminal sexual conduct under sections 609.342 to 609.3451; engaging in, hiring, or agreeing to hire a minor to engage in prostitution under section 609.324, subdivision 1; solicitation of children to engage in sexual conduct under section 609.352; possession of pornographic work involving minors under section 617.247; malicious punishment or neglect or endangerment of a child under section 609.377 or 609.378; use of a minor in sexual performance under section 617.246; or failing to protect a child from an overt act or condition that constitutes egregious harm.\n(a) The court may terminate the parental rights of a parent of an African American or a disproportionately represented child if a transfer of permanent legal and physical custody under subdivision 1 is not possible because the child has no willing or able noncustodial parent or relative to whom custody can be transferred, if it finds that one or more of the following conditions exist:\n(1) that the parent has abandoned the child;\n(2) that a parent is palpably unfit to be a party to the parent and child relationship because of a consistent pattern of specific conduct before the child or of specific conditions directly relating to the parent and child relationship, either of which are determined by the court to be of a duration or nature that renders the parent unable, for the reasonably foreseeable future, to care appropriately for the ongoing physical, mental, or emotional needs of the child;\n(3) that following the child's placement out of the home, active efforts, under the direction of the court, have failed to correct the conditions leading to the child's placement. It is presumed that active efforts under this clause have failed upon a showing that:\n(i) a child has resided out of the parental home under court order for a cumulative period of 12 months within the preceding 22 months. In the case of a child under age eight at the time that the petition was filed alleging the child to be in need of protection or services, the presumption arises when the child has resided out of the parental home under court order for six months unless the parent has maintained regular contact with the child and the parent is complying with the out-of-home placement plan;\n(ii) the court has approved the out-of-home placement plan required under section 260C.212 and filed with the court under section 260C.178;\n(iii) conditions leading to the out-of-home placement have not been corrected. It is presumed that conditions leading to a child's out-of-home placement have not been corrected upon a showing that the parent or parents have not substantially complied with the court's orders and a reasonable case plan; and\n(iv) active efforts have been made by the responsible social services agency to rehabilitate the parent and reunite the family; and\n(4) that a child has experienced egregious harm in the parent's care that is of a nature, duration, or chronicity that indicates a lack of regard for the child's well-being, such that a reasonable person would believe it contrary to the best interests of the child or of any child to be in the parent's care.\n(b) For purposes of paragraph (a), clause (1), abandonment is presumed when:\n(1) the parent has had no contact with the child on a regular basis and has not demonstrated consistent interest in the child's well-being for six months and the social services agency has made active efforts to facilitate contact with the parent, unless the parent establishes that an extreme financial or physical hardship or treatment for mental disability or substance use disorder or other good cause prevented the parent from making contact with the child. This presumption does not apply to children whose custody has been determined under chapter 257 or 518; or\n(2) the child is an infant under two years of age and has been deserted by the parent under circumstances that show an intent not to return to care for the child.\nNothing in subdivisions 2 and 3 precludes the court from terminating the parental rights of a parent of an African American or a disproportionately represented child if the parent desires to voluntarily terminate the parent's own parental rights for good cause under section 260C.301, subdivision 1, paragraph (a).\nNotwithstanding the Minnesota Rules of Juvenile Protection Procedure, rule 47.02, subdivision 2, a parent of an African American or a disproportionately represented child whose parental rights have been terminated may appeal the decision within 90 days of the service of notice by the court administrator of the filing of the court's order.",
	"repealed": false
}