{
	"id": "136D.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/136D.72",
	"title": "136D.72 GOVERNING BOARD.",
	"text": "The district shall be operated by a school board consisting of at least one member from each of the school districts within the special intermediate school district. Board members shall be appointed by their respective school boards. Members shall serve at the pleasure of their respective school boards and may be subject to recall by a majority vote of the school board. They shall report at least quarterly to their boards on the activities of the intermediate district.\nTerms of office of the members of the board shall expire on January 1. Thereafter the terms of office of board members shall be for four years commencing on January 1 of each year. If a vacancy occurs on the board, it shall be filled by the appropriate school board. A person appointed to the board shall qualify as a board member by filing with the chief executive officer thereof a written certificate of appointment from the appointing school board.\nThe school board shall meet in January of each year when notified of such meeting by the chief executive officer of the intermediate school district. At the organizational meeting, the officers of the intermediate school district for the current year shall be chosen and such other organizational business as may be necessary shall be conducted.\nThe officers shall be a chair, vice-chair, clerk and treasurer, no two of whom shall be from the same school district. The chair shall preside at all meetings of the intermediate board and in the chair's absence the vice-chair shall preside. The clerk shall keep a complete record of the minutes of each meeting, and the treasurer shall be the custodian of the funds of said district. Insofar as applicable, sections 123B.09, 123B.14, 123B.143, and 123B.147 shall apply to the board and officers of said district.\nEach participating school district shall have at least one vote. A majority of the intermediate school district board shall be a quorum although a smaller number may adjourn from time to time. Any motion other than adjournment shall be favored by a majority of the voting power of the intermediate school board in order to prevail.",
	"repealed": false
}