{
	"id": "120B.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.23",
	"title": "120B.23 VIOLENCE PREVENTION EDUCATION GRANTS.",
	"text": "The commissioner of education, after consulting with the assistant commissioner of the Office of Drug Policy and Violence Prevention, shall establish a violence prevention education grant program to enable a school district, an education district, or a group of districts that cooperate for a particular purpose to develop and implement or to continue a violence prevention program for students in kindergarten through grade 12 that can be integrated into existing curriculum. A district or group of districts that elects to develop and implement or to continue a violence prevention program under section 120B.22 is eligible to apply for a grant under this section.\nTo be eligible to receive a grant, a school district, an education district, a service cooperative, or a group of districts that cooperate for a particular purpose must submit an application to the commissioner in the form and manner and according to the timeline established by the commissioner. The application must describe how the applicant will: (1) continue or integrate into its existing K-12 curriculum a program for violence prevention that contains the program components listed in section 120B.22; (2) collaborate with local organizations involved in violence prevention and intervention; and (3) structure the program to reflect the characteristics of the children, their families and the community involved in the program. The commissioner may require additional information from the applicant. When reviewing the applications, the commissioner shall determine whether the applicant has met the requirements of this subdivision.\n(a) The commissioner may award grants for a violence prevention education program to eligible applicants as defined in subdivision 2. Grant amounts may not exceed $3 per resident pupil unit in the district or group of districts in the prior school year. Grant recipients should be geographically distributed throughout the state.\n(b) School districts and charter schools may accept funds from private and other public sources for child sexual abuse prevention programs developed and implemented under sections 120B.021, subdivision 1, paragraph (d), and 120B.234, including federal funding under the Every Student Succeeds Act.\nA successful applicant must use the grant money to develop and implement or to continue a violence prevention program according to the terms of the grant application.",
	"repealed": false
}