{
	"id": "150A.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.105",
	"title": "150A.105 DENTAL THERAPIST.",
	"text": "A dental therapist licensed under this chapter shall practice under the supervision of a Minnesota-licensed dentist and under the requirements of this chapter.\nA dental therapist licensed under this chapter is limited to primarily practicing in settings that serve low-income, uninsured, and underserved patients or in a dental health professional shortage area.\n(a) Prior to performing any of the services authorized under this chapter, a dental therapist must enter into a written collaborative management agreement with a Minnesota-licensed dentist. A collaborating dentist is limited to entering into a collaborative agreement with no more than five dental therapists or advanced dental therapists at any one time. The agreement must include:\n(1) practice settings where services may be provided and the populations to be served;\n(2) any limitations on the services that may be provided by the dental therapist, including the level of supervision required by the collaborating dentist;\n(3) age- and procedure-specific practice protocols, including case selection criteria, assessment guidelines, and imaging frequency;\n(4) a procedure for creating and maintaining dental records for the patients that are treated by the dental therapist;\n(5) a plan to manage medical emergencies in each practice setting where the dental therapist provides care;\n(6) a quality assurance plan for monitoring care provided by the dental therapist, including patient care review, referral follow-up, and a quality assurance chart review;\n(7) protocols for administering and dispensing medications authorized under subdivision 5, and section 150A.106, including the specific conditions and circumstance under which these medications are to be dispensed and administered;\n(8) criteria relating to the provision of care to patients with specific medical conditions or complex medication histories, including requirements for consultation prior to the initiation of care;\n(9) supervision criteria of dental assistants; and\n(10) a plan for the provision of clinical resources and referrals in situations which are beyond the capabilities of the dental therapist.\n(b) A collaborating dentist must be licensed and practicing in Minnesota. The collaborating dentist shall accept responsibility for all services authorized and performed by the dental therapist pursuant to the management agreement. Any licensed dentist who permits a dental therapist to perform a dental service other than those authorized under this section or by the board, or any dental therapist who performs an unauthorized service, violates sections 150A.01 to 150A.12.\n(c) Collaborative management agreements must be signed and maintained by the collaborating dentist and the dental therapist. Agreements must be reviewed, updated, and submitted to the board on an annual basis.\n(a) A licensed dental therapist may perform dental services as authorized under this section within the parameters of the collaborative management agreement.\n(b) The services authorized to be performed by a licensed dental therapist include the oral health services, as specified in paragraphs (c) and (d), and within the parameters of the collaborative management agreement.\n(c) A licensed dental therapist may perform the following services under general supervision, unless restricted or prohibited in the collaborative management agreement:\n(1) oral health instruction and disease prevention education, including nutritional counseling and dietary analysis;\n(2) preliminary charting of the oral cavity;\n(3) making radiographs;\n(4) mechanical polishing;\n(5) application of topical preventive or prophylactic agents, including fluoride varnishes and pit and fissure sealants;\n(6) pulp vitality testing;\n(7) application of desensitizing medication or resin;\n(8) fabrication of athletic mouthguards;\n(9) placement of temporary restorations;\n(10) fabrication of soft occlusal guards;\n(11) tissue conditioning and soft reline;\n(12) atraumatic restorative therapy;\n(13) dressing changes;\n(14) tooth reimplantation;\n(15) administration of local anesthetic; and\n(16) administration of nitrous oxide.\n(d) A licensed dental therapist may perform the following services under indirect supervision:\n(1) emergency palliative treatment of dental pain;\n(2) the placement and removal of space maintainers;\n(3) cavity preparation;\n(4) restoration of primary and permanent teeth;\n(5) placement of temporary crowns;\n(6) preparation and placement of preformed crowns;\n(7) pulpotomies on primary teeth;\n(8) indirect and direct pulp capping on primary and permanent teeth;\n(9) stabilization of reimplanted teeth;\n(10) extractions of primary teeth;\n(11) suture removal;\n(12) brush biopsies;\n(13) repair of defective prosthetic devices; and\n(14) recementing of permanent crowns.\n(e) For purposes of this section and section 150A.106, \"general supervision\" and \"indirect supervision\" have the meanings given in Minnesota Rules, part 3100.0100, subpart 21.\n(a) A licensed dental therapist may dispense and administer the following drugs within the parameters of the collaborative management agreement and within the scope of practice of the dental therapist: analgesics, anti-inflammatories, and antibiotics.\n(b) The authority to dispense and administer shall extend only to the categories of drugs identified in this subdivision, and may be further limited by the collaborative management agreement.\n(c) The authority to dispense includes the authority to dispense sample drugs within the categories identified in this subdivision if dispensing is permitted by the collaborative management agreement.\n(d) A licensed dental therapist is prohibited from dispensing or administering a narcotic drug as defined in section 152.01, subdivision 10.\nA licensed dental therapist authorized to practice under this chapter is not in violation of section 150A.05 as it relates to the unauthorized practice of dentistry if the practice is authorized under this chapter and is within the parameters of the collaborative management agreement.\n(a) A licensed dental therapist may supervise dental assistants to the extent permitted in the collaborative management agreement and according to section 150A.10, subdivision 2.\n(b) Notwithstanding paragraph (a), a licensed dental therapist is limited to supervising no more than four licensed dental assistants or nonlicensed dental assistants at any one practice setting.\n(a) For the purposes of this section, the following definitions apply.\n(b) \"Practice settings that serve the low-income and underserved\" mean:\n(1) critical access dental provider settings as designated by the commissioner of human services under section 256B.76, subdivision 4;\n(2) dental hygiene collaborative practice settings identified in section 150A.10, subdivision 1a, paragraph (e), and including medical facilities, assisted living facilities, federally qualified health centers, and organizations eligible to receive a community clinic grant under section 145.9268, subdivision 1;\n(3) military and veterans administration hospitals, clinics, and care settings;\n(4) a patient's residence or home when the patient is home-bound or receiving or eligible to receive home care services or home and community-based waivered services, regardless of the patient's income;\n(5) oral health educational institutions; or\n(6) any other clinic or practice setting, including mobile dental units, in which at least 50 percent of the total patient base of the dental therapist or advanced dental therapist consists of patients who:\n(i) are enrolled in a Minnesota health care program;\n(ii) have a medical disability or chronic condition that creates a significant barrier to receiving dental care;\n(iii) do not have dental health coverage, either through a public health care program or private insurance, and have an annual gross family income equal to or less than 200 percent of the federal poverty guidelines; or\n(iv) do not have dental health coverage, either through a state public health care program or private insurance, and whose family gross income is equal to or less than 200 percent of the federal poverty guidelines.\n(c) \"Dental health professional shortage area\" means an area that meets the criteria established by the secretary of the United States Department of Health and Human Services and is designated as such under United States Code, title 42, section 254e.",
	"repealed": false
}