{
	"id": "325F.722",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.722",
	"title": "325F.722 CONSUMER PROTECTIONS FOR EXEMPT SETTINGS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Exempt setting\" means a setting that is exempted from assisted living facility licensure under section 144G.08, subdivision 7, clauses (10) to (13).\n(c) \"Resident\" means a person residing in an exempt setting.\n(a) Every exempt setting must execute a written contract with a resident or the resident's representative and must operate in accordance with the terms of the contract. The resident or the resident's representative must be given a complete copy of the contract and all supporting documents and attachments and any changes whenever changes are made.\n(b) The contract must include at least the following elements in itself or through supporting documents or attachments:\n(1) the name, street address, and mailing address of the exempt setting;\n(2) the name and mailing address of the owner or owners of the exempt setting and, if the owner or owners are not natural persons, identification of the type of business entity of the owner or owners;\n(3) the name and mailing address of the managing agent, through management agreement or lease agreement, of the exempt setting, if different from the owner or owners;\n(4) the name and address of at least one natural person who is authorized to accept service of process on behalf of the owner or owners and managing agent;\n(5) a statement identifying the license number of the home care provider that provides services to some or all of the residents and that is either the setting itself or another entity with which the setting has an arrangement;\n(6) the term of the contract;\n(7) an itemization and description of the housing and, if applicable, services to be provided to the resident;\n(8) a conspicuous notice informing the resident of the policy concerning the conditions under which and the process through which the contract may be modified, amended, or terminated;\n(9) a description of the exempt setting's complaint resolution process available to residents including the toll-free complaint line for the Office of Ombudsman for Long-Term Care;\n(10) the individual designated as the resident's representative, if any;\n(11) the exempt setting's referral procedures if the contract is terminated;\n(12) a statement regarding the ability of a resident to receive services from providers with whom the exempt setting does not have an arrangement;\n(13) a statement regarding the availability of public funds for payment for residence or services; and\n(14) a statement regarding the availability of and contact information for long-term care consultation services under section 256B.0911 in the county in which the exempt setting is located.\n(c) The contract must include a statement regarding:\n(1) the ability of a resident to furnish and decorate the resident's unit within the terms of the lease;\n(2) a resident's right to access food at any time;\n(3) a resident's right to choose the resident's visitors and times of visits;\n(4) a resident's right to choose a roommate if sharing a unit; and\n(5) a resident's right to have and use a lockable door to the resident's unit. The exempt setting must provide the locks on the unit. Only a staff member with a specific need to enter the unit shall have keys, and advance notice must be given to the resident before entrance by the staff member, when possible.\n(d) A restriction of a resident's rights under this subdivision is allowed only if determined necessary for health and safety reasons identified by a home care provider's registered nurse in an initial assessment or reassessment, as defined under section 144A.4791, subdivision 8, and documented in the written service plan under section 144A.4791, subdivision 9. Any restrictions of those rights for people served under section 256B.49 and chapter 256S must be documented in the resident's support plan, as defined under sections 256B.49, subdivision 15, and 256S.10.\n(e) The contract and related documents executed by each resident or resident's representative must be maintained by the exempt setting in files from the date of execution until three years after the contract is terminated.\nAn exempt setting must include with notice of termination of contract information about how to contact the ombudsman for long-term care, including the address and telephone number, along with a statement of how to request problem-solving assistance.\n(a) Each exempt setting must meet the following requirements:\n(1) have a written emergency disaster plan that contains a plan for evacuation, addresses elements of sheltering in place, identifies temporary relocation sites, and details staff assignments in the event of a disaster or an emergency;\n(2) prominently post an emergency disaster plan;\n(3) provide building emergency exit diagrams to all residents upon signing a contract;\n(4) post emergency exit diagrams on each floor; and\n(5) have a written policy and procedure regarding missing residents.\n(b) Each exempt setting must provide emergency and disaster training to all staff during the initial staff orientation and annually thereafter and must make emergency and disaster training available to all residents annually. Staff who have not received emergency and disaster training are allowed to work only when trained staff are also working on site.\n(c) Each exempt setting location must conduct and document a fire drill or other emergency drill at least once every six months. To the extent possible, drills must be coordinated with local fire departments or other community emergency resources.\n(a) If an exempt setting has a special program or special care unit for residents with Alzheimer's disease or other dementias whether in a segregated or general unit, employees of the setting must meet the following training requirements:\n(1) supervisors of direct care staff must have completed at least eight hours of initial training on topics specified under paragraph (b) within 120 working hours of the employment start date and must complete at least two hours of training on topics related to dementia care for each 12 months of employment thereafter;\n(2) direct care employees must have completed at least eight hours of initial training on topics specified under paragraph (b) within 160 working hours of the employment start date. Until this initial training is complete, an employee must not provide direct care unless there is another employee on site who has completed the initial eight hours of training on topics related to dementia care and who can act as a resource and assist if issues arise. A trainer of the requirements under paragraph (b), or a supervisor meeting the requirements in clause (1), must be available for consultation with the new employee until the training requirement is complete. Direct care employees must complete at least two hours of training on topics related to dementia care for each 12 months of employment thereafter;\n(3) staff who do not provide direct care, including maintenance, housekeeping, and food service staff, must have completed at least four hours of initial training on topics specified under paragraph (b) within 160 working hours of the employment start date, and must complete at least two hours of training on topics related to dementia care for each 12 months of employment thereafter; and\n(4) new employees may satisfy the initial training requirements under clauses (1) to (3) by producing written proof of previously completed required training within the past 18 months.\n(b) Areas of required training include:\n(1) an explanation of Alzheimer's disease and related disorders;\n(2) assistance with activities of daily living;\n(3) problem-solving with challenging behaviors; and\n(4) communication skills.\n(c) The setting must provide to residents, and prospective residents upon request, in written or electronic form, a description of the training program, the categories of employees trained, the frequency of training, and the basic topics covered.\n(a) The person primarily responsible for oversight and management of the exempt setting, as designated by the owner, must obtain at least 30 hours of continuing education every two years of employment as the manager in topics relevant to the operations of the setting and the needs of its residents. Continuing education earned to maintain a professional license, such as a nursing home administrator license, assisted living facility director license, nursing license, social worker license, or real estate license, can be used to complete this requirement.\n(b) New managers may satisfy the initial dementia training requirements by producing written proof of previously completed required training within the past 18 months.\nResidents must be free from any physical or chemical restraints imposed for purposes of discipline or convenience.\nEach exempt setting must comply with chapter 504B, and must obtain and maintain all other licenses, permits, registrations, or other required governmental approvals. An exempt setting is not required to obtain a lodging license under chapter 157 and related rules.\nA state agency must make a good faith effort to reasonably resolve any dispute with an exempt setting before seeking any additional enforcement actions regarding the exempt setting's compliance with the requirements of this section. No private right of action may be maintained as provided under section 8.31, subdivision 3a.",
	"repealed": false
}