{
	"id": "120B.132",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.132",
	"title": "120B.132 RAISED ACADEMIC ACHIEVEMENT; ADVANCED PLACEMENT AND INTERNATIONAL BACCALAUREATE PROGRAMS.",
	"text": "(a) A program is established to raise kindergarten through grade 12 academic achievement through increased student participation in preadvanced placement, advanced placement, and international baccalaureate programs, consistent with section 120B.13. Schools and charter schools eligible to participate under this section must propose to further raise students' academic achievement by:\n(1) increasing the availability of and all students' access to advanced placement or international baccalaureate courses or programs;\n(2) expanding the breadth of advanced placement or international baccalaureate courses or programs that are available to students;\n(3) increasing the number and the diversity of the students who participate in advanced placement or international baccalaureate courses or programs and succeed;\n(4) providing low-income and other disadvantaged students with increased access to advanced placement or international baccalaureate courses and programs; or\n(5) increasing the number of high school students, including low-income and other disadvantaged students, who receive college credit by successfully completing advanced placement or international baccalaureate courses or programs and achieving satisfactory scores on related exams.\n(b) Within 90 days of receiving a grant under this section, a school district or charter school must:\n(1) adopt a three-year plan approved by the local school board to establish a new international baccalaureate program leading to international baccalaureate authorization, expand an existing program that leads to international baccalaureate authorization, or expand an existing authorized international baccalaureate program; or\n(2) adopt a three-year plan approved by the local school board to create a new program or expand an existing program to implement the college board advanced placement courses and exams or preadvanced placement initiative.\n(a) Charter schools and school districts in which eligible schools under subdivision 1 are located may apply to the commissioner, in the form and manner the commissioner determines, for competitive funding to further raise students' academic achievement. The application must detail the specific efforts the applicant intends to undertake in further raising students' academic achievement, consistent with subdivision 1, and a proposed budget detailing the district or charter school's current and proposed expenditures for advanced placement, preadvanced placement, and international baccalaureate courses and programs. The proposed budget must demonstrate that the applicant's efforts will support implementation of advanced placement, preadvanced placement, and international baccalaureate courses and programs. Expenditures for administration must not exceed five percent of the proposed budget. Priority for advanced placement grants must be given to grantees who add or expand offerings of advanced placement computer science principles. The commissioner may require an applicant to provide additional information.\n(b) When reviewing applications, the commissioner must determine whether the applicant satisfied all the requirements in this subdivision and subdivision 1. The commissioner may give funding priority to an otherwise qualified applicant that demonstrates:\n(1) a focus on developing or expanding preadvanced placement, advanced placement, or international baccalaureate courses or programs or increasing students' participation in, access to, or success with the courses or programs, including the participation, access, or success of low-income and other disadvantaged students;\n(2) a compelling need for access to preadvanced placement, advanced placement, or international baccalaureate courses or programs;\n(3) an effective ability to actively involve local business and community organizations in student activities that are integral to preadvanced placement, advanced placement, or international baccalaureate courses or programs;\n(4) access to additional public or nonpublic funds or in-kind contributions that are available for preadvanced placement, advanced placement, or international baccalaureate courses or programs;\n(5) an intent to implement activities that target low-income and other disadvantaged students; or\n(6) an intent to increase the advanced placement and international baccalaureate course offerings in science, technology, engineering, and math to low-income and other disadvantaged students.\n(a) The commissioner shall award grants to applicant school districts and charter schools that meet the requirements of subdivisions 1 and 2. The commissioner must award grants on an equitable geographical basis to the extent feasible and consistent with this section. Grant awards must not exceed $75,000 per district or charter school.\n(b) School districts and charter schools that submit an application and receive funding under this section must use the funding, consistent with the application, to:\n(1) provide teacher training and instruction to more effectively serve students, including low-income and other disadvantaged students, who participate in preadvanced placement, advanced placement, or international baccalaureate courses or programs;\n(2) further develop preadvanced placement, advanced placement, or international baccalaureate courses or programs;\n(3) improve the transition between grade levels to better prepare students, including low-income and other disadvantaged students, for succeeding in preadvanced placement, advanced placement, or international baccalaureate courses or programs;\n(4) purchase books and supplies;\n(5) pay course or program fees;\n(6) increase students' participation in and success with preadvanced placement, advanced placement, or international baccalaureate courses or programs;\n(7) expand students' access to preadvanced placement, advanced placement, or international baccalaureate courses or programs through online learning;\n(8) hire appropriately licensed personnel to teach additional advanced placement or international baccalaureate courses or programs; or\n(9) engage in other activities to expand low-income or disadvantaged students' access to, participation in, and success with preadvanced placement, advanced placement, or international baccalaureate courses or programs. Other activities may include but are not limited to preparing and disseminating promotional materials to low-income and other disadvantaged students and their families.\n(a) Each school district and charter school that receives a grant under this section annually must collect demographic and other student data to demonstrate and measure the extent to which the district or charter school raised students' academic achievement under this program and must report the data to the commissioner in the form and manner the commissioner determines. The commissioner annually by February 15 must make summary data about this program available to the education policy and finance committees of the legislature.\n(b) Each school district and charter school that receives a grant under this section annually must report to the commissioner, consistent with the Uniform Financial Accounting and Reporting Standards, its actual expenditures for advanced placement, preadvanced placement, and international baccalaureate courses and programs. The report must demonstrate that the school district or charter school has maintained its effort from other sources for advanced placement, preadvanced placement, and international baccalaureate courses and programs compared with the previous fiscal year, and the district or charter school has expended all grant funds, consistent with its approved budget.\n(c) Notwithstanding any law to the contrary, a grant under this section is available for three years from the date of the grant if the district or charter school meets the annual benchmarks in its plan under subdivision 1.",
	"repealed": false
}