{
	"id": "116J.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.55",
	"title": "116J.55 COMMUNITY ENERGY TRANSITION GRANTS.",
	"text": "For the purposes of this section, \"eligible community\" means a county, municipality, or tribal government located in Minnesota in which an electric generating plant owned by a public utility, as defined in section 216B.02, that is powered by coal, nuclear energy, or natural gas:\n(1) is currently operating and (i) is scheduled to cease operations, (ii) whose cessation of operations has been proposed in an integrated resource plan filed with the commission under section 216B.2422, or (iii) whose current operating license expires within 15 years of July 1, 2023; or\n(2) ceased operations or was removed from the local property tax base no earlier than five years before the date an application is made for a grant under this section.\nA community energy transition grant program is established in the department to award grants to assist eligible communities to address the economic dislocation associated with the closing of a local electric generating plant.\n(a) A community energy transition account is created in the special revenue fund in the state treasury. The commissioner shall credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. The commissioner shall manage the account.\n(b) Money in the account is appropriated to the commissioner for grants under this section and must be expended only as provided in this section.\n(a) Applications for a grant under this section must be made to the commissioner on a form developed by the commissioner.\n(b) A grant application made by a county must include a resolution of support from the legislative body in the city in which the electric generating plant is or was located.\n(a) A grant awarded to an eligible community under this section must not exceed $1,000,000 in any calendar year. The commissioner may accept grant applications on an ongoing or rolling basis.\n(b) Grants funded with revenues from the renewable development account established in section 116C.779 must be awarded to an eligible community located within the retail electric service territory of the public utility that is subject to section 116C.779 or to an eligible community in which an electric generating plant owned by that public utility is located.\n(a) Money in the account established in subdivision 3 must be used only to:\n(1) award grants to eligible communities under this section; and\n(2) reimburse the department's reasonable costs to administer this section, up to a maximum of five percent of the appropriation made to the commissioner under this section. The commissioner may transfer part of the allowable administrative portion of this appropriation to the Environmental Quality Board to assist communities with regulatory coordination and dedicated technical assistance on conversion for these communities.\n(b) An eligible community awarded a grant under this section may use the grant to plan for or address the economic and social impacts on the eligible community of the electric generating plant's cessation of operations, including but not limited to land use studies, economic planning, researching, planning, and implementing activities, capital costs of public infrastructure necessary for economic development, and impact studies and other planning activities enabling communities to become shovel-ready and support the transition from power plants to other economic activities to minimize the negative impacts of power plant closures on tax revenues and jobs designed to:\n(1) assist workers at the plant find new employment, including worker retraining and developing small business start-up skills;\n(2) increase the eligible community's property tax base; and\n(3) develop alternative economic development strategies to attract new employers to the eligible community.\nBy January 15, 2022, the commissioner must submit a report to the chairs and ranking minority members of the committees of the senate and house of representatives with jurisdiction over economic development and energy. The report must describe the number and amount of grants awarded under this section and the uses made of grant funds by eligible communities awarded grants.",
	"repealed": false
}