{
	"id": "148.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.105",
	"title": "148.105 VIOLATION.",
	"text": "Any person who practices, or attempts to practice, chiropractic or who uses any of the terms or letters \"Doctors of Chiropractic,\" \"Chiropractor,\" \"DC,\" or any other title or letters under any circumstances as to lead the public to believe that the person who so uses the terms is engaged in the practice of chiropractic, without having complied with the provisions of sections 148.01 to 148.104, is guilty of a gross misdemeanor; and, upon conviction, fined not less than $1,000 nor more than $10,000 or be imprisoned in the county jail for not less than 30 days nor more than six months or punished by both fine and imprisonment, in the discretion of the court. It is the duty of the county attorney of the county in which the person practices to prosecute. Nothing in sections 148.01 to 148.105 shall be considered as interfering with any person:\n(1) licensed by a health-related licensing board, as defined in section 214.01, subdivision 2, including psychological practitioners with respect to the use of hypnosis;\n(2) registered or licensed by the commissioner of health under section 214.13; or\n(3) engaged in other methods of healing regulated by law in the state of Minnesota;\nprovided that the person confines activities within the scope of the license or other regulation and does not practice or attempt to practice chiropractic.\nThe following persons shall not be in violation of subdivision 1:\n(1) a student practicing under the direct supervision of a preceptor while the student is enrolled in and regularly attending a recognized chiropractic college or chiropractic program;\n(2) a student who is in continuing training and performing the duties of an intern or resident or engaged in postgraduate work considered by the board to be the equivalent of an internship or residency in any institution approved for training by the board;\n(3) a doctor of chiropractic licensed in another state or jurisdiction who is in actual consultation in Minnesota;\n(4) a doctor of chiropractic licensed in another state or jurisdiction who is in this state for the sole purpose of providing chiropractic services at a competitive athletic event. The doctor of chiropractic may practice chiropractic only on participants in the athletic event;\n(5) a doctor of chiropractic licensed in another state or jurisdiction whose duties are entirely of a research, public health, or educational character and while directly engaged in such duties, and who is employed in a scientific, sanitary, or teaching capacity by: (i) an accredited institution; (ii) a public or private school, college, or other bona fide educational institution; (iii) a nonprofit organization which has tax-exempt status in accordance with the Internal Revenue Code, section 501(c)(3), and is organized and operated primarily for the purpose of conducting scientific research; or (iv) the state Department of Health;\n(6) a doctor of chiropractic licensed in another state or jurisdiction who treats the doctor of chiropractic's home state patients or other participating patients while the doctor of chiropractic and those patients are participating together in outdoor recreation in this state as defined by section 86A.03, subdivision 3; and\n(7) a person licensed in another state or jurisdiction who is a commissioned officer of, a member of, or employed by the armed forces of the United States, the United States Public Health Service, the Veterans Administration, any federal institution, or any federal agency while engaged in the performance of official duties within this state.",
	"repealed": false
}