{
	"id": "580.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.24",
	"title": "580.24 REDEMPTION BY CREDITOR.",
	"text": "(a) If no redemption is made by the mortgagor, the mortgagor's personal representatives or assigns, the most senior creditor having a legal or equitable lien upon the mortgaged premises, or some part of it, subsequent to the foreclosed mortgage, may redeem within seven days after the expiration of the redemption period determined under section 580.23 or 582.032, whichever is applicable; and each subsequent creditor having a lien may redeem, in the order of priority of their respective liens, within seven days after the time allowed the prior lienholder by paying the amount required under this section. However, no creditor is entitled to redeem unless, one week or more prior to the expiration of the period allowed for redemption by the mortgagor, the creditor:\n(1) records with each county recorder and registrar of titles where the foreclosed mortgage is recorded a notice of the creditor's intention to redeem;\n(2) records with each county recorder and registrar of titles where the notice of the creditor's intention to redeem is recorded all documents necessary to create the lien on the mortgaged premises and to evidence the creditor's ownership of the lien, including a copy of any money judgment necessary to create the lien; and\n(3) after complying with clauses (1) and (2), delivers to the sheriff who conducted the foreclosure sale or the sheriff's successor in office a copy of each of the documents required to be recorded under clauses (1) and (2), with the office, date and time of filing for record stated on the first page of each document.\nThe sheriff shall maintain for public inspection all documents delivered to the sheriff and shall note the date of delivery on each document. The sheriff may charge a fee of $100 for the documents delivered to the sheriff relating to each lien. The sheriff shall maintain copies of documents delivered to the sheriff for a period of six months after the end of the mortgagor's redemption period.\n(b) Saturdays, Sundays, legal holidays, and the first day following the expiration of the prior redemption period must be included in computing the seven-day redemption period. When the last day of the period falls on Saturday, Sunday, or a legal holiday, that day must be omitted from the computation. The order of redemption by judgment creditors subsequent to the foreclosed mortgage shall be determined by the order in which their judgments were entered as memorials on the certificate of title for the foreclosed premises or docketed in the office of the district court administrator if the property is not registered under chapter 508 or 508A, regardless of the homestead status of the property. All mechanic's lienholders who have coordinate liens shall have one combined seven-day period to redeem.\n(c) The amount required to redeem from the holder of the sheriff's certificate of sale is the amount required under section 580.23. The amount required to redeem from a person holding a certificate of redemption is:\n(1) the amount paid to redeem as shown on the certificate of redemption; plus\n(2) interest on that amount to the date of redemption; plus\n(3) the amount claimed due on the person's lien, as shown on the affidavit under section 580.25, clause (3).\nThe amount required to redeem may be paid to the holder of the sheriff's certificate of sale or the certificate of redemption, as the case may be, or to the sheriff for the holder.",
	"repealed": false
}