{
	"id": "190.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.09",
	"title": "190.09 POWERS, DUTIES.",
	"text": "The adjutant general shall be the chief of staff to the commander-in-chief and the administrative head of the Military Department. The adjutant general shall have an office in the Capitol and keep it open during the usual business hours.\nThe adjutant general shall have custody of all military records, correspondence, and other military documents. The adjutant general shall be the medium of military correspondence with the governor and perform all other duties pertaining to that office prescribed by law. The adjutant general shall make an annual report to the governor, at such time as the governor may require, of all the transactions of the Military Affairs Department, setting forth the number, strength and condition of the National Guard, and such other matters as deemed important and shall make and transmit to the federal government the returns required by the laws of the United States. The adjutant general shall, whenever necessary, cause the Military Code, orders and rules of the state to be printed and distributed to the commissioned officers and the several organizations of the National Guard and shall cause to be prepared and issued all necessary books, blanks and notices required to carry into full effect the provisions of the Military Code. All such books and blanks shall be and remain the property of the state.\nThe seal now used in the Office of the Adjutant General shall be the seal of that office and shall be delivered to the successor in that office. All orders issued from the Adjutant General's Office shall be authenticated with that seal. The adjutant general shall attest all commissions issued to military officers. The adjutant general will superintend the preparation of all returns and reports required by the United States from the state on military matters.\nThe adjutant general shall designate an assistant adjutant general to serve as deputy adjutant general to perform the duties of the adjutant general during periods when the adjutant general is absent or unable to perform that officer's duties. In the absence of all of the above, the senior officer of the National Guard, shall perform the duties prescribed for the adjutant general.\nThe flags and colors carried by Minnesota troops in the Civil War, Indian Wars, Spanish-American War, Mexican Border Campaign, the first World War, and subsequent wars shall be preserved in the Capitol under the especial care of the adjutant general. They shall be suitably encased and marked, and, so far as the adjutant general may deem it consistent with their safety, shall at all times be publicly displayed.\nIt is part of the department's mission that within the department's resources the adjutant general shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.",
	"repealed": false
}