{
	"id": "148.7809",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.7809",
	"title": "148.7809 LICENSE RENEWAL.",
	"text": "An athletic trainer license issued under section 148.7808 expires annually. To renew a license, an athletic trainer shall pay a fee as required by section 148.7815 and complete a renewal application on a form provided by the board that includes:\n(1) the athletic trainer's name, Minnesota athletic trainer license number, home address and telephone number, business address and telephone number, and business setting;\n(2) work history for the past year, including the average number of hours worked per week;\n(3) a report of any change in status since initial licensure or previous license renewal;\n(4) evidence satisfactory to the board of having met the continuing education requirements of section 148.7812;\n(5) the athletic trainer's signature on a statement that a current copy of the protocol form is on file at the athletic trainer's primary employment site;\n(6) any history of drug or alcohol abuse, and any misdemeanor or felony conviction; and\n(7) any disciplinary action on any credential held in this state or in another jurisdiction.\nThe board shall annually send out a renewal notice to an athletic trainer's last known address on file with the board. The notice shall include an application for license renewal and notice of the fees required for renewal. An athletic trainer who does not receive a renewal notice must still meet the requirements for license renewal under this section.\n(a) An application for renewal of licensure must be postmarked on or before July 1 of each year. If the postmark is illegible, the application is considered timely if received in the board office by the third working day after July 1.\n(b) An application for renewal of licensure submitted after the deadline date must include a late fee under section 148.7815.\n(a) In order to regain licensed status, an athletic trainer whose license has lapsed for two years or less must:\n(1) apply for license renewal under subdivision 1;\n(2) document compliance with the continuing education requirements in section 148.7812 since the athletic trainer's initial licensure or last renewal; and\n(3) submit the fees required by section 148.7815 for the period the athletic trainer was not licensed, including the fee for late renewal.\n(b) The board shall not renew, reissue, reinstate, or restore a license that has lapsed after June 30, 1999, and has not been renewed within two annual renewal cycles starting July 1, 2001. An athletic trainer whose license is canceled for nonrenewal must obtain a new license by applying for licensure and fulfilling all requirements then in existence for an initial license.",
	"repealed": false
}