{
	"id": "122A.635",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.635",
	"title": "122A.635 COLLABORATIVE URBAN AND GREATER MINNESOTA EDUCATORS OF COLOR GRANT PROGRAM.",
	"text": "The Professional Educator Licensing and Standards Board must award competitive grants to increase the number of teacher candidates who are of color or who are American Indian, complete teacher preparation programs, and meet the requirements for a Tier 3 license under section 122A.183. Eligibility for a grant under this section is limited to public or private higher education institutions that offer a teacher preparation program approved by the Professional Educator Licensing and Standards Board.\n(a) The Professional Educator Licensing and Standards Board must award competitive grants to a variety of higher education institution types under this section. The board must require an applicant institution to submit a plan describing how it would use grant funds to increase the number of teachers who are of color or who are American Indian, and must award grants based on the following criteria, listed in descending order of priority:\n(1) program outcomes, including graduation or program completion rates and licensure recommendation rates for candidates who are of color or who are American Indian compared to all candidates enrolled in a teacher preparation program at the institution and, for each outcome measure, the number of teacher candidates who are of color or who are American Indian;\n(2) the extent to which an institution's plan is clear in describing how the institution would use grant funds for implementing explicit research-based practices to provide programmatic support to teacher candidates who are of color or who are American Indian. Plans for grant funds may include:\n(i) recruiting more racially and ethnically diverse candidates for admission to teacher preparation programs;\n(ii) providing differentiated advising, mentoring, or other supportive community-building activities in addition to what the institution provides to all candidates enrolled in the institution;\n(iii) providing academic tutoring or support to help teacher candidates pass required assessments; and\n(iv) providing for program staffing expenses;\n(3) an institution's plan to provide direct financial assistance as scholarships or stipends within the allowable dollar range determined by the board under subdivision 3, paragraph (b), to teacher candidates who are of color or who are American Indian;\n(4) whether the institution has previously received a competitive grant under this section and has demonstrated positive outcomes from the use of grant funds for efforts helping teacher candidates who are of color or who are American Indian to enroll in and successfully complete teacher preparation programs and be recommended for licensure;\n(5) geographic diversity among the institutions. In order to expand the number of grant recipients throughout the state, whenever there is at least a 20 percent increase in the base appropriation for this grant program, the board must prioritize awarding grants to institutions outside of the Twin Cities metropolitan area. If the board awards a grant based on the criteria in paragraph (a) to a program that has not previously received funding, the board must thereafter give priority to the program equivalent to other programs that have received grants and demonstrated positive outcomes; and\n(6) the percentage of racially and ethnically diverse teacher candidates enrolled in the institution compared to:\n(i) the aggregate percentage of students of color and American Indian students enrolled in the institution, regardless of major; and\n(ii) the percentage of underrepresented racially and ethnically diverse teachers in the economic development region of the state where the institution is located and where a shortage of diverse teachers exists, as reported under section 122A.091, subdivision 5.\n(b) The board must not penalize an applicant institution in the grant review process for using grant funds only to provide direct financial support to teacher candidates if that is the institution's priority and the institution uses other resources to provide programmatic support to candidates.\n(c) The board must determine award amounts for development, maintenance, or expansion of programs based only on the degree to which applicants meet the criteria in this subdivision, the number of candidates who are of color or who are American Indian supported by an applicant program, and funds available.\n(d) The board must determine grant awards in part by multiplying the number of teacher candidates to be provided direct financial assistance by the average amount the institution proposes per candidate that is within the allowable dollar range. After assessing an institution's adherence to grant criteria and funds available, the board may grant an institution a lower average amount per candidate and the institution may decide to award less per candidate or provide financial assistance to fewer candidates within the allowable range. Additionally, an institution may use up to 25 percent of the awarded grant funds to provide programmatic support as described in paragraph (a), clause (3). If the board does not award an applicant institution's full request, the board must allow the institution to modify how it uses grant funds to maximize program outcomes consistent with the requirements of this section.\n(a) The Professional Educator Licensing and Standards Board may enter into an interagency agreement with the Office of Higher Education. The agreement may include a transfer of funds to the Office of Higher Education to help establish and administer the competitive grant process. The board must award grants to institutions located in various economic development regions throughout the state, but must not predetermine the number of institutions to be awarded grants under this section or set a limit for the amount that any one institution may receive as part of the competitive grant application process.\n(b) The board must establish a standard allowable dollar range for the amount of direct financial assistance an applicant institution may provide to each candidate. To determine the range, the board may collect de-identified data from institutions that received a grant during the previous grant period and calculate the average scholarship amount awarded to all candidates across all institutions using the most recent fiscal year data available. The calculation may be used to determine a scholarship range that is no more than 25 percent of this amount and no less than half the average of this amount. The purpose of direct financial assistance is to assist candidates matriculating through completing licensure programs if they demonstrate financial need after considering other grants and scholarships provided.\n(c) All grants must be awarded by August 15 of the fiscal year in which the grants are to be used. An institution that receives a grant under this section may use the grant funds over a two- to four-year period to sustain support for teacher candidates at any stage from recruitment and program admission to graduation and licensure application.\n(a) By August 15 of each year, an institution awarded a grant under this section must prepare for the board a detailed report regarding the expenditure of grant funds, including the amounts used to recruit, retain, and support teacher candidates of color or American Indian teacher candidates to complete programs and be recommended for licensure. The report must include:\n(1) the total number of teacher candidates of color and American Indian teacher candidates who:\n(i) are enrolled in the institution;\n(ii) are supported by grant funds with direct financial assistance during the academic reporting year;\n(iii) are supported with other programmatic supports;\n(iv) are recruited and newly admitted to a licensure program;\n(v) are enrolled in a licensure program;\n(vi) have completed a licensure program; and\n(vii) were recommended for licensure in the field for which they were prepared;\n(2) the total number of teacher candidates of color or American Indian teacher candidates at each stage from program admission to licensure recommendation as a percentage of all candidates seeking the same licensure at the institution; and\n(3) a brief narrative describing the successes and challenges of efforts proposed in the grant application to support candidates with grant funds, and lessons learned for future efforts.\n(b) By November 1 of each year, the board must post a report on its website summarizing the activities and outcomes of grant recipients and results that promote sharing of effective practices and lessons learned among grant recipients.",
	"repealed": false
}