{
	"id": "297A.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.94",
	"title": "297A.94 DEPOSIT OF REVENUES.",
	"text": "(a) Except as provided in this section, the commissioner shall deposit the revenues, including interest and penalties, derived from the taxes imposed by this chapter in the state treasury and credit them to the general fund.\n(b) The commissioner shall deposit taxes in the Minnesota agricultural and economic account in the special revenue fund if:\n(1) the taxes are derived from sales and use of property and services purchased for the construction and operation of an agricultural resource project; and\n(2) the purchase was made on or after the date on which a conditional commitment was made for a loan guaranty for the project under section 41A.04, subdivision 3.\nThe commissioner of management and budget shall certify to the commissioner the date on which the project received the conditional commitment. The amount deposited in the loan guaranty account must be reduced by any refunds and by the costs incurred by the Department of Revenue to administer and enforce the assessment and collection of the taxes.\n(c) The commissioner shall deposit the revenues, including interest and penalties, derived from the taxes imposed on sales and purchases included in section 297A.61, subdivision 3, paragraph (g), clauses (1) and (4), in the state treasury, and credit them as follows:\n(1) first to the general obligation special tax bond debt service account in each fiscal year the amount required by section 16A.661, subdivision 3, paragraph (b); and\n(2) after the requirements of clause (1) have been met, the balance to the general fund.\n(d) Beginning with sales taxes remitted after July 1, 2017, the commissioner shall deposit in the state treasury the revenues collected under section 297A.64, subdivision 1, including interest and penalties and minus refunds, and credit them to the highway user tax distribution fund.\n(e) The commissioner shall deposit the revenues, including interest and penalties, collected under section 297A.64, subdivision 5, in the state treasury and credit them to the general fund. By July 15 of each year the commissioner shall transfer to the highway user tax distribution fund an amount equal to the excess fees collected under section 297A.64, subdivision 5, for the previous calendar year.\n(f) Beginning with sales taxes remitted after July 1, 2017, in conjunction with the deposit of revenues under paragraph (d), the commissioner shall deposit into the state treasury and credit to the highway user tax distribution fund an amount equal to the estimated revenues derived from the tax rate imposed under section 297A.62, subdivision 1, on the lease or rental for not more than 28 days of rental motor vehicles subject to section 297A.64. The commissioner shall estimate the amount of sales tax revenue deposited under this paragraph based on the amount of revenue deposited under paragraph (d).\n(g) The commissioner must deposit the revenues derived from the taxes imposed under section 297A.62, subdivision 1, on the sale and purchase of motor vehicle repair and replacement parts in the state treasury and credit:\n(1) 43.5 percent in each fiscal year to the highway user tax distribution fund;\n(2) a percentage to the transportation advancement account under section 174.49 as follows:\n(i) 3.5 percent in fiscal year 2024;\n(ii) 4.5 percent in fiscal year 2025;\n(iii) 5.5 percent in fiscal year 2026;\n(iv) 7.5 percent in fiscal year 2027;\n(v) 14.5 percent in fiscal year 2028;\n(vi) 21.5 percent in fiscal year 2029;\n(vii) 28.5 percent in fiscal year 2030;\n(viii) 36.5 percent in fiscal year 2031;\n(ix) 44.5 percent in fiscal year 2032; and\n(x) 56.5 percent in fiscal year 2033 and thereafter; and\n(3) the remainder in each fiscal year to the general fund.\nFor purposes of this paragraph, \"motor vehicle\" has the meaning given in section 297B.01, subdivision 11, and \"motor vehicle repair and replacement parts\" includes (i) all parts, tires, accessories, and equipment incorporated into or affixed to the motor vehicle as part of the motor vehicle maintenance and repair, and (ii) paint, oil, and other fluids that remain on or in the motor vehicle as part of the motor vehicle maintenance or repair. For purposes of this paragraph, \"tire\" means any tire of the type used on highway vehicles, if wholly or partially made of rubber and if marked according to federal regulations for highway use.\n(h) 81.56 percent of the revenues, including interest and penalties, transmitted to the commissioner under section 297A.65, must be deposited by the commissioner in the state treasury as follows:\n(1) 47.5 percent of the receipts must be deposited in the heritage enhancement account in the game and fish fund, and may be spent only on activities that improve, enhance, or protect fish and wildlife resources, including conservation, restoration, and enhancement of land, water, and other natural resources of the state;\n(2) 22.5 percent of the receipts must be deposited in the natural resources fund, and may be spent only for state parks and trails;\n(3) 22.5 percent of the receipts must be deposited in the natural resources fund, and may be spent only on metropolitan park and trail grants;\n(4) three percent of the receipts must be deposited in the natural resources fund, and may be spent only on local trail grants;\n(5) two percent of the receipts must be deposited in the natural resources fund, and may be spent only for the Minnesota Zoological Garden, the Como Park Zoo and Conservatory, and the Duluth Zoo; and\n(6) 2.5 percent of the receipts must be deposited in the pollinator account established in section 103B.101, subdivision 19.\n(i) 1.5 percent of the revenues, including interest and penalties, transmitted to the commissioner under section 297A.65 must be deposited in a regional parks and trails account in the natural resources fund and may only be spent for parks and trails of regional significance outside of the seven-county metropolitan area under section 85.535, based on recommendations from the Greater Minnesota Regional Parks and Trails Commission under section 85.536.\n(j) 1.5 percent of the revenues, including interest and penalties, transmitted to the commissioner under section 297A.65 must be deposited in an outdoor recreational opportunities for underserved communities account in the natural resources fund and may only be spent on projects and activities that connect diverse and underserved Minnesotans through expanding cultural environmental experiences, exploration of their environment, and outdoor recreational activities.\n(k) The revenue dedicated under paragraph (h) may not be used as a substitute for traditional sources of funding for the purposes specified, but the dedicated revenue shall supplement traditional sources of funding for those purposes. Land acquired with money deposited in the game and fish fund under paragraph (h) must be open to public hunting and fishing during the open season, except that in aquatic management areas or on lands where angling easements have been acquired, fishing may be prohibited during certain times of the year and hunting may be prohibited. At least 87 percent of the money deposited in the game and fish fund for improvement, enhancement, or protection of fish and wildlife resources under paragraph (h) must be allocated for field operations.\n(l) The commissioner must deposit the revenues, including interest and penalties minus any refunds, derived from the sale of items regulated under section 624.20, subdivision 1, that may be sold to persons 18 years old or older and that are not prohibited from use by the general public under section 624.21, in the state treasury and credit:\n(1) 25 percent to the volunteer fire assistance grant account established under section 88.068;\n(2) 25 percent to the fire safety account established under section 297I.06, subdivision 3; and\n(3) the remainder to the general fund.\nFor purposes of this paragraph, the percentage of total sales and use tax revenue derived from the sale of items regulated under section 624.20, subdivision 1, that are allowed to be sold to persons 18 years old or older and are not prohibited from use by the general public under section 624.21, is a set percentage of the total sales and use tax revenues collected in the state, with the percentage determined under Laws 2017, First Special Session chapter 1, article 3, section 39.\n(m) The revenues deposited under paragraphs (a) to (l) do not include the revenues, including interest and penalties, generated by the sales tax imposed under section 297A.62, subdivision 1a, which must be deposited as provided under the Minnesota Constitution, article XI, section 15.",
	"repealed": false
}