{
	"id": "47.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.51",
	"title": "47.51 DETACHED BANKING FACILITIES; DEFINITIONS.",
	"text": "As used in sections 47.51 to 47.57:\n\"Extension of the main banking house\" means any structure or stationary mechanical device serving as a drive-in or walk-up facility, or both, which is located within 1,500 feet of the main banking house or detached facility, the distance to be measured in a straight line from the closest points of the closest structures involved and which performs one or more of the functions described in section 47.53. An unstaffed after-hour depository drop box located anywhere within the municipality where the bank's main office or detached facility is located is also considered an extension of the main banking house even if it is not located within 1,500 feet of the main banking house or detached facility.\n\"Detached facility\" means any permanent structure, office accommodation located within the premises of any existing commercial or business establishment, stationary automated remote controlled teller facility, stationary unstaffed cash dispensing or receiving device, located separate and apart from the main banking house which is not an \"extension of the main banking house\" as above defined, that serves as a drive-in or walk-up facility, or both, with one or more tellers windows, or as a remote controlled teller facility or a cash dispensing or receiving device, and which performs one or more of those functions described in section 47.53.\n\"Bank\" means a bank as defined in section 46.046 and any banking office established prior to the effective date of Laws 1923, chapter 170, section 1.\n\"Commissioner\" means the commissioner of commerce.\n\"Municipality\" means the geographical area encompassing the boundaries of any home rule charter or statutory city located in this state, and any detached area, pursuant to section 473.625, operated as a major airport by the Metropolitan Airports Commission pursuant to sections 473.601 to 473.679. When a bank is located in a township, the term municipality is expanded to mean the geographical area encompassing the boundaries of the township.",
	"repealed": false
}