{
	"id": "182.664",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.664",
	"title": "182.664 OCCUPATIONAL SAFETY AND HEALTH REVIEW BOARD.",
	"text": "There is hereby created the Occupational Safety and Health Review Board, consisting of three members to be appointed by the governor. The governor shall designate one member to serve as chair. The review board members shall be chosen so that one shall represent management; one shall represent labor; and one shall represent the general public. The members shall be chosen from persons qualified by education, training or experience to carry out the functions of the board. Service on such board for a term shall not render a person ineligible for reappointment.\nThe membership terms, compensation, removal of members, and filling of vacancies on the board shall be as provided in section 15.0575.\n[Repealed, 1991 c 233 s 110]\nThe review board shall review and decide appeals from final decisions and orders of the commissioner, including decisions issued by administrative law judges, petitions to vacate final orders of the commissioner, and with the agreement of the parties, may review and decide petitions for decisions based on stipulated facts. The powers of the board in the conduct of hearings, including the power to sign decisions and orders, may be delegated to a member, members, or the board chair. The board may schedule a hearing for purposes of taking oral argument. A notice stating the time and place of the hearing must be given ten days in advance of such a hearing to the parties and copies of the notice of such hearing shall be served by the employer as rules of the board shall require. The hearings shall be open to the public and the board's decisions and orders shall be maintained and available for examination. Chapter 13D does not apply to meetings or hearings of the board when the board is deliberating to reach its decision on an appeal or petition under its jurisdiction.\nIt shall be the duty of the department to provide such equipment, supplies, clerical assistance, and other needs, as the board may reasonably require.\n(a) For the purpose of carrying out its functions under this chapter, two members of the board shall constitute a quorum and official action can be taken only on the affirmative vote of at least two members. The decisions and orders of an administrative law judge, or final orders of the commissioner, may be appealed to the review board by the employer, employee, or their authorized representatives or any party, within 30 days following service by mail of the administrative law judge's decision and order, or final order of the commissioner.\n(b) The review board shall have authority to revise, affirm, remand, or reverse the decision and order of administrative law judges.\n(c) The review board shall also have authority to affirm, or vacate and remand, final orders of the commissioner when a petition to vacate a final order is filed. The board shall only vacate and remand a final order of the commissioner relating to a petition to vacate upon a showing of good cause. For purposes of this section, good cause is limited to fraud, mistake of fact by the commissioner, mistake of law by the commissioner, or newly discovered evidence.",
	"repealed": false
}