{
	"id": "84.632",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.632",
	"title": "84.632 CONVEYANCE OF UNNEEDED STATE EASEMENTS.",
	"text": "(a) Notwithstanding section 92.45, the commissioner of natural resources may, in the name of the state, release all or part of an easement acquired by the state upon application of a landowner whose property is burdened with the easement if the easement is not needed for state purposes.\n(b) All or part of an easement may be released by payment of the market value of the easement. The release must be in a form approved by the attorney general.\n(c) Money received under paragraph (b) must be credited to the account from which money was expended for purchase of the easement. If there is no specific account, the money must be credited to the land acquisition account established in section 94.165.\n(d) In addition to payment under paragraph (b), the commissioner of natural resources shall assess a landowner who applies for a release under this section an application fee of $2,000 for reviewing the application and preparing the release of easement. The applicant shall pay the application fee to the commissioner of natural resources. The commissioner shall not issue the release of easement until the applicant has paid the application fee in full. The commissioner shall not return the application fee, even if the application is withdrawn or denied.\n(e) Money received under paragraph (d) must be credited to the land management account in the natural resources fund and is appropriated to the commissioner of natural resources to cover the reasonable costs incurred under this section.\n(f) Notwithstanding paragraphs (a) to (e), the commissioner of natural resources may elect to assume the application fee under paragraph (d) and waive or assume some or all of the remaining fees and costs imposed under this section if the commissioner determines that issuing the easement release will benefit the state's land management interests.",
	"repealed": false
}