{
	"id": "62Q.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.55",
	"title": "62Q.55 EMERGENCY SERVICES.",
	"text": "(a) Enrollees have the right to available and accessible emergency services, 24 hours a day and seven days a week. The health plan company shall inform its enrollees how to obtain emergency care for treatment of emergency medical conditions. Emergency services shall be covered whether provided by participating or nonparticipating providers and whether provided within or outside the health plan company's service area. In reviewing a denial for coverage of emergency services, the health plan company shall take the following factors into consideration:\n(1) a reasonable layperson's belief that the circumstances required immediate medical care that could not wait until the next working day or next available clinic appointment;\n(2) the time of day and day of the week the care was provided;\n(3) the presenting symptoms, including, but not limited to, severe pain, to ensure that the decision to reimburse the emergency care is not made solely on the basis of the actual diagnosis;\n(4) the enrollee's efforts to follow the health plan company's established procedures for obtaining emergency care; and\n(5) any circumstances that precluded use of the health plan company's established procedures for obtaining emergency care.\n(b) The health plan company may require enrollees to notify the health plan company of nonreferred emergency care as soon as possible, but not later than 48 hours, after the emergency care is initially provided. However, emergency care which would have been covered under the contract had notice been provided within the set time frame must be covered.\n(c) Notwithstanding paragraphs (a) and (b), a health plan company that is in compliance with the rules regarding accessibility of services adopted under section 62D.20 is in compliance with this section.\nFor purposes of this section, \"emergency medical condition\" means a medical condition manifesting itself by acute symptoms of sufficient severity, including severe pain, such that a prudent layperson, who possesses an average knowledge of health and medicine, could reasonably expect the absence of immediate medical attention to result in a condition described in clause (i), (ii), or (iii), of section 1867(e)(1)(A) of the Social Security Act.\nAs used in this section, \"emergency services\" means, with respect to an emergency medical condition:\n(1) a medical screening examination, as required under section 1867 of the Social Security Act, that is within the capability of the emergency department of a hospital, including ancillary services routinely available to the emergency department to evaluate such emergency medical condition;\n(2) within the capabilities of the staff and facilities available at the hospital, such further medical examination and treatment as are required under section 1867 of the Social Security Act to stabilize the patient; and\n(3) emergency services as defined in sections 245.462, subdivision 11, and 245.4871, subdivision 14.\nFor purposes of this section, \"stabilize,\" with respect to an emergency medical condition, has the meaning given in section 1867(e)(3) of the Social Security Act, United States Code, title 42, section 1395dd(e)(3).\nIf emergency services are provided by a nonparticipating provider, with or without prior authorization, the health plan company shall not impose coverage restrictions or limitations that are more restrictive than apply to emergency services received from a participating provider. Cost-sharing requirements that apply to emergency services received out-of-network must be the same as the cost-sharing requirements that apply to services received in-network and shall count toward the in-network deductible. All coverage and charges for emergency services must comply with the No Surprises Act.",
	"repealed": false
}