{
	"id": "256B.094",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.094",
	"title": "256B.094 CHILD WELFARE TARGETED CASE MANAGEMENT SERVICES.",
	"text": "\"Child welfare targeted case management services\" means activities that coordinate social and other services designed to help the child under age 21 and the child's family gain access to needed social services, mental health services, habilitative services, educational services, health services, vocational services, recreational services, and related services including, but not limited to, the areas of volunteer services, advocacy, transportation, and legal services. Case management services include developing an individual service plan and assisting the child and the child's family in obtaining needed services through coordination with other agencies and assuring continuity of care. Case managers must assess the delivery, appropriateness, and effectiveness of services on a regular basis.\nServices eligible for medical assistance reimbursement include:\n(1) assessment of the recipient's need for case management services to gain access to medical, social, educational, and other related services;\n(2) development, completion, and regular review of a written individual service plan based on the assessment of need for case management services to ensure access to medical, social, educational, and other related services;\n(3) routine contact or other communication with the client, the client's family, primary caregiver, legal representative, substitute care provider, service providers, or other relevant persons identified as necessary to the development or implementation of the goals of the individual service plan, regarding the status of the client, the individual service plan, or the goals for the client, exclusive of transportation of the child;\n(4) coordinating referrals for, and the provision of, case management services for the client with appropriate service providers, consistent with section 1902(a)(23) of the Social Security Act;\n(5) coordinating and monitoring the overall service delivery to ensure quality of services;\n(6) monitoring and evaluating services on a regular basis to ensure appropriateness and continued need;\n(7) completing and maintaining necessary documentation that supports and verifies the activities in this subdivision;\n(8) traveling to conduct a visit with the client or other relevant person necessary to the development or implementation of the goals of the individual service plan; and\n(9) coordinating with the medical assistance facility discharge planner in the 30-day period before the client's discharge into the community. This case management service provided to patients or residents in a medical assistance facility is limited to a maximum of two 30-day periods per calendar year.\n(a) In a county or reservation where a prepaid medical assistance provider has contracted under section 256B.69 to provide mental health services, the case management provider shall coordinate with the prepaid provider to ensure that all necessary mental health services required under the contract are provided to recipients of case management services.\n(b) When the case management provider determines that a prepaid provider is not providing mental health services as required under the contract, the case management provider shall assist the recipient to appeal the prepaid provider's denial pursuant to section 256.045, and may make other arrangements for provision of the covered services.\n(c) The case management provider may bill the provider of prepaid health care services for any mental health services provided to a recipient of case management services which the county or tribal social services arranges for or provides and which are included in the prepaid provider's contract, and which were determined to be medically necessary as a result of an appeal pursuant to section 256.045. The prepaid provider must reimburse the mental health provider, at the prepaid provider's standard rate for that service, for any services delivered under this subdivision.\n(d) If the county or tribal social services has not obtained prior authorization for this service, or an appeal results in a determination that the services were not medically necessary, the county or tribal social services may not seek reimbursement from the prepaid provider.\nTo be eligible to receive medical assistance reimbursement, the case management provider must meet all provider qualification and certification standards under section 256F.10.\nTo provide case management services, a case manager must be employed or contracted by and authorized by the case management provider to provide case management services and meet all requirements under section 256F.10.\n(a) Medical assistance reimbursement for services under this section shall be made on a monthly basis. Payment is based on face-to-face contacts either in person or by interactive video, or telephone contacts between the case manager and the client, client's family, primary caregiver, legal representative, or other relevant person identified as necessary to the development or implementation of the goals of the individual service plan regarding the status of the client, the individual service plan, or the goals for the client. These contacts must meet the following requirements:\n(1) there must be a face-to-face contact either in person or by interactive video that meets the requirements of section 256B.0625, subdivision 20b, at least once a month except as provided in clause (2); and\n(2) for a client placed outside of the county of financial responsibility, or a client served by tribal social services placed outside the reservation, in an excluded time facility under section 256G.02, subdivision 6, or through the Interstate Compact for the Placement of Children, section 260.93, and the placement in either case is more than 60 miles beyond the county or reservation boundaries, there must be at least one contact per month and not more than two consecutive months without a face-to-face, in-person contact.\n(b) Except as provided under paragraph (c), the payment rate is established using time study data on activities of provider service staff and reports required under sections 245.482 and 256.01, subdivision 2, paragraph (o).\n(c) Payments for tribes may be made according to section 256B.0625 or other relevant federally approved rate setting methodology for child welfare targeted case management provided by Indian health services and facilities operated by a tribe or tribal organization.\n(d) Payment for case management provided by county contracted vendors must be calculated in accordance with section 256B.076, subdivision 2. Payment for case management provided by vendors who contract with a Tribe must be based on a monthly rate negotiated by the Tribe. The rate must not exceed the rate charged by the vendor for the same service to other payers. If the service is provided by a team of contracted vendors, the team shall determine how to distribute the rate among its members. No reimbursement received by contracted vendors shall be returned to the county or tribal social services, except to reimburse the county or tribal social services for advance funding provided by the county or tribal social services to the vendor.\n(e) If the service is provided by a team that includes contracted vendors and county or tribal social services staff, the costs for county or tribal social services staff participation in the team shall be included in the rate for county or tribal social services provided services. In this case, the contracted vendor and the county or tribal social services may each receive separate payment for services provided by each entity in the same month. To prevent duplication of services, each entity must document, in the recipient's file, the need for team case management and a description of the roles and services of the team members.\nSeparate payment rates may be established for different groups of providers to maximize reimbursement as determined by the commissioner. The payment rate will be reviewed annually and revised periodically to be consistent with the most recent time study and other data. Payment for services will be made upon submission of a valid claim and verification of proper documentation described in subdivision 7. Federal administrative revenue earned through the time study, or under paragraph (c), shall be distributed according to earnings, to counties, reservations, or groups of counties or reservations which have the same payment rate under this subdivision, and to the group of counties or reservations which are not certified providers under section 256F.10. The commissioner shall modify the requirements set out in Minnesota Rules, parts 9550.0300 to 9550.0370, as necessary to accomplish this.\n(a) The assessment, case finding, and individual service plan shall be maintained in the individual case record under the Data Practices Act, chapter 13. The individual service plan must be reviewed at least annually and updated as necessary. Each individual case record must maintain documentation of routine, ongoing, contacts and services. Each claim must be supported by written documentation in the individual case record.\n(b) Each claim must include:\n(1) the name of the recipient;\n(2) the date of the service;\n(3) the name of the provider agency and the person providing service;\n(4) the nature and extent of services; and\n(5) the place of the services.\nServices that are not eligible for payment as a child welfare targeted case management service include, but are not limited to:\n(1) assessments prior to opening a case;\n(2) therapy and treatment services;\n(3) legal services, including legal advocacy, for the client;\n(4) information and referral services that are not provided to an eligible recipient;\n(5) outreach services including outreach services provided through the community support services program;\n(6) services that are not documented as required under subdivision 7 and Minnesota Rules, parts 9505.2165 and 9505.2175;\n(7) services that are otherwise eligible for payment on a separate schedule under rules of the Department of Human Services;\n(8) services to a client that duplicate the same case management service from another case manager;\n(9) case management services provided to patients or residents in a medical assistance facility except as described under subdivision 2, clause (9); and\n(10) for children in foster care, group homes, or residential care, payment for case management services is limited to case management services that focus on permanency planning or return to the family home and that do not duplicate the facility's discharge planning services.",
	"repealed": false
}