{
	"id": "302A.727",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.727",
	"title": "302A.727 DISSOLUTION PROCEDURE FOR CORPORATIONS THAT GIVE NOTICE TO CREDITORS AND CLAIMANTS.",
	"text": "When a notice of intent to dissolve has been filed with the secretary of state, the corporation may give notice of the filing to each creditor of and claimant against the corporation known or unknown, present or future, and contingent or noncontingent. If notice to creditors and claimants is given, it must be given by publishing the notice once each week for four successive weeks in a legal newspaper in the county or counties where the registered office and the principal executive office of the corporation are located and by giving written notice to known creditors and claimants pursuant to section 302A.011, subdivision 17.\nThe notice to creditors and claimants shall contain:\n(a) a statement that the corporation is in the process of dissolving;\n(b) a statement that the corporation has filed with the secretary of state a notice of intent to dissolve;\n(c) the date of filing the notice of intent to dissolve;\n(d) the address of the office to which written claims against the corporation must be presented; and\n(e) the date by which all the claims must be received, which shall be the later of 90 days after published notice or, with respect to a particular known creditor or claimant, 90 days after the date on which written notice was given to that creditor or claimant. Published notice is deemed given on the date of first publication for the purpose of determining this date.\n(a) A corporation that gives notice to creditors and claimants has 30 days from the receipt of each claim filed according to the procedures set forth by the corporation on or before the date set forth in the notice to accept or reject the claim by giving written notice to the person submitting it; a claim not expressly rejected in this manner is deemed accepted.\n(b) A creditor or claimant to whom notice is given and whose claim is rejected by the corporation has 60 days from the date of rejection, 180 days from the date the corporation filed with the secretary of state the notice of intent to dissolve, or 90 days after the date on which notice was given to the creditor or claimant, whichever is longer, to pursue any other remedies with respect to the claim.\n(c) A creditor or claimant to whom notice is given who fails to file a claim according to the procedures set forth by the corporation on or before the date set forth in the notice is barred from suing on that claim or otherwise realizing upon or enforcing it, except as provided in section 302A.781.\n(d) A creditor or claimant whose claim is rejected by the corporation under paragraph (b) is barred from suing on that claim or otherwise realizing upon or enforcing it, if the creditor or claimant does not initiate legal, administrative, or arbitration proceedings with respect to the claim within the time provided in paragraph (b).\nArticles of dissolution for a corporation that has given notice to creditors and claimants under this section must be filed with the secretary of state after:\n(1) the 90-day period in subdivision 2, paragraph (e), has expired and the payment of claims of all creditors and claimants filing a claim within that period has been made or provided for; or\n(2) the longest of the periods described in subdivision 3, paragraph (b), has expired and there are no pending legal, administrative, or arbitration proceedings by or against the corporation commenced within the time provided in subdivision 3, paragraph (b).\nThe articles of dissolution must state:\n(1) the last date on which the notice was given and: (i) that the payment of all creditors and claimants filing a claim within the 90-day period in subdivision 2, paragraph (e), has been made or provided for; or (ii) the date on which the longest of the periods described in subdivision 3, paragraph (b), expired;\n(2) that the remaining property, assets, and claims of the corporation have been distributed among its shareholders in accordance with section 302A.551, subdivision 4, or that adequate provision has been made for that distribution; and\n(3) that there are no pending legal, administrative, or arbitration proceedings by or against the corporation commenced within the time provided in subdivision 3, paragraph (b), or that adequate provision has been made for the satisfaction of any judgment, order, or decree that may be entered against it in a pending proceeding.",
	"repealed": false
}