{
	"id": "171.177",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.177",
	"title": "171.177 REVOCATION; PURSUANT TO SEARCH WARRANT.",
	"text": "At the time a blood or urine test is directed pursuant to a search warrant, the person must be informed that refusal to submit to a blood or urine test is a crime.\nThe peace officer who directs a test pursuant to a search warrant shall direct a blood or urine test as provided in the warrant. If the warrant authorizes either a blood or urine test, the officer may direct whether the test is of blood or urine. If the person to whom the test is directed objects to the test, the officer shall offer the person an alternative test of either blood or urine. Action may be taken against a person who refuses to take a blood test only if a urine test was offered and action may be taken against a person who refuses to take a urine test only if a blood test was offered.\nAfter executing a search warrant for the collection of a blood or urine sample based upon probable cause of a violation of section 169A.20, the peace officer acting under sections 626.13 to 626.17 shall certify to the commissioner of public safety:\n(1) when a person refuses to comply with the execution of the search warrant; or\n(2) if a person submits to the test and the test results indicate:\n(i) an alcohol concentration of 0.08 or more;\n(ii) an alcohol concentration of 0.04 or more, if the person was driving, operating, or in physical control of a commercial motor vehicle at the time of the violation; or\n(iii) the presence of a controlled substance listed in Schedule I or II or its metabolite, other than marijuana or tetrahydrocannabinols.\n(a) Upon certification under subdivision 3 that there existed probable cause to believe the person had been driving, operating, or in physical control of a motor vehicle in violation of section 169A.20, and that the person refused to comply with the execution of the search warrant, the commissioner shall revoke the person's license or permit to drive or nonresident operating privilege. The commissioner shall revoke the license, permit, or nonresident operating privilege:\n(1) for a person with no qualified prior impaired driving incidents within the past ten years, for a period of not less than one year;\n(2) for a person under the age of 21 years and with no qualified prior impaired driving incidents within the past ten years, for a period of not less than one year;\n(3) for a person with one qualified prior impaired driving incident within the past ten years or two qualified prior impaired driving incidents, for a period of not less than two years;\n(4) for a person with two qualified prior impaired driving incidents within the past ten years or three qualified prior impaired driving incidents, for a period of not less than three years;\n(5) for a person with three qualified prior impaired driving incidents within the past ten years, for a period of not less than four years; or\n(6) for a person with four or more qualified prior impaired driving incidents, for a period of not less than six years.\n(b) When a person who had been driving, operating, or in physical control of a commercial motor vehicle refuses to comply with the search warrant and permit testing, the commissioner shall disqualify the person from operating a commercial motor vehicle and shall revoke the person's license or permit to drive or nonresident operating privilege according to the federal regulations adopted by reference in section 171.165, subdivision 2.\n(a) Upon certification under subdivision 3 pursuant to a search warrant, that there existed probable cause to believe the person had been driving, operating, or in physical control of a motor vehicle in violation of section 169A.20, and that the person submitted to a test and the test results indicate an alcohol concentration of 0.08 or more or the presence of a controlled substance listed in Schedule I or II or its metabolite, other than marijuana or tetrahydrocannabinols, the commissioner shall revoke the person's license or permit to drive or nonresident operating privilege:\n(1) for a period of 90 days or, if the test results indicate an alcohol concentration of twice the legal limit or more, not less than one year;\n(2) if the person is under the age of 21 years, for a period of not less than 180 days or, if the test results indicate an alcohol concentration of twice the legal limit or more, not less than one year;\n(3) for a person with one qualified prior impaired driving incident within the past ten years or two qualified prior impaired driving incidents, for a period of not less than one year or, if the test results indicate an alcohol concentration of twice the legal limit or more, not less than two years;\n(4) for a person with two qualified prior impaired driving incidents within the past ten years or three qualified prior impaired driving incidents, for a period of not less than three years;\n(5) for a person with three qualified prior impaired driving incidents within the past ten years, for a period of not less than four years; or\n(6) for a person with four or more qualified prior impaired driving incidents, for a period of not less than six years.\n(b) On certification by the peace officer that there existed probable cause to believe the person had been driving, operating, or in physical control of a commercial motor vehicle with any presence of alcohol and that the person submitted to a test and the test results indicated an alcohol concentration of 0.04 or more, the commissioner shall disqualify the person from operating a commercial motor vehicle under section 171.165.\n(c) If the test is of a person's blood or urine by a laboratory operated by the Bureau of Criminal Apprehension or authorized by the bureau to conduct the analysis of a blood or urine sample, the laboratory may directly certify to the commissioner the test results, and the peace officer shall certify to the commissioner that there existed probable cause to believe the person had been driving, operating, or in physical control of a motor vehicle in violation of section 169A.20, and that the person submitted to a test. Upon receipt of both certifications, the commissioner shall undertake the license actions described in paragraphs (a) and (b).\nIf the person is a resident without a license or permit to operate a motor vehicle in this state, the commissioner shall deny to the person the issuance of a license or permit after the date of the alleged violation for the same period as provided in this section for revocation, subject to review as provided in subdivisions 10 and 11.\nA revocation under this section, or a disqualification under section 171.165, becomes effective at the time the commissioner or a peace officer acting on behalf of the commissioner notifies the person of the intention to revoke, disqualify, or both, and of revocation or disqualification. The notice must advise the person of the right to obtain administrative and judicial review as provided in subdivisions 10 and 11. If mailed, the notice and order of revocation or disqualification is deemed received three days after mailing to the last known address of the person.\n(a) On behalf of the commissioner, a peace officer requiring a test or directing the administration of a chemical test pursuant to a search warrant shall serve immediate notice of intention to revoke and of revocation on a person who refuses to permit a test or on a person who submits to a test, the results of which indicate an alcohol concentration of 0.08 or more.\n(b) On behalf of the commissioner, a peace officer requiring a test or directing the administration of a chemical test of a person driving, operating, or in physical control of a commercial motor vehicle pursuant to a search warrant shall serve immediate notice of intention to disqualify and of disqualification on a person who refuses to permit a test or on a person who submits to a test, the results of which indicate an alcohol concentration of 0.04 or more.\n(c) The officer shall:\n(1) invalidate the person's driver's license or permit card by clipping the upper corner of the card in such a way that no identifying information including the photo is destroyed, and immediately return the card to the person;\n(2) issue the person a temporary license effective for only seven days; and\n(3) send the notification of this action to the commissioner along with the certificate required by subdivision 4 or 5.\nWhen a nonresident's privilege to operate a motor vehicle in this state has been revoked or denied, the commissioner shall give information of the action taken in writing to the official in charge of traffic control or public safety of the state of the person's residence and of any state in which the person has a license.\n(a) At any time during a period of revocation imposed under this section, or a period of disqualification imposed under section 171.165, a person may request in writing a review of the order of revocation or disqualification by the commissioner, unless the person is entitled to review under section 171.166. Upon receiving a request, the commissioner or the commissioner's designee shall review the order, the evidence upon which the order was based, and any other material information brought to the attention of the commissioner and determine whether sufficient cause exists to sustain the order. Within 15 days of receiving the request, the commissioner shall report in writing the results of the review. The review provided in this subdivision is not subject to the contested case provisions of the Administrative Procedure Act in sections 14.001 to 14.69.\n(b) The availability of administrative review for an order of revocation or disqualification has no effect upon the availability of judicial review under this section.\n(c) Review under this subdivision must take place, if possible, at the same time as any administrative review of the person's impoundment order under section 169A.60, subdivision 9.\n(a) Within 60 days following receipt of a notice and order of revocation pursuant to this section, a person may petition the court for review. The petition must be filed with the district court administrator in the county where the alleged offense occurred, together with proof of service of a copy on the commissioner, and accompanied by the standard filing fee for civil actions. Responsive pleading is not required of the commissioner, and court fees must not be charged for the appearance of the commissioner in the matter.\n(b) The petition must:\n(1) be captioned in the full name of the person making the petition as petitioner and the commissioner as respondent;\n(2) include the petitioner's date of birth and driver's license number, and the date of the offense; and\n(3) state with specificity the grounds upon which the petitioner seeks rescission of the order of revocation, disqualification, or denial.\n(c) The filing of the petition does not stay the revocation, disqualification, or denial. The reviewing court may order a stay of the balance of the revocation or disqualification if the hearing has not been conducted within 60 days after filing the petition upon terms the court deems proper.\n(d) Judicial reviews must be conducted according to the Rules of Civil Procedure, except that prehearing discovery is mandatory and is limited to:\n(1) the notice of revocation;\n(2) the certificate of analysis of the blood or urine test;\n(3) the peace officer's certificate and any accompanying documentation submitted by the arresting officer to the commissioner; and\n(4) disclosure of potential witnesses, including experts, and the basis of their testimony.\nOther types of discovery are available only upon order of the court.\n(a) A judicial review hearing under this section must be before a district judge in any county in the judicial district where the alleged offense occurred. The hearing is to the court and may be conducted at the same time and in the same manner as hearings upon pretrial motions in the criminal prosecution under section 169A.20, if any. The hearing must be recorded. The commissioner shall appear and be represented by the attorney general or through the prosecuting authority for the jurisdiction involved. The hearing must be held at the earliest practicable date, and in any event no later than 60 days following the filing of the petition for review. The judicial district administrator shall establish procedures to ensure efficient compliance with this subdivision. To accomplish this, the administrator may, whenever possible, consolidate and transfer review hearings among the locations within the judicial district where terms of district court are held.\n(b) The scope of the hearing is limited to the issues in clauses (1) to (13):\n(1) Did the peace officer have probable cause to believe the person was driving, operating, or in physical control of a motor vehicle or commercial motor vehicle in violation of section 169A.20?\n(2) Was the person lawfully placed under arrest for violation of section 169A.20?\n(3) Was the person involved in a motor vehicle accident or collision resulting in property damage, personal injury, or death?\n(4) Did a licensed peace officer apply for a search warrant in accordance with the requirements set forth in sections 626.04 to 626.18 or conforming statutes in an adjacent state?\n(5) Did a neutral magistrate review the application for a search warrant and determine there was probable cause to believe that the person was driving, operating, or in physical control of a motor vehicle or commercial motor vehicle in violation of section 169A.20?\n(6) Was the search warrant and the process by which it was obtained valid?\n(7) At the time of directing the person to take the test, did the peace officer inform the person that refusing the test was a crime as required by subdivision 1?\n(8) Did the person refuse to permit the test?\n(9) If a test was taken by a person driving, operating, or in physical control of a motor vehicle, did the test results indicate at the time of testing:\n(i) an alcohol concentration of 0.08 or more; or\n(ii) the presence of a controlled substance listed in Schedule I or II or its metabolite, other than marijuana or tetrahydrocannabinols?\n(10) If a test was taken by a person driving, operating, or in physical control of a commercial motor vehicle, did the test results indicate an alcohol concentration of 0.04 or more at the time of testing?\n(11) Was the testing method used valid and reliable and were the test results accurately evaluated?\n(12) Did the person prove the defense of necessity?\n(13) Did the person prove the defense of controlled substance use in accordance with a prescription?\n(c) Certified or otherwise authenticated copies of laboratory or medical personnel reports, records, documents, licenses, and certificates are admissible as substantive evidence.\n(d) The court shall order that the revocation or disqualification be either rescinded or sustained and forward the order to the commissioner. The court shall file its order within 14 days following the hearing. If the revocation or disqualification is sustained, the court shall also forward the person's driver's license or permit to the commissioner for further action by the commissioner if the license or permit is not already in the commissioner's possession.\n(e) Any party aggrieved by the decision of the reviewing court may appeal the decision as provided in the Rules of Appellate Procedure.\n(f) The civil hearing under this section shall not give rise to an estoppel on any issues arising from the same set of circumstances in any criminal prosecution.\n(g) It is an affirmative defense for the petitioner to prove a necessity.\n(h) It is an affirmative defense to the presence of a Schedule I or II controlled substance that the person used the controlled substance according to the terms of a prescription issued for the person according to sections 152.11 and 152.12, unless the court finds by a preponderance of the evidence that the use of the controlled substance impaired the person's ability to operate a motor vehicle.\n(a) If a person refuses to permit a blood or urine test as required by a search warrant and the provisions of this section, then a test must not be given. However, the applicable provisions of this section, section 169A.52, subdivision 1, and other law apply.\n(b) Notwithstanding paragraph (a), if a peace officer has probable cause to believe that a person has violated section 609.2112, 609.2113, 609.2114, or Minnesota Statutes 2012, section 609.21, a test may be required and obtained despite the person's refusal. A refusal to submit to a test does not constitute a violation of section 609.50, unless the refusal was accompanied by force or violence or the threat of force or violence.\nThe definitions in section 169A.03 apply to this section.",
	"repealed": false
}