{
	"id": "358.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.70",
	"title": "358.70 GROUNDS TO DENY, REFUSE TO RENEW, REVOKE, SUSPEND, OR CONDITION COMMISSION OF NOTARY PUBLIC.",
	"text": "The commissioner of commerce has all the powers provided by section 45.027 and may proceed in the manner provided by that section in actions against a notary public for any act or omission that demonstrates an individual lacks the honesty, integrity, competence, or reliability to act as a notary public, including:\n(1) failure to comply with sections 358.51 to 358.76;\n(2) fraudulent, dishonest, or deceitful misstatement or omission in the application for a commission as a notary public submitted to the commissioning officer or agency;\n(3) a conviction of the applicant or notary public of any felony or a crime involving fraud, dishonesty, or deceit;\n(4) a finding against, or admission of liability by, the applicant or notary public in any legal proceeding or disciplinary action based on the applicant's or notary public's fraud, dishonesty, or deceit;\n(5) failure by the notary public to discharge any duty required of a notarial officer, whether by sections 358.51 to 358.76 or any federal or state law or regulation;\n(6) use of false or misleading advertising or representation by the notary public representing that the notary has a duty, right, or privilege that the notary does not have;\n(7) denial, refusal to renew, revocation, suspension, or conditioning of a notary public commission in another state; or\n(8) suspension or revocation of a license for the conduct of a profession, occupation, trade, or business of a notary public who is performing notarial acts in connection with the profession, occupation, trade, or business.\nFor purposes of this clause, \"license\" means a permit, registration, certification, or other form of approval authorized by statute or rule issued by the state or a political subdivision of the state as a condition of doing business, or conducting a trade, profession, or occupation in Minnesota.\nA notary may be removed from office only by the governor, the district court, or the commissioner of commerce.\nIf the commissioner of commerce denies, refuses to renew, revokes, suspends, or imposes conditions on a commission as a notary public, the applicant or notary public is entitled to timely notice and hearing in accordance with chapter 14.\nThe authority of the commissioner of commerce to deny, refuse to renew, suspend, revoke, or impose conditions on a commission as a notary public does not prevent a person from seeking and obtaining other criminal or civil remedies provided by law.\nNotwithstanding section 359.03, subdivision 1, upon removal from office by the commissioner of commerce, a notary public shall deliver the notary's official stamp to the commissioner of commerce.",
	"repealed": false
}