{
	"id": "245.4905",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4905",
	"title": "245.4905 FIRST EPISODE OF PSYCHOSIS GRANT PROGRAM.",
	"text": "The first episode of psychosis grant program is established in the Department of Human Services to fund evidence-based interventions for youth at risk of developing or experiencing a first episode of psychosis and a public awareness campaign on the signs and symptoms of psychosis. First episode of psychosis services are eligible for children's mental health grants as specified in section 245.4889, subdivision 1, paragraph (b), clause (15).\n(a) All first episode of psychosis grant programs must:\n(1) provide intensive treatment and support for adolescents and adults experiencing or at risk of experiencing a first psychotic episode. Intensive treatment and support includes medication management, psychoeducation for an individual and an individual's family, case management, employment support, education support, cognitive behavioral approaches, social skills training, peer support, crisis planning, and stress management;\n(2) conduct outreach and provide training and guidance to mental health and health care professionals, including postsecondary health clinicians, on early psychosis symptoms, screening tools, and best practices;\n(3) ensure access for individuals to first psychotic episode services under this section, including access for individuals who live in rural areas; and\n(4) use all available funding streams.\n(b) Grant money may also be used to pay for housing or travel expenses for individuals receiving services or to address other barriers preventing individuals and their families from participating in first psychotic episode services.\nProgram activities must be provided to people 15 to 40 years old with early signs of psychosis.\nEvaluation of program activities must utilize evidence-based practices and must include the following outcome evaluation criteria:\n(1) whether individuals experience a reduction in psychotic symptoms;\n(2) whether individuals experience a decrease in inpatient mental health hospitalizations; and\n(3) whether individuals experience an increase in educational attainment.\nThe commissioner of human services must comply with all conditions and requirements necessary to receive federal aid or grants.",
	"repealed": false
}