{
	"id": "270C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.12",
	"title": "270C.12 TAX INFORMATION SAMPLE DATA.",
	"text": "The commissioner shall prepare microdata samples of income tax returns and other information useful for purposes of:\n(1) estimating state revenues;\n(2) simulating the effect of changes or proposed changes in state and federal tax law on the amount of state revenues; and\n(3) analyzing the incidence of present or proposed taxes.\nA coordinating committee is established to oversee and coordinate preparation of the microdata samples. The committee consists of:\n(1) the director of the Research Division of the department who shall serve as chair of the committee;\n(2) the state economist;\n(3) the chair of the Committee on Taxes of the house of representatives or the chair's designee; and\n(4) the chair of the Committee on Taxes and Tax Laws of the senate or the chair's designee. The committee shall consider the analysis needs and use of the microdata samples by the Management and Budget and Revenue Departments and the legislature in designing and preparing the samples, including the type of data to be included, the structure of the samples, size of the samples, and other relevant factors.\nThe samples must consist of information derived from a random sample of federal and Minnesota individual income tax returns. The samples prepared in odd-numbered years must be augmented by additional information from other sources as the coordinating committee determines is feasible and appropriate. The coordinating committee shall consider inclusion of:\n(1) information derived from property tax refund returns;\n(2) the estimated market value of the taxpayer's home from the homestead declaration; and\n(3) information from other sources, such as the surveys conducted by the United States Departments of Commerce and Labor.\nThe coordinating committee shall facilitate regular consultation among the Department of Revenue, the Department of Management and Budget, and house of representatives and senate staffs in development and maintenance of their respective computer models used to analyze the microdata samples. The committee shall encourage efforts to attain more commonality in the models, greater sharing of program development efforts and programming tasks, and more consistency in the resulting analyses.\nNotwithstanding the provisions of any statutes to the contrary, the coordinating committee as established by this section to oversee and coordinate preparation of the microdata samples of income tax returns and other information shall not expire.",
	"repealed": false
}