{
	"id": "115A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.37",
	"title": "115A.37 FINAL DECISION OF BOARD.",
	"text": "In its final decision on the proposed facility, the board may either approve or disapprove the proposed facility at the proposed site. The board's approval shall embody all terms, conditions, and requirements of the permitting agencies, provided that the board may: (a) finally resolve any conflicts between state agencies regarding permit terms, conditions, and requirements, and (b) require more stringent permit terms, conditions, and requirements respecting the design, construction, operation, inspection, monitoring, and maintenance of the proposed facility at the proposed site. The board's resolution of conflicts under clause (a) shall be in favor of the more stringent terms, conditions, and requirements.\nThe decision of the board to approve a facility shall be final and shall supersede and preempt requirements of state agencies and political subdivisions and the requirements of sections 473H.02 to 473H.17; except that the facility shall be subject to those terms, conditions, and requirements of permitting agencies embodied in the board's approval and any requirements imposed pursuant to subdivision 3. The permitting agencies shall issue or amend the permits for the facility within 60 days following and in accordance with the final decision of the board, and all permits shall conform to the terms, conditions, and requirements of the board's decision. No charter provision, ordinance, rule, permit, or other requirement of any state agency or political subdivision shall prevent or restrict the establishment, operation, expansion, continuance, or closure of the facility in accordance with the final decision of the board and permits issued pursuant thereto.\nA political subdivision may impose reasonable requirements respecting the construction, inspection, operation, monitoring, and maintenance of a facility. Any such requirements shall be subject to review by the agency to determine their reasonableness and consistency with the establishment and use of a facility in accordance with the final decision of the board and permits issued pursuant thereto. The agency may approve, disapprove, suspend, modify, or reverse any such requirements. The decision of the agency shall be final.",
	"repealed": false
}