{
	"id": "297A.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.665",
	"title": "297A.665 PRESUMPTION OF TAX; BURDEN OF PROOF.",
	"text": "(a) For the purpose of the proper administration of this chapter and to prevent evasion of the tax, until the contrary is established, it is presumed that:\n(1) all gross receipts are subject to the tax; and\n(2) all retail sales for delivery in Minnesota are for storage, use, or other consumption in Minnesota.\n(b) The burden of proving that a sale is not a taxable retail sale is on the seller. However, a seller is relieved of liability if:\n(1) the seller obtains a fully completed exemption certificate or all the relevant information required by section 297A.72, subdivision 2, at the time of the sale or within 90 days after the date of the sale;\n(2) if the seller has not obtained a fully completed exemption certificate or all the relevant information required by section 297A.72, subdivision 2, within the time provided in clause (1), within 120 days after a request for substantiation by the commissioner, the seller either:\n(i) obtains from the purchaser a fully completed exemption certificate or all the relevant information required by section 297A.72, subdivision 2, taken in good faith which means that the exemption certificate claims an exemption that (A) was statutorily available on the date of the transaction, (B) could be applicable to the item for which the exemption is claimed, and (C) is reasonable for the purchaser's type of business; or\n(ii) proves by other means that the transaction was not subject to tax; or\n(3) in the case of drop shipment sales, a seller engaged in drop shipping may claim a resale exemption based on an exemption certificate provided by its customer or reseller, or any other acceptable information available to the seller engaged in drop shipping evidencing qualification for a resale exemption, regardless of whether the customer or reseller is registered to collect and remit sales and use tax in the state.\n(c) Notwithstanding paragraph (b), relief from liability does not apply to a seller who:\n(1) fraudulently fails to collect the tax; or\n(2) solicits purchasers to participate in the unlawful claim of an exemption.\n(d) Notwithstanding paragraph (b), relief from liability does not apply to a seller who has obtained information under paragraph (b), clause (2), if through the audit process the commissioner finds the following:\n(1) that at the time the information was provided the seller had knowledge or had reason to know that the information relating to the exemption was materially false; or\n(2) that the seller knowingly participated in activity intended to purposefully evade the sales tax due on the transaction.\n(e) A certified service provider, as defined in section 297A.995, subdivision 2, is relieved of liability under this section to the extent a seller who is its client is relieved of liability.\n(f) A purchaser of tangible personal property or any items listed in section 297A.63 that are shipped or brought to Minnesota by the purchaser has the burden of proving that the property was not purchased from a retailer for storage, use, or consumption in Minnesota.\n(g) If a seller claims that certain sales are exempt and does not provide the certificate, information, or proof required by paragraph (b), clause (2), within 120 days after the date of the commissioner's request for substantiation, then the exemptions claimed by the seller that required substantiation are disallowed.",
	"repealed": false
}