{
	"id": "62A.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.315",
	"title": "62A.315 EXTENDED BASIC MEDICARE SUPPLEMENT PLAN; COVERAGE.",
	"text": "(a) The extended basic Medicare supplement plan must have a level of coverage so that it will be certified as a qualified plan pursuant to section 62E.07, and will provide:\n(1) coverage for all of the Medicare Part A inpatient hospital deductible and coinsurance amounts, and 100 percent of all Medicare Part A eligible expenses for hospitalization not covered by Medicare;\n(2) coverage for the daily co-payment amount of Medicare Part A eligible expenses for the calendar year incurred for skilled nursing facility care;\n(3) coverage for the coinsurance amount or in the case of hospital outpatient department services paid under a prospective payment system, the co-payment amount, of Medicare eligible expenses under Medicare Part B regardless of hospital confinement, and the Medicare Part B deductible amount;\n(4) 80 percent of the usual and customary hospital and medical expenses and supplies described in section 62E.06, subdivision 1, not to exceed any charge limitation established by the Medicare program or state law, the usual and customary hospital and medical expenses and supplies, described in section 62E.06, subdivision 1, while in a foreign country; and prescription drug expenses, not covered by Medicare. An outpatient prescription drug benefit must not be included for sale or issuance in a Medicare supplement policy or certificate issued on or after January 1, 2006;\n(5) coverage for the reasonable cost of the first three pints of blood, or equivalent quantities of packed red blood cells as defined under federal regulations under Medicare Parts A and B, unless replaced in accordance with federal regulations;\n(6) 100 percent of the cost of immunizations not otherwise covered under Part D of the Medicare program and routine screening procedures for cancer, including mammograms and pap smears;\n(7) preventive medical care benefit: coverage for the following preventive health services not covered by Medicare:\n(i) an annual clinical preventive medical history and physical examination that may include tests and services from clause (ii) and patient education to address preventive health care measures;\n(ii) preventive screening tests or preventive services, the selection and frequency of which is determined to be medically appropriate by the attending physician.\nReimbursement shall be for the actual charges up to 100 percent of the Medicare-approved amount for each service as if Medicare were to cover the service as identified in American Medical Association current procedural terminology (AMA CPT) codes to a maximum of $120 annually under this benefit. This benefit shall not include payment for any procedure covered by Medicare;\n(8) coverage of cost sharing for all Medicare Part A eligible hospice care and respite care expenses; and\n(9) coverage for cost sharing for Medicare Part A or B home health care services and medical supplies.\n(b) An extended basic Medicare supplement plan must provide the benefits contained in this section, but must not provide coverage for 100 percent or any portion of the Medicare Part B deductible to a newly eligible individual.",
	"repealed": false
}