{
	"id": "245.4902",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4902",
	"title": "245.4902 CULTURALLY INFORMED AND CULTURALLY RESPONSIVE MENTAL HEALTH TASK FORCE.",
	"text": "The Culturally Informed and Culturally Responsive Mental Health Task Force is established to evaluate and make recommendations on improving the provision of culturally informed and culturally responsive mental health services throughout Minnesota. The task force must make recommendations on:\n(1) recruiting mental health providers from diverse racial and ethnic communities;\n(2) training all mental health providers on cultural competency and cultural humility;\n(3) assessing the extent to which mental health provider organizations embrace diversity and demonstrate proficiency in culturally competent mental health treatment and services; and\n(4) increasing the number of mental health organizations owned, managed, or led by individuals who are Black, indigenous, or people of color.\n(a) The task force must consist of the following 16 members:\n(1) the commissioner of human services or the commissioner's designee;\n(2) one representative from the Board of Psychology;\n(3) one representative from the Board of Marriage and Family Therapy;\n(4) one representative from the Board of Behavioral Health and Therapy;\n(5) one representative from the Board of Social Work;\n(6) three members representing undergraduate- and graduate-level mental health professional education programs, one appointed by the governor, one appointed by the speaker of the house of representatives, and one appointed by the senate majority leader;\n(7) three mental health providers who are members of communities of color or underrepresented communities, as defined in section 148E.010, subdivision 20, one appointed by the governor, one appointed by the speaker of the house of representatives, and one appointed by the senate majority leader;\n(8) two members representing mental health advocacy organizations, appointed by the governor;\n(9) two mental health providers, appointed by the governor; and\n(10) one expert in providing training and education in cultural competency and cultural responsiveness, appointed by the governor.\n(b) Appointments to the task force must be made no later than June 1, 2022.\n(c) Member compensation and reimbursement for expenses are governed by section 15.059, subdivision 3.\nThe members of the task force must elect two cochairs of the task force no earlier than July 1, 2022, and the cochairs must convene the first meeting of the task force no later than August 15, 2022. The task force must meet upon the call of the cochairs, sufficiently often to accomplish the duties identified in this section. The task force is subject to the open meeting law under chapter 13D.\nThe Department of Human Services must provide administrative support and meeting space for the task force.\nNo later than January 1, 2023, and by January 1 of each year thereafter, the task force must submit a written report to the members of the legislative committees with jurisdiction over health and human services on the recommendations developed under subdivision 1.\nThe task force expires on January 1, 2025.",
	"repealed": false
}