{
	"id": "299C.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.091",
	"title": "299C.091 CRIMINAL GANG INVESTIGATIVE DATA SYSTEM.",
	"text": "The bureau shall administer and maintain a computerized criminal gang investigative data system for the purpose of assisting criminal justice agencies in the investigation and prosecution of criminal activity by gang members. The system consists of data on individuals whom law enforcement agencies determine are or may be engaged in criminal gang activity. Notwithstanding section 260B.171, subdivision 5, data on adults and juveniles in the system and data documenting an entry in the system may be maintained together. Data in the system must be submitted and maintained as provided in this section.\n(a) A law enforcement agency may submit data on an individual to the criminal gang investigative data system only if the agency obtains and maintains the documentation required under this subdivision. Documentation may include data obtained from other criminal justice agencies, provided that a record of all of the documentation required under paragraph (b) is maintained by the agency that submits the data to the bureau. Data maintained by a law enforcement agency to document an entry in the system are confidential data on individuals as defined in section 13.02, subdivision 3, but may be released to criminal justice agencies.\n(b) A law enforcement agency may submit data on an individual to the bureau for inclusion in the system if the individual is 14 years of age or older and the agency has documented that:\n(1) the individual has met at least three of the criteria or identifying characteristics of gang membership developed by the Violent Crime Coordinating Council under section 299A.642, subdivision 3, clause (8), as required by the council; and\n(2) the individual has been convicted of a gross misdemeanor or felony or has been adjudicated or has a stayed adjudication as a juvenile for an offense that would be a gross misdemeanor or felony if committed by an adult.\nData in the criminal gang investigative data system are confidential data on individuals as defined in section 13.02, subdivision 3, but are accessible to law enforcement agencies and may be released to the criminal justice agencies.\n(a) At least once every three years, the bureau shall conduct random audits of data under subdivision 2 that documents inclusion of an individual in, and removal of an individual from, the criminal gang investigative data system for the purpose of determining the validity, completeness, and accuracy of data submitted to the system. The bureau has access to the documenting data for purposes of conducting an audit. By October 1 of each year, the bureau shall submit a report on the results of the audits to the commissioner of public safety.\n(b) If any audit requirements under federal rule or statute overlap with requirements in paragraph (a), the audit required by paragraph (a) may be done in conjunction with the federal audit to the extent they overlap. Nothing in this paragraph shall be construed to eliminate any audit requirements specified in this subdivision.\nNotwithstanding section 138.17, the bureau shall destroy data entered into the system when three years have elapsed since the data were entered into the system, except as otherwise provided in this subdivision. If the bureau has information that the individual has been convicted as an adult, or has been adjudicated or has a stayed adjudication as a juvenile for an offense that would be a crime if committed by an adult, since entry of the data into the system, the data must be maintained until three years have elapsed since the last record of a conviction or adjudication or stayed adjudication of the individual. Upon request of the law enforcement agency that submitted data to the system, the bureau shall destroy the data regardless of whether three years have elapsed since the data were entered into the system.",
	"repealed": false
}