{
	"id": "475.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.56",
	"title": "475.56 INTEREST RATE.",
	"text": "(a) Any municipality issuing obligations under any law may issue obligations bearing interest at a single rate or at rates varying from year to year which may be lower or higher in later years than in earlier years. The highest aggregate rate of interest contracted to be so paid for any period shall not exceed the maximum rate authorized by law and the average annual rate of such interest may not exceed the maximum rate authorized by law. This section does not authorize a provision in any such obligations for the payment of a higher rate of interest after maturity than before.\n(b) Any municipality issuing obligations under any law may sell original issue discount or premium obligations. To determine the average annual rate of interest on the obligations, any discount shall be added to, and any premium subtracted from, the total amount of interest on the obligations to their stated maturity dates.\n(c) Any obligation may bear interest at a rate varying periodically at the time or times and on the terms, including convertibility to a fixed rate of interest, determined by the governing body of the municipality, but the rate of interest for any period shall not exceed any maximum rate of interest for the obligations established by law. For purposes of section 475.61, subdivisions 1 and 3, the interest payable on variable rate obligations for their term shall be determined as if their rate of interest is the lesser of the maximum rate of interest payable on the obligations in accordance with their terms or the rate estimated for such purpose by the governing body, but if the interest rate is subsequently converted to a fixed rate the levy may be modified to provide at least five percent in excess of amounts necessary to pay principal of and interest at the fixed rate on the obligations when due. For purposes of computing debt service or interest pursuant to section 475.67, subdivision 12, interest throughout the term of bonds issued pursuant to this subdivision is deemed to accrue at the rate of interest first borne by the bonds. The provisions of this paragraph do not apply to general obligations issued by a statutory or home rule charter city with a population of less than 7,500, as defined in section 477A.011, subdivision 3, or to general obligations that are not rated A or better, or an equivalent subsequently established rating, by Standard and Poor's Corporation, Moody's Investors Service or other similar nationally recognized rating agency, except that any statutory or home rule charter city, regardless of population or bond rating, may issue variable rate obligations as a participant in a bond pooling program established by the League of Minnesota Cities that meets this bond rating requirement.",
	"repealed": false
}