{
	"id": "326B.555",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.555",
	"title": "326B.555 REGISTERED UNLICENSED INDIVIDUALS.",
	"text": "(a) All unlicensed individuals engaged in water conditioning installation must be registered under subdivision 3.\n(b) A registered unlicensed individual is authorized to assist in water conditioning installations in a single family residential unit only when a master plumber, journeyworker plumber, restricted master plumber, restricted journeyworker plumber, water conditioning master, or water conditioning journeyworker is available and responsible for ensuring that all water conditioning installation work performed by the unlicensed individual complies with the applicable provisions of the plumbing and water conditioning codes and rules adopted pursuant to such codes. For all other water conditioning installation work, the registered unlicensed individual must be under the direct supervision of a responsible licensed water conditioning master.\n(c) Water conditioning contractors employing registered unlicensed individuals to perform water conditioning installation work shall maintain records establishing compliance with this subdivision that shall identify all unlicensed individuals performing water conditioning installations, and shall permit the department to examine and copy all such records.\nA registered unlicensed individual who has completed 875 hours of practical water conditioning installation, servicing, and training is eligible to take the water conditioning journeyworker examination. Up to 100 hours of practical water conditioning installation and servicing experience prior to becoming a registered unlicensed individual may be applied to the practical experience requirement. However, none of this practical experience may be applied if the unlicensed individual did not have any practical experience in the 12-month period immediately prior to becoming a registered unlicensed individual.\nAn unlicensed individual may register by completing and submitting to the commissioner an application form provided by the commissioner, with all fees required by section 326B.58. A completed application form must state the date, the individual's age, schooling, previous experience and employer, and other information required by the commissioner. The plumbing board may prescribe rules, not inconsistent with this section, for the registration of unlicensed individuals. Applications for initial registration may be submitted at any time. Registration must be renewed annually and shall be for the period from July 1 of each year to June 30 of the following year.",
	"repealed": false
}