{
	"id": "84.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.90",
	"title": "84.90 OPERATING LIMITATIONS; RECREATIONAL MOTOR VEHICLES.",
	"text": "For the purposes of this section, the following terms have the meanings given them:\n(1) \"Recreational motor vehicle\" means any self-propelled vehicle and any vehicle propelled or drawn by a self-propelled vehicle used for recreational purposes, including but not limited to snowmobile, trail bike or other all-terrain vehicle, hovercraft, or motor vehicle licensed for highway operation which is being used for off-road recreational purposes.\n(2) \"Snowmobile\" has the same meaning given by section 84.81, subdivision 3.\nWithin the seven-county metropolitan area, no person shall enter and operate a recreational motor vehicle on lands not owned by the person, except where otherwise allowed by law, without the written or oral permission of the owner, occupant, or lessee of such lands. Written permission may be given by a posted notice of any kind or description that the owner, occupant, or lessee prefers, so long as it specifies the kind of vehicles allowed, such as by saying \"Recreational Vehicles Allowed,\" \"Snowmobiles Allowed,\" \"Trail Bikes Allowed,\" \"All-Terrain Vehicles Allowed,\" or words substantially similar.\nOutside the seven-county metropolitan area, no person shall enter on any land not owned by the person for the purpose of operating a recreational motor vehicle after being notified, either orally or by written or posted notice, by the owner, occupant, or lessee not to do so. Where posted notice is used, signs shall bear letters not less than two inches high and shall state one of the following: \"Recreational Vehicles Prohibited,\" \"Snowmobiles Prohibited,\" \"Trail Bikes Prohibited,\" \"All-Terrain Vehicles Prohibited,\" or words substantially similar. In lieu of the above notice an owner, occupant or lessee may post any sign prohibiting recreational motor vehicles which has been adopted by rule of the commissioner of natural resources. The notice or sign shall be posted at corners and ordinary ingress and egress to the property and when so posted shall serve so as to raise a conclusive presumption that a person operating a recreational motor vehicle thereon had knowledge of entering upon such posted lands. Failure to post notice as provided in this subdivision shall not deprive a person of the right to bring a civil action for damage to one's person or property as otherwise provided by law.\nIt is unlawful for a person to post, mutilate, or remove any notice or sign provided in this section upon any lands or waters over which the person has no right, title, interest, or license. It is unlawful for a person other than a duly constituted legal authority to so post any public lands, including but not limited to tax-forfeited lands, as above described. It is unlawful for a person to mutilate, destroy, damage, or remove any shelter, comfort station or other trail facility on any trail established on state-owned land or on any recreational trail which is funded in whole or in part by state grant-in-aid funds.\nNo person shall enter or leave the lands of another with a recreational motor vehicle, or pass from one portion of such lands to another portion, through a closed gate, without returning the gate to its original position. No person shall enter or leave the lands of another with a recreational motor vehicle by cutting any wire or tearing down or destroying any fence.\nNothing in this section shall limit or otherwise qualify the power of municipalities, counties, school districts, or other political subdivisions of the state or any agency of the state to impose additional restrictions or prohibitions on the operation of recreational motor vehicles on property not owned by the operator in accordance with law.\n(a) A person violating the provisions of this section is guilty of a misdemeanor.\n(b) Notwithstanding section 609.101, subdivision 4, clause (2), the minimum fine for a person who operates an off-highway motorcycle, off-road vehicle, all-terrain vehicle, or snowmobile in violation of this section must not be less than the amount set forth in section 84.775.",
	"repealed": false
}