{
	"id": "53B.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.51",
	"title": "53B.51 RELATIONSHIP BETWEEN LICENSEE AND AUTHORIZED DELEGATE.",
	"text": "(a) For purposes of this section, \"remit\" means to make direct payments of money to (1) a licensee, or (2) a licensee's representative authorized to receive money or to deposit money in a bank in an account specified by the licensee.\n(b) Before a licensee is authorized to conduct business through an authorized delegate or allows a person to act as the licensee's authorized delegate, the licensee must:\n(1) adopt, and update as necessary, written policies and procedures reasonably designed to ensure that the licensee's authorized delegates comply with applicable state and federal law;\n(2) enter into a written contract that complies with paragraph (d); and\n(3) conduct a reasonable risk-based background investigation sufficient for the licensee to determine whether the authorized delegate has complied and will likely comply with applicable state and federal law.\n(c) An authorized delegate must operate in full compliance with this chapter.\n(d) The written contract required by paragraph (b) must be signed by the licensee and the authorized delegate. The written contract must, at a minimum:\n(1) appoint the person signing the contract as the licensee's authorized delegate with the authority to conduct money transmission on behalf of the licensee;\n(2) set forth the nature and scope of the relationship between the licensee and the authorized delegate and the respective rights and responsibilities of the parties;\n(3) require the authorized delegate to agree to fully comply with all applicable state and federal laws, rules, and regulations pertaining to money transmission, including this chapter and regulations implementing this chapter, relevant provisions of the Bank Secrecy Act and the USA PATRIOT Act, Public Law 107-56;\n(4) require the authorized delegate to remit and handle money and monetary value in accordance with the terms of the contract between the licensee and the authorized delegate;\n(5) impose a trust on money and monetary value net of fees received for money transmission for the benefit of the licensee;\n(6) require the authorized delegate to prepare and maintain records as required by this chapter or administrative rules implementing this chapter, or as reasonably requested by the commissioner;\n(7) acknowledge that the authorized delegate consents to examination or investigation by the commissioner;\n(8) state that the licensee is subject to regulation by the commissioner and that as part of that regulation the commissioner may (1) suspend or revoke an authorized delegate designation, or (2) require the licensee to terminate an authorized delegate designation; and\n(9) acknowledge receipt of the written policies and procedures required under paragraph (b), clause (1).\n(e) If the licensee's license is suspended, revoked, surrendered, or expired, within five business days the licensee must provide documentation to the commissioner that the licensee has notified all applicable authorized delegates of the licensee whose names are in a record filed with the commissioner of the suspension, revocation, surrender, or expiration of a license. Upon suspension, revocation, surrender, or expiration of a license, applicable authorized delegates must immediately cease to provide money transmission as an authorized delegate of the licensee.\n(f) An authorized delegate of a licensee holds in trust for the benefit of the licensee all money net of fees received from money transmission. If an authorized delegate commingles any funds received from money transmission with other funds or property owned or controlled by the authorized delegate, all commingled funds and other property are considered held in trust in favor of the licensee in an amount equal to the amount of money net of fees received from money transmission.\n(g) An authorized delegate is prohibited from using a subdelegate to conduct money transmission on behalf of a licensee.",
	"repealed": false
}