{
	"id": "327.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.33",
	"title": "327.33 ADMINISTRATION.",
	"text": "The commissioner shall, through the department's inspectors or through a designated recognized inspection service acting as authorized representative of the commissioner perform sufficient inspections of manufacturing premises and manufactured homes to ensure compliance with sections 327.31 to 327.35. The commissioner shall have the exclusive right to conduct inspections, except for the inspections conducted or authorized by the secretary.\nThe commissioner shall by rule establish reasonable fees for seals, installation seals and inspections which are sufficient to cover all costs incurred in the administration of sections 327.31 to 327.35. The commissioner shall also establish by rule a monitoring inspection fee in an amount that will comply with the secretary's fee distribution program. This monitoring inspection fee shall be an amount paid by the manufacturer for each manufactured home produced in Minnesota. The monitoring inspection fee shall be paid by the manufacturer to the secretary. The rules of the fee distribution program require the secretary to distribute the fees collected from all manufactured home manufacturers among states approved and conditionally approved based on the number of new manufactured homes whose first location after leaving the manufacturer is on the premises of a distributor, dealer or purchaser in that state. Fees for inspections in areas that have not adopted the State Building Code must be equal to the fees for inspections in code areas of the state. Third-party vendors may charge their usual and normal charge for inspections.\nReplacement manufactured home or accessory structure construction seal fees, including certificates, are $30 per seal.\nManufactured home installation seal fees, including anchoring and support and including certificates, are $80.\nA temporary certificate fee is $2 per certificate.\nThe United States Department of Housing and Urban Development label fee shall be paid by the manufacturer to the secretary.\nThe shipping and handling fee for each order of seals is the current postage rate plus a $3 handling fee.\nThe commissioner may adopt other rules as may be necessary to administer and enforce sections 327.31 to 327.35. The rules shall, to the extent practicable, be uniform with those adopted by other states. All rules shall be adopted in the manner prescribed by sections 14.001 to 14.69.\nThe commissioner shall adopt rules governing the installation of manufactured homes, and shall include them in the State Building Code. The rules may include a list of specific safety items to be inspected at the time of installation.\nThe commissioner shall adopt rules governing the construction and installation of manufactured home accessory structures including, but not limited to, rules relating to the certification of prefabricated manufactured home accessory structures. Upon showing that another state provides for certification of prefabricated manufactured home accessory structures manufactured in compliance with standards at least equal to those established by the commissioner, the commissioner may by rule provide that any structure bearing certification affixed under the authority of that state shall not be required to bear the certification of this state.\nThe commissioner shall apply to the secretary for approval of the commissioner as the administrative agency for the regulation of manufactured homes under the rules of the secretary. The commissioner may make rules for the administration and enforcement of department responsibilities as a state administrative agency including, but not limited to, rules for the handling of citizen's complaints. All money received for services provided by the commissioner or the department's authorized agents as a state administrative agency shall be deposited in the construction code fund. The commissioner is charged with the adoption, administration, and enforcement of the Manufactured Home Construction and Safety Standards, consistent with rules and regulations promulgated by the United States Department of Housing and Urban Development. The commissioner may adopt the rules, codes, and standards necessary to enforce the standards promulgated under this section. The commissioner is authorized to conduct hearings and presentations of views consistent with regulations adopted by the United States Department of Housing and Urban Development and to adopt rules in order to carry out this function.\nThe commissioner may appoint such employees within the Department of Labor and Industry as deemed necessary for the administration of sections 327.31 to 327.35.",
	"repealed": false
}