{
	"id": "462.388",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.388",
	"title": "462.388 COMMISSION MEMBERSHIP.",
	"text": "A commission shall consist of the following members:\n(1) one member from each county board of every county in the development region;\n(2) one additional county board member from each county of over 100,000 population;\n(3) the town clerk, town treasurer, or one member of a town board of supervisors from each county containing organized towns;\n(4) one additional member selected by the county board of any county containing no townships;\n(5) one mayor or council member from a municipality of under 10,000 population from each county, selected by the mayors of all such municipalities in the county;\n(6) one mayor or council member from each municipality of over 10,000 in each county;\n(7) two school board members elected by a majority of the chairs of school boards in the development region;\n(8) one member from each council of governments;\n(9) one member appointed by each native American tribal council located in each region; and\n(10) citizens representing public interests within the region including members of minority groups to be selected after adoption of the bylaws of the commission.\nThe terms of office and method of selection of members shall be provided in the bylaws of the commission. The commission shall adopt rules setting forth its procedures.\nMS 1969 [Repealed, 1971 c 153 s 13]\nMS 1978 [Expired]\nMembers of the regional commission may receive a per diem of not over $50, the amount to be determined by the commission, and shall be reimbursed for their reasonable expenses as determined by the commission. The commission may provide for the election of a board of directors and provide, at its discretion, for a per diem of not over $50 a day for meetings of the board and expenses. A member of the board of directors who is a member of the commission shall receive only the per diem payable to board members when meetings of the board of directors and the commission are held on the same day.",
	"repealed": false
}