{
	"id": "358.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.15",
	"title": "358.15 EX OFFICIO NOTARY PUBLIC.",
	"text": "(a) The following officers have the powers of a notary public within the state:\n(1) every member of the legislature, while still a resident in the district from which elected; but no fee or compensation may be received for exercising these powers. The form of the official signature in these cases is: \"A.B., Representative (or Senator), ....................................... District, Minnesota, ex officio notary public. My term expires January 1, .......\";\n(2) the clerks or recorders of towns, and cities. The form of the official signature in these cases is: \"A.B. (official title), ....... County, Minnesota, ex officio notary public. My term expires ....... (or where applicable) my term is indeterminate.\";\n(3) court commissioners, county recorders, and county auditors, and their several deputies, and county commissioners, all within their respective counties. The form of the official signature in these cases: \"A.B. (official title), ....... County, Minnesota, ex officio notary public. My term expires ....... (or where applicable) my term is indeterminate.\"; and\n(4) peace officers licensed under section 626.845 for the purpose of administering oaths upon information submitted to establish probable cause to any judge or judicial officer under the Rules of Criminal Procedure. The form of the official signature in these cases is \"A.B., Peace Officer License Number ......., ....... County, Minnesota. My license expires June 30, .......\".\n(b) An officer using the powers of a notary public within the state pursuant to clauses (1) to (3) shall obtain an official stamp as specified under section 359.03, subdivisions 1, 3, and 4, with which to authenticate official acts.\n(c) The county auditor and county recorder, and their deputies, and the clerk or recorder of a town or city with ex officio powers under this section may authenticate official acts related to the statutory duties of their respective offices without using the official stamp for 90 days after initially assuming the office, or until the officer acquires an official stamp, whichever is earlier.",
	"repealed": false
}