{
	"id": "473.848",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.848",
	"title": "473.848 RESTRICTION ON DISPOSAL.",
	"text": "(a) For the purposes of implementing the waste management policies in section 115A.02 and metropolitan area goals related to landfill abatement established under this chapter, a person may not dispose of unprocessed mixed municipal solid waste generated in the metropolitan area at a waste disposal facility unless the waste disposal facility meets the standards in section 473.849 and:\n(1) the waste has been certified as unprocessible by a county under subdivision 2; or\n(2)(i) the waste has been transferred to the disposal facility from a resource recovery facility;\n(ii) no other resource recovery facility serving the metropolitan area is capable of processing the waste; and\n(iii) the waste has been certified as unprocessible by the operator of the resource recovery facility under subdivision 3.\n(b) For purposes of this section, mixed municipal solid waste does not include street sweepings, construction debris, mining waste, foundry sand, and other materials, if they are not capable of being processed by resource recovery as determined by the council.\n(a) By April 1 of each year, each county shall submit an annual certification report to the office detailing:\n(1) the quantity of waste generated in the county that was not processed prior to transfer to a disposal facility during the year preceding the report;\n(2) the reasons the waste was not processed;\n(3) a strategy for development of techniques to ensure processing of waste including a specific timeline for implementation of those techniques; and\n(4) any progress made by the county in reducing the amount of unprocessed waste.\nThe report shall be included in the county report required by section 473.803, subdivision 3.\n(b) The Pollution Control Agency shall approve a county's certification report if it determines that the county is reducing and will continue to reduce the amount of unprocessed waste, based on the report and the county's progress in development and implementation of techniques to reduce the amount of unprocessed waste transferred to disposal facilities. If the Pollution Control Agency does not approve a county's report, it shall negotiate with the county to develop and implement specific techniques to reduce unprocessed waste. If the Pollution Control Agency does not approve two or more consecutive reports from any one county, the Pollution Control Agency shall develop specific reduction techniques that are designed for the particular needs of the county. The county shall implement those techniques by specific dates to be determined by the Pollution Control Agency.\nThe operator of each resource recovery facility that receives waste from counties in the metropolitan area shall certify as unprocessible each load of mixed municipal solid waste it does not process. Certification must be made to each county that sends its waste to the facility at intervals specified by the county. Certification must include at least the number and size of loads certified as unprocessible and the reasons the waste is unprocessible. Loads certified as unprocessible must include the loads that would otherwise have been processed but were not processed because the facility was not in operation, but nothing in this section relieves the operator of its contractual obligations to process mixed municipal solid waste.\nThe Pollution Control Agency shall include, as part of its report to the Environment and Natural Resources Committees of the senate and house of representatives, the Finance Division of the senate Committee on Environment and Natural Resources, and the house of representatives Committee on Environment and Natural Resources Finance required under section 473.149, an accounting of the quantity of unprocessed waste transferred to disposal facilities, the reasons the waste was not processed, a strategy for reducing the amount of unprocessed waste, and progress made by counties to reduce the amount of unprocessed waste. The Pollution Control Agency may adopt standards for determining when waste is unprocessible and procedures for expediting certification and reporting of unprocessed waste.\nFor the purpose of this section, waste is \"unprocessed\" if it has not, after collection and before disposal, undergone separation of materials for resource recovery through recycling, incineration for energy production, production and use of refuse-derived fuel, composting, or any combination of these processes so that the weight of the waste remaining that must be disposed of in a mixed municipal solid waste disposal facility is not more than 35 percent of the weight before processing, on an annual average.",
	"repealed": false
}