{
	"id": "12.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.09",
	"title": "12.09 DUTIES OF DIVISION OF EMERGENCY MANAGEMENT.",
	"text": "The division shall coordinate state agency preparedness for and emergency response to all types of natural and other emergencies and disasters, including discharges of oil and hazardous substances.\nThe division shall develop and maintain a comprehensive state emergency operations plan and emergency management program in accord with section 12.21, subdivision 3, clause (2), and ensure that other state emergency plans that may be developed are coordinated and consistent with the comprehensive state emergency operations plan.\nThe division shall establish and maintain a single state answering point system for use by persons responsible for reporting emergency incidents and conditions involving hazardous substances or oil, nuclear power plant incidents or accidents, or other emergencies or disasters to state agencies, and for requesting state or federal assistance during and following an emergency or disaster.\nThe division shall activate the state and regional emergency operations centers when an emergency or disaster threatens or has occurred.\nThe division shall provide guidance, information, and training sufficient to allow local political subdivisions to request state and federal disaster assistance.\nThe division shall coordinate the development and maintenance of emergency operations plans and emergency management programs by the political subdivisions of this state, with the plans and programs integrated into and coordinated with the emergency operations plan and emergency management program of this state to the fullest possible extent.\nThe division shall develop and maintain a comprehensive hazard mitigation plan for this state, with the plan integrated into and coordinated with the hazard mitigation plans of the federal government to the fullest possible extent. The division shall coordinate the preparation of hazard mitigation plans by the political subdivisions, with the plans integrated into and coordinated with the hazard mitigation plan of this state to the fullest possible extent.\nThe division shall coordinate the development and conduct of emergency preparedness drills and exercises involving multiple Minnesota state agencies.\nThe division shall provide ongoing coordination of a network of state, local, and federal government agencies and private organizations to ensure the smooth coordination of donations and volunteerism during major disasters. Duties include:\n(1) hotline management, including training, staffing, information distribution, and coordination with emergency operations management;\n(2) coordination between government and private relief agencies;\n(3) networking with volunteer organizations;\n(4) locating resources for anticipated disaster needs and making these resources available to local governments in a database;\n(5) training in disaster preparation;\n(6) revising existing plans based on experience with disasters and testing the plans with simulated disasters; and\n(7) maintaining public information about disaster donations and volunteerism.\n(a) The division must maintain and administer an emergency management training curriculum. The division must make emergency management training courses in this curriculum available to state employees whose essential job duties involve emergency management.\n(b) Each state agency that is assigned a role as a disaster or emergency response organization in the state emergency operations plan must have at least one employee who has completed the entire emergency management training curriculum maintained under this section. If an agency is not in compliance with this paragraph or if all employees who have completed the curriculum leave the agency, the agency must immediately file a plan with the division identifying how and when the agency will be in compliance.\n(c) On January 15 each year, the commissioner of public safety must report to legislative committees with jurisdiction over public safety issues on compliance with this section. The report must list state agencies that are in compliance with this section and must summarize compliance efforts for state agencies not yet in compliance.",
	"repealed": false
}