{
	"id": "62M.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.04",
	"title": "62M.04 STANDARDS FOR UTILIZATION REVIEW PERFORMANCE.",
	"text": "A health benefit plan that includes utilization review requirements must specify the process for notifying the utilization review organization in a timely manner and obtaining authorization for health care services. Each health plan company must provide a clear and concise description of this process to an enrollee as part of the policy, subscriber contract, or certificate of coverage. Effective January 1, 2026, the commissioner must provide a clear and concise description of this process to fee-for-service recipients receiving services under chapters 256B and 256L, through the agency's public website or through other forms of recipient guidance. In addition to the enrollee, the utilization review organization must allow any provider or provider's designee, or responsible patient representative, including a family member, to fulfill the obligations under the health benefit plan.\nA claims administrator that contracts directly with providers for the provision of health care services to enrollees may, through contract, require the provider to notify the review organization in a timely manner and obtain authorization for health care services.\n(a) If the utilization review organization is conducting routine prospective and concurrent utilization review, utilization review organizations must collect only the information necessary to authorize the admission, procedure of treatment, and length of stay.\n(b) Utilization review organizations may request, but may not require providers to supply, numerically encoded diagnoses or procedures as part of the authorization process.\n(c) Utilization review organizations must not routinely request copies of medical records for all patients reviewed. In performing prospective and concurrent review, copies of the pertinent portion of the medical record should be required only when a difficulty develops in authorizing the medical necessity or appropriateness of the admission or extension of stay.\n(d) Utilization review organizations may request copies of medical records retrospectively for a number of purposes, including auditing the services provided, quality assurance review, ensuring compliance with the terms of either the health benefit plan or the provider contract, and compliance with utilization review activities. Except for reviewing medical records associated with an appeal or with an investigation or audit of data discrepancies, providers must be reimbursed for the reasonable costs of duplicating records requested by the utilization review organization for retrospective review unless otherwise provided under the terms of the provider contract.\n(a) Except as otherwise provided in this chapter, for purposes of authorization a utilization review organization must limit its data requirements to the following elements:\n(b) Patient information that includes the following:\n(1) name;\n(2) address;\n(3) date of birth;\n(4) sex;\n(5) Social Security number or patient identification number;\n(6) name of health plan company or health plan; and\n(7) plan identification number.\n(c) Enrollee information that includes the following:\n(1) name;\n(2) address;\n(3) Social Security number or employee identification number;\n(4) relation to patient;\n(5) employer;\n(6) health benefit plan;\n(7) group number or plan identification number; and\n(8) availability of other coverage.\n(d) Attending health care professional information that includes the following:\n(1) name;\n(2) address;\n(3) telephone numbers;\n(4) degree and license;\n(5) specialty or board certification status; and\n(6) tax identification number or other identification number.\n(e) Diagnosis and treatment information that includes the following:\n(1) primary diagnosis with associated ICD or DSM coding, if available;\n(2) secondary diagnosis with associated ICD or DSM coding, if available;\n(3) tertiary diagnoses with associated ICD or DSM coding, if available;\n(4) proposed procedures or treatments with ICD or associated CPT codes, if available;\n(5) surgical assistant requirement;\n(6) anesthesia requirement;\n(7) proposed admission or service dates;\n(8) proposed procedure date; and\n(9) proposed length of stay.\n(f) Clinical information that includes the following:\n(1) support and documentation of appropriateness and level of service proposed; and\n(2) identification of contact person for detailed clinical information.\n(g) Facility information that includes the following:\n(1) type;\n(2) licensure and certification status and DRG exempt status;\n(3) name;\n(4) address;\n(5) telephone number; and\n(6) tax identification number or other identification number.\n(h) Concurrent or continued stay review information that includes the following:\n(1) additional days, services, or procedures proposed;\n(2) reasons for extension, including clinical information sufficient for support of appropriateness and level of service proposed; and\n(3) diagnosis status.\n(i) For admissions to facilities other than acute medical or surgical hospitals, additional information that includes the following:\n(1) history of present illness;\n(2) patient treatment plan and goals;\n(3) prognosis;\n(4) staff qualifications; and\n(5) 24-hour availability of staff.\nAdditional information may be required for other specific review functions such as discharge planning or catastrophic case management. Second opinion information may also be required, when applicable, to support benefit plan requirements.\nA utilization review organization may request information in addition to that described in subdivision 3 when there is significant lack of agreement between the utilization review organization and the provider regarding the appropriateness of authorization during the review or appeal process. For purposes of this subdivision, \"significant lack of agreement\" means that the utilization review organization has:\n(1) tentatively determined through its professional staff that a service cannot be authorized;\n(2) referred the case to a physician for review; and\n(3) talked to or attempted to talk to the attending health care professional for further information.\nNothing in this chapter prohibits a utilization review organization from requiring submission of data necessary to comply with the quality assurance and utilization review requirements of chapter 62D or other appropriate data or outcome analyses.\nTo the extent allowed under sections 72A.49 to 72A.505, a utilization review organization shall share all available clinical and demographic information on individual patients internally to avoid duplicate requests for information from enrollees or providers.",
	"repealed": false
}