{
	"id": "321.1108",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.1108",
	"title": "321.1108 FILINGS REQUIRED FOR MERGER; EFFECTIVE DATE.",
	"text": "(a) After each constituent organization has approved a merger, articles of merger must be signed on behalf of:\n(1) each preexisting constituent limited partnership, by each general partner listed in the certificate of limited partnership; and\n(2) each other preexisting constituent organization, by an authorized representative.\n(b) The articles of merger must include:\n(1) the name and form of each constituent organization and the jurisdiction of its governing statute;\n(2) the name and form of the surviving organization, the jurisdiction of its governing statute, and, if the surviving organization is created by the merger, a statement to that effect;\n(3) the date the merger is effective under the governing statute of the surviving organization;\n(4) if the surviving organization is to be created by the merger:\n(A) if it will be a limited partnership, the limited partnership's certificate of limited partnership; or\n(B) if it will be an organization other than a limited partnership, the organizational document that creates the organization;\n(5) if the surviving organization preexists the merger, any amendments provided for in the plan of merger for the organizational document that created the organization;\n(6) a statement as to each constituent organization that the merger was approved as required by the organization's governing statute;\n(7) if the surviving organization is a foreign organization not authorized to transact business in this state, the street and mailing address of an office which the secretary of state may use for the purposes of section 321.1109(b); and\n(8) any additional information required by the governing statute of any constituent organization.\n(c) Each constituent limited partnership shall deliver the articles of merger for filing in the Office of the Secretary of State.\n(d) A merger becomes effective under this article:\n(1) if the surviving organization is a limited partnership, upon the later of:\n(i) compliance with subsection (c); or\n(ii) subject to section 321.0206(c), as specified in the articles of merger; or\n(2) if the surviving organization is not a limited partnership, as provided by the governing statute of the surviving organization.",
	"repealed": false
}