{
	"id": "446A.087",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.087",
	"title": "446A.087 CREDIT ENHANCED BOND PROGRAM.",
	"text": "A credit enhanced bond program is established for the purposes set forth in subdivision 2.\nThe purpose of the credit enhanced bond program is to provide loans to governmental units through the purchase of general obligation bonds of governmental units issued to finance all or a portion of the costs of a project. The program shall include providing credit enhancement to the general obligation bonds of the governmental unit through the guarantee program as provided in section 446A.086. The authority shall obtain funds to make the loans authorized pursuant to this section through the issuance of its revenue bonds payable from loan repayments pledged to the bonds, and such other sources and security as are specifically pledged by the authority.\n(a) Terms used in this section have the meanings given to them in this subdivision.\n(b) \"Applicant\" means any governmental unit applying to the authority for a loan pursuant to this section.\n(c) \"Borrower\" means any governmental unit that has entered into a commitment for the sale of its general obligation bonds to the authority pursuant to this section and subsequently sells its general obligation bonds to the authority and enters into a regulatory agreement.\n(d) \"Commitment\" means a written agreement between a governmental unit and the authority obligating the governmental unit to deliver its general obligation bonds to the authority on a date in the future evidencing a loan pursuant to this section and to enter into a regulatory agreement with the authority, all upon the terms and conditions set forth in the commitment.\n(e) \"Eligible cost\" means any cost of a project authorized by law to be financed from the proceeds of general obligation bonds of a governmental unit.\n(f) \"General obligation bonds\" means bonds or notes secured by the full faith and credit and unlimited taxing powers of a governmental unit.\n(g) \"Project\" means the construction, improvement, or rehabilitation of any publicly owned building or infrastructure improvement that has received partial funding from grants awarded by the commissioner of employment and economic development related to redevelopment, contaminated site cleanup, bioscience, small cities development programs, and rural business infrastructure programs.\n(h) \"Regulatory agreement\" means a written agreement entered into by the authority and a borrower in connection with the purchase of the borrower's general obligation bonds by the authority pursuant to this section.\nA credit enhancement bond program fund is established for the purposes described in subdivision 2. Other accounts may be established in the fund as necessary for its management and administration. Money in the fund is annually appropriated to the authority and does not lapse. The fund must be credited with investment income, and with repayments of principal and interest, except for fees assessed under section 446A.04, subdivisions 5 and 15.\nThe authority shall manage and administer the credit enhancement bond program fund and individual accounts in the fund. For those purposes, the authority may exercise all powers provided in this chapter.\n(a) Applicants for participation in the credit enhancement bond program must submit an application to the authority on forms prescribed by the authority. The applicant shall provide information customary to that needed for the disclosure purposes in issuing general obligation bonds in the market, in addition to the following information:\n(1) the total estimated cost of the project and the amount of general obligation bond proceeds sought;\n(2) other sources of funding if the general obligation bond proceeds do not cover the entire costs identified;\n(3) the proposed sources of funds to be used for repayment of the general obligation bonds;\n(4) information showing the applicant's financial status and ability of the applicant to repay loans;\n(5) the proposed term and principal repayment schedule for the general obligation bonds of the applicant; and\n(6) the statutory authorization for the applicant to issue such general obligation bonds, together with a statement that the statutory provision authorizes the use of proceeds of such general obligation bonds to pay the costs of a project.\n(b) The authority may establish deadlines or time periods for the submission of applications to facilitate funding loans from the proceeds of a specific bond issue proposed or previously issued by the authority, or the authority may accept applications from time to time.\n(c) Each application must be complete and accurate to be considered delivered to and received by the authority or to be considered as having met any deadline established by the authority with respect to an application period. If any application is determined by the authority to be incomplete or inaccurate, the authority shall notify the applicant and specify the missing or inaccurate information.\n(d) The executive director and the staff of the authority shall evaluate the applications to determine if the application should be accepted or rejected by the authority.\n(e) The authority is not obligated to accept any application including those complete and accurate and submitted by any specified deadline for submission if the authority determines that it is not practicable to fund the loan for any reason including, but not limited to, the creditworthiness of the applicant, the proposed loan amount, the term and repayment schedule, the sources of funding available to the authority, and current market conditions. Upon acceptance and approval of an application by the authority, the authority may require that the applicant authorize, execute, and deliver a commitment to the authority within such time period specified by the authority in its acceptance of the application. The authority may reject an approved application for failure by the applicant to authorize, execute, and deliver a commitment by the specified deadline.\n(a) The terms and conditions of loans provided by the authority pursuant to the credit enhanced bond program are as provided by this section, any applicable bond resolution or series bond resolution of the authority, any trust indenture pursuant to which any series of bonds of the authority are issued, the regulatory agreement, the commitment and the general obligation bond, and the authorizing resolution of the borrower.\n(b) The loan must be made by the authority through its purchase of the general obligation bond of the borrower. The borrower shall provide the authority with the opinion of nationally recognized bond counsel as to the valid authorization, issuance, and enforceability of the general obligation bond of the borrower, and the exclusion of interest thereon from gross income for the purposes of federal taxation, subject to customary qualifications. The general obligation bond of the borrower may pledge other specified sources of revenues for repayment to the extent permitted or required by law, in addition to the full faith and credit and unlimited taxing powers of the borrower.\n(c) The authority may disburse the proceeds of the loan as a single payment for the general obligation bond or from time to time pursuant to draw requests if the general obligation bond of the borrower is structured as a periodic drawdown bond. In the event the authority pays for the general obligation bond in a single payment, the borrower shall establish a project account and disburse the proceeds of its general obligation bond solely for costs of the project approved in its application pursuant to such additional requirements specified in the regulatory agreement.\n(d) In order to facilitate the issuance of the authority's revenue bonds to finance a pool of loans to different borrowers, the authority may require the borrower in the commitment to issue its general obligation bond on a date certain in the future, and may require the borrower to pay the costs incurred by the authority as a result of the borrower's failure to deliver its general obligation bond as required by the commitment. The commitment may also require the borrower to provide to the authority full disclosure of all material facts and financial information relating to the borrower that would be required if the borrower issued its general obligation bond to the public, certified as to completeness and accuracy by authorized officers of the borrower, and authorization for the authority to use such information in connection with the sale of the authority's revenue bonds or disclosure relating to the authority's revenue bonds.\n(e) In addition to delivering its general obligation bond, each borrower shall enter into a regulatory agreement with the authority providing additional terms of the loan as the authority may specify, including providing to the authority periodic reports and information relating to the acquisition or construction of the project and use of the proceeds of the borrower's general obligation bond and periodic operating, financial, and other information as to the creditworthiness of the borrower, and providing and filing continuing secondary market disclosure to the extent required by the authority.\n(f) The purchase or commitment to purchase general obligation bonds of borrowers by the authority shall be subject to the availability of proceeds of revenue bonds of the authority for such purpose and the authority is not liable to any borrower for the failure to purchase its general obligation bond pursuant to a commitment or any other agreement if proceeds of the authority's revenue bonds are not available for any reason.\nThe rate of interest on the general obligation bonds of the borrower must be the true interest cost on the revenue bonds of the authority issued to purchase such general obligation bonds of the borrower plus the ongoing percentage fee charged by the authority under subdivision 10; provided that the interest rate must not exceed any limit imposed by federal tax law with respect to the authority's revenue bonds.\nThe authority may suspend offering loans if it is determined by the executive director that there are extreme or unusual events impacting the bond market and that to continue making loans would be detrimental to holders of the authority's revenue bonds or the financial viability of the credit enhanced bond program, or if the state is warned by one of its rating agencies that continuing to make loans will result in lowering the state's bond rating. If the making of loans is suspended under this section, the authority shall have the option to resume making loans once it has determined that the conditions for suspending the program no longer exist.\nThe authority shall charge a nonrefundable application fee of $1,000 payable by each applicant upon submission of an application to the authority. A separate application fee must be payable for each application submitted, including a resubmitted application for an application that was rejected by the authority or determined to be incomplete or inaccurate by the authority. The authority shall charge an ongoing periodic fee of ten basis points of the outstanding principal amount of the loan to be added to, and be a component of, the interest rate on the general obligation bonds of the borrower.\n(a) The authority is authorized to issue revenue bonds as provided in this chapter to fund the credit enhanced bond program. The revenue bonds may be issued in one or more series pursuant to a resolution of the authority or a series resolution or pursuant to a trust indenture with a financial institution with trust powers as trustee, authorized by resolution of the authority. Any issue of bonds may be used to fund one or more loans, may be payable by the loans funded from such issue of bonds and such additional loans as pledged by the authority, and may be payable on a subordinated basis to other bonds. As permitted by the terms of any revenue bonds issued by the authority, the authority may sell the general obligations pledged to the payment of the revenue bonds and any proceeds of the sale in excess of those used to pay the principal of the revenue bonds must be deposited to the credit enhanced bond program fund and may be used to purchase additional general obligation bonds of borrowers, to provide credit enhancement for the authority's revenue bonds, or to pay any other expense of the credit enhanced bond program.\n(b) The authority may issue short-term bonds in anticipation of issuing long-term bonds for the purpose of acquiring general obligation bonds of borrowers.\n(c) Bonds issued by the authority for the credit enhanced bond program must not be general obligations of the authority to the payment of which the general assets of the authority are pledged or available for payment. All bonds issued for the credit enhanced bond programs by the authority must be revenue bonds payable solely from the sources specified in the bond.\n(a) During the term of the loan, the borrower shall provide written reports to the authority. The content and timing of these reports must be as specified in the regulatory agreement.\n(b) During the term of the loan, the borrower shall disclose to the authority any material information or events adversely affecting the creditworthiness of the borrower as specified in the regulatory agreement. If required by the authority in a regulatory agreement, the borrower shall enter into a continuing disclosure undertaking to provide disclosure to the market.\n(c) During the term of the loan, the borrower shall provide to the authority on an annual basis financial statements of the borrower audited by an independent accounting firm, as further specified in the regulatory agreement.",
	"repealed": false
}