{
	"id": "27.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/27.07",
	"title": "27.07 GRADES ESTABLISHED; INSPECTION.",
	"text": "The commissioner shall have power to establish grades on all perishable farm products and when necessary shall provide for inspecting and grading perishable farm products subject to sale at marketing points within the state as the commissioner may designate.\nThe commissioner shall issue certificates of inspection showing the grade, quality, and conditions of perishable farm products, and may charge and collect a reasonable fee for the issuance of a certificate of inspection. A certificate of inspection is prima facie evidence in all courts of this state as to the grade, quality, and condition of perishable farm products at the time the inspection was made.\nAny person who wants perishable farm products or a perishable farm products sales transaction to be inspected may apply to the commissioner for the service of an inspector and, if it appears to the commissioner that the perishable farm products volume is sufficient to justify the request, the commissioner may grant the service upon terms and conditions fixed by the commissioner and this section.\nThe commissioner may require an agreement, prior to the establishment of the inspection service, requiring the user of the inspection service to at all times have on deposit with the department a sufficient amount of money to pay the estimated costs of such inspection service for a period of not less than 15 days in advance. When any such agreement shall terminate by action of either party thereto, the commissioner shall pay to the depositor any money remaining to the depositor's credit after the deduction of the costs at the time such agreement terminates.\nFees for inspection shall be determined by the commissioner and shall be reviewed and adjusted every six months. In determining the fees to be charged, the commissioner shall take into consideration fees charged in other states offering similar inspection services to the end that the fees charged will provide a competitive marketing position for Minnesota perishable farm products.\nThe commissioner may collect fees as provided for in cooperative agreements between the commissioner and the United States Department of Agriculture for the inspection of perishable farm products. The fees and interest attributable to money in the account must be deposited in the agricultural fund and credited to a fruit and vegetables inspection account. Money in the account, including interest earned, is appropriated to the commissioner to administer the cooperative agreements.",
	"repealed": false
}