{
	"id": "65A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.29",
	"title": "65A.29 CANCELLATION; NONRENEWAL; REFUSAL TO WRITE.",
	"text": "No insurer may cancel a policy of homeowner's insurance except for the reasons specified in section 65A.01.\n[Repealed, 1984 c 602 s 6]\nUpon completion in writing of the insurer's application form for homeowner's insurance, any person having an insurable interest in real or tangible property at a fixed location shall be entitled upon written request either (a) to the insurer's offer of coverage, including type, amount and premium cost of coverage, or (b) to a written declination, stating specifically the underwriting or other reason for the refusal to write. For purposes of this subdivision, \"insurer\" means only an insurer writing or offering to write homeowner's insurance for property in the same statutory or home rule charter city or town in which the applicant's property is located.\nAny notice or statement required by subdivisions 1 to 3, or any other notice canceling a homeowner's insurance policy must be written in language which is easily readable and understandable by a person of average intelligence and understanding. The statement of reason must be sufficiently specific to convey, clearly and without further inquiry, the basis for the insurer's refusal to renew or to write the insurance coverage.\nThe notice or statement must also inform the insured of:\n(1) the possibility of coverage through the Minnesota FAIR plan under sections 65A.31 to 65A.42;\n(2) the right to object to the commissioner under subdivision 9; and\n(3) the right to the return of unearned premium in appropriate situations under subdivision 10.\nNotwithstanding sections 65A.01 and 65A.07, any policy of homeowner's insurance issued after January 1, 1980 shall contain nonrenewal provisions consistent with this section.\nThere shall be no liability on the part of and no cause of action of any nature shall arise against the commissioner or against any insurer, its authorized representative, its agents, its employees or any firm, person or corporation furnishing to the insured information as to reasons for declination, nonrenewal, or cancellation, for any statement made by them in any written notice of declination, nonrenewal or cancellation, for the providing of information relating thereto, or for statements made or evidence submitted at any hearings or investigations conducted in connection therewith. This subdivision shall not apply to any action or proceeding arising under section 72A.20.\nNo insurer shall refuse to renew, or reduce limits of coverage, or eliminate any coverage in a homeowner's insurance policy unless it mails or delivers to the insured, at the address shown in the policy, at least 60 days' advance notice of its intention. The notice must contain the specific underwriting or other reason or reasons for the indicated action and must state the name of the insurer and the date the notice is issued.\nProof of mailing this notice to the insured at the address shown in the policy is sufficient proof that the notice required by this section has been given.\n(a) The commissioner may adopt rules pursuant to chapter 14, to specify the grounds for nonrenewal, reduction in limits of coverage, or elimination of coverage of a homeowner's policy. The rules must limit the grounds to the following factors:\n(1) reasons stated for cancellation in section 65A.01, subdivision 3a;\n(2) reasons stated in section 72A.20, subdivision 13;\n(3) insured's loss experience, not to include natural causes; and\n(4) other factors deemed reasonable by the commissioner.\nThe rules may give consideration to the form and content of the termination notice to the insured, a statement as to what constitutes receipt of the termination notice, and the procedure by which the insured may appeal a termination notice.\nThe rules adopted under this subdivision may provide for imposition of a monetary penalty not greater than $500 per occurrence upon insurers who are found to be in violation of the law or the rules.\n(b) In addition to any rules adopted under this subdivision, an insured may appeal any nonrenewal under this section to the commissioner of commerce. If the commissioner finds that the nonrenewal is unjustified, arbitrary, or capricious, the commissioner shall order the insurer to reinstate the insured's policy. The commissioner's order may be appealed pursuant to chapter 14. The insured's policy shall continue in force pending the conclusion of the appeal to the commissioner. The insurer must notify the insured of the insured's right to appeal the nonrenewal to the commissioner in the notice of nonrenewal required under subdivision 7.\n(a) An insurer may refuse to renew a policy of homeowner's insurance if the insured had three or more covered losses each over $10,000 resulting from lightning, wind, rain, or hail during the five-year period immediately preceding the refusal to renew.\n(b) If an insurer elects to not renew a policy of homeowner's insurance under paragraph (a), the insurer must provide the insured 60 days' advance notice of the insurer's intention to make the election. The notice must specify the reason for the refusal to renew and must inform the insured of the possibility of coverage through the Minnesota FAIR plan under sections 65A.31 to 65A.42.\n(c) An insurer writing homeowner's insurance for property located in Minnesota must annually report to the commissioner the number of policies not renewed under paragraph (a).\n(d) An insurer may, at the end of a homeowner's insurance policy period, offer to reduce the policy's coverage by revising the policy's deductible to a percentage-based deductible solely for losses resulting from lightning, wind, rain, or hail without complying with the nonrenewal rules in Minnesota Rules, chapter 2880, provided:\n(1) the percentage-based deductible only obligates the insured to pay that percentage of the cost, at the time any loss or damage occurs, to actually repair, rebuild, or replace the insured property;\n(2) the insurer provides the insured at least 60 days' advance notice of the insurer's offer to revise the deductible in a manner consistent with this section;\n(3) the 60 days' notice the insurer provides to the insured clearly and fully discloses in plain language all details pertaining to the revised deductible, including an example of how the deductible works in the event of an insured loss resulting from lightning, wind, rain, or hail with the percentage the consumer is obligated to pay when applied to the cost of repair; and\n(4) the insurer offers the insured at least one reasonable flat-dollar deductible option that does not exceed the highest percentage deductible policy in lieu of the percentage-based deductible. The offer under this clause must be included in the 60 days' notice the insurer provides to the insured. The 60 days' notice must also clearly and conspicuously disclose that if the insured fails to elect the percentage-based deductible but renews the policy, the policy's deductible is the flat-dollar deductible.\nA named insured who believes a nonrenewal, reduction in the limits of coverage, elimination of coverage, or cancellation under section 65A.01, subdivision 3a, is in violation of the law or the rules may, within 30 days after receipt of the notice, file in writing an objection to the action with the commissioner.\nUpon receipt of a written objection, the commissioner shall notify the insurer of receipt of the objection and of the right of the insurer to file a written response within ten days of receipt of the notification. Within 30 days of receipt of written objection by an insured, the commissioner shall approve or disapprove the insurer's action and shall notify the insured and insurer of the final decision. A decision which disapproves the insurer's action constitutes a charge that the insurer has violated the law or the rules. Either party may institute proceedings for judicial review of the commissioner's decision. The commissioner's decision is binding pending judicial review.\nCancellation of a policy of homeowner's insurance pursuant to this section is not effective unless any unearned premium due the insured is returned to the insured with the notice of cancellation or is delivered or sent by mail to the insured so as to be received by the insured not later than the effective date of cancellation. If the premium has been paid by the insured's agent and debited to the agent's account with the company, upon cancellation, the unearned premium must be credited to the agent's account with the company.\nEvery insurer shall establish a plan that sets out the minimum number and amount of claims during an experience period that may result in a nonrenewal. For purposes of the plan, the insurer may not consider as a claim the insured's inquiry about a hypothetical claim, or the insured's inquiry to the insured's agent regarding a potential claim.\nNo homeowner's insurance policy may be nonrenewed based on the insured's loss experience unless the insurer has sent a written notice that any future losses may result in nonrenewal due to loss experience.\nAny nonrenewal of a homeowner's insurance policy must, at a minimum, comply with the requirements of subdivision 8 and the rules adopted by the commissioner.\n[Repealed, 1999 c 177 s 88]\n(a) A written notice must be provided to all applicants for homeowners' insurance, at the time the application is submitted, containing the following language in bold print: \"THE INSURER MAY ELECT TO CANCEL COVERAGE AT ANY TIME DURING THE FIRST 59 DAYS FOLLOWING ISSUANCE OF THE COVERAGE FOR ANY REASON WHICH IS NOT SPECIFICALLY PROHIBITED BY STATUTE.\"\n(b) If the insurer provides the notice on the insurer's website, the insurer or agent may advise the applicant orally or in writing of its availability for review on the insurer's website in lieu of providing a written notice, if the insurer advises the applicant of the availability of a written notice upon the applicant's request. The insurer shall provide the notice in writing if requested by the applicant. An oral notice shall be presumed delivered if the agent or insurer makes a contemporaneous notation in the applicant's record of the notice having been delivered or if the insurer or agent retains an audio recording of the notification provided to the applicant.",
	"repealed": false
}