{
	"id": "475.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.51",
	"title": "475.51 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section shall have the meanings given them.\n\"Municipality\" means a city of any class, county, town, or school district.\n\"Obligation\" means any promise to pay a stated amount of money at a fixed future date or upon demand of the obligee, regardless of the source of funds to be used for its payment, made for the purpose of incurring debt, including the purchase of property through an installment purchase contract or any other deferred payment agreement, for which funds are not appropriated in the current year's budget.\n\"Net debt\" means the amount remaining after deducting from its gross debt the amount of current revenues which are applicable within the current fiscal year to the payment of any debt and the aggregate of the principal of the following:\n(1) Obligations issued for improvements which are payable wholly or partly from the proceeds of special assessments levied upon property specially benefited thereby, including those which are general obligations of the municipality issuing them, if the municipality is entitled to reimbursement in whole or in part from the proceeds of the special assessments.\n(2) Warrants or orders having no definite or fixed maturity.\n(3) Obligations payable wholly from the income from revenue producing conveniences.\n(4) Obligations issued to create or maintain a permanent improvement revolving fund.\n(5) Obligations issued for the acquisition, and betterment of public waterworks systems, and public lighting, heating or power systems, and of any combination thereof or for any other public convenience from which a revenue is or may be derived.\n(6) Debt service loans and capital loans made to a school district under the provisions of sections 126C.68 and 126C.69.\n(7) Amount of all money and the face value of all securities held as a debt service fund for the extinguishment of obligations other than those deductible under this subdivision.\n(8) Obligations to repay loans made under section 216C.37.\n(9) Obligations to repay loans made from money received from litigation or settlement of alleged violations of federal petroleum pricing regulations.\n(10) Obligations issued to pay pension fund or other postemployment benefit liabilities under section 475.52, subdivision 6, or any charter authority.\n(11) Obligations issued to pay judgments against the municipality under section 475.52, subdivision 6, or any charter authority.\n(12) All other obligations which under the provisions of law authorizing their issuance are not to be included in computing the net debt of the municipality.\n\"Net tax capacity\" means the latest valuation for purposes of taxation, as finally equalized, of all property taxable within the municipality.\n\"Debt service fund\" means any money and investments in the treasury of a municipality appropriated to pay the principal, interest, or premiums for the redemption of any of its obligations. \"Sinking fund\" means debt service fund. A separate balance sheet need not be maintained for any debt service fund, and the fund need not be segregated from other funds of the municipality in a separate bank deposit account or in a separate investment fund or account, unless so provided in a resolution or other instrument securing obligations payable from the debt service fund; but a separate bookkeeping account or accounts shall be maintained in the official financial records of the municipality reflecting all receipts and disbursements of money and investments of principal and income appropriated for the purposes of each debt service fund.\n\"Acquisition\" includes purchase, condemnation, construction, and acquisition of necessary land, easements, buildings, structures, machinery or equipment.\n\"Betterment\" includes reconstruction, extension, improvement, repair, remodeling, lighting, equipping, and furnishing.\n\"Governing body\" means the board, council, commission, or other body of the municipality charged with the general control of its financial affairs; provided, that where any charter or law confers bond issuing power on a particular board or body of a municipality, such board or body is the governing body under the provisions of sections 475.51 to 475.74.\n\"General obligations\" means any obligations which pledge the full faith and credit of the municipality to their payment.\n\"Reporting dealer to the Federal Reserve Bank of New York\" means a securities broker-dealer licensed pursuant to chapter 80A, or an affiliate thereof, which makes primary markets in United States government securities and reports daily to the Federal Reserve Bank of New York its position with respect to such securities held by it and amounts borrowed thereon.\n\"Reverse repurchase agreement\" means an obligation incurred by a municipality to repurchase at a fixed future date and price a security sold by it to a financial institution on the date of the agreement, or another security identical as to the issuer, source of payment, principal amount, interest rate, maturity, and redemption provisions. The principal amount of the obligation is the sale price of the security, excluding any accrued interest thereon paid to the municipality. The interest payable by the municipality on the obligation is the difference between the sale price and the repurchase price of the security, excluding any accrued interest thereon received by the financial institution.\n\"Other governmental unit\" means any public corporation, authority, governmental unit, or other political subdivision of the state of Minnesota that is not a municipality.\n\"Bond reinvestment program\" means a program under which a municipality, either directly or through an agent employed for the purpose, offers and sells its obligations to the holders of other obligations of the municipality. These offers and sales are directed at the reinvestment in new obligations of funds derived from maturing principal and interest and may also include offers and sales of additional newly issued obligations in addition to the reinvestment of principal and interest paid or to be paid on outstanding obligations and provision for the temporary investment of funds received for the purchase of new obligations in tax-exempt securities pending the issuance of the new obligations.",
	"repealed": false
}