{
	"id": "169.454",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.454",
	"title": "169.454 TYPE III VEHICLE STANDARDS.",
	"text": "This section applies to type III vehicles used for the transportation of school children when owned and operated by a school district or privately owned and operated. All related equipment provided on the vehicle must comply with federal motor vehicle safety standards where applicable. If no federal standard applies, equipment must be manufacture's standard.\nVehicles model year 2007 or older must not be used as type III vehicles to transport school children, except those vehicles that are manufactured to meet the structural requirements of federal motor vehicle safety standard 222, Code of Federal Regulations, title 49, part 571.\nVehicles must be painted a color other than national school bus yellow.\nA minimum of one 10BC rated dry chemical type fire extinguisher is required. The extinguisher must be mounted in a bracket, and must be located in the driver's compartment and be readily accessible to the driver and passengers. A pressure indicator is required and must be easily read without removing the extinguisher from its mounted position.\nA minimum of a ten-unit first aid kit, and a body fluids cleanup kit is required. They must be contained in removable, moisture- and dust-proof containers mounted in an accessible place within the driver's compartment and must be marked to indicate their identity and location.\nThe vehicle must not have the words \"school bus\" in any location on the exterior of the vehicle, or in any interior location visible to a motorist.\nInstallation and use of the eight-lamp warning system is prohibited.\nAll lamps on the exterior of the vehicle must conform with and be installed as required by federal Motor Vehicle Safety Standard 108, Code of Federal Regulations, title 49, part 571.\nInstallation and use of a stop-signal arm is prohibited.\nThe interior clear rearview mirror must afford a good view of pupils and roadway to the rear. Two exterior clear rearview mirrors must be provided, one to the left and one to the right of the driver. Each mirror must be firmly supported and adjustable to give the driver clear view past the left rear and the right rear of the bus.\n[Repealed, 2012 c 137 s 9]\n[Repealed, 1Sp1997 c 4 art 12 s 34]\nType III vehicles may carry fire extinguisher, first aid kit, and warning triangles in the trunk or trunk area of the vehicle, if a label in the driver and front passenger area clearly indicates the location of these items.\nWhen a vehicle otherwise qualifying as a type III vehicle under section 169.011, subdivision 71, whether owned and operated by a school district or privately owned and operated, is used to transport school children in a nonscheduled situation, it shall be exempt from the vehicle requirements of this section and the licensing requirements of section 171.321, if the vehicle is properly registered and insured and operated by an employee or agent of a school district with a valid driver's license.",
	"repealed": false
}