{
	"id": "65A.299",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.299",
	"title": "65A.299 STRENGTHEN MINNESOTA HOMES PROGRAM.",
	"text": "This section may be cited as the \"Strengthen Minnesota Homes Act.\"\n(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Insurable property\" has the meaning given in section 65A.298, subdivision 1.\n(c) \"Program\" means the Strengthen Minnesota Homes program established under this section.\nThe Strengthen Minnesota Homes program is established within the Department of Commerce. The purpose of the program is to provide grants to retrofit insurable property to resist loss due to common perils, including but not limited to tornadoes or other catastrophic windstorm events.\n(a) A strengthen Minnesota homes account is created as a separate account in the special revenue fund of the state treasury. The account consists of money provided by law and any other money donated, allotted, transferred, or otherwise provided to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund and remains in the account until expended. The commissioner must manage the account.\n(b) Money in the account is appropriated to the commissioner to pay for (1) grants issued under the program, and (2) the reasonable costs incurred by the commissioner to administer the program.\n(a) A grant under this section must be used to retrofit an insurable property.\n(b) Grant money provided under this section must not be used for maintenance or repairs, but may be used in conjunction with repairs or reconstruction necessitated by damage from wind or hail.\n(c) A project funded by a grant under this section must be completed within three months of the date the grant is approved. Failure to complete the project in a timely manner may result in forfeiture of the grant.\nThe commissioner must develop (1) administrative procedures to implement this section, and (2) criteria used to determine whether an applicant is eligible for a grant under this section.\n(a) To be eligible to work as a contractor on a project funded by a grant under this section, the contractor must meet all of the following program requirements and must maintain a current copy of all certificates, licenses, and proof of insurance coverage with the program office. The eligible contractor must:\n(1) hold a valid residential building contractor and residential remodeler license issued by the commissioner of labor and industry;\n(2) not be subject to disciplinary action by the commissioner of labor and industry;\n(3) hold any other valid state or jurisdictional business license or work permits required by law;\n(4) possess an in-force general liability policy with $1,000,000 in liability coverage;\n(5) possess an in-force workers compensation policy;\n(6) possess a certificate of compliance from the commissioner of revenue;\n(7) successfully complete the Fortified Roof for High Wind and Hail training provided by the IBHS and maintain an active certification. The training may be offered as separate courses;\n(8) agree to the terms and successfully register as a vendor with the commissioner of management and budget and receive direct deposit of payment for mitigation work performed under the program;\n(9) maintain Internet access and keep a valid email address on file with the program and remain active in the commissioner of management and budget's vendor and supplier portal while working on the program;\n(10) maintain an active email address for the communication with the program;\n(11) successfully complete the program training; and\n(12) agree to follow program procedures and rules established under this section and by the commissioner.\n(b) An eligible contractor must not have a financial interest, other than payment on behalf of the homeowner, in any project for which the eligible contractor performs work toward a fortified designation under the program. An eligible contractor is prohibited from acting as the evaluator for a fortified designation on any project funded by the program. An eligible contractor must report to the commissioner regarding any potential conflict of interest before work commences on any job funded by the program.\n(a) To be eligible to work on the program as an evaluator, the evaluator must meet all program eligibility requirements and must submit to the commissioner and maintain a copy of all current certificates and licenses. The evaluator must:\n(1) be in good standing with IBHS and maintain an active certification as a fortified home evaluator for high wind and hail or a successor certification;\n(2) possess a Minnesota business license and be registered with the secretary of state; and\n(3) successfully complete the program training.\n(b) An evaluator must not have a financial interest in any project that the evaluator inspects for designation purposes for the program. An evaluator must not be an eligible contractor or supplier of any material, product, or system installed in any home that the evaluator inspects for designation purposes for the program. An evaluator must not be a sales agent for any home being designated for the program. An evaluator must inform the commissioner of any potential conflict of interest impacting the evaluator's participation in the program.\n(a) The commissioner must review all applications for completeness and must perform appropriate audits to verify (1) the accuracy of the information on the application, and (2) that the applicant meets all eligibility rules. All verified applicants must be placed in the order the application was received. Grants must be awarded on a first-come, first-served basis, subject to availability of money for the program.\n(b) When a grant is approved, an approval letter must be sent to the applicant.\n(c) An eligible contractor is prohibited from beginning work until a grant is approved.\n(d) In order to assure equitable distribution of grants in proportion to the income demographics in counties where the program is made available, grant applications must be accepted on a first-come, first-served basis. The commissioner may establish pilot projects as needed to establish a sustainable program distribution system in any geographic area within Minnesota.\n(a) After a grant application is approved, the eligible contractor selected by the homeowner may begin the mitigation work.\n(b) Once the mitigation work is completed, the eligible contractor must submit a copy of the signed contract to the commissioner, along with an invoice seeking payment and an affidavit stating the fortified standards were met by the work.\n(c) The IBHS evaluator must conduct all required evaluations, including a required interim inspection during construction and the final inspection, and must confirm that the work was completed according to the mitigation specifications.\n(d) Grant money must be released on behalf of an approved applicant only after a fortified designation certificate has been issued for the home. The program or another designated entity must, on behalf of the homeowner, directly pay the eligible contractor that performed the mitigation work. The program or the program's designated entity must pay the eligible contractor the costs covered by the grant. The homeowner must pay the eligible contractor for the remaining cost after receiving an IBHS fortified certificate.\n(e) The program must confirm that the homeowner's insurer provides the appropriate premium discount.\n(f) The program must conduct random reinspections to detect any fraud and must submit any irregularities to the attorney general.\n(a) This section does not create an entitlement for property owners or obligate the state of Minnesota to pay for residential property in Minnesota to be inspected or retrofitted. The program under this section is subject to legislative appropriations, the receipt of federal grants or money, or the receipt of other sources of grants or money. The department may obtain grants or other money from the federal government or other funding sources to support and enhance program activities.\n(b) All mitigation under this section is contingent upon securing all required local permits and applicable inspections to comply with local building codes and applicable Fortified program standards. A mitigation project receiving a grant under this section is subject to random reinspection at a later date.",
	"repealed": false
}