{
	"id": "145D.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/145D.30",
	"title": "145D.30 DEFINITIONS.",
	"text": "For purposes of sections 145D.30 to 145D.37, the following terms have the meanings given unless the context clearly indicates otherwise.\n\"Commissioner\" means the commissioner of commerce for a nonprofit health coverage entity that is a nonprofit health service plan corporation operating under chapter 62C or the commissioner of health for a nonprofit health coverage entity that is a nonprofit health maintenance organization operating under chapter 62D.\n\"Control,\" including the terms \"controlling,\" \"controlled by,\" and \"under common control with,\" means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a nonprofit health coverage entity, whether through the ownership of voting securities, through membership in an entity formed under chapter 317A, by contract other than a commercial contract for goods or nonmanagement services, or otherwise, unless the power is the result of an official position with, corporate office held by, or court appointment of the person. Control is presumed to exist if any person, directly or indirectly, owns, controls, holds with the power to vote, or holds proxies representing 40 percent or more of the voting securities of any other person or if any person, directly or indirectly, constitutes 40 percent or more of the membership of an entity formed under chapter 317A. The attorney general may determine that control exists in fact, notwithstanding the absence of a presumption to that effect.\n\"Conversion transaction\" means a transaction otherwise permitted under applicable law in which a nonprofit health coverage entity:\n(1) merges, consolidates, converts, or transfers all or substantially all of its assets to any entity except a corporation that is exempt under United States Code, title 26, section 501(c)(3);\n(2) makes a series of separate transfers within a 60-month period that in the aggregate constitute a transfer of all or substantially all of the nonprofit health coverage entity's assets to any entity except a corporation that is exempt under United States Code, title 26, section 501(c)(3); or\n(3) adds or substitutes one or more directors or officers that effectively transfer the control of, responsibility for, or governance of the nonprofit health coverage entity to any entity except a corporation that is exempt under United States Code, title 26, section 501(c)(3).\n\"Corporation\" has the meaning given in section 317A.011, subdivision 6, and also includes a nonprofit limited liability company organized under section 322C.1101.\n\"Director\" has the meaning given in section 317A.011, subdivision 7.\n\"Family member\" means a spouse, parent, child, spouse of a child, brother, sister, or spouse of a brother or sister.\n\"Full and fair value\" means at least the amount that the public benefit assets of the nonprofit health coverage entity would be worth if the assets were equal to stock in the nonprofit health coverage entity, if the nonprofit health coverage entity was a for-profit corporation and if the nonprofit health coverage entity had 100 percent of its stock authorized by the corporation and available for purchase without transfer restrictions. The valuation shall consider market value, investment or earning value, net asset value, goodwill, amount of donations received, and control premium, if any.\n\"Nonprofit health coverage entity\" means a domestic nonprofit health service plan corporation operating under chapter 62C or a domestic nonprofit health maintenance organization operating under chapter 62D.\n\"Officer\" has the meaning given in section 317A.011, subdivision 15.\n\"Public benefit assets\" means the entirety of a nonprofit health coverage entity's assets, whether tangible or intangible, including but not limited to its goodwill and anticipated future revenue.\n\"Related organization\" has the meaning given in section 317A.011, subdivision 18.",
	"repealed": false
}