{
	"id": "14.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.03",
	"title": "14.03 NONAPPLICABILITY.",
	"text": "The Administrative Procedure Act in sections 14.001 to 14.69 does not apply to (a) agencies directly in the legislative or judicial branches, (b) emergency powers in sections 12.31 to 12.37, (c) the Department of Military Affairs, (d) the Comprehensive Health Association provided in section 62E.10, or (e) the regents of the University of Minnesota.\nThe contested case procedures of the Administrative Procedure Act provided in sections 14.57 to 14.69 do not apply to (a) proceedings under chapter 414, except as specified in that chapter, (b) the commissioner of corrections, (c) the unemployment insurance program and the Social Security disability determination program in the Department of Employment and Economic Development, (d) the commissioner of mediation services, (e) the Workers' Compensation Division in the Department of Labor and Industry, (f) the Workers' Compensation Court of Appeals, or (g) the Board of Pardons.\n(a) The definition of a rule in section 14.02, subdivision 4, does not include:\n(1) rules concerning only the internal management of the agency or other agencies that do not directly affect the rights of or procedures available to the public;\n(2) an application deadline on a form; and the remainder of a form and instructions for use of the form to the extent that they do not impose substantive requirements other than requirements contained in statute or rule;\n(3) the curriculum adopted by an agency to implement a statute or rule permitting or mandating minimum educational requirements for persons regulated by an agency, provided the topic areas to be covered by the minimum educational requirements are specified in statute or rule;\n(4) procedures for sharing data among government agencies, provided these procedures are consistent with chapter 13 and other law governing data practices.\n(b) The definition of a rule in section 14.02, subdivision 4, does not include:\n(1) rules of the commissioner of corrections relating to the release, placement, term, and supervision of inmates serving a supervised release or conditional release term, the internal management of institutions under the commissioner's control, and rules adopted under section 609.105 governing the inmates of those institutions;\n(2) rules relating to weight limitations on the use of highways when the substance of the rules is indicated to the public by means of signs;\n(3) opinions of the attorney general;\n(4) the data element dictionary and the annual data acquisition calendar of the Department of Education to the extent provided by section 125B.07;\n(5) the occupational safety and health standards provided in section 182.655;\n(6) revenue notices and tax information bulletins of the commissioner of revenue;\n(7) uniform conveyancing forms adopted by the commissioner of commerce under section 507.09;\n(8) standards adopted by the Electronic Real Estate Recording Commission established under section 507.0945; or\n(9) the interpretive guidelines developed by the commissioner of human services to the extent provided in chapter 245A.\nThe legislature will consider granting further exemptions from the rulemaking requirements of this chapter for rules that are necessary to comply with a requirement in federal law or that are necessary to avoid a denial of funds or services from the federal government that would otherwise be available to the state.",
	"repealed": false
}