{
	"id": "3.222",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.222",
	"title": "3.222 SCIENCE AND TECHNOLOGY POLICY.",
	"text": "The science and technology policy in this section lists five goals that contribute to Minnesota's long-term economic growth. Development of these goals is critical if the state is to create an environment conducive to the growth and expansion of technology-based companies, as well as to improve the competitive ability of existing industries.\n(a) Minnesota has a long tradition of innovation and entrepreneurship. However, with the dramatic changes taking place in the global economy, the pace of technological change and shortened product life cycles, entrepreneurs and emerging technology-based companies are finding it increasingly difficult to compete effectively without appropriate resources. These entities represent the future of Minnesota's economy.\n(b) To give these entrepreneurs and emerging technology-based companies a greater chance at success, the state must support excellence in innovation and nurture their creative spirit by providing incentives to spur growth.\n(a) The vast majority of Minnesota companies, both in rural and metropolitan areas, employ fewer than 50 employees. These small companies generally lack the resources to identify and implement available technologies that can help them modernize their industrial processes and develop their products in a more efficient manner. This is particularly pronounced in the manufacturing area.\n(b) The state must play a critical role in improving the competitive ability of these companies by making available information, technical expertise, and other services required to access existing, off-the-shelf technologies.\n(a) Continued research and development is a prerequisite to the commercialization of new products and the growth of technology-based companies.\n(b) State government must play a significant role in supporting applied research and development initiatives. To maximize the impact, these initiatives in research and development must be closely tied to the research needs of the state's technology-based companies.\n(a) To compete in the future, communities will have to increasingly rely on knowledge-based economies. Not only will the work force of the future need to be more technically skilled than at present, but the basic level of literacy will also have to continually increase.\n(b) State government must continue to invest extensively in Minnesota's human capital and must produce more scientists and engineers. This investment is required throughout the educational system.\n(a) Investment in programs that match federal funds for scientific and technological initiatives, match industry support, or otherwise support the development of research facilities is crucial to scientific and technological development in Minnesota.\n(b) The state must have the ability to act on individual opportunities that may occur from time to time and that would enhance Minnesota's technology infrastructure.",
	"repealed": false
}