{
	"id": "103F.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.05",
	"title": "103F.05 WATER QUALITY AND STORAGE PROGRAM.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Board\" means the Board of Water and Soil Resources.\n(c) \"Local units of government\" has the meaning given under section 103B.305, subdivision 5.\n(d) \"Water quality and storage practices\" means those practices that sustain or improve water quality via surface water rate and volume and ecological management, including but not limited to:\n(1) retention structures and basins;\n(2) acquisition of flowage rights;\n(3) soil and substrate infiltration;\n(4) wetland restoration, creation, or enhancement;\n(5) channel restoration or enhancement; and\n(6) floodplain restoration or enhancement.\n(a) The board must establish a program to provide financial assistance to local units of government to control water volume and rates to protect infrastructure, improve water quality and related public benefits, and mitigate climate change impacts.\n(b) In establishing a water quality and storage program, the board must give priority to the Minnesota River basin and the lower Mississippi River basin in Minnesota.\n(a) The board may provide financial assistance to local units of government to cover the costs of water storage projects and other water quality and storage practices consistent with a plan approved according to chapter 103B, 103C, or 103D. Eligible costs include costs for property and equipment acquisition, design, engineering, construction, and management. The board may acquire conservation easements under sections 103F.501 to 103F.531 as necessary to implement a project or practice under this section.\n(b) The board must enter into agreements with local units of government receiving financial assistance under this section. The agreements must specify the terms of state and local cooperation, including the financing arrangement for constructing any structures and assuring maintenance of the structures after completion.\nThe board must require a matching contribution when providing financial assistance under this section and may adjust matching requirements if federal funds are available for the project.\n(a) The board may employ or contract with an engineer or hydrologist to work on the technical implementation of the program established under this section.\n(b) When implementing the program, the board must:\n(1) assist local units of government in achieving the goals of the program;\n(2) review and analyze projects and project sites; and\n(3) evaluate the effectiveness of completed projects constructed under the program.\n(c) The board must cooperate with the commissioner of natural resources, the United States Department of Agriculture Natural Resources Conservation Service, and other agencies as needed to analyze hydrological, climate, and engineering information on proposed sites.\n(a) A local unit of government applying for financial assistance under this section must provide a copy of a resolution or other documentation of the local unit of government's support for the project. The documentation must include provisions for local funding and management, the proposed method of obtaining necessary land rights for the proposed project, and an assignment of responsibility for maintaining any structures or practices upon completion.\n(b) A local unit of government, with the assistance of the board, must evaluate the public benefits that are reasonably expected upon completing the proposed project. The evaluation must be submitted to the board before the final design.\nThe board may enter into or approve working agreements with neighboring states or their political subdivisions to accomplish projects consistent with the program established under this section.\nThe board must regularly analyze the availability of federal funds and programs to supplement or complement state and local efforts consistent with the purposes of this section.",
	"repealed": false
}