{
	"id": "477A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.35",
	"title": "477A.35 LOCAL AFFORDABLE HOUSING AID.",
	"text": "MS 2023 Supp [Repealed, 2024 c 127 art 15 s 54]\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"City distribution factor\" means the number of households in a tier I city that are cost-burdened divided by the total number of households that are cost-burdened in tier I cities. The number of cost-burdened households shall be determined using the most recent estimates or experimental estimates provided by the American Community Survey of the United States Census Bureau as of May 1 of the aid calculation year.\n(c) \"Cost-burdened household\" means a household in which gross rent is 30 percent or more of household income or in which homeownership costs are 30 percent or more of household income.\n(d) \"County distribution factor\" means the number of households in a county that are cost-burdened divided by the total number of households in metropolitan counties that are cost-burdened. The number of cost-burdened households shall be determined using the most recent estimates or experimental estimates provided by the American Community Survey of the United States Census Bureau as of May 1 of the aid calculation year.\n(e) \"Locally funded housing expenditures\" means expenditures of the aid recipient, including expenditures by a public corporation or legal entity created by the aid recipient, that are:\n(1) funded from the recipient's general fund, a property tax levy of the recipient or its housing and redevelopment authority, or unrestricted money available to the recipient, but not including tax increments; and\n(2) expended on one of the following qualifying activities:\n(i) financial assistance to residents in arrears on rent, mortgage, utilities, or property tax payments;\n(ii) support services, case management services, and legal services for residents in arrears on rent, mortgage, utilities, or property tax payments;\n(iii) down payment assistance or homeownership education, counseling, and training;\n(iv) acquisition, construction, rehabilitation, adaptive reuse, improvement, financing, and infrastructure of residential dwellings;\n(v) costs of operating emergency shelter, transitional housing, supportive housing, or publicly owned housing, including costs of providing case management services and support services; and\n(vi) rental assistance.\n(f) \"Metropolitan area\" has the meaning given in section 473.121, subdivision 2;\n(g) \"Metropolitan county\" has the meaning given in section 473.121, subdivision 4;\n(h) \"Population\" has the meaning given in section 477A.011, subdivision 3; and\n(i) \"Tier I city\" means a statutory or home rule charter city that is a city of the first, second, or third class and is located in a metropolitan county.\n(a) The commissioner of revenue shall calculate the amount of aid to distribute to each county under this section as the sum of:\n(1) three percent of the total amount available to counties under this section; plus\n(2) 79 percent of the total amount available to counties under this section, multiplied by the county distribution factor.\n(b) The commissioner of revenue shall calculate the amount of aid to distribute to each tier I city under this section as:\n(1) the tier I city's city distribution factor; multiplied by\n(2) the total amount available to cities under this section.\n(a) Qualifying projects include:\n(1) emergency rental assistance for households earning less than 80 percent of area median income as determined by the United States Department of Housing and Urban Development;\n(2) financial support to nonprofit affordable housing providers in their mission to provide safe, dignified, affordable and supportive housing;\n(3) projects designed for the purpose of construction, acquisition, rehabilitation, demolition or removal of existing structures, construction financing, permanent financing, interest rate reduction, refinancing, and gap financing of housing to provide affordable housing to households that have incomes which do not exceed, for homeownership projects, 115 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development, and for rental housing projects, 80 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development, except that the housing developed or rehabilitated with funds under this section must be affordable to the local work force;\n(4) financing the operations and management of financially distressed residential properties;\n(5) funding of supportive services or staff of supportive services providers for supportive housing as defined by section 462A.37, subdivision 1. Financial support to nonprofit housing providers to finance supportive housing operations may be awarded as a capitalized reserve or as an award of ongoing funding; and\n(6) costs of operating emergency shelter facilities, including the costs of providing services.\n(b) Recipients must prioritize projects that provide affordable housing to households that have incomes which do not exceed, for homeownership projects, 80 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development, and for rental housing projects, 50 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development. Priority may be given to projects that: reduce disparities in home ownership; reduce housing cost burden, housing instability, or homelessness; improve the habitability of homes; create accessible housing; or create more energy- or water-efficient homes.\n(c) Gap financing is either:\n(1) the difference between the costs of the property, including acquisition, demolition, rehabilitation, and construction, and the market value of the property upon sale; or\n(2) the difference between the cost of the property and the amount the targeted household can afford for housing, based on industry standards and practices.\n(d) If aid under this section is used for demolition or removal of existing structures, the cleared land must be used for the construction of housing to be owned or rented by persons who meet the income limits of paragraph (a).\n(e) If an aid recipient uses the aid on new construction of a building containing more than four units, the loan recipient must construct, convert, or otherwise adapt the building to include:\n(1) the greater of: (i) at least one unit; or (ii) at least five percent of units that are accessible units, and each accessible unit includes at least one roll-in shower, water closet, and kitchen work surface meeting the requirements of section 1002 of the current State Building Code Accessibility Provisions for Dwelling Units in Minnesota; and\n(2) the greater of: (i) at least one unit; or (ii) at least five percent of units that are sensory-accessible units that include:\n(A) soundproofing between shared walls for first and second floor units;\n(B) no florescent lighting in units and common areas;\n(C) low-fume paint;\n(D) low-chemical carpet; and\n(E) low-chemical carpet glue in units and common areas.\nNothing in this paragraph relieves a project funded by this section from meeting other applicable accessibility requirements.\n(a) Any funds distributed under this section must be spent on a qualifying project. Funds are considered spent on a qualifying project if:\n(1) a tier I city or county demonstrates to the Minnesota Housing Finance Agency that the city or county cannot expend funds on a qualifying project by the deadline imposed by paragraph (b) due to factors outside the control of the city or county; and\n(2) the funds are transferred to a local housing trust fund.\nFunds transferred to a local housing trust fund under this paragraph must be spent on a project or household that meets the affordability requirements of subdivision 4, paragraph (a).\n(b) Funds must be spent by December 31 in the third year following the year after the aid was received. The requirements of this paragraph are satisfied if funds are:\n(1) committed to a qualifying project by December 31 in the third year following the year after the aid was received; and\n(2) expended by December 31 in the fourth year following the year after the aid was received.\n(c) An aid recipient may not use aid money to reimburse itself for prior expenditures.\n(a) As a condition of receiving aid under this section, a recipient must commit to using funds to supplement, not supplant, existing locally funded housing expenditures, so that the recipient is using the funds to create new or to expand existing housing programs.\n(b) In the annual report required under subdivision 6, a recipient must certify its compliance with this subdivision, including an accounting of locally funded housing expenditures in the prior fiscal year. In a tier I city's or county's first report to the Minnesota Housing Finance Agency, it must document its locally funded housing expenditures in the two prior fiscal years. If a recipient reduces one of its locally funded housing expenditures, the recipient must detail the expenditure, the amount of the reduction, and the reason for the reduction. The certification required under this paragraph must be made available publicly on the website of the recipient.\n(a) The commissioner of revenue must compute the amount of aid payable to each tier I city and county under this section. By August 1 of each year, the commissioner must certify the distribution factors of each tier I city and county to be used in the following year. The commissioner must pay local affordable housing aid annually at the times provided in section 477A.015, distributing the amounts available on the immediately preceding June 1 under the accounts established in section 477A.37, subdivisions 2 and 3.\n(b) Beginning in 2025, tier I cities and counties shall submit a report annually, no later than December 1 of each year, to the Minnesota Housing Finance Agency. The report must include documentation of the location of any unspent funds distributed under this section and of qualifying projects completed or planned with funds under this section. If a tier I city or county fails to submit a report, if a tier I city or county fails to spend funds within the timeline imposed under subdivision 5, paragraph (b), if a tier I city or county uses funds for a project that does not qualify under this section, or if a tier I city or county fails to meet its requirements of subdivision 5a, the Minnesota Housing Finance Agency shall notify the Department of Revenue and the cities and counties that must repay funds under paragraph (c) by February 15 of the following year.\n(c) By May 15, after receiving notice from the Minnesota Housing Finance Agency, a tier I city or county must pay to the Minnesota Housing Finance Agency funds the city or county received under this section if the city or county:\n(1) fails to spend the funds within the time allowed under subdivision 5, paragraph (b);\n(2) spends the funds on anything other than a qualifying project;\n(3) fails to submit a report documenting use of the funds; or\n(4) fails to meet the requirements of subdivision 5a.\n(d) The commissioner of revenue must stop distributing funds to a tier I city or county that requests in writing that the commissioner stop payment or that, in three consecutive years, the Minnesota Housing Finance Agency has reported, pursuant to paragraph (b), to have failed to use funds, misused funds, or failed to report on its use of funds. A request to stop payment under this paragraph must be submitted to the commissioner in the form and manner prescribed by the commissioner on or before May 1 of the aids payable year the aid recipient wants the commissioner to stop payment of aid. The commissioner shall not stop payment based on a request received after May 1 until the next aids payable year.\n(e) The commissioner may resume distributing funds to a tier I city or county to which the commissioner has stopped payments in the year following the August 1 after the Minnesota Housing Finance Agency certifies that the city or county has submitted documentation of plans for a qualifying project. The commissioner may resume distributing funds to a tier I city or county to which the commissioner has stopped payments at the request of the city or county in the year following the August 1 after the Minnesota Housing Finance Agency certifies that the city or county has submitted documentation of plans for a qualifying project.\n(f) By June 1, any funds paid to the Minnesota Housing Finance Agency under paragraph (c) must be deposited in the housing development fund. Funds deposited under this paragraph are appropriated to the commissioner of the Minnesota Housing Finance Agency for use on the family homeless prevention and assistance program under section 462A.204, the economic development and housing challenge program under section 462A.33, and the workforce and affordable homeownership development program under section 462A.38.\n[See Note.]\nA county that receives funding under this section shall regularly consult with the local governments in the jurisdictions of which its qualifying projects are planned or located.",
	"repealed": false
}