{
	"id": "336.9-619",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-619",
	"title": "336.9-619 TRANSFER OF RECORD OR LEGAL TITLE.",
	"text": "(a) Transfer statement. (1) In this section, \"transfer statement\" means a record signed by a secured party stating:\n(A) that the debtor has defaulted in connection with an obligation secured by specified collateral;\n(B) that the secured party has exercised its postdefault remedies with respect to the collateral;\n(C) that, by reason of the exercise, a transferee has acquired the rights of the debtor in the collateral;\n(D) the name and mailing address of the secured party, debtor, and transferee; and\n(E) in addition, if the statement is to be filed in the real property records concerning a mortgage or other record evidencing an interest in real property, the statement must state the following information concerning the mortgage or other record evidencing an interest in real property:\n(i) the name and title on the record;\n(ii) the date on the record;\n(iii) the names of the parties on the record;\n(iv) the identity of the office of the county recorder or registrar of titles where the record is filed;\n(v) the date the record was filed;\n(vi) the identifying number of the record in the office of the county recorder or registrar of titles; and\n(vii) in the case of an executory contract for the sale of real property or of an interest in real property that entitles the purchaser to possession of the real property, the legal description of the real property subject to the contract.\n(2) A transfer statement that is to be filed in the real property records must contain an acknowledgment by the secured party in a form sufficient to satisfy the requirements of chapter 358.\n(3) If an executory contract for the sale of real property or of an interest in real property that entitles the purchaser to possession of the real property is terminated, the secured party may not file a transfer statement concerning that contract after the termination. If a transfer statement is filed by the secured party after the debtor has terminated that contract, the transfer statement is not effective as a conveyance.\n(b) Effect of transfer statement. A transfer statement entitles the transferee to the transfer of record of all rights of the debtor in the collateral specified in the statement in any official filing, recording, registration, or certificate of title system covering the collateral. If a transfer statement is presented with the applicable fee and request form to the official or office responsible for maintaining the system, the official or office shall:\n(1) accept the transfer statement;\n(2) promptly amend its records to reflect the transfer; and\n(3) if applicable,\n(A) issue a new appropriate certificate of title in the name of transferee in the case of property not subject to chapter 508 or 508A; or\n(B) in the case of property subject to chapter 508 or 508A, issue a new certificate of title upon satisfaction of the requirements of those chapters.\n(c) Transfer not a disposition; no relief of secured party's duties. A transfer of the record or legal title to collateral to a secured party under subsection (b) or otherwise is not of itself a disposition of collateral under this article and does not of itself relieve the secured party of its duties under this article.\n(d) Transfer of certificates of title. A secured party who complies with section 86B.840, subdivision 2, paragraph (b), or 168A.12, subdivision 2, is considered to have provided a transfer statement for purposes of this section.",
	"repealed": false
}