{
	"id": "357.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/357.021",
	"title": "357.021 COURT ADMINISTRATOR OF DISTRICT COURT; FEES.",
	"text": "[Expired]\n(a) Every person, including the state of Minnesota and all bodies politic and corporate, who shall transact any business in the district court, shall pay to the court administrator of said court the sundry fees prescribed in subdivision 2. Except as provided in paragraph (d), the court administrator shall transmit the fees monthly to the commissioner of management and budget for deposit in the state treasury and credit to the general fund. $30 of each fee collected in a dissolution action under subdivision 2, clause (1), must be deposited by the commissioner of management and budget in the special revenue fund and is appropriated to the commissioner of employment and economic development for the Minnesota Family Resiliency Partnership under section 116L.96.\n(b) In a county which has a screener-collector position, fees paid by a county pursuant to this subdivision shall be transmitted monthly to the county treasurer, who shall apply the fees first to reimburse the county for the amount of the salary paid for the screener-collector position. The balance of the fees collected shall then be forwarded to the commissioner of management and budget for deposit in the state treasury and credited to the general fund. In a county in a judicial district under section 480.181, subdivision 1, paragraph (b), which has a screener-collector position, the fees paid by a county shall be transmitted monthly to the commissioner of management and budget for deposit in the state treasury and credited to the general fund. A screener-collector position for purposes of this paragraph is an employee whose function is to increase the collection of fines and to review the incomes of potential clients of the public defender, in order to verify eligibility for that service.\n(c) No fee is required under this section from the public authority or the party the public authority represents in an action for:\n(1) child support enforcement or modification, medical assistance enforcement, or establishment of parentage in the district court, or in a proceeding under section 484.702;\n(2) civil commitment under chapter 253B;\n(3) the appointment of a public conservator or public guardian or any other action under chapters 252A and 525;\n(4) wrongfully obtaining public assistance under section 256.98 or 256D.07, or recovery of overpayments of public assistance;\n(5) court relief under chapters 260, 260A, 260B, and 260C;\n(6) forfeiture of property under sections 169A.63 and 609.531 to 609.5317;\n(7) recovery of amounts issued by political subdivisions or public institutions under sections 246.52, 252.27, 256.045, 256.25, 256B.042, 256B.14, 256B.15, 256B.37, 260B.331, 260C.331, and 518A.82, or other sections referring to other forms of public assistance;\n(8) restitution under section 611A.04; or\n(9) actions seeking monetary relief in favor of the state pursuant to section 16D.14, subdivision 5.\n(d) $20 from each fee collected for child support modifications under subdivision 2, clause (13), must be transmitted to the county treasurer for deposit in the county general fund and $35 from each fee shall be credited to the state general fund. The fees must be used by the county to pay for child support enforcement efforts by county attorneys.\n(e) No fee is required under this section from any federally recognized Indian Tribe or its representative in an action for:\n(1) child support enforcement or modification, medical assistance enforcement, or establishment of parentage in the district court or in a proceeding under section 484.702;\n(2) civil commitment under chapter 253B;\n(3) the appointment of a public conservator or public guardian or any other action under chapters 252A and 525; or\n(4) court relief under chapters 260, 260A, 260B, 260C, and 260D.\nThe fees to be charged and collected by the court administrator shall be as follows:\n(1) In every civil action or proceeding in said court, including any case arising under the tax laws of the state that could be transferred or appealed to the Tax Court, the plaintiff, petitioner, or other moving party shall pay, when the first paper is filed for that party in said action, a fee of $285, except in marriage dissolution actions the fee is $315.\nThe defendant or other adverse or intervening party, or any one or more of several defendants or other adverse or intervening parties appearing separately from the others, shall pay, when the first paper is filed for that party in said action, a fee of $285, except in marriage dissolution actions the fee is $315. This subdivision does not apply to the filing of an Application for Discharge of Judgment. Section 548.181 applies to an Application for Discharge of Judgment.\nThe party requesting a trial by jury shall pay $100.\nThe fees above stated shall be the full trial fee chargeable to said parties irrespective of whether trial be to the court alone, to the court and jury, or disposed of without trial, and shall include the entry of judgment in the action, but does not include copies or certified copies of any papers so filed or proceedings under chapter 103E, except the provisions therein as to appeals.\n(2) Certified copy of any instrument from a civil or criminal proceeding, $14.\n(3) Issuing a subpoena, $16 for each name.\n(4) Filing a motion or response to a motion in civil, family, excluding child support, and guardianship cases, $75.\n(5) Issuing an execution and filing the return thereof; issuing a writ of attachment, injunction, habeas corpus, mandamus, quo warranto, certiorari, or other writs not specifically mentioned, $55.\n(6) Issuing a transcript of judgment, or for filing and docketing a transcript of judgment from another court, $40.\n(7) Filing and entering a satisfaction of judgment, partial satisfaction, or assignment of judgment, $5.\n(8) Certificate as to existence or nonexistence of judgments docketed, $5 for each name certified to.\n(9) Filing and indexing trade name; or recording basic science certificate; or recording certificate of physicians, osteopathic physicians, chiropractors, veterinarians, or optometrists, $5.\n(10) For the filing of each partial, final, or annual account in all trusteeships, $55.\n(11) For the deposit of a will, $27.\n(12) For recording notary commission, $20.\n(13) Filing a motion or response to a motion for modification of child support, a fee of $50.\n(14) All other services required by law for which no fee is provided, such fee as compares favorably with those herein provided, or such as may be fixed by rule or order of the court.\n(15) In addition to any other filing fees under this chapter, a surcharge in the amount of $75 must be assessed in accordance with section 259.52, subdivision 14, for each adoption petition filed in district court to fund the fathers' adoption registry under section 259.52.\nThe fees in clauses (3) and (5) need not be paid by a public authority or the party the public authority represents. No fee may be charged to view or download a publicly available instrument from a civil or criminal proceeding or for an uncertified copy of that instrument.\n[Repealed, 1999 c 216 art 7 s 45]\nMS 2016 [Expired, 2013 c 86 art 3 s 6]\nAll fees of said court administrators, except in criminal proceedings, shall be paid in advance at or prior to the time of the performance of any service requiring payment of such fees, and said court administrator shall not proceed in any matter requiring the payment of fees until the full amount of the same is paid.\nNothing in this section shall be construed as amending, modifying, redistributing, or repealing the provisions as to library fees contained in chapter 134A.\nNotwithstanding any other provision of the law to the contrary, no fee otherwise required to be paid to the court administrator of district court by a defendant or defendants when filing the first paper for that party in an action, shall be paid by the state of Minnesota, or any department or agency thereof, or when the state or a department or agency as plaintiff enters judgment pursuant to a confession of judgment executed by the defendant.\n(a) Except as provided in this subdivision, the court shall impose and the court administrator shall collect a $75 surcharge on every person convicted of any felony, gross misdemeanor, misdemeanor, or petty misdemeanor offense, other than a violation of: (1) a law or ordinance relating to vehicle parking, for which there is a $12 surcharge; and (2) section 609.855, subdivision 1, 3, or 3a, for which there is a $25 surcharge. When a defendant is convicted of more than one offense in a case, the surcharge shall be imposed only once in that case. In the Second Judicial District, the court shall impose, and the court administrator shall collect, an additional $1 surcharge on every person convicted of any felony, gross misdemeanor, misdemeanor, or petty misdemeanor offense, including a violation of a law or ordinance relating to vehicle parking, if the Ramsey County Board of Commissioners authorizes the $1 surcharge. The surcharge shall be imposed whether or not the person is sentenced to imprisonment or the sentence is stayed. The surcharge shall not be imposed when a person is convicted of a petty misdemeanor for which no fine is imposed.\n(b) The court may reduce the amount or waive payment of the surcharge required under this subdivision on a showing of indigency or undue hardship upon the convicted person or the convicted person's immediate family. Additionally, the court may permit the defendant to perform community work service in lieu of a surcharge.\n(c) The court administrator or other entity collecting a surcharge shall forward it to the commissioner of management and budget.\n(d) If the convicted person is sentenced to imprisonment and has not paid the surcharge before the term of imprisonment begins, the chief executive officer of the correctional facility in which the convicted person is incarcerated shall collect the surcharge from any earnings the inmate accrues from work performed in the facility or while on conditional release. The chief executive officer shall forward the amount collected to the court administrator or other entity collecting the surcharge imposed by the court.\n(e) A person who enters a diversion program, continuance without prosecution, continuance for dismissal, or stay of adjudication for a violation of chapter 169 must pay the surcharge described in this subdivision. A surcharge imposed under this paragraph shall be imposed only once per case.\n(f) The surcharge does not apply to:\n(1) citations issued pursuant to section 169.06, subdivision 10;\n(2) citations issued pursuant to section 169.14, subdivision 13;\n(3) administrative citations issued pursuant to section 169.999; or\n(4) administrative citations issued by transit rider investment program personnel pursuant to section 473.4075.\n[See Note.]\n(a) Except as provided in paragraphs (b) to (d), the commissioner of management and budget shall disburse surcharges received under subdivision 6 as follows:\n(1) one percent shall be credited to the peace officer training account in the game and fish fund to provide peace officer training for employees of the Department of Natural Resources who are licensed under sections 626.84 to 626.863, and who possess peace officer authority for the purpose of enforcing game and fish laws; and\n(2) 99 percent shall be credited to the general fund.\n(b) The commissioner of management and budget shall credit $3 of each surcharge received under subdivision 6 to the general fund.\n(c) In addition to any amounts credited under paragraph (a), the commissioner of management and budget shall credit the following to the general fund: $47 of each surcharge received under subdivision 6; the $12 parking surcharge; and the $25 surcharge for a violation of section 609.855, subdivision 1, 3, or 3a.\n(d) If the Ramsey County Board of Commissioners authorizes imposition of the additional $1 surcharge provided for in subdivision 6, paragraph (a), the court administrator in the Second Judicial District shall transmit the surcharge to the commissioner of management and budget. The $1 special surcharge is deposited in a Ramsey County surcharge account in the special revenue fund and amounts in the account are appropriated to the trial courts for the administration of the petty misdemeanor diversion program operated by the Second Judicial District Ramsey County Violations Bureau.",
	"repealed": false
}