{
	"id": "144A.751",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.751",
	"title": "144A.751 HOSPICE BILL OF RIGHTS.",
	"text": "An individual who receives hospice care has the right to:\n(1) receive written information about rights in advance of receiving hospice care or during the initial evaluation visit before the initiation of hospice care, including what to do if rights are violated;\n(2) receive care and services according to a suitable hospice plan of care and subject to accepted hospice care standards and to take an active part in creating and changing the plan and evaluating care and services;\n(3) be told in advance of receiving care about the services that will be provided, the disciplines that will furnish care, the frequency of visits proposed to be furnished, other choices that are available, and the consequence of these choices, including the consequences of refusing these services;\n(4) be told in advance, whenever possible, of any change in the hospice plan of care and to take an active part in any change;\n(5) refuse services or treatment;\n(6) know, in advance, any limits to the services available from a provider, and the provider's grounds for a termination of services;\n(7) know in advance of receiving care whether the hospice services may be covered by health insurance, medical assistance, Medicare, or other health programs in which the individual is enrolled;\n(8) receive, upon request, a good faith estimate of the reimbursement the provider expects to receive from the health plan company in which the individual is enrolled. A good faith estimate must also be made available at the request of an individual who is not enrolled in a health plan company. This payment information does not constitute a legally binding estimate of the cost of services;\n(9) know that there may be other services available in the community, including other end of life services and other hospice providers, and know where to go for information about these services;\n(10) choose freely among available providers and change providers after services have begun, within the limits of health insurance, medical assistance, Medicare, or other health programs;\n(11) have personal, financial, and medical information kept private and be advised of the provider's policies and procedures regarding disclosure of such information;\n(12) be allowed access to records and written information from records according to sections 144.291 to 144.298;\n(13) be served by people who are properly trained and competent to perform their duties;\n(14) be treated with courtesy and respect and to have the patient's property treated with respect;\n(15) voice grievances regarding treatment or care that is, or fails to be, furnished or regarding the lack of courtesy or respect to the patient or the patient's property;\n(16) be free from physical and verbal abuse;\n(17) reasonable, advance notice of changes in services or charges, including at least ten days' advance notice of the termination of a service by a provider, except in cases where:\n(i) the recipient of services engages in conduct that alters the conditions of employment between the hospice provider and the individual providing hospice services, or creates an abusive or unsafe work environment for the individual providing hospice services;\n(ii) an emergency for the informal caregiver or a significant change in the recipient's condition has resulted in service needs that exceed the current service provider agreement and that cannot be safely met by the hospice provider; or\n(iii) the recipient is no longer certified as terminally ill;\n(18) a coordinated transfer when there will be a change in the provider of services;\n(19) know how to contact an individual associated with the provider who is responsible for handling problems and to have the provider investigate and attempt to resolve the grievance or complaint;\n(20) know the name and address of the state or county agency to contact for additional information or assistance;\n(21) assert these rights personally, or have them asserted by the hospice patient's family when the patient has been judged incompetent, without retaliation; and\n(22) have pain and symptoms managed to the patient's desired level of comfort.\nThe rights under this section are established for the benefit of individuals who receive hospice care. A hospice provider may not require a person to surrender these rights as a condition of receiving hospice care. A guardian or conservator or, when there is no guardian or conservator, a designated person, may seek to enforce these rights. This statement of rights does not replace or diminish other rights and liberties that may exist relative to persons receiving hospice care, persons providing hospice care, or hospice providers licensed under section 144A.753.\nA copy of these rights must be provided to an individual at the time hospice care is initiated. The copy shall contain the address and telephone number of the Office of Health Facility Complaints and the Office of Ombudsman for Long-Term Care and a brief statement describing how to file a complaint with these offices. Information about how to contact the Office of Ombudsman for Long-Term Care shall be included in notices of change in provider fees and in notices where hospice providers initiate transfer or discontinuation of services.",
	"repealed": false
}