{
	"id": "4A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/4A.02",
	"title": "4A.02 STATE DEMOGRAPHER.",
	"text": "(a) The commissioner shall appoint a state demographer. The demographer must be professionally competent in demography and must possess demonstrated ability based upon past performance.\n(b) The demographer shall:\n(1) continuously gather and develop demographic data relevant to the state;\n(2) design and test methods of research and data collection;\n(3) periodically prepare population projections for the state and designated regions and periodically prepare projections for each county or other political subdivision of the state as necessary to carry out the purposes of this section;\n(4) review, comment on, and prepare analysis of population estimates and projections made by state agencies, political subdivisions, other states, federal agencies, or nongovernmental persons, institutions, or commissions;\n(5) serve as the state liaison with the United States Bureau of the Census, coordinate state and federal demographic activities to the fullest extent possible, and aid the legislature in preparing a census data plan and form for each decennial census;\n(6) compile an annual study of population estimates on the basis of county, regional, or other political or geographical subdivisions as necessary to carry out the purposes of this section and section 4A.03;\n(7) by January 1 of each year, issue a report to the legislature containing an analysis of the demographic implications of the annual population study and population projections;\n(8) prepare maps for all counties in the state, all municipalities with a population of 10,000 or more, and other municipalities as needed for census purposes, according to scale and detail recommended by the United States Bureau of the Census, with the maps of cities showing precinct boundaries;\n(9) prepare an estimate of population and of the number of households for each governmental subdivision for which the Metropolitan Council does not prepare an annual estimate, and convey the estimates to the governing body of each political subdivision by June 1 of each year;\n(10) direct, under section 414.01, subdivision 14, and certify population and household estimates of annexed or detached areas of municipalities or towns after being notified of the order or letter of approval by the chief administrative law judge of the State Office of Administrative Hearings;\n(11) prepare, for any purpose for which a population estimate is required by law or needed to implement a law, a population estimate of a municipality or town whose population is affected by action under section 379.02 or 414.01, subdivision 14; and\n(12) prepare an estimate of average household size for each statutory or home rule charter city with a population of 2,500 or more by June 1 of each year.\n(c) A governing body may challenge an estimate made under paragraph (b) by filing their specific objections in writing with the state demographer by June 24. If the challenge does not result in an acceptable estimate, the governing body may have a special census conducted by the United States Bureau of the Census. The political subdivision must notify the state demographer by July 1 of its intent to have the special census conducted. The political subdivision must bear all costs of the special census. Results of the special census must be received by the state demographer by the next April 15 to be used in that year's June 1 estimate to the political subdivision under paragraph (b).\n(d) The state demographer shall certify the estimates of population and household size to the commissioner of revenue by July 15 each year, including any estimates still under objection.\n(e) The state demographer may contract for the development of data and research required under this chapter, including, but not limited to, population estimates and projections, the preparation of maps, and other estimates.",
	"repealed": false
}