{
	"id": "62V.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/62V.055",
	"title": "62V.055 MINNESOTA ELIGIBILITY SYSTEM EXECUTIVE STEERING COMMITTEE.",
	"text": "For purposes of this section, \"Minnesota eligibility system\" means the system that supports eligibility determinations using a modified adjusted gross income methodology for medical assistance under section 256B.056, subdivision 1a, paragraph (b), clause (1); MinnesotaCare under chapter 256L; and qualified health plan enrollment under section 62V.05, subdivision 5, paragraph (c).\n(a) The Minnesota Eligibility System Executive Steering Committee is established to provide recommendations to the MNsure board, the commissioner of human services, and the commissioner of information technology services on the governance, administration, and business operations of the Minnesota eligibility system. The steering committee shall be composed of:\n(1) two members appointed by the commissioner of human services;\n(2) two members appointed by the board;\n(3) two members appointed jointly by the Association of Minnesota Counties, the Minnesota Inter-County Association, and the Minnesota Association of County Social Service Administrators. One member appointed under this clause shall represent counties within the seven-county metropolitan area, and one member shall represent counties outside the seven-county metropolitan area; and\n(4) two nonvoting members appointed by the commissioner of information technology services.\n(b) One member appointed by the commissioner of human services and one member appointed by the commissioner of information technology services shall serve as co-chairpersons for the steering committee.\n(c) Steering committee costs must be paid from the budgets of the Department of Human Services, the Department of Information Technology Services, and MNsure.\nThe Minnesota Eligibility System Executive Steering Committee shall provide recommendations on an overall governance structure for the Minnesota eligibility system and the ongoing administration and business operations of the Minnesota eligibility system. The steering committee shall make recommendations on setting system goals and priorities, allocating the system's resources, making major system decisions, and tracking total funding and expenditures for the system from all sources. The steering committee shall also report to the Legislative Oversight Committee on a quarterly basis on Minnesota eligibility system funding and expenditures, including amounts received in the most recent quarter by funding source and expenditures made in the most recent quarter by funding source.\n(a) All meetings of the steering committee must:\n(1) be held in the State Office Building, the Minnesota Senate Building, or when approved by the Legislative Oversight Committee, another public location with the capacity to live stream steering committee meetings; and\n(2) whenever possible, be made available on a website for live audio or video streaming and be archived on a website for playback at a later time.\n(b) The steering committee must:\n(1) as part of every steering committee meeting, provide the opportunity for oral and written public testimony and comments on steering committee recommendations for the governance, administration, and business operations of the Minnesota eligibility system; and\n(2) provide documents under discussion or review by the steering committee to be electronically posted on MNsure's website. Documents must be provided and posted prior to the meeting at which the documents are scheduled for review or discussion.\n(c) All votes of the steering committee must be recorded, with each member's vote identified.\nThe Department of Information Technology Services shall be responsible for the design, build, maintenance, operation, and upgrade of the information technology for the Minnesota eligibility system. In carrying out its duties, the office shall consider recommendations made by the steering committee.",
	"repealed": false
}