{
	"id": "144G.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.80",
	"title": "144G.80 ADDITIONAL LICENSING REQUIREMENTS FOR ASSISTED LIVING FACILITIES WITH DEMENTIA CARE.",
	"text": "This section applies only to assisted living facilities with dementia care.\n(a) An applicant for licensure as an assisted living facility with dementia care must have the ability to provide services in a manner that is consistent with the requirements in this section. The commissioner shall consider the following criteria, including, but not limited to:\n(1) the experience of the applicant's assisted living director, managerial official, and clinical nurse supervisor managing residents with dementia or previous long-term care experience; and\n(2) the compliance history of the applicant in the operation of any care facility licensed, certified, or registered under federal or state law.\n(b) If the applicant's assisted living director and clinical nurse supervisor do not have experience in managing residents with dementia, the applicant must employ a consultant for at least the first six months of operation. The consultant must meet the requirements in paragraph (a), clause (1), and make recommendations on providing dementia care services consistent with the requirements of this chapter. The consultant must (1) have two years of work experience related to dementia, health care, gerontology, or a related field, and (2) have completed at least the minimum core training requirements in section 144G.64. The applicant must document an acceptable plan to address the consultant's identified concerns and must either implement the recommendations or document in the plan any consultant recommendations that the applicant chooses not to implement. The commissioner must review the applicant's plan upon request.\n(c) The commissioner shall conduct an on-site inspection prior to the issuance of an assisted living facility with dementia care license to ensure compliance with the physical environment requirements.\n(d) The label \"Assisted Living Facility with Dementia Care\" must be identified on the license.\n(a) The licensee must notify the commissioner and the Office of Ombudsman for Long-Term Care in writing at least 60 calendar days prior to the voluntary relinquishment of an assisted living facility with dementia care license. For voluntary relinquishment, the facility must at least:\n(1) give all residents and their designated and legal representatives 60 calendar days' notice. The notice must include at a minimum:\n(i) the proposed effective date of the relinquishment;\n(ii) changes in staffing;\n(iii) changes in services including the elimination or addition of services;\n(iv) staff training that shall occur when the relinquishment becomes effective; and\n(v) contact information for the Office of Ombudsman for Long-Term Care;\n(2) submit a transitional plan to the commissioner demonstrating how the current residents shall be evaluated and assessed to reside in other housing settings that are not an assisted living facility with dementia care, that are physically unsecured, or that would require move-out or transfer to other settings;\n(3) change service or care plans as appropriate to address any needs the residents may have with the transition;\n(4) notify the commissioner when the relinquishment process has been completed; and\n(5) revise advertising materials and disclosure information to remove any reference that the facility is an assisted living facility with dementia care.\n(b) Nothing in this section alters obligations under section 144G.57.",
	"repealed": false
}