{
	"id": "62E.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.23",
	"title": "62E.23 MINNESOTA PREMIUM SECURITY PLAN.",
	"text": "(a) The association is Minnesota's reinsurance entity to administer the state-based reinsurance program referred to as the Minnesota premium security plan.\n(b) The association may apply for any available federal funding for the plan. All funds received by or appropriated to the association shall be deposited in the premium security plan account in section 62E.25, subdivision 1. The association shall notify the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services and insurance within ten days of receiving any federal funds.\n(c) The association must collect or access data from an eligible health carrier that are necessary to determine reinsurance payments, according to the data requirements under subdivision 5, paragraph (c).\n(d) The board must not use any funds allocated to the plan for staff retreats, promotional giveaways, excessive executive compensation, or promotion of federal or state legislative or regulatory changes.\n(e) For each applicable benefit year, the association must notify eligible health carriers of reinsurance payments to be made for the applicable benefit year no later than June 30 of the year following the applicable benefit year.\n(f) On a quarterly basis during the applicable benefit year, the association must provide each eligible health carrier with the calculation of total reinsurance payment requests.\n(g) By August 15 of the year following the applicable benefit year, the association must disburse all applicable reinsurance payments to an eligible health carrier.\n(a) The board must design and adjust the payment parameters to ensure the payment parameters:\n(1) will stabilize or reduce premium rates in the individual market;\n(2) will increase participation in the individual market;\n(3) will improve access to health care providers and services for those in the individual market;\n(4) mitigate the impact high-risk individuals have on premium rates in the individual market;\n(5) take into account any federal funding available for the plan; and\n(6) take into account the total amount available to fund the plan.\n(b) The attachment point for the plan is the threshold amount for claims costs incurred by an eligible health carrier for an enrolled individual's covered benefits in a benefit year, beyond which the claims costs for benefits are eligible for reinsurance payments. The attachment point shall be set by the board at $50,000 or more, but not exceeding the reinsurance cap.\n(c) The coinsurance rate for the plan is the rate at which the association will reimburse an eligible health carrier for claims incurred for an enrolled individual's covered benefits in a benefit year above the attachment point and below the reinsurance cap. The coinsurance rate shall be set by the board at a rate between 50 and 80 percent.\n(d) The reinsurance cap is the threshold amount for claims costs incurred by an eligible health carrier for an enrolled individual's covered benefits, after which the claims costs for benefits are no longer eligible for reinsurance payments. The reinsurance cap shall be set by the board at $250,000 or less.\n(e) The board may adjust the payment parameters to the extent necessary to secure federal approval of the state innovation waiver request in Laws 2017, chapter 13, article 1, section 8.\n(a) The board shall propose to the commissioner the payment parameters for the next benefit year by January 15 of the year before the applicable benefit year. The commissioner shall approve or reject the payment parameters no later than 14 days following the board's proposal. If the commissioner fails to approve or reject the payment parameters within 14 days following the board's proposal, the proposed payment parameters are final and effective.\n(b) If the amount in the premium security plan account in section 62E.25, subdivision 1, is not anticipated to be adequate to fully fund the approved payment parameters as of July 1 of the year before the applicable benefit year, the board, in consultation with the commissioner and the commissioner of management and budget, shall propose payment parameters within the available appropriations. The commissioner must permit an eligible health carrier to revise an applicable rate filing based on the final payment parameters for the next benefit year.\n(c) Notwithstanding paragraph (a), the payment parameters for benefit years 2023 through 2027 are:\n(1) an attachment point of $50,000;\n(2) a coinsurance rate of 80 percent; and\n(3) a reinsurance cap of $250,000.\n(a) Each reinsurance payment must be calculated with respect to an eligible health carrier's incurred claims costs for an individual enrollee's covered benefits in the applicable benefit year. If the claims costs do not exceed the attachment point, the reinsurance payment is $0. If the claims costs exceed the attachment point, the reinsurance payment shall be calculated as the product of the coinsurance rate and the lesser of:\n(1) the claims costs minus the attachment point; or\n(2) the reinsurance cap minus the attachment point.\n(b) The board must ensure that reinsurance payments made to eligible health carriers do not exceed the total amount paid by the eligible health carrier for any eligible claim. \"Total amount paid of an eligible claim\" means the amount paid by the eligible health carrier based upon the allowed amount less any deductible, coinsurance, or co-payment, as of the time the data are submitted or made accessible under subdivision 5, paragraph (c).\n(a) An eligible health carrier may request reinsurance payments from the association when the eligible health carrier meets the requirements of this subdivision and subdivision 4.\n(b) An eligible health carrier must make requests for reinsurance payments in accordance with any requirements established by the board.\n(c) An eligible health carrier must provide the association with access to the data within the dedicated data environment established by the eligible health carrier under the federal risk adjustment program under United States Code, title 42, section 18063. Eligible health carriers must submit an attestation to the board asserting compliance with the dedicated data environments, data requirements, establishment and usage of masked enrollee identification numbers, and data submission deadlines.\n(d) An eligible health carrier must provide the access described in paragraph (c) for the applicable benefit year by April 30 of each year of the year following the end of the applicable benefit year.\n(e) An eligible health carrier must maintain documents and records, whether paper, electronic, or in other media, sufficient to substantiate the requests for reinsurance payments made pursuant to this section for a period of at least six years. An eligible health carrier must also make those documents and records available upon request from the commissioner for purposes of verification, investigation, audit, or other review of reinsurance payment requests.\n(f) An eligible health carrier may follow the appeals procedure under section 62E.10, subdivision 2a.\n(g) The association may have an eligible health carrier audited to assess the health carrier's compliance with the requirements of this section. The eligible health carrier must ensure that its contractors, subcontractors, or agents cooperate with any audit under this section. If an audit results in a proposed finding of material weakness or significant deficiency with respect to compliance with any requirement of this section, the eligible health carrier may provide a response to the proposed finding within 30 days. Within 30 days of the issuance of a final audit report that includes a finding of material weakness or significant deficiency, the eligible health carrier must:\n(1) provide a written corrective action plan to the association for approval;\n(2) implement the approved plan; and\n(3) provide the association with written documentation of the corrective action once taken.\nGovernment data of the association under this section are private data on individuals, or nonpublic data, as defined under section 13.02, subdivision 9 or 12.",
	"repealed": false
}