{
	"id": "473.599",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.599",
	"title": "473.599 DEBT OBLIGATIONS.",
	"text": "It is the intent of the legislature that the commission shall, to the maximum extent possible consistent with the provisions of this section, impose rates, rentals, and other charges in the operation of the basketball and hockey arena which together with the admissions tax and surcharge provided in section 473.595, subdivision 1a, will make the basketball and hockey arena self-supporting so that the taxes imposed under section 473.592 for the basketball and hockey arena will be at the lowest possible rate consistent with the obligations of the city of Minneapolis as provided in sections 473.551 to 473.599.\nThe council shall by resolution authorize the sale and issuance of its bonds for any of the following purposes upon its determination that the conditions of subdivision 4 have been met:\n(a) To provide funds for the acquisition or betterment of the basketball and hockey arena by the commission pursuant to sections 473.598 and 473.599;\n(b) To refund bonds issued under this section; and\n(c) To fund judgments entered by any court against the commission or against the council in matters relating to the basketball and hockey arena.\nThe bonds shall be sold, issued, and secured in the manner provided in chapter 475 for bonds payable solely from revenues, except as otherwise provided in sections 473.551 to 473.599, and the council shall have the same powers and duties as a municipality and its governing body in issuing bonds under chapter 475. The council may pledge for the payment of the bonds the net revenues of the commission arising from the commission's operation of the basketball and hockey arena, the tax provided by section 473.592 for the basketball and hockey arena, and the admission tax and surcharge authorized in section 473.595, subdivision 1a. The bonds may be sold at any price and at public or private sale as determined by the council. They shall be payable solely from tax and other revenues referred to in sections 473.551 to 473.599, and shall not be a general obligation or debt of the council or of the commission, and shall not be included in the net debt of any city, county, or other subdivision of the state for the purpose of any net debt limitation, but nothing in this section shall affect the obligation of the city of Minneapolis to levy a tax pursuant to an agreement made under the provisions of section 473.592. No election shall be required. The principal amount shall not be limited except as provided in subdivision 4.\nThe principal amount of the bonds issued pursuant to subdivision 2, clause (a), exclusive of any original issue discount, shall not exceed the total amount of $42,000,000 plus such amount as the council determines necessary to pay the costs of issuance, fund reserves for operation and debt service, and pay for any bond insurance or other credit enhancement. The bonds may be issued as tax-exempt revenue bonds or as taxable revenue bonds in the proportions that the commission may determine. The proceeds of the bonds issued pursuant to subdivision 2, clause (a), shall be used only for acquisition and betterment of sports facilities suitable for a basketball and hockey arena and the arena land and the related purposes referred to in this subdivision, and for reimbursement of any expenses of the commission related to its determination of whether to acquire the basketball and hockey arena, whenever incurred. The council shall issue its bonds pursuant to subdivision 2, clause (a), and the commission may acquire the basketball and hockey arena and the arena land when the council has made the following determinations:\n(a) The commission, the city of Minneapolis or the Minneapolis Community Development Agency, or any or all of them, as the commission may deem appropriate, has executed agreements with a major league professional basketball organization to use the arena for all scheduled regular season home games and play-off home games, and for at least one of its exhibition games played each season. The agreements shall be for a period of 30 years. The agreements may contain provisions negotiated with the organization which provide for earlier termination of the use of the basketball and hockey arena by the commission upon conditions related to and limited to the bankruptcy or insolvency of the organization. The agreements shall afford to the commission, the city of Minneapolis, or the Minneapolis Community Development Agency, or each or all of them, as the commission deems appropriate, the remedies that are deemed necessary and appropriate to provide reasonable assurances that the major league professional basketball organization or another major league professional basketball organization shall comply with the agreements. The remedies shall include the payment of liquidated damages equivalent to direct and consequential damages incurred by reason of the breach of the agreements and any additional remedies or security arrangements the commission reasonably determines to be effective in accomplishing the purposes of this paragraph. The damages payment may be payable in a lump sum or in installments as the commission may deem appropriate. The commission may require that the agreements include other terms and conditions to provide reasonable assurances that the major league professional basketball team or a successor major league professional basketball team will play the required games at the basketball and hockey arena during the 30-year term of the agreements, or, in the event of a breach, to assure the payment of the required damages. The agreements shall address contingencies that may arise in the event of change of ownership of the professional teams. The agreements with the professional basketball organization for the use of the basketball and hockey arena shall provide for arrangements which the commission may deem necessary or appropriate to accommodate a future agreement between the commission and a professional hockey organization to occupy the basketball and hockey arena, consistent with this section.\n(b) The commission has exercised its reasonable efforts to obtain assurances and/or agreements from the professional basketball major league to the extent permitted under applicable federal and state law, that it will not approve the relocation of the major league professional basketball organization if the relocation is in violation of the terms of the agreements referred to in paragraph (a).\n(c) The professional basketball team has provided information sufficient to satisfy the council and the commission of the team's ability to comply with the terms of the 30-year lease.\n(d) The proceeds of bonds provided for in this subdivision will be sufficient for the purposes for which they are issued.\n(e) The commission has acquired, or has contracted to acquire, (i) leasehold title to the arena land together with the estate of the tenant and other rights demised under the ground lease, subject to amendment as provided in clause (o), (ii) ownership of all real and personal property comprising the basketball and hockey arena, and (iii) all easements, appurtenances and other rights, title, or interest deemed by the commission necessary or desirable in connection with the acquisition, financing, ownership, and operation of the basketball and hockey arena.\n(f) The percentage of the private boxes provided for in the commission's proposal for the basketball and hockey arena are sold or leased for the period that the commission finds advisable.\n(g) The anticipated admission taxes and surcharges and other revenue from the operation of the basketball and hockey arena will be sufficient to pay when due all basketball and hockey arena debt service plus all administration, operating and maintenance expense of the arena.\n(h) The city of Minneapolis has entered into an agreement as contemplated in clause (n) and an agreement or agreements as contemplated in section 473.592 with respect to the basketball and hockey arena.\n(i) The council has entered into an agreement with the brokerage firm or brokerage firms to be used in connection with the issuance and sale of the bonds guaranteeing that fees and charges payable to the brokerage firm or firms in connection therewith, including any underwriting discounts, shall not exceed fees and charges customarily payable in connection with the issuance and sale of bonds secured by the pledge of the full faith and credit of the city of Minneapolis.\nThe validity of any bonds issued under subdivision 2, clause (a), and the obligations of the council and commission related to them, shall not be conditioned upon or impaired by the council's determination made pursuant to this subdivision. For purposes of issuing the bonds the determinations made by the commission and council shall be deemed conclusive, and the council shall be and remain obligated for the security and payment of the bonds irrespective of determinations which may be erroneous, inaccurate, or otherwise mistaken.\n(j) The commission has entered into arrangements with any other persons to create a condominium or leasehold condominium, or common interest community or leasehold common interest community, with respect to the building containing the basketball and hockey arena, including the arena playing and spectator areas, and all other portions of the building, and together with the arena land and all other related improvements, easements and other appurtenant and ancillary property and property rights. The Minneapolis Community Development Agency in its capacity as ground lease landlord may be a party to the condominium or common interest community declaration. The condominium or common interest community declaration shall establish the portion of the building containing the health club as a separate unit of the condominium or common interest community, and the commission shall have entered into an agreement or agreements with a private sports and health club organization which shall require that the organization shall purchase or retain ownership of the unit with its own funds and at no cost or expense to the commission, and that the organization shall pay for all utility and other operating costs and expenses including allocated common expenses and pay ad valorem property taxes for the unit. The condominium or common interest community declaration may also establish other units in the condominium or common interest community which shall include the arena playing and spectator areas and may also include office space, restaurant space, locker rooms, private spectator suites or boxes, signage, and other areas, and may also establish common elements, limited common elements and other easements and interests as the commission deems necessary or appropriate. The agreement or agreements between the commission and the private sports and health club organization may also address additional matters which may be the subject of the bylaws or other agreements or arrangements among unit owners of condominiums or common interest communities, either as part of, or separately from, the provisions of chapter 515A or 515B, or any other items as may be ordinarily and customarily negotiated between the commission and the organization.\n(k) The private sports and health club organization has executed an assessment agreement pursuant to section 469.177, subdivision 8, obligating payment of ad valorem taxes based on a minimum market value of the health club of at least $10,000,000 with the city of Minneapolis or the Minneapolis Community Development Agency.\n(l) The commission has executed an agreement requiring the commission to remit annually to the Minneapolis Community Development Agency or appropriate agency an amount which together with any ad valorem taxes or other amounts received by the city of Minneapolis or the Minneapolis Community Development Agency from the health club as tax increments equals the debt service required by the tax increment district attributable to the basketball and hockey arena until the current outstanding indebtedness or any refunding thereof has been paid or retired.\n(m) The development agreement shall be amended:\n(i) so that no payments are due to the city of Minneapolis or the Minneapolis Community Development Agency from the commission or any other person with respect to the sale, ownership or operation of the basketball and hockey arena, except as provided in clauses (k), (l), and (n); and\n(ii) to confirm the satisfactory performance of the obligations of the parties to the development agreement on the effective date of the commission's acquisition; provided, that the city of Minneapolis and the Minneapolis Community Development Agency shall not be required to release any claim they may have under the development agreement with respect to the operations or sale of the health club (except as such claim may arise from the commission's acquisition of the basketball and hockey arena and the contemporaneous sale or transfer of the health club to those persons who own the basketball and hockey arena and the health club on the date of the commission's acquisition) or from the operations or sale of the professional basketball organization occupying the basketball and hockey arena or the security they may have under the development agreement or the ground lease to assure its performance, pursuant to the guaranty of the guarantors in the event of any default of the commission under the ground lease, or of the owners of the health club with respect to the payment of ad valorem taxes or any payment due from them under the development agreement as amended in accordance with the provisions of this subdivision.\n(n) The commission has executed an agreement with the city of Minneapolis providing that for so long as the commission owns the basketball and hockey arena the city shall not impose any entertainment tax or surcharge on tickets purchased for any and all events at the basketball and hockey arena. The agreement may also provide that the commission shall compensate the city for the forbearance of the entertainment tax in effect on the effective date of Laws 1994, chapter 648, plus accrued interest, after payment of basketball and hockey arena debt service, the necessary and appropriate funding of debt reserve of the basketball and hockey arena and all expenses of operation, administration, and maintenance, and the funding of a capital reserve for the repair, remodeling and renovation of the basketball and hockey arena. The required funding of the capital reserve shall be in an amount mutually agreed to by the commission and the city.\n(o) The ground lease shall be amended by the Minneapolis Community Development Agency to the reasonable satisfaction of the commission to provide:\n(i) that the commission's sole financial obligation to the landlord shall be to make the payment provided for in clause (1) from the net revenues of the commission attributable to the operation of the basketball and hockey arena;\n(ii) that the term of the lease shall be 99 years;\n(iii) that the commission shall have the option to purchase the arena land upon the payment of $10 at any time during the term of the ground lease, but, unless otherwise agreed to by the Minneapolis Community Development Agency, only after the payment or retirement of the general obligation tax increment bonds previously issued by the city of Minneapolis to assist in financing the acquisition of the arena land; and\n(iv) other amendments as the commission deems necessary and reasonable to accomplish its purposes as provided in sections 473.598 and 473.599.\n(p) The commission has received a report or reports by qualified consultants on the basketball and hockey arena, the health club and the arena land, based on thorough inspection in accordance with generally accepted professional standards and any correction, repair, or remediation disclosed by the reports has been made to the satisfaction of commission.\nTo the extent and in the manner provided in sections 473.592 and 473.595, the taxes described in section 473.592 for the basketball and hockey arena, the tax, surcharge and other revenues of the commission described in section 473.595, subdivision 1a, attributable to the basketball and hockey arena and any other revenues of the commission attributable to the basketball and hockey arena shall be and remain pledged and appropriated for the purposes specified in Laws 1994, chapter 648, article 1, and for the payment of all necessary and reasonable expenses of the operation, administration, maintenance, and debt service of the basketball and hockey arena until all bonds referred to in section 473.599, subdivision 2, are fully paid or discharged in accordance with law. Bonds issued pursuant to this section may be secured by a bond resolution, or by a trust indenture entered into by the council with a corporate trustee within or outside the state, which shall define the tax and other revenues pledged for the payment and security of the bonds. The pledge shall be a valid charge on the tax, surcharge and other revenues attributable to the basketball and hockey arena referred to in sections 473.592, 473.595, subdivision 1a, 473.598, and 473.599 from the date when bonds are first issued or secured under the resolution or indenture and shall secure the payment of principal and interest and redemption premiums when due and the maintenance at all times of a reserve securing the payments. No mortgage of or security interest in any tangible real or personal property shall be granted to the bondholders or the trustee, but they shall have a valid security interest in all tax and other revenues received and accounts receivable by the commission or council under sections 473.592 to the extent of the tax imposed as security for the debt service of the basketball and hockey arena, 473.595, subdivision 1a, 473.598, and 473.599, as against the claims of all other persons in tort, contract, or otherwise, irrespective of whether the parties have notice of them, and without possession or filing as provided in the Uniform Commercial Code or any other law. In the bond resolution or trust indenture the council may make the covenants, which shall be binding upon the commission, as are determined to be usual and reasonably necessary for the protection of the bondholders. No pledge, mortgage, covenant, or agreement securing bonds may be impaired, revoked, or amended by law or by action of the council, commission, or city, except in accordance with the terms of the resolution or indenture under which the bonds are issued, until the obligations of the council under the resolution or indenture are fully discharged.\nAfter approval by the council and final adoption by the commission of an annual budget of the commission for operation, administration, and maintenance of the basketball and hockey arena, and in anticipation of the proceeds from the taxes under section 473.592 and the revenues of the commission provided for in the budget, but subject to any limitation or prohibition in a bond resolution or indenture, the council may authorize the issuance, negotiation, and sale, in the form and manner and upon the terms that it may determine, of revenue anticipation certificates. The principal amount of the certificates outstanding shall at no time exceed 25 percent of the total amount of the tax and other revenues anticipated. The certificates shall mature not later than three months after the close of the budget year. Prior to the approval and final adoption of the annual budget of the commission, the council may authorize revenue anticipation certificates under this subdivision. So much of the anticipated tax and other revenues as may be needed for the payment of the certificates and interest on them shall be paid into a special debt service fund established for the certificates in the council's financial records. If for any reason the anticipated tax and other revenues are insufficient, the certificates and interest shall be paid from the first tax, surcharge and other revenues received attributable to the basketball and hockey arena, subject to any limitation or prohibition in a bond resolution or indenture. The proceeds of the certificates may be used for any purpose for which the anticipated revenues or taxes may be used or for any purpose for which bond proceeds under subdivision 2 may be used.\nWith the exception of the obligations imposed by sections 473.598 and 473.599, the commission shall not assume any notes, pledges, mortgages, liens, encumbrances, contracts, including advertising contracts or marquee agreements, or other obligations upon acquisition of the basketball and hockey arena or the arena land, including but not by way of limitation, management or concession agreements. Upon acquisition by the commission, the basketball and hockey arena and the arena land shall be free of all liens and encumbrances, including the foregoing but excluding the easements and rights-of-way that the commission shall determine do not materially impair or affect its ownership and operation of the basketball and hockey arena. Upon acquisition, the commission shall, through a process involving statewide public participation, select a name for the basketball and hockey arena. In the process of selecting the name, the commission shall consider its obligation under section 473.599, subdivision 1, but that obligation must not be the principal consideration in making the selection.\nThe commission shall compensate the state for its contribution from the general fund under Minnesota Statutes 2008, section 240A.08, plus accrued interest, after payment of basketball and hockey arena debt service, the necessary and appropriate funding of debt reserve of the basketball and hockey arena and all expenses of operation, administration, and maintenance and the funding of a capital reserve for the repair, remodeling and renovation of the basketball and hockey arena. Compensation paid to the state shall occur at the same time that compensation is paid to the city of Minneapolis, as provided in paragraph (n) of subdivision 4, on a basis proportionate to the amount of forbearance of the entertainment tax or surcharge as provided in paragraph (n) to that date, and the amount of general fund appropriations paid by the state under Minnesota Statutes 2008, section 240A.08, to that date. No reimbursement will be paid under this subdivision after (1) the aggregate amount of the appropriations granted under Minnesota Statutes 2008, section 240A.08, to that time, plus accrued interest, has been reimbursed under this subdivision, or (2) December 31, 2024, whichever is earlier.",
	"repealed": false
}