{
	"id": "611A.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.201",
	"title": "611A.201 DIRECTOR OF PREVENTION OF DOMESTIC VIOLENCE AND SEXUAL ASSAULT.",
	"text": "The executive director of the Office of Justice Programs in the Department of Public Safety shall appoint a person to serve as director of domestic violence and sexual assault prevention in the office. The director must have experience in domestic violence and sexual assault prevention issues. The director serves at the executive director's pleasure in the unclassified service. The executive director may appoint, supervise, discipline, and discharge employees to assist the director in carrying out the director's responsibilities under this section.\nThe director shall have the following duties:\n(1) advocate for the rights of victims of domestic violence and sexual assault;\n(2) increase public education and visibility about the prevention of domestic violence and sexual assault;\n(3) encourage accountability regarding domestic violence and sexual assault at all levels of the system, and develop recommendations to improve accountability when the system fails;\n(4) support prosecution and civil litigation efforts regarding domestic violence and sexual assault at the federal and state levels;\n(5) study issues involving domestic violence and sexual assault as they pertain to both men and women and present findings and recommendations resulting from these studies to all branches of government;\n(6) initiate policy changes regarding domestic violence and sexual assault at all levels of government;\n(7) coordinate existing resources and promote coordinated and immediate community responses to better serve victims of domestic violence and sexual assault;\n(8) build partnerships among law enforcement, prosecutors, defenders, advocates, and courts to reduce the occurrence of domestic violence and sexual assault;\n(9) encourage and support the efforts of health care providers, mental health experts, employers, educators, clergy members, and others, in raising awareness of and addressing how to prevent domestic violence and sexual assault;\n(10) coordinate and maximize the use of federal, state, and local resources available to prevent domestic violence and sexual assault and leverage more resources through grants and private funding; and\n(11) serve as a liaison between the executive director of the Office of Justice Programs in the Department of Public Safety and the commissioner of health with regard to the Department of Health's sexual violence prevention program funded by federal block grants, and oversee how this money is spent.\n[Repealed, 2007 c 13 art 2 s 14]\nBy January 15 of each year, the director shall report to the governor and the legislature on matters within the director's jurisdiction. In addition to other issues deemed relevant by the director, the report may include recommendations for changes in policies and laws relating to domestic violence and sexual assault prevention.\nIn addition to those described in this section, the executive director of the office may assign other appropriate responsibilities to the director.",
	"repealed": false
}