{
	"id": "61A.257",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.257",
	"title": "61A.257 PREFERRED MORTALITY TABLES FOR USE IN DETERMINING MINIMUM RESERVE LIABILITIES.",
	"text": "(a) For the purposes of this section only, the following terms have the meanings given them.\n(b) \"2001 CSO Mortality Table\" means that mortality table, consisting of separate rates of mortality for male and female lives, developed by the American Academy of Actuaries CSO Task Force from the Valuation Basic Mortality Table developed by the Society of Actuaries Individual Life Insurance Valuation Mortality Task Force, and adopted by the NAIC in December 2002. The 2001 CSO Mortality Table is included in the Proceedings of the NAIC (2nd Quarter 2002) and supplemented by the 2001 CSO Preferred Class Structure Mortality Table defined in paragraph (c). Unless the context indicates otherwise, the \"2001 CSO Mortality Table\" includes both the ultimate form of that table and the select and ultimate form of that table and includes both the smoker and nonsmoker mortality tables and the composite mortality tables. It also includes both the age-nearest-birthday and age-last-birthday bases of the mortality tables. Mortality tables in the 2001 CSO Mortality Table include the following:\n(1) \"2001 CSO Mortality Table (F)\" means that mortality table consisting of the rates of mortality for female lives from the 2001 CSO Mortality Table;\n(2) \"2001 CSO Mortality Table (M)\" means that mortality table consisting of the rates of mortality for male lives from the 2001 CSO Mortality Table;\n(3) \"composite mortality tables\" means mortality tables with rates of mortality that do not distinguish between smokers and nonsmokers; and\n(4) \"smoker and nonsmoker mortality tables\" means mortality tables with separate rates of mortality for smokers and nonsmokers.\n(c) \"2001 CSO Preferred Class Structure Mortality Table\" means mortality tables with separate rates of mortality for the super preferred nonsmoker, preferred nonsmoker, residual standard nonsmoker, preferred smoker, and residual standard smoker splits of the 2001 CSO Nonsmoker and Smoker Mortality Tables as adopted by the NAIC at the September 2006 national meeting and published in the NAIC Proceedings (3rd Quarter 2006). Unless the context indicates otherwise, the \"2001 CSO Preferred Class Structure Mortality Table\" includes both the ultimate form of that table and the select and ultimate form of that table, the smoker and nonsmoker mortality tables, both the male and female mortality tables and the gender composite mortality tables, and both the age-nearest-birthday and age-last-birthday bases of the mortality table.\n(d) \"Statistical agent\" means an entity with proven systems for protecting the confidentiality of individual insured and insurer information; demonstrated resources for and history of ongoing electronic communications and data transfer ensuring data integrity with insurers, which are its members or subscribers; and a history of and means for aggregation of data and accurate promulgation of the experience modifications in a timely manner.\nAt the election of the insurer, for each calendar year of issue, for any one or more specified plans of insurance and subject to satisfying the conditions stated in this section, the 2001 CSO Preferred Class Structure Mortality Table may be substituted in place of the 2001 CSO Smoker or Nonsmoker Mortality Table as the minimum valuation standard under section 61A.25 for policies issued on or after January 1, 2007. For policies issued on or after January 1, 2004, and prior to January 1, 2007, these tables may be substituted with the written consent of the commissioner and subject to the conditions in subdivision 3. In determining such consent, the commissioner may rely on the consent of the commissioner of the company's state of domicile. No such election must be made until the insurer demonstrates at least 20 percent of the business to be valued on this table is in one or more of the preferred classes. A table from the 2001 CSO Preferred Class Structure Mortality Table used in place of a 2001 CSO Mortality Table, pursuant to the requirements of this section, will be treated as part of the 2001 CSO Mortality Table only for purposes of reserve valuation pursuant to section 61A.25 and Minnesota Rules, chapter 2748.\n(a) For each plan of insurance with separate rates for preferred and standard nonsmoker lives, an insurer may use the super preferred nonsmoker, preferred nonsmoker, and residual standard nonsmoker tables to substitute for the nonsmoker mortality table found in the 2001 CSO Mortality Table to determine minimum reserves. At the time of election and annually thereafter, except for business valued under the residual standard nonsmoker table, the appointed actuary shall certify that:\n(1) the present value of death benefits over the next ten years after the valuation date, using the anticipated mortality experience without recognition of mortality improvement beyond the valuation date for each class, is less than the present value of death benefits using the valuation basic table corresponding to the valuation table being used for that class; and\n(2) the present value of death benefits over the future life of the contracts, using anticipated mortality experience without recognition of mortality improvement beyond the valuation date for each class, is less than the present value of death benefits using the valuation basic table corresponding to the valuation table being used for that class.\n(b) For each plan of insurance with separate rates for preferred and standard smoker lives, an insurer may use the preferred smoker and residual standard smoker tables to substitute for the smoker mortality table found in the 2001 CSO Mortality Table to determine minimum reserves. At the time of election and annually thereafter, for business valued under the preferred smoker table, the appointed actuary shall certify that:\n(1) the present value of death benefits over the next ten years after the valuation date, using the anticipated mortality experience without recognition of mortality improvement beyond the valuation date for each class, is less than the present value of death benefits using the preferred smoker valuation basic table corresponding to the valuation table being used for that class; and\n(2) the present value of death benefits over the future life of the contracts, using anticipated mortality experience without recognition of mortality improvement beyond the valuation date for each class, is less than the present value of death benefits using the preferred smoker valuation basic table corresponding to the valuation table being used for that class.\n(c) Unless exempted by the commissioner, every authorized insurer using the 2001 CSO Preferred Class Structure Mortality Table shall annually file with the commissioner, the NAIC, or a statistical agent designated by the NAIC and acceptable to the commissioner, statistical reports showing mortality and such other information as the commissioner may deem necessary or expedient for the administration of the provisions of this section. The form of the reports shall be established by the commissioner or the commissioner may require the use of a form established by the NAIC or by a statistical agent designated by the NAIC and acceptable to the commissioner.\n(d) The use of the 2001 CSO Preferred Class Structure Mortality Table for the valuation of policies issued prior to January 1, 2007, shall not be permitted in any statutory financial statement in which a company reports, with respect to any policy or portion of a policy coinsured, either of the following:\n(1) in cases where the mode of payment of the reinsurance premium is less frequent than the mode of payment of the policy premium, a reserve credit that exceeds, by more than the amount specified in this paragraph as Y, the gross reserve calculated before reinsurance. Y is the amount of the gross reinsurance premium that (i) provides coverage for the period from the next policy premium due date to the earlier of the end of the policy year and the next reinsurance premium due date, and (ii) would be refunded to the ceding entity upon the termination of the policy; or\n(2) in cases where the mode of payment of the reinsurance premium is more frequent than the mode of payment of the policy premium, a reserve credit that is less than the gross reserve, calculated before reinsurance, by an amount that is less than the amount specified in this paragraph as Z. Z is the amount of the gross reinsurance premium that the ceding entity would need to pay the assuming company to provide reinsurance coverage from the period of the next reinsurance premium due date to the next policy premium due date minus any liability established for the proportionate amount not remitted to the reinsurer.\n(e) For purposes of paragraph (d), the reserve (1) for the mean reserve method shall be defined as the mean reserve minus the deferred premium asset, and (2) for the midterminal reserve method shall include the unearned premium reserve. A company may estimate and adjust its accounting on an aggregate basis in order to meet the conditions to use the 2001 CSO Preferred Class Structure Mortality Table.",
	"repealed": false
}