{
	"id": "176.183",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.183",
	"title": "176.183 UNINSURED AND SELF-INSURED EMPLOYERS; BENEFITS TO EMPLOYEES AND DEPENDENTS; LIABILITY OF EMPLOYER.",
	"text": "When any employee sustains an injury arising out of and in the course of employment while in the employ of an employer, other than the state or its political subdivisions, not insured or self-insured as provided for in this chapter, the employee or the employee's dependents shall nevertheless receive benefits as provided for in this chapter from the special compensation fund. The commissioner is not required to comply with the procedures in chapter 16C before purchasing, paying for, or reimbursing the employee for medical treatment, equipment, or supplies that are compensable under this chapter. As used in subdivision 1 or 2, \"employer\" includes any owners or officers of a corporation who direct and control the activities of employees. In any petition for benefits under this chapter, the naming of an employer corporation not insured or self-insured as provided for in this chapter, as a defendant, shall constitute without more the naming of the owners or officers as defendants, and service of notice of proceeding under this chapter on the corporation shall constitute service upon the owners or officers. An action to recover benefits paid shall be instituted unless the commissioner determines that no recovery is possible. There shall be no payment from the special compensation fund if there is liability for the injury under the provisions of section 176.215, by an insurer or self-insurer.\n[Repealed, 1988 c 674 s 22]\nAfter a hearing on a petition for benefits and prior to issuing an order against the special compensation fund to pay compensation benefits to an employee, a compensation judge shall first make findings regarding the insurance status of the employer and its liability. The special compensation fund shall not be found liable in the absence of a finding of liability against the employer. Where the liable employer is found after the hearing to be not insured or self-insured as provided for in this chapter, the compensation judge shall assess and order the employer to pay all compensation benefits to which the employee is entitled, the amount for any actual and necessary disbursements expended by the special compensation fund, any actual and necessary disbursements of the employee paid or reimbursed by the special compensation fund, any attorney fees paid to the employee's attorney by the special compensation fund, and a penalty in the amount of 65 percent of all compensation benefits ordered to be paid. The award issued against an employer after the hearing shall constitute a lien for government services pursuant to section 514.67 on all property of the employer and shall be subject to the provisions of the Revenue Recapture Act in chapter 270A. The special compensation fund may enforce the terms of that award in the same manner as a district court judgment. The commissioner of labor and industry, in accordance with the terms of the order awarding compensation, shall pay compensation to the employee or the employee's dependent from the special compensation fund. The commissioner of labor and industry shall certify to the commissioner of management and budget and to the legislature annually the total amount of compensation paid from the special compensation fund under subdivision 1. Compensation paid under this section shall remain a liability of the special compensation fund and shall be financed by the percentage assessed under section 176.129.\n(a) Notwithstanding subdivision 2, the commissioner may direct payment from the special compensation fund for compensation payable pursuant to subdivision 1, including benefits payable under sections 176.102 and 176.135, prior to issuance of an order of a compensation judge or the Workers' Compensation Court of Appeals directing payment or awarding compensation. Where payment is issued pursuant to a petition for a temporary order, the terms of any resulting order shall have the same status and be governed by the same provisions as an award issued pursuant to subdivision 2.\n(b) The commissioner may suspend or terminate an order under paragraph (a) for good cause as determined by the commissioner.\n(a) If the commissioner authorizes the special compensation fund to commence payment without the issuance of a temporary order, the commissioner shall serve by first class mail notice upon the employer and other interested parties of the intention to commence payment. This notice shall be served at least ten calendar days before commencing payment and shall be mailed to the last known address of the employer. The notice shall include a statement that failure of the employer to respond within ten calendar days of the date of service will be deemed acceptance by the employer of the proposed action by the special compensation fund and will be deemed a waiver of defenses the employer has to the special compensation fund's action to recover amounts specified under subdivision 2. At any time prior to final determination of liability, the employer may appear as a party and present defenses the employer has, whether or not an appearance by the employer has previously been made in the matter. The special compensation fund has a cause of action against the employer to recover amounts specified under subdivision 2.\n(b) The commissioner shall notify the employer by first class mail if the special compensation fund intends to enter into a settlement agreement with the employee for the payment of benefits under this section. This notice shall be sent by first class mail to the last known address of the employer at least 15 calendar days before executing the settlement agreement, and shall include:\n(1) a copy of the proposed settlement agreement;\n(2) a statement that within 15 calendar days the employer must notify the special compensation fund in writing of its objection to the proposed settlement; and\n(3) a statement that if the special compensation fund does not receive the employer's written objection within 15 calendar days, the employer must be deemed to have waived all defenses to the special compensation fund's claim for amounts specified under subdivision 2.\n(c) If a settlement agreement is approved by the commissioner or compensation judge after the commissioner has provided notice to the employer under paragraph (b), and if the employer did not provide timely written notification to the special compensation fund of the employer's objection, then the employer must be deemed to have waived all defenses to the special compensation fund's claim for amounts specified under subdivision 2.",
	"repealed": false
}