{
	"id": "518.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.13",
	"title": "518.13 FAILURE TO ANSWER; FINDINGS; HEARING.",
	"text": "If the respondent does not appear after service duly made and proved, the court may hear and determine the proceeding as a default matter.\nIf one of the parties has denied under oath or affirmation that the marriage is irretrievably broken, the court shall consider all relevant factors, including the circumstances that gave rise to the commencement of the proceeding and the prospect of reconciliation, and shall make a finding whether the marriage is irretrievably broken.\nA finding of irretrievable breakdown under this subdivision is a determination that there is no reasonable prospect of reconciliation. The finding must be supported by evidence that (i) the parties have lived separate and apart for a period of not less than 180 days immediately preceding the commencement of the proceeding, or (ii) there is serious marital discord adversely affecting the attitude of one or both of the parties toward the marriage.\nIf both parties by petition or otherwise have stated under oath or affirmation that the marriage is irretrievably broken, or one of the parties has so stated and the other has not denied it, the court, after hearing, shall make a finding that the marriage is irretrievably broken.\nThe court or judge, upon application, may refer the proceeding to a referee to take and report the evidence therein. Hearings for dissolution of marriage shall be heard in open court or before a referee appointed by the court to receive the testimony of the witnesses, or depositions taken as in other equitable actions. However, the court may in its discretion close the hearing.\nProposed findings of fact, conclusions of law, order for judgment, and judgment and decree must be submitted to the court for approval and filing without a final hearing in the following situations:\n(1) if there are no minor children of the marriage, and (i) the parties have entered into a written stipulation, or (ii) the respondent has not appeared after service duly made and proved by affidavit and at least 20 days have elapsed since the time for answering under section 518.12 expired; or\n(2) if there are minor children of the marriage, the parties have signed and acknowledged a stipulation, and all parties are represented by counsel.\nNotwithstanding clause (1) or (2), the court shall schedule the matter for hearing in any case where the proposed judgment and decree does not appear to be in the best interests of the minor children or is contrary to the interests of justice.",
	"repealed": false
}