{
	"id": "17.693",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.693",
	"title": "17.693 DEFINITIONS.",
	"text": "For the purposes of sections 17.691 to 17.702, the terms defined in this section have the meanings given them.\n\"Association\" or \"association of producers\" means an association of producers of agricultural commodities engaged in marketing, bargaining, shipping, or processing an agricultural commodity into agricultural products on behalf of its members who are producers of the agricultural commodity, which has been accredited by the commissioner.\n[Repealed, 1996 c 310 s 1]\n\"Producer\" means any person, who in any one calendar year within the previous two calendar years, produces or causes to be produced any agricultural commodity in quantity beyond the person's own family use, and who is able to transfer, during the calendar year, to a handler or an association a merchantable title to the agricultural commodity or provide management, labor, machinery, facilities, or any other production input, with the assumption of risk, for the production of the agricultural commodity under a written contract.\n\"Agricultural commodity\" includes all agricultural goods produced under contract for marketing as defined by the commissioner of agriculture. It does not include any commodity sold by a producer to another producer for the other's own exclusive use and not for resale. The kinds, types and subtypes of products to be classed together as an agricultural commodity for the purposes of sections 17.691 to 17.701 shall be determined by the commissioner on the basis of common usage and practice.\n\"Handler\" means a person, other than an association, engaged in the business or practice of acquiring agricultural commodities from producers or associations for processing or sale; grading, packaging, handling, storing, or processing agricultural commodities received from producers or associations; contracting or negotiating contracts or other arrangements with or on behalf of producers or associations with respect to the production of any agricultural commodity; or acting as an agent or broker for a handler in the performance of any function or act specified above. It does not include a producer who sells at a retail establishment which the producer owns and operates or who sells at a produce market, agricultural commodities produced by the producer and agricultural commodities produced by another producer subject to value limitation established by the commissioner.\n[Repealed, 1996 c 310 s 1]\n\"Marketing year\" shall mean, generally, any time between the second day of February of the previous calendar year and the first day of February of the subsequent year, unless the commissioner shall determine an alternative time period for a specific agricultural commodity to be designated as its marketing year.",
	"repealed": false
}