{
	"id": "237.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.73",
	"title": "237.73 OBTAINING SERVICE BY FRAUD; INJUNCTION.",
	"text": "Whenever it appears that a person is engaged in an act that constitutes or will constitute a violation of section 609.893, a representative of a telecommunications provider or a person harmed by an alleged violation of section 609.893 may begin a civil proceeding in a district court to enjoin the violation and may petition the court to issue an order for the discontinuance of telephone service.\nAn action under this section must be brought in the county in which subject matter of the action, or some part of it, is located or found, and must be commenced by the filing of a complaint that must be verified by affidavit.\nIf it is shown to the satisfaction of the court, either by verified complaint or affidavit, that a person is engaged in an act that constitutes a violation of section 609.893, the court shall issue a temporary restraining order to abate and prevent the continuance or recurrence of the act. Notice of the complaint shall be given and a hearing on the issuance of a temporary restraining order shall be held under the Rules of Civil Procedure. The court shall direct the county sheriff to seize and keep until further order of the court any device that is being used in violation of section 609.893. The temporary restraining order expires after ten days.\nThe court may issue a permanent injunction to restrain, abate, or prevent the continuance or recurrence of the violation of section 609.893. The court may grant declaratory relief, mandatory orders, or any other relief it judges necessary to accomplish the purposes of the injunction. The court may keep jurisdiction of the case for the purpose of enforcing its orders.\nIf it is shown to the satisfaction of the court, by affidavit, that a person is engaged in an act that constitutes a violation of section 609.893, the court may issue an order that shall be promptly served upon the person in whose name the telecommunications device is listed, requiring the party, within a reasonable time to be fixed by the court but not exceeding 48 hours from the time of service of the petition on said party, to show cause before the judge why telephone service should not promptly be discontinued. At the hearing, the burden of proof is on the complainant.\nUpon a finding by the court that the telecommunications device is being used or has been used in violation of section 609.893, the court shall issue an order requiring the telephone company that is rendering service over the device to disconnect the service. Upon receipt of the order, that shall be served upon an officer of the telephone company by the sheriff of the county in which the telecommunications device is installed or by a duly authorized deputy, the telephone company shall proceed promptly to disconnect and remove the service and discontinue all telephone service until further order of the court.\nNo telephone company is liable for any damages, penalty, or forfeiture, whether civil or criminal, for an act performed in compliance with an order issued by the court.",
	"repealed": false
}