{
	"id": "609.5318",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.5318",
	"title": "609.5318 FORFEITURE OF VEHICLES USED IN DRIVE-BY SHOOTINGS.",
	"text": "(a) If the prosecuting authority establishes by clear and convincing evidence that a motor vehicle was used in a violation of section 609.66, subdivision 1e, the vehicle is subject to forfeiture under this section upon a conviction for the same offense.\n(b) The Department of Corrections Fugitive Apprehension Unit shall not seize a motor vehicle for the purposes of forfeiture under paragraph (a).\n(a) The registered owner of the vehicle must be notified of the seizure and intent to forfeit the vehicle within seven days after the seizure. Notice by certified mail to the address shown in Department of Public Safety records is deemed to be sufficient notice to the registered owner.\n(b) The notice must be in writing and:\n(1) contain a description of the property seized;\n(2) contain the date of seizure; and\n(3) be printed in English. This requirement does not preclude the appropriate agency from printing the notice in other languages in addition to English.\n(c) Substantially, the following language must appear conspicuously in the notice:\n\"WARNING: You will automatically lose the above-described property and the right to be heard in court if you do not file a lawsuit and serve the prosecuting authority within 60 days. You may file your lawsuit in conciliation court if the property is worth $15,000 or less; otherwise, you must file in district court. You may not have to pay a filing fee for your lawsuit if you are unable to afford the fee. You do not have to pay a conciliation court fee if your property is worth less than $500.\"\n(a) Within 60 days following service of a notice of seizure and forfeiture, a claimant may demand a judicial determination of the forfeiture. If a related criminal proceeding is pending, the 60-day period begins to run at the conclusion of those proceedings.\n(b) The demand must be in the form of a civil complaint as provided in section 609.5314, subdivision 3, except as otherwise provided in this section.\n(c) If the claimant makes a timely demand for judicial determination under this subdivision, the appropriate agency must conduct the forfeiture under subdivision 4.\n(a) If a judicial determination of the forfeiture is requested, a separate complaint must be filed against the vehicle, stating the specific act giving rise to the forfeiture and the date, time, and place of the act. The action must be captioned in the name of the prosecuting authority or the prosecuting authority's designee as plaintiff and the property as defendant.\n(b) If a demand for judicial determination of an administrative forfeiture is filed and the court orders the return of the seized property, the court shall order that filing fees be reimbursed to the person who filed the demand. In addition, the court may order the payment of reasonable costs, expenses, attorney fees, and towing and storage fees. If the court orders payment of these costs, they must be paid from forfeited money or proceeds from the sale of forfeited property from the appropriate law enforcement and prosecuting agencies in the same proportion as they would be distributed under section 609.5315, subdivision 5.\n(a) A vehicle used by a person as a common carrier in the transaction of business as a common carrier is subject to forfeiture under this section only if the owner is a consenting party to, or is privy to, the commission of the act giving rise to the forfeiture.\n(b) A vehicle is subject to forfeiture under this section only if the registered owner was privy to the act upon which the forfeiture is based, the act occurred with the owner's knowledge or consent, or the act occurred due to the owner's gross negligence in allowing another to use the vehicle.\n(c) A vehicle encumbered by a bona fide security interest is subject to the interest of the secured party unless the party had knowledge of or consented to the act upon which the forfeiture is based. A person claiming a security interest bears the burden of establishing that interest by clear and convincing evidence.",
	"repealed": false
}