{
	"id": "604.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.20",
	"title": "604.20 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 604.20 to 604.205.\n\"Emotionally dependent\" means that the nature of the patient's or former patient's emotional condition and the nature of the treatment provided by the psychotherapist are such that the psychotherapist knows or has reason to believe that the patient or former patient is unable to withhold consent to sexual contact by the psychotherapist.\n\"Former patient\" means a person who was given psychotherapy within two years prior to sexual contact with the psychotherapist.\n\"Patient\" means a person who seeks or obtains psychotherapy.\n\"Psychotherapist\" means a physician, psychologist, nurse, chemical dependency counselor, social worker, member of the clergy, marriage and family therapist, mental health service provider, licensed professional counselor, or other person, whether or not licensed by the state, who performs or purports to perform psychotherapy.\n\"Psychotherapy\" means the professional treatment, assessment, or counseling of a mental or emotional illness, symptom, or condition.\n\"Sexual contact\" means any of the following, whether or not occurring with the consent of a patient or former patient:\n(1) sexual intercourse, cunnilingus, fellatio, anal intercourse or any intrusion, however slight, into the genital or anal openings of the patient's or former patient's body by any part of the psychotherapist's body or by any object used by the psychotherapist for this purpose, or any intrusion, however slight, into the genital or anal openings of the psychotherapist's body by any part of the patient's or former patient's body or by any object used by the patient or former patient for this purpose, if agreed to by the psychotherapist;\n(2) kissing of, or the intentional touching by the psychotherapist of the patient's or former patient's genital area, groin, inner thigh, buttocks, or breast or of the clothing covering any of these body parts;\n(3) kissing of, or the intentional touching by the patient or former patient of the psychotherapist's genital area, groin, inner thigh, buttocks, or breast or of the clothing covering any of these body parts if the psychotherapist agrees to the kissing or intentional touching.\n\"Sexual contact\" includes requests by the psychotherapist for conduct described in clauses (1) to (3).\n\"Sexual contact\" does not include conduct described in clause (1) or (2) that is a part of standard medical treatment of a patient.\n\"Therapeutic deception\" means a representation by a psychotherapist that sexual contact with the psychotherapist is consistent with or part of the patient's or former patient's treatment.",
	"repealed": false
}