{
	"id": "252.282",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.282",
	"title": "252.282 ICF/DD LOCAL SYSTEM NEEDS PLANNING.",
	"text": "(a) This section does not apply to semi-independent living services and residential-based habilitation services funded as home and community-based services.\n(b) In collaboration with the commissioner and ICF/DD providers, counties shall complete a local system needs planning process for each ICF/DD facility. Counties shall evaluate the preferences and needs of persons with developmental disabilities to determine resource demands through a systematic assessment and planning process by May 15, 2000, and by July 1 every two years thereafter beginning in 2001.\n(c) A local system needs planning process shall be undertaken more frequently when the needs or preferences of consumers change significantly to require reformation of the resources available to persons with developmental disabilities.\n(d) A local system needs plan shall be amended anytime recommendations for modifications to existing ICF/DD services are made to the host county, including recommendations for:\n(1) closure;\n(2) relocation of services;\n(3) downsizing; or\n(4) modification of existing services for which a change in the framework of service delivery is advocated.\n(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Local system needs planning\" means the determination of need for ICF/DD services by program type, location, demographics, and size of licensed services for persons with developmental disabilities or related conditions.\n(c) \"Related condition\" has the meaning given in section 256B.02, subdivision 11.\nIn conducting the local system needs planning process, the host county must use information from the individual service plans of persons for whom the county is financially responsible and of persons from other counties for whom the county has agreed to be the host county. The determination of services and supports offered within the county shall be based on the preferences and needs of consumers. The host county shall also consider the community social services plan, waiting lists, and other sources that identify unmet needs for services. A review of ICF/DD facility licensing and certification surveys, substantiated maltreatment reports, and established service standards shall be employed to assess the performance of providers and shall be considered in the county's recommendations. Continuous quality improvement goals as well as consumer satisfaction surveys may also be considered in this process.\n(a) Upon completion of the local system needs planning assessment, the host county shall make recommendations by May 15, 2000, and by July 1 every two years thereafter beginning in 2001. If no change is recommended, a copy of the assessment along with corresponding documentation shall be provided to the commissioner by July 1 prior to the contract year.\n(b) Recommendations for closures, relocations, and downsizings that do not include a rate increase and for modification of existing services for which a change in the framework of service delivery is necessary shall be provided to the commissioner by July 1 prior to the contract year or at least 90 days prior to the anticipated change, along with the assessment and corresponding documentation.\n[Repealed, 2007 c 133 art 2 s 13]\n(a) In collaboration with counties and providers, the commissioner shall ensure that services recognize the preferences and needs of persons with developmental disabilities and related conditions through a recurring systemic review and assessment of ICF/DD facilities within the state.\n(b) The commissioner shall contract with ICF/DD providers. Contracts shall be for two-year periods.",
	"repealed": false
}