{
	"id": "550.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/550.36",
	"title": "550.36 STAY OF EXECUTION ON MONEY JUDGMENT.",
	"text": "(a) This section is an alternative to the Minnesota Rule of Civil Appellate Procedure, Rule 108.02, subdivision 3. Execution of a judgment for the payment of money only shall be stayed during the course of all appeals or discretionary appellate reviews of a judgment if, within ten days after the entry thereof, the judgment debtor shall file with the court administrator a bond, running to the judgment creditor, the creditor's personal representatives, and assigns. The amount of the bond must be in the amount of the judgment, or a lesser amount approved by the court in the interests of justice. The total appeal bond that is required of all appellants must not exceed $150,000,000, regardless of the value of the judgment. The bond must be conditioned for the payment of the judgment, with interest during the time for which the stay is granted. Interest shall be computed in the same manner and at the same rate provided for interest on verdicts in section 549.09. Within two days thereafter notice that such bond has been filed, with a copy of the same, shall be served on the judgment creditor, if the creditor be a resident of the county, or upon the creditor's agent or attorney, if the creditor has one, and the judgment creditor may except to the sufficiency of the bond; and, upon the creditor's application upon notice or order to show cause, the court, if it find the bond insufficient, may order execution to issue notwithstanding the same, unless the judgment debtor give such further bond as it shall deem sufficient. If the condition of any such bond be not performed, the execution shall issue for the amount of the judgment, with interest and costs, against the judgment debtor and the sureties. When an execution issues against sureties the officer shall certify in the return what amount, if any, was collected from them and the date thereof. If a stay be granted after execution issued, any levy made thereon shall be released and the execution shall be returned and the reason noted by the officer.\n(b) Notwithstanding paragraph (a), if a judgment creditor provides evidence that a judgment debtor may be dissipating assets to avoid payment of a judgment, a court may enter orders that:\n(1) are necessary to protect the judgment creditor; and\n(2) require the judgment debtor to post a bond in an amount up to the total amount of the judgment.",
	"repealed": false
}