{
	"id": "86B.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.601",
	"title": "86B.601 SCUBA DIVING.",
	"text": "(a) A person who swims in waters of the state, except designated swimming areas under section 86B.311, subdivision 4, while wearing or carrying a breathing apparatus allowing the swimmer to breathe while under water, except a snorkel that is not attached to an artificial container of compressed air, must display a diver's flag above the surface of the water.\n(b) A person who places a diver's flag must remain within 50 feet of the flag, measured on the surface of the water.\n(c) A person shall not place a diver's flag where it will obstruct navigation.\n(d) A diver's flag shall measure at least 15 inches horizontally and 12 inches vertically, and both sides shall have a red-colored background bisected diagonally by a three-inch-wide white stripe having its upper end adjacent to the flagstaff.\n(e) A diver's flag shall be displayed in a vertical plane extended from a rigid flagstaff equipped to maintain the upper edge of the flag at least 30 inches above the water surface.\n(f) A diver's flag may be reflectorized or fluorescent provided the entire surface is uniformly reflectorized or fluorescent.\n(g) A diver's flag may be anchored or secured to the bottom when a safety hazard would result from towing the flag.\n(h) If at the discretion of the diver it would be safer and more visible, the flag may be displayed on a watercraft. If the flag is displayed on the watercraft, the craft must be at anchor or, if not at anchor, attended by a diver or a person appointed by the diver to tend the craft. Only watercraft displaying an official diver's flag are authorized in the diving area.\n(a) Not more than four divers may dive under one flag.\n(b) If a group of divers is operating in a contained area, the perimeter must be marked and be outside of the normal area of navigation. The markings shall consist of the official diver's flag and be placed on the perimeter of the diving area at intervals not exceeding 150 feet.\nA person may not scuba or skin dive in waters of this state from one hour after sunset to sunrise on the following day unless the diver has in possession a diver's light that is visible from above the water at a distance of at least 150 feet, except that a diver's light is not required in an emergency, salvage, repair, or construction operation.\nA person may not scuba or skin dive while in possession of a spear from sunset to sunrise.",
	"repealed": false
}