{
	"id": "152.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.25",
	"title": "152.25 COMMISSIONER DUTIES.",
	"text": "(a) The commissioner shall register two in-state manufacturers for the production of all medical cannabis within the state. A registration agreement between the commissioner and a manufacturer is nontransferable. The commissioner shall register new manufacturers or reregister the existing manufacturers by December 1 every two years, using the factors described in this subdivision. The commissioner shall accept applications after December 1, 2014, if one of the manufacturers registered before December 1, 2014, ceases to be registered as a manufacturer. The commissioner's determination that no manufacturer exists to fulfill the duties under sections 152.22 to 152.37 is subject to judicial review in Ramsey County District Court. Data submitted during the application process are private data on individuals or nonpublic data as defined in section 13.02 until the manufacturer is registered under this section. Data on a manufacturer that is registered are public data, unless the data are trade secret or security information under section 13.37.\n(b) As a condition for registration, a manufacturer must agree to:\n(1) begin supplying medical cannabis to patients by July 1, 2015; and\n(2) comply with all requirements under sections 152.22 to 152.37.\n(c) The commissioner shall consider the following factors when determining which manufacturer to register:\n(1) the technical expertise of the manufacturer in cultivating medical cannabis and converting the medical cannabis into an acceptable delivery method under section 152.22, subdivision 6;\n(2) the qualifications of the manufacturer's employees;\n(3) the long-term financial stability of the manufacturer;\n(4) the ability to provide appropriate security measures on the premises of the manufacturer;\n(5) whether the manufacturer has demonstrated an ability to meet the medical cannabis production needs required by sections 152.22 to 152.37; and\n(6) the manufacturer's projection and ongoing assessment of fees on patients with a qualifying medical condition.\n(d) If an officer, director, or controlling person of the manufacturer pleads or is found guilty of intentionally diverting medical cannabis to a person other than allowed by law under section 152.33, subdivision 1, the commissioner may decide not to renew the registration of the manufacturer, provided the violation occurred while the person was an officer, director, or controlling person of the manufacturer.\n(e) The commissioner shall require each medical cannabis manufacturer to contract with an independent laboratory to test medical cannabis produced by the manufacturer. The commissioner shall approve the laboratory chosen by each manufacturer and require that the laboratory report testing results to the manufacturer in a manner determined by the commissioner.\nIf the commissioner intends to revoke or not renew a registration issued under this section, the commissioner must first notify in writing the manufacturer against whom the action is to be taken and provide the manufacturer with an opportunity to request a hearing under the contested case provisions of chapter 14. If the manufacturer does not request a hearing by notifying the commissioner in writing within 20 days after receipt of the notice of proposed action, the commissioner may proceed with the action without a hearing. For revocations, the registration of a manufacturer is considered revoked on the date specified in the commissioner's written notice of revocation.\nThe commissioner may institute proceedings to temporarily suspend the registration of a medical cannabis manufacturer for a period of up to 90 days by notifying the manufacturer in writing if any action by an employee, agent, officer, director, or controlling person of the manufacturer:\n(1) violates any of the requirements of sections 152.22 to 152.37 or the rules adopted thereunder;\n(2) permits, aids, or abets the commission of any violation of state law at the manufacturer's location for cultivation, harvesting, manufacturing, packaging, and processing or at any site for distribution of medical cannabis;\n(3) performs any act contrary to the welfare of a registered patient or registered designated caregiver; or\n(4) obtains, or attempts to obtain, a registration by fraudulent means or misrepresentation.\nUpon the revocation or nonrenewal of a manufacturer's registration under subdivision 1a or implementation of an enforcement action under subdivision 1b that may affect the ability of a registered patient, registered designated caregiver, or a registered patient's parent, legal guardian, or spouse to obtain medical cannabis from the manufacturer subject to the enforcement action, the commissioner shall notify in writing each registered patient and the patient's registered designated caregiver or registered patient's parent, legal guardian, or spouse about the outcome of the proceeding and information regarding alternative registered manufacturers. This notice must be provided two or more business days prior to the effective date of the revocation, nonrenewal, or other enforcement action.\nThe office shall review and publicly report the existing medical and scientific literature regarding the range of recommended dosages for each qualifying condition and the range of chemical compositions of any plant of the genus cannabis that will likely be medically beneficial for each of the qualifying medical conditions. The office shall make this information available to patients with qualifying medical conditions beginning December 1, 2014, and update the information every three years. The office may consult with the independent laboratory under contract with the manufacturer or other experts in reporting the range of recommended dosages for each qualifying medical condition, the range of chemical compositions that will likely be medically beneficial, and any risks of noncannabis drug interactions. The office shall consult with each manufacturer on an annual basis on medical cannabis offered by the manufacturer. The list of medical cannabis offered by a manufacturer shall be published on the Office of Cannabis Management website.\nThe commissioner shall adopt rules necessary for the manufacturer to begin distribution of medical cannabis to patients under the registry program by July 1, 2015, and have notice of proposed rules published in the State Register prior to January 1, 2015.\n(a) The commissioner shall provide regular updates to the task force on medical cannabis therapeutic research and to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services, public safety, judiciary, and civil law regarding: (1) any changes in federal law or regulatory restrictions regarding the use of medical cannabis or hemp; and (2) the market demand and supply in this state for products made from hemp that can be used for medicinal purposes.\n(b) The commissioner may submit medical research based on the data collected under sections 152.22 to 152.37 to any federal agency with regulatory or enforcement authority over medical cannabis to demonstrate the effectiveness of medical cannabis for treating a qualifying medical condition.",
	"repealed": false
}