{
	"id": "205.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.07",
	"title": "205.07 CITY GENERAL ELECTION.",
	"text": "The municipal general election in each city shall be held on the first Tuesday after the first Monday in November in every even-numbered year. Notwithstanding any provision of law to the contrary and subject to the provisions of this section, the governing body of a city may, by ordinance passed at a regular meeting held at least 180 calendar days before the first day to file for candidacy in the next municipal election, decide to hold the election on the first Tuesday after the first Monday in November in either an even- or odd-numbered year. A city may hold elections in either the even-numbered year or the odd-numbered year, but not both. When a city changes its elections from one year to another, and does not provide for the expiration of terms by ordinance, the term of an incumbent expiring at a time when no municipal election is held in the months immediately prior to expiration is extended until the date for taking office following the next scheduled municipal election. If the change results in having three council members to be elected at a succeeding election, the two individuals receiving the highest vote shall serve for terms of four years and the individual receiving the third highest number of votes shall serve for a term of two years. To provide an orderly transition to the odd or even year election plan, the governing body of the city may adopt supplementary ordinances regulating initial elections and officers to be chosen at the elections and shortening or lengthening the terms of incumbents and those elected at the initial election. The term of office for the mayor may be either two or four years. The term of office of council members is four years. Whenever the time of the municipal election is changed, the city clerk immediately shall notify in writing the county auditor and secretary of state of the change of date. Thereafter the municipal general election shall be held on the first Tuesday after the first Monday in November in each odd-numbered or even-numbered year until the ordinance is revoked and notification of the change is made. A municipal general election scheduled to be held in an odd-numbered year may be postponed for inclement weather as provided in section 205.105.\nThe terms of all city council members of charter cities expire on the first Monday in January of the year in which they expire. All officers of charter cities chosen and qualified shall hold office until their successors qualify.\n[Repealed, 1976 c 44 s 70]\nAn ordinance changing the year of the municipal election is effective 240 days after passage and publication or at a later date fixed in the ordinance. Within 180 days after passage and publication of the ordinance, a petition requesting a referendum on the ordinance may be filed with the city clerk. The petition shall be signed by eligible voters equal in number to ten percent of the total number of votes cast in the city at the last municipal general election. If the requisite petition is filed within the prescribed period, the ordinance shall not become effective until it is approved by a majority of the voters voting on the question at a general or special election held on a date authorized by section 205.10, subdivision 3a. If the petition is filed, the governing body may reconsider its action in adopting the ordinance.",
	"repealed": false
}