{
	"id": "13.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.72",
	"title": "13.72 TRANSPORTATION DEPARTMENT DATA.",
	"text": "An estimate of the cost of a construction project of the Minnesota Department of Transportation prepared by department employees is nonpublic data and is not available to the public from the time of final design until the project is awarded.\n[Repealed, 1999 c 227 s 23]\n[Repealed, 1988 c 544 s 27; 1988 c 670 s 14]\nAll data submitted to the Department of Transportation in the form of motor vehicle carrier accident reports, except the portions of the report forms in which the carrier and the driver provide their version of the accident, are classified as nonpublic data with regard to data not on individuals, and private data with regard to data on individuals.\nThose portions of the motor vehicle carrier accident report forms, that motor vehicle carriers are required to submit to the Department of Transportation, that contain the carrier's and driver's version of the accident are classified as protected nonpublic data with regard to data not on individuals, and confidential data with regard to data on individuals.\nNames of complainants, complaint letters, and other unsolicited data furnished to the Department of Transportation by a person other than the data subject or department employee, which provide information that a person who is subject to chapter 221 or rules adopted under that chapter may not be in compliance with those requirements, are classified as confidential data or protected nonpublic data.\nThe following data created, collected, or maintained about persons subject to chapter 221 and rules adopted under that chapter are public: data contained in inspection and compliance forms and data contained in audit reports that are not prepared under contract to the Federal Highway Administration.\nThe following data submitted by Minnesota intrastate motor carriers to the Department of Transportation are nonpublic data: all payroll reports including wages, hours or miles worked, hours earned, employee benefit data, and terminal and route-specific operating data including percentage of revenues paid to agent operated terminals, line-haul load factors, pickup and delivery (PUD) activity, and peddle driver activity.\nMS 2018 [Repealed, 1Sp2019 c 5 art 2 s 30]\n(a) Personal, medical, financial, familial, or locational information data pertaining to applicants for or users of services providing transportation for people with disabilities or elderly individuals are private data on individuals.\n(b) Private transportation service data may be disclosed between the Department of Human Services and the Metropolitan Council for purposes of administering and coordinating human services programs and transportation services for people with disabilities and elderly individuals. The data that may be shared under this paragraph are limited to the individual's first, last, and middle names; date of birth; residential address; and program eligibility status with expiration date for the purposes of informing the other party of program eligibility.\n(a) This subdivision applies to government data of the Department of Transportation when the commissioner of transportation undertakes a design-build transportation project as defined in section 161.3410, subdivision 6.\n(b) When the commissioner solicits a request for qualifications (RFQ), as defined in section 161.3410, subdivision 9:\n(1) the statement of qualifications evaluation criteria and scoring methodology, identifying information concerning the members of the technical review committee, and the statement of qualifications evaluations are confidential data on individuals or protected nonpublic data; and\n(2) the statement of qualifications submitted by a potential design-build firm, as defined in section 161.3410, subdivision 4, is nonpublic data.\nWhen the commissioner announces the short list of qualified design-build firms, the statement of qualifications evaluation criteria and scoring methodology and the statement of qualifications evaluations classified under clause (1) become public data.\n(c) When the commissioner solicits a request for proposals (RFP), as defined in section 161.3410, subdivision 8:\n(1) the technical proposal, alternative technical concepts, preapproved elements, price proposal, disadvantaged business enterprise and equal employment opportunity submittal, and data used to evaluate the disadvantaged business enterprise and equal employment opportunity submittal are nonpublic data; and\n(2) the technical proposal evaluation criteria and scoring methodology and technical proposal evaluations are protected nonpublic data.\n(d) When the commissioner opens the price proposals under section 161.3426, subdivision 1, paragraph (b):\n(1) the technical proposal evaluation scores and the dollar amounts in the price proposals become public data;\n(2) the statement of qualifications submitted by a potential design-build firm, the technical proposal, alternative technical concepts, preapproved elements, the disadvantaged business enterprise and equal employment opportunity submittal, and data used to evaluate the disadvantaged business enterprise and equal employment opportunity submittal remain nonpublic data until the project is awarded, with the exception of trade secret data as defined and classified in section 13.37; and\n(3) the technical proposal evaluation criteria and scoring methodology; technical proposal evaluations, other than scores made public under clause (1); and identifying information concerning the members of the technical review committee remain protected nonpublic data until the project is awarded.\n(e) If all responses to a request for proposals are rejected before awarding the project, data that do not become public under this subdivision retain their classification until a resolicitation of the request for proposals results in award of the project or a determination is made to abandon the project. If a resolicitation of proposals does not occur within one year of the announcement of the short list of qualified design-build firms, all data under this subdivision become public.\nWhen the commissioner of transportation determines that the design-build best-value method of project delivery is appropriate for a project under sections 161.3410 to 161.3426, relocation reports, planimetric files, digital terrain models, preliminary design drawings, commissioner's orders, requests for proposals, and requests for qualifications are classified as protected nonpublic data with regard to data not on individuals and confidential data on individuals until the department publishes the data as part of the request for proposal process. The commissioner may release design-build data to land owners, counties, cities, and other parties under contract to a government entity as necessary to facilitate project development. The released data retain their classification as protected nonpublic data with regard to data not on individuals and confidential data on individuals as provided by section 13.03, subdivision 4, paragraph (c), until the department publishes the data as part of the request for proposal process.\nThe following data pertaining to applicants for or users of toll facilities, and high-occupancy vehicle lanes for which a user fee is charged under section 160.93, are classified as nonpublic data with regard to data not on individuals and as private data with regard to data on individuals: data contained in applications for the purchase, lease, or rental of a device such as an electronic vehicle transponder which automatically assesses charges for a vehicle's use of toll roads; personal and vehicle identification data; financial and credit data; and toll road usage data. Nothing in this subdivision prohibits the production of summary data as defined in section 13.02, subdivision 19.\n(a) Names, home addresses except for zip codes, home email addresses, and home telephone numbers obtained for or received in response to a survey conducted by or on behalf of the Department of Transportation are classified as private data on individuals.\n(b) Business names, business addresses except for zip codes, business email addresses, and business telephone numbers obtained for or received in response to a survey conducted by or on behalf of the Department of Transportation are classified as nonpublic data.\nFinancial statements and shareholder financial data provided to the commissioner of transportation by a consultant in order to establish its overhead rate, and the schedule of audit adjustments and the overhead rate schedule prepared by the Department of Transportation in order to establish the overhead rate for a consultant are classified as nonpublic data or private data on individuals. The overhead rate percentage is public data.\nBid documentation held in escrow by the Department of Transportation is classified as nonpublic data. Any data on individuals in the bid documentation are classified as private data on individuals. \"Bid documentation\" means all writings, working papers, computer printout charts, and other data calculations used by a contractor to determine its bid in bidding for a contract. The bid documentation includes, but is not limited to, the contractor's costs for operating each piece of equipment owned by the contractor, the contractor's overhead costs and its calculated overhead rate, the contractor's pay rates for its employees, efficiency or productivity factors, arithmetic extensions, and the rates and quotations from subcontractors and material suppliers to the extent that the rates and quotations were used by the contractor in formulating and determining the amount of the bid.\nThe following data on participants collected by the Department of Transportation to administer the adopt-a-highway program are classified as private data on individuals: home addresses, except for zip codes; home email addresses; and home telephone numbers.\n(a) When the Department of Transportation undertakes a construction manager/general contractor contract, as defined and authorized in sections 161.3207 to 161.3209, the provisions of this subdivision apply.\n(b) When the commissioner of transportation solicits a request for qualifications:\n(1) the following data are classified as protected nonpublic:\n(i) the statement of qualifications scoring evaluation manual; and\n(ii) the statement of qualifications evaluations;\n(2) the statement of qualifications submitted by a potential construction manager/general contractor is classified as nonpublic data; and\n(3) identifying information concerning the members of the Technical Review Committee is classified as private data.\n(c) When the commissioner of transportation announces the short list of qualified construction managers/general contractors, the following data become public:\n(1) the statement of qualifications scoring evaluation manual; and\n(2) the statement of qualifications evaluations.\n(d) When the commissioner of transportation solicits a request for proposals:\n(1) the proposal scoring manual is classified as protected nonpublic data; and\n(2) the following data are classified as nonpublic data:\n(i) the proposals submitted by a potential construction manager/general contractor; and\n(ii) the proposal evaluations.\n(e) When the commissioner of transportation has completed the ranking of proposals and announces the selected construction manager/general contractor, the proposal evaluation score or rank and proposal evaluations become public data.\n(f) When the commissioner of transportation conducts contract negotiations with a construction manager/general contractor, government data created, collected, stored, and maintained during those negotiations are nonpublic data until a construction manager/general contractor contract is fully executed.\n(g) When the construction manager/general contractor contract is fully executed or when the commissioner of transportation decides to use another contract procurement process, other than the construction manager/general contractor authority, authorized under section 161.3209, subdivision 3, paragraph (b), all remaining data not already made public under this subdivision become public.\n(h) If the commissioner of transportation rejects all responses to a request for proposals before a construction manager/general contractor contract is fully executed, all data, other than that data made public under this subdivision, retains its classification until a resolicitation of the request for proposals results in a fully executed construction manager/general contractor contract or a determination is made to abandon the project. If a resolicitation of proposals does not occur within one year of the announcement of the request for proposals, the remaining data become public.\n(a) The following data on applicants, users, and customers of public transit are private data on individuals: data collected by or through a government entity's personalized web services or the Metropolitan Council's regional fare collection system; and data collected by telephone or through a third-party software program for the purposes of booking and using public transit services. As used in this subdivision, the following terms have the meanings given:\n(1) \"regional fare collection system\" means the fare collection system created and administered by the council that is used for collecting fares or providing fare cards or passes for transit services which includes:\n(i) regular route bus service within the metropolitan area and paratransit service, whether provided by the council or by other providers of regional transit service;\n(ii) light rail transit service within the metropolitan area;\n(iii) rideshare programs administered by the council;\n(iv) special transportation services provided under section 473.386; and\n(v) commuter rail service;\n(2) \"personalized web services\" means services for which transit service applicants, users, and customers must establish a user account;\n(3) \"metropolitan area\" means the area defined in section 473.121, subdivision 2; and\n(4) \"third-party software program\" means a software program that is proprietary to a third party, including a third-party software program commonly known as a mobile app, that collects and uses a public transit customer's name and other personally identifiable information, pick-up and drop-off locations, and other trip data for the purposes of booking and using public transit services.\n(b) A government entity may disseminate data on user and customer transaction history and fare card use to government entities, organizations, school districts, educational institutions, and employers that subsidize or provide fare cards to their clients, students, or employees. \"Data on user and customer transaction history and fare card use\" means:\n(1) the date a fare card was used;\n(2) the time a fare card was used;\n(3) the mode of travel;\n(4) the type of fare product used; and\n(5) information about the date, time, and type of fare product purchased.\nGovernment entities, organizations, school districts, educational institutions, and employers may use customer transaction history and fare card use data only for purposes of measuring and promoting fare card use and evaluating the cost-effectiveness of their fare card programs. If a user or customer requests in writing that the council limit the disclosure of transaction history and fare card use, the council may disclose only the card balance and the date a card was last used.\n(c) A government entity may disseminate transit service applicant, user, and customer data to another government entity to prevent unlawful intrusion into government electronic systems, or as otherwise provided by law.\n(a) Data on applicants and users of Metropolitan Council programs established under section 473.387, subdivision 4, are classified as private data on individuals under section 13.02, subdivision 12.\n(b) The council may disclose transit assistance program data to public or private agencies or organizations for the purposes of administering and coordinating human services programs and other support services for the applicants or users.",
	"repealed": false
}