{
	"id": "169A.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.53",
	"title": "169A.53 ADMINISTRATIVE AND JUDICIAL REVIEW OF LICENSE REVOCATION.",
	"text": "(a) At any time during a period of revocation imposed under section 169A.52 (revocation of license for test failure or refusal) or a period of disqualification imposed under section 171.165 (commercial driver's license disqualification), a person may request in writing a review of the order of revocation or disqualification by the commissioner, unless the person is entitled to review under section 171.166 (review of disqualification). Upon receiving a request the commissioner or the commissioner's designee shall review the order, the evidence upon which the order was based, and any other material information brought to the attention of the commissioner, and determine whether sufficient cause exists to sustain the order. Within 15 days of receiving the request the commissioner shall report in writing the results of the review. The review provided in this subdivision is not subject to the contested case provisions of the Administrative Procedure Act in sections 14.001 to 14.69.\n(b) The availability of administrative review for an order of revocation or disqualification has no effect upon the availability of judicial review under this section.\n(c) Review under this subdivision must take place, if possible, at the same time as any administrative review of the person's impoundment order under section 169A.60, subdivision 9.\n(a) Within 60 days following receipt of a notice and order of revocation or disqualification pursuant to section 169A.52 (revocation of license for test failure or refusal), a person may petition the court for review. The petition must be filed with the district court administrator in the county where the alleged offense occurred, together with proof of service of a copy on the commissioner, and accompanied by the standard filing fee for civil actions. Responsive pleading is not required of the commissioner, and court fees must not be charged for the appearance of the commissioner in the matter.\n(b) The petition must:\n(1) be captioned in the full name of the person making the petition as petitioner and the commissioner as respondent;\n(2) include the petitioner's date of birth, driver's license number, and date of the offense; and\n(3) state with specificity the grounds upon which the petitioner seeks rescission of the order of revocation, disqualification, or denial.\n(c) The filing of the petition does not stay the revocation, disqualification, or denial. The reviewing court may order a stay of the balance of the revocation or disqualification if the hearing has not been conducted within 60 days after filing of the petition upon terms the court deems proper.\n(d) Judicial reviews must be conducted according to the Rules of Civil Procedure, except that prehearing discovery is mandatory and is limited to:\n(1) the notice of revocation;\n(2) the test record or, in the case of blood or urine tests, the certificate of analysis;\n(3) the peace officer's certificate and any accompanying documentation submitted by the arresting officer to the commissioner; and\n(4) disclosure of potential witnesses, including experts, and the basis of their testimony.\nOther types of discovery are available only upon order of the court.\n(a) A judicial review hearing under this section must be before a district judge in any county in the judicial district where the alleged offense occurred. The hearing is to the court and may be conducted at the same time and in the same manner as hearings upon pretrial motions in the criminal prosecution under section 169A.20 (driving while impaired), if any. The hearing must be recorded. The commissioner shall appear and be represented by the attorney general or through the prosecuting authority for the jurisdiction involved. The hearing must be held at the earliest practicable date, and in any event no later than 60 days following the filing of the petition for review. The judicial district administrator shall establish procedures to ensure efficient compliance with this subdivision. To accomplish this, the administrator may, whenever possible, consolidate and transfer review hearings among the locations within the judicial district where terms of district court are held.\n(b) The scope of the hearing is limited to the issues in clauses (1) to (12):\n(1) Did the peace officer have probable cause to believe the person was driving, operating, or in physical control of a motor vehicle or commercial motor vehicle in violation of section 169A.20 (driving while impaired)?\n(2) Was the person lawfully placed under arrest for violation of section 169A.20?\n(3) Was the person involved in a motor vehicle accident or collision resulting in property damage, personal injury, or death?\n(4) Did the person refuse to take a screening test provided for by section 169A.41 (preliminary screening test)?\n(5) If the screening test was administered, did the test indicate an alcohol concentration of 0.08 or more?\n(6) At the time of the request for the test, did the peace officer inform the person of the person's rights and the consequences of taking or refusing the test as required by section 169A.51, subdivision 2?\n(7) Did the person refuse to permit the test?\n(8) If a test was taken by a person driving, operating, or in physical control of a motor vehicle, did the test results indicate at the time of testing:\n(i) an alcohol concentration of 0.08 or more; or\n(ii) the presence of a controlled substance listed in Schedule I or II or its metabolite, other than marijuana or tetrahydrocannabinols?\n(9) If a test was taken by a person driving, operating, or in physical control of a commercial motor vehicle, did the test results indicate an alcohol concentration of 0.04 or more at the time of testing?\n(10) Was the testing method used valid and reliable and were the test results accurately evaluated?\n(11) Did the person prove the defense of necessity?\n(12) Did the person prove the defense of controlled substance use in accordance with a prescription?\n(c) It is an affirmative defense for the petitioner to prove that, at the time of the refusal, the petitioner's refusal to permit the test was based upon reasonable grounds.\n(d) Certified or otherwise authenticated copies of laboratory or medical personnel reports, records, documents, licenses, and certificates are admissible as substantive evidence.\n(e) The court shall order that the revocation or disqualification be either rescinded or sustained and forward the order to the commissioner. The court shall file its order within 14 days following the hearing. If the revocation or disqualification is sustained, the court shall also forward the person's driver's license or permit to the commissioner for further action by the commissioner if the license or permit is not already in the commissioner's possession.\n(f) Any party aggrieved by the decision of the reviewing court may appeal the decision as provided in the Rules of Appellate Procedure.\n(g) The civil hearing under this section shall not give rise to an estoppel on any issues arising from the same set of circumstances in any criminal prosecution.\n(h) It is an affirmative defense for the petitioner to prove a necessity.\n(i) It is an affirmative defense to the presence of a Schedule I or II controlled substance that the person used the controlled substance according to the terms of a prescription issued for the person according to sections 152.11 and 152.12, unless the court finds by a preponderance of the evidence that the use of the controlled substance impaired the person's ability to operate a motor vehicle.",
	"repealed": false
}