{
	"id": "473.4075",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.4075",
	"title": "473.4075 TRANSIT RIDER INVESTMENT PROGRAM.",
	"text": "(a) For purposes of this section, the following terms and the terms defined in section 609.855, subdivision 7, have the meanings given.\n(b) \"Transit official\" means an individual who is authorized as TRIP personnel, a community service officer, or a peace officer, as defined in section 626.84, subdivision 1, paragraph (c).\n(c) \"TRIP personnel\" means persons specifically authorized by the council for the transit rider investment program under this section, including but not limited to fare inspection and enforcement, who are not peace officers or community service officers.\n(d) \"TRIP\" or \"program\" means the transit rider investment program established in this section.\n(a) Subject to available funds, the council must implement a transit rider investment program that provides for TRIP personnel deployment, fare payment inspection, administrative citation issuance, rider education and assistance, and improvements to the transit experience.\n(b) As part of program implementation, the council must:\n(1) adopt a resolution that establishes the program and establishes fine amounts in accordance with subdivision 8;\n(2) establish policies and procedures that govern authorizing and training TRIP personnel, TRIP personnel uniforms, issuing an administrative citation, and contesting an administrative citation;\n(3) consult with stakeholders on the design of the program;\n(4) develop a TRIP personnel recruitment plan that includes informing and supporting potential applicants who are:\n(i) representative of transit users; and\n(ii) from cultural, ethnic, and racial communities that are historically underrepresented in state or local public service;\n(5) develop a TRIP personnel strategic deployment plan that:\n(i) requires teams of at least two individuals; and\n(ii) targets deployment to times and locations with identified concentrations of activity that are subject to administrative citations, other citations, or arrest or that negatively impact the rider experience; and\n(6) provide for training to peace officers who provide law enforcement assistance under an agreement with the council on the program and issuance of administrative citations.\nThe council must appoint a TRIP manager to manage the program. The TRIP manager must have managerial experience in social services, transit service, or law enforcement. The TRIP manager is a TRIP personnel staff member.\n(a) The duties of the TRIP personnel include:\n(1) monitoring and responding to passenger activity, including:\n(i) informing passengers about and specifying expectations related to the council's rider code of conduct; and\n(ii) assisting passengers in obtaining social services, such as through information and referrals;\n(2) acting as a liaison to social service agencies;\n(3) providing information to passengers on using the transit system;\n(4) providing direct navigation assistance and accompaniment to passengers who have a disability, are elderly, or request enhanced personal aid;\n(5) performing fare payment inspections;\n(6) issuing administrative citations as provided in subdivision 6; and\n(7) obtaining assistance from peace officers or community service officers as necessary.\n(b) An individual who is authorized as TRIP personnel must wear the uniform as established by the council at all times when on duty.\nTraining for TRIP personnel must include the following topics:\n(1) early warning techniques, crisis intervention, conflict de-escalation, and conflict resolution;\n(2) identification of persons likely in need of social services;\n(3) locally available social service providers, including services for homelessness, mental health, and addiction;\n(4) policies and procedures for administrative citations; and\n(5) administration of opiate antagonists in a manner that meets the requirements under section 151.37, subdivision 12.\n(a) A transit official has the exclusive authority to issue an administrative citation to a person who commits a violation under section 609.855, subdivision 1, paragraph (a), clause (1), or 3.\n(b) An administrative citation must include notification that the person has the right to contest the citation, basic procedures for contesting the citation, and information on the timeline and consequences for failure to contest the citation or pay the fine.\n(c) The council must not mandate or suggest a quota for the issuance of administrative citations under this section.\n(d) Issuance and resolution of an administrative citation is a bar to prosecution under section 609.855, subdivision 1, paragraph (a), clause (1), or 3, or for any other violation arising from the same conduct.\n(a) A person who commits a violation under section 609.855, subdivision 1, paragraph (a), clause (1), or 3, and is issued an administrative citation under this section must, within 90 days of issuance, pay the fine as specified or contest the citation. A person who fails to either pay the fine or contest the citation within the specified period is considered to have waived the contested citation process and is subject to collections.\n(b) The council must provide a civil process for a person to contest the administrative citation before a neutral third party. The council may employ a council employee not associated with its transit operations to hear and rule on challenges to administrative citations or may contract with another unit of government or a private entity to provide the service.\n(c) The council may contract with credit bureaus, public and private collection agencies, the Department of Revenue, and other public or private entities providing collection services as necessary for the collection of fine debts under this section. As determined by the council, collection costs are added to the debts referred to a public or private collection entity for collection. Collection costs include the fees of the collection entity and may include, if separately provided, skip tracing fees, credit bureau reporting charges, and fees assessed by any public entity for obtaining information necessary for debt collection. If the collection entity collects an amount less than the total due, the payment is applied proportionally to collection costs and the underlying debt.\n(a) The amount of a fine under this section must be set at no less than $35 and no more than $100.\n(b) Subject to paragraph (a), the council may adopt a graduated structure that increases the fine amount for second and subsequent violations.\n(c) The council may adopt an alternative resolution procedure under which a person may resolve an administrative citation in lieu of paying a fine by complying with terms established by the council for community service, prepayment of future transit fares, or both. The alternative resolution procedure must be available only to a person who has committed a violation under section 609.855, subdivision 1, paragraph (a), clause (1), or 3, for the first time, unless the person demonstrates financial hardship under criteria established by the council.",
	"repealed": false
}