{
	"id": "62A.3098",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.3098",
	"title": "62A.3098 RAPID WHOLE GENOME SEQUENCING; COVERAGE.",
	"text": "For purposes of this section, \"rapid whole genome sequencing\" or \"rWGS\" means an investigation of the entire human genome, including coding and noncoding regions and mitochondrial deoxyribonucleic acid, to identify disease-causing genetic changes that returns the final results in 14 days. Rapid whole genome sequencing includes patient-only whole genome sequencing and duo and trio whole genome sequencing of the patient and the patient's biological parent or parents.\nA health plan that provides coverage to Minnesota residents must cover rWGS testing if the enrollee:\n(1) is 21 years of age or younger;\n(2) has a complex or acute illness of unknown etiology that is not confirmed to have been caused by an environmental exposure, toxic ingestion, an infection with a normal response to therapy, or trauma; and\n(3) is receiving inpatient hospital services in an intensive care unit or a neonatal or high acuity pediatric care unit.\nCoverage may be based on the following medical necessity criteria:\n(1) the enrollee has symptoms that suggest a broad differential diagnosis that would require an evaluation by multiple genetic tests if rWGS testing is not performed;\n(2) timely identification of a molecular diagnosis is necessary in order to guide clinical decision making, and the rWGS testing may aid in guiding the treatment or management of the enrollee's condition; and\n(3) the enrollee's complex or acute illness of unknown etiology includes at least one of the following conditions:\n(i) congenital anomalies involving at least two organ systems, or complex or multiple congenital anomalies in one organ system;\n(ii) specific organ malformations that are highly suggestive of a genetic etiology;\n(iii) abnormal laboratory tests or abnormal chemistry profiles suggesting the presence of a genetic disease, complex metabolic disorder, or inborn error of metabolism;\n(iv) refractory or severe hypoglycemia or hyperglycemia;\n(v) abnormal response to therapy related to an underlying medical condition affecting vital organs or bodily systems;\n(vi) severe muscle weakness, rigidity, or spasticity;\n(vii) refractory seizures;\n(viii) a high-risk stratification on evaluation for a brief resolved unexplained event with any of the following features:\n(A) a recurrent event without respiratory infection;\n(B) a recurrent seizure-like event; or\n(C) a recurrent cardiopulmonary resuscitation;\n(ix) abnormal cardiac diagnostic testing results that are suggestive of possible channelopathies, arrhythmias, cardiomyopathies, myocarditis, or structural heart disease;\n(x) abnormal diagnostic imaging studies that are suggestive of underlying genetic condition;\n(xi) abnormal physiologic function studies that are suggestive of an underlying genetic etiology; or\n(xii) family genetic history related to the patient's condition.\nCoverage provided in this section is subject to the enrollee's health plan cost-sharing requirements, including any deductibles, co-payments, or coinsurance requirements that apply to diagnostic testing services.\nIf the enrollee's health plan uses a capitated or bundled payment arrangement to reimburse a provider for services provided in an inpatient setting, reimbursement for services covered under this section must be paid separately and in addition to any reimbursement otherwise payable to the provider under the capitated or bundled payment arrangement, unless the health carrier and the provider have negotiated an increased capitated or bundled payment rate that includes the services covered under this section.\nGenetic data generated as a result of performing rWGS and covered under this section: (1) must be used for the primary purpose of assisting the ordering provider and treating care team to diagnose and treat the patient; (2) is protected health information as set forth under the Health Insurance Portability and Accountability Act (HIPAA), the Health Information Technology for Economic and Clinical Health Act, and any promulgated regulations, including but not limited to Code of Federal Regulations, title 45, parts 160 and 164, subparts A and E; and (3) is a protected health record under sections 144.291 to 144.298.\n(a) The commissioner of commerce must reimburse health carriers for coverage under this section. Reimbursement is available only for coverage that would not have been provided by the health plan without the requirements of this section. Treatments and services covered by the health plan as of January 1, 2024, are ineligible for payments under this subdivision by the commissioner of commerce.\n(b) Health carriers must report to the commissioner of commerce quantified costs attributable to the additional benefit under this section in a format developed by the commissioner. A health plan's coverage as of January 1, 2024, must be used by the health carrier as the basis for determining whether coverage would not have been provided by the health plan for purposes of this subdivision.\n(c) The commissioner of commerce must evaluate submissions and make payments to health carriers as provided in Code of Federal Regulations, title 45, section 155.170.\nEach fiscal year, an amount necessary to make payments to health carriers to defray the cost of providing coverage under this section is appropriated to the commissioner of commerce.",
	"repealed": false
}