{
	"id": "609.3457",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.3457",
	"title": "609.3457 SEX OFFENDER ASSESSMENT.",
	"text": "When a person is convicted of a sex offense, the court shall order an independent professional assessment of the offender's need for sex offender treatment to be completed before sentencing. The court may waive the assessment if: (1) the Sentencing Guidelines provide a presumptive prison sentence for the offender, or (2) an adequate assessment was conducted prior to the conviction. An assessor providing an assessment for the court must be experienced in the evaluation and treatment of sex offenders.\nWhen a person is convicted of a felony-level sex offense, and the person has previously been convicted of a sex offense regardless of the penalty level, the court shall order a sex offender assessment to be completed by the Minnesota security hospital. The assessment must contain the facts upon which the assessment conclusion is based, with reference to the offense history of the offender or the severity of the current offense, the social history of the offender, and the results of an examination of the offender's mental status unless the offender refuses to be examined. The assessment conclusion may not be based on testing alone. Upon completion, the assessment must be forwarded to the court and the commissioner of corrections. The court shall consider the assessment when sentencing the offender and, if applicable, when making the preliminary determination regarding the appropriateness of a civil commitment petition under section 609.1351.\nNotwithstanding section 13.384, 13.85, 144.291 to 144.298, 260B.171, or 260C.171, or chapter 260E, the assessor has access to the following private or confidential data on the person if access is relevant and necessary for the assessment:\n(1) medical data under section 13.384;\n(2) corrections and detention data under section 13.85;\n(3) health records under sections 144.291 to 144.298;\n(4) juvenile court records under sections 260B.171 and 260C.171; and\n(5) local welfare agency records under chapter 260E.\nData disclosed under this section may be used only for purposes of the assessment and may not be further disclosed to any other person, except as authorized by law.\nIf the assessment indicates that the offender is in need of and amenable to sex offender treatment, the court shall include in the sentence a requirement that the offender undergo treatment, unless the court sentences the offender to prison.\nAs used in this section, \"sex offense\" means a violation of section 609.342; 609.343; 609.344; 609.345; 609.3451; 609.3458; 609.746, subdivision 1; 609.79; or 617.23; or another offense arising out of a charge based on one or more of those sections.",
	"repealed": false
}