{
	"id": "638.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/638.09",
	"title": "638.09 CLEMENCY REVIEW COMMISSION.",
	"text": "(a) The Clemency Review Commission is established to:\n(1) review each eligible clemency application and waiver request that it receives;\n(2) recommend to the board, in writing, whether to grant or deny the application or waiver request, with each member's vote reported;\n(3) recommend to the board, in writing, whether the board should conduct a hearing on a clemency application, with each member's vote reported; and\n(4) provide victim support services, assistance to applicants, and other assistance as the board requires.\n(b) Unless otherwise provided:\n(1) the commission's recommendations under this chapter are nonbinding on the governor or the board; and\n(2) chapter 15 applies unless otherwise inconsistent with this chapter.\n(a) The commission consists of nine members, each serving a term coterminous with the governor.\n(b) The governor, the attorney general, and the chief justice of the supreme court must each appoint three members to serve on the commission and replace members when the members' terms expire. Members serve at the pleasure of their appointing authority.\n(a) An appointing authority is encouraged to consider the following criteria when appointing a member:\n(1) expertise in law, corrections, victims' services, correctional supervision, mental health, and substance abuse treatment; and\n(2) experience addressing systemic disparities, including but not limited to disparities based on race, gender, and ability.\n(b) An appointing authority must seek out and encourage qualified individuals to apply to serve on the commission, including:\n(1) members of Indigenous communities, Black communities, and other communities of color;\n(2) members diverse as to gender identity; and\n(3) members diverse as to age and ability.\n(c) If there is a vacancy, the appointing authority who selected the vacating member must make an interim appointment to expire at the end of the vacating member's term.\n(d) A member may continue to serve until the member's successor is appointed, but a member may not serve more than eight years in total.\n(a) The commission must biennially elect one of its members as chair and one as vice-chair. The chair serves as the board's secretary.\n(b) Each commission member must be:\n(1) compensated at a rate of $150 for each day or part of the day spent on commission activities; and\n(2) reimbursed for all reasonable expenses actually paid or incurred by the member while performing official duties.\n(c) Beginning January 1, 2025, and annually thereafter, the board may set a new per diem rate for commission members, not to exceed an amount ten percent higher than the previous year's rate.\n(a) The board must appoint a commission executive director knowledgeable about clemency and criminal justice. The executive director serves at the pleasure of the board in the unclassified service as an executive branch employee.\n(b) The executive director may obtain office space and supplies and hire administrative staff necessary to carry out the commission's official functions, including providing administrative support to the board and attending board meetings. Any additional staff serve in the unclassified service at the pleasure of the executive director.",
	"repealed": false
}