{
	"id": "65A.3025",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.3025",
	"title": "65A.3025 CONDOMINIUM AND TOWNHOUSE POLICIES; COORDINATION OF BENEFITS FOR LOSS ASSESSMENT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Assessable loss\" means a covered loss under the terms of a policy governed by subdivision 2, paragraph (a) or (b).\n(c) \"Association\" has the meaning given in section 515B.1-103, clause (4).\n(d) \"Unit owner\" has the meaning given in section 515B.1-103, clause (37).\n(a) If a loss assessment is charged by an association to an individual unit owner, the insurance policy in force at the time of the assessable loss must pay the loss assessment, subject to the limits provided in the policy, notwithstanding any policy provisions regarding when loss assessment coverage accrues, and subject to any other terms, conditions, and exclusions in the policy, if the following conditions are met:\n(1) the unit owner at the time of the assessable loss is the owner of the property listed on the policy at the time the loss assessment is charged;\n(2) the insurance policy in force at the time of the assessable loss provides loss assessment coverage; and\n(3) a loss assessment and the event or occurrence which triggers a loss assessment shall be considered a single loss for underwriting and rating purposes.\n(b) If a loss assessment is charged by an association to an individual unit owner, the insurance policy in force at the time the loss assessment is charged must pay the assessment, subject to the limits provided in the policy, notwithstanding any policy provisions regarding when loss assessment coverage accrues, and subject to any other terms, conditions, and exclusions in the policy, if the following conditions are met:\n(1) the unit owner at the time of the loss assessment is charged is different than the unit owner at the time of the assessable loss; and\n(2) the insurance policy in force at the time the loss assessment is charged provides loss assessment coverage.\n(c) For a loss assessment under paragraph (b), an insurer may require evidence documenting that the transfer of ownership occurred prior to the assessment before the insurer affords coverage.",
	"repealed": false
}