{
	"id": "246.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.34",
	"title": "246.34 REINTERMENT.",
	"text": "The executive board must comply with all provisions of this section to exhume the body of any person now buried in a cemetery situated on the land belonging to the state for public institution purposes and reinter the remains in a cemetery created under the provisions of section 246.33.\n(a) The executive board shall petition the district court of the county where the present cemetery is located for an order authorizing the reinterment of a person under subdivision 1. The petition must set forth the reasons for reinterment of the person and the proposed location for the reinterment of the person.\n(b) Upon the filing of a petition under paragraph (a), the court must issue an order for a hearing setting the location, date, and time of a hearing on the petition. The court must set the hearing date at least 60 days after the order for hearing.\n(c) The executive board shall serve the nearest relative or, if the executive board cannot locate any relative, some friend of the person whose body is to be exhumed by mailing a copy of the petition and court's order for hearing to the relative at least 30 days before the date of hearing and filing an affidavit of mailing with the court administrator of district court. If the executive board is unable to locate a relative, the executive board shall make an affidavit to that effect and file the affidavit with the court administrator of district court.\n(a) Upon the hearing of the petition, if the court determines that it is for the best interests of the public and the relatives and friends of the person to be exhumed and reinterred, the court shall issue an order authorizing the exhumation. The order must set forth the time within which the exhumation must occur and the place to which the person is to be reinterred.\n(b) Upon completion of the exhumation, the head of the institution or a designee shall document in the register required by section 246.33, subdivision 6, paragraph (b), the name of the person exhumed and the number of the lot in the cemetery in which the person was reinterred and file an affidavit containing that information with the court administrator of district court.",
	"repealed": false
}