{
	"id": "336.9-611",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-611",
	"title": "336.9-611 NOTIFICATION BEFORE DISPOSITION OF COLLATERAL.",
	"text": "(a) Notification date. In this section, \"notification date\" means the earlier of the date on which:\n(1) a secured party sends to the debtor and any secondary obligor a signed notification of disposition; or\n(2) the debtor and any secondary obligor waive the right to notification.\n(b) Notification of disposition required. Except as otherwise provided in subsection (d), a secured party that disposes of collateral under section 336.9-610 shall send to the persons specified in subsection (c) a reasonable signed notification of disposition.\n(c) Persons to be notified. To comply with subsection (b), the secured party shall send a signed notification of disposition to:\n(1) the debtor;\n(2) any secondary obligor; and\n(3) if the collateral is other than consumer goods:\n(A) any other person from which the secured party has received, before the notification date, a signed notification of a claim of an interest in the collateral;\n(B) any other secured party or lienholder that, ten days before the notification date, held a security interest in or other lien on the collateral perfected by the filing of a financing statement that:\n(i) identified the collateral;\n(ii) was indexed under the debtor's name as of that date; and\n(iii) was filed in the office in which to file a financing statement against the debtor covering the collateral as of that date; and\n(C) any other secured party that, ten days before the notification date, held a security interest in the collateral perfected by compliance with a statute, regulation, or treaty described in section 336.9-311 (a).\n(d) Subsection (b) inapplicable: perishable collateral; recognized market. Subsection (b) does not apply if the collateral is perishable or threatens to decline speedily in value or is of a type customarily sold on a recognized market.\n(e) Compliance with subsection (c)(3)(b). A secured party complies with the requirement for notification prescribed by subsection (c)(3)(B) if:\n(1) not later than 20 days or earlier than 30 days before the notification date, the secured party requests, in a commercially reasonable manner, information concerning financing statements indexed under the debtor's name in the office indicated in subsection (c)(3)(B); and\n(2) before the notification date, the secured party:\n(A) did not receive a response to the request for information; or\n(B) received a response to the request for information and sent a signed notification of disposition to each secured party named in that response whose financing statement covered the collateral.",
	"repealed": false
}