{
	"id": "502.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/502.84",
	"title": "502.84 EXTENT OF DONEE'S AUTHORITY TO APPOINT OR CONTRACT TO APPOINT AN ESTATE IN APPOINTIVE PROPERTY.",
	"text": "The scope of the donee's authority as to appointees and as to the time and manner of the appointment is unlimited except as the donor manifests a contrary intention.\nThe donee of a power of appointment which is presently exercisable, or of a postponed power which has become exercisable, can contract to make an appointment to the extent that the contract or the promised appointment does not confer a benefit upon a person who is not a permissible appointee under the power.\n(a) The donee of a power of appointment which is not presently exercisable, or of a postponed power which has not become exercisable, must not contract to make an appointment, except that this prohibition shall not apply if the donor and donee are the same person. A prohibited contract under this subdivision, if made, must not be the basis of an action for specific performance or damages, but the promisee may obtain restitution of the value given by the promisee for the promise unless the donee has exercised the power pursuant to the contract.\n(b) The provisions of this section do not abridge the ability of the donee of a power of appointment, which is not presently exercisable, to release the power pursuant to section 502.87, subdivision 2, except that where the donor designated persons or a class to take in default of the donee's exercise of the power, a release with respect to appointive property must serve to benefit all those so designated as provided by the donor.\nWith respect to real property subject to a power of appointment, the interest of a donee and any appointee has priority as against creditors, purchasers, or encumbrancers of the real property, or as against a person having an estate in the real property, only from the time at which the instrument creating the power is duly recorded, but only if the creditors, purchasers, encumbrancers, and estate holders act in good faith or without notice. As against all other persons, this interest has priority from the time at which the instrument creating the power takes effect.",
	"repealed": false
}