{
	"id": "260E.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.31",
	"title": "260E.31 REPORTING OF PRENATAL EXPOSURE TO CONTROLLED SUBSTANCES.",
	"text": "(a) Except as provided in paragraph (b), a person mandated to report under this chapter shall immediately report to the local welfare agency if the person knows or has reason to believe that a woman is pregnant and has used a controlled substance for a nonmedical purpose during the pregnancy, including but not limited to tetrahydrocannabinol, or has consumed alcoholic beverages during the pregnancy in any way that is habitual or excessive.\n(b) A health care professional or a social service professional who is mandated to report under this chapter is exempt from reporting under paragraph (a) if the professional is providing or collaborating with other professionals to provide the woman with prenatal care, postpartum care, or other health care services, including care of the woman's infant. If the woman does not continue to receive regular prenatal or postpartum care, after the woman's health care professional has made attempts to contact the woman, then the professional is required to report under paragraph (a).\n(c) Any person may make a voluntary report if the person knows or has reason to believe that a woman is pregnant and has used a controlled substance for a nonmedical purpose during the pregnancy, including but not limited to tetrahydrocannabinol, or has consumed alcoholic beverages during the pregnancy in any way that is habitual or excessive.\n(d) An oral report shall be made immediately by telephone or otherwise. An oral report made by a person required to report shall be followed within 72 hours, exclusive of weekends and holidays, by a report in writing to the local welfare agency. Any report shall be of sufficient content to identify the pregnant woman, the nature and extent of the use, if known, and the name and address of the reporter. The local welfare agency shall accept a report made under paragraph (c) notwithstanding refusal by a voluntary reporter to provide the reporter's name or address as long as the report is otherwise sufficient.\n(e) For purposes of this section, \"prenatal care\" means the comprehensive package of medical and psychological support provided throughout the pregnancy.\nUpon receipt of a report of prenatal exposure to a controlled substance required under subdivision 1, the local welfare agency shall immediately conduct an appropriate assessment and offer services indicated under the circumstances. Services offered may include but are not limited to a referral for substance use disorder assessment, a referral for substance use disorder treatment if recommended, and a referral for prenatal care. The local welfare agency may also take any appropriate action under chapter 253B, including seeking an emergency admission under section 253B.051. The local welfare agency shall seek an emergency admission under section 253B.051 if the pregnant woman refuses recommended voluntary services or fails recommended treatment.\nReports under this section are governed by sections 260E.05, 260E.06, 260E.34, and 260E.35.\nFor purposes of this section and section 260E.32, \"controlled substance\" means a controlled substance listed in section 253B.02, subdivision 2.",
	"repealed": false
}