{
	"id": "60K.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.38",
	"title": "60K.38 LICENSE.",
	"text": "(a) Unless denied a license under section 60K.43, a person who has met the requirements of sections 60K.36 and 60K.37 must be issued an insurance producer license. An insurance producer may receive qualification for a license in one or more of the lines of authority in paragraphs (b) and (c).\n(b) An individual insurance producer may receive qualification for a license in one or more of the following major lines:\n(1) life insurance: coverage on human lives including benefits of endowment and annuities, and may include benefits in the event of death or dismemberment by accident and benefits for disability income;\n(2) accident and health or sickness insurance: coverage for sickness, bodily injury, or accidental death, and may include benefits for disability income;\n(3) property insurance: coverage for the direct or consequential loss or damage to property of every kind;\n(4) casualty insurance: coverage against legal liability, including that for death, injury, or disability, or damage to real or personal property;\n(5) variable life and variable annuity products insurance: coverage provided under variable life insurance contracts and variable annuities; and\n(6) personal lines: property and casualty insurance coverage sold to individuals and families for primarily noncommercial purposes.\n(c) An individual insurance producer may receive qualification for a license in one or more of the following limited lines:\n(1) limited line credit insurance;\n(2) farm property and liability insurance;\n(3) title insurance;\n(4) travel insurance; and\n(5) bail bonds.\nAn insurance producer license remains in effect unless revoked or suspended as long as the fee set forth in section 60K.55 is paid, continuing education requirements for resident individual producers are met, and all additional documentation required by the commissioner is provided by the renewal date.\nAn individual insurance producer who allows the license to lapse may, within 12 months from the due date of the renewal fee, reinstate the license without the necessity of passing a written examination. However, a penalty in the amount of twice the unpaid renewal fee must be paid by the individual for any renewal fee received after the due date.\nA licensed insurance producer who is unable to comply with license renewal procedures due to military service or some other extenuating circumstance, such as a long-term medical disability, may request a waiver of those procedures. The producer may also request a waiver of any examination requirement or any other fine or sanction imposed for failure to comply with renewal procedures.\nThe license must contain the licensee's name, address, producer license number, and the date of issuance, the lines of authority, the expiration date, and any other information the commissioner considers necessary.\nLicensees shall inform the commissioner, by any means acceptable to the commissioner, of a change of name or address within ten days of the change.\nIn order to assist in the performance of the commissioner's duties, the commissioner may contract with nongovernmental entities, including the National Association of Insurance Commissioners (NAIC) or any affiliates or subsidiaries that the NAIC oversees, to perform any ministerial functions, including the collection of fees, related to producer licensing that the commissioner and the nongovernmental entity consider appropriate.",
	"repealed": false
}