{
	"id": "15C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/15C.01",
	"title": "15C.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms in this section have the meanings given them.\n\"Claim\" includes a request or demand, whether under a contract or otherwise, for money or property and whether or not the state or a political subdivision has title to the money or property, that:\n(1) is presented to an officer, employee, or agent of the state or a political subdivision; or\n(2) is made to a contractor, grantee, or other recipient if the money or property is to be spent or used on behalf of the state or the political subdivision or to advance the state's or political subdivision's program or interest, and if the state or political subdivision provides or has provided a portion of the money or property that is requested or demanded, or if the state or the political subdivision has reimbursed or will reimburse the contractor, grantee, or other recipient for a portion of the money or property that is requested or demanded.\nClaim does not include requests or demands for money or property that the state or a political subdivision has paid to an individual as compensation for state or political subdivision employment, or as an income subsidy with no restrictions on that individual's use of the money or property.\n\"Knowing\" and \"knowingly\" mean that a person, with respect to information:\n(1) has actual knowledge of the information;\n(2) acts in deliberate ignorance of the truth or falsity of the information; or\n(3) acts in reckless disregard of the truth or falsity of the information.\nNo proof of specific intent to defraud is required, but in no case is a person who acts merely negligently, inadvertently, or mistakenly with respect to information deemed to have acted knowingly.\n\"Material\" means having a natural tendency to influence, or be capable of influencing, the payment or receipt of money or property.\n\"Obligation\" means an established duty, whether or not fixed, arising from an express or implied contractual, grantor-grantee, or licensor-licensee relationship from a fee-based or similar relationship, from statute or regulation, or from the retention of any overpayment.\n\"Original source\" means a person who either:\n(1) prior to a public disclosure under section 15C.05, paragraph (f), has voluntarily disclosed to the state or a political subdivision the information on which allegations or transactions in a claim are based; or\n(2) has knowledge that is independent of and materially adds to the publicly disclosed allegations or transactions, and has voluntarily provided the information to the state or a political subdivision before filing an action under this chapter.\n\"Person\" means a natural person, partnership, corporation, association or other legal entity but does not include the state or a political subdivision.\n\"Political subdivision\" means a political subdivision of the state and includes a department or agency of a political subdivision.\n\"Prosecuting attorney\" means:\n(1) the attorney general, if the false or fraudulent claim involves money, property, or services provided by the state; or\n(2) the county attorney, city attorney, or other attorney representing a political subdivision, if the false or fraudulent claim involves money, property, or services provided by the political subdivision.\n\"State\" means the state of Minnesota and includes a department or agency of the state.",
	"repealed": false
}