{
	"id": "204B.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.18",
	"title": "204B.18 POLLING PLACES; EQUIPMENT.",
	"text": "(a) Each polling place must contain a number of voting booths or voting stations in proportion to the number of individuals eligible to vote in the precinct. The booth or station shall permit the voter to vote privately and independently.\n(b) Each polling place must have at least one accessible voting booth or other accessible voting station and beginning with federal and state elections held after December 31, 2005, and county, municipal, and school district elections held after December 31, 2007, one voting system that conforms to section 301(a)(3)(B) of the Help America Vote Act, Public Law 107-252.\n(c) Local jurisdictions must make accessible voting stations purchased with funds provided from the Help America Vote Act account available to other local jurisdictions holding stand-alone elections. The jurisdiction providing the equipment may require the jurisdiction using the equipment to reimburse any direct actual costs incurred as a result of the equipment's use and any prorated indirect costs of maintaining and storing the equipment. A rental or other similar use fee may not be charged.\nAny funds received under this paragraph for expenses incurred by that local jurisdiction as a direct result of making the equipment available that were not paid for in whole or in part with funds from the Help America Vote Act account are not program income under the Help America Vote Act, Public Law 107-252.\nAny funds received by a local jurisdiction making the equipment available as reimbursement for expenses as defined as \"operating costs\" under Laws 2005, chapter 162, section 34, subdivision 1, paragraph (b), and paid for in whole or in part with funds from the Help America Vote Act account must be treated as program income and deposited into the jurisdiction's Help America Vote Act account in the direct proportion that funds from the Help America Vote Act account were used to pay for those \"operating costs.\"\n(d) All booths or stations must be constructed so that a voter is free from observation while marking ballots. During the hours of voting, the booths or stations must have instructions, a pen or other marking device suitable for the voting system being used, and other supplies needed to mark the ballots. A chair must be provided for elderly voters and voters with disabilities to use while voting or waiting to vote. Stable flat writing surfaces must also be made available to voters who are completing election-related forms.\n(e) All ballot boxes, voting booths, voting stations, and election judges must be in open public view in the polling place.\n(f) The jurisdiction providing supplies must only provide pens or marking devices suitable for the voting system being used.\nEach box shall be of sufficient size and shall have a sufficient opening to receive and contain all the ballots likely to be deposited in it.",
	"repealed": false
}