{
	"id": "47.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.60",
	"title": "47.60 CONSUMER SMALL LOANS.",
	"text": "For purposes of this section, the terms defined have the meanings given them:\n(a) \"Consumer small loan\" is a loan transaction in which cash is advanced to a borrower for the borrower's own personal, family, or household purpose. A consumer small loan is a short-term, unsecured loan to be repaid in a single installment. The cash advance of a consumer small loan is equal to or less than $350. A consumer small loan includes an indebtedness evidenced by but not limited to a promissory note or agreement to defer the presentation of a personal check for a fee.\n(b) \"Consumer small loan lender\" is a financial institution as defined in section 47.59 or a business entity registered with the commissioner and engaged in the business of making consumer small loans.\n(c) \"Annual percentage rate\" means a measure of the cost of credit, expressed as a yearly rate, that relates the amount and timing of value received by the consumer to the amount and timing of payments made. Annual percentage rate includes all interest, finance charges, and fees. The annual percentage rate must be determined in accordance with either the actuarial method or the United States Rule method.\n(a) In connection with a consumer small loan, a consumer small loan lender may charge an annual percentage rate of up to 50 percent. No other charges or payments are permitted or may be received by the lender in connection with a consumer small loan.\n(b) The term of a loan made under this section shall be for no more than 30 calendar days.\n(c) After maturity, the contract rate must not exceed 2.75 percent per month of the remaining loan proceeds after the maturity date calculated at a rate of 1/30 of the monthly rate in the contract for each calendar day the balance is outstanding.\n(d) No insurance charges or other charges must be permitted to be charged, collected, or imposed on a consumer small loan except as authorized in this section.\n(e) On a loan transaction in which cash is advanced in exchange for a personal check, a return check charge may be charged as authorized by section 604.113, subdivision 2, paragraph (a). The civil penalty provisions of section 604.113, subdivision 2, paragraph (b), may not be demanded or assessed against the borrower.\n(f) A loan made under this section must not be repaid by the proceeds of another loan made under this section by the same lender or related interest. The proceeds from a loan made under this section must not be applied to another loan from the same lender or related interest. No loan to a single borrower made pursuant to this section shall be split or divided and no single borrower shall have outstanding more than one loan with the result of collecting a higher charge than permitted by this section or in an aggregate amount of principal exceed at any one time the maximum of $350.\n(g) A loan made under this section with an annual percentage rate that exceeds 36 percent must comply with section 47.603.\nBefore a business entity other than a financial institution as defined by section 47.59 engages in the business of making consumer small loans to Minnesota residents, the business entity shall file with the commissioner as a consumer small loan lender. The filing must be on a form prescribed by the commissioner together with a fee of $250 for each place of business and contain the following information in addition to the information required by the commissioner:\n(1) evidence that the filer has available for the operation of the business at the location specified, liquid assets of at least $50,000; and\n(2) a biographical statement on the principal person responsible for the operation and management of the business to be certified.\nRevocation of the filing is the same as in the case of a regulated lender license in section 56.09.\nFor purposes of this subdivision, \"business entity\" includes one that does not have a physical location in Minnesota that makes a consumer small loan electronically via the Internet.\n(a) A lender filing under subdivision 3 shall keep and use in the business books, accounts, and records as will enable the commissioner to determine whether the filer is complying with this section.\n(b) A lender filing under subdivision 3 shall annually on or before March 15 file a report to the commissioner giving the information the commissioner reasonably requires concerning the business and operations during the preceding calendar year, including the information required to be reported under section 47.601, subdivision 4.\n(c) A lender filing under subdivision 3 shall display prominently in each place of business a full and accurate schedule, to be approved by the commissioner, of the charges to be made and the method of computing those charges. A lender shall furnish a copy of the contract of loan to a person obligated on it or who may become obligated on it at any time upon the request of that person. This is in addition to any disclosures required by the federal Truth in Lending Act, United States Code, title 15.\n(d) A lender filing under subdivision 3 shall, upon repayment of the loan in full, mark indelibly every obligation signed by the borrower with the word \"Paid\" or \"Canceled\" within 20 days after repayment.\n(e) A lender filing under subdivision 3 shall display prominently, in each licensed place of business, a full and accurate statement of the charges to be made for loans made under this section. The statement of charges must be displayed in a notice, on plastic or other durable material measuring at least 12 inches by 18 inches, headed \"CONSUMER NOTICE REQUIRED BY THE STATE OF MINNESOTA.\" The notice shall include, immediately above the statement of charges, the following sentence, or a substantially similar sentence approved by the commissioner: \"These loan charges are higher than otherwise permitted under Minnesota law. Minnesota law permits these higher charges only because short-term small loans might otherwise not be available to consumers. If you have another source of a loan, you may be able to benefit from a lower interest rate and other loan charges.\" The notice must not contain any other statement or information, unless the commissioner has determined that the additional statement or information is necessary to prevent confusion or inaccuracy. The notice must be designed with a type size that is large enough to be readily noticeable and legible. The form of the notice must be approved by the commissioner prior to its use.\nA person obligated to or having been obligated to a consumer small loan lender filing under subdivision 3 and having reason to believe that this section has been violated may file with the commissioner a written complaint setting forth the details of the alleged violation. The commissioner, upon receipt of the complaint, may inspect the pertinent books, records, letters, and contracts of the lender and borrower involved. The commissioner may assess against the lender a fee covering the necessary costs of an investigation under this section. The commissioner may maintain an action for the recovery of the costs in a court of competent jurisdiction.\nA person who violates or participates in the violation of any of the provisions of this section is liable in the same manner as in section 47.601, subdivision 6.\nSection 58A.04, subdivisions 2 and 3, apply to this section.\n(a) A person must not engage in any device, subterfuge, or pretense to evade the requirements of this section, including but not limited to:\n(1) making loans disguised as a personal property sale and leaseback transaction;\n(2) disguising loan proceeds as a cash rebate for the pretextual installment sale of goods or services; or\n(3) making, offering, assisting, or arranging for a debtor to obtain a loan with a greater rate or amount of interest, consideration, charge, or payment than is permitted by this section through any method, including mail, telephone, Internet, or any electronic means, regardless of whether a person has a physical location in Minnesota.\n(b) A person is a consumer small loan lender subject to the requirements of this section notwithstanding the fact that a person purports to act as an agent or service provider, or acts in another capacity for another person that is not subject to this section, if a person:\n(1) directly or indirectly holds, acquires, or maintains the predominant economic interest, risk, or reward in a loan or lending business; or\n(2) both: (i) markets, solicits, brokers, arranges, or facilitates a loan; and (ii) holds or holds the right, requirement, or first right of refusal to acquire loans, receivables, or other direct or interest in a loan.\n(c) A person is a consumer small loan lender subject to the requirements of this section if the totality of the circumstances indicate that a person is a lender and the transaction is structured to evade the requirements of this section. Circumstances that weigh in favor of a person being a lender in a transaction include but are not limited to instances where a person:\n(1) indemnifies, insures, or protects a person not subject to this section from any costs or risks related to a loan;\n(2) predominantly designs, controls, or operates lending activity;\n(3) holds the trademark or intellectual property rights in the brand, underwriting system, or other core aspects of a lending business; or\n(4) purports to act as an agent or service provider, or acts in another capacity, for a person not subject to this section while acting directly as a lender in one or more states.",
	"repealed": false
}