{
	"id": "144.4167",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4167",
	"title": "144.4167 PERMITTED SMOKING.",
	"text": "Smoking by participants in peer reviewed scientific studies related to the health effects of smoking may be allowed in a separated room ventilated at a rate of 60 cubic feet per minute per person pursuant to a policy that is approved by the commissioner and is established by the administrator of the program to minimize exposure of nonsmokers to smoke.\nSections 144.414 to 144.417 do not prohibit smoking by a Native American as part of a traditional Native American spiritual or cultural ceremony. For purposes of this section, a Native American is a person who is a member of an Indian tribe as defined in section 260.755, subdivision 12.\nExcept as provided in section 144.414, subdivision 2, nothing in sections 144.411 to 144.417 prohibits smoking in:\n(1) private homes, private residences, or private automobiles when they are not in use as a place of employment, as defined in section 144.413, subdivision 1b; or\n(2) a hotel or motel sleeping room rented to one or more guests.\nSections 144.414 to 144.417 do not prohibit the lighting, heating, or activation of tobacco in a tobacco products shop by a customer or potential customer for the specific purpose of sampling tobacco products. For the purposes of this subdivision, a tobacco products shop is a retail establishment that has an entrance door opening directly to the outside, that cannot be entered at any time by persons younger than 21 years of age, and that derives more than 90 percent of its gross revenue from the sale of tobacco, tobacco-related devices, and electronic delivery devices, as defined in section 609.685, and in which the sale of other products is merely incidental. \"Tobacco products shop\" does not include a tobacco department or section of any individual business establishment with any type of liquor, food, or restaurant license.\nSections 144.414 to 144.417 do not prohibit smoking in the cabs of motor vehicles registered under section 168.013, subdivision 1e, with a total gross weight of 26,001 pounds or greater.\nSections 144.414 to 144.417 do not prohibit smoking in farm trucks, as defined in section 168.002, subdivision 8; implements of husbandry, as defined in section 168A.01, subdivision 8; and special mobile equipment, as defined in section 168.002, subdivision 31. This subdivision applies to farm trucks, implements of husbandry, and special mobile equipment, when being used for their intended purposes.\nSections 144.414 to 144.417 do not prohibit smoking in the house, garage, barns, and other buildings on a family farm that meet the following criteria: (1) the family farm is engaged in farming, as defined in section 500.24, subdivision 2, paragraph (a); (2) the family farm meets the definition of family farm under section 500.24, subdivision 2, paragraph (b), (c), (j), or (l); and (3) the family farm employs two or fewer persons who are not family members.\nSections 144.414 to 144.417 do not prohibit smoking in the disabled veterans rest camp located in Washington County, established as of January 1, 2007.\nSections 144.414 to 144.417 do not prohibit smoking by actors and actresses as part of a theatrical performance conducted in compliance with section 366.01. Notice of smoking in a performance shall be given to theater patrons in advance and shall be included in performance programs.",
	"repealed": false
}