{
	"id": "125A.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.69",
	"title": "125A.69 ADMISSION STANDARDS.",
	"text": "Admission to the Minnesota State Academies is described in this section.\n(a) A pupil who is deaf, hard-of-hearing, or deafblind, may be admitted to the Academy for the Deaf. A pupil who is blind or visually impaired, deafblind, or multiply disabled may be admitted to the Academy for the Blind. For a pupil to be admitted, two decisions must be made under sections 125A.03 to 125A.24 and 125A.65.\n(1) It must be decided by the individualized education program team that education in regular or special education classes in the pupil's district of residence cannot be achieved satisfactorily because of the nature and severity of the deafness or blindness or visual impairment respectively.\n(2) It must be decided by the individualized education program team that the academy provides the most appropriate placement within the least restrictive alternative for the pupil.\n(b) A deaf or hard-of-hearing child or a visually impaired pupil may be admitted to get socialization skills or on a short-term basis for skills development.\n(c) A parent of a child who resides in Minnesota and who meets the disability criteria for being deaf or hard-of-hearing, blind or visually impaired, or multiply disabled may apply to place the child in the Minnesota State Academies. Academy staff must review the application to determine whether the Minnesota State Academies is an appropriate placement for the child. If academy staff determine that the Minnesota State Academies is an appropriate placement, the staff must invite the individualized education program team at the child's resident school district to participate in a meeting to arrange a trial placement of between 60 and 90 calendar days at the Minnesota State Academies. If the child's parent consents to the trial placement, the Minnesota State Academies is the responsible serving school district and incurs all due process obligations under law, and the child's resident school district is responsible for any transportation included in the child's individualized education program during the trial placement. Before the trial placement ends, academy staff must convene an individualized education program team meeting to determine whether to continue the child's placement at the Minnesota State Academies or that another placement is appropriate. If the academy members of the individualized education program team and the parent are unable to agree on the child's placement, the child's placement reverts to the placement in the child's individualized education program that immediately preceded the trial placement. If the parent and individualized education program team agree to continue the placement beyond the trial period, the transportation and due process responsibilities are the same as those described for the trial placement under this paragraph.\nThis section does not prevent a pupil with disabilities in addition to being\n(1) deaf or hard-of-hearing, or\n(2) blind or visually impaired\nfrom attending the Academy for the Deaf or the Academy for the Blind, respectively.\nAn applicant from another state who can benefit from attending either academy may be admitted to the academy if the admission does not prevent an eligible Minnesota resident from being admitted. The board of the Minnesota State Academies must obtain reimbursement from the other state for the costs of the out-of-state admission. The state board may enter into an agreement with the appropriate authority in the other state for the reimbursement. Money received from another state must be deposited in the special revenue fund and credited to the general operating account of the academies. The money is appropriated to the academies.\nThe compulsory attendance provisions of section 120A.22 apply to attendance at the academies. Attendance may be excused under that section by the commissioner of education or a designee. A person who fails to comply with section 120A.22 is subject to section 120A.26. The academies' administrator must exercise the duties imposed on a superintendent by section 120A.26. Attendance at the Academy for the Deaf or the Academy for the Blind fulfills the requirements of sections 125A.03 to 125A.24 and 125A.65. The academies are subject to sections 121A.40 to 121A.45, the Pupil Fair Dismissal Act of 1970, as amended.",
	"repealed": false
}