{
	"id": "136A.821",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.821",
	"title": "136A.821 DEFINITIONS.",
	"text": "The following words, terms and phrases shall have the meanings ascribed to them in this section.\n\"Office of Higher Education\" or \"office\" means the Minnesota Office of Higher Education.\n\"Solicitor\" means a person who for a salary or for commission, acts as an agent, independent contractor, salesperson, or counselor in recruiting students for a program using any method, at any place except on the actual business premises of the private career school, other than only providing public information at the invitation or permission of a private career school or educational organization.\n\"Person\" means any individual, partnership, company, firm, society, trust, association, or corporation or any combination thereof.\n\"Private career school\" means a person who maintains a physical presence for any program at less than an associate degree level; is not registered as a private institution under sections 136A.61 to 136A.71; and is not specifically exempted by section 136A.833.\n\"Course\" means any classroom or distance instruction; any subunit of a program; or any combination thereof.\n\"Multiple location\" means any site where classes or administrative services are provided to students and that has a street address that is different than the street address found on the private career school's license.\n\"Placement service\" means a service offered or advertised by a private career school for the purpose of assisting the student in obtaining employment.\n\"Program\" means any course or grouping of courses that is advertised or listed in a private career school's catalog, brochures, electronic display, or other publications, or for which the private career school grants a formal recognition.\n\"Distance education private career school\" means a private career school that establishes, keeps, or maintains a facility or location where a program is offered through distance instruction.\n\"Distance instruction\" means any method of instruction outside the traditional in-classroom instruction, including, but not limited to, the use of the United States mail and other correspondence; Internet and other online computer-based education; or CD-ROM self-instruction.\n\"Electronic display\" means text, images, or sound rendered via any electronic device designed to present information, whether generated by the device or transmitted from another source.\n\"Compliance audit\" means an audit of a school's compliance with federal requirements related to its participation in federal Title IV student aid programs or other federal grant programs performed under either Uniform Grant Guidance, including predecessor Federal Circular A-133, or the United States Department of Education's audit guide, Audits of Federal Student Financial Assistance Programs at Participating Institutions and Institution Servicers.\n\"Entity\" means a specific school or campus location.\n\"Higher-level entity\" means a corporate parent or ultimate parent company or, in the case of a public school, the larger public system of which an entity is a part.\n\"Audited financial statements\" means the financial statements of an entity or higher-level entity that have been examined by a certified public accountant or an equivalent government agency for public entities that include (1) an auditor's report, a statement of financial position, an income statement, a statement of cash flows, and notes to the financial statements or (2) the required equivalents for public entities as determined by the Financial Accounting Standards Board, the Governmental Accounting Standards Board, or the Securities and Exchange Commission.\n\"Review-level engagement\" means a service performed by a certified public accountant that provides limited assurance that there are no material modifications that need to be made to an entity's financial statements in order for them to conform to generally accepted accounting principles. Review-level engagement provides fewer assurances than those reported under audited financial statements.\n\"Clock hour\" means a period of time consisting of a 50- to 60-minute class, lecture, or recitation in a 60-minute period; a 50- to 60-minute faculty-supervised laboratory, shop training, or internship in a 60-minute period; or 60 minutes of preparation in a correspondence course. If a school seeks to determine the number of clock hours in an educational program by aggregating the number of minutes in that program, it must divide those minutes by 60.\n\"Student record\" means a transcript or record of student attendance in a program that includes, at a minimum, the student's name, the student's address, the school's name, the school's address, the title of the course or program, the total number of hours or courses completed, the dates of enrollment and attendance, the grade record of each course, any credential awarded, and the cumulative grade for the program.\n\"Physical presence\" means presence within the state of Minnesota for the purpose of conducting activity related to any program at less than an associate degree level. Physical presence includes:\n(1) operating a location within the state;\n(2) offering instruction within or originating from Minnesota designed to impart knowledge with response utilizing teachers, trainers, counselors or computer resources, computer linking, or any form of electronic means;\n(3) granting an educational credential from a location within the state or to a student within the state; and\n(4) using an agent, recruiter, institution, or business that solicits for enrollment or credits or for the award of an educational credential.\nPhysical presence does not include field trips, sanctioned sports recruiting activities, or college fairs or other assemblies of schools in Minnesota. No school may enroll an individual, allow an individual to sign any agreement obligating the person to the school, accept any moneys from the individual, or follow up with an individual by means of an in-person meeting in Minnesota at a college fair or assembly.",
	"repealed": false
}