{
	"id": "477A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.24",
	"title": "477A.24 ELECTRIC GENERATION TRANSITION AID.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Electric generating unit\" means a single generating unit at an electric generating plant powered by coal, nuclear, or natural gas.\n(c) \"Electric generation property\" means taxable property of an electric generating plant owned by a public utility, as defined in section 216B.02, subdivision 4, that is powered by coal, nuclear, or natural gas and located in an eligible taxing jurisdiction.\n(d) \"Eligible taxing jurisdiction\" means a county, home rule charter or statutory city, town, or school district.\n(e) \"Unit base year\" means the assessment year in which the assessed value of electric generation property is reduced due to the retirement of the electric generating unit.\n(f) \"Unit differential\" means (1) the tax capacity of electric generation property in the assessment year preceding the unit base year, minus (2) the tax capacity of electric generation property in the unit base year. The unit differential may not be less than zero. The unit differential equals zero if the tax capacity of electric generation property in the eligible taxing jurisdiction in the assessment year preceding the unit base year is less than four percent of the total net tax capacity of the eligible taxing jurisdiction in that year, as adjusted under section 473F.08, subdivision 2, or 276A.06, subdivision 2, as applicable, except that, in an eligible taxing jurisdiction with multiple electric generating units, only the unit differential calculated upon the first retirement of an electric generating unit in that jurisdiction following the effective date of this section is subject to the reduction under this sentence.\nNotwithstanding the requirements of Minnesota Rules, chapter 8100, a public utility must notify the commissioner when the public utility expects to retire an electric generating unit and remove that unit from the property tax base. The notification must be in the form and manner determined by the commissioner, include information required by the commissioner to calculate transition aid under this section, and be filed together with the reports required under section 273.371.\n(a) The initial unit transition amount equals the product of (1) the unit differential, times (2) the jurisdiction's tax rate for taxes payable in the unit base year.\n(b) The unit transition amount for the year following the unit base year, or in the year as provided under subdivision 7, equals the initial unit transition amount. Unit transition amounts in subsequent years must be reduced each year by an amount equal to five percent of the initial unit transition amount. If the unit transition amount attributable to any unit is less than $5,000 in any year, the unit transition amount for that unit equals zero.\nElectric generation transition aid for an eligible taxing jurisdiction equals the sum of the unit transition amounts for that jurisdiction.\n(a) Notwithstanding subdivision 4, beginning for aid in the year after the year in which the jurisdiction first qualified for aid, aid for an eligible taxing jurisdiction equals zero if the commissioner determines that the eligible taxing jurisdiction's total net tax capacity in the assessment year preceding the aid calculation year is greater than the product of:\n(1) 90 percent of the jurisdiction's total net tax capacity in the assessment year preceding the aid calculation year in which the jurisdiction first qualified for aid under this section; times\n(2) the greater of one or the ratio of (i) the statewide total net tax capacity of real and personal property in the assessment year preceding the aid calculation year to (ii) the statewide total net tax capacity of real and personal property in the assessment year preceding the aid calculation year in which the jurisdiction first qualified for aid under this section.\n(b) For the purposes of this subdivision, \"net tax capacity\" means net tax capacity as adjusted under section 473F.08, subdivision 2, or 276A.06, subdivision 2, as applicable.\n(c) If aid to a jurisdiction attributable to a previous unit retirement has been eliminated under this subdivision, the jurisdiction may qualify for aid under this section for subsequent unit retirements.\n(a) The commissioner of revenue shall compute the amount of electric generation transition aid payable to each jurisdiction under this section. The portion of aid to an eligible taxing jurisdiction that consists of the initial unit transition amount under subdivision 3, paragraph (a), must be certified on or before May 1 in the year the aid is payable. The portion of aid to an eligible taxing jurisdiction that consists of the unit transition amount under subdivision 3, paragraph (b), must be certified by August 1 of each year for aids payable in the following calendar year. The commissioner shall pay aid to each jurisdiction other than school districts annually at the times provided in section 477A.015. Aids to school districts must be certified to the commissioner of education and paid under section 273.1392.\n(b) The commissioner of revenue may require counties to provide any data that the commissioner deems necessary to administer this section.\nAn electric generating unit with a unit base year after 2016 but before 2023 must be counted for the purpose of calculating aid under this section. For a unit eligible to be counted under this subdivision and for the purpose of the schedule of amounts under subdivision 3, paragraph (b), the unit base year is 2023.\nAn amount sufficient to make the aid payments required by this section to eligible taxing jurisdictions other than school districts is annually appropriated from the general fund to the commissioner of revenue. An amount sufficient to make the aid payments required by this section for school districts is annually appropriated from the general fund to the commissioner of education.",
	"repealed": false
}