{
	"id": "353.028",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.028",
	"title": "353.028 CITY MANAGERS; ELECTION; DEFERRED COMPENSATION.",
	"text": "(a) For purposes of this section, each of the terms in this subdivision has the meaning indicated.\n(b) \"City manager\" means:\n(1) a person who is duly appointed to and is holding the position of city manager in a Plan B statutory city or in a home rule city operating under the \"council-manager\" form of government; or\n(2) a person who is appointed to and is holding the position of chief administrative officer of a home rule charter city or a statutory city under a charter provision, ordinance, or resolution establishing such a position and prescribing its duties and responsibilities.\n(c) \"Governing body\" means the city council of the city employing the city manager.\n(d) \"Election\" means the election described in subdivision 2.\n(e) \"First employed\" means a city manager employed by a city who, prior to employment as a city manager, has not been an employee in any position covered by any retirement plan administered by the association to which the city contributed or by any supplemental pension or deferred compensation plan under section 356.24 sponsored by the city.\n(a) A city manager first employed by a city may make a onetime, irrevocable election to be excluded from membership in the general employees retirement plan of the association. The election of exclusion must be made within 30 days following the commencement of employment, must be made in writing on a form prescribed by the executive director, and must be approved by a resolution adopted by the governing body of the city. The election of exclusion is not effective until it is filed with the executive director. Membership of a city manager in the general employees retirement plan ceases on the date the written election is received by the executive director. Employee and employer contributions made during the first 30 days of employment on behalf of a person exercising the option to be excluded from membership under this paragraph must be refunded or credited in accordance with section 353.27, subdivision 7.\n(b) A city manager who has previously been an employee in any position covered by any retirement plan administered by the association to which the city contributed or by any supplemental pension or deferred compensation plan under section 356.24 sponsored by the city is not eligible to make the election under paragraph (a).\n(c) Any election under paragraph (a) must include a statement that the individual will not seek authorization to purchase service credit for any period of excluded service.\n(a) If an election of exclusion under subdivision 2 is made, and if the city manager and the governing body of the city additionally agree in writing that the additional compensation is to be deferred and is to be contributed on behalf of the city manager to a deferred compensation program that meets the requirements of section 457 of the Internal Revenue Code of 1986, as amended, and section 356.24, the governing body may compensate the city manager, in addition to the salary allowed under any limitation imposed on salaries by law or charter, in an amount equal to the employer contribution that would be required by section 353.27, subdivision 3, if the city manager were a member of the general employees retirement plan.\n(b) Alternatively, if an election of exclusion under subdivision 2 is made, the city manager and the governing body of the city may agree in writing that the equivalent employer contribution to the contribution under section 353.27, subdivision 3, be contributed by the city to the defined contribution plan of the Public Employees Retirement Association under chapter 353D. Any agreement under this paragraph must be entered into within 30 days following the commencement of employment.\nA city manager who makes an election to be excluded from membership is entitled to a refund of accumulated deductions or, if otherwise qualified, a deferred annuity under section 353.34, at the option of the manager.\nIf a city manager who has made an election to be excluded under subdivision 2 subsequently accepts employment in another governmental subdivision or in a position other than as a city manager in the same city, the election is rescinded on the effective date of employment.",
	"repealed": false
}