{
	"id": "484.843",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.843",
	"title": "484.843 ABANDONMENT OF NONFELONY BAIL; DISPOSITION OF FORFEITED SUMS; FOURTH JUDICIAL DISTRICT.",
	"text": "(a) Any bail deposited with the court administrator of the Fourth Judicial District on a nonfelony case and not forfeited by court order shall be deemed abandoned and forfeited if the person entitled to refund does not file a written demand for refund with the court administrator within six months from the date when the person became entitled to the refund.\n(b) Any judge may order any sums so forfeited under paragraph (a) to be reinstated for cause and the court administrator shall then refund accordingly. The receipting municipality or subdivision of government shall reimburse the court administrator if the court administrator refunds the deposit upon such an order and obtains a receipt to be used as a voucher.\nAll sums collected on any bail, bond, or recognizance forfeited by court order or under subdivision 1, paragraph (a), for the Fourth Judicial District on a nonfelony case shall be paid to Hennepin County to be applied to the support of the law library of the county. The receipt of the county treasurer to the court administrator shall be a sufficient voucher. When the sums so forfeited, minus refunds, during any calendar year equal $2,500, all sums in excess of that amount shall be paid to the municipality or subdivision of government in which the violation occurred. The payments shall be made periodically but not before six months from the date of the order for forfeiture. During that six-month period, but not thereafter, any judge may set aside the forfeiture order upon proper showing of cause. No obligation to pay sums so ordered forfeited exists unless the forfeiture is not set aside within the six-month period. For the purpose of determining when the $2,500 shall have accrued to the county law library, the final forfeiture shall be deemed to occur at the end of the six-month period.",
	"repealed": false
}