{
	"id": "297F.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.09",
	"title": "297F.09 RETURNS; PAYMENT OF TAX.",
	"text": "On or before the 18th day of each calendar month, a distributor with a place of business in this state shall file a return with the commissioner showing the quantity of cigarettes manufactured or brought in from outside the state or purchased during the preceding calendar month and the quantity of cigarettes sold or otherwise disposed of in this state and outside this state during that month. A licensed distributor outside this state shall in like manner file a return showing the quantity of cigarettes shipped or transported into this state during the preceding calendar month. The commissioner shall prescribe the content, format, and manner of returns pursuant to section 270C.30, and the returns must contain any other information required by the commissioner. The return must be accompanied by a remittance for the full unpaid tax liability shown by it. For distributors subject to the accelerated tax payment requirements in subdivision 10, the return for the May liability is due two business days before June 30th of the year and the return for the June liability is due on or before August 18th of the year.\nOn or before the 18th day of each calendar month, a distributor with a place of business in this state shall file a return with the commissioner showing the quantity and wholesale sales price of each tobacco product:\n(1) brought, or caused to be brought, into this state for sale; and\n(2) made, manufactured, or fabricated in this state for sale in this state, during the preceding calendar month.\nEvery licensed distributor outside this state shall in like manner file a return showing the quantity and wholesale sales price of each tobacco product shipped or transported to retailers in this state to be sold by those retailers, during the preceding calendar month. Returns must be made in the form and manner prescribed by the commissioner and must contain any other information required by the commissioner. The return must be accompanied by a remittance for the full tax liability shown. For distributors subject to the accelerated tax payment requirements in subdivision 10, the return for the May liability is due two business days before June 30th of the year and the return for the June liability is due on or before August 18th of the year.\n(a) On or before the 18th day of each calendar month, a consumer who, during the preceding calendar month, has acquired title to or possession of cigarettes or tobacco products for use or storage in this state, upon which cigarettes or tobacco products the tax imposed by this chapter has not been paid, shall file a return with the commissioner showing the quantity of cigarettes or tobacco products so acquired. The return must be made in the form and manner prescribed by the commissioner, and must contain any other information required by the commissioner. The return must be accompanied by a remittance for the full unpaid tax liability shown by it.\n(b) On or before the 18th day of each calendar month, a retailer or out-of-state retailer who, during the preceding calendar month, made delivery sales must file a return with the commissioner showing the quantity of cigarettes or tobacco products so delivered. The commissioner shall prescribe the content, format, and manner of returns pursuant to section 270C.30. The return must be accompanied by a remittance for the full unpaid tax liability.\nAll of the provisions of this chapter relating to corrections of returns, deficiency assessments, protests, hearings, interest and penalties, and collection of taxes, apply to consumers.\nNo later than the 18th day of each calendar month, a retailer or out-of-state retailer that has made a delivery sale in the previous calendar month shall file with the Department of Revenue a report in the form and in the manner prescribed by the commissioner of revenue that provides for each delivery sale, the name and address of the purchaser and the brand or brands and quantity of cigarettes or tobacco products sold. A retailer or out-of-state retailer that meets the requirements of United States Code, title 15, section 375 et seq. satisfies the requirements of this subdivision. The filing of a return under subdivision 3, paragraph (b), satisfies the requirements of this subdivision for the applicable month.\nThe commissioner may extend the time for filing returns and remittance of tax, deficiencies, and penalties for not more than 60 days. The commissioner may require that a tentative return be filed at the time for filing the regularly required return and that payment of the tax be made with it on the basis of the tentative return. When an extension of time for payment has been granted under this section, interest is payable at the rate provided in section 270C.40 from the date when the payment should have been made, if no extension had been granted, until the tax is paid.\n[Repealed, 2000 c 490 art 10 s 22]\nA cigarette distributor, tobacco products distributor, retailer, or out-of-state retailer having a liability of $10,000 or more during a fiscal year ending June 30 must remit all liabilities in all subsequent calendar years by electronic means.\nAll payments received may, in the discretion of the commissioner, be credited first to the oldest liability not secured by a judgment or lien, but in all cases must be credited first to penalties, next to interest, and then to the tax due.\nThe amount of tax not timely paid bears interest at the rate specified in section 270C.40 from the time such tax should have been paid until paid. The penalty imposed in this section bears interest at the rate specified in section 270C.40 from the date provided in section 270C.40, subdivision 3, to the date of payment of the penalty. Any interest and penalty is added to the tax and collected as a part of it.\nA cigarette distributor, tobacco products distributor, retailer, or out-of-state retailer having a liability of $250,000 or more during a fiscal year ending June 30, shall remit the June liability for the next year in the following manner:\n(a) Two business days before June 30 of calendar year 2021, the distributor shall remit the actual May liability and 87.5 percent of the estimated June liability to the commissioner and file the return in the form and manner prescribed by the commissioner. Two business days before June 30 of calendar year 2022 and each calendar year thereafter, the distributor must remit the actual May liability and 84.5 percent of the estimated June liability to the commissioner and file the return in the form and manner prescribed by the commissioner.\n(b) On or before August 18 of the year, the distributor, retailer, or out-of-state retailer shall submit a return showing the actual June liability and pay any additional amount of tax not remitted in June. A penalty is imposed equal to ten percent of the amount of June liability required to be paid in June, less the amount remitted in June. However, the penalty is not imposed if the amount remitted in June equals:\n(1) for calendar year 2021, the lesser of 87.5 percent of the actual June liability for that calendar year or 87.5 percent of the May liability for that calendar year; or\n(2) for calendar year 2022 and each calendar year thereafter, the lesser of 84.5 percent of the actual June liability for that calendar year or 84.5 percent of the May liability for that calendar year.",
	"repealed": false
}