{
	"id": "271.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/271.12",
	"title": "271.12 WHEN ORDER EFFECTIVE.",
	"text": "No order for refundment by the commissioner of revenue, the appropriate unit of government, or the Tax Court shall take effect until the time for appeal therefrom or review thereof by all parties entitled thereto has expired. Otherwise every order of the commissioner, the appropriate unit of government, or the Tax Court shall take effect immediately upon the filing thereof, and no appeal therefrom or review thereof shall stay the execution thereof or extend the time for payment of any tax or other obligation unless otherwise expressly provided by law; provided, that in case an order which has been acted upon, in whole or in part, shall thereafter be set aside or modified upon appeal, the determination upon appeal or review shall supersede the order appealed from and be binding upon all parties affected thereby, and such adjustments as may be necessary to give effect thereto shall be made accordingly; and provided further, the Tax Court may enjoin enforcement of the order of the commissioner being appealed. If it be finally determined upon such appeal or review that any person is entitled to refundment of any amount which has been paid for a tax or other obligation, such amount, unless otherwise provided by law, shall be paid to the person by the commissioner of management and budget, or other proper officer, out of funds derived from taxes of the same kind, if available for the purpose, or out of other available funds, if any, with interest at the rate specified in section 270C.405 from the date of payment of the tax, unless a different rate or date of accrual of interest is otherwise provided by law, in which case such other rate or date of accrual shall apply, upon certification by the commissioner of revenue, the appropriate unit of government, the Tax Court or the supreme court.\nIf, within 120 days after a decision of the Tax Court becomes final, the commissioner does not refund the overpayment determined by the court, together with interest, on motion by the taxpayer, the Tax Court shall have jurisdiction to order the refund of the overpayment and interest, and to award reasonable litigation costs for bringing the motion. If any tax, assessment, or other obligation be increased upon such appeal or review, the increase shall be added to the original amount, and may be enforced and collected therewith.",
	"repealed": false
}