{
	"id": "259A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/259A.40",
	"title": "259A.40 ASSIGNMENT OF ADOPTION ASSISTANCE AGREEMENT.",
	"text": "(a) The child maintains eligibility for title IV-E adoption assistance in a subsequent adoption if the following criteria are met:\n(1) the child is determined to be a child with special needs as outlined in section 259A.10, subdivision 2; and\n(2) the subsequent adoptive parent resides in Minnesota.\n(b) If the child had a title IV-E adoption assistance agreement prior to the death of the adoptive parent or dissolution of the adoption, and the subsequent adoptive parent resides outside of Minnesota, the state is not responsible for determining whether the child meets the definition of special needs, entering into the adoption assistance agreement, and making any adoption assistance payments outlined in the new agreement unless a state agency in Minnesota has responsibility for placement and care of the child at the time of the subsequent adoption. If there is no state agency in Minnesota that has responsibility for placement and care of the child at the time of the subsequent adoption, it is the public child welfare agency in the subsequent adoptive parent's residence that is responsible for determining whether the child meets the definition of special needs and entering into the adoption assistance agreement.\n(a) State-funded adoption assistance may be continued with the written consent of the commissioner to an individual who is a guardian appointed by a court for the child upon the death of both the adoptive parents in the case of a two-parent adoption, or the sole adoptive parent in the case of a single-parent adoption, unless the child is under the custody of a child-placing agency.\n(b) Temporary assignment of adoption assistance may be approved by the commissioner for a maximum of six consecutive months from the death of the parent or parents and must adhere to the requirements and procedures prescribed by the commissioner. If, within six months, the child has not been adopted by a person agreed upon by the commissioner, or if a court has not appointed a legal guardian under either section 260C.325 or 524.5-313, or similar law of another jurisdiction, the adoption assistance shall terminate. Upon assignment of payments pursuant to this subdivision, funding shall be from state funds only.",
	"repealed": false
}