{
	"id": "116F.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/116F.06",
	"title": "116F.06 PACKAGES AND CONTAINERS; ASSISTANCE; ORDERS; REPORT.",
	"text": "The agency shall advise and assist industry and business within the state in providing and developing packaging and containers consistent with environmental policies of the state.\nThe agency shall review new or revised packages or containers except when such changes involve only color, size, shape or printing. The agency shall review innovations including, but not limited to, changes in constituent materials or combinations thereof and changes in closures. When the agency determines that any new or revised package or container would constitute a solid waste disposal problem or be inconsistent with state environmental policies, the manufacturer of the product may withdraw it from further consideration until such time as the manufacturer may resubmit such product to the agency, or, the agency may, by order made after notice and hearing as provided in chapter 14, and following an additional period not to exceed 30 days during which the Environmental Quality Board may review the proposed action, prohibit the sale of the package or container in the state. Any such prohibition shall continue in effect until revoked by the agency or until the last legislative day of the next following legislative session, whichever occurs first, unless extended by law. This subdivision shall not apply to any package or container sold at retail in this state prior to September 7, 1979.\nThe agency shall adopt and may amend or rescind guidelines identifying the types of new or revised containers and packaging that are subject to its review after notice and hearing as provided in section 14.14, subdivision 1. Any person may submit to the agency a sample of a package or container for agency review. The agency shall review the sample, and may require the person to furnish such additional samples and information as may be necessary for it to determine the environmental or solid waste disposal problems that the container or packaging would cause. Except as may be necessary in connection with any public hearing, the agency shall keep the samples and information confidential if the person submitting them certifies that disclosure of said samples and information would affect the competitive position of the person. If the agency fails to issue an order prohibiting sale of a package or container within 120 days after the sample was submitted, the agency shall not prohibit it thereafter. The agency may, however, for good cause, order the 120-day period to be extended for an additional period not to exceed 30 days.\nThe agency's report to the legislature on progress on abatement of land pollution required by section 116.10, shall be supplemented by annual recommendations concerning problems relating to solid waste generation and suggested remedies, including but not limited to the prohibition of the sale or use of any package or container.\nThe provisions of this section shall not be severable. If any provision of this section is found to be void for any reason, the remaining provisions of the section shall be void also.",
	"repealed": false
}