{
	"id": "326B.107",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.107",
	"title": "326B.107 PUBLIC BUILDINGS AND STATE-LICENSED FACILITIES.",
	"text": "Unless the commissioner has entered into an agreement under subdivision 2 or 3, the commissioner shall administer and enforce the State Building Code as a municipality with respect to public buildings and state-licensed facilities in the state. The commissioner shall establish appropriate permit, plan review, inspection fees, and surcharges for public buildings and state-licensed facilities.\n(a) The commissioner shall enter into an agreement with a municipality other than the state for plan review, inspection, code administration, and code enforcement on public buildings and state-licensed facilities in the jurisdiction if the municipality requests to provide those services and the commissioner determines that the municipality has enough adequately trained and qualified inspectors to provide those services. In determining whether a municipality has enough adequately trained and qualified inspectors to provide the service, the commissioner must consider all inspectors who are employed by the municipality, are under contract with the municipality to provide inspection services, or are obligated to provide inspection services to the municipality under any other lawful agreement.\n(b) The criteria used to make this determination shall be provided in writing to the municipality requesting an agreement.\n(c) If the commissioner determines that the municipality lacks enough adequately trained and qualified inspectors to provide the required services, a written explanation of the deficiencies shall be provided to the municipality.\n(d) The municipality shall be given an opportunity to remedy any deficiencies and request reconsideration of the commissioner's determination. A request for reconsideration must be in writing and accompanied by substantiating documentation. A request for reconsideration must be received by the commissioner within 90 days of the determination explanation. The commissioner shall review the information and issue a final determination to the municipality within 30 days of the request.\n(e) A municipality aggrieved by a final decision of the commissioner to not enter into an agreement may appeal to be heard as a contested case in accordance with chapter 14.\nThe commissioner shall enter into an agreement with a municipality other than the state for inspection, code administration, and code enforcement of reserved projects occurring on public buildings and state-licensed facilities in its jurisdiction if the municipality has a designated building official as required by section 326B.133 and requests to provide those services.\nFor purposes of this subdivision, \"reserved projects\" includes the following:\n(1) roof covering replacement that does not add roof load;\n(2) towers requiring special inspection;\n(3) single-level storage buildings not exceeding 5,000 square feet;\n(4) exterior maintenance work, including replacement of siding, windows, and doors;\n(5) HVAC unit replacement that does not add roof load or ventilation capacity;\n(6) accessibility upgrades not involving building additions or structural alterations;\n(7) remodeling that does not change the building's occupancy, structural system, exit access or discharge pattern, or mechanical load; and\n(8) other projects determined to be reserved by the commissioner.\nMunicipalities other than the state having an agreement under subdivision 2 with the commissioner for code administration and enforcement service for public buildings and state-licensed facilities or inspecting under authority of subdivision 3 shall charge their customary fees, including surcharge, to be paid directly to the jurisdiction by the applicant seeking authorization to construct a public building or a state-licensed facility.\nAn agreement with the commissioner under subdivision 2 or 3 must require the municipality to attend to applicable aspects of code administration and enforcement as described in the agreement and established by rule.\nAdministration and enforcement in a municipality under subdivisions 2 and 3 must apply any optional provisions of the State Building Code adopted by the municipality. A municipality adopting any optional code provision shall notify the state building official within 30 days of its adoption.\nConstruction or remodeling may not begin on any public building or state licensed facility until the plans and specifications have been approved by the commissioner or municipality under contractual agreement pursuant to subdivision 1. The plans and specifications must be submitted for review, and within 30 days after receipt of the plans and specifications, the commissioner or municipality under contractual agreement shall notify the submitting authority of any corrections.",
	"repealed": false
}