{
	"id": "501C.1105",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.1105",
	"title": "501C.1105 INCOME EARNED DURING ADMINISTRATION OF A DECEDENT'S ESTATE.",
	"text": "Unless a will provides otherwise and subject to subdivision 2, all expenses incurred in connection with the settlement of a decedent's estate, including debts, funeral expenses, estate taxes, interest and penalties concerning taxes, family allowances, fees of attorneys and personal representatives, and court costs must be charged against the principal of the estate.\nUnless the will or trust instrument provides otherwise, income from the assets of a decedent's estate after the death of the testator and before distribution and income from the assets of a trust after an income interest in a trust terminates, including income from property used to discharge liabilities, must be determined in accordance with the rules applicable to a trustee and distributed as follows:\n(1) to specific devisees or to any beneficiary who is to receive specific property from a trust, the income from the property devised or distributed to them respectively, less property taxes, ordinary repairs, interest, and other expenses of management and operation of the property, and less an appropriate portion of taxes imposed on income, excluding taxes on capital gains, that accrue during the period of administration or after an income interest in a trust terminates;\n(2) to a devisee or to any beneficiary who receives a pecuniary amount outright, the interest or any other amount provided by the will, the terms of the trust instrument or applicable law from income determined in accordance with the rules applicable to a trustee or, to the extent income is insufficient, from principal. If a beneficiary is to receive a pecuniary amount outright from a trust after an income interest ends and no interest or other amount is provided for by the terms of the trust instrument or applicable law, the trustee shall distribute the interest or other amount to which the beneficiary would be entitled under applicable law if the pecuniary amount were required to be paid under a will;\n(3) to all other devisees or beneficiaries, the balance of the income determined in accordance with the rules applicable to a trustee, less the balance of property taxes, ordinary repairs, interest, and other expenses of management and operation of all property from which the estate or trust is entitled to income, and taxes imposed on income, excluding taxes on capital gains, that accrue during the period of administration or after an income interest terminates, in proportion to their respective interests in the undistributed assets of the estate or trust computed at times of distribution on the basis of inventory value.\nFor purposes of this subdivision, an income interest in a trust terminates upon the occurrence of any event which causes the right of a person to receive mandatory or discretionary distributions of income from the trust to end.\nIncome received by a trustee under subdivision 2 must be treated as income of the trust.",
	"repealed": false
}