{
	"id": "475.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.67",
	"title": "475.67 REFUNDING BONDS, OTHER OBLIGATIONS; VALIDITY; PROCEDURE.",
	"text": "No purchaser or owner of bonds or other obligations issued by a municipality for the purpose of refunding its outstanding obligations or floating indebtedness need inquire into the validity of the debts refunded by such bonds or other obligations. The determination by resolution of the governing body to issue the bonds or other obligations of the municipality for such purpose, as to such purchaser or owner, shall be conclusive evidence of the validity of the debts thereby refunded.\nAs between the municipality and the owner or holder of any bond, warrant, or order so refunded, nothing in this section validates any invalid bond, warrant, or order.\n(a) Any or all obligations and interest thereon may be refunded if and when and to the extent that for any reason the taxes or special assessments, revenues, or other funds appropriated for their payment are not sufficient to pay all principal and interest due or about to become due thereon.\n(b) Any or all obligations of one or more issues regardless of their source of payment and interest thereon may be refunded before their due dates, if:\n(1) consistent with covenants made with the holders thereof; and\n(2) determined by the governing body to be necessary or desirable:\n(i) for the reduction of debt service cost to the municipality; or\n(ii) for the extension or adjustment of the maturities in relation to the resources available for their payment; or\n(iii) for the issuance of obligations bearing a fixed rate of interest in the case of obligations bearing interest at a rate varying periodically; or\n(iv) in the case of obligations payable solely from a special fund, for the more advantageous sale of additional obligations payable from the same fund or to relieve the municipality of restrictions imposed by covenants made with the holders of the obligations to be refunded.\n(c) The amount of interest which may be refunded from the proceeds of the refunding obligations shall not exceed the amount of proceeds estimated to be required in excess of the principal amount of refunded obligations to retire the refunded obligations in accordance with subdivision 6.\n(d) No general obligations, for which the full faith and credit of the issuer is pledged, shall be issued to refund special obligations previously issued for any purpose, payable solely from a special fund, unless the issuance is authorized by the election, hearing, petition, resolution, or other procedure that would have been required as a condition precedent to the original issuance of general obligations for the same purpose.\nRefunding obligations shall not be issued and sold more than six months before the date on which all obligations to be refunded thereby will have matured or have been called for redemption in accordance with their terms, unless the actions and conditions described in the following subdivisions of this section are taken or exist at or before the time when the refunding obligations are delivered to the purchasers.\nThe proceeds of the refunding obligations, less any accrued interest or premium thereon required to be taken into account for purposes of meeting the debt service savings test set forth in subdivision 12 or otherwise deposited in the debt service fund established for the refunding obligations, less any amount set aside to pay the expenses of the refunding described in subdivision 12, shall be deposited, together with any other funds available and appropriated by the governing body for the purpose, in escrow with a suitable banking institution within or without the state, whose deposits are insured by the Federal Deposit Insurance Corporation, and whose combined capital and surplus is not less than $500,000.\nThe funds so deposited shall be invested in securities maturing or callable at the option of the holder on such dates and bearing interest at such rates as shall be required to provide funds sufficient, with any cash retained in the escrow account, to pay when due the interest to accrue on each obligation refunded to its maturity or, if prepayable and called for redemption, the earlier date on which it is called for redemption, and to pay the principal amount of each such obligation at maturity or, if prepayable and called for redemption, at such earlier redemption date, and to pay any premium required for redemption on that date; and the governing body shall irrevocably appropriate for these purposes the escrow account and all payments of principal and interest on the securities deposited therein, provided that any funds in the escrow account in excess of the amounts from time to time needed for the foregoing purposes may be remitted to the municipality.\nProvision shall be made for notice of the call of any refunded obligations to be redeemed before maturity to be given in accordance with their terms, and in accordance with section 475.54, subdivision 4, no later than 30 days after issuance of the refunding obligations.\nSecurities purchased for the escrow account shall be limited to:\n(1) general obligations of the United States, securities whose principal and interest payments are guaranteed by the United States, including but not limited to Resolution Funding Corporation Interest Separate Trading of Registered Interest and Principal of Securities and United States Agency for International Development Bonds, and securities issued by United States government-sponsored enterprises including but not limited to Federal Home Loan Banks, the Federal Farm Credit System, the Federal National Mortgage Association, or the Federal Home Loan Mortgage Corporation; or\n(2) obligations issued or guaranteed by any state or any political subdivision of a state, which at the date of purchase are rated in the highest or the next highest rating category by Standard and Poor's Corporation, Moody's Investors Service, or a similar nationally recognized rating agency, but not less than the rating on the refunded bonds immediately prior to the refunding.\n\"Rating category,\" as used in this subdivision, means a generic securities rating category, without regard in the case of a long-term rating category to any refinement or gradation of such long-term rating category by a numerical modifier or otherwise.\nThe municipality shall enter into an agreement with the banking institution acting as escrow agent under which the agent shall acknowledge receipt of the cash and securities and their sufficiency to comply with the requirements of this section, and shall agree to hold them, and all money received in payment of principal and interest on the securities, in a special trust account, and to remit from this account to each paying agent for the refunded obligations sufficient funds to pay the principal and interest due thereon at each maturity, interest payment date, and redemption date. The agent may be directed to reinvest the balance held in the account from time to time in other securities of the kinds authorized in this section, maturing or subject to redemption at the times and in the amounts required to meet all payments of principal and interest when due on the refunded obligations, which securities may be purchased from its own investment department at prices not higher than those at which similar securities are currently being sold by it to others.\nThe escrow agent shall be directed to cause notice of the call of the refunded obligations which are to be prepaid to be republished not more than 90 nor less than 45 days before the date fixed for their redemption, in the manner provided in subdivision 7; but failure to republish shall not affect the validity of the call for redemption.\nMS 1986 [Repealed, 1987 c 344 s 37]\nIn the refunding of general obligations, for which the full faith and credit of the issuing municipality has been pledged, the following additional conditions shall be observed: each such obligation, if repayable, shall be called for redemption prior to its maturity in accordance with its terms no later than either (i) the earliest date on which it may be redeemed without payment of any premium, or (ii) if the obligation is only prepayable with payment of a premium, on the earliest date on which it may be redeemed with payment of the least premium required by its terms. No refunding obligations shall be issued and sold more than six months before the refunded obligations mature or are called for redemption in accordance with their terms, unless either (i) as a result of the refunding the average life of the maturities is extended at least three years or (ii) as of the nominal date of the refunding obligations the present value of the dollar amount of the debt service on the refunding obligations, computed to their stated maturity dates, after deducting any premium, is lower by at least three percent than the present value of the dollar amount of debt service, on all general obligations refunded, exclusive of any premium, computed to their stated maturity dates; provided that in computing the dollar amount of debt service on the refunding obligations, any expenses of the refunding payable from a source other than the proceeds of the refunding obligations or the interest derived from the investment thereof shall be added to the dollar amount of debt service on the refunding obligations. For purposes of this subdivision, the present value of the dollar amount of debt service means the dollar amount of debt service to be paid, discounted to the nominal date of the refunding obligations at a rate equal to the yield on the refunding obligations. Expenses of the refunding include the amount, if any, in excess of the proceeds of the refunding obligations or the principal amount of obligations to be refunded, whichever is the greater, which is required to be deposited in escrow to provide cash and purchase securities sufficient to retire the refunded obligations and unaccrued interest thereon in accordance with subdivision 6; charges of the escrow agent and of the paying agent for the refunding obligations; and expenses of printing and publications and of fiscal, legal, or other professional service necessarily incurred in the issuance of the refunding obligations.\nCrossover refunding obligations may be issued by a municipality without regard to the limitations in subdivisions 4 to 10. The proceeds of crossover refunding obligations, less any proceeds applied to payment of the costs of their issuance, shall be deposited in a debt service fund irrevocably appropriated to the payment of principal of and interest on the refunding obligations until the date the proceeds are applied to payment of the obligations to be refunded. The debt service fund shall be maintained as an escrow account with a suitable financial institution within or without the state and amounts in it shall be invested in securities described in subdivision 8 or in an investment contract or similar agreement with a bank or insurance company meeting the requirements of section 118A.05, subdivision 5. Excess proceeds, if any, of the tax levy pursuant to section 475.61, subdivision 1, made with respect to the obligations to be refunded, and any other available amounts, may be deposited in the escrow account. In the resolution authorizing the issuance of crossover refunding obligations, the governing body may pledge to their payment any source of payment of the obligations to be refunded. The resolution may provide that the refunding obligations are payable solely from the escrow account prior to the date scheduled for payment of the obligations to be refunded and that the obligations to be refunded shall not be discharged if the amounts on deposit in the escrow account on that date are insufficient. Subdivision 12 applies to crossover refunding obligations, but the present value of debt service on the refunding and refunded obligations shall be determined as of the date the proceeds are applied to payment of the obligations to be refunded. Subject to section 475.61, subdivision 3, in the case of general obligation bonds, taxes shall be levied pursuant to section 475.61 and appropriated to the debt service fund in the amounts needed, together with estimated investment income of the debt service fund and any other revenues available upon discharge of the obligations refunded, to pay when due the principal of and interest on the refunding obligations. The levy so imposed may be reduced by earnings to be received from investments on hand in the debt service fund to the extent the applicable recording officer certifies to the county auditor that the earnings are expected to be received in amounts and at such times as to be sufficient, together with the remaining levy, to satisfy the purpose of the levy requirements under section 475.61.",
	"repealed": false
}