{
	"id": "326A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.05",
	"title": "326A.05 PERMIT TO PRACTICE AS A CPA FIRM.",
	"text": "The board shall grant or renew permits to practice as a CPA firm to entities that make application and demonstrate their qualifications in accordance with this section.\n(a) The following must hold a permit issued under this section:\n(1) any firm with an office in this state performing attest services as defined in section 326A.01, subdivision 2;\n(2) to the extent required by section 326A.10, paragraph (k), any firm with an office in this state performing compilation services as defined in section 326A.01, subdivision 6;\n(3) any firm with an office in this state that uses the title \"CPA\" or \"CPA firm\"; or\n(4) any firm that does not have an office in this state but performs attest services as described in section 326A.01, subdivision 2, clause (1), (4), or (5), for a client having its headquarters in this state.\n(b) A firm possessing a valid permit from another state which does not have an office in this state may perform services described in section 326A.01, subdivision 2, clause (2) or (5), or subdivision 6, for a client having its headquarters in this state and may use the title \"CPA\" or \"CPA firm\" without a permit issued under this section only if:\n(1) it has the qualifications described in subdivision 3, paragraph (b);\n(2) as a condition to the renewal of the firm's permit issued by the other state, that state requires a peer review which contains the requirements equivalent to subdivision 8, paragraphs (a) and (e); and\n(3) it performs the services through an individual who has been granted practice privileges under section 326A.14.\n(c) A firm possessing a valid permit from another state that does not have an office in this state and which is not subject to the requirements of paragraph (a), clause (4), or (b), may perform other professional services while using the title \"CPA\" or \"CPA firm\" in this state without a permit issued under this section only if the firm:\n(1) has the qualifications described in subdivision 3, paragraph (b);\n(2) performs the services through an individual who has been granted practice privileges under section 326A.14; and\n(3) can lawfully perform the services in the state where the individuals with practice privileges have their principal place of business.\n(a) Permits must be initially issued and renewed for periods of not more than one year but in any event must expire on December 31 following issuance or renewal. Applications for permits shall be made in the form, and in the case of applications for renewal between the dates, as the board specifies in rule. The board shall grant or deny an application no later than 90 days after the application is filed in proper form. If the applicant seeks the opportunity to show that issuance or renewal of a permit was mistakenly denied or if the board is not able to determine whether it should be granted or denied, the board may issue to the applicant a provisional permit, which expires 90 days after its issuance, or when the board determines whether or not to issue or renew the permit for which application was made, whichever occurs first.\n(b) Applications for renewal of a permit that are complete and timely filed with the board and are not granted or denied by the board before January 1 are renewed on a provisional basis as of January 1 and for 90 days thereafter, or until the board grants or denies the permit, whichever occurs first, provided the licensee meets the renewal requirements in this chapter and rules adopted by the board.\n(a) An applicant for initial issuance or renewal of a permit to practice under this section shall comply with the requirements in this subdivision.\n(b) Notwithstanding chapter 319B or any other provision of law, a simple majority of the ownership of the firm, in terms of financial interests and voting rights of all partners, officers, shareholders, members, or managers, must belong to holders of certificates who are licensed in some state, and the partners, officers, shareholders, members, or managers, whose principal place of business is in this state, and who perform professional services in this state, must hold valid certificates issued under section 326A.04 or the corresponding provision of prior law. Although firms may include nonlicensee owners, the firm and its ownership must comply with rules adopted by the board. The firm shall register all nonlicensee owners with the state board as set forth by rule. An individual who has been granted practice privileges under section 326A.14 and who performs services for which a firm permit is required under section 326A.14, subdivision 1, paragraph (d), is not required to obtain a certificate from the board under section 326A.04.\n(c) A CPA firm may include nonlicensee owners provided that:\n(1) the firm designates a licensee of this state, or in the case of a firm that must have a permit according to section 326A.14, subdivision 1, paragraph (d), a licensee of another state who meets the requirements in section 326A.14, subdivision 1, paragraph (a) or (b), who is responsible for the proper registration of the firm and identifies that individual to the board;\n(2) all nonlicensee owners are persons of good moral character and are active individual participants in the CPA firm or affiliated entities; and\n(3) the firm complies with other requirements imposed by the board in rule.\n(d) An individual licensee and any individual granted practice privileges under section 326A.14 who is responsible for supervising attest or compilation services and signs or authorizes someone to sign the accountant's report on behalf of the firm, shall meet the competency requirements set out in the professional standards for such services.\n(e) An individual licensee and any individual granted practice privileges under section 326A.14 who signs or authorizes someone to sign the accountants' report on behalf of the firm shall meet the competency requirement of paragraph (d).\nAn applicant for initial issuance or renewal of a permit to practice under this section shall register each office of the firm within this state with the board and show that all attest and compilation services rendered in this state are under the charge of a person holding a valid certificate issued by this state or another state.\nThe board shall charge a fee for each application for initial issuance or renewal of a permit under this section. A firm that is required to hold a permit under this section and has one or more offices located in another state shall pay an initial permit issuance fee of $100 and an annual renewal fee of $68.\nAn applicant for initial issuance or renewal of permits under this section shall in the applicant's application list all states in which the applicant has applied for or holds permits as a CPA firm and list any past denial, revocation, or suspension of a permit by any other state. Each holder of or applicant for a permit under this section shall notify the board in writing, within 30 days after its occurrence, of any change in the identities of partners, officers, shareholders, members, or managers whose principal place of business is in this state, any change in the number or location of offices within this state, any change in the identity of the persons in charge of such offices, and any issuance, denial, revocation, or suspension of a permit by any other state.\nFirms that fall out of compliance with the provisions of this section due to changes in firm ownership or personnel, after receiving or renewing a permit, shall take corrective action to bring the firm back into compliance as quickly as possible. Failure to bring the firm back into compliance within a reasonable period as defined by the board rule shall result in the suspension or revocation of the firm permit.\n(a) The board shall by rule require as a condition to renewal of permits under this section, that applicants undergo, no more frequently than once every three years, peer reviews conducted in a manner specified by the board. The review must include a verification that individuals in the firm who are responsible for supervising attest and compilation services and who sign or authorize someone to sign the accountant's report on the financial statements on behalf of the firm meet the competency requirements set out in the professional standards for such services. In addition, the rules must meet the requirements in paragraphs (b) to (d).\n(b) The rules must be adopted reasonably in advance of the time when they first become effective.\n(c) The rules must include reasonable provision for compliance by an applicant showing that it has, within the preceding three years, undergone a peer review that is a satisfactory equivalent to peer review generally required pursuant to this subdivision.\n(d) The rules must require, with respect to peer reviews contemplated by paragraph (c), that they be subject to oversight by an oversight body established or sanctioned by board rule. This body shall periodically report to the board on the effectiveness of the review program under its charge, and provide to the board a listing of firms that have participated in a peer review program that is satisfactory to the board.\n(e) The rules must require, with respect to peer reviews contemplated by paragraph (c), that the peer review processes be operated and documents maintained in a manner designed to preserve confidentiality, and that neither the board nor any third party, other than the oversight body, has access to documents furnished or generated in the course of the review. The applicant shall submit to the board reports and letters received at the conclusion of the peer review process as provided for in board rule.\n[Repealed, 2008 c 195 s 32]",
	"repealed": false
}