{
	"id": "103E.411",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.411",
	"title": "103E.411 DRAINAGE SYSTEM AS OUTLET FOR MUNICIPALITY.",
	"text": "A municipality may use a drainage system as an outlet for its municipal drainage system or the overflow from the system under the provisions of this section. The municipality must petition to the drainage authority to use the drainage system. The petition must:\n(1) show the necessity for the use of the drainage system as an outlet;\n(2) show that the use of the drainage system will be of public benefit and utility and promote the public health;\n(3) be accompanied by a plat showing the location of the drainage system and the location of the municipal drainage system; and\n(4) be accompanied by specifications showing the plan of connection from the municipal drainage system to the drainage system.\nThe plan for connecting the municipal drainage system to the drainage system must be approved by the Pollution Control Agency.\n(a) If proceedings to establish the drainage project to be used as an outlet are pending, the petition must be filed with the auditor. The municipal drainage system petition must be presented to the drainage authority at the final hearing to consider the detailed survey report and viewers' report. Notice of the municipal drainage system petition must be included in the final hearing notice.\n(b) If the drainage system to be used as an outlet is established, the municipal drainage system petition must be filed with the auditor. When the petition is filed, the drainage authority in consultation with the auditor shall, by order, set a time and place for hearing on the petition. Notice of the hearing must be given by publication and by mailed notice to the auditor of each affected county.\n(a) At the hearing the drainage authority may receive all evidence of interested parties for or against the granting of the petition. The drainage authority, by order, may authorize the municipality to use the drainage system as an outlet, subject to the conditions that are necessary and proper to protect the rights of the parties and safeguard the interests of the general public, if the drainage authority determines:\n(1) that a necessity exists for the use of the drainage system as an outlet for the municipal drainage system or the overflow from the system;\n(2) that use of the drainage system will be of public utility and promote the public health; and\n(3) that the proposed connection conforms to the requirements of the Pollution Control Agency and provides for the construction and use of proper disposal works.\n(b) The drainage authority must, by order, make the municipality a party to the drainage proceedings and determine the benefits from using the drainage project or system as an outlet.\nIf the drainage system is established, the drainage authority must determine the amount the municipality must pay for the privilege of using the drainage system as an outlet. The amount must be paid to the affected counties and credited to the account of the drainage system used as an outlet. The municipality is liable for all subsequent liens and assessments for the repair and maintenance of the drainage system in proportion to the benefits, as though the benefits were determined in the order establishing the drainage system.",
	"repealed": false
}