{
	"id": "62Q.525",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.525",
	"title": "62Q.525 COVERAGE FOR OFF-LABEL DRUG USE.",
	"text": "This section applies to all health plans, including the coverages described in section 62A.011, subdivision 3, clauses (7) and (10), that are issued or renewed to a Minnesota resident.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Medical literature\" means articles from major peer reviewed medical journals that have recognized the drug or combination of drugs' safety and effectiveness for treatment of the indication for which it has been prescribed. Each article shall meet the uniform requirements for manuscripts submitted to biomedical journals established by the International Committee of Medical Journal Editors or be published in a journal specified by the United States Secretary of Health and Human Services pursuant to United States Code, title 42, section 1395x, paragraph (t), clause (2), item (B), as amended, as acceptable peer review medical literature. Each article must use generally acceptable scientific standards and must not use case reports to satisfy this criterion.\n(c) \"Off-label use of drugs\" means when drugs are prescribed for treatments other than those stated in the labeling approved by the federal Food and Drug Administration.\n(d) \"Standard reference compendia\" means any authoritative compendia as identified by the Medicare program for use in the determination of a medically accepted indication of drugs and biologicals used off-label.\n(a) Every type of coverage included in subdivision 1 that provides coverage for drugs may not exclude coverage of a drug for the treatment of cancer on the ground that the drug has not been approved by the federal Food and Drug Administration for the treatment of cancer if the drug is recognized for treatment of cancer in one of the standard reference compendia or in one article in the medical literature, as defined in subdivision 2.\n(b) Coverage of a drug required by this subdivision includes coverage of medically necessary services directly related to and required for appropriate administration of the drug.\n(c) Coverage required by this subdivision does not include coverage of a drug not listed on the formulary of the coverage included in subdivision 1.\n(d) Coverage of a drug required under this subdivision must not be subject to any co-payment, coinsurance, deductible, or other enrollee cost-sharing greater than the coverage included in subdivision 1 applies to other drugs.\n(e) The commissioner of commerce or health, as appropriate, may direct a person that issues coverage included in subdivision 1 to make payments required by this section.\nThis section must not be construed to:\n(1) alter existing law limiting the coverage of drugs that have not been approved by the federal Food and Drug Administration;\n(2) require coverage for any drug when the federal Food and Drug Administration has determined its use to be contraindicated;\n(3) require coverage for experimental drugs not otherwise approved for any indication by the federal Food and Drug Administration; or\n(4) reduce or limit coverage for off-label use of drugs otherwise required by law or contract.",
	"repealed": false
}