{
	"id": "136A.1796",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1796",
	"title": "136A.1796 TRIBAL COLLEGE SUPPLEMENTAL GRANT ASSISTANCE.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Nonbeneficiary student\" means a resident of Minnesota who is enrolled in a tribally controlled college but is not an enrolled member of a federally recognized Indian tribe.\n(c) \"Tribally controlled college\" means an accredited institution of higher education located in this state that is formally controlled by or has been formally sanctioned or chartered by the governing body of a federally recognized Indian tribe, or a combination of federally recognized Indian tribes. Tribally controlled college does not include any institution or campus subject to the jurisdiction of the Board of Trustees of the Minnesota State Colleges and Universities or the Board of Regents of the University of Minnesota.\n(a) A tribally controlled college is eligible to receive supplemental grant assistance from the office, as provided in this section, for nonbeneficiary student enrollment if the college is not otherwise eligible to receive federal grant funding for those students under United States Code, title 25, section 1808.\n(b) The office shall make grants to tribally controlled colleges to defray the costs of education associated with the enrollment of nonbeneficiary students. Grants made pursuant to this section must be provided directly to the recipient college.\nTo receive a grant under this section, a tribally controlled college must submit an application in the manner required by the office. Upon submission of a completed application indicating that the tribally controlled college is eligible, the office shall distribute to the college, during each year of the biennium, a grant of $5,300 for each nonbeneficiary student on a full-time equivalent basis. If the amount appropriated for grants under this section is insufficient to cover the total amount of grant eligibility, the office shall distribute a prorated amount per nonbeneficiary student on a full-time equivalent basis.\nEach tribally controlled college receiving a grant under this section shall provide to the office, on an annual basis, an accurate and detailed account of the expenditures of the grant funds received by the college, and a copy of the college's most recent audit report and documentation of the enrollment status and ethnic status of each nonbeneficiary student for which grant assistance is sought under this section.",
	"repealed": false
}