{
	"id": "319B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.04",
	"title": "319B.04 AUTHORITY OF FOREIGN FIRMS TO FURNISH PROFESSIONAL SERVICES; ELECTION TO INVOKE THE ACT.",
	"text": "A foreign firm that has in effect an election under subdivision 2 may furnish professional services within Minnesota as provided in sections 319B.01 to 319B.12. A foreign firm may furnish professional services within Minnesota without making an election under subdivision 2 only if:\n(1) no Minnesota statute, Minnesota rule, or tenet of Minnesota common law requires the foreign firm to make that election in order to furnish professional services within Minnesota; and\n(2) no Minnesota statute, Minnesota rule, or tenet of Minnesota common law precludes the foreign firm from furnishing professional services within Minnesota in the absence of that election.\nTo elect to become a foreign professional firm and be authorized to furnish professional services according to sections 319B.01 to 319B.12, a foreign firm must in its certificate of authority or statement of foreign qualification:\n(1) state that the firm elects to operate under sections 319B.01 to 319B.12;\n(2) acknowledge that the firm is subject to those sections;\n(3) state that, to the extent its generally applicable governing law conflicts or differs with those sections, the foreign firm has made the necessary changes to the agreements and other documents controlling its structure, governance, operations, and internal affairs so as to comply with those sections; and\n(4) specify from the list stated in section 319B.02, subdivision 19, the category or categories of professional services the foreign firm is authorized to provide within Minnesota.\nThe statements, acknowledgment, and specification may be made when the foreign firm initially files for a certificate of authority or statement of foreign qualification or may be added at a later time by updating that document.\n(a) A foreign firm may rescind its election by updating its certificate of authority or statement of foreign qualification to delete the statements, acknowledgment, and specification required by subdivision 2.\n(b) A foreign firm may update its certificate of authority or statement of foreign qualification to change the specification required by subdivision 2, clause (4).",
	"repealed": false
}