{
	"id": "403.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.31",
	"title": "403.31 OPERATING COSTS.",
	"text": "(a) The ongoing costs of the commissioner not otherwise appropriated in operating the statewide public safety radio communication system shall be allocated among and paid by the following users, all in accordance with the statewide public safety radio communication system plan under section 403.36:\n(1) the state of Minnesota for its operations using the system;\n(2) all local government units using the system; and\n(3) other eligible users of the system.\n(b) Each local government and other eligible users of the system shall pay to the commissioner all sums charged under this section, at the times and in the manner determined by the commissioner. The governing body of each local government shall take all action necessary to provide the money required for these payments and to make the payments when due.\nCharges payable to the board by users of the system may be made payable at those times during each year as the board determines, but those dates shall be fixed with reference to the dates on which tax, assessment, and revenue collections become available to the government units required to pay such charges.\nEach local government and other eligible users of the first or second phase system shall pay to the board all sums charged to it under this section, at the times and in the manner determined by the board. The governing body of each local government shall take all action that may be necessary to provide the funds required for these payments and to make them when due.\nTo accomplish any duty imposed on it by the council or radio board, the governing body of every local government in the metropolitan area may exercise the powers granted any municipality by chapters 117, 412, 429, and 475 and by sections 115.46, 444.075, and 471.59.\nIf the governing body of any local government using the first or second phase system fails to meet any payment to the board under subdivision 1 when due, the Metropolitan Council may certify to the auditor of the county in which the government unit is located the amount required for payment of the amount due with interest at six percent per year. The auditor shall levy and extend the amount due, with interest, as a tax upon all taxable property in the government unit for the next calendar year, free from any existing limitations imposed by law or charter. This tax shall be collected in the same manner as the general taxes of the government unit, and the proceeds of the tax, when collected, shall be paid by the county treasurer to the board and credited to the government unit for which the tax was levied.\nMS 2006 [Repealed, 2007 c 54 art 8 s 7]",
	"repealed": false
}