{
	"id": "256R.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.27",
	"title": "256R.27 INTERIM AND SETTLE-UP PAYMENT RATES.",
	"text": "(a) The commissioner shall determine the interim payment rates and settle-up payment rates for a newly constructed nursing facility, or a nursing facility with an increase in licensed capacity of 50 percent or more, according to subdivisions 2 and 3.\n(b) The nursing facility must submit a written application to the commissioner to receive interim payment rates. In its application, the nursing facility must state any reasons for noncompliance with this chapter.\n(c) The effective date of the interim payment rates is the date the nursing facility is certified for the medical assistance program.\n(d) The nursing facility must continue to receive the interim payment rates until the settle-up payment rates are determined under subdivision 3.\n(e) For the 15-month period following the settle-up reporting period, the settle-up payment rates must be determined according to subdivision 3, paragraph (c).\n(f) The settle-up payment rates are effective retroactively to the beginning of the interim payment rates and are effective until the end of the interim rate period.\n(g) The total operating and external fixed costs payment rate for the rate year beginning January 1 following the 15-month period in paragraph (e) must be determined under this chapter.\n(a) The nursing facility shall submit an interim cost report in a format similar to the Minnesota Statistical and Cost Report and other supporting information as required by this chapter for the reporting year in which the nursing facility plans to begin operation at least 60 days before the first day a resident is admitted to the newly constructed nursing facility bed. The interim cost report must include the nursing facility's anticipated interim costs and anticipated interim resident days for each resident class in the interim cost report. The anticipated interim resident days for each resident class is multiplied by the weight for that resident class to determine the anticipated interim standardized days as defined in section 256R.02, subdivision 50, and resident days as defined in section 256R.02, subdivision 45, for the reporting period.\n(b) The interim payment rates are determined according to sections 256R.21 to 256R.25, except that:\n(1) the anticipated interim costs and anticipated interim resident days reported on the interim cost report and the anticipated interim standardized days as defined by section 256R.02, subdivision 50, must be used for the interim;\n(2) the commissioner shall use anticipated interim costs and anticipated interim standardized days in determining the allowable historical direct care cost per standardized day as determined under section 256R.23, subdivision 2;\n(3) the commissioner shall use anticipated interim costs and anticipated interim resident days in determining the allowable historical other care-related cost per resident day as determined under section 256R.23, subdivision 3;\n(4) the commissioner shall use anticipated interim costs and anticipated interim resident days to determine the allowable historical external fixed costs per day under section 256R.25, paragraphs (b) to (k);\n(5) the total care-related payment rate limits established in section 256R.23, subdivision 5, and in effect at the beginning of the interim period must be increased by ten percent; and\n(6) the other operating payment rate as determined under section 256R.24 in effect for the rate year must be used for the other operating cost per day.\n(a) When the interim payment rates begin between May 1 and September 30, the nursing facility shall file settle-up cost reports for the period from the beginning of the interim payment rates through September 30 of the following year.\n(b) When the interim payment rates begin between October 1 and April 30, the nursing facility shall file settle-up cost reports for the period from the beginning of the interim payment rates to the first September 30 following the beginning of the interim payment rates.\n(c) The settle-up payment rates are determined according to sections 256R.21 to 256R.25, except that:\n(1) the allowable costs and resident days reported on the settle-up cost report and the standardized days as defined by section 256R.02, subdivision 50, must be used for the interim and settle-up period;\n(2) the commissioner shall use the allowable costs and standardized days in clause (1) to determine the allowable historical direct care cost per standardized day as determined under section 256R.23, subdivision 2;\n(3) the commissioner shall use the allowable costs and the allowable resident days to determine both the allowable historical other care-related cost per resident day as determined under section 256R.23, subdivision 3;\n(4) the commissioner shall use the allowable costs and the allowable resident days to determine the allowable historical external fixed costs per day under section 256R.25, paragraphs (b) to (k);\n(5) the total care-related payment limits established in section 256R.23, subdivision 5, are the limits for the settle-up reporting periods. If the interim period includes more than one July 1 date, the commissioner shall use the total care-related payment rate limit established in section 256R.23, subdivision 5, increased by ten percent for the second July 1 date; and\n(6) the other operating payment rate as determined under section 256R.24 in effect for the rate year must be used for the other operating cost per day.",
	"repealed": false
}