{
	"id": "515B.3-112",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-112",
	"title": "515B.3-112 CONVEYANCE OF, OR CREATION OF SECURITY INTERESTS IN, COMMON ELEMENTS.",
	"text": "(a) In a condominium or planned community, unless the declaration provides otherwise, portions of the common elements may be conveyed or subjected to a security interest by the association if persons entitled to cast at least 67 percent of the votes in the association, including 67 percent of the votes allocated to units not owned by a declarant, or any larger percentage the declaration specifies, approve that action in writing or at a meeting; but all unit owners of units to which any limited common element is allocated must agree in order to convey that limited common element or subject it to a security interest. The declaration may specify a smaller percentage only if all of the units are restricted to nonresidential use.\n(b) In a cooperative, unless the declaration provides otherwise, part of a cooperative may be conveyed, or all or a part subjected to a security interest, by the association if persons entitled to cast at least 67 percent of the votes in the association, including 67 percent of the votes allocated to units in which the declarant has no interest, or any larger percentage the declaration specifies, approves that action in writing or at a meeting. If fewer than all of the units or limited common elements are to be conveyed or subjected to a security interest, then all unit owners of those units, or the units to which those limited common elements are allocated, must agree in order to convey those units or limited common elements or subject them to a security interest. The declaration may specify a smaller percentage only if all of the units are restricted to nonresidential use. Any purported conveyance or other voluntary transfer of an entire cooperative is void, unless made pursuant to section 515B.2-119.\n(c) The association, on behalf of the unit owners, may contract to convey or encumber an interest in the common elements of a common interest community pursuant to this subsection, subject to the required approval. After the approval has been obtained, the association shall have a power of attorney coupled with an interest to effect the conveyance or encumbrance on behalf of all unit owners in the common interest community, including the power to execute deeds, mortgages, or other instruments of conveyance or security. The instrument conveying or creating the interest in the common interest community shall be recorded and shall include as exhibits (i) an affidavit of the president or secretary of the association certifying that the approval required by this section has been obtained and (ii) a schedule of the names of all unit owners and units in the common interest community as of the date of the approval.\n(d) Unless made pursuant to this section, any purported conveyance, creation of a security interest in or other voluntary transfer of any interest in the common elements, or of any part of a cooperative, is void. The grant of an easement, lease, or license pursuant to section 515B.3-102(a)(9) is not subject to this section.\n(e) In the case of a conveyance involving a condominium, a planned community utilizing a CIC plat complying with section 515B.2-110(c), or a cooperative in which the unit owners' interests are characterized as real estate, the association shall record, simultaneously with the recording of the instrument of conveyance, an amended CIC plat showing the real estate constituting the common interest community exclusive of the real estate conveyed.\n(f) A conveyance or encumbrance of common elements, or of a cooperative, pursuant to this section shall not deprive any unit of its rights of support, reasonable access or utility services.\n(g) In all common interest communities, upon recording of the instrument of conveyance, the real estate conveyed shall be released from the declaration and all rights and obligations arising therefrom. Except as provided in subsection (a), or unless the declaration otherwise provides, a conveyance or encumbrance of common elements pursuant to this section does not affect the priority or validity of preexisting encumbrances.\n(h) Any proceeds of the conveyance or creation of a security interest under this section are an asset of the association.\n(i) This section shall not apply to any conveyance or encumbrance of any interest in a proprietary lease.",
	"repealed": false
}