{
	"id": "148.624",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.624",
	"title": "148.624 LICENSURE; RENEWAL.",
	"text": "The board shall issue a license as a dietitian to a person who files a completed application, pays all required fees, and certifies and furnishes evidence satisfactory to the board that the applicant:\n(1) meets the following qualifications:\n(i) has received a baccalaureate or postgraduate degree from a United States regionally accredited college or university with a major in dietetics, human nutrition, nutrition education, food and nutrition, or food services management;\n(ii) has completed a documented supervised preprofessional practice experience component in dietetic practice of not less than 900 hours under the supervision of a registered dietitian, a state licensed nutrition professional, or an individual with a doctoral degree conferred by a United States regionally accredited college or university with a major course of study in human nutrition, nutrition education, food and nutrition, dietetics, or food systems management. Supervised practice experience must be completed in the United States or its territories. Supervisors who obtain their doctoral degree outside the United States and its territories must have their degrees approved by the board as equivalent to the doctoral degree conferred by a United States regionally accredited college or university; and\n(iii) has successfully completed the registration examination for dietitians administered by the commission; or\n(2) has a valid current registration with the commission which gives the applicant the right to use the term \"registered dietitian\" or \"RD.\"\nThe board shall issue a license as a nutritionist to a person who files a completed application, pays all required fees, and certifies and furnishes evidence satisfactory to the board that the applicant:\n(1) meets the following qualifications:\n(i) has received a master's or doctoral degree from an accredited or approved college or university with a major in human nutrition, public health nutrition, clinical nutrition, nutrition education, community nutrition, or food and nutrition; and\n(ii) has completed a documented supervised preprofessional practice experience component in dietetic practice of not less than 900 hours under the supervision of a registered dietitian, a state licensed nutrition professional, or an individual with a doctoral degree conferred by a United States regionally accredited college or university with a major course of study in human nutrition, nutrition education, food and nutrition, dietetics, or food systems management. Supervised practice experience must be completed in the United States or its territories. Supervisors who obtain their doctoral degree outside the United States and its territories must have their degrees validated as equivalent to the doctoral degree conferred by a United States regionally accredited college or university; or\n(2) has received certification as a Certified Nutrition Specialist by the Certification Board for Nutrition Specialists.\n(a) The board may issue a license as a nutritionist to a person who submits to the board a petition for individual review, provided the person has received a master's or doctoral degree from an accredited college or university with a major course of study that includes an emphasis in human nutrition and has completed a supervised preprofessional experience component in nutrition practice of not less than 900 hours under the supervision of a registered dietitian, a state licensed health care practitioner, or an individual with a doctoral degree conferred by a United States regionally accredited college or university with a major course of study in human nutrition, nutrition education, food and nutrition, dietetics, or food system management. Supervised practice experience must be completed in the United States or its territories. Supervisors who obtain their degree outside the United States and its territories must have their degrees approved by the board as equivalent to a comparable degree conferred by a United States regionally accredited college or university.\n(b) The board may issue a license as a dietitian or nutritionist to an applicant who has completed a course of study at a foreign college or university, if the applicant:\n(1) submits a petition for individual review;\n(2) successfully completes a course of study approved by the board as equivalent to a baccalaureate or master's degree conferred by a United States regionally accredited college or university; and\n(3) meets the applicable experiential requirements set by the board.\nLicensees shall renew licenses at the time and in the manner established by the rules of the board.\n(a) Applicants seeking licensure according to this subdivision must be:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license application, and has confirmation of an honorable or general discharge status.\n(b) A qualified applicant under this subdivision must provide evidence of:\n(1) a current valid license in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(c) A temporary license issued under this subdivision is effective for six months from the initial temporary licensure date.\n(d) During the temporary license period, the individual shall complete the licensed dietitian or nutritionist application for licensure.\n(e) In order to remain licensed after the expiration of the temporary license, an individual must meet the full licensure requirements.\n(f) The fee for the temporary license is $250.",
	"repealed": false
}