{
	"id": "60A.096",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.096",
	"title": "60A.096 QUALIFYING LETTER OF CREDIT.",
	"text": "An admitted asset or a reduction in liability for reinsurance ceded to an unauthorized assuming insurer providing a letter of credit pursuant to section 60A.093 shall only be allowed when the letter of credit meets the requirements of this section.\nThe letter of credit must be clean, irrevocable, and unconditional and issued or confirmed by a qualified United States financial institution as defined in section 60A.091. The letter of credit must contain an issue date and date of expiration and must stipulate that the beneficiary need only draw a sight draft under the letter of credit and present it to obtain funds and that no other document need be presented. The letter of credit must also state that it is not subject to any condition or qualification outside of the letter of credit. In addition, the letter of credit must not contain reference to any other agreements, documents, or entities, except as provided in subdivision 10, paragraph (a).\nAs used in this section, \"beneficiary\" means the domestic insurer for whose benefit the letter of credit has been established and any successor of the beneficiary by operation of law. If a court of law appoints a successor in interest to the named beneficiary, then the named beneficiary includes and is limited to the court appointed domiciliary receiver, including conservator, rehabilitator, or liquidator.\nThe heading of the letter of credit may include a boxed section which contains the name of the applicant and other appropriate notations to provide a reference for the letter of credit. The boxed section must be clearly marked to indicate that the information is for internal identification purposes only.\nThe letter of credit must contain a statement to the effect that the obligation of the qualified United States financial institution under the letter of credit is in no way contingent upon reimbursement with respect to it.\nThe term of the letter of credit must be for at least one year and must contain an \"evergreen clause\" which prevents the expiration of the letter of credit without due notice from the issuer. The \"evergreen clause\" must provide for a period of no less than 30 days' notice before the expiration date or nonrenewal.\nThe letter of credit must state whether it is subject to and governed by the laws of this state or the Uniform Customs and Practice for Documentary Credits of the International Chamber of Commerce (Publication 600) (UCP 600) or International Standby Practices of the International Chamber of Commerce Publication 590 (ISP98), or any successor publication, and that all drafts drawn under it shall be presentable at an office in the United States of a qualified United States financial institution.\nIf the letter of credit is made subject to the Uniform Customs and Practice for Documentary Credits of the International Chamber of Commerce (Publication 600), or any successor publication, then the letter of credit must specifically address and make provision for an extension of time to draw against the letter of credit in the event that one or more of the occurrences specified in Article 36 of Publication 600, or any other successor publication, occur.\nMS 2016 [Repealed by amendment, 2018 c 125 s 5]\nIf the letter of credit is issued by a financial institution authorized to issue letters of credit, other than a qualified United States financial institution as described in section 60A.093, then the following additional requirements must be met:\n(1) the issuing financial institution shall formally designate the confirming qualified United States financial institution as its agent for the receipt and payment of the drafts; and\n(2) the \"evergreen clause\" must provide for no less than 30 days' notice before the expiration date or nonrenewal.\n(a) The reinsurance agreement in conjunction with which the letter of credit is obtained may contain provisions which:\n(1) require the assuming insurer to provide letters of credit to the ceding insurer and specify what they are to cover;\n(2) stipulate that the assuming insurer and ceding insurer agree that the letter of credit provided by the assuming insurer pursuant to the provisions of the reinsurance agreement may be drawn upon at any time, notwithstanding any other provisions in the agreement, and must be utilized by the ceding insurer or its successors in interest only for one or more of the following reasons: to reimburse the ceding insurer for the assuming insurer's share of premiums returned to the owners of policies reinsured under the reinsurance agreement on account of cancellations of these policies; to reimburse the ceding insurer for the assuming insurer's share of surrenders and benefits or losses paid by the ceding insurer under the terms and provisions of the policies reinsured under the reinsurance agreement; to fund an account with the ceding insurer in an amount at least equal to the deduction, for reinsurance ceded, from the ceding insurer's liabilities for policies ceded under the agreement, including but not limited to, amounts for policy reserves, claims and losses incurred, and unearned premium reserves; and to pay any other amounts the ceding insurer claims are due under the reinsurance agreement; and\n(3) provide that all of the provisions of this paragraph should be applied without diminution because of insolvency of the ceding insurer or assuming insurer.\n(b) Nothing in this subdivision precludes the ceding insurer and assuming insurer from providing for:\n(1) an interest payment, at a rate not in excess of the prime rate of interest, on the amounts held under paragraph (a), clause (2); and\n(2) the return of any amounts drawn down on the letters of credit in excess of the actual amounts required or, in the case of paragraph (a), clause (2), any amounts that are subsequently determined not to be due.\n(c) When a letter of credit is obtained in conjunction with a reinsurance agreement covering risks other than life, annuities, and health, where it is customary practice to provide a letter of credit for a specific purpose, then the reinsurance agreement may, in lieu of paragraph (a), clause (2), require that the parties enter into a \"trust agreement\" which may be incorporated into the reinsurance agreement or be a separate document.\nA letter of credit may not be used to reduce any liability for reinsurance ceded to an unauthorized assuming insurer in financial statements required to be filed with the commissioner unless an acceptable letter of credit with the filing ceding insurer as beneficiary has been issued on or before the date of filing of the financial statement. Further, the reduction for the letter of credit may be up to the amount available under the letter of credit but no greater than the specific obligation under the reinsurance agreement which the letter of credit was intended to secure.\nMS 2016 [Repealed by amendment, 2018 c 125 s 5]",
	"repealed": false
}