{
	"id": "501C.1109",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.1109",
	"title": "501C.1109 DISPOSITION OF NATURAL RESOURCES.",
	"text": "(a) If a part of the principal consists of a right to receive royalties, overriding or limited royalties, working interests, production payments, net profit interests, or other interests in minerals or other natural resources in, on, or under land, the receipts from taking the natural resources from the land must be allocated under paragraphs (b) to (d).\n(b) If received as rent on a lease or extension payments on a lease, the receipts are income.\n(c) If received from a production payment carved out of a mineral property, the receipts are income to the extent of a factor for interest or its equivalent provided in the governing instrument or a greater amount determined by the trustee to be reasonable and equitable in view of the interests of those entitled to income as well as those entitled to principal. The receipts not allocated to income are principal.\n(d) If received as a royalty, overriding or limited royalty, or bonus or from a working, net profit, or other interest in minerals or other natural resources, receipts not provided for in paragraph (b) or (c) must be apportioned on a yearly basis in accordance with this paragraph whether or not any natural resource was being taken from the land at the time the trust was established. The receipts from these properties must be allocated in accordance with what is reasonable and equitable in view of the interests of those entitled to income as well as of those entitled to principal. The amount allocated to principal must be presumed to be reasonable and equitable if it is neither substantially more nor less than the amount allowable as a deduction for depletion, amortization, depreciation, or similar costs under the Internal Revenue Code of 1986. Any allocated amount must be added to principal as an allowance for depletion of the asset. The balance of the gross receipts, after payment from the receipts of all direct and indirect expenses, is income.\nThis section does not apply to timber.",
	"repealed": false
}