{
	"id": "60K.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.52",
	"title": "60K.52 USE AND SHARING OF LICENSING AND INVESTIGATIVE DATA.",
	"text": "In order to assist in the performance of the commissioner's duties under sections 60K.30 to 60K.56, the commissioner:\n(1) may share licensing data or any active or inactive investigative data with other state, federal, and international regulatory agencies, with the National Association of Insurance Commissioners, its affiliates or subsidiaries, and with state, federal, and international law enforcement authorities if the recipient agrees to maintain the data in a manner consistent with its data classification;\n(2) may receive documents, materials, or information, including otherwise confidential and privileged documents, materials, or information, from the National Association of Insurance Commissioners, its affiliates or subsidiaries, and from regulatory and law enforcement officials of other foreign or domestic jurisdictions, and shall maintain as confidential or privileged any document, material, or information received with notice or the understanding that it is confidential or privileged under the laws of the jurisdiction that is the source of the document, material, or information; and\n(3) may enter into agreements governing sharing and use of information consistent with this subdivision.\nNo waiver of any applicable privilege or claim of confidentiality in the documents, materials, or information occurs as a result of disclosure to the commissioner under this section or as a result of sharing as authorized in this subdivision.\nNothing in sections 60K.30 to 60K.56 prohibits the commissioner from releasing information concerning final, adjudicated actions, including for-cause terminations, to a database or other clearinghouse service maintained by the National Association of Insurance Commissioners, its affiliates, or subsidiaries of the National Association of Insurance Commissioners.\nAn insurer, the authorized representative of the insurer, or a producer that fails to report as required under this section or that is found to have reported with actual malice by a court of competent jurisdiction may, after notice and hearing, have its license or certificate of authority suspended or revoked and may be fined in accordance with section 45.027.",
	"repealed": false
}