{
	"id": "469.034",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.034",
	"title": "469.034 BOND ISSUE FOR CORPORATE PURPOSES.",
	"text": "An authority may issue bonds for any of its corporate purposes. The bonds may be the type the authority determines, including bonds on which the principal and interest are payable exclusively from the income and revenues of the project financed with the proceeds of the bonds, or exclusively from the income and revenues of certain designated projects, whether or not they are financed in whole or in part with the proceeds of the bonds. The bonds may be additionally secured by (1) a pledge of any grant or contributions from the federal government or other source, (2) a pledge of any income or revenues of the authority from the project for which the proceeds of the bonds are to be used, or (3) a mortgage of any project or other property of the authority.\n(a) An authority may pledge the general obligation of the general jurisdiction governmental unit as additional security for bonds payable from income or revenues of the project or the authority. The authority must find that the pledged revenues will equal or exceed 110 percent of the principal and interest due on the bonds for each year. The proceeds of the bonds must be used for a qualified housing development project or projects. The obligations must be issued and sold in the manner and following the procedures provided by chapter 475, except the obligations are not subject to approval by the electors, and the maturities may extend to not more than 35 years for obligations sold to finance housing for the elderly and 40 years for other obligations issued under this subdivision. The authority is the municipality for purposes of chapter 475.\n(b) The principal amount of the issue must be approved by the governing body of the general jurisdiction governmental unit whose general obligation is pledged. Public hearings must be held on issuance of the obligations by both the authority and the general jurisdiction governmental unit. The hearings must be held at least 15 days, but not more than 120 days, before the sale of the obligations.\n(c) The maximum amount of general obligation bonds that may be issued and outstanding under this section equals the greater of (1) one-half of one percent of the estimated market value of the general jurisdiction governmental unit whose general obligation is pledged, or (2) $5,000,000. In the case of county or multicounty general obligation bonds, the outstanding general obligation bonds of all cities in the county or counties issued under this subdivision must be added in calculating the limit under clause (1).\n(d) \"General jurisdiction governmental unit\" means the city in which the housing development project is located. In the case of a county or multicounty authority, the county or counties may act as the general jurisdiction governmental unit. In the case of a multicounty authority, the pledge of the general obligation is a pledge of a tax on the taxable property in each of the counties.\n(e) \"Qualified housing development project\" means a housing development project providing housing either for the elderly or for individuals and families with incomes not greater than 80 percent of the median family income as estimated by the United States Department of Housing and Urban Development for the standard metropolitan statistical area or the nonmetropolitan county in which the project is located. The project must be owned for the term of the bonds either by the authority or by a limited partnership or other entity in which the authority or another entity under the sole control of the authority is the sole general partner and the partnership or other entity must receive (1) an allocation from the Department of Management and Budget or an entitlement issuer of tax-exempt bonding authority for the project and a preliminary determination by the Minnesota Housing Finance Agency or the applicable suballocator of tax credits that the project will qualify for four percent low-income housing tax credits or (2) a reservation of nine percent low-income housing tax credits from the Minnesota Housing Finance Agency or a suballocator of tax credits for the project. A qualified housing development project may admit nonelderly individuals and families with higher incomes if:\n(1) three years have passed since initial occupancy;\n(2) the authority finds the project is experiencing unanticipated vacancies resulting in insufficient revenues, because of changes in population or other unforeseen circumstances that occurred after the initial finding of adequate revenues; and\n(3) the authority finds a tax levy or payment from general assets of the general jurisdiction governmental unit will be necessary to pay debt service on the bonds if higher income individuals or families are not admitted.\n(f) The authority may issue bonds to refund bonds issued under this subdivision in accordance with section 475.67. The finding of the adequacy of pledged revenues required by paragraph (a) and the public hearing required by paragraph (b) shall not apply to the issuance of refunding bonds. This paragraph applies to refunding bonds issued on and after July 1, 1992.\nNo proceeds of bonds issued for or revenue authorized for or derived from any redevelopment project or area shall be used to pay the bonds or costs of, or make contributions or loans to, any public housing project. The proceeds of bonds issued for or revenues authorized for or derived from any one public housing project shall not be used to pay the bonds or costs of, or make contributions or loans to any other public housing project until the bonds and costs of the public housing project for which those bonds were issued or from which those revenues were derived or for which they were authorized shall be fully paid.\nNeither the commissioners of an authority nor any person executing the bonds shall be liable personally on the bonds by reason of the issuance thereof. Except as provided in subdivision 2, the bonds of an authority shall not be a debt of the city, the state, or any political subdivision, and neither the city nor the state or any political subdivision shall be liable on them, nor shall the bonds be payable out of any funds or properties other than those of the authority; the bonds shall state this on their face. The bonds shall not constitute an indebtedness within the meaning of any constitutional or statutory debt limitation or restriction, except as provided in subdivision 2. Bonds of an authority are declared to be issued for an essential public and governmental purpose and to be public instrumentalities.\nThe provisions of sections 469.001 to 469.047 exempting from taxation authorities, their properties and income, shall be considered additional security for the repayment of bonds and shall constitute, by virtue of sections 469.001 to 469.047 and without the same being restated in the bonds, a contract between the (1) bondholders and each of them, including all transferees of the bonds, and (2) the respective authorities issuing the bonds and the state. An authority may by covenant confer upon the holder of the bonds the rights and remedies it deems necessary or advisable, including the right in the event of default to have a receiver appointed to take possession of and operate the project. When the obligations issued by an authority to assist in financing the development of a project have been retired and federal contributions have been discontinued, the exemptions from taxes and special assessments for that project shall terminate.",
	"repealed": false
}