{
	"id": "41D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/41D.03",
	"title": "41D.03 MINNESOTA CENTER FOR AGRICULTURAL EDUCATION.",
	"text": "The Minnesota Center for Agricultural Education is governed by the Minnesota Agricultural Education Leadership Council.\n(a) The council has the powers necessary for the care, management, and control of the Minnesota Center for Agricultural Education and all its real and personal property. The powers shall include, but are not limited to, those listed in this subdivision.\n(b) The council may employ necessary employees, and contract for other services to ensure the efficient operation of the Center for Agricultural Education.\n(c) The council may receive and award grants. The council may establish a charitable foundation and accept, in trust or otherwise, any gift, grant, bequest, or devise for educational purposes and hold, manage, invest, and dispose of them and the proceeds and income of them according to the terms and conditions of the gift, grant, bequest, or devise and its acceptance. The council shall adopt internal procedures to administer and monitor aids and grants.\n(d) The council may establish or coordinate evening, continuing education, and summer programs for teachers and pupils.\n(e) The council may determine the location for the Minnesota Center for Agricultural Education and any additional facilities related to the center, including the authority to lease a temporary facility.\n(f) The council may enter into contracts with other public and private agencies and institutions for building maintenance services if it determines that these services could be provided more efficiently and less expensively by a contractor than by the council itself. The council may also enter into contracts with public or private agencies and institutions, school districts or combinations of school districts, or educational cooperative service units to provide supplemental educational instruction and services.\nThere is established in the state treasury a center for agricultural education account in the special revenue fund. All money collected by the council, including rental income, shall be deposited in the account. Money in the account, including interest earned, is appropriated to the council for the operation of its services and programs.\nThe employees hired under this subdivision and any other necessary employees hired by the council shall be employees of the University of Minnesota.\nThe council may adopt administrative policies about the operation of the center.\nPublic postsecondary institutions shall provide space for the Minnesota Center for Agricultural Education at a reasonable cost to the center to the extent that space is available at the public postsecondary institutions.\nTechnical educational equipment may be procured for programs of the Minnesota Center for Agricultural Education by the council either by brand designation or in accordance with standards and specifications the council may adopt, notwithstanding chapter 16C.",
	"repealed": false
}