{
	"id": "354B.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/354B.25",
	"title": "354B.25 INDIVIDUAL RETIREMENT ACCOUNT PLAN ADMINISTRATION.",
	"text": "The individual retirement account plan is the administrative responsibility of the Board of Trustees of the Minnesota State Colleges and Universities. The Board of Trustees of the Minnesota State Colleges and Universities may administer the plan directly or may contract out for administrative services with a qualified third-party plan administrative entity and may contract out for investment review and selection service.\n[Repealed, 2007 c 133 art 2 s 13]\n(a) The plan administrator shall arrange for the purchase of investment products.\n(b) The investment products must be purchased with contributions under section 354B.23 or with money or assets otherwise provided by law by authority of the board.\n(c) Various investment accounts offered through the Minnesota supplemental investment fund established under section 11A.17 and administered by the State Board of Investment may be included as investment products for the individual retirement account plan. Direct access must also be provided to lower expense and no-load mutual funds, as those terms are defined by the federal Securities and Exchange Commission, including stock funds, bond funds, and balanced funds. Other investment products or combination of investment products which may be included are:\n(1) savings accounts at federally insured financial institutions;\n(2) life insurance contracts, fixed and variable annuity contracts from companies that are subject to regulation by the commerce commissioner;\n(3) investment options from open-ended investment companies registered under the federal Investment Company Act of 1940, United States Code, title 15, sections 80a-1 to 80a-64;\n(4) investment options from a firm that is a registered investment advisor under the federal Investment Advisers Act of 1940, United States Code, title 15, sections 80b-1 to 80b-21; and\n(5) investment options of a bank as defined in United States Code, title 15, section 80b-2, subsection (a), paragraph 2, or a bank holding company as defined in the Bank Holding Company Act of 1956, United States Code, title 12, section 1841, subsection (a), paragraph (1).\n(a) The investment options provided under subdivision 2 must be selected by the board. The board may contract with the State Board of Investment or with a third party to provide the investment review and selection services. The board must not contract with a third party to provide the investment option review and selection services if the third party markets, offers, or has other material interest in investment products. The board must require any third party contracted to provide investment review and selection services to disclose to the board any contracts for services and any financial relationships it has with vendors under consideration to provide investment products under the plan.\nIn making its selection, at a minimum, the board shall consider the following:\n(1) the experience and ability of the financial institution to provide benefits and products that are suited to meet the needs of plan participants;\n(2) the relationship of those benefits and products provided by the financial institution to their cost;\n(3) the financial strength and stability of the financial institution; and\n(4) the fees and expenses associated with the investment products in comparison to other products of similar risk and rates of return.\n(b) After selecting a financial institution, the board must periodically review each financial institution and the offered products. The periodic review must occur at least every three years. In making its review, the board may retain appropriate consulting services to assist it in its periodic review, establish a budget for the cost of the periodic review process, and charge a proportional share of these costs to the reviewed financial institution.\n(c) Contracts with financial institutions under this section must be executed by the board.\nThe retirement benefits provided by the annuity contracts and custodial accounts of the individual retirement account plan are held for the benefit of plan participants and must be paid according to this chapter and the plan document.\n(a) The reasonable and necessary administrative expenses of the individual retirement account plan may be charged to plan participants by the plan sponsor in the form of an annual fee, an asset-based fee, a percentage of the contributions to the plan, or a combination thereof. This amount shall be offset by interest earned on both the plan reserves and unclaimed funds account.\n(b) Any administrative expense charge that is not actually needed for the administrative expenses of the individual retirement account plan must be refunded to member accounts.\n(c) The Board of Trustees shall report annually, before October 1, to the advisory committee created in subdivision 1a on administrative expenses of the plan. The report must include a detailed accounting of charges for administrative expenses collected from plan participants and expenditure of the administrative expense charges. The administrative expense charges collected from plan participants must be kept in a separate account from any other funds under control of the Board of Trustees and may be used only for the necessary and reasonable administrative expenses of the plan.\n(a) Any unclaimed plan account amounts are presumed to be abandoned, but are not subject to the provisions of sections 345.31 to 345.60. If the account remains unclaimed after five years following the date that the plan administrator first attempts to locate the former member, surviving spouse, or other beneficiary, the unclaimed plan account amount cancels and must be credited to the reserve account specified in paragraph (b).\n(b) The board must establish a separate account to receive unclaimed plan account amounts. A portion of this reserve account and any investment earnings attributable to this reserve account are to be used to offset the reasonable and necessary expenses of the individual retirement account plan, including costs incurred in efforts to locate lost participants, surviving spouses, or other beneficiaries.\n(c) If the unclaimed plan account amount exceeded $25 and the inactive member, surviving spouse, or beneficiary, whichever is applicable, establishes a valid claim to the forfeited account, the forfeited account is to be reestablished in an amount equal to the amount originally forfeited. The board must ensure that the reserve account has sufficient assets to cover any transfers needed to reestablish accounts.",
	"repealed": false
}