{
	"id": "148E.220",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.220",
	"title": "148E.220 RELATIONSHIPS WITH CLIENTS, FORMER CLIENTS, AND OTHERS.",
	"text": "(a) A social worker is responsible for acting professionally in relationships with clients or former clients. A client or a former client's initiation of, or attempt to engage in, or request to engage in, a personal, sexual, or business relationship is not a defense to a violation of this section.\n(b) When a relationship is permitted by this section, social workers who engage in such a relationship assume the full burden of demonstrating that the relationship will not be detrimental to the client or the professional relationship.\nA social worker must maintain appropriate professional boundaries with a client. A social worker must not engage in practices with clients that create an unacceptable risk of client harm or of impairing a social worker's objectivity or professional judgment. A social worker must not act or fail to act in a way that, as judged by a reasonable and prudent social worker, inappropriately encourages the client to relate to the social worker outside of the boundaries of the professional relationship, or in a way that interferes with the client's ability to benefit from social work services from the social worker.\nA social worker must not use the professional relationship with a client, student, supervisee, or intern to further the social worker's personal, emotional, financial, sexual, religious, political, or business benefit or interests.\nA social worker must not terminate a professional relationship for the purpose of beginning a personal, sexual, or business relationship with a client.\n(a) Except as provided in paragraph (b), a social worker must not engage in a personal relationship with a client that creates a risk of client harm or of impairing a social worker's objectivity or professional judgment.\n(b) Notwithstanding paragraph (a), if a social worker is unable to avoid a personal relationship with a client, the social worker must take appropriate precautions, such as consultation or supervision, to address the potential for risk of client harm or of impairing a social worker's objectivity or professional judgment.\nA social worker may engage in a personal relationship with a former client after appropriate termination of the professional relationship, except:\n(1) as prohibited by subdivision 8; or\n(2) if a reasonable and prudent social worker would conclude after appropriate assessment that (i) the former client is emotionally dependent on the social worker or continues to relate to the social worker as a client, or (ii) the social worker is emotionally dependent on the client or continues to relate to the former client as a social worker.\nA social worker must not engage in or suggest sexual conduct with a client.\n(a) A social worker who has engaged in diagnosing, counseling, or treating a client with mental, emotional, or behavioral disorders must not engage in or suggest sexual conduct with the former client under any circumstances for a period of two years following the termination of the professional relationship. After two years following the termination of the professional relationship, a social worker who has engaged in diagnosing, counseling, or treating a client with a mental, emotional, or behavioral disorder must not engage in or suggest sexual conduct with the former client under any circumstances unless:\n(1) the social worker did not intentionally or unintentionally coerce, exploit, deceive, or manipulate the former client at any time;\n(2) the social worker did not represent to the former client that sexual conduct with the social worker is consistent with or part of the client's treatment;\n(3) the social worker's sexual conduct was not detrimental to the former client at any time;\n(4) the former client is not emotionally dependent on the social worker and does not continue to relate to the social worker as a client; and\n(5) the social worker is not emotionally dependent on the client and does not continue to relate to the former client as a social worker.\n(b) If there is an alleged violation of paragraph (a), the social worker assumes the full burden of demonstrating to the board that the social worker did not intentionally or unintentionally coerce, exploit, deceive, or manipulate the client, and the social worker's sexual conduct was not detrimental to the client at any time. Upon request, a social worker must provide information to the board addressing:\n(1) the amount of time that has passed since termination of services;\n(2) the duration, intensity, and nature of services;\n(3) the circumstances of termination of services;\n(4) the former client's emotional, mental, and behavioral history;\n(5) the former client's current emotional, mental, and behavioral status;\n(6) the likelihood of adverse impact on the former client; and\n(7) the existence of actions, conduct, or statements made by the social worker during the course of services suggesting or inviting the possibility of a sexual relationship with the client following termination of services.\n(c) A social worker who has provided social work services other than those described in paragraph (a) to a client must not engage in or suggest sexual conduct with the former client if a reasonable and prudent social worker would conclude after appropriate assessment that engaging in such behavior with the former client would create an unacceptable risk of harm to the former client.\n(a) A social worker must not engage in or suggest sexual conduct with a student while the social worker has authority over any part of the student's academic program.\n(b) A social worker supervising an intern must not engage in or suggest sexual conduct with the intern during the course of the internship.\n(c) A social worker practicing social work as a supervisor must not engage in or suggest sexual conduct with a supervisee during the period of supervision.\nA social worker must not engage in any physical, oral, written, or electronic behavior that a client, former client, student, supervisee, or intern may reasonably interpret as sexually harassing or sexually demeaning.\nA social worker must not purchase goods or services from a client or otherwise engage in a business relationship with a client except when:\n(1) a social worker purchases goods or services from the client and a reasonable and prudent social worker would determine that it is not practical or reasonable to obtain the goods or services from another provider; and\n(2) engaging in the business relationship will not be detrimental to the client or the professional relationship.\nA social worker may purchase goods or services from a former client or otherwise engage in a business relationship with a former client after appropriate termination of the professional relationship unless a reasonable and prudent social worker would conclude after appropriate assessment that:\n(1) the former client is emotionally dependent on the social worker and purchasing goods or services from the former client or otherwise engaging in a business relationship with the former client would be detrimental to the former client; or\n(2) the social worker is emotionally dependent on the former client and purchasing goods or services from the former client or otherwise engaging in a business relationship with the former client would be detrimental to the former client.\n(a) A social worker must not engage in a social worker/client relationship with an individual with whom the social worker had a previous sexual relationship.\n(b) A social worker must not engage in a social worker/client relationship with an individual with whom the social worker had a previous personal or business relationship if a reasonable and prudent social worker would conclude after appropriate assessment that the social worker/client relationship would create an unacceptable risk of client harm or that the social worker's objectivity or professional judgment may be impaired.\n(a) Unless authorized by law, a social worker must not offer medication or controlled substances to a client.\n(b) A social worker must not accept medication or controlled substances from a client, except that if authorized by law, a social worker may accept medication or controlled substances from a client for purposes of disposal or to monitor use.\n(c) A social worker must not offer alcoholic beverages to a client except when the offer is authorized or prescribed by a physician or is offered according to a client's care plan.\n(d) A social worker must not accept alcoholic beverages from a client.\nSubdivisions 1 to 14 apply to a social worker's relationship with a client's family or household member when a reasonable and prudent social worker would conclude after appropriate assessment that a relationship with a family or household member would create an unacceptable risk of harm to the client.",
	"repealed": false
}