{
	"id": "122A.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.70",
	"title": "122A.70 TEACHER MENTORSHIP AND RETENTION OF EFFECTIVE TEACHERS.",
	"text": "(a) School districts must develop teacher mentoring programs for teachers new to the profession or district, including teaching residents, teachers of color, teachers who are American Indian, teachers in license shortage areas, teachers with special needs, or experienced teachers in need of peer coaching.\n(b) Teacher mentoring programs must be included in or aligned with districts' teacher evaluation and peer review processes under sections 122A.40, subdivision 8, and 122A.41, subdivision 5. A district may use staff development revenue under section 122A.61, special grant programs established by the legislature, or another funding source to pay a stipend to a mentor who may be a current or former teacher who has taught at least three years and is not on an improvement plan.\n(a) The Professional Educator Licensing and Standards Board must make grant application forms available to sites interested in developing, sustaining, or expanding a mentorship program.\n(b) The following applicants are eligible for a program grant:\n(1) a school district, charter school, or cooperative unit, on behalf of its participating school sites;\n(2) a Tribal contract school;\n(3) a coalition of teachers; and\n(4) a coalition of two or more applicants that are individually eligible for a grant.\nA higher education institution or nonprofit organization may partner with an eligible grant applicant but is not eligible as a sole applicant for grant funds.\n(c) The Professional Educator Licensing and Standards Board, in consultation with the teacher mentoring task force, must approve or disapprove the applications. To the extent possible, the approved applications must reflect effective mentoring, professional development, and retention components, and be geographically distributed throughout the state. The Professional Educator Licensing and Standards Board must encourage the selected sites to consider the use of its assessment procedures.\n(a) Grant funds may be used for the following:\n(1) additional stipends as incentives to mentors who are of color or who are American Indian;\n(2) financial supports for professional learning community affinity groups across schools within and between districts for educators from underrepresented racial and ethnic groups to come together throughout the school year. For purposes of this section, \"affinity groups\" means groups of licensed and nonlicensed educators who share a common racial or ethnic identity in society as persons who are of color or who are American Indian;\n(3) programs for induction aligned with the district or school mentorship program during the first three years of teaching, especially for teachers from underrepresented racial and ethnic groups;\n(4) professional development focused on ways to close opportunity and achievement gaps for students of color and American Indian students; or\n(5) for teachers of color and American Indian teachers, graduate courses toward a first master's degree in a field related to their licensure or toward an additional license.\n(b) A charter school or district that receives a grant must negotiate additional retention strategies or protection from unrequested leaves of absence in the beginning years of employment for teachers who are of color or who are American Indian. Retention strategies may include providing financial incentives for teachers of color and teachers who are American Indian to work in the school or district for at least five years and placing American Indian educators at sites with other American Indian educators and educators of color at sites with other educators of color to reduce isolation and increase opportunity for collegial support.\n(a) At a minimum, applicants for grants under subdivision 2 must express commitment to:\n(1) allow staff participation;\n(2) assess skills of both beginning and mentor teachers;\n(3) provide appropriate in-service to needs identified in the assessment;\n(4) provide leadership to the effort;\n(5) cooperate with higher education institutions or teacher educators;\n(6) provide facilities and other resources;\n(7) share findings, materials, and techniques with other school districts; and\n(8) retain teachers of color and teachers who are American Indian.\n(b) The Professional Educator Licensing and Standards Board must give priority to applications to fund programs to induct, mentor, and retain Tier 2 or Tier 3 teachers who are of color or who are American Indian, and Tier 2 or Tier 3 teachers in licensure shortage areas within the applicant's economic development region.\nGrant applicants must seek additional funding and assistance from sources such as school districts, postsecondary institutions, foundations, and the private sector.\nA grant recipient may use grant funds on implementing activities over a period of time up to 24 months. New and expanding mentorship sites that receive a board grant under subdivision 2 to design, develop, implement, and evaluate their program must participate in activities that support program development and implementation.\nThe Professional Educator Licensing and Standards Board may enter into an interagency agreement with the Office of Higher Education or the Department of Education. The agreement may include a transfer of funds to the Office of Higher Education or the Department of Education to help administer the competitive grant process.\nBy September 30 of each year after receiving a grant, recipients must submit a report to the Professional Educator Licensing and Standards Board on program efforts that describes mentoring and induction activities and assesses the impact of these programs on teacher effectiveness and retention. The board must publish a summary report for the public and submit the report to the committees of the legislature with jurisdiction over kindergarten through grade 12 education policy and finance in accordance with section 3.302 by November 30 of each year.",
	"repealed": false
}