{
	"id": "282.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.09",
	"title": "282.09 FORFEITED TAX SALE FUND.",
	"text": "The county auditor and county treasurer shall place all money received through the operation of sections 282.01 to 282.13 in a fund to be known as the forfeited tax sale fund, and all disbursements and costs must be charged against that fund, when allowed by the county board. Members of the county board may be paid a per diem pursuant to section 375.055, subdivision 1, and reimbursed for their necessary expenses, and may receive mileage as fixed by law. The amount of compensation of a land commissioner and assistants, if a land commissioner is appointed, must be determined by the county board. The county auditor must receive 50 cents for each certificate of sale, each contract for deed and each lease executed by the auditor, and, in counties where no land commissioner is appointed, additional annual compensation, not exceeding $300, as fixed by the county board. The amount of compensation of any other clerical help needed by the county auditor or land commissioner must be determined by the county board. All compensation provided for in this subdivision is in addition to other compensation allowed by law. Fees so charged in addition to the fee imposed in section 282.014 must be included in the annual settlement by the county auditor as hereinafter provided. On or before February 1 each year, the commissioner of revenue shall certify to the commissioner of management and budget, by counties, the total number of state deeds issued and reissued during the preceding calendar year for which such fees are charged and the total amount of fees. On or before March 1 each year, each county shall remit to the commissioner of revenue, from the forfeited tax sale fund, the aggregate amount of the fees imposed by section 282.014 in the preceding calendar year. The commissioner of revenue shall deposit the amounts received in the state treasury to the credit of the general fund. When disbursements are made from the fund for repairs, refunds, expenses of actions to quiet title, or any other purpose which particularly affects specific parcels of forfeited lands, the amount of the disbursements must be charged to the forfeited tax sale fund. The county auditor shall make an annual settlement of the net proceeds received from sales and rentals by the operation of sections 282.01 to 282.13, on the settlement day determined in section 276.09, for the preceding calendar year.\nIn all counties, the authorities responsible for carrying out the duties imposed by sections 282.01 to 282.13, at their discretion, may expend moneys from the forfeited tax sale fund to repair any sewer or water main either inside or outside of any curb line situated along any property forfeited to the state for nonpayment of taxes, to acquire and maintain equipment used exclusively for the maintenance and improvement of tax-forfeited lands, to cut down, otherwise destroy or eradicate noxious weeds on all tax-forfeited lands, and to maintain tax-forfeited lands.",
	"repealed": false
}