{
	"id": "142E.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.54",
	"title": "142E.54 RECORD RETENTION.",
	"text": "The following records must be maintained, controlled, and made immediately accessible to license holders, providers, and controlling individuals. The records must be organized and labeled to correspond to categories that make them easy to identify so that they can be made available immediately upon request to an investigator acting on behalf of the commissioner at the provider's place of business:\n(1) payroll ledgers, canceled checks, bank deposit slips, and any other accounting records;\n(2) daily attendance records required by and that comply with section 142E.16, subdivision 7;\n(3) billing transmittal forms requesting payments from the child care assistance program and billing adjustments related to child care assistance program payments;\n(4) records identifying all persons, corporations, partnerships, and entities with an ownership or controlling interest in the provider's child care business;\n(5) employee records identifying those persons currently employed by the provider's child care business or who have been employed by the business at any time within the previous five years. The records must include each employee's name, hourly and annual salary, qualifications, position description, job title, and dates of employment. In addition, employee records that must be made available include the employee's time sheets, current home address of the employee or last known address of any former employee, and documentation of background studies required under this chapter or chapter 245C;\n(6) records related to transportation of children in care, including but not limited to:\n(i) the dates and times that transportation is provided to children for transportation to and from the provider's business location for any purpose. For transportation related to field trips or locations away from the provider's business location, the names and addresses of those field trips and locations must also be provided;\n(ii) the name, business address, phone number, and website address, if any, of the transportation service utilized; and\n(iii) all billing or transportation records related to the transportation.\n(a) A provider, license holder, or controlling individual must retain all records in subdivision 1 for at least six years after the last date of service. Microfilm or electronically stored records satisfy the record-keeping requirements of this subdivision.\n(b) In the event of an appealed case, the provider must retain all records required in subdivision 1 for the duration of the appeal or six years, whichever is longer.\nA provider, license holder, or controlling individual who withdraws or is terminated from the child care assistance program must retain the records required under subdivision 1 and make them available to the department on demand.\nIf the ownership of a provider changes, the transferor, unless otherwise provided by law or by written agreement with the transferee, is responsible for maintaining, preserving, and upon request from the department, making available the records related to the provider that were generated before the date of the transfer. Any written agreement affecting this provision must be held in the possession of the transferor and transferee. The written agreement must be provided to the department or county immediately upon request, and the written agreement must be retained by the transferor and transferee for six years after the agreement is fully executed.\nA provider's use of electronic record keeping or electronic signatures is governed by chapter 325L.",
	"repealed": false
}