{
	"id": "62J.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.23",
	"title": "62J.23 PROVIDER CONFLICTS OF INTEREST.",
	"text": "The commissioner of health shall adopt rules restricting financial relationships or payment arrangements involving health care providers under which a person benefits financially by referring a patient to another person, recommending another person, or furnishing or recommending an item or service. The rules must be compatible with, and no less restrictive than, the federal Medicare antikickback statute, in section 1128B(b) of the Social Security Act, United States Code, title 42, section 1320a-7b(b), and regulations adopted under it. However, the commissioner's rules may be more restrictive than the federal law and regulations and may apply to additional provider groups and business and professional arrangements. When the state rules restrict an arrangement or relationship that is permissible under federal laws and regulations, including an arrangement or relationship expressly permitted under the federal safe harbor regulations, the fact that the state requirement is more restrictive than federal requirements must be clearly stated in the rule.\n(a) From July 1, 1992, until rules are adopted by the commissioner under this section, the restrictions in the federal Medicare antikickback statutes in section 1128B(b) of the Social Security Act, United States Code, title 42, section 1320a-7b(b), and rules adopted under the federal statutes, apply to all persons in the state, regardless of whether the person participates in any state health care program.\n(b) Nothing in paragraph (a) shall be construed to prohibit an individual from receiving a discount or other reduction in price or a limited-time free supply or samples of a prescription drug, medical supply, or medical equipment offered by a pharmaceutical manufacturer, medical supply or device manufacturer, health plan company, or pharmacy benefit manager, so long as:\n(1) the discount or reduction in price is provided to the individual in connection with the purchase of a prescription drug, medical supply, or medical equipment prescribed for that individual;\n(2) it otherwise complies with the requirements of state and federal law applicable to enrollees of state and federal public health care programs;\n(3) the discount or reduction in price does not exceed the amount paid directly by the individual for the prescription drug, medical supply, or medical equipment; and\n(4) the limited-time free supply or samples are provided by a physician, advanced practice registered nurse, physician assistant, or pharmacist, as provided by the federal Prescription Drug Marketing Act.\nFor purposes of this paragraph, \"prescription drug\" includes prescription drugs that are administered through infusion, injection, or other parenteral methods, and related services and supplies.\n(c) No benefit, reward, remuneration, or incentive for continued product use may be provided to an individual or an individual's family by a pharmaceutical manufacturer, medical supply or device manufacturer, or pharmacy benefit manager, except that this prohibition does not apply to:\n(1) activities permitted under paragraph (b);\n(2) a pharmaceutical manufacturer, medical supply or device manufacturer, health plan company, or pharmacy benefit manager providing to a patient, at a discount or reduced price or free of charge, ancillary products necessary for treatment of the medical condition for which the prescription drug, medical supply, or medical equipment was prescribed or provided; and\n(3) a pharmaceutical manufacturer, medical supply or device manufacturer, health plan company, or pharmacy benefit manager providing to a patient a trinket or memento of insignificant value.\n(d) Nothing in this subdivision shall be construed to prohibit a health plan company from offering a tiered formulary with different co-payment or cost-sharing amounts for different drugs.\nThe commissioner may assess a fine against a person who violates this section. The amount of the fine is $1,000 or 110 percent of the estimated financial benefit that the person realized as a result of the prohibited financial arrangement or payment relationship, whichever is greater. A person who is in compliance with a transition plan approved by the commissioner under subdivision 2, or who is making a good faith effort to obtain the commissioner's approval of a transition plan, is not in violation of this section.\n(a) The legislature finds that the formation and operation of community integrated service networks will accomplish the purpose of the federal Medicare antikickback statute, which is to reduce the overutilization and overcharging that may result from inappropriate provider incentives. Accordingly, it is the public policy of the state of Minnesota to support the development of community integrated service networks. The legislature finds that the federal Medicare antikickback laws should not be interpreted to interfere with the development of community integrated service networks or to impose liability for arrangements between an integrated service network or a community integrated service network and its participating entities.\n(b) An arrangement between a community integrated service network and any or all of its participating entities is not subject to liability under subdivisions 1 and 2.\nThe commissioner may audit the referral patterns of providers that qualify for exceptions under the federal Stark Law, United States Code, title 42, section 1395nn. The commissioner has access to provider records according to section 144.99, subdivision 2. The commissioner shall report to the legislature any audit results that reveal a pattern of referrals by a provider for the furnishing of health services to an entity with which the provider has a direct or indirect financial relationship.",
	"repealed": false
}