{
	"id": "260.693",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.693",
	"title": "260.693 AFRICAN AMERICAN AND DISPROPORTIONATELY REPRESENTED FAMILY PRESERVATION GRANTS.",
	"text": "The commissioner shall establish direct grants to organizations, service providers, and programs owned and led by African Americans and other individuals from communities disproportionately represented in the child welfare system to provide services and support for African American and disproportionately represented children and their families involved in Minnesota's child welfare system, including supporting existing eligible services and facilitating the development of new services and providers, to create a more expansive network of service providers available for African American and disproportionately represented children and their families.\n(a) Services eligible for grants under this section include but are not limited to:\n(1) child out-of-home placement prevention and reunification services;\n(2) family-based services and reunification therapy;\n(3) culturally specific individual and family counseling;\n(4) court advocacy;\n(5) training for and consultation to responsible social services agencies and private social services agencies regarding this act;\n(6) development and promotion of culturally informed, affirming, and responsive community-based prevention and family preservation services that target the children, youth, families, and communities of African American and African heritage experiencing the highest disparities, disproportionality, and overrepresentation in the Minnesota child welfare system;\n(7) culturally affirming and responsive services that work with children and families in their communities to address their needs and ensure child and family safety and well-being within a culturally appropriate lens and framework;\n(8) services to support informal kinship care arrangements; and\n(9) other activities and services approved by the commissioner that further the goals of the Minnesota African American Family Preservation and Child Welfare Disproportionality Act, including but not limited to the recruitment of African American staff and staff from other communities disproportionately represented in the child welfare system to work for responsible social services agencies and licensed child-placing agencies.\n(b) The commissioner may specify the priority of an activity and service based on its success in furthering these goals. The commissioner shall give preference to programs and service providers that are located in or serve counties with the highest rates of child welfare disproportionality for African American and other disproportionately represented children and their families and employ staff who represent the population primarily served.\nGrant money may not be used to supplant funding for existing services or for the following purposes:\n(1) child day care that is necessary solely because of the employment or training for employment of a parent or another relative with whom the child is living;\n(2) foster care maintenance or difficulty of care payments;\n(3) residential treatment facility payments;\n(4) adoption assistance or Northstar kinship assistance payments under chapter 259A or 256N;\n(5) public assistance payments for Minnesota family investment program assistance, supplemental aid, medical assistance, general assistance, general assistance medical care, or community health services; or\n(6) administrative costs for income maintenance staff.\nThe commissioner shall request proposals for grants under subdivisions 1, 2, and 3 and specify the information and criteria required.",
	"repealed": false
}