{
	"id": "60B.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.17",
	"title": "60B.17 POWERS AND DUTIES OF REHABILITATOR.",
	"text": "The commissioner as rehabilitator shall employ a special deputy commissioner to rehabilitate the insurer. The special deputy shall have all of the powers of the rehabilitator granted under this section. Subject to court approval, the commissioner shall make arrangements for compensation as are necessary to obtain a special deputy of proven ability. The special deputy shall serve at the pleasure of the commissioner.\nSubject to court approval, the rehabilitator may take such action as that person deems necessary or expedient to reform and revitalize the insurer. The rehabilitator shall have all the powers of the officers and managers, whose authority shall be suspended, except as they are redelegated by the rehabilitator and shall have full power to direct and manage, to hire and discharge employees subject to any contract rights they may have, and to deal with the property and business of the insurer.\nThe power of the rehabilitator of a health maintenance organization includes the power to transfer coverage obligations to a solvent and voluntary health maintenance organization, insurer, or nonprofit health service plan, and to assign provider contracts of the insolvent health maintenance organization to an assuming health maintenance organization, insurer, or nonprofit health service plan permitted to enter into such agreements. The rehabilitator shall not be required to meet the notice requirements of section 62D.121. Transferees of coverage obligations or provider contracts shall have no liability to creditors or obligees of the health maintenance organization except those liabilities expressly assumed.\nThe rehabilitator may consult with and obtain formal or informal advice and aid of insurance experts.\nIf the rehabilitator finds that there has been criminal or tortious conduct or breach of any contractual or fiduciary obligation detrimental to the insurer by any officer, manager, agent, broker, employee, or other person, the rehabilitator may pursue all appropriate legal remedies on behalf of the insurer.\nThe rehabilitator may prepare a plan for the reorganization, consolidation, conversion, reinsurance, merger, or other transformation of the insurer. Upon application of the rehabilitator for approval of the plan, and after such notice and hearing as the court prescribes, the court may either approve or disapprove the plan proposed, or may modify it and approve it as modified. If it is approved, the rehabilitator shall carry out the plan. In the case of a life insurer, the plan proposed may include the imposition of liens upon the equities of policyholders of the company, if all rights of shareholders are first relinquished. A plan for a life insurer may also propose imposition of a moratorium upon loan and cash surrender rights under policies, for such period and to such an extent as are necessary.\nThe rehabilitator shall have the power to avoid fraudulent transfers under sections 60B.30 and 60B.31.\nThe rehabilitator shall coordinate activities with those of each guaranty association having an interest in the rehabilitation and shall submit a report detailing how coordination will be achieved to the court for its approval within 30 days following appointment, or within the time the court, in its discretion, may establish.\n(a) The rehabilitator of a health maintenance organization, after consultation with the board of directors of the health maintenance organization, has the sole authority to propose a plan of rehabilitation.\n(b) The court shall approve a plan of rehabilitation of a health maintenance organization if it meets the following criteria:\n(1) the plan provides for payments to lien claimants equal to the value of each lien claim on the date of approval of the plan and may provide for payment of lien claims beyond the effective date of the plan and beyond the original repayment period for the obligation underlying the claim where the plan provides sufficient protection for the lien claim during the period for such claim under the rehabilitation plan;\n(2) the plan provides for payment in full of each prior class of claims before payment of the next class;\n(3) the plan provides for payment in full of all claims for taxes of the United States government, except for claims for interest accruing during the rehabilitation or claims for penalties. The plan may provide for payment of the claims over any period of time up to ten years after the effective date of the plan; and\n(4) the plan is fair and equitable as to each class of claims for which the plan does not provide full payment. In determining whether the plan is fair and equitable to these claimants, the court shall consider the feasibility of the plan, the health maintenance organization's ability to generate a significant surplus, the health maintenance organization's need to expend money to change or expand its business, and the injury to enrollees through loss of coverage if such a plan is not approved.\n(c) The plan may provide for transfer of the health maintenance contracts and liquidation of the health maintenance organization.\n(d) The court's approval of a plan of rehabilitation discharges the health maintenance organization from all claims except to the extent provided in the plan.",
	"repealed": false
}