{
	"id": "97B.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.065",
	"title": "97B.065 HUNTING WHILE UNDER INFLUENCE OF ALCOHOL OR CONTROLLED SUBSTANCE.",
	"text": "(a) A person may not take wild animals with a firearm or by archery:\n(1) when the person is under the influence of alcohol;\n(2) when the person is under the influence of a controlled substance, as defined in section 152.01, subdivision 4;\n(3) when the person is under the influence of a combination of any two or more of the elements in clauses (1), (2), and (7);\n(4) when the person's alcohol concentration is 0.08 or more;\n(5) when the person's alcohol concentration as measured within two hours of the time of taking is 0.08 or more;\n(6) when the person is under the influence of an intoxicating substance as defined in section 169A.03, subdivision 11a, and the person knows or has reason to know that the substance has the capacity to cause impairment; or\n(7) when the person is under the influence of cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, an artificially derived cannabinoid, or tetrahydrocannabinols, as those terms are defined in section 342.01.\n(b) An owner or other person having charge or control of a firearm or bow may not authorize or permit an individual the person knows or has reason to believe is under the influence of alcohol or a controlled substance, as provided under paragraph (a), to possess the firearm or bow in this state or on a boundary water of this state.\n(c) A person may not possess a loaded or uncased firearm or an uncased bow afield under any of the conditions in paragraph (a).\nA peace officer may arrest a person for a violation under subdivision 1 without a warrant upon probable cause, without regard to whether the violation was committed in the officer's presence.\nWhen an officer authorized under subdivision 2 to make arrests has reason to believe that the person may be violating or has violated subdivision 1, paragraph (a) or (c), the officer may require the person to provide a breath sample for a preliminary screening test using a device approved by the commissioner of public safety for this purpose. The results of the preliminary screening test must be used for the purpose of deciding whether an arrest should be made under this section and whether to require the chemical tests authorized in section 97B.066, but may not be used in any court action except: (1) to prove that a test was properly required of a person under section 97B.066, or (2) in a civil action arising out of the operation of a firearm or bow and arrow. Following the preliminary screening test, additional tests may be required of the person as provided under section 97B.066. A person who refuses a breath sample is subject to the provisions of section 97B.066 unless, in compliance with that section, the person submits to a blood, breath, or urine test to determine the presence of alcohol or a controlled substance.\nIn a prosecution for a violation of subdivision 1, paragraph (a) or (c), or an ordinance in conformity with it, the admission of evidence of the amount of alcohol or a controlled substance in the person's blood, breath, or urine is governed by section 169A.45.\n(a) A person who violates a prohibition in subdivision 1, or an ordinance in conformity with it, is subject to the penalties provided in section 97A.331.\n(b) A person who hunts during the period the person is prohibited from hunting under subdivision 6 is guilty of a misdemeanor.\nUpon conviction, and in addition to any penalty imposed under subdivision 5, the person is subject to the limitations on hunting provided in section 97A.421.\nThe court shall promptly forward to the commissioner copies of all convictions and criminal and civil penalties imposed under subdivision 5 and section 97B.066, subdivision 2. The commissioner shall notify the convicted person of the period during which the person is prohibited from hunting under subdivision 6 and section 97A.421. The commissioner shall also periodically circulate to appropriate law enforcement agencies a list of all persons who are prohibited from hunting under subdivision 6 and section 97A.421.\nThe state or political subdivision that employs an officer who is authorized under subdivision 2 to make an arrest for violations of subdivision 1 is immune from any liability, civil or criminal, for the care or custody of the hunting equipment in the physical control of the person arrested if the officer acts in good faith and exercises due care.",
	"repealed": false
}