{
	"id": "41B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.08",
	"title": "41B.08 REVENUE BONDS; PURPOSES, TERMS, APPROVAL.",
	"text": "The authority from time to time may issue its negotiable bonds in a principal amount which, in the opinion of the authority, is necessary to provide sufficient funds for achieving its purposes including the making of qualified agricultural loans or the purchase of interests in those loans, the payment of interest on bonds of the authority, the establishment of reserves to secure the bonds, and the payment of all other expenditures of the authority incident to and necessary or convenient to carry out its corporate purposes and powers. Bonds of the administration may be issued as bonds or notes or in any other form authorized by law.\nThe authority from time to time may issue bonds for the purpose of refunding any bonds of the authority then outstanding, including the payment of any redemption premiums thereon and any interest accrued or to accrue to the redemption date next succeeding the date of delivery of those refunding bonds. The proceeds of any refunding bonds may, in the discretion of the authority, be applied to the purchase or payment at maturity of the bonds to be refunded, or to the redemption of such outstanding bonds on the redemption date next succeeding the date of delivery of such refunding bonds and may, pending such application, be placed in escrow to be applied to such purchase, retirement, or redemption. Any such escrowed proceeds, pending such use, may be invested and reinvested in obligations issued or guaranteed by the state or the United States or by any agency or instrumentality thereof, or in certificates of deposit or time deposits secured in a manner determined by the authority, maturing at a time or times appropriate to assure the prompt payment of the principal of and interest and redemption premiums, if any, on the bonds to be refunded. The income earned or realized on any such investment may also be applied to the payment of the bonds to be refunded. After the terms of the escrow have been fully satisfied, any balance of such proceeds and any investment income may be returned to the authority for use by it in any lawful manner. All refunding bonds issued under the provisions of this subdivision must be issued and secured in the manner provided by resolution of the authority.\nAll bonds issued under this section must be negotiable investment securities within the meaning and for all purposes of the Uniform Commercial Code, subject only to any provisions of the bonds and notes for registration. All bonds so issued may be either general obligations of the authority, secured by its full faith and credit, and payable out of any money, assets, or revenues of the authority, subject to the provisions of resolutions or indentures pledging and appropriating particular money, assets, or revenues to particular bonds, or limited obligations of the authority not secured by its full faith and credit, and payable solely from specified sources or assets.\nNo bonds may be issued unless a rating of \"A\" or better has been awarded to the bonds by a national bond rating agency. The \"A\" rating is not required if the bonds are initially sold to corporations or financial institutions for investment purposes and not for the purpose of remarketing the bonds to the public.",
	"repealed": false
}