{
	"id": "16C.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.33",
	"title": "16C.33 DESIGN-BUILD.",
	"text": "A board member may not participate in the review, discussion, or selection of a primary designer, a design-builder, or a firm in which the member has a financial interest.\n(a) Each design-builder must be, employ, or have as a partner, member, coventurer, or subcontractor, persons or a firm with persons who are duly licensed and registered to provide the services required to complete the project and do business in this state.\n(b) A design-builder may contract with the commissioner to provide professional or construction services for which the design-builder is not itself licensed, registered, or qualified to perform, so long as the design-builder provides such services through subcontracts with duly licensed, registered, or otherwise qualified persons in accordance with this section.\n(c) Nothing in this section or section 16C.32 is intended to limit or eliminate the responsibility or liability owed by an architect or engineer on a design-build project to the commissioner and third parties under existing law. The design service portion of a design-build contract is considered a service and not a product.\n(a) Every user agency, except the Capitol Area Architectural and Planning Board, shall submit a written request for a design-builder for its project to the commissioner who shall forward the request to the board, consistent with section 16B.33, subdivision 3, paragraph (a). The University of Minnesota shall follow the process in subdivision 4 to select design-builders for projects that are subject to section 16B.33. The written request must include a description of the project, the total project cost, a description of any special requirements or unique features of the proposed project, and other information requested by the board which will assist the board in carrying out its duties and responsibilities set forth in this section.\n(b) A request for qualifications or proposals soliciting design-builders shall be prepared for each design-build contract pursuant to subdivision 5 or 7. The request for qualifications or proposals shall contain, at a minimum, the following elements:\n(1) the identity of the agency for which the project will be built and that will award the design-build contract;\n(2) procedures for submitting qualifications or proposals, the criteria for evaluation of qualifications or proposals and the relative weight for each criterion and subcriterion, and the procedures for making awards according to the stated criteria and subcriteria, including a reference to the requirements of this section;\n(3) the proposed terms and conditions for the contract;\n(4) the desired qualifications of the design-builder and the desired or permitted areas of construction to be performed by named members of the design-build team, if applicable. The primary designer shall be a named member of the design-build team;\n(5) the schedule for commencement and completion of the project;\n(6) any applicable budget limits for the project;\n(7) the requirements for insurance and statutorily required performance and payment bonds;\n(8) the identification and location of any other information in the possession or control of the agency that the user agency determines is material, which may include surveys, soils reports, drawings or models of existing structures, environmental studies, photographs, or references to public records;\n(9) for a design-build design and price-based selection process, the request shall also include the design criteria package, including the performance and technical requirements for the project, and the functional and operational elements for the delivery of the completed project. The request shall also contain a description of the drawings, specifications, or other submittals to be included with the proposal, with guidance as to the form and level of completeness of the drawings, specifications or submittals that will be acceptable, and the stipend to be paid to the design-builders selected to submit the above described information; and\n(10) the criteria shall not impose unnecessary conditions beyond reasonable requirements to ensure maximum participation of qualified design-builders. The criteria shall not consider the collective bargaining status of the design-builder.\n(c) Notice of requests for qualifications or proposals must be advertised in a manner designated by the commissioner.\n(a) The University of Minnesota may elect to use the design-build method of project delivery for projects involving construction or major remodeling, as defined in section 16B.335, subdivision 1, with an estimated cost greater than $2,000,000, in which case the University of Minnesota shall submit a written request for a design-builder to the commissioner of administration, who shall forward the request to the board, as provided in subdivision 3. For design-build projects undertaken by the University of Minnesota under this subdivision, the Board of Regents shall exercise the powers and duties of the commissioner granted in subdivisions 5, 6, 7, and 8.\n(b) When the University of Minnesota undertakes any other project involving construction, renovation, repair, replacement, or rehabilitation, the Board of Regents may, in addition to any other method of project delivery available to the University of Minnesota, submit a written request for a design-builder to the commissioner of administration, who shall forward the request to the board, as provided in subdivision 3.\n(c) For projects for which the University of Minnesota requests a design-builder, the University of Minnesota may use either the design-build qualifications-based selection process under subdivision 5 or the design-build design and price-based selection process under subdivision 7. The board shall score proposals in accordance with subdivision 5 or 7, as applicable, and narrow the selection to the two highest scoring proposers for recommendation to the Board of Regents. The Board of Regents shall make the final selection and shall notify the board of the selection. Meeting records or written evaluations that document the final selection are public records.\n(d) The University of Minnesota may not utilize design-build contracts for more than five percent of its total projects let, by number, in each of the fiscal years 2006 and 2007, and ten percent of its total projects let, by number, in each fiscal year thereafter, that are funded in whole or in part with proceeds from the sale of state general obligation bonds.\n(a) In a design-build qualifications-based selection process, the following shall apply:\n(b)(1) the commissioner shall establish procedures for determining the appropriate content of each request for qualifications, the weighted criteria and subcriteria to be used to evaluate the design-builders, and the procedures for evaluating qualifications in an open, competitive, and objective manner; (2) the criteria and subcriteria shall include, but are not limited to, the proposer's experience as a constructor or primary designer, including capacity of key personnel, technical competence and capability to perform, the past performance of the proposer and its employees, its safety record and compliance with state and federal law, and availability to and familiarity with the project locale; (3) the commissioner may include in the request for qualifications criteria a requirement that the proposer include the overhead and fee that the design-builder proposes to charge for its construction services; and (4) the commissioner shall issue a request for qualifications that includes the information as described in subdivision 3.\n(c) After obtaining and evaluating qualifications from each design-builder, in accordance with the weighted criteria and subcriteria and procedures set forth in the request for qualifications, the board shall select a short list of at least three and no more than five proposals. The board must receive at least three proposals from design-builders or the commissioner shall either:\n(1) solicit new proposals;\n(2) revise the request for qualifications and thereafter solicit new proposals using the revised request for qualifications; or\n(3) request selection of a primary designer pursuant to section 16B.33, 16C.08, or 16C.087 and proceed with competitive bidding pursuant to sections 16C.25 to 16C.29.\n(d) The board shall conduct formal interviews with the short list of proposers, but shall not disclose any proprietary or confidential information contained in one proposal to another proposer.\n(e) The board shall select the design-builder that scores the highest on the evaluation criteria and subcriteria. The commissioner shall make the award to the design-builder who scores the highest score pursuant to the weighted criteria and subcriteria as determined by the board, unless the commissioner rejects all proposals or proceeds pursuant to paragraphs (g) and (h). In the case of the Minnesota State Colleges and Universities, the board shall narrow the selection to the two design-builders that score the highest on the evaluation criteria and subcriteria for recommendation to the respective commissioner, and the commissioner shall make the final selection and shall notify the board of the selection.\n(f) The commissioner shall conduct fee and contract negotiations with the selected design-builder and shall enter into the contract consistent with subdivision 6.\n(g) If the selected design-builder declines the appointment or is unable to reach agreement with the commissioner on the terms of the contract, the commissioner may, within 60 days after the first selection, request the board to make another selection.\n(h) If the board fails to make a selection and forward its recommendation to the commissioner within 60 days of the request for a second selection, the commissioner may appoint a design-builder without the recommendation of the board.\n(i) If a project for which a design-builder has been selected by the board becomes inactive, lapses, or changes as the result of a project phasing, insufficient appropriations, or other reasons, the commissioner may, if the project is reactivated, retain the same design-builder to complete the project.\n(a) The contract between the commissioner and the design-builder selected under subdivision 5 shall require the following:\n(b) The design-builder shall develop design documents of the project for review and approval by the commissioner prior to project bidding.\n(c) The design-builder shall competitively bid all trade contract work for the project from a list of qualified firms, subject to availability of such qualified firms for the specific work. The list of qualified firms shall be based upon an open, competitive, and objective prequalification process in which the selection criteria includes, in addition to the proposed price, the firm's experience as a constructor or primary designer, including capacity of key personnel, technical competence, capability to perform, the past performance of the firm and its employees, including its safety record and compliance with state and federal law, availability to and familiarity with the project locale, and other considerations as defined by the design-builder and the commissioner. The design-builder and the commissioner shall jointly determine the composition of the list of qualified firms. The criteria shall not impose unnecessary conditions beyond reasonable requirements to ensure maximum participation of qualified contractors.\n(d) With the approval of the commissioner, the design-builder may name either or both a mechanical and electrical subcontractor or subcontractors as a named member of the design-builder's team, and if either or both a mechanical and electrical subcontractor or subcontractors is so named, the design-builder is not required to competitively bid the mechanical or electrical trade contract work. A named mechanical or electrical subcontractor member of a design-builder's team shall competitively bid all subcontracted portions of the mechanical or electrical subcontractor's work from a list of qualified firms. Such qualified firms shall be determined as described in paragraph (c). The commissioner and the design-builder shall agree to a list of labor, materials, and equipment that shall be competitively bid.\n(e) With the commissioner's approval or request, team members of the design-builder, including the design-builder, may also submit bids for trade contract work.\n(f) Either or both the mechanical or electrical subcontractor or subcontractors who are named subcontractor members of the design-builder's team shall enter into guaranteed maximum price contracts with the design-builder.\n(g) The design-builder and the commissioner shall enter into a guaranteed maximum price contract.\n(a) In a design and price-based selection process the following shall apply:\n(1) selection must be based on best value, which includes an evaluation of price and design, and may include other criteria including, but not limited to, the proposer's experience as a constructor or primary designer;\n(2) the commissioner shall establish procedures for determining the appropriate content of each request for qualifications, and the weighted criteria and subcriteria to be used to evaluate the design-builders including, but not limited to, the proposer's experience as a constructor or primary designer, including capacity of key personnel, technical competence, capability to perform and the past performance of the proposer and its employees, its safety record and compliance with state and federal law, quality and past performance, and the procedures for evaluating qualifications in an open, competitive, and objective manner; and\n(3) the commissioner shall issue a request for qualifications that includes the information as described in subdivision 3.\n(b) After obtaining and evaluating qualifications from each design-builder, in accordance with the weighted criteria and subcriteria and procedures set forth in the request for qualifications, the board shall select a short list of three proposers. The board must receive at least three proposals from design-builders or the commissioner shall either:\n(1) solicit new proposals;\n(2) revise the request for qualifications and thereafter solicit new proposals using the revised request for qualifications; or\n(3) request selection of a primary designer pursuant to section 16B.33, 16C.08, or 16C.087 and proceed with competitive bidding pursuant to sections 16C.25 to 16C.29.\n(c) The commissioner shall issue a request for proposals to the selected design-builders. The submitted proposals shall consist of, at a minimum, the following elements:\n(1) preliminary plans and specifications and other information in sufficient detail to describe the character, quality, and scope of the project;\n(2) a design and construction critical path schedule;\n(3) the price at which the design-builder will complete all design and construction requested in the proposal for the project if selected; and\n(4) other materials the board determines are necessary to fix the design, schedule, and cost of the project.\n(d) Proposals must be sealed and may not be opened until the expiration of the time established for making proposals as set forth in the request for proposals.\n(e) Proposals must identify the primary designer and the primary construction contracting entity that are members of the design-builder's team.\n(f) The amount and type of design services requested by the board shall not be exceeded by those submitting proposals. Proposals exceeding the amount and type of design services requested by the board may be rejected by the board. Unless compensated in excess of the minimum stipend for their effort, design-builders must not be required to submit detailed architectural or engineering design or construction documents as part of the proposal.\n(g) Except as described in paragraph (h), the commissioner shall award to each design-builder that submits a responsive design-build proposal under this subdivision, a stipend in an amount of not less than 0.3 percent of the commissioner's estimated cost of design and construction. If the request for proposals requires extensive design services beyond preliminary plans and specifications as requested as part of the proposal, the stipend shall be adjusted to an amount commensurate with the amount of design services requested for each proposal.\n(h) No stipend shall be awarded to the design-builder selected to complete the project.\n(i) For projects where the design-builder accepts the stipend offered by the board, the commissioner shall be deemed the owner of the design, subject to the rights of the proposer to such design for publication and use in other projects. However, the use of the design in its totality, or near totality, by the commissioner is prohibited.\n(j) The commissioner may require each design-builder to submit with its proposal a cash deposit, letter of credit in a form acceptable to the commissioner, or bid bond not to exceed five percent of the maximum cost of the design-builder's proposal. If the proposal is accepted but the design-builder fails, without good cause to execute the design-build contract, the deposit or bond is forfeited in an amount not to exceed the difference between the proposal in question and the next highest proposal.\n(a) The board shall review submissions as described in subdivision 7; conduct formal interviews with all three proposers but not allow the disclosure of any price, proprietary, or confidential information contained in one proposal to another proposer; and select the proposal that scores the highest based on the weighted evaluation criteria and subcriteria, except for projects under the control of Minnesota State Colleges and Universities. The commissioner shall make the award to the design-builder who scores the highest score pursuant to the weighted criteria and subcriteria as determined by the board, unless the commissioner rejects all proposals or proceeds pursuant to paragraph (c) or (d). For Minnesota State Colleges and Universities projects, the board shall narrow the selection to the two highest scoring proposers for recommendation to the commissioner, and the commissioner shall review the submissions as described in subdivision 7; conduct formal interviews with both proposers recommended by the board, but not allow the disclosure of any price, proprietary, or confidential information contained in one proposal to another proposer; and select the proposal that scores the highest based on the commissioner's application of the weighted evaluation criteria and subcriteria; and shall notify the board of the selection.\n(b) After a proposal is accepted, the commissioner is deemed the owner of the design, subject to the rights of the proposer to such design for publication and use in other projects.\n(c) After a proposal is accepted, the commissioner and the design-builder shall enter into a fixed-price contract.\n(d) If the design-builder selected for a project declines the appointment or is unable to reach agreement with the commissioner concerning the terms of the contract, the commissioner may, within 60 days after the first selection, request the board to make another selection.\n(e) If the design-builder selected for a project, prior to executing a design-build contract, replaces either the primary designer or the primary construction contracting entity, the commissioner shall notify the board of the replacement and request the board to either approve the new design-builder or to select another design-builder.\n(f) If the board fails to make a second selection as described in paragraph (d) or (e) and forward its recommendation to the commissioner within 60 days of the commissioner's request for a second selection, the commissioner may appoint a design-builder to the project without the recommendation of the board.",
	"repealed": false
}