{
	"id": "169.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.065",
	"title": "169.065 SAFE ROAD ZONES.",
	"text": "For purposes of this section, \"local request\" means a formal request collectively submitted by the chief law enforcement officer of a political subdivision serving the proposed safe road zone, the local road authority for the proposed safe road zone, and the chief executive officer, board, or designee by resolution of the political subdivision encompassing the proposed safe road zone.\n(a) The commissioner may designate a safe road zone as provided in this section.\n(b) Upon receipt of a local request, the commissioner, in consultation with the commissioner of public safety, must consider designating a segment of a street or highway as a safe road zone. In determining the designation of a safe road zone, the commissioner must evaluate traffic safety concerns for the street or highway, including but not limited to: excessive speed; crash history; safety of pedestrians, bicyclists, or other vulnerable road users; intersection risks; and roadway design.\nThe Advisory Council on Traffic Safety under section 4.076 must make recommendations to the commissioners of public safety and transportation on supporting the local authority with implementation of safety measures for each safe road zone through education, public awareness, behavior modification, and traffic engineering efforts. Safety measures for a safe road zone may include:\n(1) providing safe road zone signs to the local authority for use in the zone;\n(2) consulting with the local authority on roadway design modifications to improve safety;\n(3) performing statewide safe road zone public awareness and educational outreach;\n(4) providing safe road zone outreach materials to the local authority for distribution to the general public;\n(5) working with the local authority to enhance safety conditions in the zone;\n(6) establishing a speed limit as provided under section 169.14, subdivision 5i, with supporting speed enforcement and education measures; and\n(7) evaluating the impacts of safety measures in the zone on: crashes; injuries and fatalities; property damage; transportation system disruptions; safety for vulnerable roadway users, including pedestrians and bicyclists; and other measures as identified by the commissioner.\nThe commissioner of public safety must coordinate with local law enforcement agencies to determine implementation of enhanced traffic enforcement in a safe road zone designated under this section.\nThe commissioner of transportation must maintain information on a website that summarizes safe road zone implementation, including but not limited to identification of requests for and designations of safe road zones, an overview of safety measures and traffic enforcement activity, and a review of annual expenditures.",
	"repealed": false
}