{
	"id": "256B.431",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.431",
	"title": "256B.431 RATE DETERMINATION.",
	"text": "[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2000 c 449 s 15]\n(a) For rate years beginning on or after July 1, 1985, the commissioner, by permanent rule, shall reimburse nursing facility providers that are vendors in the medical assistance program for the rental use of real estate and depreciable equipment. \"Real estate\" means land improvements, buildings, and attached fixtures used directly for resident care. \"Depreciable equipment\" means the standard movable resident care equipment and support service equipment generally used in long-term care facilities.\n(b) In developing the method for determining payment rates for the rental use of nursing facilities, the commissioner shall consider factors designed to:\n(1) simplify the administrative procedures for determining payment rates for property-related costs;\n(2) minimize discretionary or appealable decisions;\n(3) eliminate any incentives to sell nursing facilities;\n(4) recognize legitimate costs of preserving and replacing property;\n(5) recognize the existing costs of outstanding indebtedness allowable under the statutes and rules in effect on May 1, 1983;\n(6) address the current value of, if used directly for patient care, land improvements, buildings, attached fixtures, and equipment;\n(7) establish an investment per bed limitation;\n(8) reward efficient management of capital assets;\n(9) provide equitable treatment of facilities;\n(10) consider a variable rate; and\n(11) phase-in implementation of the rental reimbursement method.\n(c) For rate years beginning on or after July 1, 1987, a nursing facility which has reduced licensed bed capacity after January 1, 1986, shall be allowed to:\n(1) aggregate the applicable investment per bed limits based on the number of beds licensed prior to the reduction; and\n(2) establish capacity days for each rate year following the licensure reduction based on the number of beds licensed on the previous April 1 if the commissioner is notified of the change by April 4. The notification must include a copy of the delicensure request that has been submitted to the commissioner of health.\n(d) For rate years beginning on or after July 1, 1989, the interest expense that results from a refinancing of a nursing facility's demand call loan, when the loan that must be refinanced was incurred before May 22, 1983, is an allowable interest expense if:\n(1) the demand call loan or any part of it was in the form of a loan that was callable at the demand of the lender;\n(2) the demand call loan or any part of it was called by the lender through no fault of the nursing facility;\n(3) the demand call loan or any part of it was made by a government agency operating under a statutory or regulatory loan program;\n(4) the refinanced debt does not exceed the sum of the allowable remaining balance of the demand call loan at the time of payment on the demand call loan and refinancing costs;\n(5) the term of the refinanced debt does not exceed the remaining term of the demand call loan, had the debt not been subject to an on-call payment demand; and\n(6) the refinanced debt is not a debt between related organizations as defined in Minnesota Rules, part 9549.0020, subpart 38.\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2016 c 99 art 1 s 43]\n(a) For the rate year beginning July 1, 1988, the replacement-cost-new per bed limit must be $32,571 per licensed bed in multiple bedrooms and $48,857 per licensed bed in a single bedroom. For the rate year beginning July 1, 1989, the replacement-cost-new per bed limit for a single bedroom must be $49,907 adjusted according to Minnesota Rules, part 9549.0060, subpart 4, item A, subitem (1). Beginning January 1, 1990, the replacement-cost-new per bed limits must be adjusted annually as specified in Minnesota Rules, part 9549.0060, subpart 4, item A, subitem (1). Beginning January 1, 1991, the replacement-cost-new per bed limits will be adjusted annually as specified in Minnesota Rules, part 9549.0060, subpart 4, item A, subitem (1), except that the index utilized will be the Bureau of Economic Analysis: Price Indexes for Private Fixed Investments in Structures; Special Care.\n(b) For the rate year beginning July 1, 1988, the commissioner shall increase the rental factor as established in Minnesota Rules, part 9549.0060, subpart 8, item A, by 6.2 percent rounded to the nearest 100th percent for the purpose of reimbursing nursing facilities for soft costs and entrepreneurial profits not included in the cost valuation services used by the state's contracted appraisers. For rate years beginning on or after July 1, 1989, the rental factor is the amount determined under this paragraph for the rate year beginning July 1, 1988.\n(c) For rate years beginning on or after July 1, 1988, in order to determine property-related payment rates under Minnesota Rules, part 9549.0060, for all nursing facilities except those whose average length of stay in a skilled level of care within a nursing facility is 180 days or less, the commissioner shall use 95 percent of capacity days. For a nursing facility whose average length of stay in a skilled level of care within a nursing facility is 180 days or less, the commissioner shall use the greater of resident days or 80 percent of capacity days but in no event shall the divisor exceed 95 percent of capacity days.\n(d) For rate years beginning on July 1, 1988, and July 1, 1989, the commissioner shall add ten cents per resident per day to each nursing facility's property-related payment rate. The ten-cent property-related payment rate increase is not cumulative from rate year to rate year. For the rate year beginning July 1, 1990, the commissioner shall increase each nursing facility's equipment allowance as established in Minnesota Rules, part 9549.0060, subpart 10, by ten cents per resident per day. For rate years beginning on or after July 1, 1991, the adjusted equipment allowance must be adjusted annually for inflation as in Minnesota Rules, part 9549.0060, subpart 10, item E. For the rate period beginning October 1, 1992, the equipment allowance for each nursing facility shall be increased by 28 percent. For rate years beginning after June 30, 1993, the allowance must be adjusted annually for inflation.\n(e) For rate years beginning on or after July 1, 1990, Minnesota Rules, part 9549.0060, subpart 5, item E, shall not apply to outstanding related organization debt incurred prior to May 23, 1983, provided that the debt was an allowable debt under Minnesota Rules, parts 9510.0010 to 9510.0480, the debt is subject to repayment through annual principal payments, and the nursing facility demonstrates to the commissioner's satisfaction that the interest rate on the debt was less than market interest rates for similar arm's-length transactions at the time the debt was incurred. If the debt was incurred due to a sale between family members, the nursing facility must also demonstrate that the seller no longer participates in the management or operation of the nursing facility. Debts meeting the conditions of this paragraph are subject to all other provisions of Minnesota Rules, parts 9549.0010 to 9549.0080.\n(f) For rate years beginning on or after July 1, 1990, a nursing facility with operating lease costs incurred for the nursing facility's buildings shall receive its building capital allowance computed in accordance with Minnesota Rules, part 9549.0060, subpart 8. If an operating lease provides that the lessee's rent is adjusted to recognize improvements made by the lessor and related debt, the costs for capital improvements and related debt shall be allowed in the computation of the lessee's building capital allowance, provided that reimbursement for these costs under an operating lease shall not exceed the rate otherwise paid.\n(a) For rate years beginning on or after July 1, 1990, nursing facilities that, on or after January 1, 1976, but prior to January 1, 1987, were newly licensed after new construction, or increased their licensed beds by a minimum of 35 percent through new construction, and whose building capital allowance is less than their allowable annual principal and interest on allowable debt prior to the application of the replacement-cost-new per bed limit and whose remaining weighted average debt amortization schedule as of January 1, 1988, exceeded 15 years, must receive a property-related payment rate equal to the greater of their rental per diem or their annual allowable principal and allowable interest without application of the replacement-cost-new per bed limit, divided by their capacity days as determined under Minnesota Rules, part 9549.0060, subpart 11, as modified by subdivision 3f, paragraph (c), for the preceding reporting year, plus their equipment allowance. A nursing facility that is eligible for a property-related payment rate under this subdivision and whose property-related payment rate in a subsequent rate year is its rental per diem must continue to have its property-related payment rates established for all future rate years based on the rental reimbursement method in Minnesota Rules, part 9549.0060.\nThe commissioner may require the nursing facility to apply for refinancing as a condition of receiving special rate treatment under this subdivision.\n(b) If a nursing facility is eligible for a property-related payment rate under this subdivision, and the nursing facility's debt is refinanced after October 1, 1988, the provisions in paragraphs (1) to (7) also apply to the property-related payment rate for rate years beginning on or after July 1, 1990.\n(1) A nursing facility's refinancing must not include debts with balloon payments.\n(2) If the issuance costs, including issuance costs on the debt refinanced, are financed as part of the refinancing, the historical cost of capital assets limit in Minnesota Rules, part 9549.0060, subpart 5, item A, subitem (6), includes issuance costs that do not exceed seven percent of the debt refinanced, plus the related issuance costs. For purposes of this paragraph, issuance costs means the fees charged by the underwriter, issuer, attorneys, bond raters, appraisers, and trustees, and includes the cost of printing, title insurance, registration tax, and a feasibility study for the refinancing of a nursing facility's debt. Issuance costs do not include bond premiums or discounts when bonds are sold at other than their par value, points, or a bond reserve fund. To the extent otherwise allowed under this paragraph, the straight-line amortization of the refinancing issuance costs is not an allowable cost.\n(3) The annual principal and interest expense payments and any required annual municipal fees on the nursing facility's refinancing replace those of the refinanced debt and, together with annual principal and interest payments on other allowable debts, are allowable costs subject to the limitation on historical cost of capital assets plus issuance costs as limited in paragraph (2), if any.\n(4) If the nursing facility's refinancing includes zero coupon bonds, the commissioner shall establish a monthly debt service payment schedule based on an annuity that will produce an amount equal to the zero coupon bonds at maturity. The term and interest rate is the term and interest rate of the zero coupon bonds. Any refinancing to repay the zero coupon bonds is not an allowable cost.\n(5) The annual amount of annuity payments is added to the nursing facility's allowable annual principal and interest payment computed in paragraph (3).\n(6) The property-related payment rate is equal to the amount in paragraph (5), divided by the nursing facility's capacity days as determined under Minnesota Rules, part 9549.0060, subpart 11, as modified by subdivision 3f, paragraph (c), for the preceding reporting year plus an equipment allowance.\n(7) Except as provided in this subdivision, the provisions of Minnesota Rules, part 9549.0060 apply.\n[Repealed, 2000 c 449 s 15]\nMS 2018 [Repealed, 1Sp2019 c 9 art 4 s 30]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 1991 c 292 art 7 s 26]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2000 c 449 s 15]\nA nursing facility completing a construction project that is eligible for a rate adjustment under section 256B.434, subdivision 4f, and that was not approved through the moratorium exception process in section 144A.073 must request from the commissioner a property-related payment rate adjustment. The effective date of the rate adjustment is the first of the month of January or July, whichever occurs first following both the construction project's completion date and submission of the provider's rate adjustment request. The commissioner shall provide a rate notice reflecting the allowable costs within 60 days after receiving all the necessary information to compute the rate adjustment. No sooner than the effective date of the rate adjustment for the construction project, a nursing facility may adjust its rates by the amount anticipated to be allowed. Any amounts collected from private pay residents in excess of the allowable rate must be repaid to private pay residents with interest at the rate used by the commissioner of revenue for the late payment of taxes and in effect on the date the rate increase is effective. Construction projects with completion dates within one year of the completion date associated with the property rate adjustment request and phased projects with project completion dates within three years of the last phase of the phased project must be aggregated for purposes of the minimum thresholds in subdivisions 16 and 17, and the maximum threshold in section 144A.071, subdivision 2. \"Construction project\" and \"project construction costs\" have the meanings given them in section 144A.071, subdivision 1a.\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2000 c 449 s 15]\n(a) Terms used in subdivisions 13 to 21 shall be as defined in Minnesota Rules, parts 9549.0010 to 9549.0080, and this section.\n(b) Except as provided in this subdivision, for rate periods beginning on October 1, 1992, and for rate years beginning after June 30, 1993, the property-related rate for a nursing facility shall be the greater of $4 or the property-related payment rate in effect on September 30, 1992. In addition, the incremental increase in the nursing facility's rental rate will be determined under Minnesota Rules, parts 9549.0010 to 9549.0080, and this section.\n(c) Notwithstanding Minnesota Rules, part 9549.0060, subpart 13, item F, a nursing facility that has a sale permitted under subdivision 14 after June 30, 1992, shall receive the property-related payment rate in effect at the time of the sale or reorganization. For rate periods beginning after October 1, 1992, and for rate years beginning after June 30, 1993, a nursing facility shall receive, in addition to its property-related payment rate in effect at the time of the sale, the incremental increase allowed under subdivision 14.\n(d) For rate years beginning after June 30, 1993, the property-related rate for a nursing facility licensed after July 1, 1989, after relocating its beds from a separate nursing home to a building formerly used as a hospital and sold during the cost reporting year ending September 30, 1991, shall be its property-related rate prior to the sale in addition to the incremental increases provided under this section effective on October 1, 1992, of 29 cents per day, and any incremental increases after October 1, 1992, calculated by using its rental rate under Minnesota Rules, parts 9549.0010 to 9549.0080, and this section, recognizing the current appraised value of the facility at the new location, and including as allowable debt otherwise allowable debt incurred to remodel the facility in the new location prior to the relocation of beds.\n[Repealed, 2012 c 216 art 9 s 38]\nMS 2018 [Repealed, 1Sp2019 c 9 art 4 s 30]\nMS 2018 [Repealed, 1Sp2019 c 9 art 4 s 30]\nNotwithstanding Minnesota Rules, part 9549.0060, subpart 3, for rate periods beginning on October 1, 1992, and for rate years beginning after June 30, 1993, a nursing facility that (1) has completed a construction project approved under section 144A.071, subdivision 4a, clause (m); (2) has completed a construction project approved under section 144A.071, subdivision 4a, and effective after June 30, 1995; (3) has completed a construction project approved under section 144A.071, subdivision 4c; or (4) has completed a renovation, replacement, or upgrading project approved under the moratorium exception process in section 144A.073 shall be reimbursed for costs directly identified to that project as provided in subdivision 16 and subdivisions 17 to 17f.\n(a) Notwithstanding Minnesota Rules, part 9549.0060, subparts 5, item A, subitems (1) and (3), and 7, item D, allowable interest expense on debt shall include:\n(1) interest expense on debt related to the cost of purchasing or replacing depreciable equipment, excluding vehicles, not to exceed ten percent of the total historical cost of the project; and\n(2) interest expense on debt related to financing or refinancing costs, including costs related to points, loan origination fees, financing charges, legal fees, and title searches; and issuance costs including bond discounts, bond counsel, underwriter's counsel, corporate counsel, printing, and financial forecasts. Allowable debt related to items in this clause shall not exceed seven percent of the total historical cost of the project. To the extent these costs are financed, the straight-line amortization of the costs in this clause is not an allowable cost; and\n(3) interest on debt incurred for the establishment of a debt reserve fund, net of the interest earned on the debt reserve fund.\n(b) Debt incurred for costs under paragraph (a) is not subject to Minnesota Rules, part 9549.0060, subpart 5, item A, subitem (5) or (6).\n[Repealed, 2012 c 216 art 9 s 38]\nNotwithstanding subdivision 3f, paragraph (a), for rate periods beginning on October 1, 1992, and for rate years beginning after June 30, 1993, the replacement-costs-new per bed limit to be used in Minnesota Rules, part 9549.0060, subpart 4, item B, for a nursing facility that has completed a renovation, replacement, or upgrading project that has been approved under the moratorium exception process in section 144A.073, or that has completed an addition to or replacement of buildings, attached fixtures, or land improvements for which the total historical cost exceeds the lesser of $150,000 or ten percent of the most recent appraised value, must be $47,500 per licensed bed in multiple-bed rooms and $71,250 per licensed bed in a single-bed room. These amounts must be adjusted annually as specified in subdivision 3f, paragraph (a), beginning January 1, 1993.\n(a) For purposes of this subdivision, a total replacement means the complete replacement of the nursing facility's physical plant through the construction of a new physical plant, the transfer of the nursing facility's license from one physical plant location to another, or a new building addition to relocate beds from three- and four-bed wards. For total replacement projects completed on or after July 1, 1992, the commissioner shall compute the incremental change in the nursing facility's rental per diem, for rate years beginning on or after July 1, 1995, by replacing its appraised value, including the historical capital asset costs, and the capital debt and interest costs with the new nursing facility's allowable capital asset costs and the related allowable capital debt and interest costs. If the new nursing facility has decreased its licensed capacity, the aggregate investment per bed limit in subdivision 3a, paragraph (c), shall apply.\n(b) If the new nursing facility has retained a portion of the original physical plant for nursing facility usage, then a portion of the appraised value prior to the replacement must be retained and included in the calculation of the incremental change in the nursing facility's rental per diem. For purposes of this subdivision, the original nursing facility means the nursing facility prior to the total replacement project. The portion of the appraised value to be retained shall be calculated according to clauses (1) to (3):\n(1) The numerator of the allocation ratio shall be the square footage of the area in the original physical plant which is being retained for nursing facility usage.\n(2) The denominator of the allocation ratio shall be the total square footage of the original nursing facility physical plant.\n(3) Each component of the nursing facility's allowable appraised value prior to the total replacement project shall be multiplied by the allocation ratio developed by dividing clause (1) by clause (2).\n(c) In the case of either type of total replacement as authorized under section 144A.071 or 144A.073, the provisions of subdivisions 17 to 17f shall also apply.\n(d) For purposes of the moratorium exception authorized under section 144A.071, subdivision 4a, paragraph (s), if the total replacement involves the renovation and use of an existing health care facility physical plant, the new allowable capital asset costs and related debt and interest costs shall include first the allowable capital asset costs and related debt and interest costs of the renovation, to which shall be added the allowable capital asset costs of the existing physical plant prior to the renovation, and if reported by the facility, the related allowable capital debt and interest costs.\nNotwithstanding Minnesota Rules, part 9549.0060, subpart 11, item C, subitem (2), for a total replacement, as defined in subdivision 17d, authorized under section 144A.071 or 144A.073 after July 1, 1999, any building project that is a relocation, renovation, upgrading, or conversion completed on or after July 1, 2001, or any building project eligible for reimbursement under section 256B.434, subdivision 4f, the replacement-costs-new per bed limit shall be $74,280 per licensed bed in multiple-bed rooms, $92,850 per licensed bed in semiprivate rooms with a fixed partition separating the resident beds, and $111,420 per licensed bed in single rooms. Minnesota Rules, part 9549.0060, subpart 11, item C, subitem (2), does not apply. These amounts must be adjusted annually as specified in subdivision 3f, paragraph (a), beginning January 1, 2000. These amounts must be increased annually as specified in subdivision 3f, paragraph (a), beginning October 1, 2012.\n[Repealed, 2012 c 216 art 9 s 38]\n(a) Notwithstanding Minnesota Rules, part 9549.0060, subparts 1 to 3, the appraised value, routine updating of the appraised value, and special reappraisals are subject to this subdivision.\nFor all rate years after June 30, 1993, the commissioner shall no longer conduct any appraisals under Minnesota Rules, part 9549.0060, for the purpose of determining property-related payment rates.\n(b) Notwithstanding Minnesota Rules, part 9549.0060, subpart 2, for rate years beginning after June 30, 1993, the commissioner shall routinely update the appraised value of each nursing facility by adding the cost of capital asset acquisitions to its allowable appraised value.\nThe commissioner shall also annually index each nursing facility's allowable appraised value by the inflation index referenced in subdivision 3f, paragraph (a), for the purpose of computing the nursing facility's annual rental rate. In annually adjusting the nursing facility's appraised value, the commissioner must not include the historical cost of capital assets acquired during the reporting year in the nursing facility's appraised value.\nIn addition, the nursing facility's appraised value must be reduced by the historical cost of capital asset disposals or applicable credits such as public grants and insurance proceeds. Capital asset additions and disposals must be reported on the nursing facility's annual cost report in the reporting year of acquisition or disposal. The incremental increase in the nursing facility's rental rate resulting from this annual adjustment as determined under Minnesota Rules, parts 9549.0010 to 9549.0080, and this section shall be added to the nursing facility's property-related payment rate for the rate year following the reporting year.\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\nBeginning January 1, 1993, and each January 1 thereafter, the commissioner shall annually update the dollar thresholds in subdivisions 15, paragraph (e), 16, and 17, and in section 144A.071, subdivisions 2 and 4a, clauses (b) and (e), by the inflation index referenced in subdivision 3f, paragraph (a).\nIn the determination of incremental increases in the nursing facility's rental rate as required in subdivisions 14 to 21, except for a refinancing permitted under subdivision 19, the commissioner must adjust the nursing facility's property-related payment rate for both incremental increases and decreases in recomputations of its rental rate.\n[Repealed, 2009 c 79 art 8 s 86]\n[Repealed, 2000 c 449 s 15]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2012 c 216 art 9 s 38]\n(a) For rate years beginning on or after July 1, 2000, a nursing facility reimbursed under this section which has placed beds on layaway shall, for purposes of application of the downsizing incentive in subdivision 3a, paragraph (c), and calculation of the rental per diem, have those beds given the same effect as if the beds had been delicensed so long as the beds remain on layaway. At the time of a layaway, a facility may change its single bed election for use in calculating capacity days under Minnesota Rules, part 9549.0060, subpart 11. The property payment rate increase shall be effective the first day of the month of January or July, whichever occurs first following the date on which the layaway of the beds becomes effective under section 144A.071, subdivision 4b.\n(b) For rate years beginning on or after July 1, 2000, notwithstanding any provision to the contrary under section 256B.434 or chapter 256R, a nursing facility reimbursed under that section or chapter that has placed beds on layaway shall, for so long as the beds remain on layaway, be allowed to:\n(1) aggregate the applicable investment per bed limits based on the number of beds licensed immediately prior to entering the alternative payment system;\n(2) retain or change the facility's single bed election for use in calculating capacity days under Minnesota Rules, part 9549.0060, subpart 11; and\n(3) establish capacity days based on the number of beds immediately prior to the layaway and the number of beds after the layaway.\nThe commissioner shall increase the facility's property payment rate by the incremental increase in the rental per diem resulting from the recalculation of the facility's rental per diem applying only the changes resulting from the layaway of beds and clauses (1), (2), and (3). If a facility reimbursed under section 256B.434 or chapter 256R completes a moratorium exception project after its base year, the base year property rate shall be the moratorium project property rate. The base year rate shall be inflated by the factors in section 256B.434, subdivision 4, paragraph (c). The property payment rate increase shall be effective the first day of the month of January or July, whichever occurs first following the date on which the layaway of the beds becomes effective.\n(c) If a nursing facility removes a bed from layaway status in accordance with section 144A.071, subdivision 4b, the commissioner shall establish capacity days based on the number of licensed and certified beds in the facility not on layaway and shall reduce the nursing facility's property payment rate in accordance with paragraph (b).\n(d) For the rate years beginning on or after July 1, 2000, notwithstanding any provision to the contrary under section 256B.434 or chapter 256R, a nursing facility reimbursed under that section or chapter that has delicensed beds after July 1, 2000, by giving notice of the delicensure to the commissioner of health according to the notice requirements in section 144A.071, subdivision 4b, shall be allowed to:\n(1) aggregate the applicable investment per bed limits based on the number of beds licensed immediately prior to entering the alternative payment system;\n(2) retain or change the facility's single bed election for use in calculating capacity days under Minnesota Rules, part 9549.0060, subpart 11; and\n(3) establish capacity days based on the number of beds immediately prior to the delicensure and the number of beds after the delicensure.\nThe commissioner shall increase the facility's property payment rate by the incremental increase in the rental per diem resulting from the recalculation of the facility's rental per diem applying only the changes resulting from the delicensure of beds and clauses (1), (2), and (3). If a facility reimbursed under section 256B.434 completes a moratorium exception project after its base year, the base year property rate shall be the moratorium project property rate. The base year rate shall be inflated by the factors in section 256B.434, subdivision 4, paragraph (c). The property payment rate increase shall be effective the first day of the month of January or July, whichever occurs first following the date on which the delicensure of the beds becomes effective.\n(e) For nursing facilities reimbursed under this section, section 256B.434, or chapter 256R, any beds placed on layaway shall not be included in calculating facility occupancy as it pertains to leave days defined in Minnesota Rules, part 9505.0415.\n(f) For nursing facilities reimbursed under this section, section 256B.434, or chapter 256R, the rental rate calculated after placing beds on layaway may not be less than the rental rate prior to placing beds on layaway.\n(g) A nursing facility receiving a rate adjustment as a result of this section shall comply with section 256R.06, subdivision 5.\n(h) A facility that does not utilize the space made available as a result of bed layaway or delicensure under this subdivision to reduce the number of beds per room or provide more common space for nursing facility uses or perform other activities related to the operation of the nursing facility shall have its property rate increase calculated under this subdivision reduced by the ratio of the square footage made available that is not used for these purposes to the total square footage made available as a result of bed layaway or delicensure.\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2016 c 99 art 1 s 43]\nNotwithstanding any other law to the contrary, money available for moratorium exception projects under section 144A.073, subdivisions 2 and 11, shall be used to fund the incremental rate increases resulting from this section for any nursing facility with a moratorium exception project approved under section 144A.073, and completed after August 30, 2010, where the replacement-costs-new limits under subdivision 17e were higher at any time after project approval than at the time of project completion. The commissioner shall calculate the property rate increase for these facilities using the highest set of limits; however, any rate increase under this section shall not be effective until on or after the effective date of this section, contingent upon federal approval. No property rate decrease shall result from this section.",
	"repealed": false
}