{
	"id": "122A.182",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.182",
	"title": "122A.182 TIER 2 LICENSE.",
	"text": "The Professional Educator Licensing and Standards Board must approve an application for a Tier 2 license in a specified content area if:\n(1) the application has been submitted jointly by the applicant and the district;\n(2) the application has been paid for by the district or the applicant;\n(3) the applicant holds a bachelor's degree, unless specifically exempt by statute or rule;\n(4) the district demonstrates that a criminal background check under section 122A.18, subdivision 8, has been completed for the applicant; and\n(5) the applicant:\n(i) has completed a state-approved teacher preparation program;\n(ii) is enrolled in a Minnesota-approved teacher preparation program; or\n(iii) has a master's degree in the specified content area.\nThe Professional Educator Licensing and Standards Board must approve an application for a Tier 2 license in a special education field if:\n(1) the application meets all the requirements under subdivision 1;\n(2) the district or charter school affirms that the applicant will receive high-quality professional development that is sustained, intensive, and classroom focused in order to have a positive and lasting impact on classroom instruction, before and while teaching;\n(3) the district or charter school affirms that the applicant will participate in a program of intensive supervision that consists of structured guidance and regular ongoing support for teachers or a teacher mentoring program; and\n(4) the applicant demonstrates satisfactory progress toward professional licensure.\nMS 2022 [Repealed, 2023 c 55 art 5 s 67]\n(a) The following applicants for a Tier 2 license are exempt from the requirement to hold a bachelor's degree in subdivision 1:\n(1) an applicant for a Tier 2 license to teach career and technical education or career pathways courses of study when the applicant has:\n(i) an associate's degree;\n(ii) a professional certification; or\n(iii) five years of relevant work experience;\n(2) an applicant for a Tier 2 license to teach world languages and culture pursuant to Minnesota Rules, part 8710.4950, when the applicant is a native speaker of the language; and\n(3) an applicant for a Tier 2 license in the performing or visual arts pursuant to Minnesota Rules, parts 8710.4300, dance and theatre; 8710.4310, dance; 8710.4320, theatre; 8710.4650, vocal music and instrumental music; and 8710.4900, visual arts, when the applicant has at least five years of relevant work experience.\n(b) The Professional Educator Licensing and Standards Board must adopt rules regarding the qualifications and determinations for applicants exempt from the requirement to hold a bachelor's degree in subdivision 1.\n(a) From July 1, 2023, until June 30, 2024, the Professional Educator Licensing and Standards Board must approve an application for a Tier 2 license that meets the coursework requirement under subdivision 2, and other requirements under subdivision 1, clauses (1), (2), (3), and (4).\n(b) For the 2023-2024, 2024-2025, and 2025-2026 school years only, the Professional Educator Licensing and Standards Board must approve an application to renew a Tier 2 license for an applicant that met the Tier 2 requirements in effect at the time the first Tier 2 license was issued. Nothing in this subdivision modifies the renewal requirements in subdivision 3.\nThe Professional Educator Licensing and Standards Board must issue an initial Tier 2 license for a term of two years. A Tier 2 license may be renewed three times. Before a Tier 2 license is renewed for the first time, a teacher holding a Tier 2 license must participate in cultural competency training consistent with section 120B.30, subdivision 8, and mental illness training under section 122A.187, subdivision 6. The board must issue rules setting forth the conditions for additional renewals after the initial license has been renewed three times.\nThe Professional Educator Licensing and Standards Board must accept applications for a Tier 2 teaching license beginning July 1 of the school year for which the license is requested. At the board's discretion, the board may begin to accept and review applications before July 1.\n(a) A Tier 2 license is limited to the content matter indicated on the application for the initial Tier 2 license under subdivision 1, and limited to the district or charter school that requested the initial Tier 2 license.\n(b) A Tier 2 license shall not be construed to bring an individual within the definition of a teacher for purposes of section 122A.40, subdivision 1, or 122A.41, subdivision 1, clause (a).\n(a) The time that a teacher works under a Tier 2 license must be credited towards the teacher's three-year probationary period under section 122A.40, subdivision 5, or 122A.41, subdivision 2.\n(b) The time credited towards the probationary period under paragraph (a) must not exceed two years.\n(c) The three years of the probationary period, including any time credited under this subdivision, must run consecutively, consistent with section 122A.40, subdivision 5, or section 122A.41, subdivision 2.\n(a) A teacher holding a Tier 2 license must participate in the employing district or charter school's mentorship and evaluation program, including an individual growth and development plan that includes cultural competency under section 120B.30, subdivision 8.\n(b) A teacher holding a Tier 2 license must participate in an evaluation aligned, to the extent practicable, with the evaluation under section 122A.40, subdivision 8, or section 122A.41, subdivision 5.",
	"repealed": false
}