{
	"id": "116J.876",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.876",
	"title": "116J.876 DEFINITIONS.",
	"text": "For the purposes of this section and sections 116J.8761 to 116J.8769, the terms defined in this section have the meanings given them.\n\"Agreement\" means an agreement between a lender and the commissioner under which a lender may participate in the program.\n\"Borrower\" means the recipient of a loan which is, has been, or will be filed by the lender for enrollment under the program and meets the following requirements:\n(1) the borrower is a corporation, partnership, joint venture, sole proprietorship, cooperative, or other entity, whether profit or nonprofit, which is authorized to conduct business in the state; and\n(2) the borrower is not an executive officer, director, or principal shareholder of the lender, or a member of the immediate family of an executive officer, director, or principal shareholder of the lender, or an entity controlled by an executive officer, director, principal shareholder, or member of the immediate family.\n\"Capital access account\" or \"account\" means an account created in the special revenue fund for the purposes of the capital access program.\n\"Claim\" means any claim filed by the lender under section 116J.8767.\n\"Commissioner\" means the commissioner of employment and economic development.\n\"Community development venture capital fund\" means a regional or local venture capital fund that makes equity investments in small or emerging companies and has a financial as well as a social mission.\n\"Early loan\" means an enrolled loan where at the time of enrollment the amount of previously enrolled loans made by the lender under the program was less than $5,000,000.\n\"Eligible loan\" means a loan made by the lender to a borrower that meets the requirements of section 116J.8764.\n\"Enrolled loan\" means a loan enrolled by the commissioner under the terms of section 116J.8764.\n\"Lender\" means a financial institution as defined in section 13A.01, subdivision 2, that has entered into an agreement with the commissioner to participate in the program.\n\"Passive real estate ownership\" means ownership of real estate for the purpose of deriving income from speculation, trade, or rentals, except that the term does not include (1) the ownership of that portion of real estate being used or intended to be used for the operation of the business of the owner of the real estate; or (2) ownership of real estate for the purpose of construction or renovation until the completion of the construction or renovation phase.\n\"Program\" means the capital access program created by sections 116J.876 to 116J.8769.\n\"Reserve fund\" means an administrative account maintained by the commissioner for funds accumulated under an agreement with the commissioner to cover losses sustained by the lender on enrolled loans.",
	"repealed": false
}