{
	"id": "297E.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.11",
	"title": "297E.11 LIMITATIONS ON TIME FOR ASSESSMENT OF TAX.",
	"text": "Except as otherwise provided in this chapter, the amount of taxes assessable must be assessed within 3-1/2 years after the return is filed, whether or not the return is filed on or after the date prescribed. A return must not be treated as filed until it is in processible form. A return is in processible form if it is filed on a permitted form and contains sufficient data to identify the taxpayer and permit the mathematical verification of the tax liability shown on the return. For purposes of this section, a tax return filed before the last day prescribed by law for filing is considered to be filed on the last day.\nNotwithstanding subdivision 1, the tax may be assessed at any time if a false or fraudulent return is filed or if a taxpayer fails to file a return.\nAdditional taxes may be assessed within 6-1/2 years after the due date of the return or the date the return was filed, whichever is later, if the taxpayer omits from a tax return taxes in excess of 25 percent of the taxes reported in the return.\nUnless otherwise provided in this chapter, a claim for a refund of an overpayment of tax must be filed within the period prescribed in section 289A.40, subdivision 1. Interest on refunds must be computed at the rate specified in section 270C.405 from the date of payment to the date the refund is paid or credited. For purposes of this subdivision, the date of payment is the later of the date the tax was finally due or was paid.\nThe time during which a tax must be assessed or collection proceedings begun is suspended during the period from the date of a filing of a petition in bankruptcy until 30 days after either:\n(1) notice to the commissioner that the bankruptcy proceedings have been closed or dismissed; or\n(2) the automatic stay has been ended or has expired, whichever occurs first.\nThe suspension of the statute of limitations under this subdivision applies to the person the petition in bankruptcy is filed against, and all other persons who may also be wholly or partially liable for the tax.\nIf before the expiration of time prescribed in subdivisions 1 and 4 for the assessment of tax or the filing of a claim for refund, both the commissioner and the taxpayer have consented in writing to the assessment or filing of a claim for refund after that time, the tax may be assessed or the claim for refund filed at any time before the expiration of the agreed-upon period. The period may be extended by later agreements in writing before the expiration of the period previously agreed upon.",
	"repealed": false
}