{
	"id": "136A.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.121",
	"title": "136A.121 STATE GRANT PROGRAM.",
	"text": "[Repealed, 1989 c 293 s 85]\n(a) An applicant is eligible to be considered for a grant, regardless of the applicant's sex, creed, race, color, national origin, or ancestry, under sections 136A.095 to 136A.131 if the office finds that the applicant:\n(1) is a resident of the state of Minnesota;\n(2) is a graduate of a secondary school or its equivalent, or is 17 years of age or over, and has met all requirements for admission as a student to an eligible college or technical college of choice as defined in sections 136A.095 to 136A.131;\n(3) has met the financial need criteria established in Minnesota Rules;\n(4) is not in default, as defined by the office, of any federal or state student educational loan;\n(5) is not more than 30 days in arrears in court-ordered child support that is collected or enforced by the public authority responsible for child support enforcement or, if the applicant is more than 30 days in arrears in court-ordered child support that is collected or enforced by the public authority responsible for child support enforcement, but is complying with a written payment agreement under section 518A.69 or order for arrearages; and\n(6) has not been convicted of or pled nolo contendere or guilty to a crime involving fraud in obtaining federal Title IV funds within the meaning of Code of Federal Regulations, subtitle B, chapter VI, part 668, subpart C.\n(b) A student is entitled to an additional semester or the equivalent of grant eligibility if the student withdraws from enrollment:\n(1) for active military service after December 31, 2002, because the student was ordered to active military service as defined in section 190.05, subdivision 5b or 5c;\n(2) for a serious health condition, while under the care of a medical professional, that substantially limits the student's ability to complete the term; or\n(3) while providing care that substantially limits the student's ability to complete the term to the student's spouse, child, or parent who has a serious health condition.\nGrants must be awarded on a funds available basis to those applicants who meet the office's requirements.\n[Repealed, 1989 c 293 s 85]\nThe grant stipend shall be based on a sharing of responsibility for covering the recognized cost of attendance by the applicant, the applicant's family, and the government. The amount of a financial stipend must not exceed a grant applicant's recognized cost of attendance, as defined in subdivision 6, after deducting the following:\n(1) the assigned student responsibility of at least 50 percent of the cost of attending the institution of the applicant's choosing;\n(2) the assigned family responsibility as defined in section 136A.101; and\n(3) the amount of a federal Pell grant award for which the grant applicant is eligible.\nThe minimum financial stipend is $100 per academic year.\n(a) The recognized cost of attendance consists of: (1) an allowance specified in law for living and miscellaneous expenses, and (2) an allowance for tuition and fees equal to the lesser of the average tuition and fees charged by the institution, or a tuition and fee maximum if one is established in law. If no living and miscellaneous expense allowance is established in law, the allowance is equal to 115 percent of the federal poverty guidelines for a one person household in Minnesota for nine months. If no tuition and fee maximum is established in law, the allowance for tuition and fees is equal to the lesser of: (1) the average tuition and fees charged by the institution, and (2) for two-year programs, an amount equal to the highest tuition and fees charged at a public two-year institution, or for four-year programs, an amount equal to the highest tuition and fees charged at a public university.\n(b) For a student registering for less than full time, the office shall prorate the cost of attendance using the ratio of the number of credits the student is enrolled in to the number of credits for full-time enrollment.\n(c) The recognized cost of attendance for a student who is confined to a Minnesota correctional institution shall consist of the tuition and fee component in paragraph (a), with no allowance for living and miscellaneous expenses.\n(d) For the purpose of this subdivision, \"fees\" include only those fees that are mandatory and charged to full-time resident students attending the institution. Fees do not include charges for tools, equipment, computers, or other similar materials where the student retains ownership. Fees include charges for these materials if the institution retains ownership. Fees do not include optional or punitive fees.\nIf the amount appropriated is determined by the office to be insufficient to make full awards to applicants under subdivision 5, awards must be reduced by:\n(1) adding a surcharge to the applicant's assigned family responsibility, as defined in section 136A.101, subdivision 5a; and\n(2) a percentage increase in the applicant's assigned student responsibility, as defined in subdivision 5.\nThe reduction under clauses (1) and (2) must be equal dollar amounts.\nIf the amount appropriated is determined by the office to be more than sufficient to fund projected grant demand in the second year of the biennium, the office may increase the living and miscellaneous expense allowance in the second year of the biennium by up to an amount that retains sufficient appropriations to fund the projected grant demand. The adjustment may be made one or more times. In making the determination that there are more than sufficient funds, the office shall balance the need for sufficient resources to meet the projected demand for grants with the goal of fully allocating the appropriation for state grants. An increase in the living and miscellaneous expense allowance under this subdivision does not carry forward into a subsequent biennium.\n[Repealed, 1Sp1985 c 11 s 81]\nAn undergraduate student who meets the office's requirements is eligible to apply for and receive a grant in any year of undergraduate study unless the student has obtained a baccalaureate degree or previously has received a state grant award for 180 credits or the equivalent, excluding (1) courses taken from a Minnesota school or postsecondary institution which is not participating in the state grant program and from which a student transferred no credit, and (2) courses taken that qualify as developmental education or below college-level. A student enrolled in a two-year program at a four-year institution is only eligible for the tuition and fee maximums established by law for two-year institutions.\nStudents may receive state grants for four consecutive quarters or three consecutive semesters during the course of a single fiscal year. In calculating a state grant for the fourth quarter or third semester, the office must use the same calculation as it would for any other term, except that the calculation must subtract any federal Pell grant for which a student would be eligible even if the student has exhausted the Pell grant for that fiscal year.\n[Repealed, 2013 c 99 art 2 s 30]\n[Repealed, 1Sp1993 c 2 art 2 s 26]\nEach grant is renewable, contingent on continued residency in Minnesota, satisfactory academic progress, recommendation of the eligible institution currently attended, and evidence of continued need.\nTo continue to receive a grant, the student must apply for renewal each year.\nAll eligible institutions must implement policies and procedures that ensure that applicants are aware that they must annually complete the FAFSA to be eligible for financial aid.\nThe deadline for the office to accept applications for state grants for a term is June 30 of the fiscal year for which the student applies for a grant.\n[Repealed, 1Sp1985 c 11 s 81]\n[Repealed, 1989 c 293 s 85]\nGrants awarded under this section must be applied to educational costs in the following order: tuition, fees, books, supplies, and other expenses. Unpaid portions of the awards revert to the grant account.\nThe office shall inform students in its financial aid publications about the definition of independent student status and appeals to the financial aid administrator relating to the declaration of the status.\n(a) An eligible institution whose students are eligible to receive funding under sections 136A.095 to 136A.246 must provide to the office data on student enrollment and federal and state financial aid.\n(b) An institution or its agent must provide to the office aggregate and distributional financial or other data as determined by the commissioner that is directly related to the responsibilities of the office under this chapter. The commissioner may only request aggregate and distributional data after establishing and consulting with a data advisory task force to determine the need, content, and detail of the information. Data provided by nonpublic institutions under this paragraph is considered nonpublic data under chapter 13.\nBy November 1 and February 15, the office must provide, to the committees of the legislature with jurisdiction over higher education finance and policy, updated spending projections for the state grant and the North Star Promise, taking into account the most current and projected enrollment and tuition and fee information, economic conditions, and other relevant factors. Before submitting state grant spending projections, the office must meet and consult with representatives of public and private postsecondary institutions, the Department of Management and Budget, the Governor's Office, legislative staff, and financial aid administrators.\n(a) Each institution receiving financial aid under this section must annually report to the office the following for each award level:\n(1) enrollment and graduation data for all students, including subgroup information on state and federal Pell grant recipients; and\n(2) the aggregate awarded financial aid information for all students, and cumulative debt of all graduates by race and ethnicity, gender, and income.\n(b) Using the data submitted to the office by institutions pursuant to paragraph (a), as well as other data available to the office, the office shall provide the following on its Internet website by placing a prominent link on its website home page:\n(1) information including, but not limited to, persistence and completion, debt of graduates, employment and wage information, and other relevant data for each institution subject to paragraph (a), which shall be made available in a searchable database; and\n(2) other information and links that are useful to students and parents who are in the process of selecting a college or university. This information may include, but is not limited to, local occupational profiles.\n(c) The office shall provide a standard format and instructions for institutions supplying the information required under paragraph (a).\n(d) The office shall provide an electronic copy of the information provided on its Internet website under paragraph (b) to each public and private high school in the state and each workforce center operated by the Department of Employment and Economic Development. The copy must contain information formatted by institution so that comparison can be easily made between institutions. High schools are encouraged to make the information available to students, including through individual counseling sessions with students. Workforce centers shall make the information available to job seekers, those seeking career counseling, and others as determined by the centers.\nAn institution receiving financial aid under this section must not suspend or withdraw a student from class attendance and resources during a period of instruction due to an unpaid student account balance unless the student is eligible for a full tuition and fee refund. A period of instruction for the purposes of this subdivision means a new academic term that may be measured in semesters, trimesters, quarters, interim terms, mini terms, or one or more modules so that a student who begins attendance in that new academic term incurs additional tuition and fee charges beyond any outstanding student account balance due to the institution for prior completed terms of enrollment. An institution that measures a program in clock hours and that includes language in the enrollment contract between it and the student to only charge tuition by payment period, is also covered by this subdivision.",
	"repealed": false
}