{
	"id": "120B.119",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.119",
	"title": "120B.119 READ ACT DEFINITIONS.",
	"text": "For purposes of sections 120B.118 to 120B.124, the following terms have the meanings given.\n\"CAREI\" means the Center for Applied Research and Educational Improvement at the University of Minnesota.\n\"Certified trained facilitator\" means a person employed by a district or regional literacy network who has completed professional development approved by the Department of Education in structured literacy, completed the vendor's certification prerequisites and facilitator training requirements, completed the vendor's annual recertification requirements, remains in good standing with the sponsoring agency and vendor, uses the vendor's training materials with fidelity, and participates in mentoring or coaching provided by CAREI and the Department of Education on facilitating literacy training. A literacy lead who meets the requirements under this subdivision may be a certified trained facilitator.\n\"District\" means a school district, charter school, or cooperative unit as defined in section 123A.24, subdivision 2.\n\"Evidence-based\" means the instruction or item described is based on reliable, trustworthy, and valid evidence and has demonstrated a record of success in increasing students' reading competency in the areas of phonological and phonemic awareness, phonics, vocabulary development, reading fluency, and reading comprehension. Evidence-based literacy instruction is explicit, systematic, and includes phonological and phonemic awareness, phonics and decoding, spelling, fluency, vocabulary, oral language, and comprehension that can be differentiated to meet the needs of individual students. Evidence-based instruction does not include the three-cueing system, as defined in subdivision 16.\n\"Fluency\" means the ability of students to read text accurately, automatically, and with proper expression.\n\"Foundational reading skills\" includes phonological and phonemic awareness, phonics and decoding, and fluency. Foundational reading skills appropriate to each grade level must be mastered in kindergarten, grade 1, grade 2, and grade 3. Struggling readers in grades 4 and above who do not demonstrate mastery of grade-level foundational reading skills must continue to receive explicit, systematic instruction to reach mastery.\n\"Literacy specialist\" means a person licensed by the Professional Educator Licensing and Standards Board as a teacher of reading, a special education teacher, or a kindergarten through grade 6 teacher, who has completed professional development approved by the Department of Education in structured literacy.\n\"Literacy lead\" means a literacy specialist with expertise in working with educators as adult learners. A district literacy lead must support the district's implementation of the Read Act; provide support to school-based coaches; support the implementation of structured literacy, interventions, curriculum delivery, and teacher training; assist with the development of personal learning plans; and train paraprofessionals and other support staff to support classroom literacy instruction. A literacy lead may be employed by one district, jointly by two or more districts, or may provide services to districts through a partnership with the regional service cooperatives or another district.\n\"Multitiered system of support\" or \"MTSS\" means a systemic, continuous improvement framework for ensuring positive social, emotional, behavioral, developmental, and academic outcomes for every student. The MTSS framework provides access to layered tiers of culturally and linguistically responsive, evidence-based practices and relies on the understanding and belief that every student can learn and thrive. Through a MTSS at the core (Tier 1), supplemental (Tier 2), and intensive (Tier 3) levels, educators provide high quality, evidence-based instruction and intervention that is matched to a student's needs; progress is monitored to inform instruction and set goals and data is used for educational decision making.\n\"Oral language,\" also called \"spoken language,\" includes speaking and listening, and consists of five components: phonology, morphology, syntax, semantics, and pragmatics. Oral language also includes sign language, in which speaking and listening skills are defined as expressive and receptive skills, and consists of phonology, including sign language phonological awareness, morphology, syntax, semantics, and pragmatics.\n\"Phonemic awareness\" means the ability to notice, think about, and manipulate individual sounds in spoken syllables and words.\n\"Phonics instruction\" means the explicit, systematic, and direct instruction of the relationships between letters and the sounds they represent and the application of this knowledge in reading and spelling.\n\"Progress monitoring\" means using data collected to inform whether interventions are working. Progress monitoring involves ongoing monitoring of progress that quantifies rates of improvement and informs instructional practice and the development of individualized programs using state-approved screening that is reliable and valid for the intended purpose.\n\"Reading comprehension\" means a function of word recognition skills and language comprehension skills. It is an active process that requires intentional thinking during which meaning is constructed through interactions between the text and reader. Comprehension skills are taught explicitly by demonstrating, explaining, modeling, and implementing specific cognitive strategies to help beginning readers derive meaning through intentional, problem-solving thinking processes.\n\"Structured literacy\" means an approach to reading instruction in which teachers carefully structure important literacy skills, concepts, and the sequence of instruction to facilitate children's literacy learning and progress. Structured literacy is characterized by the provision of systematic, explicit, sequential, and diagnostic instruction in phonemic awareness, phonics, fluency, vocabulary and oral language development, and reading comprehension.\n\"Three-cueing system,\" also known as \"meaning structure visual (MSV),\" means a method that teaches students to use meaning, structure and syntax, and visual cues when attempting to read an unknown word.\n\"Vocabulary development\" means the process of acquiring new words. A robust vocabulary improves all areas of communication, including listening, speaking, reading, and writing. Vocabulary growth is directly related to school achievement and is a strong predictor for reading success.",
	"repealed": false
}