{
	"id": "354.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.45",
	"title": "354.45 OPTIONAL RETIREMENT ANNUITIES; UNPAID ANNUITIES, DISPOSITION.",
	"text": "The retirement board shall establish optional annuities at retirement which shall take the form of an annuity payable for a period certain and for life thereafter or the form of a joint and survivor annuity. The board shall also establish an optional annuity which shall take the form of a guaranteed refund annuity paying the annuitant a fixed amount for life with the guarantee that in the event of death the balance of the accumulated deductions and interest accrued to the date of retirement will be paid to the designated beneficiary. Except as provided in subdivision 1a, any optional annuity forms shall be actuarially equivalent to the normal forms provided in section 354.44. In establishing these optional annuity forms, the board shall obtain the written recommendation of the actuary retained under section 356.214. The recommendations shall be a part of the permanent records of the board.\n(a) If a former member or disabilitant selects a joint and survivor annuity option under subdivision 1, the former member or disabilitant must receive a normal single life annuity if the designated optional annuity beneficiary dies before the former member or disabilitant. Under this option, no reduction may be made in the person's annuity to provide for restoration of the normal single life annuity in the event of the death of the designated optional annuity beneficiary.\n(b) The restoration of the normal single life annuity under this subdivision will take effect on the first of the month following the date of death of the designated optional annuity beneficiary, or on the first of the month following one year before the date on which a certified copy of the death record of the designated optional annuity beneficiary is received in the office of the Teachers Retirement Association, whichever date is later.\n(c) Except as stated in paragraph (b), this subdivision may not be interpreted as authorizing retroactive benefit payments.\nUpon the death of the member after retirement where no designated beneficiary shall survive the member, any remaining unpaid guaranteed annuity payments shall be commuted at the applicable investment return specified in section 356.215, subdivision 8, and paid in one sum to the estate of the member. Upon the death of the last designated beneficiary after the death of the member, the value of any unpaid guaranteed annuity payments shall be commuted at the applicable investment return specified in section 356.215, subdivision 8, and paid in one sum to the estate of the designated beneficiary.\nUpon the death of the former spouse to whom payments are to be made before the end of the specified payment period, payments shall be made according to the terms of a beneficiary form completed by the former spouse or, if no beneficiary form, to the estate of the former spouse or as otherwise ordered by a court of competent jurisdiction.",
	"repealed": false
}