{
	"id": "103C.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.211",
	"title": "103C.211 CONSOLIDATING DISTRICTS.",
	"text": "(a) One or more districts may petition the state board for a consolidation. The state board shall take action on the petition if signed by a majority of the supervisors of each of the affected districts.\n(b) The petition must:\n(1) describe with particularity the change requested, the territory affected, and the reasons for the change;\n(2) illustrate that the change is consistent with the purpose and requirements of sections 103C.201 to 103C.335;\n(3) identify the proposed name for the consolidated district;\n(4) identify the location of the principal office of the consolidated district;\n(5) identify potential changes to supervisor districts;\n(6) identify changes in supervisors that would result from the proposed consolidation;\n(7) provide a list of nominees for vacant supervisor positions; and\n(8) be accompanied by resolutions of support signed by each district board affected by the change.\n(c) Upon the filing of a valid petition, the state board shall give notice that the petition has been filed. The notice must:\n(1) be made by publication in a legal newspaper in each county affected by the petition;\n(2) be made by mail to the auditor of each county affected by the petition;\n(3) describe the actions proposed by the petition;\n(4) invite written comments on the petition for the consideration by the state board;\n(5) state that a person who objects to the actions proposed in the petition may submit a written request for hearing to the state board within 30 days of the last publication of the notice under this paragraph. The request must contain 25 or more signatures from resident owners residing in the affected districts; and\n(6) state that if a timely request for hearing is not received, the state board may make a decision on the petition at a future meeting of the state board.\n(d) If one or more timely requests for hearing are received, the state board must hold a hearing on the petition.\n(e) The state board must establish the proposed consolidation, by order, if the board determines the consolidation promotes public health and welfare and the proposed consolidation would advance the purposes of this chapter.\n(f) When districts are consolidated, the corporate existence and terms of office of the officers of the old districts expire upon the issuance and recording by the secretary of state of a certificate of organization of the new district. Upon consolidation, the rights, assets, and liabilities of the consolidating districts shall be assumed by the consolidated district.\n(g) If nomination districts are changed, the state board shall appoint supervisors to fill vacancies resulting from the consolidation within 30 days after the action is taken. A majority of the supervisors' terms must expire after the next general election following their appointments and the remaining supervisors' terms must expire after the second general election following their appointments.\n(h) No sooner than two years after the date of consolidation, the affected districts may petition the state board to have the action reversed through the same procedure outlined in paragraphs (a) to (f). When a consolidation is reversed, the state board shall order the appointments and distribution or transfer of assets and liabilities.",
	"repealed": false
}