{
	"id": "142G.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.31",
	"title": "142G.31 TREATMENT OF INCOME.",
	"text": "The income of ineligible assistance unit members, except individuals identified in section 142G.17, subdivision 3, paragraph (a), clause (1), must be deemed after allowing the following disregards:\n(1) an earned income disregard as determined under section 256P.03;\n(2) all payments made by the ineligible person according to a court order for spousal support or the support of children not living in the assistance unit's household; and\n(3) an amount for the unmet needs of the ineligible persons who live in the household who, if eligible, would be assistance unit members under section 142G.17, subdivision 2 or 4, paragraph (b). This amount is equal to the difference between the MFIP transitional standard when the ineligible persons are included in the assistance unit and the MFIP transitional standard when the ineligible persons are not included in the assistance unit.\nThe income of disqualified members must be deemed after allowing the following disregards:\n(1) an earned income disregard as determined under section 256P.03;\n(2) all payments made by the disqualified member according to a court order for spousal support or the support of children not living in the assistance unit's household; and\n(3) an amount for the unmet needs of other ineligible persons who live in the household who, if eligible, would be assistance unit members under section 142G.17, subdivision 2 or 4, paragraph (b). This amount is equal to the difference between the MFIP transitional standard when the ineligible persons are included in the assistance unit and the MFIP transitional standard when the ineligible persons are not included in the assistance unit. An amount shall not be allowed for the needs of disqualified members.\nIn households where minor caregivers live with a parent or parents or a stepparent who do not receive MFIP for themselves or their minor children, the income of the parents or a stepparent must be deemed after allowing the following disregards:\n(1) income of the parents equal to 200 percent of the federal poverty guideline for a family size not including the minor parent and the minor parent's child in the household; and\n(2) all payments made by parents according to a court order for spousal support or the support of children not living in the parent's household.\n(a) If a noncitizen applies for or receives MFIP, the agency must deem the income and assets of the noncitizen's sponsor and the sponsor's spouse as provided in this paragraph and paragraph (b) or (c), whichever is applicable. The deemed income of a sponsor and the sponsor's spouse is considered unearned income of the noncitizen. The deemed assets of a sponsor and the sponsor's spouse are considered available assets of the noncitizen.\n(b) The income and assets of a sponsor who signed an affidavit of support under title IV, sections 421, 422, and 423, of Public Law 104-193, the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, and the income and assets of the sponsor's spouse, must be deemed to the noncitizen to the extent required by those sections of Public Law 104-193.\n(c) The income and assets of a sponsor and the sponsor's spouse to whom the provisions of paragraph (b) do not apply must be deemed to the noncitizen to the full extent allowed under title V, section 5505, of Public Law 105-33, the Balanced Budget Act of 1997.\nThe agency must include gross earned income less any disregards in the initial income test. Gross earned income received by persons employed on a contractual basis must be prorated over the period covered by the contract even when payments are received over a lesser period of time.\n[See Note.]\n(a) The agency shall count $50 of the value of public and assisted rental subsidies provided through the Department of Housing and Urban Development (HUD) as unearned income to the cash portion of the MFIP grant. The full amount of the subsidy must be counted as unearned income when the subsidy is less than $50. The income from this subsidy shall be budgeted according to section 256P.09.\n(b) The provisions of this subdivision shall not apply to an MFIP assistance unit which includes a participant who is:\n(1) age 60 or older;\n(2) a caregiver who is suffering from an illness, injury, or incapacity that has been certified by a qualified professional when the illness, injury, or incapacity is expected to continue for more than 30 days and severely limits the person's ability to obtain or maintain suitable employment; or\n(3) a caregiver whose presence in the home is required due to the illness or incapacity of another member in the assistance unit, a relative in the household, or a foster child in the household when the illness or incapacity and the need for the participant's presence in the home has been certified by a qualified professional and is expected to continue for more than 30 days.\n(c) The provisions of this subdivision shall not apply to an MFIP assistance unit where the parental caregiver is an SSI participant.\n[See Note.]\nSelf-employment has the meaning given in section 256P.01, subdivision 7.\nThe agency must determine self-employment income according to section 256P.05, subdivision 2.\nThe agency must budget self-employment earned income according to section 256P.05, subdivision 3.\nFarm income shall be treated as self-employment income under section 256P.05, subdivision 2. The agency must budget farm income as self-employment earned income according to section 256P.05, subdivision 3.\nRental income is subject to the requirements of section 256P.05.\n(a) The agency must apply unearned income to the MFIP transitional standard. When determining the amount of unearned income, the agency must deduct the costs necessary to secure payments of unearned income. These costs include legal fees, medical fees, and mandatory deductions such as federal and state income taxes.\n(b) The agency must convert unearned income received on a periodic basis to monthly amounts by prorating the income over the number of months represented by the frequency of the payments. The agency must begin counting the monthly amount in the month the periodic payment is received and budget it according to the assistance unit's budget cycle.",
	"repealed": false
}