{
	"id": "126C.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.17",
	"title": "126C.17 REFERENDUM REVENUE.",
	"text": "(a) A district's initial referendum allowance for fiscal year 2021 and later equals the result of the following calculations:\n(1) subtract $424 from the district's allowance under Minnesota Statutes 2018, section 126C.17, subdivision 1, paragraph (a), clause (5);\n(2) if the result of clause (1) is less than zero, set the allowance to zero;\n(3) add to the result in clause (2) any new referendum allowance authorized between July 1, 2013, and December 31, 2013, under Minnesota Statutes 2013, section 126C.17, subdivision 9a;\n(4) add to the result in clause (3) any additional referendum allowance per adjusted pupil unit authorized between January 1, 2014, and June 30, 2019;\n(5) subtract from the result in clause (4) any allowances expiring in fiscal year 2016, 2017, 2018, 2019, or 2020;\n(6) subtract $300 from the result in clause (5); and\n(7) if the result of clause (6) is less than zero, set the allowance to zero.\n(b) A district's referendum allowance equals the sum of the district's initial referendum allowance, plus any new referendum allowance authorized after July 1, 2019, minus any allowances expiring in fiscal year 2021 or later, plus any inflation adjustments for fiscal year 2021 and later approved by the voters prior to July 1, 2019, provided that the allowance may not be less than zero. For a district with more than one allowance for fiscal year 2015 that expires in the same year, the reduction under paragraph (a), clauses (1) and (6), shall be made first from any allowances that do not have an inflation adjustment approved by the voters.\n(a) Notwithstanding subdivision 1, for fiscal year 2021 and later, a district's referendum allowance must not exceed the greater of:\n(1) the product of the annual inflationary increase as calculated under paragraph (b), and $2,079.50, minus $300;\n(2) the product of the annual inflationary increase as calculated under paragraph (b), and the referendum allowance limit the district would have received for fiscal year 2021 under Minnesota Statutes 2018, section 126C.17, subdivision 2, paragraph (a), clause (2), minus $300;\n(3) for a newly reorganized district created on July 1, 2020, the referendum revenue authority for each reorganizing district in the year preceding reorganization divided by its adjusted pupil units for the year preceding reorganization, minus $300; or\n(4) for a newly reorganized district created after July 1, 2020, the referendum revenue authority for each reorganizing district in the year preceding reorganization divided by its adjusted pupil units for the year preceding reorganization.\n(b) For purposes of this subdivision, for fiscal year 2022 and later, \"inflationary increase\" means one plus the percentage change in the Consumer Price Index for urban consumers, as prepared by the United States Bureau of Labor Statistics, for the current fiscal year to fiscal year 2021.\nA district that qualifies for sparsity revenue under section 126C.10 is not subject to a referendum allowance limit.\nThe total referendum revenue for each district equals the district's referendum allowance times the adjusted pupil units for the school year.\n(a) A district's referendum equalization revenue equals the sum of the first tier referendum equalization revenue and the second tier referendum equalization revenue.\n(b) A district's first tier referendum equalization revenue equals the district's first tier referendum equalization allowance times the district's adjusted pupil units for that year.\n(c) A district's first tier referendum equalization allowance equals the lesser of the district's referendum allowance under subdivision 1 or $460.\n(d) A district's second tier referendum equalization revenue equals the district's second tier referendum equalization allowance times the district's adjusted pupil units for that year.\n(e) A district's second tier referendum equalization allowance equals the lesser of the district's referendum allowance under subdivision 1 or 25 percent of the formula allowance, minus the sum of $300 and the district's first tier referendum equalization allowance.\n(f) Notwithstanding paragraph (e), the second tier referendum equalization allowance for a district qualifying for secondary sparsity revenue under section 126C.10, subdivision 7, or elementary sparsity revenue under section 126C.10, subdivision 8, equals the district's referendum allowance under subdivision 1 minus the district's first tier referendum equalization allowance.\n(a) A district's referendum equalization levy equals the sum of the first tier referendum equalization levy and the second tier referendum equalization levy.\n(b) A district's first tier referendum equalization levy equals the district's first tier referendum equalization revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $567,000.\n(c) A district's second tier referendum equalization levy equals the district's second tier referendum equalization revenue times the lesser of one or the ratio of the district's referendum market value per resident pupil unit to $290,000.\n(a) A district's referendum equalization aid equals the difference between its referendum equalization revenue and levy.\n(b) If a district's actual levy for first or second tier referendum equalization revenue is less than its maximum levy limit for that tier, aid shall be proportionately reduced.\n(c) Notwithstanding paragraph (a), the referendum equalization aid for a district must not exceed: (1) 25 percent of the formula allowance minus $300; times (2) the district's adjusted pupil units. A district's referendum levy is increased by the amount of any reduction in referendum aid under this paragraph.\nFor each school district that had a referendum allowance for fiscal year 2002 exceeding $415, for each separately authorized referendum levy, the commissioner of revenue, in consultation with the commissioner of education, shall certify the amount of the referendum levy in taxes payable year 2001 attributable to the portion of the referendum allowance exceeding $415 levied against property classified as class 2, noncommercial 4c(1), or 4c(4), under section 273.13, excluding the portion of the tax paid by the portion of class 2a property consisting of the house, garage, and surrounding one acre of land. The resulting amount must be used to reduce the district's referendum levy or first tier local optional levy amount otherwise determined, and must be paid to the district each year that the referendum or first tier local optional authority remains in effect, is renewed, or new referendum authority is approved. The aid payable under this subdivision must be subtracted from the district's referendum equalization aid under subdivision 7. The referendum equalization aid and the first tier local optional aid after the subtraction must not be less than zero.\n(a) Notwithstanding subdivision 7, the sum of a district's referendum equalization aid and local optional aid under section 126C.10, subdivision 2e, for fiscal year 2015 must not be less than the sum of the referendum equalization aid the district would have received for fiscal year 2015 under Minnesota Statutes 2012, section 126C.17, subdivision 7, and the adjustment the district would have received under Minnesota Statutes 2012, section 127A.47, subdivision 7, paragraphs (a), (b), and (c).\n(b) Notwithstanding subdivision 7, the sum of referendum equalization aid and local optional aid under section 126C.10, subdivision 2e, for fiscal year 2016 and later, for a district qualifying for additional aid under paragraph (a) for fiscal year 2015, must not be less than the product of (1) the sum of the district's referendum equalization aid and local optional aid under section 126C.10, subdivision 2e, for fiscal year 2015, times (2) the lesser of one or the ratio of the sum of the district's referendum revenue and local optional revenue for that school year to the sum of the district's referendum revenue and local optional revenue for fiscal year 2015, times (3) the lesser of one or the ratio of the district's referendum market value used for fiscal year 2015 referendum equalization calculations to the district's referendum market value used for that year's referendum equalization calculations.\nEach year, a district may levy an amount equal to the difference between its total referendum revenue according to subdivision 4 and its referendum equalization revenue according to subdivision 5.\n(a) The revenue authorized by section 126C.10, subdivision 1, may be increased in the amount approved by the voters of the district at a referendum called for the purpose. The referendum may be called by the board. The referendum must be conducted one or two calendar years before the increased levy authority, if approved, first becomes payable. Only one election to approve an increase may be held in a calendar year. Unless the referendum is conducted by mail under subdivision 11, paragraph (a), the referendum must be held on the first Tuesday after the first Monday in November. The ballot must state the maximum amount of the increased revenue per adjusted pupil unit. The ballot may state a schedule, determined by the board, of increased revenue per adjusted pupil unit that differs from year to year over the number of years for which the increased revenue is authorized or may state that the amount shall increase annually by the rate of inflation. For this purpose, the rate of inflation shall be the annual inflationary increase calculated under subdivision 2, paragraph (b). The ballot may state that existing referendum levy authority is expiring. In this case, the ballot may also compare the proposed levy authority to the existing expiring levy authority, and express the proposed increase as the amount, if any, over the expiring referendum levy authority. The ballot must designate the specific number of years, not to exceed ten, for which the referendum authorization applies. The ballot, including a ballot on the question to revoke or reduce the increased revenue amount under paragraph (c), must abbreviate the term \"per adjusted pupil unit\" as \"per pupil.\" The notice required under section 275.60 may be modified to read, in cases of renewing existing levies at the same amount per pupil as in the previous year:\n\"BY VOTING \"YES\" ON THIS BALLOT QUESTION, YOU ARE VOTING TO EXTEND AN EXISTING PROPERTY TAX REFERENDUM THAT IS SCHEDULED TO EXPIRE.\"\nThe ballot may contain a textual portion with the information required in this subdivision and a question stating substantially the following:\n\"Shall the increase in the revenue proposed by (petition to) the board of ......., School District No. .., be approved?\"\nIf approved, an amount equal to the approved revenue per adjusted pupil unit times the adjusted pupil units for the school year beginning in the year after the levy is certified shall be authorized for certification for the number of years approved, if applicable, or until revoked or reduced by the voters of the district at a subsequent referendum.\n(b) The board must deliver by mail at least 15 days but no more than 45 days before the day of the referendum to each taxpayer a notice of the referendum and the proposed revenue increase. The board need not mail more than one notice to any taxpayer. For the purpose of giving mailed notice under this subdivision, owners must be those shown to be owners on the records of the county auditor or, in any county where tax statements are mailed by the county treasurer, on the records of the county treasurer. Every property owner whose name does not appear on the records of the county auditor or the county treasurer is deemed to have waived this mailed notice unless the owner has requested in writing that the county auditor or county treasurer, as the case may be, include the name on the records for this purpose. The notice must project the anticipated amount of tax increase in annual dollars for typical residential homesteads, agricultural homesteads, apartments, and commercial-industrial property within the school district.\nThe notice for a referendum may state that an existing referendum levy is expiring and project the anticipated amount of increase over the existing referendum levy in the first year, if any, in annual dollars for typical residential homesteads, agricultural homesteads, apartments, and commercial-industrial property within the district.\nThe notice must include the following statement: \"Passage of this referendum will result in an increase in your property taxes.\" However, in cases of renewing existing levies, the notice may include the following statement: \"Passage of this referendum extends an existing operating referendum at the same amount per pupil as in the previous year.\"\n(c) A referendum on the question of revoking or reducing the increased revenue amount authorized pursuant to paragraph (a) may be called by the board. A referendum to revoke or reduce the revenue amount must state the amount per adjusted pupil unit by which the authority is to be reduced. Revenue authority approved by the voters of the district pursuant to paragraph (a) must be available to the school district at least once before it is subject to a referendum on its revocation or reduction for subsequent years. Only one revocation or reduction referendum may be held to revoke or reduce referendum revenue for any specific year and for years thereafter.\n(d) The approval of 50 percent plus one of those voting on the question is required to pass a referendum authorized by this subdivision.\n(e) At least 15 days before the day of the referendum, the district must submit a copy of the notice required under paragraph (b) to the commissioner and to the county auditor of each county in which the district is located. Within 15 days after the results of the referendum have been certified by the board, or in the case of a recount, the certification of the results of the recount by the canvassing board, the district must notify the commissioner of the results of the referendum.\nMS 2018 [Repealed, 1Sp2019 c 11 art 1 s 26]\n(a) Notwithstanding the election requirements of subdivision 9, a school board may renew an expiring referendum by board action if:\n(1) the per pupil amount of the referendum is the same as the amount expiring, or for an expiring referendum that was adjusted annually by the rate of inflation, the same as the per pupil amount of the expiring referendum, adjusted annually for inflation in the same manner as if the expiring referendum had continued;\n(2) the term of the renewed referendum is no longer than the initial term approved by the voters;\n(3) the school board, having taken a recorded vote, has adopted a written resolution authorizing the renewal after holding a meeting and allowing public testimony on the proposed renewal; and\n(4) the expiring referendum has not been previously renewed under this subdivision.\n(b) The resolution must be adopted by the school board by June 15 of any calendar year and becomes effective 60 days after its adoption.\n(c) A referendum expires in the last fiscal year in which the referendum generates revenue for the school district. A school board may renew an expiring referendum under this subdivision not more than two fiscal years before the referendum expires.\n(d) A district renewing an expiring referendum under this subdivision must submit a copy of the adopted resolution to the commissioner and to the county auditor no later than September 1 of the calendar year in which the written resolution is adopted.\nA school referendum levy must be levied against the referendum market value of all taxable property as defined in section 126C.01, subdivision 3. Any referendum levy amount subject to the requirements of this subdivision must be certified separately to the county auditor under section 275.07.\n(a) Except for a referendum held under paragraph (b), any referendum under this section held on a day other than the first Tuesday after the first Monday in November must be conducted by mail in accordance with section 204B.46. Notwithstanding subdivision 9, paragraph (b), to the contrary, in the case of a referendum conducted by mail under this paragraph, the notice required by subdivision 9, paragraph (b), must be prepared and delivered by first-class mail at least 20 days before the referendum.\n(b) In addition to the referenda allowed in subdivision 9, paragraph (a), the commissioner may grant authority to a district to hold a referendum on a different day if the district is in statutory operating debt and has an approved plan or has received an extension from the department to file a plan to eliminate the statutory operating debt.\n(c) The commissioner must approve, deny, or modify each district's request for a referendum levy on a different day within 60 days of receiving the request from a district.\n[Repealed, 1Sp2001 c 6 art 1 s 55 subd 1]\nMS 2012 [Repealed, 2013 c 116 art 1 s 59]",
	"repealed": false
}