{
	"id": "167.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/167.46",
	"title": "167.46 PROPERTY PURCHASED WITH HIGHWAY BOND PROCEEDS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"State trunk highway bond-financed property\" means property acquired, improved, or maintained in whole or in part with the proceeds of state trunk highway bonds authorized to be issued under the Minnesota Constitution, article XIV, section 11.\n(c) \"Outstanding state trunk highway bonds\" means the dollar amount of state trunk highway bonds, including any refunding state trunk highway bonds, issued with respect to state trunk highway bond-financed property, less the principal amount of state trunk highway bonds paid or defeased.\n(a) State trunk highway bond-financed property may only be leased (1) for those purposes authorized by law, (2) in accordance with the requirements of all other laws and duly adopted rules applicable thereto, and orders, if any, of the commissioner of management and budget intended to ensure the legality and tax-exempt status of outstanding state trunk highway bonds, and (3) with the approval of the commissioner of management and budget. A lease of state trunk highway bond-financed property, including any renewals that are solely at the option of the lessee, must be for a term substantially less than the useful life of the state trunk highway bond-financed property, but may allow renewal beyond that term upon a determination by the commissioner of transportation that the use continues to be authorized by law and that the additional term is authorized by law. A lease of state trunk highway bond-financed property must be terminable by the commissioner of transportation if the other contracting party defaults under the contract and must provide for oversight by the commissioner of transportation.\n(b) Notwithstanding the provisions of any other law, money received by the state under a lease of state trunk highway bond-financed property must be paid to the commissioner of transportation, deposited in the state trunk highway fund, and used to pay or redeem or defease any outstanding state trunk highway bonds in accordance with the commissioner of management and budget's order authorizing their issuance. The money paid to the commissioner of transportation is appropriated for this purpose. Money in excess of the foregoing requirement must be applied as otherwise required by law.\n(a) State trunk highway bond-financed property must not be sold unless the sale (1) is for a purpose authorized by law, (2) is conducted in accordance with applicable law and duly adopted rules, (3) is made in accordance with orders, if any, of the commissioner of management and budget intended to ensure the legality and tax-exempt status of outstanding state trunk highway bonds, and (4) is approved by the commissioner of management and budget.\n(b) Notwithstanding any other law, the net proceeds of a sale of any state trunk highway bond-financed property must be paid to the commissioner of transportation, deposited in the state trunk highway fund, and used to pay or redeem or defease any outstanding trunk highway bonds in accordance with the commissioner of management and budget's order authorizing their issuance. The net proceeds of sale paid to the commissioner of transportation are appropriated for these purposes. Any net proceeds of sale in excess of the foregoing requirement must be applied as otherwise required by law. When all of the net proceeds of sale have been applied as provided in this subdivision, the sold property is no longer considered state trunk highway bond-financed property.\nThis section applies to all state trunk highway bond-financed property unless otherwise provided by law.",
	"repealed": false
}