{
	"id": "245C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.08",
	"title": "245C.08 BACKGROUND STUDY; COMMISSIONER REVIEWS.",
	"text": "(a) For a background study conducted by the Department of Human Services, the commissioner shall review:\n(1) information related to names of substantiated perpetrators of maltreatment of vulnerable adults that has been received by the commissioner as required under section 626.557, subdivision 9c, paragraph (j);\n(2) the commissioner's records relating to the maltreatment of minors in licensed programs, and from findings of maltreatment of minors as indicated through the social service information system;\n(3) information from juvenile courts as required for studies under this chapter when there is reasonable cause;\n(4) information from the Bureau of Criminal Apprehension, including information regarding a background study subject's registration in Minnesota as a predatory offender under section 243.166;\n(5) except as provided in clause (6), information received as a result of submission of fingerprints for a national criminal history record check, as defined in section 245C.02, subdivision 13c, when the commissioner has reasonable cause for a national criminal history record check as defined under section 245C.02, subdivision 15a, or as required under section 144.057, subdivision 1, clause (2);\n(6) for a background study related to a child foster family setting application for licensure, foster residence settings, children's residential facilities, a transfer of permanent legal and physical custody of a child under sections 260C.503 to 260C.515, or adoptions, and for a background study required for family child care, certified license-exempt child care, child care centers, and legal nonlicensed child care authorized under chapter 142E, the commissioner shall also review:\n(i) information from the child abuse and neglect registry for any state in which the background study subject has resided for the past five years;\n(ii) when the background study subject is 18 years of age or older, or a minor under section 245C.05, subdivision 5a, paragraph (c), information received following submission of fingerprints for a national criminal history record check; and\n(iii) when the background study subject is 18 years of age or older or a minor under section 245C.05, subdivision 5a, paragraph (d), for licensed family child care, certified license-exempt child care, licensed child care centers, and legal nonlicensed child care authorized under chapter 142E, information obtained using non-fingerprint-based data including information from the criminal and sex offender registries for any state in which the background study subject resided for the past five years and information from the national crime information database and the national sex offender registry;\n(7) for a background study required for family child care, certified license-exempt child care centers, licensed child care centers, and legal nonlicensed child care authorized under chapter 142E, the background study shall also include, to the extent practicable, a name and date-of-birth search of the National Sex Offender Public website; and\n(8) for a background study required for treatment programs for sexual psychopathic personalities or sexually dangerous persons, the background study shall only include a review of the information required under paragraph (a), clauses (1) to (4).\n(b) Except as otherwise provided in this paragraph, notwithstanding expungement by a court, the commissioner may consider information obtained under paragraph (a), clauses (3) and (4), unless:\n(1) the commissioner received notice of the petition for expungement and the court order for expungement is directed specifically to the commissioner; or\n(2) the commissioner received notice of the expungement order issued pursuant to section 609A.017, 609A.025, or 609A.035, and the order for expungement is directed specifically to the commissioner.\nThe commissioner may not consider information obtained under paragraph (a), clauses (3) and (4), or from any other source that identifies a violation of chapter 152 without determining if the offense involved the possession of marijuana or tetrahydrocannabinol and, if so, whether the person received a grant of expungement or order of expungement, or the person was resentenced to a lesser offense. If the person received a grant of expungement or order of expungement, the commissioner may not consider information related to that violation but may consider any other relevant information arising out of the same incident.\n(c) The commissioner shall also review criminal case information received according to section 245C.04, subdivision 4a, from the Minnesota court information system that relates to individuals who have already been studied under this chapter and who remain affiliated with the agency that initiated the background study.\n(d) When the commissioner has reasonable cause to believe that the identity of a background study subject is uncertain, the commissioner may require the subject to provide a set of classifiable fingerprints for purposes of completing a fingerprint-based record check with the Bureau of Criminal Apprehension. Fingerprints collected under this paragraph shall not be saved by the commissioner after they have been used to verify the identity of the background study subject against the particular criminal record in question.\n(e) The commissioner may inform the entity that initiated a background study under NETStudy 2.0 of the status of processing of the subject's fingerprints.\nMS 2023 Supp [Repealed, 2024 c 127 art 62 s 53]\n(a) For any background study completed under this section, if the commissioner has reasonable cause to believe the information is pertinent to the disqualification of an individual, the commissioner also may review arrest and investigative information from:\n(1) the Bureau of Criminal Apprehension;\n(2) the commissioners of children, youth, and families; health; and human services;\n(3) a county attorney;\n(4) a county sheriff;\n(5) a county agency;\n(6) a local chief of police;\n(7) other states;\n(8) the courts;\n(9) the Federal Bureau of Investigation;\n(10) the National Criminal Records Repository; and\n(11) criminal records from other states.\n(b) Except when specifically required by law, the commissioner is not required to conduct more than one review of a subject's records from the Federal Bureau of Investigation if a review of the subject's criminal history with the Federal Bureau of Investigation has already been completed by the commissioner and there has been no break in the subject's affiliation with the entity that initiated the background study.\n(c) If the commissioner conducts a national criminal history record check when required by law and uses the information from the national criminal history record check to make a disqualification determination, the data obtained is private data and cannot be shared with private agencies or prospective employers of the background study subject.\n(d) If the commissioner conducts a national criminal history record check when required by law and uses the information from the national criminal history record check to make a disqualification determination, the license holder or entity that submitted the study is not required to obtain a copy of the background study subject's disqualification letter under section 245C.17, subdivision 3.\n(a) For a background study conducted by the Department of Human Services, the commissioner shall review records from the juvenile courts for an individual studied under this chapter when the commissioner has reasonable cause.\n(b) The juvenile courts shall help with the study by giving the commissioner existing juvenile court records relating to delinquency proceedings held on individuals who are subjects of studies under this chapter when requested pursuant to this subdivision.\n(c) For purposes of this chapter, a finding that a delinquency petition is proven in juvenile court shall be considered a conviction in state district court.\n(d) Juvenile courts shall provide orders of involuntary and voluntary termination of parental rights under section 260C.301 to the commissioner upon request for purposes of conducting a background study under this chapter.\nThe commissioner of human services shall be authorized to receive information under this chapter.",
	"repealed": false
}