{
	"id": "60K.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.31",
	"title": "60K.31 DEFINITIONS.",
	"text": "For purposes of sections 60K.30 to 60K.56, the terms in subdivisions 2 to 18 have the meanings given them. The definitions in section 60A.02 are applicable to terms not defined in this section, unless the language or context clearly indicates that a different meaning is intended.\n\"Agent of record\" means an insurance producer, as defined in subdivision 6, who enters into an agreement with:\n(1) a policyholder who has individual health insurance coverage from an insurance company that the producer represents; or\n(2) an applicant for individual health insurance coverage from an insurance company the producer represents.\n\"Agent of record agreement\" means an agreement documenting the agreement referenced in subdivision 1a, and that is signed by the agent of record and either a policyholder or applicant for individual health insurance coverage.\n\"Business entity\" means a corporation, association, partnership, limited liability company, limited liability partnership, or other legal entity.\n\"Commissioner\" means the commissioner of commerce.\n\"Fingerprint\" means an impression of the lines on the finger taken for purpose of identification.\n\"Home state\" means the District of Columbia and any state or territory of the United States in which an insurance producer maintains the producer's principal place of residence or principal place of business and is licensed to act as an insurance producer.\n\"Individual health plan\" means a health plan as defined in section 62A.011, subdivision 4.\n\"Insurance\" means any of the lines of authority in section 60A.06.\n\"Insurance producer\" means a person required to be licensed under the laws of this state to sell, solicit, or negotiate insurance.\n\"License\" means a document issued by the commissioner authorizing a person to act as an insurance producer for the lines of authority specified in the document. The license itself does not create any authority, actual, apparent, or inherent, in the holder to represent or commit an insurance carrier.\n\"Limited line credit insurance\" includes credit life, credit disability, credit property, credit unemployment, involuntary unemployment, mortgage life, mortgage guaranty, mortgage disability, guaranteed automobile protection insurance, and any other form of insurance offered in connection with an extension of credit that is limited to partially or wholly extinguishing that credit obligation that the commissioner determines should be designated a form of limited line credit insurance.\n\"Limited line credit insurance producer\" means a person who sells, solicits, or negotiates one or more forms of limited line credit insurance coverage to individuals through a master, corporate, group, or individual policy.\n\"Limited lines insurance\" means those lines of insurance defined in section 60K.38, subdivision 1, paragraph (c), or any other line of insurance that the commissioner considers necessary to recognize for the purposes of complying with section 60K.39, subdivision 6.\n\"Limited lines producer\" means a person authorized by the commissioner to sell, solicit, or negotiate limited lines insurance.\n\"Negotiate\" means the act of conferring directly with or offering advice directly to a purchaser or prospective purchaser of a particular contract of insurance concerning any of the substantive benefits, terms, or conditions of the contract if the person engaged in that act either sells insurance or obtains insurance from insurers for purchasers.\n\"Person\" means an individual or a business entity.\n\"Sell\" means to exchange a contract of insurance by any means, for money or its equivalent, on behalf of an insurance company.\n\"Solicit\" means attempting to sell insurance or asking or urging a person to apply for a particular kind of insurance from a particular company.\n\"Terminate\" means the cancellation of the relationship between an insurance producer and the insurer or the termination of a producer's authority to transact insurance.\n\"Uniform Business Entity Application\" means the current version of the Uniform Business Entity Application for resident and nonresident business entities of the National Association of Insurance Commissioners.\n\"Uniform Application\" means the current version of the Uniform Application for resident and nonresident producer licensing of the National Association of Insurance Commissioners.",
	"repealed": false
}