{
	"id": "518.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.68",
	"title": "518.68 REQUIRED NOTICES.",
	"text": "Every court order or judgment and decree under this chapter or chapter 518A that provides for child support, spousal maintenance, custody, or parenting time must contain certain notices as set out in subdivision 2. The information in the notices must be concisely stated in plain language. The notices must be in clearly legible print, but may not exceed two pages. An order or judgment and decree without the notice remains subject to all statutes. The court may waive all or part of the notice required under subdivision 2 relating to parental rights under section 518.17, subdivision 3, if it finds it is necessary to protect the welfare of a party or child.\nThe required notices must be substantially as follows:\nIMPORTANT NOTICE\n1. PAYMENTS TO PUBLIC AGENCY\nAccording to Minnesota Statutes, section 518A.50, payments ordered for maintenance and support must be paid to the public agency responsible for child support enforcement as long as the person entitled to receive the payments is receiving or has applied for public assistance or has applied for support and maintenance collection services. MAIL PAYMENTS TO:\n2. DEPRIVING ANOTHER OF CUSTODIAL OR PARENTAL RIGHTS -- A FELONY\nA person may be charged with a felony who conceals a minor child or takes, obtains, retains, or fails to return a minor child from or to the child's parent (or person with custodial or visitation rights), according to Minnesota Statutes, section 609.26. A copy of that section is available from any district court clerk.\n3. NONSUPPORT OF A SPOUSE OR CHILD -- CRIMINAL PENALTIES\nA person who fails to pay court-ordered child support or maintenance may be charged with a crime, which may include misdemeanor, gross misdemeanor, or felony charges, according to Minnesota Statutes, section 609.375. A copy of that section is available from any district court clerk.\n4. RULES OF SUPPORT, MAINTENANCE, PARENTING TIME\n(a) Payment of support or spousal maintenance is to be as ordered, and the giving of gifts or making purchases of food, clothing, and the like will not fulfill the obligation.\n(b) Payment of support must be made as it becomes due, and failure to secure or denial of parenting time is NOT an excuse for nonpayment, but the aggrieved party must seek relief through a proper motion filed with the court.\n(c) Nonpayment of support is not grounds to deny parenting time. The party entitled to receive support may apply for support and collection services, file a contempt motion, or obtain a judgment as provided in Minnesota Statutes, section 548.091.\n(d) The payment of support or spousal maintenance takes priority over payment of debts and other obligations.\n(e) A party who accepts additional obligations of support does so with the full knowledge of the party's prior obligation under this proceeding.\n(f) Child support or maintenance is based on annual income, and it is the responsibility of a person with seasonal employment to budget income so that payments are made throughout the year as ordered.\n(g) Reasonable parenting time guidelines are contained in Appendix B, which is available from the court administrator.\n(h) The nonpayment of support may be enforced through the denial of student grants; interception of state and federal tax refunds; suspension of driver's, recreational, and occupational licenses; referral to the department of revenue or private collection agencies; seizure of assets, including bank accounts and other assets held by financial institutions; reporting to credit bureaus; income withholding and contempt proceedings; and other enforcement methods allowed by law.\n(i) The public authority may suspend or resume collection of the amount allocated for child care expenses if the conditions of Minnesota Statutes, section 518A.40, subdivision 4, are met.\n(j) The public authority may remove or resume a medical support offset if the conditions of Minnesota Statutes, section 518A.41, subdivision 16, are met.\n5. MODIFYING CHILD SUPPORT\nIf either the obligor or obligee is laid off from employment or receives a pay reduction, child support may be modified, increased, or decreased. Any modification will only take effect when it is ordered by the court, and will only relate back to the time that a motion is filed. Either the obligor or obligee may file a motion to modify child support, and may request the public agency for help. UNTIL A MOTION IS FILED, THE CHILD SUPPORT OBLIGATION WILL CONTINUE AT THE CURRENT LEVEL. THE COURT IS NOT PERMITTED TO REDUCE SUPPORT RETROACTIVELY.\n6. PARENTAL RIGHTS FROM MINNESOTA STATUTES, SECTION 518.17, SUBDIVISION 3\nUnless otherwise provided by the Court:\n(a) Each party has the right of access to, and to receive copies of, school, medical, dental, religious training, and other important records and information about the minor children. Each party has the right of access to information regarding health or dental insurance available to the minor children. Presentation of a copy of this order to the custodian of a record or other information about the minor children constitutes sufficient authorization for the release of the record or information to the requesting party.\n(b) Each party shall keep the other informed as to the name and address of the school of attendance of the minor children. Each party has the right to be informed by school officials about the children's welfare, educational progress and status, and to attend school and parent teacher conferences. The school is not required to hold a separate conference for each party.\n(c) In case of an accident or serious illness of a minor child, each party shall notify the other party of the accident or illness, and the name of the health care provider and the place of treatment.\n(d) Each party has the right of reasonable access and telephone contact with the minor children.\n7. WAGE AND INCOME DEDUCTION OF SUPPORT AND MAINTENANCE\nChild support and/or spousal maintenance may be withheld from income, with or without notice to the person obligated to pay, when the conditions of Minnesota Statutes, section 518A.53 have been met. A copy of those sections is available from any district court clerk.\n8. CHANGE OF ADDRESS OR RESIDENCE\nUnless otherwise ordered, each party shall notify the other party, the court, and the public authority responsible for collection, if applicable, of the following information within ten days of any change: the residential and mailing address, telephone number, driver's license number, Social Security number, and name, address, and telephone number of the employer.\n9. COST OF LIVING INCREASE OF SUPPORT AND MAINTENANCE\nBasic support and/or spousal maintenance may be adjusted every two years based upon a change in the cost of living (using Department of Labor Consumer Price Index .........., unless otherwise specified in this order) when the conditions of Minnesota Statutes, section 518A.75, are met. Cost of living increases are compounded. A copy of Minnesota Statutes, section 518A.75, and forms necessary to request or contest a cost of living increase are available from any district court clerk.\n10. JUDGMENTS FOR UNPAID SUPPORT\nIf a person fails to make a child support payment, the payment owed becomes a judgment against the person responsible to make the payment by operation of law on or after the date the payment is due, and the person entitled to receive the payment or the public agency may obtain entry and docketing of the judgment WITHOUT NOTICE to the person responsible to make the payment under Minnesota Statutes, section 548.091.\n11. JUDGMENTS FOR UNPAID MAINTENANCE\n(a) A judgment for unpaid spousal maintenance may be entered when the conditions of Minnesota Statutes, section 548.091, are met. A copy of that section is available from any district court clerk.\n(b) The public authority is not responsible for calculating interest on any judgment for unpaid spousal maintenance. When providing services in IV-D cases, as defined in Minnesota Statutes, section 518A.26, subdivision 10, the public authority will only collect interest on spousal maintenance if spousal maintenance is reduced to a sum certain judgment.\n12. ATTORNEY FEES AND COLLECTION COSTS FOR ENFORCEMENT OF CHILD SUPPORT\nA judgment for attorney fees and other collection costs incurred in enforcing a child support order will be entered against the person responsible to pay support when the conditions of Minnesota Statutes, section 518A.735, are met. A copy of Minnesota Statutes, sections 518.14 and 518A.735 and forms necessary to request or contest these attorney fees and collection costs are available from any district court clerk.\n13. PARENTING TIME EXPEDITOR PROCESS\nOn request of either party or on its own motion, the court may appoint a parenting time expeditor to resolve parenting time disputes under Minnesota Statutes, section 518.1751. A copy of that section and a description of the expeditor process is available from any district court clerk.\n14. PARENTING TIME REMEDIES AND PENALTIES\nRemedies and penalties for the wrongful denial of parenting time are available under Minnesota Statutes, section 518.175, subdivision 6. These include compensatory parenting time; civil penalties; bond requirements; contempt; and reversal of custody. A copy of that subdivision and forms for requesting relief are available from any district court clerk.\nThe district court administrator shall make available at no charge copies of the sections referred to in subdivision 2, and shall provide forms to request or contest attorney fees and collection costs or a cost-of-living increase under section 518A.735 or 518A.75.",
	"repealed": false
}