{
	"id": "204B.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.46",
	"title": "204B.46 MAIL ELECTIONS; QUESTIONS.",
	"text": "A county, municipality, or school district submitting questions to the voters at a special election may conduct an election by mail with no polling place other than the office of the auditor or clerk. No offices may be voted on at a mail election, except in overlapping school and municipal jurisdictions, where a mail election may include an office when one of the jurisdictions also has a question on the ballot. Notice of the election must be given to the county auditor at least 84 days prior to the election. This notice shall also fulfill the requirements of Minnesota Rules, part 8210.3000. The special mail ballot procedures must be posted at least six weeks prior to the election. Not more than 46 nor later than 14 days prior to the election, the auditor or clerk shall mail ballots by nonforwardable mail to all voters registered in the county, municipality, or school district. No later than 14 days before the election, the auditor or clerk must make a subsequent mailing of ballots to those voters who register to vote after the initial mailing but before the 20th day before the election. Eligible voters not registered at the time the ballots are mailed may apply for ballots pursuant to chapter 203B. The auditor or clerk must appoint a ballot board to examine the mail and absentee ballot return envelopes and mark them \"Accepted\" or \"Rejected\" within three days of receipt if there are 14 or fewer days before election day, or within five days of receipt if there are more than 14 days before election day. The board may consist of deputy county auditors, deputy municipal clerks, or deputy school district clerks who have received training in the processing and counting of mail ballots, who need not be affiliated with a major political party. Election judges performing the duties in this section must be of different major political parties, unless they are exempt from that requirement under section 205.075, subdivision 4, or section 205A.10. If an envelope has been rejected at least five days before the election, the ballots in the envelope must remain sealed and the auditor or clerk must provide the voter with a replacement ballot and return envelope in place of the spoiled ballot. If the ballot is rejected within five days of the election, the envelope must remain sealed and the official in charge of the ballot board must attempt to contact the voter by telephone or email to notify the voter that the voter's ballot has been rejected. The official must document the attempts made to contact the voter.\nIf the ballot is accepted, the county auditor or municipal clerk must mark the roster to indicate that the voter has already cast a ballot in that election. After the close of business on the 19th day before the election, the ballots from return envelopes marked \"Accepted\" may be opened, duplicated as needed in the manner provided by section 206.86, subdivision 5, initialed by the ballot board, and deposited in the appropriate ballot box.\nIn all other respects, the provisions of the Minnesota Election Law governing deposit and counting of ballots apply.\nThe mail and absentee ballots for a precinct must be counted together and reported as one vote total. No vote totals from ballots may be made public before the close of voting on election day.",
	"repealed": false
}