{
	"id": "308C.312",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.312",
	"title": "308C.312 LIMITED EQUITY COOPERATIVES.",
	"text": "A cooperative formed under this chapter may organize as a limited equity cooperative in order to fulfill the public purpose of providing and preserving housing for persons and households of low and moderate income at the time that they purchase their memberships. In addition to safeguarding the foregoing public purpose, a limited equity cooperative shall meet the following requirements:\n(1) the articles shall require that cooperative interests be sold at no more than a transfer value determined by a limited equity formula contained in the articles. That value shall be consistent with the object of maintaining long-term affordability of membership interests for persons or households of low and moderate income;\n(2) a limited equity formula, once established by a cooperative in its articles, may be amended only if that amendment does not make the cooperative membership unaffordable for low or moderate income households for which the cooperative was originally incorporated. A limited equity cooperative once organized under this chapter may not reorganize as other than a limited equity cooperative without first dissolving;\n(3) a limited equity cooperative shall not sell all or substantially all of its assets if such sale is intended to circumvent the public purposes of this section;\n(4) the articles shall require that the cooperative shall have the first right to repurchase a member's cooperative interest;\n(5) the articles shall require that the total distribution out of capital to a member shall not exceed the transfer value; and\n(6) the articles shall require that upon dissolution of the cooperative, any assets remaining after retirement of corporate debts and distribution to members shall be distributed to a charitable organization described in section 501(c)(3) of the Internal Revenue Code of 1986, as amended, a public agency, or another limited equity cooperative whose formula for determining transfer value shall be no less restrictive than that of the cooperative being dissolved.",
	"repealed": false
}