{
	"id": "127A.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.70",
	"title": "127A.70 MINNESOTA P-20 EDUCATION PARTNERSHIP.",
	"text": "(a) A P-20 education partnership is established to create a seamless system of education that maximizes achievements of all students, from early childhood through elementary, secondary, and postsecondary education, while promoting the efficient use of financial and human resources. The partnership shall consist of major statewide educational groups or constituencies or noneducational statewide organizations with a stated interest in P-20 education. The initial membership of the partnership includes the members serving on the Minnesota P-16 Education Partnership and four legislators appointed as follows:\n(1) one senator from the majority party and one senator from the minority party, appointed by the Subcommittee on Committees of the Committee on Rules and Administration; and\n(2) one member of the house of representatives appointed by the speaker of the house and one member appointed by the minority leader of the house of representatives.\n(b) The chair of the P-16 education partnership must convene the first meeting of the P-20 partnership. Prospective members may be nominated by any partnership member and new members will be added with the approval of a two-thirds majority of the partnership. The partnership will also seek input from nonmember organizations whose expertise can help inform the partnership's work.\n(c) Partnership members shall be represented by the chief executives, presidents, or other formally designated leaders of their respective organizations, or their designees. The partnership shall meet at least three times during each calendar year.\n(a) The partnership shall develop recommendations to the governor and the legislature designed to maximize the achievement of all P-20 students while promoting the efficient use of state resources, thereby helping the state realize the maximum value for its investment. These recommendations may include, but are not limited to, strategies, policies, or other actions focused on:\n(1) improving the quality of and access to education at all points from preschool through graduate education;\n(2) improving preparation for, and transitions to, postsecondary education and work;\n(3) ensuring educator quality by creating rigorous standards for teacher recruitment, teacher preparation, induction and mentoring of beginning teachers, and continuous professional development for career teachers; and\n(4) realigning the governance and administrative structures of early education, kindergarten through grade 12, and postsecondary systems in Minnesota.\n(b) Under the direction of the P-20 Education Partnership Statewide Longitudinal Education Data System Governance Committee, the Office of Higher Education and the Departments of Education and Employment and Economic Development shall improve and expand the Statewide Longitudinal Education Data System (SLEDS) and the Early Childhood Longitudinal Data System (ECLDS) to provide policymakers, education and workforce leaders, researchers, and members of the public with data, research, and reports to:\n(1) expand reporting on students' educational outcomes for diverse student populations including at-risk students, children with disabilities, English learners, and gifted students, among others, and include formative and summative evaluations based on multiple measures of child well-being, early childhood development, and student progress toward career and college readiness;\n(2) evaluate the effectiveness of early care, educational, and workforce programs; and\n(3) evaluate the relationships among early care, education, and workforce outcomes, consistent with section 124D.49.\nTo the extent possible under federal and state law, research and reports should be accessible to the public on the Internet, and disaggregated by demographic characteristics, organization or organization characteristics, and geography.\nIt is the intent of the legislature that the Statewide Longitudinal Education Data System and the Early Childhood Longitudinal Data System inform public policy and decision-making. The SLEDS governance committee and ECLDS governance committee, with assistance from staff of the Office of Higher Education, the Department of Education, and the Department of Employment and Economic Development, shall respond to legislative committee and agency requests on topics utilizing data made available through the Statewide Longitudinal Education Data System and the Early Childhood Longitudinal Data System as resources permit. Any analysis of or report on the data must contain only summary data.\n(c) By January 15 of each year, the partnership shall submit a report to the governor and to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over P-20 education policy and finance that summarizes the partnership's progress in meeting its goals and identifies the need for any draft legislation when necessary to further the goals of the partnership to maximize student achievement while promoting efficient use of resources.\n(a) The partnership must work with representatives of the Department of Education, the Department of Employment and Economic Development, the Department of Labor, the Professional Educator Licensing and Standards Board, the Board of School Administrators, trade associations, local and regional employers, local school boards, adult basic education program providers, postsecondary institutions, parents, other interested and affected education stakeholders, and other major statewide educational groups and constituencies to recommend to the legislature ways to identify specific policy, administrative, and statutory changes needed under sections 120B.11, 120B.125, 122A.09, 122A.14, 122A.18, and 122A.60, among other statutory provisions, to effect and, if appropriate, revise a comprehensive, effective, and publicly accountable P-20 education system premised on developing, implementing, and realizing students' individual career and college readiness plans and goals. In developing its recommendations, the partnership must consider how best to:\n(1) provide students regular and frequent access to multiple qualified individuals within the school and local and regional community who have access to reliable and accurate information, resources, and technology the students need to successfully pursue career and technical education, other postsecondary education, or work-based training options;\n(2) regularly engage students in planning and continually reviewing their own career and college readiness plans and goals and in pursuing academic and applied and experiential learning that helps them realize their goals; and\n(3) identify and apply valid and reliable measures of student progress and program efficacy that, among other requirements, can accommodate students' prior education-related experiences and applied and experiential learning that students acquire via contextualized projects and other recognized learning opportunities.\n(b) The partnership must recommend to the commissioner of education and representatives of secondary and postsecondary institutions and programs how to organize and implement a framework of the foundational knowledge and skills and career fields, clusters, and pathways for students enrolled in a secondary school, postsecondary institution, or work-based program. The key elements of these programs of study for students pursuing postsecondary workforce training or other education must include:\n(1) competency-based curricula aligned with industry expectations and skill standards;\n(2) sequential course offerings that gradually build students' skills, enabling students to graduate from high school and complete postsecondary programs;\n(3) flexible and segmented course and program formats to accommodate students' interests and needs;\n(4) course portability to allow students to seamlessly progress in the students' education and career; and\n(5) effective and sufficiently strong P-20 connections to facilitate students' uninterrupted skill building, provide students with career opportunities, and align academic credentials with opportunities for advancement in high-skill, high-wage, and high-demand occupations.\n(c) Stakeholders under this paragraph must examine possibilities for redesigning teacher and school administrator licensure requirements, and make recommendations to the Professional Educator Licensing and Standards Board and the Board of School Administrators, respectively, to create specialized licenses, credentials, and other endorsement forms to increase students' participation in language immersion programs, world language instruction, career development opportunities, work-based learning, early college courses and careers, career and technical education programs, Montessori schools, and project and place-based learning, among other career and college ready opportunities. Consistent with the possibilities for redesigning educators' licenses, the stakeholders also must examine how to restructure staff development and training opportunities under sections 120B.125 and 122A.60 to realize the goals of this subdivision.\n(d) The partnership must recommend to the Department of Education, the Department of Employment and Economic Development, and postsecondary institutions and systems how best to create a mobile, web-based hub for students and their families that centralizes existing resources on careers and employment trends and the educational pathways required to attain such careers and employment.\n[Repealed, 2014 c 286 art 8 s 40]",
	"repealed": false
}