{
	"id": "505.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/505.021",
	"title": "505.021 PLAT CONTENTS; SURVEY; COUNTY SURVEYOR APPROVAL.",
	"text": "The plat shall be prepared on transparent reproducible film or the equivalent with a minimum thickness of four mil, and shall be prepared by a photographic process. Plat sheet size shall be 22 inches by 34 inches. A border line shall be placed one-half inch inside the outer edge of the plat on the top and bottom 34-inch sides; and the right 22-inch side; and two inches inside the outer edge of the plat on the left 22-inch side. If a plat consists of more than one sheet, the sheets shall be numbered consecutively. Only the official plat shall be labeled \"OFFICIAL PLAT\" and any copy shall be labeled \"copy\" in the center of the top margin.\nThe plat name shall appear across the top portion of the plat and in the dedication paragraph of the plat and shall not duplicate or be similar to the name of any plat that is in the office of the county recorder or registrar of titles in the county in which the land is located. The plat name shall be in capital letters in all locations that the name appears on the plat. The plat shall contain a complete and accurate description of each tract of land being platted and a dedication statement describing what part of the land is dedicated, to whom, and for what purpose. In the event of a discrepancy between the plat name stated in the dedication statement and the plat name appearing in other portions of the plat, the name in the dedication statement shall control.\nThe names and signatures of all fee owners, contract for deed vendees, and mortgage holders of record of the land being platted shall appear on the plat, together with a statement as to their interest. The marital status of individual owners shall appear on the plat. Entities shall identify the specific type of entity and the jurisdiction in which the entity is organized. Agents or officers for an entity shall state their position with the entity. A mortgage holder may consent to the plat by a written acknowledged statement in lieu of the mortgage holder's name and signature appearing on the plat. If a mortgage holder is included on the plat, the plat shall be signed by an authorized representative. If a certificate of notarial act on a plat includes the jurisdiction of the notarial act, the name of the notarial officer, the title of the notarial officer, and the date the notary commission expires, printed in pen and ink or typewritten on the plat, a plat shall be recorded regardless of whether a notary stamp was used or was illegible if used. All signatures on the plat shall be written with black ink (not ball point).\nPlat boundaries shall be designated on the plat in accordance with the underlying legal description and survey. All lots in each block shall be numbered consecutively with Arabic numerals beginning with the numeral 1. All blocks shall be numbered consecutively with Arabic numerals beginning with numeral 1. All outlots shall be labeled OUTLOT in capital letters and lettered consecutively in capital letters beginning with the letter \"A.\" All lot, block, and outlot lines shall be drawn as a solid line. The name and adjacent boundary line of any adjoining platted lands shall be dotted on the plat.\nA plat shall show all survey and mathematical information and data necessary to locate and retrace all boundary lines and monuments. Bearings, azimuths, and central angles shall be expressed in degrees, minutes, and seconds and labeled with the respective symbols. A north arrow and directional orientation note shall be shown. Distances shall be expressed in feet and hundredths of a foot. All straight line segments of the plat shall be labeled with the length of the line and bearing or azimuth. All curved line segments of the plat shall be labeled with the central angle, arc length, and radius length. If any curve is nontangential the dimensions shall include a long chord bearing or azimuth, and shall be labeled nontangential. The mathematical closure tolerance of the plat boundary, blocks, lots, and outlots shall not exceed 2/100 of a foot. A graphics scale shall be shown along with the label \"Scale In Feet.\" Dimension and descriptive recitals in the legal description shown on the plat shall be depicted and labeled on the graphic portion of the plat. A symbol shall indicate the position of all found and set plat monuments, along with a description of each. Text used on the plat shall not be smaller than eight-point type. Ditto marks and foot and inch symbols shall not be used.\nAll public ways within the plat, whether existing at the time of platting or being dedicated by the plat shall be depicted on the plat together with the name and sufficient mathematical data to locate the position and width of the public way. The location of all existing public ways adjacent to the plat boundary shall be depicted on the plat as dashed lines. The name and width of the adjacent public ways shall be shown, if known.\nAll easements to be dedicated on the plat shall be depicted on the plat with purpose, identification, and sufficient mathematical data to locate the boundaries of the easements. Easements created on the plat shall be limited to drainage easements, public ways, and utility easements as defined in section 505.01, subdivision 3, paragraphs (b), (h), and (j). Drainage and utility easement boundaries shall be shown as dashed lines. Temporary easements, building setback information, and building floor elevations shall not be shown on a plat.\nAny water boundary abutting or lying within the plat boundaries shall be shown and identified on the plat as a solid line delineating the then existing shore line. When any parcel depicted on the plat includes water as a boundary, a dashed survey line shall be shown and labeled with sufficient mathematical data to compute a closure of said parcel. Distances shall be shown between the survey line and the water boundary at all angle points, lot and boundary lines. Plat monuments shall be set at all locations where the survey line intersects a plat boundary line or block, lot or outlot line. The water elevation of any lake, stream, or river depicted on the plat shall be shown to the tenth of a foot along with the date the elevation was measured. All elevations shall be referenced to a durable benchmark described on the plat together with its general location shown and benchmark elevation to the hundredth of a foot. If a mean sea level adjusted datum benchmark is available within two miles of the land being platted, all elevations shall be referenced to the datum. The highest known water elevation shall be indicated on the plat if the data is available from the Department of Natural Resources, the United States Army Corps of Engineers, or another appropriate governmental unit. All wet lands as defined in section 505.01, subdivision 3, paragraph (l), shall be shown on the plat. The shore or margin of wet lands which do not form a boundary of or within the plat shall be shown as a dashed line.\n(a) A plat shall contain a certification by the land surveyor who surveyed or directly supervised the survey of the land being platted, and prepared the plat or directly supervised the plat preparation. The certificate shall state that:\n(1) the plat is a correct representation of the boundary survey;\n(2) all mathematical data and labels are correctly designated on the plat;\n(3) all monuments depicted on the plat have been or will be correctly set within one year as indicated on the plat;\n(4) all water boundaries and wet lands as of the date of the surveyor's certification are shown and labeled on the plat; and\n(5) all public ways are shown and labeled on the plat.\nThe surveyor's certification shall be properly acknowledged by the surveyor on the plat before a notarial officer.\n(b) A plat shall contain a certification of approval executed by the local elected governmental unit or an authorized official designated by the local elected governmental unit.\n(c) In any county that requires review and approval of plats in accordance with section 389.09, subdivision 1, the plat shall contain a certification of approval executed by the county surveyor or other licensed land surveyor hired by the county.\n(d) A plat shall contain a certification by the proper county official that there are no delinquent taxes owed and that the current year's payable taxes have been paid in accordance with section 272.12.\n(e) A plat shall contain a certification of recording by the county recorder or registrar of titles, or both, if the plat contains both nonregistered and registered property.\nThe land surveyor that certifies the plat shall survey or directly supervise the survey of the land depicted on the plat. Plat monuments shall be set at all angle and curve points on the outside boundary lines of the plat prior to recording. Plat monuments shall be set at all other block, lot, outlot, park, survey line, and witness corners within one year after recording the plat. A financial guarantee may be required for the placement of monuments. If it is impracticable to set a plat monument, a witness plat monument shall be set. The license number of the land surveyor that certifies the plat shall be affixed to all set plat monuments.\nAll plats prepared for recording in accordance with this section are subject to approval by the county surveyor in accordance with section 389.09, subdivision 1, and/or as authorized by their respective county board of commissioners.",
	"repealed": false
}