{
	"id": "524.5-102",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-102",
	"title": "524.5-102 DEFINITIONS.",
	"text": "As used in sections 524.5-101 to 524.5-502, the terms defined in this section have the meanings given them.\n\"ABLE account\" means an Achieving a Better Life Experience Act of 2014 account under section 529A of the Internal Revenue Code.\n\"Claim,\" with respect to a person subject to conservatorship, includes a claim against an individual, whether arising in contract, tort, or otherwise, and a claim against an estate which arises at or after the appointment of a conservator, including expenses of administration.\n\"Conservator\" means a person who is appointed by a court to manage the estate of a person subject to conservatorship and includes a limited conservator.\n\"Court\" means the district court.\n\"Guardian\" means a person who has qualified as a guardian of a minor or incapacitated person pursuant to appointment by a parent or spouse, or by the court, and includes a limited, emergency, or temporary substitute guardian but not a guardian ad litem.\n\"Incapacitated person\" means an individual who, for reasons other than being a minor, is impaired to the extent of lacking sufficient understanding or capacity to make personal decisions, and who is unable to meet personal needs for medical care, nutrition, clothing, shelter, or safety, even with appropriate technological and supported decision making assistance.\n\"Interested party\" means a person who has suffered some injury-in-fact, a person who is the beneficiary of some legislative enactment granting standing, or a person who must have sufficient personal interest in the matter so that it is appropriate to allow that person to participate in the matter.\n\"Interested person\" includes:\n(i) the adult subject to guardianship or conservatorship, ward, protected person, or respondent;\n(ii) a nominated guardian or conservator, or the duly appointed guardian or conservator;\n(iii) legal representative;\n(iv) the spouse, parent, adult children including adult step-children of a living spouse, and siblings, or if none of such persons is living or can be located, the next of kin of the person subject to guardianship, person subject to conservatorship, or respondent;\n(v) an adult person who has lived with a person subject to guardianship, person subject to conservatorship, or respondent for a period of more than six months;\n(vi) an attorney for the person subject to guardianship or person subject to conservatorship;\n(vii) a governmental agency paying or to which an application has been made for benefits for the respondent, person subject to guardianship, or person subject to conservatorship, including the county social services agency for the person's county of residence and the county where the proceeding is venued;\n(viii) a representative of a state ombudsman's office or a federal protection and advocacy program that has notified the court that it has a matter regarding the person subject to guardianship, person subject to conservatorship, or respondent;\n(ix) a health care agent or proxy appointed pursuant to a health care directive as defined in section 145C.01, a living will under chapter 145B, or other similar document executed in another state and enforceable under the laws of this state;\n(x) in the case of a minor who is an Indian as defined under United States Code, title 25, section 1903, (1) the tribal chairman or delegated agent and (2) the regional director of the minor child's tribe with service by registered or certified mail under Code of Federal Regulations, title 25, parts 23.11 and 23.12; and\n(xi) any other person designated by the court.\n\"Legal representative\" includes a representative payee, a guardian or conservator acting for a respondent in this state or elsewhere, or a trustee or custodian of a trust or custodianship of which the respondent is a beneficiary.\n\"Letters\" includes letters of guardianship and letters of conservatorship.\n\"Minor\" means an unemancipated individual who has not attained 18 years of age.\n\"Next of kin\" shall be determined by the court.\n\"Parent\" means a parent whose parental rights have not been terminated.\n\"Person\" means an individual, corporation, business trust, estate, trust, partnership, limited liability company, association, joint venture, government, governmental subdivision, agency, or instrumentality, or any other legal or commercial entity.\n\"Person subject to conservatorship\" means a minor or other individual for whom a conservator has been appointed.\n\"Person subject to guardianship\" means an individual for whom a guardian has been appointed.\n\"Professional guardian\" or \"professional conservator\" means a person acting as guardian or conservator for three or more individuals not related by blood, adoption, or marriage.\n\"Protected person\" means a minor or other individual for whom a conservator has been appointed or other protective order has been made.\n\"Respondent\" means an individual for whom the appointment of a guardian or conservator or other protective order is sought.\n\"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or a territory or insular possession subject to the jurisdiction of the United States.\n\"Supported decision making\" means assistance from one or more persons of an individual's choosing in understanding the nature and consequences of potential personal and financial decisions which enables the individual to make the decisions and, when consistent with the individual's wishes, in communicating a decision once made.\n\"Ward\" means an individual for whom a guardian has been appointed.",
	"repealed": false
}