{
	"id": "144G.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.50",
	"title": "144G.50 ASSISTED LIVING CONTRACT REQUIREMENTS.",
	"text": "(a) An assisted living facility may not offer or provide housing or assisted living services to any individual unless it has executed a written contract.\n(b) The contract must contain all the terms concerning the provision of:\n(1) housing;\n(2) assisted living services, whether provided directly by the facility or by management agreement or other agreement; and\n(3) the resident's service plan, if applicable.\n(c) A facility must:\n(1) offer to prospective residents and provide to the Office of Ombudsman for Long-Term Care a complete unsigned copy of its contract; and\n(2) give a complete copy of any signed contract and any addendums, and all supporting documents and attachments, to the resident promptly after a contract and any addendum has been signed.\n(d) A contract under this section is a consumer contract under sections 325G.29 to 325G.37.\n(e) Before or at the time of execution of the contract, the facility must offer the resident the opportunity to identify a designated representative according to subdivision 3.\n(f) The resident must agree in writing to any additions or amendments to the contract. Upon agreement between the resident and the facility, a new contract or an addendum to the existing contract must be executed and signed.\n(a) The contract must include in a conspicuous place and manner on the contract the legal name and the health facility identification of the facility.\n(b) The contract must include the name, telephone number, and physical mailing address, which may not be a public or private post office box, of:\n(1) the facility and contracted service provider when applicable;\n(2) the licensee of the facility;\n(3) the managing agent of the facility, if applicable; and\n(4) the authorized agent for the facility.\n(c) The contract must include:\n(1) a disclosure of the category of assisted living facility license held by the facility and, if the facility is not an assisted living facility with dementia care, a disclosure that it does not hold an assisted living facility with dementia care license;\n(2) a description of all the terms and conditions of the contract, including a description of and any limitations to the housing or assisted living services to be provided for the contracted amount;\n(3) a delineation of the cost and nature of any other services to be provided for an additional fee;\n(4) a delineation and description of any additional fees the resident may be required to pay if the resident's condition changes during the term of the contract;\n(5) a delineation of the grounds under which the resident may be transferred or have housing or services terminated or be subject to an emergency relocation;\n(6) billing and payment procedures and requirements; and\n(7) disclosure of the facility's ability to provide specialized diets.\n(d) The contract must include a description of the facility's complaint resolution process available to residents, including the name and contact information of the person representing the facility who is designated to handle and resolve complaints.\n(e) The contract must include a clear and conspicuous notice of:\n(1) the right under section 144G.54 to appeal the termination of an assisted living contract;\n(2) the facility's policy regarding transfer of residents within the facility, under what circumstances a transfer may occur, and the circumstances under which resident consent is required for a transfer;\n(3) contact information for the Office of Ombudsman for Long-Term Care, the Ombudsman for Mental Health and Developmental Disabilities, and the Office of Health Facility Complaints;\n(4) the resident's right to obtain services from an unaffiliated service provider;\n(5) a description of the facility's policies related to medical assistance waivers under chapter 256S and section 256B.49 and the housing support program under chapter 256I, including:\n(i) whether the facility is enrolled with the commissioner of human services to provide customized living services under medical assistance waivers;\n(ii) whether the facility has an agreement to provide housing support under section 256I.04, subdivision 2, paragraph (b);\n(iii) whether there is a limit on the number of people residing at the facility who can receive customized living services or participate in the housing support program at any point in time. If so, the limit must be provided;\n(iv) whether the facility requires a resident to pay privately for a period of time prior to accepting payment under medical assistance waivers or the housing support program, and if so, the length of time that private payment is required;\n(v) a statement that medical assistance waivers provide payment for services, but do not cover the cost of rent;\n(vi) a statement that residents may be eligible for assistance with rent through the housing support program; and\n(vii) a description of the rent requirements for people who are eligible for medical assistance waivers but who are not eligible for assistance through the housing support program;\n(6) the contact information to obtain long-term care consulting services under section 256B.0911; and\n(7) the toll-free phone number for the Minnesota Adult Abuse Reporting Center.\n(a) Before or at the time of execution of an assisted living contract, an assisted living facility must offer the resident the opportunity to identify a designated representative in writing in the contract and must provide the following verbatim notice on a document separate from the contract:\n\"RIGHT TO DESIGNATE A REPRESENTATIVE FOR CERTAIN PURPOSES.\nYou have the right to name anyone as your \"Designated Representative.\" A Designated Representative can assist you, receive certain information and notices about you, including some information related to your health care, and advocate on your behalf. A Designated Representative does not take the place of your guardian, conservator, power of attorney (\"attorney-in-fact\"), or health care power of attorney (\"health care agent\"), if applicable.\"\n(b) The contract must contain a page or space for the name and contact information of the designated representative and a box the resident must initial if the resident declines to name a designated representative. Notwithstanding subdivision 1, paragraph (f), the resident has the right at any time to add, remove, or change the name and contact information of the designated representative.\nThe contract and related documents must be maintained by the facility in files from the date of execution until five years after the contract is terminated or expires. The contracts and all associated documents must be available for on-site inspection by the commissioner at any time. The documents shall be available for viewing or copies shall be made available to the resident and the legal or designated representative at any time.\nThe contract must not include a waiver of facility liability for the health and safety or personal property of a resident. The contract must not include any provision that the facility knows or should know to be deceptive, unlawful, or unenforceable under state or federal law, nor include any provision that requires or implies a lesser standard of care or responsibility than is required by law.",
	"repealed": false
}