{
	"id": "342.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.23",
	"title": "342.23 CANNABIS BUSINESSES AND HEMP BUSINESSES; GENERAL OPERATIONAL REQUIREMENTS.",
	"text": "(a) Cannabis businesses and hemp businesses must retain financial records for the current and previous tax years at the primary business location and must make those records available for inspection by the office at any time during regular business hours.\n(b) When applicable, a cannabis business or hemp business must maintain financial records for the previous ten tax years and must make those records available for inspection within one business day of receiving a request for inspection by the office.\n(c) The office may require a cannabis business or hemp business to submit to an audit of its business records. The office may select or approve the auditor and the cannabis business or hemp business must provide the auditor with access to all business records. The cost of the audit must be paid by the cannabis business or hemp business.\nCannabis businesses and hemp businesses shall provide an annual report on the status of diversity in the business ownership, management, and employment and in services for which the business contracts.\n(a) Cannabis businesses and hemp businesses must dispose of cannabis plants, cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, and hemp-derived consumer products that are damaged, have a broken seal, have been contaminated, or have not been sold by the expiration date on the label.\n(b) Disposal must be conducted in a manner approved by the office.\n(c) Disposal of any cannabis plants, cannabis flower, cannabis products, artificially derived cannabinoids, and hemp-derived consumer products that are required to be entered into the statewide monitoring system must be documented in the statewide monitoring system.\n(d) Loss or theft of any cannabis plants, cannabis flower, cannabis products, artificially derived cannabinoids, or hemp-derived consumer products that are required to be entered into the statewide monitoring system must be reported to local law enforcement and a business must log any such loss or theft in the statewide monitoring system as soon as the loss or theft is discovered.\nCannabis businesses and hemp businesses may only sell cannabis plants, cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, and hemp-derived consumer products that are a product category approved by the office and that comply with this chapter and rules adopted pursuant to this chapter regarding the testing, packaging, and labeling of cannabis plants, cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, and hemp-derived consumer products.\n(a) Except for the lawful sale of cannabis plants, cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, and hemp-derived consumer products in the ordinary course of business and as otherwise provided in this subdivision, no cannabis business or hemp business may offer, give, accept, receive, or borrow money or anything else of value or accept or receive credit from any other cannabis business. This prohibition applies to offering or receiving a benefit in exchange for preferential placement by a retailer, including preferential placement on the retailer's shelves, display cases, or website. This prohibition applies to every cooperative member or every director, manager, and general partner of a cannabis business or hemp business.\n(b) This prohibition does not apply to merchandising credit in the ordinary course of business for a period not to exceed 30 days.\n(c) This prohibition does not apply to free samples of usable cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products packaged in a sample jar protected by a plastic or metal mesh screen to allow customers to smell the cannabis flower, cannabis product, lower-potency hemp edible, or hemp-derived consumer product before purchase. A sample jar may not contain more than eight grams of usable cannabis flower, more than eight grams of a cannabis concentrate, an edible cannabis product infused with more than 100 milligrams of tetrahydrocannabinol, a lower-potency hemp edible infused with more than 50 milligrams of tetrahydrocannabinol, or a hemp-derived consumer product with a total weight of more than eight grams.\n(d) This prohibition does not apply to free samples of cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products provided to a retailer or cannabis wholesaler for the purposes of quality control and to allow retailers to determine whether to offer a product for sale. A sample provided for these purposes may not contain more than eight grams of usable cannabis flower, more than eight grams of a cannabis concentrate, an edible cannabis product infused with more than 100 milligrams of tetrahydrocannabinol, a lower-potency hemp edible infused with more than 50 milligrams of tetrahydrocannabinol, or a hemp-derived consumer product with a total weight of more than eight grams.\n(e) This prohibition does not apply to any fee charged by a licensed cannabis event organizer to a cannabis business or hemp business for participation in a cannabis event.\nCannabis businesses and hemp businesses must not share data on retail or wholesale customers with any federal agency, federal department, or federal entity unless specifically ordered by a state or federal court.",
	"repealed": false
}