{
	"id": "142G.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.78",
	"title": "142G.78 COUNTY OF FINANCIAL RESPONSIBILITY POLICIES.",
	"text": "The county of financial responsibility is the county in which a minor child or pregnant woman lives on the date the application is signed, unless subdivision 4 applies. When more than one county is financially responsible for the members of an assistance unit, financial responsibility must be assigned to a single county beginning the first day of the calendar month after the assistance unit members are required to be in a single assistance unit. Financial responsibility must be assigned to the county that was initially responsible for the assistance unit member with the earliest date of application. The county in which the assistance unit is currently residing becomes financially responsible for the entire assistance unit beginning two full calendar months after the month in which financial responsibility was consolidated in one county.\n(a) When an assistance unit moves from one county to another and continues to receive assistance, the new county of residence becomes the county of financial responsibility when that assistance unit has lived in that county in nonexcluded status for two full calendar months. \"Nonexcluded status\" means the period of residence that is not considered excluded time under section 256G.02, subdivision 6. When a minor child moves from one county to another to reside with a different caregiver, the caregiver in the former county is eligible to receive assistance for that child only through the last day of the month of the move. The caregiver in the new county becomes eligible to receive assistance for the child the first day of the month following the move or the date of application, whichever is later.\n(b) When an applicant moves from one county to another while the application is pending, the county where application first occurred is the county of financial responsibility until the applicant has lived in the new county for two full calendar months, unless the applicant's move is covered under section 256G.02, subdivision 6.\nA county of residence, when different from the county of financial responsibility, will be charged by the commissioner for the value of incorrect assistance payments paid to or on behalf of a person who was not eligible to receive that amount. Incorrect payments include payments to an ineligible person or family resulting from decisions, failures to act, miscalculations, or overdue recertification. However, financial responsibility does not accrue for a county when the recertification is overdue at the time the referral is received by the county of residence or when the county of financial responsibility does not act on the recommendation of the county of residence.\nWhen an applicant or participant resides in an excluded time facility as described in section 256G.02, subdivision 6, the county that is financially responsible for the applicant or participant is the county in which the applicant or participant last resided outside such a facility immediately before entering the facility. When an applicant or participant has not resided in this state for any time other than excluded time as defined in section 256G.02, subdivision 6, the county that is financially responsible for the applicant or participant is the county in which the applicant or participant resides on the date the application is signed.",
	"repealed": false
}