{
	"id": "144.1912",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1912",
	"title": "144.1912 GREATER MINNESOTA FAMILY MEDICINE RESIDENCY GRANT PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of health.\n(c) \"Eligible family medicine residency program\" means a program that meets the following criteria:\n(1) is located in Minnesota outside the seven-county metropolitan area, as defined in section 473.121, subdivision 4;\n(2) is accredited as a family medicine residency program or is a candidate for accreditation;\n(3) is focused on the education and training of family medicine physicians to serve communities outside the metropolitan area; and\n(4) demonstrates that over the most recent three years at least 25 percent of its graduates practice in Minnesota communities outside the metropolitan area.\n(a) The commissioner shall award family medicine residency grants to existing, eligible, not-for-profit family medicine residency programs to support current and new residency positions. Funds shall be allocated first to proposed new family medicine residency positions, and remaining funds shall be allocated proportionally based on the number of existing residents in eligible programs. The commissioner may fund a new residency position for up to three years.\n(b) Grant funds awarded may only be spent to cover the costs of:\n(1) establishing, maintaining, or expanding training for family medicine residents;\n(2) recruitment, training, and retention of residents and faculty;\n(3) travel and lodging for residents; and\n(4) faculty, resident, and preceptor salaries.\n(c) Grant funds shall not be used to supplant any other government or private funds available for these purposes.\nEligible family medicine residency programs seeking a grant must apply to the commissioner. The application must include objectives, a related work plan and budget, a description of the number of new and existing residency positions that will be supported using grant funds, and additional information the commissioner determines to be necessary. The commissioner shall determine whether applications are complete and responsive and may require revisions or additional information before awarding a grant.\nThe commissioner shall require and collect from family medicine residency programs receiving grants, information necessary to administer and evaluate the program. The evaluation shall include the scope of expansion of new residency positions and information describing specific programs to enhance current residency positions, which may include facility improvements. The commissioner shall continue to collect data on greater Minnesota family medicine residency shortages.",
	"repealed": false
}