{
	"id": "60A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.09",
	"title": "60A.09 LIMITS OF RISK; REINSURANCE.",
	"text": "No company other than a company authorized to transact the kind of business specified in section 60A.06, subdivision 1, clause (7), shall insure or reinsure in a single risk a larger sum than one-tenth of its net assets, and no company authorized to transact the kind of business specified in section 60A.06, subdivision 1, clause (7), shall insure or reinsure in a single risk a larger sum than two-thirds of its net assets; provided, that in the case of a company with net assets of more than $50,000, any portion of the risk which has been reinsured, as authorized by the laws of this state, shall be deducted before determining the limitation of risk prescribed by this subdivision; and, provided, that a mutual insurance company organized under clause (2)(a) of section 66A.08, subdivision 2, may insure in a single risk, consisting of a creamery or a cheese factory, a sum equal to one percent of its insurance in force.\nIf any company, other than life, shall, directly or indirectly, effect the reinsurance of any risk taken by it, or any part thereof, it shall make a sworn report thereof to the commissioner, at the time of filing its annual statement, or at such other time as the commissioner may request.\nEvery company effecting any reinsurance in violation of the foregoing provisions, and every agent effecting or negotiating the same, shall severally be guilty of a misdemeanor.\n[Repealed, 1991 c 325 art 1 s 16]\nNo company, whether domestic, foreign, or alien, shall perform an assumption transaction, including an assumption reinsurance agreement, with respect to a policy issued to a Minnesota resident, unless:\n(1) the assumption agreement has been filed with the commissioner;\n(2) the assumption agreement specifically provides that the original insurer remains liable to the insured in the event the assuming insurer is unable to fulfill its obligations or the original insurer acknowledges in writing to the commissioner that it remains liable to the insured in the event the assuming insurer is unable to fulfill its obligations;\n(3) the proposed certificate of assumption to be provided to the policyholder has been filed with the commissioner for review and approval as provided in section 61A.02; and\n(4) the proposed certificate of assumption contains, in boldface type, the following language:\n\"Policyholder: Please be advised that you retain all rights with respect to your policy against your original insurer in the event the assuming insurer is unable to fulfill its obligations. In such event, your original insurer remains liable to you notwithstanding the terms of its assumption agreement.\"\nWith respect to residents of Minnesota, the notice to policyholders shall also include a statement as to the effect on guaranty fund coverage, if any, that will result from the transfer.\nClauses (2) and (4) above do not apply if the policyholder consents in a signed writing to a release of the original insurer from liability and to a waiver of the protections provided in clauses (2) and (4) after being informed in writing by the insurer of the circumstances relating to and the effect of the assumption, provided that the consent form signed by the policyholder has been filed with and approved by the commissioner.\nIf a company is deemed by the commissioner to be in a hazardous condition or is under a court ordered supervision, rehabilitation, liquidation, conservation or receivership, and the transfer of policies is in the best interest of the policyholders, as determined by the commissioner, a transfer may be effected notwithstanding the provisions in this subdivision by using a different form of consent by policyholders. This may include a form of implied consent and adequate notification to the policyholder of the circumstances requiring the transfer as approved by the commissioner. This paragraph does not apply when a policy is transferred to the Minnesota Life and Health Guaranty Association or to the Minnesota Insurance Guaranty Association.\n(1) Definitions. For the purposes of this subdivision, the word \"insurer\" shall be deemed to include the word \"reinsurer,\" and the words \"issue policies of insurance\" shall be deemed to include the words \"make contracts of reinsurance.\"\n(2) Reinsurance of more than 50 percent of insurance liabilities. Any contract of reinsurance whereby an insurer cedes more than 50 percent of the total of its outstanding insurance liabilities shall, if such insurer is incorporated by or, if an insurer of a foreign country, has its principal office in this state, be subject to the approval, in writing, by the commissioner.\n(3) Aircraft risks. An insurer authorized to transact the business specified in section 60A.06, subdivision 1, clauses (4) and (5)(a), may through reinsurance assume any risk arising from, related to, or incident to the manufacture, ownership, or operation of aircraft and may retrocede any portion thereof; provided, however, that no insurer may undertake any such reinsurance business without the prior approval of the commissioner and such reinsurance business shall be subject to any regulations which may be promulgated by the commissioner. Any such reinsurance business may be provided through pooling arrangements with other insurers for purposes of spreading the insurance risk.\n(1) No bulk reinsurance agreement entered into by an insurance company, other than life insurance companies, having a capital and surplus or surplus of $5,000,000 or less, shall be used to reduce the liabilities or expense of the reinsured company until and unless the agreement has been filed with and approved by the commissioner. The commissioner will be deemed to have approved any agreement filed unless the commissioner notifies the insurance company of disapproval within 30 days or requests a reasonable extension of time within such 30 days.\n(2) No filing shall be made pursuant to the foregoing clause (1) unless the reinsurance agreement be certified under oath by responsible officers of the reinsurer and the reinsured to contain the entire agreement between the parties to the reinsurance agreement.\nMisrepresentations contained in the reinsurance agreement or in any information supplied to the commissioner relative thereto shall be subject to the penalties for perjury.\n(3) It shall be unlawful for any reinsurance agreement to contain any provisions which have the effect of nullifying the liability which the reinsurer purports to assume.\n(4) For the purposes of this subdivision, \"bulk reinsurance\" shall mean any quota share, surplus aid or portfolio reinsurance agreement which, of itself or in combination with other similar agreements, assumes 20 percent or more of the liability of the reinsured company.\n(5) Every company effecting any bulk reinsurance in violation of the foregoing provisions, and every person effecting or negotiating the same, shall severally be guilty of a misdemeanor.\n(6) Reinsurance agreements filed hereunder shall not be matters of public record, but this shall not be construed to limit the disclosure of reinsurance agreements in examination reports.\nFor a company authorized to transact a kind of business specified in section 60A.06, subdivision 1, clause (7), the term \"single risk\" as used in this section shall mean the insured amount of any policy or contract unless two or more policies or contracts are simultaneously issued on different estates in identical real property, in which event, it means the sum of the insured amounts of all such policies or contracts; provided, any policy or contract that insures a mortgage interest that is excepted in a fee or leasehold policy or contract, and which does not exceed the insured amount of the fee or leasehold policy or contract, shall be excluded in computing the amount of a single risk.",
	"repealed": false
}