{
	"id": "145.882",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.882",
	"title": "145.882 MATERNAL AND CHILD HEALTH BLOCK GRANT DISTRIBUTION.",
	"text": "Any decrease in the amount of federal funding to the state for the maternal and child health block grant must be apportioned to reflect a proportional decrease for each recipient. Any increase in the amount of federal funding to the state must be distributed under subdivisions 2 and 3.\nBeginning January 1, 1986, up to one-third of the total maternal and child health block grant money may be retained by the commissioner of health to:\n(1) meet federal maternal and child block grant requirements of a statewide needs assessment every five years and prepare the annual federal block grant application and report;\n(2) collect and disseminate statewide data on the health status of mothers and children within one year of the end of the year;\n(3) provide technical assistance to community health boards in meeting statewide outcomes;\n(4) evaluate the impact of maternal and child health activities on the health status of mothers and children;\n(5) provide services to children under age 16 receiving benefits under title XVI of the Social Security Act; and\n(6) perform other maternal and child health activities listed in section 145.88 and as deemed necessary by the commissioner.\n(a) The maternal and child health block grant money remaining after distributions made under subdivision 2 must be allocated according to the formula in section 145A.131, subdivision 2, for distribution to community health boards.\n(b) A community health board that receives funding under this section shall provide at least a 50 percent match for funds received under United States Code, title 42, sections 701 to 709. Eligible funds must be used to meet match requirements. Eligible funds include funds from local property taxes, reimbursements from third parties, fees, other funds, donations, nonfederal grants, or state funds received under the local public health grant defined in section 145A.131, that are used for maternal and child health activities as described in subdivision 7.\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n[Repealed, 1Sp2003 c 14 art 8 s 32]\nIf a community health board decides not to participate in maternal and child health block grant activities under subdivision 3 or the commissioner determines under section 145A.131, subdivision 7, not to fund the community health board, the commissioner is responsible for directing maternal and child health block grant activities in that community health board's geographic area. The commissioner may elect to directly provide public health activities to meet the statewide outcomes or to contract with other governmental units or nonprofit organizations.\n[Repealed, 1Sp2003 c 14 art 8 s 32]\nMaternal and child health block grant money allocated to a community health board under this section must be used for qualified programs for high risk and low-income individuals. Block grant money must be used for programs that:\n(1) specifically address the highest risk populations, particularly low-income and minority groups with a high rate of infant mortality and children with low birth weight, by providing services, including prepregnancy family planning services, calculated to produce measurable decreases in infant mortality rates, instances of children with low birth weight, and medical complications associated with pregnancy and childbirth, including infant mortality, low birth rates, and medical complications arising from chemical abuse by a mother during pregnancy;\n(2) specifically target pregnant women whose age, medical condition, maternal history, or chemical abuse substantially increases the likelihood of complications associated with pregnancy and childbirth or the birth of a child with an illness, disability, or special medical needs;\n(3) specifically address the health needs of young children who have or are likely to have a chronic disease or disability or special medical needs, including physical, neurological, emotional, and developmental problems that arise from chemical abuse by a mother during pregnancy;\n(4) provide family planning and preventive medical care for specifically identified target populations, such as minority and low-income teenagers, in a manner calculated to decrease the occurrence of inappropriate pregnancy and minimize the risk of complications associated with pregnancy and childbirth;\n(5) specifically address the frequency and severity of childhood and adolescent health issues, including injuries in high risk target populations by providing services calculated to produce measurable decreases in mortality and morbidity;\n(6) specifically address preventing child abuse and neglect, reducing juvenile delinquency, promoting positive parenting and resiliency in children, and promoting family health and economic sufficiency through public health nurse home visits under section 145A.17; or\n(7) specifically address nutritional issues of women, infants, and young children through WIC clinic services.\n[Repealed, 1Sp2003 c 14 art 8 s 32]",
	"repealed": false
}