{
	"id": "216C.374",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.374",
	"title": "216C.374 ELECTRIC SCHOOL BUS DEPLOYMENT PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Battery exchange station\" means a physical location deploying equipment that enables a used electric vehicle battery to be removed and exchanged for a fully charged electric vehicle battery.\n(c) \"Electric school bus\" means an electric vehicle: (1) designed to carry a driver and more than ten passengers; and (2) primarily used to transport preprimary, primary, and secondary students.\n(d) \"Electric utility\" means any utility that provides wholesale or retail electric service to customers in Minnesota.\n(e) \"Electric vehicle\" has the meaning given in section 169.011, subdivision 26a.\n(f) \"Electric vehicle charging station\" means a physical location deploying equipment that provides electricity to charge a battery in an electric vehicle.\n(g) \"Electric vehicle infrastructure\" means electric vehicle charging stations and any associated electric panels, machinery, equipment, and infrastructure necessary for an electric utility to supply electricity to an electric vehicle charging station and to support electric vehicle operation.\n(h) \"Electric vehicle service provider\" means an organization that installs, maintains, or otherwise services a battery exchange station, electric vehicle infrastructure, or electric vehicle charging stations.\n(i) \"Eligible applicant\" means a school district or an electric utility, electric vehicle service provider, or transportation service provider applying for a grant under this section on behalf of a school district.\n(j) \"Federal vehicle electrification grants\" means grants that fund electric school buses or electric vehicle infrastructure under the federal Infrastructure Investment and Jobs Act, Public Law 117-58, or the Inflation Reduction Act of 2022, Public Law 117-169.\n(k) \"Poor air quality\" means:\n(1) ambient air levels that air monitoring data reveals approach or exceed state or federal air quality standards or chronic health inhalation risk benchmarks for total suspended particulates, particulate matter less than ten microns wide (PM-10), particulate matter less than 2.5 microns wide (PM-2.5), sulfur dioxide, or nitrogen dioxide; or\n(2) areas in which levels of asthma among children significantly exceed the statewide average.\n(l) \"Prioritized school district\" means:\n(1) a school district listed in the Small Area Income and Poverty Estimates School District Estimates as having 7.5 percent or more students living in poverty based on the most recent decennial U.S. census;\n(2) a school district identified with locale codes \"43-Rural: Remote\" and \"42-Rural: Distant\" by the National Center for Education Statistics;\n(3) a school district funded by the Bureau of Indian Affairs; or\n(4) a school district that receives basic support payments under United States Code, title 20, section 7703(b)(1), for children who reside on Indian land.\n(m) \"School\" means a school that operates as part of an independent or special school district.\n(n) \"School bus\" has the meaning given in section 169.011, subdivision 71.\n(o) \"School district\" means:\n(1) an independent school district, as defined in section 120A.05, subdivision 10; or\n(2) a special school district, as defined in section 120A.05, subdivision 14.\n(p) \"Transportation service provider\" means a person that has a contract with a school district to transport students to and from school.\nAn electric school bus deployment program is established in the department. The purpose of the program is to provide grants to accelerate the deployment of electric school buses by school districts and to encourage schools to use vehicle electrification as a teaching tool that can be integrated into the school's curriculum.\nAn electric school bus program account is established as a separate account in the special revenue fund in the state treasury. The commissioner shall credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money in the account at the end of a fiscal year does not cancel to the general fund but remains available in the account until June 30, 2027. The commissioner shall manage the account.\nMoney in the account is appropriated to the commissioner and must be used only:\n(1) for grant awards made under this section; and\n(2) to pay the reasonable costs incurred by the department to administer this section, including the cost of providing technical assistance to eligible applicants, including but not limited to grant writing assistance for applications for federal vehicle electrification grants under subdivision 6, paragraph (c).\nA grant awarded under this section may be used only to pay:\n(1) a school district or transportation service provider to purchase one or more electric school buses, or convert or repower fossil-fuel-powered school buses to be powered by electricity;\n(2) up to 75 percent of the cost a school district or transportation service provider incurs to purchase one or more electric school buses, or to convert or repower fossil-fuel-powered school buses to be powered by electricity;\n(3) for prioritized school districts, up to 95 percent of the cost a school district or transportation service provider incurs to purchase one or more electric school buses, or to convert or repower fossil-fuel-powered school buses to be powered by electricity;\n(4) up to 75 percent of the cost of deploying, on the school district or transportation service provider's real property, infrastructure required to operate electric school buses, including but not limited to battery exchange stations, electric vehicle infrastructure, or electric vehicle charging stations;\n(5) for prioritized school districts, up to 95 percent of the cost of deploying, on the school district or transportation service provider's real property, infrastructure required to operate electric school buses, including but not limited to battery exchange stations, electric vehicle infrastructure, or electric vehicle charging stations; and\n(6) the reasonable costs of technical assistance related to electric school bus deployment program planning and to prepare grant applications for federal vehicle electrification grants.\n(a) The commissioner must develop administrative procedures governing the application and grant award process.\n(b) The commissioner must issue a request for proposals to eligible applicants who may wish to apply for a grant under this section on behalf of a school.\n(c) An eligible applicant must submit an application for an electric school bus deployment grant to the commissioner on a form prescribed by the commissioner. The form must require an applicant to supply, at a minimum, the following information:\n(1) the number of and a description of the electric school buses the school district or transportation service provider intends to purchase;\n(2) the total cost to purchase the electric school buses and the incremental cost, if any, of the electric school buses when compared with fossil-fuel-powered school buses;\n(3) a copy of the proposed contract agreement between the school district, the electric utility, the electric vehicle service provider, or the transportation service provider that includes provisions addressing responsibility for maintenance of the electric school buses and related electric vehicle infrastructure and battery exchange stations;\n(4) whether the school district is a prioritized school district;\n(5) areas of the school district that serve significant numbers of students eligible for free and reduced-price school meals, and areas that disproportionately experience poor air quality, as measured by indicators such as the Minnesota Pollution Control Agency's air quality monitoring network, the Minnesota Department of Health's air quality and health monitoring, or other relevant indicators;\n(6) the school district's plan to prioritize the deployment of electric school buses in areas of the school district that:\n(i) serve students eligible for free and reduced-price school meals;\n(ii) experience disproportionately poor air quality; or\n(iii) are located within environmental justice areas, as defined in section 216B.1691, subdivision 1, paragraph (e);\n(7) the school district's plan, if any, to make the electric school buses serve as a visible learning tool for students, teachers, and visitors to the school, including how vehicle electrification may be integrated into the school district's curriculum;\n(8) information that demonstrates the school district's level of need for financial assistance available under this section;\n(9) any federal vehicle electrification grants awarded to or applied for by the eligible applicant for the same electric school buses or electric vehicle infrastructure proposed by the eligible applicant in a grant application made under this section;\n(10) information that demonstrates the school district's readiness to implement the project and to operate the electric school buses for no less than five years;\n(11) whether the electric utility or electric vehicle service provider will deploy electric vehicle infrastructure on the school district's or transportation service provider's property, and if so, the willingness and ability of the electric vehicle service provider or the electric utility to:\n(i) pay employees and contractors a prevailing wage rate, as defined in section 177.42, subdivision 6; and\n(ii) comply with section 177.43; and\n(12) any other information deemed relevant by the commissioner.\n(d) An eligible applicant may seek a technical assistance grant under this section to assist the eligible applicant apply for federal vehicle electrification grants. An eligible applicant seeking a technical assistance grant under this section must submit an application to the commissioner on behalf of a school district on a form prescribed by the commissioner. The form must include, at a minimum, the following information:\n(1) the names of the federal programs to which the applicant intends to apply;\n(2) a description of the technical assistance the applicants need in order to complete the federal application; and\n(3) any other information deemed relevant by the commissioner.\n(e) The commissioner must administer an open application process under this section at least twice annually.\nThe department must provide technical assistance to school districts to develop and execute projects applied for or funded by grants awarded under this section.\n(a) In awarding grants under this section, the commissioner must give priority to applications from or on behalf of prioritized school districts, and must endeavor to award no less than 40 percent of the total amount of grants awarded under this section to prioritized school districts.\n(b) In making grant awards under this section, the amount of the grant must be based on the commissioner's assessment of the school district's need for financial assistance.\n(c) A grant awarded under this section, when combined with any federal vehicle electrification grants obtained by an eligible applicant for the same electric school buses or electric vehicle infrastructure as proposed by the eligible applicant in a grant application made under this section, must not exceed the total cost of the electric school buses or electric vehicle infrastructure funded by the grant.\nNo application may be submitted under this section after December 31, 2026.\nBeginning January 15, 2024, and each year thereafter until January 15, 2028, the commissioner must report to the chairs and ranking minority members of the legislative committees with jurisdiction over energy regarding:\n(1) grants and amounts awarded to school districts under this section during the previous year; and\n(2) any remaining balance available in the electric school bus program account.\n(a) A prudent and reasonable investment on electric vehicle infrastructure installed on a school district's real property that is made by a public utility may be placed in the public utility's rate base and earn a rate of return determined by the commission.\n(b) Notwithstanding any other provision of this chapter, the commission may approve a tariff mechanism to automatically adjust annual charges for prudent and reasonable investments made by a public utility on electric vehicle infrastructure installed on a school district's real property.",
	"repealed": false
}