{
	"id": "16E.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.21",
	"title": "16E.21 INFORMATION AND TELECOMMUNICATIONS ACCOUNT.",
	"text": "The information and telecommunications technology systems and services account is created in the special revenue fund. Receipts credited to the account are appropriated to the Department of Information Technology Services for the purpose of defraying the costs of personnel and technology for activities that create government efficiencies, secure state systems, or address project or product backlogs in accordance with this chapter.\n(a) Upon agreement of the participating agency, the Department of Information Technology Services may collect a charge or receive a fund transfer under section 16E.0466 for purchases of information and telecommunications technology systems and services by state agencies and other governmental entities through state contracts for purposes described in subdivision 1. Charges collected under this section must be credited to the information and telecommunications technology systems and services account.\n(b) Notwithstanding section 16A.28, subdivision 3, any unexpended operating balance appropriated to a state agency may be transferred to the information and telecommunications technology systems and services account for the information technology cost of a specific project, product, or services, subject to the review of the Legislative Advisory Commission under subdivision 3.\n(a) No funds may be transferred to the information and telecommunications technology systems and services account under subdivision 2 or section 16E.0466 until the commissioner of management and budget has submitted the proposed transfer to the members of the Legislative Advisory Commission for review and recommendation. If the commission makes a positive recommendation or no recommendation, or if the commission has not reviewed the request within 20 days after the date the request to transfer funds was submitted, the commissioner of management and budget may approve the request to transfer the funds. If the commission recommends further review of a request to transfer funds, the commissioner shall provide additional information to the commission. If the commission makes a negative recommendation on the request within ten days of receiving further information, the commissioner shall not approve the fund transfer. If the commission makes a positive recommendation or no recommendation within ten days of receiving further information, the commissioner may approve the fund transfer.\n(b) A recommendation of the commission must be made at a meeting of the commission unless a written recommendation is signed by all members entitled to vote on the item as specified in section 3.30, subdivision 2. A recommendation of the commission must be made by a majority of the commission.\nAny portion of any receipt credited to the information and telecommunications technology systems and services account from a fund transfer under subdivision 2 that remains unexpended and unencumbered at the close of the fiscal year four years after the funds were received in the account shall lapse to the fund from which the receipt was transferred.\nThe chief information officer shall report by September 15 of each odd-numbered year to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over the Department of Information Technology Services regarding the receipts credited to the account. The report must include a description of projects funded through the information and telecommunications technology systems and services account and each project's current status.",
	"repealed": false
}