{
	"id": "116J.8764",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8764",
	"title": "116J.8764 ENROLLMENT OF LOANS IN PROGRAM.",
	"text": "(a) To enroll a loan under this program, the lender must file a completed loan enrollment form with the commissioner. The lender must also certify the following to the commissioner as part of the filing:\n(1) the lender has no substantial reason to believe that the loan is being made to a borrower who does not meet the requirements of section 116J.876, subdivision 3;\n(2) that the lender has received from the borrower a written representation, warranty, pledge, and waiver stating that the borrower has no legal, beneficial, or equitable interest in the nonrefundable premium charges or any other funds credited to the reserve fund established to cover losses sustained by the lender on enrolled loans;\n(3) the loan being filed for enrollment is an eligible loan under section 116J.8763; and\n(4) premium changes required of the borrower and lender under this section have been deposited in the reserve fund.\n(b) The lender shall file the loan enrollment form within ten business days after the lender makes the loan. The date on which the lender makes a loan is the date on which the lender first disburses proceeds of the loan to the borrower or an earlier date on which the loan documents have been executed and the lender has obligated itself to disburse proceeds of the loan. The filing date of a loan enrollment form is the date on which the lender delivers the required documentation to the commissioner, delivers it to a professional courier service for delivery to the commissioner, or mails it to the commissioner by certified mail.\nWhen the commissioner receives the loan enrollment form, the commissioner shall enroll the loan, unless the information provided under subdivision 1 indicates that the loan is not an eligible loan, and shall deliver to the lender within five business days of receipt an acknowledgment of enrollment, signed by the commissioner or designee, including documentation of the amount being transferred by the commissioner into the reserve fund under this section.\nThe commissioner may continue to accept loans for enrollment into the program even if the amount of funds contained in the account is zero or an amount less than the full amount that is required to be transferred under section 116J.8765, subdivision 2, paragraph (a), (b), or (c).\nWhen filing a loan enrollment form, the lender may specify an amount to be covered under the program. The amount may be less than the total amount of the loan. Unless the context clearly requires otherwise, when used in connection with a loan or loans, the words \"amount\" and \"proceeds\" refer only to the amount covered under the agreement.\n(a) In the case of a loan to refinance a loan previously made to the borrower by the lender that was not enrolled under the program, the lender may obtain coverage under the program for an amount not exceeding the amount of additional financing.\n(b) If an enrolled loan is refinanced and the total amount to be covered under the program does not exceed the covered amount of the loan as previously enrolled, the refinanced loan may continue as an enrolled loan without payment of additional premium charges or transfers by the commissioner to the reserve fund.\n(c) If an enrolled loan is refinanced in an amount exceeding the amount of the loan as previously enrolled, the lender may obtain coverage of the amount of the refinanced loan that exceeds the amount covered when the loan was previously enrolled by refiling the loan for enrollment under subdivision 1.\n(d) Fluctuations in the outstanding balance of a line of credit, without increasing the enrolled amount under the program, are not a refinancing of the loan.\nIf the outstanding balance of an enrolled loan which is not a line of credit is reduced to zero, the loan is no longer an enrolled loan. If an enrolled loan which is a line of credit has an outstanding balance of zero for a 12-month period, the line of credit is no longer an enrolled loan, unless, before the expiration of the 12-month period, the lender reaffirms in writing to the borrower that the line of credit will remain open and the borrower acknowledges the reaffirmation in writing.",
	"repealed": false
}