{
	"id": "245I.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.05",
	"title": "245I.05 TRAINING REQUIRED.",
	"text": "A license holder must develop a training plan to ensure that staff persons receive ongoing training according to this section. The training plan must include:\n(1) a formal process to evaluate the training needs of each staff person. An annual performance evaluation of a staff person satisfies this requirement;\n(2) a description of how the license holder conducts ongoing training of each staff person, including whether ongoing training is based on a staff person's hire date or a specified annual cycle determined by the program;\n(3) a description of how the license holder verifies and documents each staff person's previous training experience. A license holder may consider a staff person to have met a training requirement in subdivision 3, paragraph (d) or (e), if the staff person has received equivalent postsecondary education in the previous four years or training experience in the previous two years; and\n(4) a description of how the license holder determines when a staff person needs additional training, including when the license holder will provide additional training.\n(a) The license holder must provide training to each staff person according to the training plan and must document that the license holder provided the training to each staff person. The license holder must document the following information for each staff person's training:\n(1) the topics of the training;\n(2) the name of the trainee;\n(3) the name and credentials of the trainer;\n(4) the license holder's method of evaluating the trainee's competency upon completion of training;\n(5) the date of the training; and\n(6) the length of training in hours and minutes.\n(b) Documentation of a staff person's continuing education credit accepted by the governing health-related licensing board is sufficient to document training for purposes of this subdivision.\n(a) A staff person must receive training about:\n(1) vulnerable adult maltreatment under section 245A.65, subdivision 3; and\n(2) the maltreatment of minor reporting requirements and definitions in chapter 260E within 72 hours of first providing direct contact services to a client.\n(b) Before providing direct contact services to a client, a staff person must receive training about:\n(1) client rights and protections under section 245I.12;\n(2) the Minnesota Health Records Act, including client confidentiality, family engagement under section 144.294, and client privacy;\n(3) emergency procedures that the staff person must follow when responding to a fire, inclement weather, a report of a missing person, and a behavioral or medical emergency;\n(4) specific activities and job functions for which the staff person is responsible, including the license holder's program policies and procedures applicable to the staff person's position;\n(5) professional boundaries that the staff person must maintain; and\n(6) specific needs of each client to whom the staff person will be providing direct contact services, including each client's developmental status, cognitive functioning, and physical and mental abilities.\n(c) Before providing direct contact services to a client, a mental health rehabilitation worker, mental health behavioral aide, or mental health practitioner required to receive the training according to section 245I.04, subdivision 4, must receive 30 hours of training about:\n(1) mental illnesses;\n(2) client recovery and resiliency;\n(3) mental health de-escalation techniques;\n(4) co-occurring mental illness and substance use disorders; and\n(5) psychotropic medications and medication side effects.\n(d) Within 90 days of first providing direct contact services to an adult client, mental health practitioner, mental health certified peer specialist, or mental health rehabilitation worker must receive training about:\n(1) trauma-informed care and secondary trauma;\n(2) person-centered individual treatment plans, including seeking partnerships with family and other natural supports;\n(3) co-occurring substance use disorders; and\n(4) culturally responsive treatment practices.\n(e) Within 90 days of first providing direct contact services to a child client, mental health practitioner, mental health certified family peer specialist, mental health certified peer specialist, or mental health behavioral aide must receive training about the topics in clauses (1) to (5). This training must address the developmental characteristics of each child served by the license holder and address the needs of each child in the context of the child's family, support system, and culture. Training topics must include:\n(1) trauma-informed care and secondary trauma, including adverse childhood experiences (ACEs);\n(2) family-centered treatment plan development, including seeking partnership with a child client's family and other natural supports;\n(3) mental illness and co-occurring substance use disorders in family systems;\n(4) culturally responsive treatment practices; and\n(5) child development, including cognitive functioning, and physical and mental abilities.\n(f) For a mental health behavioral aide, the training under paragraph (e) must include parent team training using a curriculum approved by the commissioner.\n(a) A license holder must ensure that staff persons who provide direct contact services to clients receive annual training about the topics in subdivision 3, paragraphs (a) and (b), clauses (1) to (3).\n(b) A license holder must ensure that each staff person who is qualified under section 245I.04 who is not a mental health professional receives 30 hours of training every two years. The training topics must be based on the program's needs and the staff person's areas of competency.\n(a) Prior to administering medications to a client under delegated authority or observing a client self-administer medications, a staff person who is not a licensed prescriber, registered nurse, or licensed practical nurse qualified under section 148.171, subdivision 8, must receive training about psychotropic medications, side effects, and medication management.\n(b) Prior to administering medications to a client under delegated authority, a staff person must successfully complete a:\n(1) medication administration training program for unlicensed personnel through an accredited Minnesota postsecondary educational institution with completion of the course documented in writing and placed in the staff person's personnel file; or\n(2) formalized training program taught by a registered nurse or licensed prescriber that is offered by the license holder. A staff person's successful completion of the formalized training program must include direct observation of the staff person to determine the staff person's areas of competency.",
	"repealed": false
}