{
	"id": "35.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.95",
	"title": "35.95 CIVIL PENALTIES.",
	"text": "Except as provided in subdivisions 2 and 5, a person who violates this chapter or a special order, standard, stipulation, agreement, or schedule of compliance of the board is subject to a civil penalty of up to $10,000 as determined by the board.\n(a) A person who violates this chapter is liable for and must pay to the state a sum to constitute just compensation for the loss or destruction of wild animals, fish, or other aquatic life and for actual damages to the state.\n(b) The amounts paid as compensation for loss or destruction of wildlife, fish, or other aquatic life must be deposited into the state treasury and credited to the game and fish fund.\nAs a defense to a civil penalty or claim for damages under subdivisions 1 and 2, the defendant may prove that the violation was caused solely by an act of God, an act of war, an act or failure to act that constitutes sabotage or vandalism, or a combination of these defenses.\nIn an action to compel performance of an order of the Board of Animal Health to enforce this chapter, the court may require a defendant adjudged responsible to perform the acts within the person's power that are reasonably necessary to accomplish the purposes of the order.\nThe civil penalties and payments provided for in this section may be recovered by a civil action brought by the county attorney, the board, or the attorney general in the name of the state.\nIn an action brought by the attorney general or a county attorney in the name of the state under this chapter for civil penalties or injunctive relief or in an action to compel compliance, if the state finally prevails, the state, in addition to other penalties provided in this chapter, must be allowed an amount determined by the court to be the reasonable value of all or a part of the litigation expenses including attorney fees incurred by the state or county attorney. In determining the amount of these litigation expenses to be allowed, the court shall give consideration to the economic circumstances of the defendant.",
	"repealed": false
}