{
	"id": "168.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.31",
	"title": "168.31 REGISTRATION TAX PAYMENT.",
	"text": "The tax required under this chapter to be paid upon a motor vehicle for each calendar year becomes due when the vehicle first uses the public streets or highways in the state, and upon January 1 each year thereafter, except those vehicles which are taxed under section 168.017 and vehicles registered under 168.09, subdivision 3. Taxes due upon January 1 become payable upon November 15 preceding the calendar year for which they are assessed. The tax required to register vehicles for the registration year March 1 to the last day of February is due on March 1 and payable January 1 preceding. The tax required to register vehicles under the provisions of section 168.017 is due the first day of the month commencing the 12-month registration period and payable during the 45 days preceding the due date. Nothing in this section shall preclude prepayment.\nMS 1971 [Repealed, 1973 c 6 s 7]\nMS 1982 [Repealed, 1984 c 549 s 34]\n(a) If the tax for a vehicle assessed under section 168.013, subdivision 1c, 1d, 1e, or 1g, amounts to more than $400, the owner may pay the tax by installments.\n(b) The owner shall tender with the application for registration one-third of the annual tax due or $400, whichever is greater, plus any penalties or arrears, plus a fee of $10. Instead of this fee, the applicant may furnish a bond, bank letter of credit, or certificate of deposit approved by the registrar of motor vehicles, for the total of the tax still due. The amount of the bond, letter of credit, or certificate of deposit may include any penalties assessed. The bond, letter of credit, or certificate of deposit must be for the benefit of the state for monetary loss caused by failure of the vehicle owner to pay delinquent license fees and penalties.\n(c) The remainder of the tax due must be paid in two equal installments. The due date of the first installment is July 1, and the second installment is due November 1.\n(d) When the applicant elects to pay the administrative fee, the registrar shall issue to the applicant validation stickers indicating the expiration date of a registration. When the applicant elects to furnish a bond, bank letter, or letter of deposit, the registrar shall issue regular validation stickers for the registration year.\n(e) If an owner of a vehicle fails to pay an installment on or before its due date, the vehicle must not be used on the public streets or highways in this state until the installment or installments of the tax remaining due on the vehicle have been paid in full for the licensed year together with a penalty at the rate of $1 per day for the remainder of the month in which the balance of the tax becomes due and $4 a month for each succeeding month or fraction of a month during which the balance of the tax remains unpaid. Upon the payment of the balance of the tax and the penalties, the registrar shall issue a registration certificate to the owner of the vehicle in the manner provided by law. The registrar shall deny installment payment privileges provided in this subdivision in the subsequent year to any owner on any or all vehicles of the owner who during the current year fails to pay any installment due within one month after the due date.\nIf the tax for a vehicle assessed under section 168.187 amounts to more than $400, the owner may pay the tax by installments. The owner shall submit with the application for registration, no later than January 1, one-third of the Minnesota annual tax due or $400, whichever is greater. The applicant shall furnish a bond, bank letter of credit, or certificate of deposit approved by the registrar of motor vehicles, for the total of the tax still due. The amount of the bond, letter of credit, or certificate of deposit may include any penalties assessed. The bond, letter of credit, or certificate of deposit must be for the benefit of the state for monetary loss caused by failure of the vehicle owner to pay delinquent license fees and penalties. The remainder of the tax due must be paid in two equal installments; the due date of the first installment is May 1 and the second installment is due on September 1. If an owner of a vehicle fails to pay an installment on or before the due date, the vehicle must not be used on the public streets or highways in this state until the installment or installments of the tax remaining due on the vehicle has been paid in full for the licensed year, together with a penalty at the rate of $1 per day for the remainder of the month in which the balance of the tax becomes due and $4 a month for each succeeding month or fraction of it during which the balance of the tax remains unpaid. The registrar shall deny installment payment privileges provided in this subdivision in the subsequent year to any owner on any or all vehicles of an owner who during the current year fails to pay any installment and penalties due within one month after the due date.\nFor the registration tax paid on any vehicle before the registration period for which that tax was assessed, the owner of the vehicle who paid the tax is entitled to full refund if the registration stickers are surrendered before the first day of the new registration period.\nAll taxes imposed under the provisions of this chapter shall be deemed the personal obligation of the registered owner and the amount of such tax, including added penalties for the nonpayment thereof, shall be a first lien upon the vehicle taxed, paramount and superior to all other liens thereon whether previously or subsequently accruing thereon; and, in addition to any other remedy herein prescribed, the state shall have a right of action against the owner for the recovery of the amount of any delinquent tax thereon, including the penalties accruing because of the nonpayment thereof, or for the enforcement of the tax lien thereon hereby declared, or both, in any court of competent jurisdiction. The county attorney of the county in which such motor vehicle is owned shall perform such service in the matter of the commencement and prosecution of such suit or in the prosecution of any other remedy for the enforcement of such tax as the attorney general may require.",
	"repealed": false
}