{
	"id": "79A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.26",
	"title": "79A.26 COMMERCIAL SELF-INSURANCE GROUP SECURITY FUND.",
	"text": "The commercial self-insurance group security fund is established as a nonprofit corporation pursuant to the Minnesota Nonprofit Corporation Act, sections 317A.001 to 317A.909. If any provision of the Minnesota Nonprofit Corporation Act conflicts with any provision of this chapter, the provisions of this chapter apply. Each commercial self-insurance group that elects to be subject to the terms of sections 79A.19 to 79A.32 rather than sections 79A.01 to 79A.18 shall participate in the commercial self-insurance group security fund. This participation shall be a condition of maintaining its certificate to self-insure.\nThe commercial security fund shall be governed by a board consisting of a minimum of three and maximum of five trustees. The trustees shall be representatives of commercial self-insurance groups who shall be elected by the participants of the commercial security fund, each group having one vote. The trustees initially elected by the participants shall serve staggered terms of either two or three years. Thereafter, trustees shall be elected to three-year terms and shall serve until their successors are elected and assume office pursuant to the bylaws of the commercial security fund. Two additional trustees shall be appointed by the commissioner. Initially, one of these trustees shall serve a two-year term. Thereafter, the trustees shall be appointed to four-year terms, and shall serve until their successors are appointed and assume office according to the bylaws of the commercial security fund. In addition to the trustees elected by the participants or appointed by the commissioner, the commissioner of labor and industry or the commissioner's designee shall be an ex officio, nonvoting member of the board of trustees. A member of the board of trustees may designate another person to act in the member's place as though the member were acting and the designee's actions shall be deemed those of the member.\nThe commercial security fund shall establish bylaws and a plan of operation, subject to the prior approval of the commissioner, necessary to the purposes of this chapter and to carry out the responsibilities of the commercial security fund. The commercial security fund may carry out its responsibilities directly or by contract, and may purchase services and insurance and borrow funds it deems necessary for the protection of the commercial self-insurance group participants and their employees.\nThe commercial security fund may receive private data concerning the financial condition of commercial self-insurance groups whose liabilities to pay compensation have become its responsibility and shall adopt bylaws to prevent dissemination of that information.\nCommercial security fund employees are not state employees and are not subject to any state civil service regulations.\nUpon order of the commissioner under section 79A.25, subdivision 3, the commercial security fund shall assume the workers' compensation obligations of an insolvent commercial self-insurance group. The commissioner shall further order the commercial self-insurance group security fund to commence payment of these obligations within 14 days of the receipt of this notification and order.\nNotwithstanding subdivision 6, the commercial security fund shall not be liable for the payment of any penalties assessed for any act or omission on the part of any person other than the commercial security fund or its appointed administrator, including, but not limited to, the penalties provided in chapter 176 unless the commercial security fund or its appointed administrator would be subject to penalties under chapter 176 as the result of the actions of the commercial security fund or its administrator.\nThe commercial security fund shall be a party in interest in all proceedings involving compensation claims against an insolvent commercial self-insurance group whose compensation obligations have been paid or assumed by the commercial security fund. The commercial security fund shall have the same rights and defenses as the insolvent commercial self-insurance group, including, but not limited to, all of the following:\n(1) to appear, defend, and appeal claims;\n(2) to receive notice of, investigate, adjust, compromise, settle, and pay claims; and\n(3) to investigate, handle, and deny claims.\nNotwithstanding sections 79A.19 to 79A.32 or chapter 176 to the contrary, in the event that the commercial self-insurance group security fund assumes the obligations of any bankrupt or insolvent commercial self-insurance group pursuant to this section, then the proceeds of any surety bond, Workers' Compensation Reinsurance Association, specific excess insurance or aggregate excess insurance policy, and any special compensation fund payment or supplementary benefit reimbursements shall be paid to the commercial self-insurance group security fund instead of the bankrupt or insolvent commercial self-insurance group or its successor in interest. No special compensation fund reimbursements shall be made to the commercial security fund unless the special compensation fund assessments under section 176.129 are paid and the required reports are made to the special compensation fund.\nThe commercial security fund shall have the right and obligation to obtain reimbursement from an insolvent commercial self-insurance group up to the amount of the commercial self-insurance group's workers' compensation obligations paid and assumed by the commercial security fund, including reasonable administrative and legal costs. This right includes, but is not limited to, a right to claim for wages and other necessities of life advanced to claimants as subrogee of the claimants in any action to collect against the commercial self-insurance group as debtor.\nThe commercial security fund shall have the right and obligation to obtain from the security deposit of an insolvent commercial self-insurance group the amount of the commercial self-insurance group's compensation obligations, including reasonable administrative and legal costs, paid or assumed by the commercial security fund. Reimbursement of administrative costs, including legal costs, shall be subject to approval by a majority of the commercial security fund's voting trustees. The commercial security fund shall be a party in interest in any action to obtain the security deposit for the payment of compensation obligations of an insolvent commercial self-insurance group.\nThe commercial security fund shall have the right to bring an action against any person or entity to recover compensation paid and liability assumed by the commercial security fund, including, but not limited to, any excess insurance carrier of the insolvent commercial self-insurance group and any person or entity whose negligence or breach of an obligation contributed to any underestimation of the commercial self-insurance group's accrued liability as reported to the commissioner.\nThe commercial security fund may be a party in interest in any action brought by any other person seeking damages resulting from the failure of an insolvent commercial self-insurance group to pay workers' compensation required under this subdivision.\nThe commercial security fund shall maintain cash, readily marketable securities, or other assets, or a line of credit, approved by the commissioner, sufficient to immediately continue the payment of the compensation obligations of an insolvent commercial self-insurance group pending receipt of the security deposit, surety bond proceeds, irrevocable letter of credit, or, if necessary, assessment of the participants. The commissioner may establish the minimum amount to be maintained by, or immediately available to, the commercial security fund for this purpose.\nThe commercial security fund may assess each of its participants a pro rata share of the funding necessary to carry out its obligation and the purposes of sections 79A.19 to 79A.32. Total annual assessments in any calendar year shall be a percentage of the workers' compensation benefits paid under sections 176.101 and 176.111 during the previous calendar year. The annual assessment calculation shall not include supplementary benefits paid which will be reimbursed by the special compensation fund. Funds obtained by assessments under this subdivision may only be used for the purposes of sections 79A.19 to 79A.32. The trustees shall certify to the commissioner the collection and receipt of all money from assessments, noting any delinquencies. The trustees shall take any action deemed appropriate to collect any delinquent assessments.\nThe trustees shall annually contract for an independent certified audit of the financial activities of the fund. An annual report on the financial status of the commercial self-insurance group security fund shall be submitted to the commissioner and to each commercial group participant.",
	"repealed": false
}