{
	"id": "148B.5301",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.5301",
	"title": "148B.5301 LICENSED PROFESSIONAL CLINICAL COUNSELOR.",
	"text": "(a) To be licensed as a licensed professional clinical counselor (LPCC), an applicant must provide satisfactory evidence to the board that the applicant:\n(1) is at least 18 years of age;\n(2) is of good moral character;\n(3) has completed a master's or doctoral degree program in counseling or a related field, as determined by the board based on the criteria in items (i) to (x), that includes a minimum of 48 semester hours or 72 quarter hours and a supervised field experience in counseling that is not fewer than 700 hours. The degree must be from a counseling program recognized by the Council for Accreditation of Counseling and Related Education Programs (CACREP) or from an institution of higher education that is accredited by a regional accrediting organization recognized by the Council for Higher Education Accreditation (CHEA). Specific academic course content and training must include coursework in each of the following subject areas:\n(i) helping relationship, including counseling theory and practice;\n(ii) human growth and development;\n(iii) lifestyle and career development;\n(iv) group dynamics, processes, counseling, and consulting;\n(v) assessment and appraisal;\n(vi) social and cultural foundations, including multicultural issues;\n(vii) principles of etiology, treatment planning, and prevention of mental and emotional disorders and dysfunctional behavior;\n(viii) family counseling and therapy;\n(ix) research and evaluation; and\n(x) professional counseling orientation and ethics;\n(4) has demonstrated competence in professional counseling by passing the National Clinical Mental Health Counseling Examination (NCMHCE), administered by the National Board for Certified Counselors, Inc. (NBCC) and ethical, oral, and situational examinations as prescribed by the board;\n(5) has earned graduate-level semester credits or quarter-credit equivalents in the following clinical content areas:\n(i) six credits in diagnostic assessment for child or adult mental disorders; normative development; and psychopathology, including developmental psychopathology;\n(ii) three credits in clinical treatment planning, with measurable goals;\n(iii) six credits in clinical intervention methods informed by research evidence and community standards of practice;\n(iv) three credits in evaluation methodologies regarding the effectiveness of interventions;\n(v) three credits in professional ethics applied to clinical practice; and\n(vi) three credits in cultural diversity; and\n(6) has demonstrated successful completion of 4,000 hours of supervised, post-master's degree professional practice in the delivery of clinical services in the diagnosis and treatment of child and adult mental illnesses and disorders, conducted according to subdivision 2.\n(b) If coursework in paragraph (a) was not completed as part of the degree program required by paragraph (a), clause (3), the coursework must be taken and passed for credit, and must be earned from a counseling program or institution that meets the requirements of paragraph (a), clause (3).\n(a) To qualify as a LPCC, an applicant must have completed 4,000 hours of post-master's degree supervised professional practice in the delivery of clinical services in the diagnosis and treatment of mental illnesses and disorders in both children and adults. The supervised practice shall be conducted according to the requirements in paragraphs (b) to (e).\n(b) The supervision must have been received under a contract that defines clinical practice and supervision from a mental health professional who is qualified according to section 245I.04, subdivision 2, or by a board-approved supervisor, who has at least two years of postlicensure experience in the delivery of clinical services in the diagnosis and treatment of mental illnesses and disorders. All supervisors must meet the supervisor requirements in Minnesota Rules, part 2150.5010.\n(c) The supervision must be obtained at the rate of two hours of supervision per 40 hours of professional practice. The supervision must be evenly distributed over the course of the supervised professional practice. At least 75 percent of the required supervision hours must be received in person or through real-time, two-way interactive audio and visual communication, and the board must allow an applicant to satisfy this supervision requirement with all required hours of supervision received through real-time, two-way interactive audio and visual communication. The remaining 25 percent of the required hours may be received by telephone or by audio or audiovisual electronic device. At least 50 percent of the required hours of supervision must be received on an individual basis. The remaining 50 percent may be received in a group setting.\n(d) The supervised practice must include at least 1,800 hours of clinical client contact.\n(e) The supervised practice must be clinical practice. Supervision includes the observation by the supervisor of the successful application of professional counseling knowledge, skills, and values in the differential diagnosis and treatment of psychosocial function, disability, or impairment, including addictions and emotional, mental, and behavioral disorders.\nMS 2010 [Expired, 2007 c 123 s 40 para (c)]\nMS 2012 [Expired, 2012 c 197 art 3 s 2]\n(a) After August 1, 2014, an individual currently licensed in the state of Minnesota as a licensed professional counselor may convert to a LPCC by providing evidence satisfactory to the board that the applicant has met the following requirements:\n(1) is at least 18 years of age;\n(2) is of good moral character;\n(3) has a license that is active and in good standing;\n(4) has no complaints pending, uncompleted disciplinary order, or corrective action agreements;\n(5) has completed a master's or doctoral degree program in counseling or a related field, as determined by the board, and whose degree was from a counseling program recognized by CACREP or from an institution of higher education that is accredited by a regional accrediting organization recognized by CHEA;\n(6) has earned 24 graduate-level semester credits or quarter-credit equivalents in clinical coursework which includes content in the following clinical areas:\n(i) diagnostic assessment for child or adult mental disorders; normative development; and psychopathology, including developmental psychopathology;\n(ii) clinical treatment planning with measurable goals;\n(iii) clinical intervention methods informed by research evidence and community standards of practice;\n(iv) evaluation methodologies regarding the effectiveness of interventions;\n(v) professional ethics applied to clinical practice; and\n(vi) cultural diversity;\n(7) has demonstrated competence in professional counseling by passing the National Clinical Mental Health Counseling Examination (NCMHCE), administered by the National Board for Certified Counselors, Inc. (NBCC), and ethical, oral, and situational examinations as prescribed by the board;\n(8) has demonstrated, to the satisfaction of the board, successful completion of 4,000 hours of supervised, post-master's degree professional practice in the delivery of clinical services in the diagnosis and treatment of child and adult mental illnesses and disorders, which includes 1,800 direct client contact hours. A licensed professional counselor who has completed 2,000 hours of supervised post-master's degree clinical professional practice and who has independent practice status need only document 2,000 additional hours of supervised post-master's degree clinical professional practice, which includes 900 direct client contact hours; and\n(9) has paid the LPCC application and licensure fees required in section 148B.53, subdivision 3.\n(b) If the coursework in paragraph (a) was not completed as part of the degree program required by paragraph (a), clause (5), the coursework must be taken and passed for credit, and must be earned from a counseling program or institution that meets the requirements in paragraph (a), clause (5).\n(a) Applicants seeking licensure according to this subdivision must be:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license application, and has confirmation of an honorable or general discharge status.\n(b) A qualified applicant under paragraph (a) must provide evidence of:\n(1) a current valid license, certificate, or permit in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(c) A temporary license issued under this subdivision is effective for one year from the initial licensure date.\n(d) During the temporary license period, the individual shall complete the licensed professional clinical counselor application for licensure.\n(e) In order to remain licensed after the expiration of the temporary license, an individual must meet the requirements in subdivisions 1 and 2.\nThe scope of practice of a LPCC shall include all those services provided by mental health professionals as defined in sections 245.462, subdivision 18, and 245.4871, subdivision 27.\nLPCC's are subject to the board's statutes and rules to the same extent as licensed professional counselors.",
	"repealed": false
}