{
	"id": "147A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/147A.01",
	"title": "147A.01 DEFINITIONS.",
	"text": "For the purpose of this chapter, the terms defined in this section have the meanings given them.\nMS 2008 [Repealed by amendment, 2009 c 159 s 14]\n\"Administer\" means the delivery by a physician assistant of a legend drug to a patient by injection, inhalation, ingestion, or by any other immediate means.\nMS 2018 [Repealed, 2020 c 115 art 2 s 34]\nMS 2014 [Repealed, 2016 c 125 s 16]\n\"Board\" means the Board of Medical Practice or its designee.\n\"Collaborating physician\" means a Minnesota licensed physician who oversees the performance, practice, and activities of a physician assistant under a collaborative agreement as described in section 147A.02, paragraph (c).\n\"Controlled substances\" has the meaning given it in section 152.01, subdivision 4.\nMS 2008 [Repealed by amendment, 2009 c 159 s 14]\n\"Diagnostic order\" means a directive to perform a procedure or test, the purpose of which is to determine the cause and nature of a pathological condition or disease.\n\"Drug\" has the meaning given it in section 151.01, subdivision 5, including controlled substances as defined in section 152.01, subdivision 4.\nMS 2018 [Repealed, 2020 c 115 art 2 s 34]\n\"Inactive\" means a licensed physician assistant whose license has been placed on inactive status under section 147A.05.\nMS 2008 [Repealed by amendment, 2009 c 159 s 14]\n\"Legend drug\" has the meaning given it in section 151.01, subdivision 17.\n\"Licensed\" means meeting the qualifications in section 147A.02 and being issued a license by the board.\n\"Licensure\" means the process by which the board determines that an applicant has met the standards and qualifications in this chapter.\nMS 2008 [Repealed by amendment, 2009 c 159 s 14]\n\"Medical device\" means durable medical equipment and assistive or rehabilitative appliances, objects, or products that are required to implement the overall plan of care for the patient and that are restricted by federal law to use upon prescription by a licensed practitioner.\nMS 2018 [Repealed, 2020 c 115 art 2 s 34]\n\"Physician\" means a person currently licensed in good standing as a physician or osteopathic physician under chapter 147.\nMS 2018 [Repealed, 2020 c 115 art 2 s 34]\n\"Physician assistant\" or \"licensed physician assistant\" means a person licensed pursuant to this chapter who meets the qualifications in section 147A.02.\nMS 2008 [Repealed by amendment, 2009 c 159 s 14]\n\"Prescribe\" means to direct, order, or designate by means of a prescription the preparation, use of, or manner of using a drug or medical device.\n\"Prescription\" means a signed written order, an oral order reduced to writing, or an electronic order meeting current and prevailing standards given by a physician assistant for patients in the course of the physician assistant's practice and issued for an individual patient.\nMS 2008 [Repealed by amendment, 2009 c 159 s 14]\nMS 2020 [Repealed, 2022 c 58 s 171]\nMS 2018 [Repealed, 2020 c 115 art 2 s 34]\nMS 2018 [Repealed, 2020 c 115 art 2 s 34]\n\"Therapeutic order\" means a written or verbal order given to another for the purpose of treating or curing a patient in the course of a physician assistant's practice.\n\"Verbal order\" means an oral order given to another for the purpose of treating or curing a patient in the course of a physician assistant's practice.",
	"repealed": false
}