{
	"id": "6.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.56",
	"title": "6.56 COST OF EXAMINATION, PAYMENT.",
	"text": "[Repealed, 2008 c 200 s 22]\nUpon the examination of the books, records, accounts, and affairs of any political subdivision, as provided by law, such political subdivision shall be liable to the state for the total cost and expenses of such examination, including the salaries paid to the examiners while actually engaged in making such examination. The state auditor may bill such political subdivision periodically for service rendered and the officials responsible for approving and paying claims are authorized to pay said bill promptly. Said payments shall be without prejudice to any defense against said claims that may exist or be asserted. The general fund shall be credited with all collections made for any such examinations, including interest payments made pursuant to subdivision 3.\n(a) A political subdivision shall pay interest to the state auditor for undisputed billings when the political subdivision has not paid the billing within 60 days following receipt of the invoice. A negotiated contract or agreement between a political subdivision and the state auditor which requires an audit by the political subdivision before acceptance and payment of the state auditor's invoice shall not be considered past due until 60 days after the completion of the audit by the political subdivision. Before any interest payment is made, the state auditor must invoice the political subdivision for the interest.\n(b) The rate of interest paid by the political subdivision on undisputed bills not paid within 60 days shall be 1.5 percent per month or any part of a month.\n(c) No interest penalties may accrue against a political subdivision that delays payment of a bill due to a disagreement with the state auditor over the validity of the bill if the dispute is settled within 60 days after the bill became due. Upon the resolution of the dispute, the political subdivision must pay the state auditor accrued interest on all proper invoices for which payment was not received within 60 days following the receipt of the original invoice.\n(d) The minimum monthly interest penalty payment that a political subdivision shall pay the state auditor for the unpaid balance for any one overdue bill equal to or in excess of $100, is $10. For unpaid balances of less than $100, the political subdivision shall pay the actual penalty due to the state auditor.",
	"repealed": false
}