{
	"id": "624.7134",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7134",
	"title": "624.7134 PRIVATE PARTY TRANSFERS; BACKGROUND CHECK REQUIRED.",
	"text": "(a) As used in this section, the following terms have the meanings provided in this subdivision.\n(b) \"Firearms dealer\" means a person who is licensed by the United States Department of Justice, Bureau of Alcohol, Tobacco, Firearms and Explosives, under United States Code, title 18, section 923(a).\n(c) \"State or federally issued identification\" means a document or card made or issued by or under the authority of the United States government or the state that contains the person's name, residence address, date of birth, and photograph and is of a type commonly accepted for the purpose of identification of individuals.\n(d) \"Unlicensed person\" means a person who does not hold a license under United States Code, title 18, section 923(a).\nAn unlicensed person is prohibited from transferring a pistol or semiautomatic military-style assault weapon to any other unlicensed person, unless: (1) the transfer is made through a firearms dealer as provided for in subdivision 3; or (2) the transferee presents a valid transferee permit issued under section 624.7131 and a current state or federally issued identification.\n(a) Where both parties to a prospective transfer of a pistol or semiautomatic military-style assault weapon are unlicensed persons, the transferor and transferee may appear jointly before a federally licensed firearms dealer with the firearm and request that the federally licensed firearms dealer conduct a background check on the transferee and facilitate the transfer.\n(b) Except as otherwise provided in this section, a federally licensed firearms dealer who agrees to facilitate a transfer under this section shall:\n(1) process the transfer as though transferring the firearm from the dealer's inventory to the transferee; and\n(2) comply with all requirements of federal and state law that would apply if the firearms dealer were making the transfer, including at a minimum all background checks and record keeping requirements. The exception to the report of transfer process in section 624.7132, subdivision 12, clause (1), does not apply to transfers completed under this subdivision.\n(c) If the transferee is prohibited by federal law from purchasing or possessing the firearm or not entitled under state law to possess the firearm, neither the federally licensed firearms dealer nor the transferor shall transfer the firearm to the transferee.\n(d) Notwithstanding any other law to the contrary, this section shall not prevent the transferor from:\n(1) removing the firearm from the premises of the federally licensed firearms dealer, or the gun show or event where the federally licensed firearms dealer is conducting business, as applicable, while the background check is being conducted, provided that the transferor must return to the federally licensed firearms dealer with the transferee before the transfer takes place, and the federally licensed firearms dealer must take possession of the firearm in order to complete the transfer; and\n(2) removing the firearm from the business premises of the federally licensed firearms dealer if the results of the background check indicate the transferee is prohibited by federal law from purchasing or possessing the firearm or not entitled under state law to possess the firearm.\n(e) A transferee who consents to participate in a transfer under this subdivision is not entitled to have the transfer report returned as provided for in section 624.7132, subdivision 10.\n(f) A firearms dealer may charge a reasonable fee for conducting a background check and facilitating a transfer between the transferor and transferee pursuant to this section.\n(a) Unless a transfer is made through a firearms dealer as provided for in subdivision 3, when two unlicensed persons complete the transfer of a pistol or semiautomatic military-style assault weapon, the transferor and transferee must complete a record of transfer on a form designed and made publicly available without fee for this purpose by the superintendent of the Bureau of Criminal Apprehension. Each page of the record of transfer must be signed and dated by the transferor and the transferee and contain the serial number of the pistol or semiautomatic military-style assault weapon.\n(b) The record of transfer must contain the following information:\n(1) a clear copy of each person's current state or federally issued identification;\n(2) a clear copy of the transferee permit presented by the transferee; and\n(3) a signed statement by the transferee swearing that the transferee is not currently prohibited by state or federal law from possessing a firearm.\n(c) The record of transfer must also contain the following information regarding the transferred pistol or semiautomatic military-style assault weapon:\n(1) the type of pistol or semiautomatic military-style assault weapon;\n(2) the manufacturer, make, and model of the pistol or semiautomatic military-style assault weapon; and\n(3) the pistol or semiautomatic military-style assault weapon's manufacturer-assigned serial number.\n(d) Both the transferor and the transferee must retain a copy of the record of transfer and any attachments to the record of transfer for 10 years from the date of the transfer. A copy in digital form shall be acceptable for the purposes of this paragraph.\n(a) Unless a transfer was completed under subdivision 3, the transferor and transferee of a pistol or semiautomatic military-style assault weapon transferred under subdivision 4 must produce the record of transfer when a peace officer requests the record as part of a criminal investigation.\n(b) A person who refuses or is unable to produce a record of transfer for a firearm transferred under this section in response to a request for production made by a peace officer pursuant to paragraph (a) is guilty of a misdemeanor. A prosecution or conviction for violation of this subdivision is not a bar to conviction of, or punishment for, any other crime committed involving the transferred firearm.\nA person is immune to a charge of violating this section if the person presents a record of transfer that satisfies the requirements of subdivision 4.\n(a) This section shall not apply to the following transfers:\n(1) a transfer by or to a federally licensed firearms dealer;\n(2) a transfer by or to any law enforcement agency;\n(3) to the extent the transferee is acting within the course and scope of employment and official duties, a transfer to:\n(i) a peace officer, as defined in section 626.84, subdivision 1, paragraph (c);\n(ii) a member of the United States armed forces, the National Guard, or the Reserves of the United States armed forces;\n(iii) a federal law enforcement officer; or\n(iv) a security guard employed by a protective agent licensed pursuant to chapter 326;\n(4) a transfer between immediate family members, which for the purposes of this section means spouses, domestic partners, parents, children, siblings, grandparents, and grandchildren;\n(5) a transfer to an executor, administrator, trustee, or personal representative of an estate or a trust that occurs by operation of law upon the death of the former owner of the firearm;\n(6) a transfer of an antique firearm as defined in section 624.712, subdivision 3;\n(7) a transfer of a curio or relic, as defined in Code of Federal Regulations, title 27, section 478.11, if the transfer is between collectors of firearms as curios or relics as defined by United States Code, title 18, section 921(a)(13), who each have in their possession a valid collector of curio and relics license issued by the United States Department of Justice, Bureau of Alcohol, Tobacco, Firearms and Explosives;\n(8) the temporary transfer of a firearm if:\n(i) the transfer is necessary to prevent imminent death or great bodily harm; and\n(ii) the person's possession lasts only as long as immediately necessary to prevent such imminent death or great bodily harm;\n(9) transfers by or to an auctioneer who is in compliance with chapter 330 and acting in the person's official role as an auctioneer to facilitate or conduct an auction of the firearm; and\n(10) a temporary transfer if the transferee's possession of the firearm following the transfer is only:\n(i) at a shooting range that operates in compliance with the performance standards under chapter 87A or is a nonconforming use under section 87A.03, subdivision 2, or, if compliance is not required by the governing body of the jurisdiction, at an established shooting range operated consistently with local law in the jurisdiction;\n(ii) at a lawfully organized competition involving the use of a firearm, or while participating in or practicing for a performance by an organized group that uses firearms as part of the performance;\n(iii) while hunting or trapping if the hunting or trapping is legal in all places where the transferee possesses the firearm and the transferee holds all licenses or permits required for hunting or trapping;\n(iv) at a lawfully organized educational or instructional course and under the direct supervision of a certified instructor, as that term is defined in section 624.714, subdivision 2a, paragraph (d); or\n(v) while in the actual presence of the transferor.\n(b) A transfer under this subdivision is permitted only if the transferor has no reason to believe:\n(1) that the transferee is prohibited by federal law from buying or possessing firearms or not entitled under state law to possess firearms;\n(2) if the transferee is under 18 years of age and is receiving the firearm under direct supervision and control of an adult, that the adult is prohibited by federal law from buying or possessing firearms or not entitled under state law to possess firearms; or\n(3) that the transferee will use or intends to use the firearm in the commission of a crime.",
	"repealed": false
}