{
	"id": "13.7931",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.7931",
	"title": "13.7931 NATURAL RESOURCE DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside this chapter. Those sections classify natural resource data as other than public, place restrictions on access to government data, or involve data sharing.\nSpecific location data are classified under section 84.0872.\nExcept for electronic licensing system data classified under section 84.0874, data on individuals who are minors that are collected, created, received, maintained, or disseminated by the Department of Natural Resources are classified under section 84.0873.\nThe development and use of forest resource data are coordinated by the Interagency Information Cooperative established under section 89A.09.\nSocial Security numbers obtained on applications for individual noncommercial game and fish licenses are classified, and sharing of the data required by federal law is clarified, under section 97A.482, paragraph (b).\nInformation on production, harvest, and sales of aquatic life by a private fish hatchery is classified under section 97C.211, subdivision 6.\nData submitted in applying for a permit for mineral deposit evaluation and as a result of exploration are classified under sections 103I.601, subdivision 7, and 103I.605, subdivisions 2 and 4.\nMS 2008 [Renumbered 13.7932]\nData on individuals created, collected, stored, or maintained by the department for the purposes of obtaining a noncommercial game and fish license, cross-country ski pass, horse pass, or snowmobile trail sticker; registering a recreational motor vehicle; or any other electronic licensing transaction are classified under sections 84.0874 and 97A.408.\nInformation that the Department of Natural Resources collects, receives, or maintains through voluntary responses to questionnaires or surveys by forest industry businesses is classified under section 84.0871.",
	"repealed": false
}