{
	"id": "144.9504",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9504",
	"title": "144.9504 SECONDARY PREVENTION.",
	"text": "(a) A community health board serving cities of the first class must conduct lead risk assessments for purposes of secondary prevention, according to the provisions of this section. A board of health not serving cities of the first class must conduct lead risk assessments for the purposes of secondary prevention, unless they certified in writing to the commissioner by January 1, 1996, that they desired to relinquish these duties back to the commissioner. At the discretion of the commissioner, a community health board may, upon written request to the commissioner, resume these duties.\n(b) Lead risk assessments must be conducted by a community health board serving a city of the first class. The commissioner must conduct lead risk assessments in any area not including cities of the first class where a community health board has relinquished to the commissioner the responsibility for lead risk assessments. The commissioner shall coordinate with the community health board to ensure that the requirements of this section are met.\n(c) The commissioner may assist community health boards by providing technical expertise, equipment, and personnel to community health boards. The commissioner may provide laboratory or field lead-testing equipment to a community health board or may reimburse a community health board for direct costs associated with lead risk assessments.\n(a) Notwithstanding section 144.9501, subdivision 6a, for purposes of this subdivision, \"child\" means an individual under 18 years of age.\n(b) An assessing agency shall conduct a lead risk assessment of a residence, residential or commercial child care facility, playground, school, or other location where lead hazards are suspected according to the venous blood lead level and time frame set forth in clauses (1) to (4) for purposes of secondary prevention:\n(1) within 48 hours of a child or pregnant female in the residence, residential or commercial child care facility, playground, school, or other location where lead hazards are suspected being identified to the agency as having a venous blood lead level equal to or greater than 60 micrograms of lead per deciliter of whole blood;\n(2) within five working days of a child or pregnant female in the residence, residential or commercial child care facility, playground, school, or other location where lead hazards are suspected being identified to the agency as having a venous blood lead level equal to or greater than 45 micrograms of lead per deciliter of whole blood;\n(3) within ten working days of a child or pregnant female in the residence, residential or commercial child care facility, playground, school, or other location where lead hazards are suspected being identified to the agency as having a venous blood lead level equal to or greater than ten micrograms of lead per deciliter of whole blood; or\n(4) within 20 working days of a child or pregnant female in the residence, residential or commercial child care facility, playground, school, or other location where lead hazards are suspected being identified to the agency as having a venous blood lead level equal to or greater than five micrograms per deciliter of whole blood.\nAn assessing agency may refer investigations at sites other than the child's or pregnant female's residence to the commissioner.\n(c) Within the limits of available local, state, and federal appropriations, an assessing agency may also conduct a lead risk assessment for children with any elevated blood lead level.\n(d) In a building with two or more dwelling units, an assessing agency shall assess the individual unit in which the conditions of this section are met and shall inspect all common areas accessible to a child. If a child visits one or more other sites such as another residence, or a residential or commercial child care facility, playground, or school, the assessing agency shall also inspect the other sites. The assessing agency shall have one additional day added to the time frame set forth in this subdivision to complete the lead risk assessment for each additional site.\n(e) Within the limits of appropriations, the assessing agency shall identify the known addresses for the previous 12 months of the child or pregnant female with venous blood lead levels of at least 15 micrograms per deciliter for the child or at least ten micrograms per deciliter for the pregnant female; notify the property owners, landlords, and tenants at those addresses that an elevated blood lead level was found in a person who resided at the property; and give them primary prevention information. Within the limits of appropriations, the assessing agency may perform a risk assessment and issue corrective orders in the properties, if it is likely that the previous address contributed to the child's or pregnant female's blood lead level. The assessing agency shall provide the notice required by this subdivision without identifying the child or pregnant female with the elevated blood lead level. The assessing agency is not required to obtain the consent of the child's parent or guardian or the consent of the pregnant female for purposes of this subdivision. This information shall be classified as private data on individuals as defined under section 13.02, subdivision 12.\n(f) The assessing agency shall conduct the lead risk assessment according to rules adopted by the commissioner under section 144.9508. An assessing agency shall have lead risk assessments performed by lead risk assessors licensed by the commissioner according to rules adopted under section 144.9508. If a property owner refuses to allow a lead risk assessment, the assessing agency shall begin legal proceedings to gain entry to the property and the time frame for conducting a lead risk assessment set forth in this subdivision no longer applies. A lead risk assessor or assessing agency may observe the performance of lead hazard reduction in progress and shall enforce the provisions of this section under section 144.9509. Deteriorated painted surfaces, bare soil, and dust must be tested with appropriate analytical equipment to determine the lead content, except that deteriorated painted surfaces or bare soil need not be tested if the property owner agrees to engage in lead hazard reduction on those surfaces. The lead content of drinking water must be measured if another probable source of lead exposure is not identified. Within a standard metropolitan statistical area, an assessing agency may order lead hazard reduction of bare soil without measuring the lead content of the bare soil if the property is in a census tract in which soil sampling has been performed according to rules established by the commissioner and at least 25 percent of the soil samples contain lead concentrations above the standard in section 144.9508.\n(g) Each assessing agency shall establish an administrative appeal procedure which allows a property owner to contest the nature and conditions of any lead order issued by the assessing agency. Assessing agencies must consider appeals that propose lower cost methods that make the residence lead safe. The commissioner shall use the authority and appeal procedure granted under sections 144.989 to 144.993.\n(h) Sections 144.9501 to 144.9512 neither authorize nor prohibit an assessing agency from charging a property owner for the cost of a lead risk assessment.\nAt the time of a lead risk assessment or following a lead order, the assessing agency shall ensure that a family will receive a visit at their residence by a swab team worker or public health professional, such as a nurse, sanitarian, public health educator, or other public health professional. The swab team worker or public health professional shall inform the property owner, landlord, and the tenant of the health-related aspects of lead exposure; nutrition; safety measures to minimize exposure; methods to be followed before, during, and after the lead hazard reduction process; and community, legal, and housing resources. If a family moves to a temporary residence during the lead hazard reduction process, lead education services should be provided at the temporary residence whenever feasible.\n[Repealed, 2001 c 205 art 1 s 43]\n(a) An assessing agency, after conducting a lead risk assessment, shall order a property owner to perform lead hazard reduction on all lead sources that exceed a standard adopted according to section 144.9508. If lead risk assessments and lead orders are conducted at times when weather or soil conditions do not permit the lead risk assessment or lead hazard reduction, external surfaces and soil lead shall be assessed, and lead orders complied with, if necessary, at the first opportunity that weather and soil conditions allow.\n(b) If, after conducting a lead risk assessment, an assessing agency determines that the property owner's lead hazard originated from another source location, the assessing agency may order the responsible person of the source location to:\n(1) perform lead hazard reduction at the site where the assessing agency conducted the lead risk assessment; and\n(2) remediate the conditions at the source location that allowed the lead hazard, pollutant, or contaminant to migrate from the source location.\n(c) For purposes of this subdivision, \"pollutant or contaminant\" has the meaning given in section 115B.02, subdivision 13, and \"responsible person\" has the meaning given in section 115B.03.\n(d) If the paint standard under section 144.9508 is violated, but the paint is intact, the assessing agency shall not order the paint to be removed unless the intact paint is a known source of actual lead exposure to a specific person. Before the assessing agency may order the intact paint to be removed, a reasonable effort must be made to protect the child and preserve the intact paint by the use of guards or other protective devices and methods.\n(e) Whenever windows and doors or other components covered with deteriorated lead-based paint have sound substrate or are not rotting, those components should be repaired, sent out for stripping or planed down to remove deteriorated lead-based paint, or covered with protective guards instead of being replaced, provided that such an activity is the least cost method. However, a property owner who has been ordered to perform lead hazard reduction may choose any method to address deteriorated lead-based paint on windows, doors, or other components, provided that the method is approved in rules adopted under section 144.9508 and that it is appropriate to the specific property.\n(f) Lead orders must require that any source of damage, such as leaking roofs, plumbing, and windows, be repaired or replaced, as needed, to prevent damage to lead-containing interior surfaces.\n(g) The assessing agency is not required to pay for lead hazard reduction. The assessing agency shall enforce the lead orders issued to a property owner under this section.\nAfter a lead risk assessment or after issuing lead orders, the assessing agency, within the limits of appropriations and availability, shall offer the property owner the services of a swab team free of charge and, if accepted, shall send a swab team within ten working days to the residence to perform swab team services as defined in section 144.9501. If the assessing agency provides swab team services after a lead risk assessment, but before the issuance of a lead order, swab team services do not need to be repeated after the issuance of the lead order if the swab team services fulfilled the lead order. Swab team services are not considered completed until the clearance inspection required under this section shows that the property is lead safe.\n(a) Within the limits of appropriations, the assessing agency shall ensure that residents are relocated from rooms or dwellings during a lead hazard reduction process that generates leaded dust, such as removal or disruption of lead-based paint or plaster that contains lead. Residents shall not remain in rooms or dwellings where the lead hazard reduction process is occurring. An assessing agency is not required to pay for relocation unless state or federal funding is available for this purpose. The assessing agency shall make an effort to assist the resident in locating resources that will provide assistance with relocation costs. Residents shall be allowed to return to the room or dwelling after completion of the lead hazard reduction process. An assessing agency shall use grant funds under section 144.9507 if available, in cooperation with local housing agencies, to pay for moving costs and rent for a temporary residence for any low-income resident temporarily relocated during lead hazard reduction. For purposes of this section, \"low-income resident\" means any resident whose gross household income is at or below 185 percent of federal poverty level.\n(b) A resident of rental property who is notified by an assessing agency to vacate the premises during lead hazard reduction, notwithstanding any rental agreement or lease provisions:\n(1) shall not be required to pay rent due the landlord for the period of time the tenant vacates the premises due to lead hazard reduction;\n(2) may elect to immediately terminate the tenancy effective on the date the tenant vacates the premises due to lead hazard reduction; and\n(3) shall not, if the tenancy is terminated, be liable for any further rent or other charges due under the terms of the tenancy.\n(c) A landlord of rental property whose tenants vacate the premises during lead hazard reduction shall:\n(1) allow a tenant to return to the dwelling unit after lead hazard reduction and clearance inspection, required under this section, is completed, unless the tenant has elected to terminate the tenancy as provided for in paragraph (b); and\n(2) return any security deposit due under section 504B.178 within five days of the date the tenant vacates the unit, to any tenant who terminates tenancy as provided for in paragraph (b).\nIf the property owner does not hire a person licensed by the commissioner under section 144.9505 for compliance with the lead orders, the property owner shall submit a notice as to when regulated lead work will begin, according to section 144.9505, subdivision 4, to the assessing agency within 30 days after receiving the orders.\nAfter completion of swab team services and compliance with the lead orders by the property owner, including any repairs ordered by a local housing or building inspector, the assessing agency shall conduct a clearance inspection by visual identification of deteriorated paint and bare soil and retest the dust lead concentration in the residence to assure that violations of the lead standards under section 144.9508 no longer exist. The assessing agency is not required to test a dwelling unit after lead hazard reduction that was not ordered by the assessing agency.\nA lead risk assessment is completed and the responsibility of the assessing agency ends when all of the following conditions are met:\n(1) lead orders are written on all known sources of violations of lead standards under section 144.9508;\n(2) compliance with all lead orders has been completed; and\n(3) clearance inspections demonstrate that no deteriorated lead paint, bare soil, or lead dust levels exist that exceed the standards adopted under section 144.9508.\n[Repealed, 2001 c 205 art 1 s 43]\n(a) By January 1, 2011, the commissioner must revise clinical and case management guidelines to include recommendations for protective health actions and follow-up services when a child's blood lead level exceeds five micrograms of lead per deciliter of blood. The revised guidelines must be implemented to the extent possible using available resources.\n(b) In revising the clinical and case management guidelines for blood lead levels greater than five micrograms of lead per deciliter of blood under this subdivision, the commissioner of health must consult with a statewide organization representing physicians, the public health department of Minneapolis and other public health departments, one representative of the residential construction industry, and a nonprofit organization with expertise in lead abatement.",
	"repealed": false
}