{
	"id": "256B.0635",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0635",
	"title": "256B.0635 CONTINUED ELIGIBILITY IN SPECIAL CIRCUMSTANCES.",
	"text": "(a) Until June 30, 2002, medical assistance may be paid for persons who received MFIP or medical assistance for families and children in at least three of six months preceding the month in which the person became ineligible for MFIP or medical assistance, if the ineligibility was due to an increase in hours of employment or employment income or due to the loss of an earned income disregard. In addition, to receive continued assistance under this section, persons who received medical assistance for families and children but did not receive MFIP must have had income less than or equal to the assistance standard for their family size under the state's AFDC plan in effect as of July 16, 1996, increased by three percent effective July 1, 2000, at the time medical assistance eligibility began. A person who is eligible for extended medical assistance is entitled to six months of assistance without reapplication, unless the assistance unit ceases to include a dependent child. For a person under 21 years of age, medical assistance may not be discontinued within the six-month period of extended eligibility until it has been determined that the person is not otherwise eligible for medical assistance. Medical assistance may be continued for an additional six months if the person meets all requirements for the additional six months, according to title XIX of the Social Security Act, as amended by section 303 of the Family Support Act of 1988, Public Law 100-485.\n(b) Beginning July 1, 2002, contingent upon federal funding, medical assistance for families and children may be paid for persons who were eligible under section 256B.055, subdivision 3a, in at least three of six months preceding the month in which the person became ineligible under that section if the ineligibility was due to an increase in hours of employment or employment income or due to the loss of an earned income disregard. A person who is eligible for extended medical assistance is entitled to six months of assistance without reapplication, unless the assistance unit ceases to include a dependent child, except medical assistance may not be discontinued for that dependent child under 21 years of age within the six-month period of extended eligibility until it has been determined that the person is not otherwise eligible for medical assistance. Medical assistance may be continued for an additional six months if the person meets all requirements for the additional six months, according to title XIX of the Social Security Act, as amended by section 303 of the Family Support Act of 1988, Public Law 100-485.\n(a) Until June 30, 2002, medical assistance may be paid for persons who received MFIP or medical assistance for families and children in at least three of the six months preceding the month in which the person became ineligible for MFIP or medical assistance, if the ineligibility was the result of the collection of child or spousal support under part D of title IV of the Social Security Act. In addition, to receive continued assistance under this section, persons who received medical assistance for families and children but did not receive MFIP must have had income less than or equal to the assistance standard for their family size under the state's AFDC plan in effect as of July 16, 1996, increased by three percent effective July 1, 2000, at the time medical assistance eligibility began. A person who is eligible for extended medical assistance under this subdivision is entitled to four months of assistance without reapplication, unless the assistance unit ceases to include a dependent child, except medical assistance may not be discontinued for that dependent child under 21 years of age within the four-month period of extended eligibility until it has been determined that the person is not otherwise eligible for medical assistance.\n(b) Beginning July 1, 2002, contingent upon federal funding, medical assistance for families and children may be paid for persons who were eligible under section 256B.055, subdivision 3a, in at least three of the six months preceding the month in which the person became ineligible under that section if the ineligibility was the result of the collection of child or spousal support under part D of title IV of the Social Security Act. A person who is eligible for extended medical assistance under this subdivision is entitled to four months of assistance without reapplication, unless the assistance unit ceases to include a dependent child, except medical assistance may not be discontinued for that dependent child under 21 years of age within the four-month period of extended eligibility until it has been determined that the person is not otherwise eligible for medical assistance.\n[Repealed, 2002 c 277 s 34]",
	"repealed": false
}