{
	"id": "296A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.06",
	"title": "296A.06 REVOCATION OF LICENSE, PERMIT, OR CERTIFICATE; SUSPENSION OF LICENSE.",
	"text": "If any person fails to comply with this chapter or the rules adopted under this chapter, without reasonable cause, the commissioner may give the person 30 days' notice in writing, specifying the violations, and stating that based upon such violations the commissioner intends to revoke the person's license, permit, or certificate. The notice shall also advise the person of the person's right to contest the revocation under this section and the general procedures for a contested case hearing under chapter 14. The notice may be served personally or by mail in the manner prescribed for service of an order of assessment. A license, permit, or certificate is revoked when the commissioner serves a notice of revocation upon the person after 30 days have passed following the date of the notice of intent to revoke without the person requesting a hearing. If a hearing is timely requested and held, the license, permit, or certificate is revoked after the commissioner serves an order of revocation under section 14.62, subdivision 1.\n(a) Notwithstanding subdivision 1, the license of a distributor, special fuel dealer, or bulk purchaser that has not filed a tax return or report or paid a delinquent tax or fee within five days after notice and demand by the commissioner is suspended. The suspension remains in effect until the demanded tax return or report has been filed and the tax and fees shown on that return or report have been paid. If the commissioner determines that the failure to file or failure to pay is due to reasonable cause, then a license must not be suspended, or if suspended, must be reinstated.\n(b) A licensee whose license is suspended under this subdivision may request a contested case hearing under chapter 14. Any such hearing must be held within 20 days of the issuance of the notice and demand issued under paragraph (a), unless the parties agree to a later hearing date. The administrative law judge's report must be issued within 20 days after the close of the hearing record, unless the parties agree to a later report issuance date. The commissioner must issue a final decision within 30 days after receipt of the report of the administrative law judge and subsequent exceptions and argument under section 14.61. The suspension imposed under paragraph (a) remains in effect during any contested case hearing process requested pursuant to this paragraph.",
	"repealed": false
}