{
	"id": "611.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.215",
	"title": "611.215 STATE BOARD OF PUBLIC DEFENSE.",
	"text": "(a) The State Board of Public Defense is a part of, but is not subject to the administrative control of, the judicial branch of government. The State Board of Public Defense shall consist of nine members including:\n(1) five attorneys admitted to the practice of law, well acquainted with the defense of persons accused of crime, but not employed as prosecutors, appointed by the supreme court, of which one must be a retired or former public defender within the past five years; and\n(2) four public members appointed by the governor.\nThe appointing authorities may not appoint a person who is a judge to be a member of the State Board of Public Defense.\n(b) All members shall demonstrate an interest in maintaining a high quality, independent defense system for those who are unable to obtain adequate representation. Appointments to the board shall include qualified women and members of minority groups. At least three members of the board shall be from judicial districts other than the First, Second, Fourth, and Tenth Judicial Districts. The terms, compensation, and removal of members shall be as provided in section 15.0575. The chair shall be elected by the members from among the membership for a term of two years.\n(c) The terms of chief district public defenders currently serving shall terminate in accordance with the staggered term schedule set forth in section 611.26, subdivision 2.\n(d) Meetings of the board are subject to chapter 13D.\nThe State Board of Public Defense, with the advice of the state public defender, shall appoint a chief administrator who must be chosen solely on the basis of training, experience, and other qualifications, and who will serve at the pleasure of the State Board of Public Defense. The chief administrator need not be licensed to practice law. The chief administrator shall attend all meetings of the board, but may not vote, and shall:\n(1) enforce all resolutions, rules, regulations, or orders of the board;\n(2) present to the board and the state public defender plans, studies, and reports prepared for the board's and the state public defender's purposes and recommend to the board and the state public defender for adoption measures necessary to enforce or carry out the powers and duties of the board and the state public defender, or to efficiently administer the affairs of the board and the state public defender;\n(3) keep the board fully advised as to its financial condition, and prepare and submit to the board its annual budget and other financial information as it may request;\n(4) recommend to the board the adoption of rules and regulations necessary for the efficient operation of the board and its functions; and\n(5) perform other duties prescribed by the board and the state public defender.\n(a) The board shall approve and recommend to the legislature a budget for the board, the office of state public defender, the judicial district public defenders, and the public defense corporations.\n(b) The board shall establish procedures for distribution of state funding under this chapter to the state and district public defenders and to the public defense corporations.\n(c) The state public defender with the approval of the board shall establish standards for the offices of the state and district public defenders. The standards must include, but are not limited to:\n(1) standards needed to maintain and operate an office of public defender including requirements regarding the qualifications, training, and size of the legal and supporting staff;\n(2) standards for public defender caseloads;\n(3) standards prescribing minimum qualifications of counsel appointed under the board's authority; and\n(4) standards ensuring the independent, competent, and efficient representation of clients whose cases present conflicts of interest, in both the trial and appellate courts.\nIn no event shall the board or its members interfere with the discretion, judgment or zealous advocacy of counsel in their handling of individual cases as a part of the judicial branch of government.\n[Repealed, 1991 c 345 art 3 s 30]",
	"repealed": false
}