{
	"id": "116J.966",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.966",
	"title": "116J.966 COMMISSIONER'S TRADE PROMOTION DUTIES.",
	"text": "(a) The commissioner shall promote, develop, and facilitate trade and foreign investment in Minnesota. In furtherance of these goals, and in addition to the powers granted by section 116J.035, the commissioner may:\n(1) locate, develop, and promote international markets for Minnesota products and services;\n(2) arrange and lead trade missions to countries with promising international markets for Minnesota goods, technology, services, and agricultural products;\n(3) promote Minnesota products and services at domestic and international trade shows;\n(4) organize, promote, and present domestic and international trade shows featuring Minnesota products and services;\n(5) host trade delegations and assist foreign traders in contacting appropriate Minnesota businesses and investments;\n(6) develop contacts with Minnesota businesses and gather and provide information to assist them in locating and communicating with international trading or joint venture counterparts;\n(7) provide information, education, and counseling services to Minnesota businesses regarding the economic, commercial, legal, and cultural contexts of international trade;\n(8) provide Minnesota businesses with international trade leads and information about the availability and sources of services relating to international trade, such as export financing, licensing, freight forwarding, international advertising, translation, and custom brokering;\n(9) locate, attract, and promote foreign direct investment and business development in Minnesota to enhance employment opportunities in Minnesota;\n(10) provide foreign businesses and investors desiring to locate facilities in Minnesota information regarding sources of governmental, legal, real estate, financial, and business services;\n(11) enter into contracts or other agreements with private persons and public entities, including agreements to establish and maintain offices and other types of representation in foreign countries, to carry out the purposes of promoting international trade and attracting investment from foreign countries to Minnesota and to carry out this section, without regard to section 16C.06; and\n(12) market trade-related materials to businesses and organizations, and the proceeds of which must be placed in a special revolving account and are appropriated to the commissioner to prepare and distribute trade-related materials.\n(b) The programs and activities of the commissioner of employment and economic development and the Minnesota Trade Division may not duplicate programs and activities of the commissioner of agriculture.\n(c) The commissioner shall notify the chairs of the senate Finance and house of representatives Ways and Means Committees of each agreement under this subdivision to establish and maintain an office or other type of representation in a foreign country.\n(d) The Minnesota Trade Office shall serve as the state's office of protocol providing assistance to official visits by foreign government representatives and shall serve as liaison to the foreign diplomatic corps in Minnesota.\nThe commissioner of agriculture and the commissioner of employment and economic development shall cooperate with each other to promote the beneficial agricultural interests of the state. The commissioner of agriculture has primary responsibility for promoting state agricultural interests to international markets. The commissioner of agriculture is also responsible for the promotion of national trade programs related to international marketing. The commissioner of agriculture has primary responsibility for promoting the agriculture interests of producers, promoting state agricultural markets, and promoting agricultural interests of the state in cooperative production and marketing efforts with other states and the United States Department of Agriculture. The commissioner of agriculture is also responsible for promoting the national and international marketing of state agricultural products.",
	"repealed": false
}