{
	"id": "297G.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.07",
	"title": "297G.07 EXEMPTIONS FROM TAX.",
	"text": "The following are not subject to the excise tax:\n(1) Sales by a manufacturer, brewer, or wholesaler for shipment outside the state in interstate commerce.\n(2) Alcoholic beverages sold or transferred between Minnesota wholesalers.\n(3) Sales to common carriers engaged in interstate transportation of passengers, except as provided in this chapter.\n(4) Malt beverages served by a brewery for on-premise consumption at no charge, or distributed to brewery employees for on-premise consumption under a labor contract.\n(5) Shipments of wine to Minnesota residents under section 340A.417.\n(6) Fruit juices naturally fermented or beer naturally brewed in the home for family use and not sold or offered for sale.\n(7) Sales of wine for sacramental purposes under section 340A.316.\n(8) Alcoholic beverages sold to authorized manufacturers of food products or pharmaceutical firms. The alcoholic beverage must be used exclusively in the manufacture of food products or medicines. For purposes of this clause, \"manufacturer\" means a person who manufactures food products intended for sale to wholesalers or retailers for ultimate sale to the consumer.\n(9) Liqueur-filled candy.\n(10) Sales to a federal agency, that the state of Minnesota is prohibited from taxing under the Constitution or laws of the United States or under the Constitution of Minnesota.\n(11) Sales to Indian tribes as defined in section 297G.08.\n(12) Shipments of intoxicating liquor from foreign countries to diplomatic personnel of foreign countries assigned to service in this state.\n(13) Shipments of bulk distilled spirits or bulk wine to farm wineries licensed under section 340A.315 for input to the final product.\n(a) A person, other than a person under the age of 21 years, entering Minnesota from another state may have in possession one liter of intoxicating liquor or 288 ounces of fermented malt beverages without the required payment of the Minnesota excise tax, provided the alcoholic beverages accompany the person into this state and will not be offered for sale or used for any commercial purposes.\n(b) A person, other than a person under the age of 21 years, entering Minnesota from a foreign country may have in possession four liters of intoxicating liquor or ten quarts (320 ounces) of fermented malt beverages without the required payment of the Minnesota excise tax, provided the alcoholic beverages accompany the person into this state and will not be offered for sale or used for any commercial purposes.\n(c) A collector of commemorative bottles, other than a person under the age of 21 years, entering Minnesota from another state may have in possession 12 or fewer commemorative bottles without the required payment of the Minnesota excise tax.\n(d) This subdivision does not apply to consignments of alcoholic beverages shipped into this state by holders of Minnesota import licenses or Minnesota manufacturers and wholesalers when licensed by the commissioner of public safety or to common carriers with licenses to sell intoxicating liquor in more than one state.\nThe following are exempt from the bottle tax:\n(1) miniatures of distilled spirits and wines;\n(2) containers of fermented malt beverage;\n(3) containers of intoxicating liquor or wine holding less than 200 milliliters;\n(4) containers of alcoholic beverages sold and shipped to dealers, wineries, or distillers in other states;\n(5) containers of alcoholic beverages sold to other Minnesota wholesalers;\n(6) containers of alcoholic beverages sold to common carriers engaged in interstate commerce;\n(7) containers of wine intended exclusively for sacramental purposes;\n(8) containers of alcoholic beverages sold to authorized food processors or pharmaceutical firms for use exclusively in the manufacturing of food products or medicines; and\n(9) sales to a federal agency, that the state of Minnesota is prohibited from taxing under the Constitution or laws of the United States or under the Constitution of Minnesota.",
	"repealed": false
}