{
	"id": "84.797",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.797",
	"title": "84.797 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 84.797 to 84.804.\n\"City\" means a statutory or home rule charter city.\n\"Commissioner\" means the commissioner of natural resources.\n\"Dealer\" means a person engaged in the business of selling off-road vehicles at wholesale or retail.\n\"Manufacturer\" means a person engaged in the business of manufacturing off-road vehicles.\n\"Off-road\" means on trails or nonpublic roads or for cross-country travel on natural terrain. For purposes of sections 84.797 to 84.8045, nonpublic roads include state forest roads, county forest roads, and other roads and trails that are not operated by a public road authority as defined in section 160.02, subdivision 25.\n(a) \"Off-road vehicle\" or \"vehicle\" means a motor-driven recreational vehicle capable of cross-country travel on natural terrain without benefit of a road or trail.\n(b) Off-road vehicle does not include a snowmobile; an all-terrain vehicle; a motorcycle; an electric-assisted bicycle as defined in section 169.011, subdivision 27; a watercraft; a farm vehicle being used for farming; a vehicle used for military, fire, emergency, or law enforcement purposes; a construction or logging vehicle used in the performance of its common function; a motor vehicle owned by or operated under contract with a utility, whether publicly or privately owned, when used for work on utilities; a commercial vehicle being used for its intended purpose; snow-grooming equipment when used for its intended purpose; or an aircraft.\n\"Off-road vehicle use area\" means an area that is posted or designated for off-road vehicle use in accordance with rules adopted by the managing authority.\n\"Owner\" means a person, other than a person with a security interest, that has a property interest in or title to an off-road vehicle and is entitled to the use and possession of the vehicle.\n\"Person\" has the meaning given in section 336.1-201(b)(27).\n\"Public road right-of-way\" means the entire right-of-way of a roadway that is not privately owned, including the traveled portions, banks, ditches, shoulders, and medians.\n\"Off-road vehicle staging area\" means a parking lot, trail head, campground, or other location to or from which an off-road vehicle is transported by truck, trailer, or other motor vehicle so that it may be placed into operation or removed from operation on public lands. Off-road vehicle staging area does not include a location to which an off-road vehicle is transported primarily for servicing, maintenance, repair, storage, or sale.",
	"repealed": false
}