{
	"id": "211B.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.20",
	"title": "211B.20 DENIAL OF ACCESS BY POLITICAL CANDIDATES TO MULTIPLE UNIT DWELLINGS.",
	"text": "(a) It is unlawful for a person, either directly or indirectly, to deny access to an apartment house, dormitory, nursing home, manufactured home park, other multiple unit facility used as a residence, or an area in which two or more single-family dwellings are located on private roadways to a candidate who has:\n(1) organized a campaign committee under applicable federal or state law;\n(2) filed a financial report as required by section 211A.02; or\n(3) filed an affidavit of candidacy for elected office.\nA candidate granted access under this section must be allowed to be accompanied by campaign volunteers.\n(b) Access to a facility or area is only required if it is located within the district or territory that will be represented by the office to which the candidate seeks election, and the candidate and any accompanying campaign volunteers seek access exclusively for the purpose of campaigning for a candidate or registering voters. The candidate must be seeking election to office at the next general or special election to be held for that office.\n(c) A candidate and any accompanying campaign volunteers granted access under this section must be permitted to knock on the doors of individual units to speak with residents, and to leave campaign materials for residents at their doors, except that the manager of a nursing home may direct that the campaign materials be left at a central location within the facility. The campaign materials must be left in an orderly manner.\n(d) If a facility or area contains multiple buildings, a candidate and accompanying volunteers must be permitted to access more than one building on a single visit, but access is limited to only one building at a time. If multiple candidates are traveling together, each candidate and that candidate's accompanying volunteers is limited to one building at a time, but all of the candidates and accompanying volunteers traveling together must not be restricted to accessing the same building at the same time.\n(e) A violation of this section is a petty misdemeanor.\nSubdivision 1 does not prohibit:\n(1) denial of admittance into a particular apartment, room, manufactured home, or personal residential unit;\n(2) requiring reasonable and proper identification as a necessary prerequisite to admission to a multiple unit dwelling;\n(3) in the case of a nursing home or an assisted living facility under chapter 144G, denial of permission to visit certain persons for valid health reasons;\n(4) limiting visits by candidates or volunteers accompanied by the candidate to a reasonable number of persons or reasonable hours;\n(5) requiring a prior appointment to gain access to the facility; or\n(6) denial of admittance to or expulsion from a multiple unit dwelling for good cause.",
	"repealed": false
}