{
	"id": "238.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.25",
	"title": "238.25 PROCEDURE.",
	"text": "The procedure for acquiring access under sections 238.02, subdivisions 1a, 1c, 1d, 21a, 28a, 29a, 31a, and 31d, and 238.22 to 238.27 must be as provided under this section, notwithstanding any provisions of chapter 117.\n(a) To obtain access to property under sections 238.02, subdivisions 1a, 1c, 1d, 21a, 28a, 29a, 31a, and 31d, and 238.22 to 238.27, a cable communications system shall serve written notice on all property owners. The notice shall contain the following:\n(1) the name and address of the cable communications system;\n(2) the name of the property owners and address of the premises to which access is sought;\n(3) the date of the franchise and city granting the franchise;\n(4) the amount of compensation offered by the cable communications system to the property owner or owners; and\n(5) the anticipated date on which access is to commence.\n(b) If a property owner does not accept the offer made by the cable communications system, the property owner shall, within 45 days of the service of the notice and offer, notify the cable communications system of the refusal. Failure to notify the cable communications system within 45 days as provided under this paragraph constitutes a refusal of the offer and a denial of access.\n(c) The notice and offer must be served on the property owner or owners by certified mail or in the same manner as a summons in a civil action.\n(a) A cable communications system which has been denied access to a multiple-dwelling complex may initiate proceedings under this section to obtain access.\n(b) The cable communications system shall pay all costs of the proceedings including compensation to the property owner.\n(a) To obtain access to the property owner's premises, as required under section 238.23, the cable communications system shall file with the district court in the county in which the premises is located, a petition:\n(1) stating that the cable communications system has served the property owners with the notice and offer required under subdivision 2 and that the offer has not been accepted;\n(2) requesting a determination of the damages, if any, which may result from the access; and\n(3) stating the legal description of the property owner's premises to which access is sought.\n(b) Upon filing the petition with the district court, the cable communications system shall pay the property owner or deposit with the district court an amount equal to the system's offer of compensation as provided under subdivision 2, paragraph (a), clause (4).\n(c) Upon filing of the petition with the district court, the cable communications system may file for record with the county recorder a notice of the pendency of the proceeding, describing with reasonable certainty the premises affected and the purposes of the petition.\nThe petition must be served upon all persons named in the petition as property owners in the same manner as a summons in a civil action; except that, service may be made upon a property owner by three weeks' published notice if the person operating a cable communications system, or the person's agent or attorney, files an affidavit stating on belief that the property owner is not a resident of the state and that the system has mailed a copy of the notice to the property owner at the property owner's place of residence, or that after diligent inquiry the property owner's place of residence cannot be ascertained by the system. If the state is a property owner, the notice must be served upon the attorney general. Any property owner not served as provided under this paragraph is not bound by the proceeding unless the property owner voluntarily appears in the proceeding.\nUpon the filing of the petition and proof of service as provided under this section, and prior to making a determination of damages under this section, the court shall enter an order granting access 30 days after the filing of the petition.\nFor the purpose of making surveys and examinations to accomplish all necessary preliminary purposes or for other purposes relative to any proceedings under this section, the cable communications system may lawfully enter a property owner's premises, doing no unnecessary damage and being liable only for actual damage done.\n(a) The court shall enter judgment no sooner than ten days after it has filed its determination of damages.\n(b) The cable communications system may at any time up to ten days after the filing of the court's determination of the damages dismiss any proceeding under this section against any property owner's premises by notifying the property owner and the court. When the proceeding is dismissed, the property owner may recover from the cable communications system reasonable costs and expenses and temporary damages, if any.\nEither party to the district court proceeding may appeal the court's determination within 90 days after the filing of that determination.\nUpon completion of the proceedings, the attorney for the person operating the cable communications system shall make a certificate describing the access acquired and the purpose or purposes for which acquired, and reciting the fact of final payment of all awards or judgments in relation thereto. The certificate must be filed with the court administrator and a certified copy thereof recorded with the county recorder. The record is notice to all parties of the access to the premises described in the petition.\nNeither sections 117.50 to 117.56 nor the Uniform Relocation Assistance and Real Property Acquisition Policies Act of 1970 may be construed as applying to any persons affected by these proceedings.",
	"repealed": false
}