{
	"id": "164.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/164.07",
	"title": "164.07 ESTABLISHMENT, ALTERATION, OR VACATION OF TOWN ROAD.",
	"text": "Any town board may alter or vacate a town road, including those dedicated to the public by plat, or establish a new road in its town upon a petition of not less than eight voters of the town, who own real estate, or occupy real estate under the homestead or preemption laws or under contract with the state, within three miles of the road proposed to be established, altered, or vacated; provided, that in any town not having eight voters who own real estate or occupy real estate under the homestead or preemption laws or under contract with the state, within three miles of any proposed road, the town board of such town may alter or vacate a town road, or establish a new road in the town upon a petition signed by a less number of voters of such town, who own real estate or occupy real estate under the homestead or preemption laws or under contract with the state, in such town. Such petition shall contain a description of the road, and what part thereof is to be altered or vacated, and, if a new road, the names of the owners of the land, if known, over which such road is to pass, its point of beginning, general course, and termination. If the petition is to establish or alter a road, the petition must also contain a statement of the purpose and necessity for establishing or altering the road.\n(a) The petition shall be filed with the town clerk, who shall forthwith present it to the town board. The town board within 30 days thereafter shall make an order describing as nearly as practicable the road proposed to be established, altered, or vacated and the several tracts of land through which it passes, and fixing a time and place when and where it will meet and act upon the petition. The order must also contain a notice to affected landowners that a landowner is entitled to judicial review of damages, need, and purpose under subdivision 7 following a determination to establish or alter a road. The petitioners shall cause personal service of the order and a copy of the petition to be made upon each occupant of the land at least ten days before the meeting and cause ten days' posted notice thereof to be given.\n(b) In addition, the petitioners shall serve notice of the order by certified mail upon the commissioner of natural resources at least 60 days before the meeting required under paragraph (a), if the road to be vacated terminates at, abuts upon, or is adjacent to any public water.\n(c) The notice under this paragraph does not create a right of intervention by the commissioner of natural resources. At least 15 days prior to convening the meeting required under paragraph (a), the town board or its designee must consult with the commissioner of natural resources to review the proposed vacation. The commissioner must evaluate:\n(1) the proposed vacation and the public benefits to do so;\n(2) the present and potential use of the land for access to public waters; and\n(3) how the vacation would impact conservation of natural resources.\nThe commissioner must advise the town board or its designee accordingly upon the evaluation.\nAt the time and place designated, the town board shall meet and, on proof by affidavit of the giving of such notice, it shall examine the road proposed to be established, altered, or vacated, hear all parties interested, and determine whether it will grant or refuse the petition. If it be refused, the fact shall be noted on the back thereof.\nOn consideration of a petition for vacation of a road, the town board shall determine whether the lateral ditches of said road are essential for surface drainage of adjacent lands, or for drainage of public highways, in the area. If the board finds that preservation of such drainage facilities is for the general health and welfare of the public, then the board may cause the road to be vacated with a provision that the town shall retain the right of access for the purpose of maintaining such drainage facilities. An owner of land adjacent to the vacated portion of the road shall not interfere with the functioning of such drainage facilities.\nIf the petition be granted, the town board, if it deem it necessary, shall cause a survey to be made. When the center of such road does not follow a section line, or some subdivisional line of a section, the surveyor shall note the distance to the point on any course at which such course will intersect a section line, and the distance of such point of intersection from the most convenient section, quarter-section, or meander corner, as established by the government survey; and the notes of such intersections, and a description of the road so established, altered, or vacated shall be incorporated in an order to be signed by the town board.\nThe damages sustained by reason of establishing, altering, or vacating any road may be ascertained by the agreement of the owners and the town board; and unless such agreement is made, or the owners release in writing all claims to damages, the same shall be assessed and awarded before such road is opened, worked, or used. Every agreement and release shall be filed with the town clerk and be final as to the matters therein contained. The town board shall assess the damages of each claimant with whom it cannot agree, or who is unknown, specifying the amount awarded to each and briefly describing each parcel of land. In ascertaining the damages which will be sustained by any owner the town board shall determine the money value of the benefits which the establishment, alteration, or vacation, as the case may be, will confer, and deduct the benefits, if any, from the damages, if any, and award the difference, if any as damages.\nThe award of damages shall be filed with the town clerk. Within seven days after filing the town clerk shall notify, in writing, each known owner and occupant of each tract of the filing of the award of damages. The notification shall set forth the date of the award, the amount of the award of damages and any terms or conditions of the award. The notification must include a clear and coherent explanation, written in language using words with common and everyday meanings, of the requirements for appealing the award of damages under subdivision 7.\nWithin 40 days after the filing of the award of damages any owner or occupant may appeal from the award by filing a notice of appeal with the court administrator of the district court of the county where the lands lie. However, the owner or occupant must file the notice of appeal within ten days in order to delay the opening, construction, alteration, change, or other improvement in or to the road pursuant to subdivision 10. The notice of appeal shall be accompanied by a bond of not less than $250, with sufficient surety approved by the judge or the county auditor conditioned to pay all costs arising from the appeal in case the award is sustained. A copy of the notice shall be mailed by registered or certified mail to the town clerk or any member of the town board. The notice of appeal shall specify the award or failure to award appealed from, the land to which it relates, the nature and amount of the claim of appellant, and the grounds of the appeal, which may include a challenge to the public purpose or necessity of the proposed road or condemnation.\nThe appeal shall be entered upon the calendar for trial at the next general term of the court occurring more than 20 days after the appeal is perfected. It shall be tried in the same manner as an appeal in eminent domain proceedings under chapter 117. The prevailing party shall recover costs and disbursements as in other civil cases and judgment shall be entered upon the verdict.\nIf no appeal is taken within the appeal period, the award shall be considered the same as a judgment. The provisions of sections 365.41 and 365.42 shall apply as to payment of all awards and judgments; and such award or judgment shall draw interest at the rate of six percent per annum to date of payment. The duty of the town board to pay the award or final judgment shall be held and construed to be just compensation or the securing of just compensation within the meaning of the constitution.\nAfter the award of damages has been filed, the board may proceed to open, construct, alter, or change the highway; provided it does not receive notice of appeal within ten days pursuant to subdivision 7. If the board receives a notice of appeal within ten days that challenges the public purpose or necessity of the proposed road or condemnation, it shall suspend any proposed work on the road until a final judicial determination supporting the condemnation is made. If the notice of appeal does not challenge the public purpose or necessity, the appeal shall not delay the prosecution of the proposed improvement, and the town board may proceed as if no appeal had been taken.\n(a) The order establishing, altering, or vacating any road shall be recorded by the town clerk, and a copy thereof certified as true and correct by the town clerk shall be forthwith recorded with the county recorder or registrar of titles of the county within which the land and premises are located. The certified copy of the order shall be first presented to the county auditor who shall enter the same in the transfer records and note upon the certified copy over the auditor's official signature, the words \"entered in the transfer record.\"\n(b) The order or a certified copy shall be received in all courts as competent evidence of the facts therein contained and be prima facie evidence of the regularity of the proceedings prior to the making thereof, except upon the hearing of an appeal.\nThe determination of a town board refusing to establish, alter, or vacate any road shall be final, unless appealed from, for one year from the filing of its order; and no petition for establishing, altering, or vacating such road shall be acted upon within that time. In case its determination granting a petition is appealed from and reversed, it shall not within one year from date of such determination entertain a petition having the same or a similar object.\nFor the purposes of this section and section 164.08, the town board, its employees or agents, may enter upon any property, public or private, to conduct property examinations and surveys. This subdivision does not grant immunity to the town board, its employees, or agents for damage caused to public or private property as the result of an entry onto the property.",
	"repealed": false
}