{
	"id": "4.076",
	"url": "https://www.revisor.mn.gov/statutes/cite/4.076",
	"title": "4.076 ADVISORY COUNCIL ON TRAFFIC SAFETY.",
	"text": "For purposes of this section, \"advisory council\" means the Advisory Council on Traffic Safety established in this section.\n(a) The Advisory Council on Traffic Safety is established to advise, consult with, assist in planning coordination, and make program recommendations to the commissioners of public safety, transportation, and health on the development and implementation of projects and programs intended to improve traffic safety on all Minnesota road systems.\n(b) The advisory council serves as the lead for the state Toward Zero Deaths program.\n(a) The advisory council consists of the following members:\n(1) the chair, which is filled on a two-year rotating basis by a designee from:\n(i) the Office of Traffic Safety in the Department of Public Safety;\n(ii) the Office of Traffic Engineering in the Department of Transportation; and\n(iii) the Injury and Violence Prevention Section in the Department of Health;\n(2) two vice chairs, which must be filled by the two designees who are not currently serving as chair of the advisory council under clause (1);\n(3) the statewide Toward Zero Deaths communications coordinator;\n(4) the statewide Toward Zero Deaths program and operations coordinator;\n(5) a regional coordinator from the Toward Zero Deaths program;\n(6) the chief of the State Patrol or a designee;\n(7) the state traffic safety engineer in the Department of Transportation or a designee;\n(8) a law enforcement liaison from the Department of Public Safety;\n(9) a representative from the Department of Human Services;\n(10) a representative from the Department of Education;\n(11) a representative from the Council on Disability;\n(12) a representative for Tribal governments;\n(13) a representative from the Center for Transportation Studies at the University of Minnesota;\n(14) a representative from the Minnesota Chiefs of Police Association;\n(15) a representative from the Minnesota Sheriffs' Association;\n(16) a representative from the Minnesota Safety Council;\n(17) a representative from AAA Minnesota;\n(18) a representative from the Minnesota Trucking Association;\n(19) a representative from the Insurance Federation of Minnesota;\n(20) a representative from the Association of Minnesota Counties;\n(21) a representative from the League of Minnesota Cities;\n(22) the American Bar Association State Judicial Outreach Liaison;\n(23) a representative from the City Engineers Association of Minnesota;\n(24) a representative from the Minnesota County Engineers Association;\n(25) a representative from the Bicycle Alliance of Minnesota;\n(26) two individuals representing vulnerable road users, including pedestrians, bicyclists, and other operators of a personal conveyance;\n(27) a representative from Minnesota Operation Lifesaver;\n(28) a representative from the Minnesota Driver and Traffic Safety Education Association;\n(29) a representative from the Minnesota Association for Pupil Transportation;\n(30) a representative from the State Trauma Advisory Council;\n(31) a person representing metropolitan planning organizations;\n(32) a person representing contractors engaged in construction and maintenance of highways and other infrastructure;\n(33) the director of the Minnesota Emergency Medical Services Regulatory Board or successor organization; and\n(34) a person representing a victims advocacy organization.\n(b) The commissioners of public safety and transportation must jointly appoint the advisory council members under paragraph (a), clauses (12), (26), (31), (32), and (34).\nThe advisory council must:\n(1) advise the governor and heads of state departments and agencies on policies, programs, and services affecting traffic safety;\n(2) advise the appropriate representatives of state departments on the activities of the Toward Zero Deaths program, including but not limited to educating the public about traffic safety;\n(3) encourage state departments and other agencies to conduct needed research in the field of traffic safety;\n(4) review recommendations of the subcommittees and working groups;\n(5) review and comment on all grants dealing with traffic safety and on the development and implementation of state and local traffic safety plans; and\n(6) make recommendations on safe road zone safety measures under section 169.065.\n(a) The Office of Traffic Safety in the Department of Public Safety, in cooperation with the Departments of Transportation and Health, must serve as the host agency for the advisory council and must manage the administrative and operational aspects of the advisory council's activities. The commissioner of public safety must perform financial management on behalf of the council.\n(b) The advisory council must meet no less than four times per year, or more frequently as determined by the chair, a vice chair, or a majority of the council members. The advisory council is subject to chapter 13D.\n(c) The chair must regularly report to the respective commissioners on the activities of the advisory council and on the state of traffic safety in Minnesota.\n(d) The terms, compensation, and appointment of members are governed by section 15.059.\n(e) The advisory council may appoint subcommittees and working groups. Subcommittees must consist of council members. Working groups may include nonmembers. Nonmembers on working groups must be compensated pursuant to section 15.059, subdivision 3, only for expenses incurred for working group activities.",
	"repealed": false
}