{
	"id": "123B.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.045",
	"title": "123B.045 DISTRICT-CREATED SITE-GOVERNED SCHOOLS.",
	"text": "(a) A school board may approve site-governed schools under this section by requesting site-governing school proposals. The request for proposals must include what types of schools or education innovations the board intends to create. A current site may submit a proposal to create a different model for the site if 60 percent or more of the teachers at the site support the proposal. A group of licensed district professionals from one or multiple district sites may submit a proposal. The group submitting the proposal must include parents or other community members in the development of the proposal. A proposal may request approval for a model of a school not included in the request for proposal of the board.\n(b) The school board and the applicable bargaining unit representing district employees must enter into memoranda of understanding specifying how applicable sections of current contracts will enable the provisions of subdivision 2, paragraph (a), clauses (7) and (8), to be implemented.\n(c) Within 60 days of receipt of the application, the school board shall determine whether to approve, deny, or return the application to the applicants for further information or development.\n(d) Upon approval of the proposal, an agreement between the district and the site council shall be developed identifying the powers and duties delegated to the site and outlining the details of the proposal including the provisions of subdivisions 2, 3, and 5. Any powers or duties not specifically delegated to the school site in the agreement remains with the school board.\n(a) Site-governed schools approved by the school board have the following autonomy and responsibilities at the discretion of the site:\n(1) to create the site-governing council of the school. The council shall include teachers, administrators, parents, students if appropriate, community members, and other representatives of the community as determined by the site-governing council. Teachers may comprise a majority of the site-governing council at the option of a majority of the teachers at the site. The number of members on the site-governing council and the composition shall be included in the proposal approved by the school board;\n(2) to determine the leadership model for the site including: selecting a principal, operating as a teacher professional practices model with school leadership functions performed by one or more teachers or administrators at the school or other model determined by the site;\n(3) to determine the budget for the site and the allocation and expenditure of the revenue based on provisions of subdivision 3;\n(4) to determine the learning model and organization of the school consistent with the application approved by the school board;\n(5) to select and develop its curriculum and determine formative and summative assessment practices;\n(6) to set policies for the site including student promotion, attendance, discipline, graduation requirements which may exceed the school board standards, and other such rules as approved by the school board consistent with the mission, goals, and learning program of the school site;\n(7) to determine the length of the school day and year and employee work rules covered by the terms and conditions of the employment contract;\n(8) to select teachers and other staff consistent with current law and collective bargaining agreements and memoranda of understanding provided for in subdivision 1, paragraph (b). At least 70 percent of the teachers must be selected by the site prior to final approval of the agreement. Prior to requesting the district to employ staff not currently employed by the district, the site must first select current district staff including those on requested and unrequested leave as provided for in sections 122A.40 and 122A.41. The school board shall be the legal employer of all staff at the site and all teachers and other staff members of the applicable bargaining units. Teachers and other employees may be required to sign an individual work agreement with the site-governing council committing themselves to the mission and learning program of the school and the requirements of the site-governing council; and\n(9) to fulfill other provisions as agreed to by the district and site-governing council.\n(b) If a self-governed school created under this section is supervised by a principal, that principal must be licensed, consistent with section 123B.147, subdivision 2.\n(a) Consistent with subdivision 1 authorizing a school board to agree to assign certain autonomies and responsibilities to a school site, and subject to a memorandum of understanding between the school board and the exclusive representative of the teachers, a grant program is established to encourage licensed teachers employed at a school site to explore and develop organizational models for teaching and learning; provide curriculum and corresponding formative, interim, and summative assessments; measure and evaluate teacher performance; assign teaching positions and restructure instructional work; provide professional development to support teachers restructuring their work; allocate revenue; assert autonomy and leadership; and pursue other such policies, strategies, and activities for creating teacher-governed schools.\n(b) The commissioner, after receiving documentation of the approved agreement between the parties under subdivision 1, paragraph (d), shall award grants on a first-come, first-served basis until appropriated funds are expended according to this paragraph:\n(1) a planning grant of up to $50,000 during the first year of the parties' agreement; and\n(2) an implementation grant of up to $100,000 during each of the next two years of the parties' agreement.\n(c) A grant recipient that terminates an agreement before the end of a school year must return a pro rata portion of the grant to the commissioner, the amount of which the commissioner must determine based upon the number of school days remaining in the school year after the agreement is terminated. Grant recipients are encouraged to seek matching funds or in-kind contributions from nonstate sources to supplement the grant awards.\n(d) A school district receiving a grant must transmit to the commissioner in an electronic format and post on its website by the end of the school year readily accessible information about recommended best practices based on its experience and progress under this section. The commissioner must make information about these recommended best practices readily available to interested districts and schools throughout Minnesota.\n(a) The revenue that shall be allocated by the site includes the general education revenue generated by the students at the site from state, local, and private sources, referendum revenue, federal revenue from the Elementary and Secondary Education Act, Individuals with Disabilities Education Act, Carl Perkins Act, and other federal programs as agreed to by the school board and site council.\n(b) The district may retain an administrative fee for managing the federal programs, private revenues, and general administrative functions including school board, superintendent, district legal counsel, finance, accountability and self-governed school contract oversight, facilities maintenance, districtwide special education programs, and other such services as agreed to by the site and school board. The administrative fee shall be included in the agreement.\n(c) As part of the agreement, the district may provide specific services for the site and may specify the amount to be paid for each service and retain the revenues for that amount. The formula or procedures for determining the amount of revenue to be allocated to the site each year shall be consistent with this subdivision and incorporated in the site budget annually following a timeline and process that is included in the agreement with the school board. The site is responsible for allocating revenue for all staff at the site and for the other provisions of the agreement with the district board.\n(d) All unspent revenue shall be carried over to following years for the sole use of the site.\nExcept as outlined in this section, site-governed schools established under this section are exempt from and subject to the same laws and rules as are chartered schools under chapter 124E, except that the schools shall be subject to chapters 13, 13D, and 179A, and sections 122A.40, 122A.41, 122A.50, and 122A.51.\n(a) The school board and the site council shall include in the agreement performance standards and expectations that shall include at least the following:\n(1) student achievement targets on multiple indicators including either a growth model or value-added growth model;\n(2) the criteria and process to be followed if it is determined that the site failed to comply with district oversight and accountability requirements as outlined in the agreement; and\n(3) other performance provisions as agreed to.\n(b) All agreements shall be filed with the commissioner. The initial agreement shall be for up to three years, shall be reviewed annually, and may be renewed by the district board for additional terms of up to five years based on the performance of the school.\n(a) The district board may terminate the agreement for one or more of the following reasons:\n(1) failure of the site to meet the provisions specified in the agreement in subdivision 5;\n(2) violations of law; or\n(3) other good cause shown.\n(b) Site-governed schools that are terminated or not renewed for reasons other than cause may request to convert to charter school status as provided for in chapter 124E and, if chartered by the board, shall become the owner of all materials, supplies, and equipment purchased during the period the school was a site-governed school.",
	"repealed": false
}