{
	"id": "115B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.30",
	"title": "115B.30 ELIGIBLE INJURY AND DAMAGE.",
	"text": "(a) A personal injury which could reasonably have resulted from exposure to a harmful substance released from a facility where it was placed or came to be located is eligible for compensation from the fund if:\n(1) it is a medically verified chronic or progressive disease, illness, or disability such as cancer, organic nervous system disorders, or physical deformities, including malfunctions in reproduction, in humans or their offspring, or death; or\n(2) it is a medically verified acute disease or condition that typically manifests itself rapidly after a single exposure or limited exposures and the persons responsible for the release of the harmful substance are unknown or cannot with reasonable diligence be determined or located or a judgment would not be satisfied in whole or in part against the persons determined to be responsible for the release of the harmful substance.\n(b) A personal injury is not compensable from the account if:\n(1) the injury is compensable under the workers' compensation law, chapter 176;\n(2) the injury arises out of the claimant's use of a consumer product;\n(3) the injury arises out of an exposure that occurred or is occurring outside the geographical boundaries of the state;\n(4) the injury results from the release of a harmful substance for which the claimant is a responsible person; or\n(5) the injury is an acute disease or condition other than one described in paragraph (a).\nDamage to real property in Minnesota owned by the claimant is eligible for compensation from the fund if the damage results from the presence in or on the property of a harmful substance released from a facility where it was placed or came to be located. Damage to property is not eligible for compensation from the fund if it results from the release of a harmful substance for which the claimant is a responsible person.\n(a) A claim is not eligible for compensation from the fund unless it is filed with the agency within the time provided in this subdivision.\n(b) A claim for compensation for personal injury must be filed within two years after the injury and its connection to exposure to a harmful substance was or reasonably should have been discovered.\n(c) A claim for compensation for property damage must be filed within two years after the full amount of compensable losses can be determined.\n(d) Notwithstanding the provisions of this subdivision, claims for compensation that would otherwise be barred by any statute of limitations provided in sections 115B.25 to 115B.37 may be filed not later than January 1, 1992.",
	"repealed": false
}