{
	"id": "123A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.30",
	"title": "123A.30 AGREEMENTS FOR SECONDARY EDUCATION.",
	"text": "The provisions of this section shall apply to a district with fewer than 375 pupils enrolled in grades 7 to 12.\nThe board may enter into one or more agreements providing for instruction of its secondary pupils in one or more districts. The agreement must be effective on July 1 and shall be for a specified or indefinite number of years. The agreement must set forth the obligations of transportation, the tuition to be paid to the providing district, and all additional charges and fees to be paid to the providing district. The amount of tuition shall not be subject to the provisions of section 123A.488, subdivision 2. The agreement may provide for negotiation of a plan for the assignment or employment in a providing district as an exchange teacher according to section 122A.54, or placement on unrequested leave of absence of teachers whose positions are discontinued as a result of the agreement.\nBefore entering into agreements permitted by subdivision 2, the board must hold a public hearing. The board must publish notice of the hearing in the newspaper with the largest circulation in the district. If the board proposes to enter into agreements with two or more districts, the board may conduct separate or consolidated hearings.\nAfter the hearing required by subdivision 3 and before entering into an agreement, the board must submit the agreement to the commissioner for review and comment.\nA district entering into an agreement permitted in subdivision 2 must continue to count its resident pupils who are educated in other districts as resident pupils in the calculation of pupil units for the purposes of state aids, levy limitations, and any other purpose. A district may continue to provide transportation and collect transportation aid for its resident pupils. For purposes of aid calculations, the commissioner may adjust the cost per eligible pupil transported to reflect changes in cost resulting from the agreement, if any.\nA district must pay severance pay to a teacher who is placed on unrequested leave of absence by the district as a result of the agreement. A teacher is eligible under this subdivision if the teacher:\n(1) is a teacher, but not a superintendent;\n(2) has a continuing contract with the district according to section 122A.40, subdivision 7.\nThe amount of severance pay must be equal to the teacher's salary for the school year during which the teacher was placed on unrequested leave of absence minus the gross amount the teacher was paid during the 12 months following the teacher's termination of salary, by an entity whose teachers by statute or rule must possess a valid Minnesota teaching license, and minus the amount a teacher receives as severance or other similar pay according to a contract with the district or district policy. These entities requiring a valid Minnesota teaching license include, but are not limited to, the district that placed the teacher on unrequested leave of absence, another district in Minnesota, an education district, an intermediate school district, a service cooperative, a board formed under section 471.59, a state residential academy, the Perpich Center for Arts Education, a vocational center, or a special education cooperative. These entities do not include a district in another state, a Minnesota public postsecondary institution, or a state agency. Only amounts earned by the teacher as a substitute teacher or in a position requiring a valid Minnesota teaching license shall be subtracted. A teacher may decline any offer of employment as a teacher without loss of rights to severance pay.\nTo determine the amount of severance pay that is due for the first six months following termination of the teacher's salary, the district may require the teacher to provide documented evidence of the teacher's employers and gross earnings during that period. The district must pay the teacher the amount of severance pay it determines to be due from the proceeds of the levy for this purpose. To determine the amount of severance pay that is due for the second six months of the 12 months following the termination of the teacher's salary, the district may require the teacher to provide documented evidence of the teacher's employers and gross earnings during that period. The district must pay the teacher the amount of severance pay it determines to be due from the proceeds of the levy for this purpose.\nA teacher who receives severance pay under this subdivision waives all further reinstatement rights under section 122A.40, subdivision 10 or 11. If the teacher receives severance pay, the teacher shall not receive credit for any years of service in the district paying severance pay prior to the year in which the teacher becomes eligible to receive severance pay.\nThe severance pay is subject to section 465.72. The district may levy annually according to section 126C.43, for the severance pay.",
	"repealed": false
}