{
	"id": "256B.0624",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0624",
	"title": "256B.0624 CRISIS RESPONSE SERVICES COVERED.",
	"text": "(a) Subject to federal approval, medical assistance covers medically necessary crisis response services when the services are provided according to the standards in this section.\n(b) Subject to federal approval, medical assistance covers medically necessary residential crisis stabilization for adults when the services are provided by an entity licensed under and meeting the standards in section 245I.23 or an entity with an adult foster care license meeting the standards in this section.\n(c) The provider entity must make reasonable and good faith efforts to report individual client outcomes to the commissioner using instruments and protocols approved by the commissioner.\nFor purposes of this section, the following terms have the meanings given them.\n(a) \"Certified rehabilitation specialist\" means a staff person who is qualified under section 245I.04, subdivision 8.\n(b) \"Clinical trainee\" means a staff person who is qualified under section 245I.04, subdivision 6.\n(c) \"Crisis assessment\" means an immediate face-to-face assessment by a physician, a mental health professional, or a qualified member of a crisis team, as described in subdivision 6a.\n(d) \"Crisis intervention\" means face-to-face, short-term intensive mental health services initiated during a mental health crisis to help the recipient cope with immediate stressors, identify and utilize available resources and strengths, engage in voluntary treatment, and begin to return to the recipient's baseline level of functioning.\n(e) \"Crisis screening\" means a screening of a client's potential mental health crisis situation under subdivision 6.\n(f) \"Crisis stabilization\" means individualized mental health services provided to a recipient that are designed to restore the recipient to the recipient's prior functional level. Crisis stabilization services may be provided in the recipient's home, the home of a family member or friend of the recipient, another community setting, a short-term supervised, licensed residential program, or an emergency department. Crisis stabilization services includes family psychoeducation.\n(g) \"Crisis team\" means the staff of a provider entity who are supervised and prepared to provide mobile crisis services to a client in a potential mental health crisis situation.\n(h) \"Mental health certified family peer specialist\" means a staff person who is qualified under section 245I.04, subdivision 12.\n(i) \"Mental health certified peer specialist\" means a staff person who is qualified under section 245I.04, subdivision 10.\n(j) \"Mental health crisis\" is a behavioral, emotional, or psychiatric situation that, without the provision of crisis response services, would likely result in significantly reducing the recipient's levels of functioning in primary activities of daily living, in an emergency situation under section 62Q.55, or in the placement of the recipient in a more restrictive setting, including but not limited to inpatient hospitalization.\n(k) \"Mental health practitioner\" means a staff person who is qualified under section 245I.04, subdivision 4.\n(l) \"Mental health professional\" means a staff person who is qualified under section 245I.04, subdivision 2.\n(m) \"Mental health rehabilitation worker\" means a staff person who is qualified under section 245I.04, subdivision 14.\n(n) \"Mobile crisis services\" means screening, assessment, intervention, and community-based stabilization, excluding residential crisis stabilization, that is provided to a recipient.\n(a) A recipient is eligible for crisis assessment services when the recipient has screened positive for a potential mental health crisis during a crisis screening.\n(b) A recipient is eligible for crisis intervention services and crisis stabilization services when the recipient has been assessed during a crisis assessment to be experiencing a mental health crisis.\n(a) A mobile crisis provider must be:\n(1) a county board operated entity;\n(2) an Indian health services facility or facility owned and operated by a tribe or Tribal organization operating under United States Code, title 325, section 450f; or\n(3) a provider entity that is under contract with the county board in the county where the potential crisis or emergency is occurring. To provide services under this section, the provider entity must directly provide the services; or if services are subcontracted, the provider entity must maintain responsibility for services and billing.\n(b) A mobile crisis provider must meet the following standards:\n(1) ensure that crisis screenings, crisis assessments, and crisis intervention services are available to a recipient 24 hours a day, seven days a week;\n(2) be able to respond to a call for services in a designated service area or according to a written agreement with the local mental health authority for an adjacent area;\n(3) have at least one mental health professional on staff at all times and at least one additional staff member capable of leading a crisis response in the community; and\n(4) provide the commissioner with information about the number of requests for service, the number of people that the provider serves face-to-face, outcomes, and the protocols that the provider uses when deciding when to respond in the community.\n(c) A provider entity that provides crisis stabilization services in a residential setting under subdivision 7 is not required to meet the requirements of paragraphs (a) and (b), but must meet all other requirements of this subdivision.\n(d) A crisis services provider must have the capacity to meet and carry out the standards in section 245I.011, subdivision 5, and the following standards:\n(1) ensures that staff persons provide support for a recipient's family and natural supports, by enabling the recipient's family and natural supports to observe and participate in the recipient's treatment, assessments, and planning services;\n(2) has adequate administrative ability to ensure availability of services;\n(3) is able to ensure that staff providing these services are skilled in the delivery of mental health crisis response services to recipients;\n(4) is able to ensure that staff are implementing culturally specific treatment identified in the crisis treatment plan that is meaningful and appropriate as determined by the recipient's culture, beliefs, values, and language;\n(5) is able to ensure enough flexibility to respond to the changing intervention and care needs of a recipient as identified by the recipient or family member during the service partnership between the recipient and providers;\n(6) is able to ensure that staff have the communication tools and procedures to communicate and consult promptly about crisis assessment and interventions as services occur;\n(7) is able to coordinate these services with county emergency services, community hospitals, ambulance, transportation services, social services, law enforcement, engagement services, and mental health crisis services through regularly scheduled interagency meetings;\n(8) is able to ensure that services are coordinated with other behavioral health service providers, county mental health authorities, or federally recognized American Indian authorities and others as necessary, with the consent of the recipient or parent or guardian. Services must also be coordinated with the recipient's case manager if the recipient is receiving case management services;\n(9) is able to ensure that crisis intervention services are provided in a manner consistent with sections 245.461 to 245.486 and 245.487 to 245.4879;\n(10) is able to coordinate detoxification services for the recipient according to Minnesota Rules, parts 9530.6605 to 9530.6655, or withdrawal management according to chapter 245F;\n(11) is able to establish and maintain a quality assurance and evaluation plan to evaluate the outcomes of services and recipient satisfaction; and\n(12) is an enrolled medical assistance provider.\nIf a county or Tribe demonstrates that, due to geographic or other barriers, it is not feasible to provide mobile crisis intervention services according to the standards in subdivision 4, paragraph (b), the commissioner may approve an alternative plan proposed by a county or Tribe. The alternative plan must:\n(1) result in increased access and a reduction in disparities in the availability of mobile crisis services;\n(2) provide mobile crisis services outside of the usual nine-to-five office hours and on weekends and holidays; and\n(3) comply with standards for emergency mental health services in section 245.469.\n(a) Qualified individual staff of a qualified provider entity must provide crisis assessment and intervention services to a recipient. A staff member providing crisis assessment and intervention services to a recipient must be qualified as a:\n(1) mental health professional;\n(2) clinical trainee;\n(3) mental health practitioner;\n(4) mental health certified family peer specialist; or\n(5) mental health certified peer specialist.\n(b) When crisis assessment and intervention services are provided to a recipient in the community, a mental health professional, clinical trainee, or mental health practitioner must lead the response.\n(c) The 30 hours of ongoing training required by section 245I.05, subdivision 4, paragraph (b), must be specific to providing crisis services to children and adults and include training about evidence-based practices identified by the commissioner of health to reduce the recipient's risk of suicide and self-injurious behavior.\n(d) At least six hours of the ongoing training under paragraph (c) must be specific to working with families and providing crisis stabilization services to children and include the following topics:\n(1) developmental tasks of childhood and adolescence;\n(2) family relationships;\n(3) child and youth engagement and motivation, including motivational interviewing;\n(4) culturally responsive care, including care for lesbian, gay, bisexual, transgender, and queer youth;\n(5) positive behavior support;\n(6) crisis intervention for youth with developmental disabilities;\n(7) child traumatic stress, trauma-informed care, and trauma-focused cognitive behavioral therapy; and\n(8) youth substance use.\n(e) Team members must be experienced in crisis assessment, crisis intervention techniques, treatment engagement strategies, working with families, and clinical decision-making under emergency conditions and have knowledge of local services and resources.\n(a) The crisis screening may use the resources of emergency services as defined in section 245.469, subdivisions 1 and 2. The crisis screening must gather information, determine whether a mental health crisis situation exists, identify parties involved, and determine an appropriate response.\n(b) When conducting the crisis screening of a recipient, a provider must:\n(1) employ evidence-based practices to reduce the recipient's risk of suicide and self-injurious behavior;\n(2) work with the recipient to establish a plan and time frame for responding to the recipient's mental health crisis, including responding to the recipient's immediate need for support by telephone or text message until the provider can respond to the recipient face-to-face;\n(3) document significant factors in determining whether the recipient is experiencing a mental health crisis, including prior requests for crisis services, a recipient's recent presentation at an emergency department, known calls to 911 or law enforcement, or information from third parties with knowledge of a recipient's history or current needs;\n(4) accept calls from interested third parties and consider the additional needs or potential mental health crises that the third parties may be experiencing;\n(5) provide psychoeducation, including means reduction, to relevant third parties including family members or other persons living with the recipient; and\n(6) consider other available services to determine which service intervention would best address the recipient's needs and circumstances.\n(c) For the purposes of this section, the following situations indicate a positive screen for a potential mental health crisis and the provider must prioritize providing a face-to-face crisis assessment of the recipient, unless a provider documents specific evidence to show why this was not possible, including insufficient staffing resources, concerns for staff or recipient safety, or other clinical factors:\n(1) the recipient presents at an emergency department or urgent care setting and the health care team at that location requested crisis services; or\n(2) a peace officer requested crisis services for a recipient who is potentially subject to transportation under section 253B.051.\n(d) A provider is not required to have direct contact with the recipient to determine that the recipient is experiencing a potential mental health crisis. A mobile crisis provider may gather relevant information about the recipient from a third party to establish the recipient's need for services and potential safety factors.\n(a) If a recipient screens positive for a potential mental health crisis, a crisis assessment must be completed. A crisis assessment evaluates any immediate needs for which services are needed and, as time permits, the recipient's current life situation, health information, including current medications, sources of stress, mental health problems and symptoms, strengths, cultural considerations, support network, vulnerabilities, current functioning, and the recipient's preferences as communicated directly by the recipient, or as communicated in a health care directive as described in chapters 145C and 253B, the crisis treatment plan described under subdivision 11, a crisis prevention plan, or a wellness recovery action plan.\n(b) A provider must conduct a crisis assessment at the recipient's location whenever possible.\n(c) Whenever possible, the assessor must attempt to include input from the recipient and the recipient's family and other natural supports to assess whether a crisis exists.\n(d) A crisis assessment includes: (1) determining (i) whether the recipient is willing to voluntarily engage in treatment, or (ii) whether the recipient has an advance directive, and (2) gathering the recipient's information and history from involved family or other natural supports.\n(e) A crisis assessment must include coordinated response with other health care providers if the assessment indicates that a recipient needs detoxification, withdrawal management, or medical stabilization in addition to crisis response services. If the recipient does not need an acute level of care, a team must serve an otherwise eligible recipient who has a co-occurring substance use disorder.\n(f) If, after completing a crisis assessment of a recipient, a provider refers a recipient to an intensive setting, including an emergency department, inpatient hospitalization, or residential crisis stabilization, one of the crisis team members who completed or conferred about the recipient's crisis assessment must immediately contact the referral entity and consult with the triage nurse or other staff responsible for intake at the referral entity. During the consultation, the crisis team member must convey key findings or concerns that led to the recipient's referral. Following the immediate consultation, the provider must also send written documentation upon completion. The provider must document if these releases occurred with authorization by the recipient, the recipient's legal guardian, or as allowed by section 144.293, subdivision 5.\n(a) If the crisis assessment determines mobile crisis intervention services are needed, the crisis intervention services must be provided promptly. As opportunity presents during the intervention, at least two members of the mobile crisis intervention team must confer directly or by telephone about the crisis assessment, crisis treatment plan, and actions taken and needed. At least one of the team members must be providing face-to-face crisis intervention services. If providing crisis intervention services, a clinical trainee or mental health practitioner must seek treatment supervision as required in subdivision 9.\n(b) If a provider delivers crisis intervention services while the recipient is absent, the provider must document the reason for delivering services while the recipient is absent.\n(c) The mobile crisis intervention team must develop a crisis treatment plan according to subdivision 11.\n(d) The mobile crisis intervention team must document which crisis treatment plan goals and objectives have been met and when no further crisis intervention services are required.\n(e) If the recipient's mental health crisis is stabilized, but the recipient needs a referral to other services, the team must provide referrals to these services. If the recipient has a case manager, planning for other services must be coordinated with the case manager. If the recipient is unable to follow up on the referral, the team must link the recipient to the service and follow up to ensure the recipient is receiving the service.\n(f) If the recipient's mental health crisis is stabilized and the recipient does not have an advance directive, the case manager or crisis team shall offer to work with the recipient to develop one.\n(a) Crisis stabilization services must be provided by qualified staff of a crisis stabilization services provider entity and must meet the following standards:\n(1) a crisis treatment plan must be developed that meets the criteria in subdivision 11;\n(2) staff must be qualified as defined in subdivision 8;\n(3) crisis stabilization services must be delivered according to the crisis treatment plan and include face-to-face contact with the recipient by qualified staff for further assessment, help with referrals, updating of the crisis treatment plan, skills training, and collaboration with other service providers in the community; and\n(4) if a provider delivers crisis stabilization services while the recipient is absent, the provider must document the reason for delivering services while the recipient is absent.\n(b) If crisis stabilization services are provided in a supervised, licensed residential setting that serves no more than four adult residents, and one or more individuals are present at the setting to receive residential crisis stabilization, the residential staff must include, for at least eight hours per day, at least one mental health professional, clinical trainee, certified rehabilitation specialist, or mental health practitioner. The commissioner shall establish a statewide per diem rate for crisis stabilization services provided under this paragraph to medical assistance enrollees. The rate for a provider shall not exceed the rate charged by that provider for the same service to other payers. Payment shall not be made to more than one entity for each individual for services provided under this paragraph on a given day. The commissioner shall set rates prospectively for the annual rate period. The commissioner shall require providers to submit annual cost reports on a uniform cost reporting form and shall use submitted cost reports to inform the rate-setting process. The commissioner shall recalculate the statewide per diem every year.\n(a) Mental health crisis stabilization services must be provided by qualified individual staff of a qualified provider entity. A staff member providing crisis stabilization services to a recipient must be qualified as a:\n(1) mental health professional;\n(2) certified rehabilitation specialist;\n(3) clinical trainee;\n(4) mental health practitioner;\n(5) mental health certified family peer specialist;\n(6) mental health certified peer specialist; or\n(7) mental health rehabilitation worker.\n(b) The 30 hours of ongoing training required in section 245I.05, subdivision 4, paragraph (b), must be specific to providing crisis services to children and adults and include training about evidence-based practices identified by the commissioner of health to reduce a recipient's risk of suicide and self-injurious behavior.\n(c) For providers who deliver care to children 21 years of age and younger, at least six hours of the ongoing training under this subdivision must be specific to working with families and providing crisis stabilization services to children and include the following topics:\n(1) developmental tasks of childhood and adolescence;\n(2) family relationships;\n(3) child and youth engagement and motivation, including motivational interviewing;\n(4) culturally responsive care, including care for lesbian, gay, bisexual, transgender, and queer youth;\n(5) positive behavior support;\n(6) crisis intervention for youth with developmental disabilities;\n(7) child traumatic stress, trauma-informed care, and trauma-focused cognitive behavioral therapy; and\n(8) youth substance use.\nThis paragraph does not apply to adult residential crisis stabilization service providers licensed according to section 245I.23.\nClinical trainees and mental health practitioners may provide crisis assessment and crisis intervention services if the following treatment supervision requirements are met:\n(1) the mental health provider entity must accept full responsibility for the services provided;\n(2) the mental health professional of the provider entity must be immediately available by phone or in person for treatment supervision;\n(3) the mental health professional is consulted, in person or by phone, during the first three hours when a clinical trainee or mental health practitioner provides crisis assessment or crisis intervention services; and\n(4) the mental health professional must:\n(i) review and approve, as defined in section 245I.02, subdivision 2, of the tentative crisis assessment and crisis treatment plan within 24 hours of first providing services to the recipient, notwithstanding section 245I.08, subdivision 3; and\n(ii) document the consultation required in clause (3).\nMS 2020 [Repealed, 2021 c 30 art 16 s 4]\n(a) Within 24 hours of the recipient's admission, the provider entity must complete the recipient's crisis treatment plan. The provider entity must:\n(1) base the recipient's crisis treatment plan on the recipient's crisis assessment;\n(2) consider crisis assistance strategies that have been effective for the recipient in the past;\n(3) for a child recipient, use a child-centered, family-driven, and culturally appropriate planning process that allows the recipient's parents and guardians to observe or participate in the recipient's individual and family treatment services, assessment, and treatment planning;\n(4) for an adult recipient, use a person-centered, culturally appropriate planning process that allows the recipient's family and other natural supports to observe or participate in treatment services, assessment, and treatment planning;\n(5) identify the participants involved in the recipient's treatment planning. The recipient, if possible, must be a participant;\n(6) identify the recipient's initial treatment goals, measurable treatment objectives, and specific interventions that the license holder will use to help the recipient engage in treatment;\n(7) include documentation of referral to and scheduling of services, including specific providers where applicable;\n(8) ensure that the recipient or the recipient's legal guardian approves under section 245I.02, subdivision 2, of the recipient's crisis treatment plan unless a court orders the recipient's treatment plan under chapter 253B. If the recipient or the recipient's legal guardian disagrees with the crisis treatment plan, the license holder must document in the client file the reasons why the recipient disagrees with the crisis treatment plan; and\n(9) ensure that a treatment supervisor approves under section 245I.02, subdivision 2, of the recipient's treatment plan within 24 hours of the recipient's admission if a mental health practitioner or clinical trainee completes the crisis treatment plan, notwithstanding section 245I.08, subdivision 3.\n(b) The provider entity must provide the recipient and the recipient's legal guardian with a copy of the recipient's crisis treatment plan.\nThe following services are excluded from reimbursement under this section:\n(1) room and board services;\n(2) services delivered to a recipient while admitted to an inpatient hospital;\n(3) recipient transportation costs may be covered under other medical assistance provisions, but transportation services are not an adult mental health crisis response service;\n(4) services provided and billed by a provider who is not enrolled under medical assistance to provide adult mental health crisis response services;\n(5) services performed by volunteers;\n(6) direct billing of time spent \"on call\" when not delivering services to a recipient;\n(7) provider service time included in case management reimbursement. When a provider is eligible to provide more than one type of medical assistance service, the recipient must have a choice of provider for each service, unless otherwise provided for by law;\n(8) outreach services to potential recipients;\n(9) a mental health service that is not medically necessary;\n(10) services that a residential treatment center licensed under Minnesota Rules, chapter 2960, provides to a client;\n(11) partial hospitalization or day treatment; and\n(12) a crisis assessment that a residential provider completes when a daily rate is paid for the recipient's crisis stabilization.",
	"repealed": false
}