{
	"id": "116C.7792",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.7792",
	"title": "116C.7792 SOLAR ENERGY PRODUCTION INCENTIVE PROGRAM.",
	"text": "(a) The utility subject to section 116C.779 shall operate a program to provide solar energy production incentives for solar energy systems of no more than a total aggregate nameplate capacity of 40 kilowatts alternating current per premise. The owner of a solar energy system installed before June 1, 2018, is eligible to receive a production incentive under this section for any additional solar energy systems constructed at the same customer location, provided that the aggregate capacity of all systems at the customer location does not exceed 40 kilowatts.\n(b) The program is funded by money withheld from transfer to the renewable development account under section 116C.779, subdivision 1, paragraphs (b) and (e). Program funds must be placed in a separate account for the purpose of the solar energy production incentive program operated by the utility and not for any other program or purpose.\n(c) Funds allocated to the solar energy production incentive program in 2019 and 2020 remain available to the solar energy production incentive program.\n(d) The following amounts are allocated to the solar energy production incentive program:\n(1) $10,000,000 in 2021;\n(2) $10,000,000 in 2022;\n(3) $5,000,000 in 2023;\n(4) $11,250,000 in 2024;\n(5) $6,250,000 in 2025; and\n(6) $5,000,000 each year, beginning in 2026 through 2035.\n(e) Notwithstanding the Department of Commerce's November 14, 2018, decision in Docket No. E002/M-13-1015 regarding operation of the utility's solar energy production incentive program, half of the amounts allocated each year under paragraph (d), clauses (3), (4), and (5), must be reserved for solar energy systems whose installation meets the eligibility standards for the low-income program established in the November 14, 2018, decision or successor decisions of the department. All other program operations of the solar energy production incentive program are governed by the provisions of the November 14, 2018, decision or successor decisions of the department.\n(f) Funds allocated to the solar energy production incentive program that have not been committed to a specific project at the end of a program year remain available to the solar energy production incentive program.\n(g) Any unspent amount remaining on January 1, 2028, must be transferred to the renewable development account.\n(h) A solar energy system receiving a production incentive under this section must be sized to less than 120 percent of the customer's on-site annual energy consumption when combined with other distributed generation resources and subscriptions provided under section 216B.1641 associated with the premise. The production incentive must be paid for ten years commencing with the commissioning of the system.\n(i) The utility must file a plan to operate the program with the commissioner of commerce. The utility may not operate the program until it is approved by the commissioner. A change to the program to include projects up to a nameplate capacity of 40 kilowatts or less does not require the utility to file a plan with the commissioner. Any plan approved by the commissioner of commerce must not provide an increased incentive scale over prior years unless the commissioner demonstrates that changes in the market for solar energy facilities require an increase.",
	"repealed": false
}