{
	"id": "161.142",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.142",
	"title": "161.142 GREAT RIVER ROAD.",
	"text": "MS 1961 [Repealed, 1963 c 875 s 3]\nThe commissioner of transportation shall establish and locate the route or routes of the Great River Road and shall thereafter construct, reconstruct, improve and may maintain same. The commissioner may acquire by purchase, gift or eminent domain proceedings, in fee or such lesser estate as the commissioner may determine, all lands and properties needed in laying out, establishing, constructing, reconstructing, and improving the Great River Road in Minnesota.\nThe portion of the Great River Road in Minnesota may be part of the state trunk highway system and may be a controlled-access highway.\nThe commissioner of transportation may accept any federal funds made available to the state of Minnesota for expenditure on the Great River Road. The commissioner may cooperate with the federal government or any federal agency in the establishment, construction, reconstruction and improvement of the Great River Road to the end that the state will obtain all federal funds available for expenditure on the Great River Road in Minnesota. The commissioner may act as agent for any other department of state, public corporation, or political subdivision of the state in accepting federal aid in their behalf for the purposes expressed in subdivisions 2 to 7, and may distribute any federal aid received by the department to other departments of the state, public corporations or political subdivisions of the state.\nThe commissioner of transportation shall cooperate with other state departments, public corporations and political subdivisions in laying out, constructing, reconstructing and improving and maintaining the Great River Road.\nNone of the provisions of subdivisions 2 to 7 shall be construed as authorizing the commissioner of transportation to expend trunk highway funds for nontrunk highway purposes.\nThe commissioner of transportation and any political subdivision or public corporation adjacent to the Great River Road or through which the Great River Road passes may acquire by purchase, gift or eminent domain proceedings as provided by law any lands or properties, or interests in lands and properties, lying along the Great River Road as they deem necessary for the purpose of preserving areas of natural scenic beauty, views of lake or riverside areas, historic sites, and such lands as they deem necessary for the purpose of providing recreational and rest areas and facilities in connection therewith including camping and overnight facilities. They may enter into agreements with property owners along the Great River Road providing for restrictions on land uses along such road and providing for compensation therefor. Such agreements may provide that the lands or properties may continue to be used for agricultural, horticultural, forest, grazing, residential, or other purposes not inconsistent with parkway principles and standards approved by the federal government and the Mississippi River Parkway Commission.",
	"repealed": false
}