{
	"id": "148.941",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.941",
	"title": "148.941 DISCIPLINARY ACTION; INVESTIGATION; PENALTY FOR VIOLATION.",
	"text": "Except as otherwise described in this section, all hearings shall be conducted under chapter 14.\n(a) The board may impose disciplinary action as described in paragraph (b) against an applicant or licensee whom the board, by a preponderance of the evidence, determines:\n(1) has violated a statute, rule, or order that the board issued or is empowered to enforce;\n(2) has engaged in fraudulent, deceptive, or dishonest conduct, whether or not the conduct relates to the practice of psychology, that adversely affects the person's ability or fitness to practice psychology;\n(3) has engaged in unprofessional conduct or any other conduct which has the potential for causing harm to the public, including any departure from or failure to conform to the minimum standards of acceptable and prevailing practice without actual injury having to be established;\n(4) has been convicted of or has pled guilty or nolo contendere to a felony or other crime, an element of which is dishonesty or fraud, or has been shown to have engaged in acts or practices tending to show that the applicant or licensee is incompetent or has engaged in conduct reflecting adversely on the applicant's or licensee's ability or fitness to engage in the practice of psychology;\n(5) has employed fraud or deception in obtaining or renewing a license, in requesting approval of continuing education activities, or in passing an examination;\n(6) has had a license, certificate, charter, registration, privilege to take an examination, or other similar authority denied, revoked, suspended, canceled, limited, reprimanded, or otherwise disciplined, or not renewed for cause in any jurisdiction; or has surrendered or voluntarily terminated a license or certificate during a board investigation of a complaint, as part of a disciplinary order, or while under a disciplinary order;\n(7) has been subject to a corrective action or similar action in another jurisdiction or by another regulatory authority;\n(8) has failed to meet any requirement for the issuance or renewal of the person's license. The burden of proof is on the applicant or licensee to demonstrate the qualifications or satisfy the requirements for a license under the Psychology Practice Act;\n(9) has failed to cooperate with an investigation of the board as required under subdivision 4;\n(10) has demonstrated an inability to practice psychology with reasonable skill and safety to clients due to any mental or physical illness or condition; or\n(11) has engaged in fee splitting. This clause does not apply to the distribution of revenues from a partnership, group practice, nonprofit corporation, or professional corporation to its partners, shareholders, members, or employees if the revenues consist only of fees for services performed by the licensee or under a licensee's administrative authority. This clause also does not apply to the charging of a general membership fee by a licensee or applicant to health care providers, as defined in sections 144.291 to 144.298, for participation in a referral service, provided that the licensee or applicant discloses in advance to each referred client the financial nature of the referral arrangement. Fee splitting includes, but is not limited to:\n(i) paying, offering to pay, receiving, or agreeing to receive a commission, rebate, or remuneration, directly or indirectly, primarily for the referral of clients;\n(ii) dividing client fees with another individual or entity, unless the division is in proportion to the services provided and the responsibility assumed by each party;\n(iii) referring an individual or entity to any health care provider, as defined in sections 144.291 to 144.298, or for other professional or technical services in which the referring licensee or applicant has a significant financial interest unless the licensee has disclosed the financial interest in advance to the client; and\n(iv) dispensing for profit or recommending any instrument, test, procedure, or device that for commercial purposes the licensee or applicant has developed or distributed, unless the licensee or applicant has disclosed any profit interest in advance to the client.\n(b) If grounds for disciplinary action exist under paragraph (a), the board may take one or more of the following actions:\n(1) refuse to grant or renew a license;\n(2) revoke a license;\n(3) suspend a license;\n(4) impose limitations or conditions on a licensee's practice of psychology, including, but not limited to, limiting the scope of practice to designated competencies, imposing retraining or rehabilitation requirements, requiring the licensee to practice under supervision, or conditioning continued practice on the demonstration of knowledge or skill by appropriate examination or other review of skill and competence;\n(5) censure or reprimand the licensee;\n(6) refuse to permit an applicant to take the licensure examination or refuse to release an applicant's examination grade if the board finds that it is in the public interest; or\n(7) impose a civil penalty not exceeding $7,500 for each separate violation. The amount of the penalty shall be fixed so as to deprive the applicant or licensee of any economic advantage gained by reason of the violation charged, to discourage repeated violations, or to recover the board's costs that occur in bringing about a disciplinary order. For purposes of this clause, costs are limited to legal, paralegal, and investigative charges billed to the board by the Attorney General's Office, witness costs, consultant and expert witness fees, and charges attendant to the use of an administrative law judge.\n(c) In lieu of or in addition to paragraph (b), the board may require, as a condition of licensure, termination of suspension, reinstatement of license, examination, or release of examination grades, that the applicant or licensee:\n(1) submit to a quality review, as specified by the board, of the applicant's or licensee's ability, skills, or quality of work;\n(2) complete to the satisfaction of the board educational courses specified by the board; and\n(3) reimburse to the board all costs incurred by the board that are the result of a provider failing, neglecting, or refusing to fully comply, or not complying in a timely manner, with any part of the remedy section of a stipulation and consent order or the corrective action section of an agreement for corrective action. For purposes of this clause, costs are limited to legal, paralegal, and investigative charges billed to the board by the Attorney General's Office, witness costs, consultant and expert witness fees, and charges attendant to the use of an administrative law judge.\n(d) Service of the order is effective if the order is served on the applicant, licensee, or counsel of record personally or by mail to the most recent address provided to the board for the licensee, applicant, or counsel of record. The order shall state the reasons for the entry of the order.\n(a) In addition to any other remedy provided by law, the board may temporarily suspend the credentials of a licensee after conducting a preliminary inquiry to determine if the board reasonably believes that the licensee has violated a statute or rule that the board is empowered to enforce and continued practice by the licensee would create an imminent risk of harm to others.\n(b) The order may prohibit the licensee from engaging in the practice of psychology in whole or in part and may condition the end of a suspension on the licensee's compliance with a statute, rule, or order that the board has issued or is empowered to enforce.\n(c) The order shall give notice of the right to a hearing pursuant to this subdivision and shall state the reasons for the entry of the order.\n(d) Service of the order is effective when the order is served on the licensee personally or by certified mail which is complete upon receipt, refusal, or return for nondelivery to the most recent address provided to the board for the licensee.\n(e) At the time the board issues a temporary suspension order, the board shall schedule a hearing to be held before its own members which shall begin no later than 60 days after issuance of the temporary suspension order or within 15 working days of the date of the board's receipt of a request for hearing by a licensee on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. This hearing is not subject to chapter 14. Evidence presented by the board or the licensee shall be in affidavit form only. The licensee or counsel of record may appear for oral argument.\n(f) Within five working days of the hearing, the board shall issue its order and, if the suspension is continued, schedule a contested case hearing within 30 days of the issuance of the order. Notwithstanding chapter 14, the administrative law judge shall issue a report within 30 days after closing the contested case hearing record. The board shall issue a final order within 30 days of receipt of the administrative law judge's report.\n(a) An applicant or licensee of the board who is the subject of an investigation or who is questioned in connection with an investigation by or on behalf of the board shall cooperate fully with the investigation. Cooperation includes responding fully and promptly to any question raised by or on behalf of the board relating to the subject of the investigation, executing all releases requested by the board, providing copies of client records, as reasonably requested by the board to assist it in its investigation, and appearing at conferences or hearings scheduled by the board or its staff.\n(b) If the board does not have a written consent from a client permitting access to the client's records, the licensee may delete any data in the record which identify the client before providing it to the board. The board shall maintain any records obtained pursuant to this section as investigative data pursuant to chapter 13.\nIn a proceeding for the suspension or revocation of a license or other disciplinary action for unethical or unprofessional conduct involving sexual contact with a client or former client, the board or administrative law judge shall not consider evidence of the client's previous sexual conduct nor shall any reference to this conduct be made during the proceedings or in the findings, except by motion of the client, unless the evidence would be admissible under applicable provisions of section 609.347, subdivision 3.\nPersons who engage in the unlicensed practice of psychology or who misrepresent themselves as psychologists or psychological practitioners are guilty of a gross misdemeanor.\n(a) For complaints against providers received by the board after July 31, 2001, a board proceeding against a provider must not be instituted unless it is begun within seven years from the date of some portion of the alleged misconduct that is complained of.\n(b) The following are exceptions to the limitation period in paragraph (a):\n(1) complaints alleging a violation of subdivision 2, paragraph (a), clauses (2), (4), (5), and (6);\n(2) complaints alleging sexual intercourse or other physical intimacies with a client, or any verbal or physical behavior that is sexually seductive or sexually demeaning to the client; or complaints alleging sexual intercourse or other physical intimacies with a former client, or any verbal or physical behavior that is sexually demeaning to the former client, for a period of two years following the date of the last professional contact with the former client, whether or not the provider has formally terminated the professional relationship. Physical intimacies include handling of the breasts, genital areas, buttocks, or thighs of either sex by either the provider or the client.\n(c) If a complaint is received by the board less than 12 months from the expiration of the limitation period in paragraph (a), the limitation period is extended for a period of 12 months from the date the complaint is received by the board.\n(d) If alleged misconduct is complained of that involves a client who is a minor, the limitation period in paragraph (a) does not begin until the minor reaches the age of 18.\n(e) For purposes of this subdivision only, \"proceeding\" means the service of a notice of conference, or in cases in which a notice of conference was not served, a notice of hearing.\n(a) If the board has probable cause to believe that an individual who is regulated by the board has demonstrated an inability to practice psychology with reasonable skill and safety to clients due to any mental or physical illness or condition, the board may direct the individual to submit to an independent mental, physical, or substance use disorder examination or evaluation. For the purpose of this subdivision, an individual regulated by the board is deemed to have consented to submit to the examination or evaluation when directed to do so by written notice by the board and to have waived all objections to the admissibility of the examiner's or evaluator's testimony or reports on the grounds that the same constitutes a privileged communication. Failure to submit to an examination or evaluation without just cause, as determined by the board, shall authorize the board to consider the allegations as true for the purposes of further action by the board. Such action may include an application being denied, a license being suspended, or a default and final order being entered without the taking of testimony or presentation of evidence, other than evidence that may be submitted by affidavit that explains why the individual did not submit to the examination or evaluation.\n(b) An individual regulated by the board who is affected under this subdivision shall, at reasonable intervals, be given an opportunity to demonstrate that the individual is fit to resume the competent practice of psychology with reasonable skill and safety to the public.\n(c) In a proceeding under this subdivision, neither the record of the proceedings nor the orders entered by the board is admissible, is subject to subpoena, or may be used against the individual regulated by the board in any proceeding not commenced by the board.\n(d) Information obtained under this subdivision is classified as private under section 13.02, subdivision 12.",
	"repealed": false
}