{
	"id": "256S.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.19",
	"title": "256S.19 MONTHLY CASE MIX BUDGET CAPS; NURSING FACILITY RESIDENTS.",
	"text": "A participant who is a nursing facility resident when requesting an eligibility determination for elderly waiver services may request an elderly waiver monthly conversion budget cap for the cost of elderly waiver services.\nOnly a participant discharged from a nursing facility after a minimum 30-day stay is eligible under this section for an elderly waiver monthly conversion budget cap.\n(a) The elderly waiver monthly conversion budget cap for the cost of elderly waiver services must be based on the nursing facility case mix adjusted total payment rate of the nursing facility where the elderly waiver applicant currently resides for the applicant's case mix classification as determined according to section 256R.17.\n(b) The elderly waiver monthly conversion budget cap for the cost of elderly waiver services must be calculated by multiplying the applicable nursing facility case mix adjusted total payment rate by 365, dividing by 12, and subtracting the participant's maintenance needs allowance.\n(c) A participant's initially approved monthly conversion budget cap for elderly waiver services must be adjusted at least annually as described in section 256S.18, subdivision 5.\n(d) Conversion budget caps for individuals participating in consumer-directed community supports must be set as described in paragraphs (a) to (c).\n[See Note.]\nFor the elderly waiver monthly conversion budget cap for the cost of elderly waiver services with consumer-directed community supports, the nursing facility case mix adjusted total payment rate used under subdivision 3 to calculate the monthly conversion budget cap for elderly waiver services without consumer-directed community supports must be reduced by a percentage equal to the percentage difference between the consumer-directed community supports budget limit that would be assigned according to the elderly waiver plan and the corresponding monthly case mix budget cap under this chapter, but not to exceed 50 percent.",
	"repealed": false
}