{
	"id": "43A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.24",
	"title": "43A.24 ELIGIBILITY FOR STATE PAID INSURANCE AND BENEFITS.",
	"text": "Employees, including persons on layoff from a civil service position, and employees who are employed less than full time, shall be eligible for state paid life insurance and hospital, medical and dental benefits as provided in collective bargaining agreements or plans established pursuant to section 43A.18.\n(a) An individual eligible for state-paid hospital, medical, and dental benefits under this section has the right to decline those benefits, provided the individual declining the benefits can prove health insurance coverage from another source. Any individual declining benefits must do so in writing, signed and dated, on a form provided by the commissioner.\n(b) The commissioner must create, and make available in hard copy and online a form for individuals to use in declining state-paid hospital, medical, and dental benefits. The form must, at a minimum, include notice to the declining individual of the next available opportunity and procedure to re-enroll in the benefits.\n(c) No later than January 15 of each year, the commissioner of management and budget must provide a report to the chairs and ranking minority members of the legislative committees with jurisdiction over state government finance on the number of employees choosing to opt-out of state employee group insurance coverage under this section. The report must provide itemized statistics, by agency, and include the total amount of savings accrued to each agency resulting from the opt-outs.\nThe following persons are eligible for state paid life insurance and hospital, medical, and dental benefits as determined in applicable collective bargaining agreements or by the commissioner or by plans pursuant to section 43A.18, subdivision 6, or by the Board of Regents for employees of the University of Minnesota not covered by collective bargaining agreements. Coverages made available, including optional coverages, are as contained in the plan established pursuant to section 43A.18, subdivision 2:\n(1) a member of the state legislature, provided that changes in benefits resulting in increased costs to the state shall not be effective until expiration of the term of the members of the existing house of representatives. An eligible member of the state legislature may decline to be enrolled for state paid coverages by filing a written waiver with the commissioner. The waiver shall not prohibit the member from enrolling the member or dependents for optional coverages, without cost to the state, as provided for in section 43A.26. A member of the state legislature who returns from a leave of absence to a position previously occupied in the civil service shall be eligible to receive the life insurance and hospital, medical, and dental benefits to which the position is entitled;\n(2) an employee of the legislature or an employee of a permanent study or interim committee or commission or a state employee on leave of absence to work for the legislature, during a regular or special legislative session, as determined by the Legislative Coordinating Commission;\n(3) a judge of the appellate courts or an officer or employee of these courts; a judge of the district court, a judge of county court, or a judge of county municipal court; a district court referee, judicial officer, court reporter, or law clerk; a district administrator; an employee of the Office of the District Administrator that is not in the Second or Fourth Judicial District; a court administrator or employee of the court administrator in a judicial district under section 480.181, subdivision 1, paragraph (b), and a guardian ad litem program employee;\n(4) a salaried employee of the Public Employees Retirement Association;\n(5) a full-time military or civilian officer or employee in the unclassified service of the Department of Military Affairs whose salary is paid from state funds;\n(6) an employee of the Minnesota Historical Society, whether paid from state funds or otherwise, who is not a member of the governing board;\n(7) an employee of the regents of the University of Minnesota;\n(8) notwithstanding section 43A.27, subdivision 3, an employee of the state of Minnesota or the regents of the University of Minnesota who is at least 60 and not yet 65 years of age on July 1, 1982, who is otherwise eligible for employee and dependent insurance and benefits pursuant to section 43A.18 or other law, who has at least 20 years of service and retires, earlier than required, within 60 days of March 23, 1982; or an employee who is at least 60 and not yet 65 years of age on July 1, 1982, who has at least 20 years of state service and retires, earlier than required, from employment at Rochester state hospital after July 1, 1981; or an employee who is at least 55 and not yet 65 years of age on July 1, 1982, and is covered by the Minnesota State Retirement System correctional employee retirement plan or the State Patrol retirement fund, who has at least 20 years of state service and retires, earlier than required, within 60 days of March 23, 1982. For purposes of this clause, a person retires when the person terminates active employment in state or University of Minnesota service and applies for a retirement annuity. Eligibility shall cease when the retired employee attains the age of 65, or when the employee chooses not to receive the annuity that the employee has applied for. The retired employee shall be eligible for coverages to which the employee was entitled at the time of retirement, subject to any changes in coverage through collective bargaining or plans established pursuant to section 43A.18, for employees in positions equivalent to that from which retired, provided that the retired employee shall not be eligible for state-paid life insurance. Coverages shall be coordinated with relevant health insurance benefits provided through the federally sponsored Medicare program;\n(9) an employee of an agency of the state of Minnesota identified through the process provided in this paragraph who is eligible to retire prior to age 65. The commissioner and the exclusive representative of state employees shall enter into agreements under section 179A.22 to identify employees whose positions are in programs that are being permanently eliminated or reduced due to federal or state policies or practices. Failure to reach agreement identifying these employees is not subject to impasse procedures provided in chapter 179A. The commissioner must prepare a plan identifying eligible employees not covered by a collective bargaining agreement in accordance with the process outlined in section 43A.18, subdivisions 2 and 3. For purposes of this paragraph, a person retires when the person terminates active employment in state service and applies for a retirement annuity. Eligibility ends as provided in the agreement or plan, but must cease at the end of the month in which the retired employee chooses not to receive an annuity, or the employee is eligible for employer-paid health insurance from a new employer. The retired employees shall be eligible for coverages to which they were entitled at the time of retirement, subject to any changes in coverage through collective bargaining or plans established under section 43A.18 for employees in positions equivalent to that from which they retired, provided that the retired employees shall not be eligible for state-paid life insurance;\n(10) employees of the state Board of Public Defense, with eligibility determined by the state Board of Public Defense in consultation with the commissioner of management and budget; and\n(11) employees of supporting organizations of Enterprise Minnesota, Inc., established after July 1, 2003, under section 116O.05, subdivision 4, as paid for by the supporting organization.\n[Repealed, 1993 c 122 s 7]\nThe commissioner must ensure that state paid hospital, medical, and dental benefits are not provided to eligible employees by a health maintenance organization which is not a nonprofit corporation organized under chapter 317A or a local governmental unit, as defined in section 62D.02.",
	"repealed": false
}