{
	"id": "5.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/5.36",
	"title": "5.36 REGISTERED AGENT FOR SERVICE OF PROCESS.",
	"text": "A business entity shall continuously maintain a registered office in this state. A registered office need not be the same as the principal place of business in this state or the principal executive office of the corporation. If the current registered office address listed in the records of the secretary of state is not an actual office location, or is solely a post office box, the business entity must provide a new registered office address that includes an actual office location and that may also include a mailing address or post office box. A fee may not be charged if the registered office address is being changed only to bring the address into compliance. The new registered office address must have been approved by the governing body of the business entity.\nA business entity formed under the laws of Minnesota may designate a registered agent in its formation document. A business entity formed under the laws of another jurisdiction must designate a registered agent when registering to do business in Minnesota. The registered agent may be a natural person residing in this state, a domestic corporation, or limited liability company, or a foreign corporation or foreign limited liability company authorized to transact business in this state. The registered agent must maintain a business office that is identical with the registered office.\nA business entity may change its registered office, designate or change its registered agent, or state a change in the name of its registered agent, by filing with the secretary of state a statement containing:\n(1) the name of the business entity;\n(2) if the address of its registered office is to be changed, the new address of its registered office;\n(3) if its registered agent is to be designated or changed, the name of its new registered agent;\n(4) if the name of its registered agent is to be changed, the name of its registered agent as changed;\n(5) a statement that the address of its registered office and the address of the business office of its registered agent, as changed, will be identical; and\n(6) a statement that the change of registered office or registered agent was authorized by resolution approved by the affirmative vote of a majority of the governing body of the business entity present.\nA registered agent of a business entity may resign by filing with the secretary of state a signed written notice of resignation, including a statement that a signed copy of the notice has been given to the business entity at its principal executive office or to a legal representative of the business entity. The appointment of the agent terminates 30 days after the notice is filed with the secretary of state.\nIf the business address or name of a registered agent changes, the agent shall change the address of the registered office or the name of the registered agent, as the case may be, of each business entity represented by that agent by filing with the secretary of state a statement as required in subdivision 1, except that it need be signed only by the registered agent, need not be responsive to subdivision 3, clause (6), and must state that a copy of the statement has been mailed to each of those business entities or to the legal representative of each of those business entities.",
	"repealed": false
}