{
	"id": "144G.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.10",
	"title": "144G.10 ASSISTED LIVING FACILITY LICENSE.",
	"text": "(a)(1) Beginning August 1, 2021, no assisted living facility may operate in Minnesota unless it is licensed under this chapter.\n(2) No facility or building on a campus may provide assisted living services until obtaining the required license under paragraphs (c) to (e).\n(b) The licensee is legally responsible for the management, control, and operation of the facility, regardless of the existence of a management agreement or subcontract. Nothing in this chapter shall in any way affect the rights and remedies available under other law.\n(c) Upon approving an application for an assisted living facility license, the commissioner shall issue a single license for each building that is operated by the licensee as an assisted living facility and is located at a separate address, except as provided under paragraph (d) or (e).\n(d) Upon approving an application for an assisted living facility license, the commissioner may issue a single license for two or more buildings on a campus that are operated by the same licensee as an assisted living facility. An assisted living facility license for a campus must identify the address and licensed resident capacity of each building located on the campus in which assisted living services are provided.\n(e) Upon approving an application for an assisted living facility license, the commissioner may:\n(1) issue a single license for two or more buildings on a campus that are operated by the same licensee as an assisted living facility with dementia care, provided the assisted living facility for dementia care license for a campus identifies the buildings operating as assisted living facilities with dementia care; or\n(2) issue a separate assisted living facility with dementia care license for a building that is on a campus and that is operating as an assisted living facility with dementia care.\nEach assisted living facility must employ an assisted living director licensed or permitted by the Board of Executives for Long Term Services and Supports.\n(a) The categories in this subdivision are established for assisted living facility licensure.\n(1) The assisted living facility category is for assisted living facilities that only provide assisted living services.\n(2) The assisted living facility with dementia care category is for assisted living facilities that provide assisted living services and dementia care services. An assisted living facility with dementia care may also provide dementia care services in a secured dementia care unit.\n(b) An assisted living facility that has a secured dementia care unit must be licensed as an assisted living facility with dementia care.\nAn assisted living facility licensed under this chapter is not required to also be licensed as a boarding establishment, food and beverage service establishment, hotel, motel, lodging establishment, resort, or restaurant under chapter 157.\n(a) Operating an assisted living facility without a license is a misdemeanor, and the commissioner may also impose a fine.\n(b) A controlling individual of the facility in violation of this section is guilty of a misdemeanor. This paragraph shall not apply to any controlling individual who had no legal authority to affect or change decisions related to the operation of the facility.\n(c) The sanctions in this section do not restrict other available sanctions in law.\n(a) Effective January 1, 2026, no person or entity may use the phrase \"assisted living,\" whether alone or in combination with other words and whether orally or in writing, to: advertise; market; or otherwise describe, offer, or promote itself, or any housing, service, service package, or program that it provides within this state, unless the person or entity is a licensed assisted living facility that meets the requirements of this chapter. A person or entity entitled to use the phrase \"assisted living\" shall use the phrase only in the context of its participation that meets the requirements of this chapter.\n(b) Effective January 1, 2026, the licensee's name for a new assisted living facility may not include the terms \"home care\" or \"nursing home.\"",
	"repealed": false
}