{
	"id": "375A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.11",
	"title": "375A.11 CONSOLIDATION OF DUTIES OF COUNTY OFFICES.",
	"text": "Without restriction of the authority of the county board to assign additional duties to the county auditor, county treasurer, court administrator of the district court and county recorder for which additional compensation may be paid, and provided that the office of county auditor, county treasurer, court administrator of district court, county attorney, sheriff or county recorder may not be consolidated with another elective office listed in this subdivision except pursuant to the provisions of section 375A.10, the county board may consolidate the duties of any two or more county offices and may provide additional compensation for the additional duties. The county board shall effect a consolidation by ordinance and may by this means consolidate any two or more county offices provided that the person holding the consolidated office possesses the qualifications required by law.\nIf the duties of officers are consolidated pursuant to this section, the county board by ordinance may elect to separate the duties so consolidated and reconsolidate them in any other manner permitted by law or separate the duties without reconsolidation and provide that the duties of each office shall be performed by a separate person, if it deems the change to be in the public interest. When the duties of offices are united and consolidated, the person filling the consolidated offices shall take the oath of each office and give the bond required by the county board for each office and shall discharge all the duties pertaining to each office.\n(a) If any of the offices of county auditor, treasurer or county recorder shall become vacant before the expiration of the term for the office, a county board may appoint either of the holders of the other two offices to fill the vacancy for the unexpired term. The board may provide additional compensation for the added duties imposed on the appointee by virtue of holding two offices for that period. If the office of county auditor or treasurer becomes vacant, the county board may initiate a referendum by resolution to consolidate the two offices into one elected office. The referendum shall be conducted according to section 375A.12, subdivisions 4 and 5.\n(b) The authority granted by paragraph (a) shall be in addition to the authorities granted by existing law or statute and by the provisions of sections 375A.01 to 375A.13 relating to consolidation and appointment of county offices; the authority granted by this subdivision may be exercised notwithstanding any prohibitions against the holding of two offices that may exist in the laws or statutes of this state.",
	"repealed": false
}