{
	"id": "272.488",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.488",
	"title": "272.488 COMPUTERIZED FILING OF TAX LIENS AND NOTICES.",
	"text": "Notices of federal tax liens, certificates, or revocations of certificates of release of federal tax liens, refiled notices of any of those items, and any other notices affecting federal tax liens that are required to be filed with the county recorder, in a form prescribed by the Internal Revenue Service, may be filed with the county recorder by mail, personal delivery, or by electronic transmission by the Secretary of the Treasury of the United States or a delegate into the computerized database system. The secretary of state shall transmit the notice electronically to the office of the county recorder in the county or counties shown on the computer entry. The county recorder must endorse and file the notice and enter the information into the computerized database system as required by section 272.483.\nCounty recorders and the secretary of state shall enter information relative to lien notices, releases, revocations of release, and refilings of any of those items into the computerized database system of the secretary of state. For notices transmitted electronically for filing with the county recorders, the date and time of filing of the notice and county recorder's file number, and for notices transmitted electronically for filing with the secretary of state, the secretary of state's filing information, must be entered by the filing officer into the computerized database system before the close of the fifth working day following the day of the original data transmission to the filing officer. When notices are transmitted electronically, the filing officer must file the notices no later than 5:00 p.m. on the business day after they were transmitted to the filing officer. All other processing by the county recorder of lien notices, releases, revocations of release and refilings of any of those items must occur within the time period allowed in section 357.182.\n(a) Notices of federal tax liens, certificates, or revocations of certificates of release of federal tax liens, refiled notices of any of those items, and any other notices affecting federal tax liens that are required to be filed with the secretary of state, in a form prescribed by the Internal Revenue Service, may be filed with the secretary of state by mail, personal delivery, or electronic transmission by the Secretary of the Treasury of the United States or a delegate into the computerized filing system of the secretary of state. The electronic record must be endorsed and indexed within the computerized database system as required by section 272.483.\n(b) For filings made pursuant to section 272.481, paragraph (c), clause (1), with the secretary of state, when data entry is complete as required by subdivision 2, the original document is contained in the computerized filing system and is the official copy from which all official copies will be made. Reproductions of documents described in section 272.483, paragraph (a) or (b), which are contained in the computerized filing system will be in the same format as if the document had been filed on paper by the Internal Revenue Service.\nFor documents filed by mail or in person, the filing officer shall enter the data as if it had been transmitted electronically. Once the electronic record is created, it must be endorsed and indexed within the computerized database system. The filing officer must write or mark the filing information on the document that was submitted and return the document or a copy to the submitting party.\nThe Secretary of the Treasury of the United States or a delegate and the filing officers are authorized to develop a method which permits entry of previously filed notices of federal tax liens into the computerized database system. Should the Secretary of the Treasury and the filing officers decide to implement a method, entry of previously filed notices of federal tax liens shall not be a new filing and the filing date of the original document shall be maintained.\nThe index in the computerized filing system is the official index of federal tax liens filed with the secretary of state under section 272.483, paragraph (a), clause (1). The official index of federal tax lien records for the county recorders are those indices required by chapter 386 and section 272.483, paragraph (a), clause (2).",
	"repealed": false
}