{
	"id": "144.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.99",
	"title": "144.99 ENFORCEMENT.",
	"text": "The provisions of chapters 103I and 157 and sections 115.71 to 115.77; 144.12, subdivision 1, paragraphs (1), (2), (5), (6), (10), (12), (13), (14), and (15); 144.1201 to 144.1204; 144.121; 144.1215; 144.1222; 144.35; 144.381 to 144.385; 144.411 to 144.417; 144.495; 144.71 to 144.74; 144.9501 to 144.9512; 144.97 to 144.98; 144.992; 326.70 to 326.785; 327.10 to 327.131; and 327.14 to 327.28 and all rules, orders, stipulation agreements, settlements, compliance agreements, licenses, registrations, certificates, and permits adopted or issued by the department or under any other law now in force or later enacted for the preservation of public health may, in addition to provisions in other statutes, be enforced under this section.\nThe commissioner or an employee or agent authorized by the commissioner, upon presentation of credentials, may:\n(1) examine and copy any books, papers, records, memoranda, or data of any person subject to regulation under the statutes listed in subdivision 1; and\n(2) enter upon any property, public or private, for the purpose of taking any action authorized under statutes, rules, or other actions listed in subdivision 1 including obtaining information from a person who has a duty to provide information under the statutes listed in subdivision 1, taking steps to remedy violations, or conducting surveys or investigations.\n(a) The commissioner may issue correction orders that require a person to correct a violation of the statutes, rules, and other actions listed in subdivision 1. The correction order must state the deficiencies that constitute the violation; the specific statute, rule, or other action; and the time by which the violation must be corrected.\n(b) If the person believes that the information contained in the commissioner's correction order is in error, the person may ask the commissioner to reconsider the parts of the order that are alleged to be in error. The request must be in writing, delivered to the commissioner by certified mail within 15 calendar days after receipt of the order, and:\n(1) specify which parts of the order for corrective action are alleged to be in error;\n(2) explain why they are in error; and\n(3) provide documentation to support the allegation of error.\nThe commissioner must respond to requests made under this paragraph within 15 calendar days after receiving a request. A request for reconsideration does not stay the correction order; however, after reviewing the request for reconsideration, the commissioner may provide additional time to comply with the order if necessary. The commissioner's disposition of a request for reconsideration is final.\n(a) The commissioner may issue an order requiring violations to be corrected and administratively assessing monetary penalties for violations of the statutes, rules, and other actions listed in subdivision 1. The procedures in section 144.991 must be followed when issuing administrative penalty orders. Except in the case of repeated or serious violations, the penalty assessed in the order must be forgiven if the person who is subject to the order demonstrates in writing to the commissioner before the 31st day after receiving the order that the person has corrected the violation or has developed a corrective plan acceptable to the commissioner. The maximum amount of an administrative penalty order is $10,000 for each violator for all violations by that violator identified in an inspection or review of compliance.\n(b) Notwithstanding paragraph (a), the commissioner may issue to a large public water supply, serving a population of more than 10,000 persons, an administrative penalty order imposing a penalty of at least $1,000 per day per violation, not to exceed $10,000 for each violation of sections 144.381 to 144.385 and rules adopted thereunder.\n(c) Notwithstanding paragraph (a), the commissioner may issue to a certified lead firm or person performing regulated lead work, an administrative penalty order imposing a penalty of at least $5,000 per violation per day, not to exceed $10,000 for each violation of sections 144.9501 to 144.9512 and rules adopted thereunder. All revenue collected from monetary penalties in this section shall be deposited in the state treasury and credited to the state government special revenue fund.\nIn addition to any other remedy provided by law, the commissioner may bring an action for injunctive relief in the district court in Ramsey County or, at the commissioner's discretion, in the district court in the county in which a violation of the statutes, rules, or other actions listed in subdivision 1 has occurred to enjoin the violation.\nThe commissioner, or an employee of the department designated by the commissioner, may issue an order to cease an activity covered by subdivision 1 if continuation of the activity would result in an immediate risk to public health. An order issued under this paragraph is effective for a maximum of 72 hours. In conjunction with the issuance of the cease and desist order, the commissioner may post a sign to cease an activity until the cease and desist order is lifted and the sign is removed by the commissioner. The commissioner must seek an injunction or take other administrative action authorized by law to restrain activities for a period beyond 72 hours. The issuance of a cease and desist order does not preclude the commissioner from pursuing any other enforcement action available to the commissioner.\nThe commissioner of health shall prepare a plan for using the administrative penalty and cease and desist authority in this section. The commissioner shall provide a 30-day period for public comment on the plan. The plan must be finalized by December 1, 1993.\n(a) The commissioner may deny or refuse to renew an application for a permit, license, registration, or certificate required under the statutes or rules cited in subdivision 1, if the applicant does not meet or fails to maintain the minimum qualifications for holding a permit, license, registration, or certificate or has any unresolved violations related to the activity for which the permit, license, registration, or certificate was issued.\n(b) The commissioner may also deny or refuse to renew a permit, license, registration, or certificate required under the statutes or rules cited in subdivision 1 if the applicant has a persistent pattern of violations related to the permit, license, registration, or certificate, or if the applicant submitted false material information to the department in connection with the application.\n(c) The commissioner may condition the grant or renewal of a permit, license, registration, or certificate on a demonstration by the applicant that actions needed to ensure compliance with the requirements of the statutes listed in subdivision 1 have been taken, or may place conditions on or issue a limited permit, license, registration, or certificate as a result of previous violations by the applicant.\nThe commissioner may suspend, place conditions on, or revoke a permit, license, registration, or certificate issued under the statutes or rules cited in subdivision 1 for:\n(1) serious or repeated violations of the requirements in the statutes, rules, or other actions listed in subdivision 1 that apply to the permit, license, registration, or certificate;\n(2) submitting false material information to the department in connection with activities for which the permit, license, registration, or certificate is issued;\n(3) allowing the alteration or use of one's own permit, license, registration, or certificate by another; or\n(4) within the previous five years, conviction of a crime in connection with activities for which the permit, license, registration, or certificate was issued.\nIf the commissioner proposes to deny, refuses to renew, suspends, or revokes a permit, license, registration, or certificate under subdivision 8 or 9, the commissioner must first notify, in writing, the person against whom the action is proposed to be taken and provide the person an opportunity to request a hearing under the contested case provisions of chapter 14. If the person does not request a hearing by notifying the commissioner within 20 days after receipt of the notice of proposed action, the commissioner may proceed with the action without a hearing. This subdivision does not apply to:\n(1) the denial of or refusal to renew a permit, license, registration, or certificate based on the applicant's failure to meet or maintain the minimum qualifications for holding the permit, license, registration, or certificate; or\n(2) the denial of, refusal to renew, suspension of, or revocation of a permit, license, registration, or certificate if the person against whom the action is proposed to be taken has been granted a hearing under this subdivision within the previous 12 months.\nA person convicted of violating a statute or rule listed in subdivision 1 is guilty of a misdemeanor.\n(a) In the event of an emergency that poses a danger to the public health, the commissioner shall have the authority to impound radioactive materials and the associated shielding in the possession of a person who fails to abide by the provisions of the statutes, rules, and any other item listed in subdivision 1. If impounding the source of these materials is impractical, the commissioner shall have the authority to lock or otherwise secure a facility that contains the source of such materials, but only the portions of the facility as is necessary to protect the public health. An action taken under this paragraph is effective for up to 72 hours. The commissioner must seek an injunction or take other administrative action to secure radioactive materials beyond the initial 72-hour period.\n(b) The commissioner may release impounded radioactive materials and the associated shielding to the owner of the radioactive materials and associated shielding, upon terms and conditions that are in accordance with the provisions of statutes, rules, and other items listed in subdivision 1. In the alternative, the commissioner may bring an action in a court of competent jurisdiction for an order directing the disposal of impounded radioactive materials and associated shielding or directing other disposition as necessary to protect the public health and safety and the environment. The costs of decontamination, transportation, burial, disposal, or other disposition shall be borne by the owner or licensee of the radioactive materials and shielding or by any other person who has used the radioactive materials and shielding for business purposes.",
	"repealed": false
}