{
	"id": "465.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.43",
	"title": "465.43 HEARING; APPRAISERS; AWARD; APPEAL.",
	"text": "The case may be brought on for hearing on eight days' notice, at any general or special term of the court, and the judgment of the court shall be to confirm or annul the proceedings, only so far as the proceedings affect the property of the appellant proposed to be taken or damaged or assessed, and described in the written objection. In case the amount of damages or benefits assessed is complained of by the appellant, the court shall, if the proceedings be confirmed in other respects, appoint three disinterested freeholders, residents of the county, appraisers, to reappraise the damages, and reassess benefits as to the property of appellant. The parties to the appeal shall be heard by the court upon the appointment of the appraisers. The court shall fix the time and place of meeting of the appraisers. They shall be sworn to the faithful discharge of their duties as appraisers, and shall proceed to view the premises and to hear the parties interested, with their allegations and proofs pertinent to the question of the amount of damages or benefits, and proceed in all other material respects as are provided in sections 465.26 to 465.48 for the government of appraisers appointed by the city council. They shall, after the hearing and view of the premises, report to the court their award of damages and assessments of benefits in respect to the property of the appellant. The appellant shall, within five days of notice of filing the award, file a written election to remove the buildings if the appellant so elect. The election shall not affect the appellant's right to a review. The award shall be final unless set aside by the court. The motion to set aside shall be made within 15 days. If the report is set aside, the court may, in its discretion, recommit it to the same appraisers, or appoint new appraisers, as it deems best. The court shall allow to the appraisers a reasonable compensation for their services, and make such awards of costs on the appeal, including the compensation of appraisers, as it deems just in the premises, and enforce them by execution. If the court is of the opinion that the appeal was frivolous or vexatious, it may adjudge double costs against the appellant. An appeal may be taken to the court of appeals from any final order of the district court in the proceedings.",
	"repealed": false
}