{
	"id": "471.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.63",
	"title": "471.63 PROMOTION OF SAFETY AND PRESERVATION OF HUMAN LIFE.",
	"text": "In each county in this state not containing a city of the first class, and in any county having an excess of 5,000 square miles and a population in excess of 150,000 containing a city of the first class, the county board or the governing body of any municipality is hereby authorized and empowered to appropriate to set aside or to make a special levy to be included in its general revenue fund for the purpose of defraying the cost of necessary supplies, postage, materials, awards, expenses of safety workers, administration expenses, and incidentals in the promotion of general safety and the preservation of human life in this state.\nMS 1992 [Repealed, 1994 c 505 art 3 s 17]\nFunds so appropriated or allocated may be paid to any local safety council which is a recognized affiliate of the Minnesota Safety Council.\nSuch funds so appropriated shall be deposited in a state or national bank same as other public funds in the manner provided by law by the treasurer of the said local safety council and credited to a fund to be established and known as the general fund of the said safety council. Any moneys expended from such fund shall be on verified claims allowed by the safety council, to which such moneys are allocated, in meeting assembled and all checks signed by the chair and countersigned by the treasurer or secretary of such safety council.\nSuch funds and records shall be subject to audit the same as any other public funds, and the treasurer of the safety council shall, on the first Monday in January of each year, submit a statement in detail of receipts, expenditures, and balances for the preceding year to the county, or municipality making such appropriation.\nThe treasurer of the safety council shall be required to give a corporate surety bond in favor of the county, or municipality making such appropriation in the amount so appropriated to the safety council by such governing body. The premium for such bond when approved shall be charged against the general fund of the safety council. The bond shall be approved by the legal advisor of the governing body as to form, legality, and surety.\nA certified copy of the resolution appropriating such funds by any municipal governing body shall be filed with the county auditor in which county such appropriation is made, within 30 days after such appropriation. The county auditor shall keep a record of the total appropriations so made.",
	"repealed": false
}