{
	"id": "116.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.075",
	"title": "116.075 HEARINGS AND RECORDS PUBLIC.",
	"text": "All hearings conducted by the Pollution Control Agency pursuant to sections 103F.701 to 103F.755 and chapters 115 and 116 shall be open to the public, and the transcripts thereof are public records. All final records, studies, reports, orders, and other documents prepared in final form by order of, or for the consideration of, the agency, are public records. Any documents designated as public records by this section may be inspected by members of the public at all reasonable hours and places under such rules as the agency shall promulgate.\nAny records or other information obtained by the Pollution Control Agency or furnished to the agency by the owner or operator of one or more air contaminant or water or land pollution sources which are certified by said owner or operator, and said certification, as it applies to water pollution sources, is approved in writing by the commissioner, to relate to (a) sales figures, (b) processes or methods of production unique to the owner or operator, or (c) information which would tend to affect adversely the competitive position of said owner or operator, shall be only for the confidential use of the agency in discharging its statutory obligations, unless otherwise specifically authorized by said owner or operator. Provided, however that all such information may be used by the agency in compiling or publishing analyses or summaries relating to the general condition of the state's water, air and land resources so long as such analyses or summaries do not identify any owner or operator who has so certified. Notwithstanding the foregoing, the agency may disclose any information, whether or not otherwise considered confidential which it is obligated to disclose in order to comply with federal law and regulations, to the extent and for the purpose of such federally required disclosure.",
	"repealed": false
}