{
	"id": "192.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.515",
	"title": "192.515 NATIONAL GUARD NONAPPROPRIATED FUND INSTRUMENTALITY.",
	"text": "The adjutant general may establish a Minnesota National Guard Nonappropriated Fund Instrumentality to create, operate, and maintain morale, welfare, and recreation facilities and activities at Camp Ripley and other property owned, leased, or otherwise controlled by the Minnesota National Guard.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Instrumentality\" means the Minnesota National Guard Nonappropriated Fund Instrumentality.\n(c) \"Morale, welfare, and recreation facility or activity\" refers to a facility or activity intended to provide recreational opportunities, promote unit and individual morale, and generally improve the welfare of Minnesota National Guard personnel at Camp Ripley or other properties owned, leased, or otherwise controlled by the Minnesota National Guard. It does not include facilities or services provided by the Army and Air Force Exchange Service. It also does not include facilities or services provided by other instrumentalities through the use of appropriated funds.\nThe adjutant general may authorize Minnesota National Guard lands and facilities to be used in support of morale, welfare, and recreation activities under this section. That use must not interfere with military operations or training.\n(a) Except as otherwise specifically authorized in this section, no general fund money or other state funds may be deposited in any of the funds and accounts established under this section.\n(b) The instrumentality is authorized to accept donations or gifts from public or private sources for purposes authorized under this section, including, but not limited to, federal funds made available to the National Guard for related activities and money received from recycling activities to the extent authorized by federal regulation.\n(c) Money received from operation of activities under this section, including, but not limited to, user fees and rental charges must be deposited and managed consistent with this subdivision.\n(d) The adjutant general may transfer funds from any existing morale, welfare, or recreation fund outside the state treasury to the instrumentality.\n(e) Money received by the instrumentality must be deposited in the Minnesota National Guard morale, welfare, and recreation fund. The Minnesota National Guard morale, welfare, and recreation fund is established outside the state treasury. The adjutant general may spend money in the fund for morale, welfare, or recreation facilities or activities as authorized by this section.\n(f) Accounts or funds created under this section must be audited annually by officers of the military forces detailed by the adjutant general as military auditors.\nThe adjutant general must adopt rules for the establishment, management, and operation of the instrumentality consistent with this section.",
	"repealed": false
}