{
	"id": "326B.805",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.805",
	"title": "326B.805 LICENSING REQUIREMENTS.",
	"text": "A person who meets the definition of a residential building contractor as defined in section 326B.802, subdivision 11, must be licensed as a residential building contractor by the commissioner. A person who meets the definition of a residential remodeler as defined in section 326B.802, subdivision 12, must be licensed by the commissioner as a residential remodeler or residential building contractor. A person who meets the definition of a residential roofer as defined in section 326B.802, subdivision 14, must be licensed by the commissioner as a residential roofer, residential building contractor, or residential remodeler. A person who meets the definition of a manufactured home installer as defined in section 327.31, subdivision 11, must be licensed as a manufactured home installer by the commissioner.\nA licensee performing renovation defined by Code of Federal Regulations, title 40, section 745.83, on a residential structure constructed prior to 1978 must comply with section 326B.106, subdivision 14.\nA person who meets the definition of a specialty contractor as defined in section 326B.802, subdivision 16, may be licensed by the commissioner as a residential building contractor or residential remodeler.\nExcept as provided in subdivision 6, no persons required to be licensed by subdivision 1 may act or hold themselves out as a residential building contractor, residential remodeler, residential roofer, or manufactured home installer for compensation without a license issued by the commissioner.\nThe examination and education requirements for licensure under sections 326B.805 to 326B.885 must be fulfilled by a qualifying person designated by the potential licensee. If the qualifying person is a managing employee, the qualifying person must be an employee who is regularly employed by the licensee and is actively engaged in the business of residential contracting or residential remodeling on behalf of the licensee. For a sole proprietorship, the qualifying person must be the proprietor or managing employee. For a partnership, the qualifying person must be a general partner or managing employee. For a limited liability company, the qualifying person must be a chief manager or managing employee. For a corporation, the qualifying person must be an owner, officer, or managing employee. A qualifying person for a corporation or limited liability company may act as the qualifying person for more than one corporation or limited liability company if there is common ownership of at least 25 percent among each of the licensed corporations or limited liability companies for which the person acts in the capacity of qualifying person.\n(a) Each licensee or applicant for licensure shall provide to the commissioner a current street address and telephone number where the licensee resides, and a street address and telephone number where the licensee's business is physically located. A post office box address is not sufficient to satisfy this requirement. Each licensee or applicant for licensure must notify the commissioner in writing of any change in the required information within 15 days of the change.\n(b) Each licensee or applicant for licensure must notify the commissioner in writing upon any change in control, ownership, officers or directors, personal name, business name, license name, or qualifying person, within 15 days of the change.\n(c) Each licensee or applicant for licensure must notify the commissioner in writing if the licensee or applicant for licensure is found to be a judgment debtor based upon conduct requiring licensure pursuant to sections 326B.802 to 326B.885 within 15 days of the finding.\n(d) Each licensee or applicant for licensure must notify the commissioner in writing within 15 days of filing a petition for bankruptcy.\n(e) Each licensee or applicant for licensure must notify the commissioner in writing within ten days if the licensee or applicant for licensure has been found guilty of a felony, gross misdemeanor, misdemeanor, or any comparable offense related to residential contracting, including convictions of fraud, misrepresentation, misuse of funds, theft, criminal sexual conduct, assault, burglary, conversion of funds, or theft of proceeds in this or any other state or any other United States jurisdiction.\nThe license requirement does not apply to:\n(1) an employee of a licensee performing work for the licensee;\n(2) a material person, manufacturer, or retailer furnishing finished products, materials, or articles of merchandise who does not install or attach the items;\n(3) an owner of residential real estate who builds or improves residential real estate if the owner occupies or will occupy the residential real estate for residential purposes, or will retain ownership for rental purposes upon completion of the building or improvement. This exemption does not apply to an owner who constructs or improves residential real estate for purposes of resale or speculation. An owner of residential real estate will be presumed to be building or improving for purposes of speculation if the owner constructs or improves more than one property within any 24-month period, unless the properties will be retained by the owner for rental purposes;\n(4) an architect or professional engineer engaging in professional practice as defined by section 326.02, subdivisions 2 and 3;\n(5) a person whose total gross annual receipts for performing specialty skills for which licensure would be required under this section do not exceed $15,000;\n(6) a mechanical contractor;\n(7) a plumber, electrician, or other person whose profession is otherwise subject to statewide licensing, when engaged in the activity which is the subject of that licensure;\n(8) specialty contractors who provide only one special skill as defined in section 326B.802;\n(9) a school district, or a technical college governed under chapter 136F; and\n(10) Habitat for Humanity and Builders Outreach Foundation, and their individual volunteers when engaged in activities on their behalf.\nTo qualify for the exemption in clause (5), a person must obtain a certificate of exemption from licensure from the commissioner. A certificate of exemption will be issued upon the applicant's filing with the commissioner, an affidavit stating that the applicant does not expect to exceed $15,000 in gross annual receipts derived from performing services which require licensure under this section during the calendar year in which the affidavit is received. For the purposes of calculating fees under section 326B.092, a certificate of exemption is an entry level license. To renew the exemption in clause (5), the applicant must file an affidavit stating that the applicant did not exceed $15,000 in gross annual receipts during the past calendar year. If a person, operating under the exemption in clause (5), exceeds $15,000 in gross receipts during any calendar year, the person must immediately surrender the certificate of exemption and apply for the appropriate license. The person must remain licensed until such time as the person's gross annual receipts during a calendar year fall below $15,000. The person may then apply for an exemption for the next calendar year.",
	"repealed": false
}