{
	"id": "144A.4791",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.4791",
	"title": "144A.4791 HOME CARE PROVIDER RESPONSIBILITIES WITH RESPECT TO CLIENTS.",
	"text": "(a) The home care provider shall provide the client or the client's representative a written notice of the rights under section 144A.44 before the date that services are first provided to that client. The provider shall make all reasonable efforts to provide notice of the rights to the client or the client's representative in a language the client or client's representative can understand.\n(b) In addition to the text of the home care bill of rights in section 144A.44, subdivision 1, the notice shall also contain the following statement describing how to file a complaint with these offices.\n\"If you have a complaint about the provider or the person providing your home care services, you may call, write, or visit the Office of Health Facility Complaints, Minnesota Department of Health. You may also contact the Office of Ombudsman for Long-Term Care or the Office of Ombudsman for Mental Health and Developmental Disabilities.\"\nThe statement should include the telephone number, website address, email address, mailing address, and street address of the Office of Health Facility Complaints at the Minnesota Department of Health, the Office of the Ombudsman for Long-Term Care, and the Office of the Ombudsman for Mental Health and Developmental Disabilities. The statement should also include the home care provider's name, address, email, telephone number, and name or title of the person at the provider to whom problems or complaints may be directed. It must also include a statement that the home care provider will not retaliate because of a complaint.\n(c) The home care provider shall obtain written acknowledgment of the client's receipt of the home care bill of rights or shall document why an acknowledgment cannot be obtained. The acknowledgment may be obtained from the client or the client's representative. Acknowledgment of receipt shall be retained in the client's record.\nThe home care provider that provides services to clients with dementia shall provide in written or electronic form, to clients and families or other persons who request it, a description of the training program and related training it provides, including the categories of employees trained, the frequency of training, and the basic topics covered. This information satisfies the disclosure requirements in section 325F.72, subdivision 2, clause (4).\nPrior to the date that services are first provided to the client, a home care provider must provide to the client or the client's representative a written statement which identifies if the provider has a basic or comprehensive home care license, the services the provider is authorized to provide, and which services the provider cannot provide under the scope of the provider's license. The home care provider shall obtain written acknowledgment from the clients that the provider has provided the statement or must document why the provider could not obtain the acknowledgment.\nNo home care provider may accept a person as a client unless the home care provider has staff, sufficient in qualifications, competency, and numbers, to adequately provide the services agreed to in the service plan and that are within the provider's scope of practice.\nIf a home care provider reasonably believes that a client is in need of another medical or health service, including a licensed health professional, or social service provider, the home care provider shall:\n(1) determine the client's preferences with respect to obtaining the service; and\n(2) inform the client of resources available, if known, to assist the client in obtaining services.\nWhen a provider provides home care services to a client before the individualized review or assessment by a licensed health professional or registered nurse as required in subdivisions 7 and 8 is completed, the licensed health professional or registered nurse must complete a temporary plan with the client and orient staff assigned to deliver services as identified in the temporary plan.\n(a) When services being provided are basic home care services, an individualized initial review of the client's needs and preferences must be conducted at the client's residence with the client or client's representative. This initial review must be completed within 30 days after the date that home care services are first provided.\n(b) Client monitoring and review must be conducted as needed based on changes in the needs of the client and cannot exceed 90 days from the date of the last review. The monitoring and review may be conducted at the client's residence or through the utilization of telecommunication methods based on practice standards that meet the individual client's needs.\n(a) When the services being provided are comprehensive home care services, an individualized initial assessment must be conducted in person by a registered nurse. When the services are provided by other licensed health professionals, the assessment must be conducted by the appropriate health professional. This initial assessment must be completed within five days after the date that home care services are first provided.\n(b) Client monitoring and reassessment must be conducted in the client's home no more than 14 days after the date that home care services are first provided.\n(c) Ongoing client monitoring and reassessment must be conducted as needed based on changes in the needs of the client and cannot exceed 90 days from the last date of the assessment. The monitoring and reassessment may be conducted at the client's residence or through the utilization of telecommunication methods based on practice standards that meet the individual client's needs.\n(a) No later than 14 days after the date that home care services are first provided, a home care provider shall finalize a current written service plan.\n(b) The service plan and any revisions must include a signature or other authentication by the home care provider and by the client or the client's representative documenting agreement on the services to be provided. The service plan must be revised, if needed, based on client review or reassessment under subdivisions 7 and 8. The provider must provide information to the client about changes to the provider's fee for services and how to contact the Office of the Ombudsman for Long-Term Care.\n(c) The home care provider must implement and provide all services required by the current service plan.\n(d) The service plan and revised service plan must be entered into the client's record, including notice of a change in a client's fees when applicable.\n(e) Staff providing home care services must be informed of the current written service plan.\n(f) The service plan must include:\n(1) a description of the home care services to be provided, the fees for services, and the frequency of each service, according to the client's current review or assessment and client preferences;\n(2) the identification of the staff or categories of staff who will provide the services;\n(3) the schedule and methods of monitoring reviews or assessments of the client;\n(4) the schedule and methods of monitoring staff providing home care services; and\n(5) a contingency plan that includes:\n(i) the action to be taken by the home care provider and by the client or client's representative if the scheduled service cannot be provided;\n(ii) information and a method for a client or client's representative to contact the home care provider;\n(iii) names and contact information of persons the client wishes to have notified in an emergency or if there is a significant adverse change in the client's condition; and\n(iv) the circumstances in which emergency medical services are not to be summoned consistent with chapters 145B and 145C, and declarations made by the client under those chapters.\n(a) If a home care provider terminates a service plan with a client, and the client continues to need home care services, the home care provider shall provide the client and the client's representative, if any, with a written notice of termination which includes the following information:\n(1) the effective date of termination;\n(2) the reason for termination;\n(3) for clients age 18 or older, a statement that the client may contact the Office of Ombudsman for Long-Term Care to request an advocate to assist regarding the termination and contact information for the office, including the office's central telephone number;\n(4) a list of known licensed home care providers in the client's immediate geographic area;\n(5) a statement that the home care provider will participate in a coordinated transfer of care of the client to another home care provider, health care provider, or caregiver, as required by the home care bill of rights, section 144A.44, subdivision 1, clause (17); and\n(6) the name and contact information of a person employed by the home care provider with whom the client may discuss the notice of termination.\n(b) When the home care provider voluntarily discontinues services to all clients, the home care provider must notify the commissioner, lead agencies, and ombudsman for long-term care about its clients and comply with the requirements in this subdivision.\n(a) The home care provider must have a written policy and system for receiving, investigating, reporting, and attempting to resolve complaints from its clients or clients' representatives. The policy should clearly identify the process by which clients may file a complaint or concern about home care services and an explicit statement that the home care provider will not discriminate or retaliate against a client for expressing concerns or complaints. A home care provider must have a process in place to conduct investigations of complaints made by the client or the client's representative about the services in the client's plan that are or are not being provided or other items covered in the client's home care bill of rights. This complaint system must provide reasonable accommodations for any special needs of the client or client's representative if requested.\n(b) The home care provider must document the complaint, name of the client, investigation, and resolution of each complaint filed. The home care provider must maintain a record of all activities regarding complaints received, including the date the complaint was received, and the home care provider's investigation and resolution of the complaint. This complaint record must be kept for each event for at least two years after the date of entry and must be available to the commissioner for review.\n(c) The required complaint system must provide for written notice to each client or client's representative that includes:\n(1) the client's right to complain to the home care provider about the services received;\n(2) the name or title of the person or persons with the home care provider to contact with complaints;\n(3) the method of submitting a complaint to the home care provider; and\n(4) a statement that the provider is prohibited against retaliation according to paragraph (d).\n(d) A home care provider must not take any action that negatively affects a client in retaliation for a complaint made or a concern expressed by the client or the client's representative.\nThe home care provider must have a written plan of action to facilitate the management of the client's care and services in response to a natural disaster, such as flood and storms, or other emergencies that may disrupt the home care provider's ability to provide care or services. The licensee must provide adequate orientation and training of staff on emergency preparedness.\n(a) If a client, family member, or other caregiver of the client requests that an employee or other agent of the home care provider discontinue a life-sustaining treatment, the employee or agent receiving the request:\n(1) shall take no action to discontinue the treatment; and\n(2) shall promptly inform the supervisor or other agent of the home care provider of the client's request.\n(b) Upon being informed of a request for termination of treatment, the home care provider shall promptly:\n(1) inform the client that the request will be made known to the physician, advanced practice registered nurse, or physician assistant who ordered the client's treatment;\n(2) inform the physician, advanced practice registered nurse, or physician assistant of the client's request; and\n(3) work with the client and the client's physician, advanced practice registered nurse, or physician assistant to comply with the provisions of the Health Care Directive Act in chapter 145C.\n(c) This section does not require the home care provider to discontinue treatment, except as may be required by law or court order.\n(d) This section does not diminish the rights of clients to control their treatments, refuse services, or terminate their relationships with the home care provider.\n(e) This section shall be construed in a manner consistent with chapter 145B or 145C, whichever applies, and declarations made by clients under those chapters.\nHome care providers may exercise the authority and are subject to the protections in section 342.57, subdivision 2.\n[See Note.]",
	"repealed": false
}