{
	"id": "465.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.78",
	"title": "465.78 PARTICIPATE IN ECONOMIC DEVELOPMENT SECONDARY MARKET.",
	"text": "(a) A municipality may sell at private or public sale, at the price or prices determined by the municipality, any note, mortgage, lease, sublease, lease purchase, or other instrument or obligation evidencing or securing a loan made for the purpose of economic development, job creation, redevelopment, or community revitalization to a business, for-profit or nonprofit organization, or an individual.\n(b) Sales under this section must be made through arrangements whereby the ultimate sale of the instrument is to be made as part of a pool of instruments on behalf of one or more other municipalities, port authorities, housing and redevelopment authorities, or rural development finance authorities (other than a port authority or housing and redevelopment authority located wholly or partly within the municipality). The restrictions of the previous sentence do not apply if the sale is a public sale or if the proposed sale is submitted to and approved by the commissioner of commerce. The commissioner shall review the proposed sale to determine if the agreed-upon price adequately compensates the municipality, given the maturity, risk, and yield of the instrument. If a proposed sale is submitted to the commissioner of commerce and the sale is not disapproved in writing by the commissioner within 30 days, the sale is deemed approved. The restrictions contained in this paragraph apply to sales made under sections 469.059, subdivision 17; 469.101, subdivision 22; and 469.146, subdivision 3.\n(c) This section does not apply to an obligation to make payments to the municipality, if the underlying obligation arose out of a transaction in which the proceeds of the loan were financed by revenues derived from tax increments from a tax increment financing district that includes property owned by the borrower. For the purpose of this section, a \"municipality\" is any home rule charter city, statutory city, county, or town.",
	"repealed": false
}