{
	"id": "16A.672",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.672",
	"title": "16A.672 BONDS AND CERTIFICATES OF INDEBTEDNESS.",
	"text": "The commissioner may issue, execute, deliver, register, and pay bonds and certificates of indebtedness in the form and manner provided in this section, when authorized under section 16A.641 or 16A.671.\nAll bonds and certificates are securities under sections 336.8-101 to 336.8-603. The commissioner may do for the state whatever may or must be done under those sections to comply with the orders authorizing them. The bonds or certificates may be issued:\n(1) in one or more denominations;\n(2) in bearer form, with interest coupons attached; and\n(3) with provision for registration as to principal only; or\n(4) in fully registered form; and\n(5) with provision for registration of conversion and exchange of forms and denominations, transfer of ownership, and replacement of lost or damaged bonds.\n(a) Bonds and certificates of indebtedness may be printed or otherwise reproduced in the style and form the commissioner prescribes. They may state in a general way the purpose for which they are issued and the security provided for their payment or may incorporate the authorizing order by reference.\n(b) They must be executed by the commissioner under the commissioner's official seal. The signature may be a reproduced facsimile, but no bond or certificate is valid for any purpose unless it is manually signed on its face by the commissioner or by a duly authorized representative of a bank or trust company named by the commissioner as an agent of the state to authenticate it.\nThe commissioner may name a bank or trust company in or out of the state to act as the state's agent to deliver bonds or certificates to the initial purchaser upon payment of the purchase price.\nThe commissioner, in order to issue any bonds or certificates, may name a registrar to act for the state under sections 336.8-101 to 336.8-603, and to authenticate and deliver obligations upon initial issuance and registration of transfer, exchange, or conversion. The registrar must be an incorporated bank or trust company, in or out of the state, authorized by the laws of the United States or the state in which it is located to perform these duties.\nThe order authorizing bonds or certificates to be issued may contain provisions that the commissioner considers necessary to ensure full and prompt payment of principal and interest when due. The order may provide for payment at the office of a bank or trust company in or out of the state. The order may provide that interest due on any interest payment date is payable to the person or entity shown as the owner of the bond or certificate in the register on a specified date preceding the interest payment date, by check, draft, or other transfer to the order of that owner.\nThe commissioner may make agreements to carry out orders issued under this section. The agreements may provide for the paying for services performed and expenses incurred on behalf of the state, from:\n(1) proceeds of the bonds or certificates;\n(2) other money appropriated to the commissioner;\n(3) charges to holders of the bonds or certificates; or\n(4) a combination of sources in clauses (1), (2), and (3).\nThe proceeds of the bonds or certificates under subdivision 7 are appropriated as necessary to pay expenses incurred under that subdivision.\nThe money needed to pay when due the compensation and expenses of registrars, delivery agents, and paying agents, and the expenses of other agreements under subdivision 7 is appropriated annually to the commissioner from the general fund.\nCertificates may be issued with or without regard to whether the interest to be paid on them is includable in gross income for federal tax purposes. If it is intended that the interest on the certificates be exempt from federal income taxes, the commissioner shall certify for the state on the date of issue the facts, estimates, and circumstances that lead the commissioner reasonably to expect that the proceeds of the certificates will not be used in a way that would cause the interest on the certificates to be subject to federal income taxes. The commissioner may covenant with the holders of the certificates that the state will comply with the provisions of the United States Internal Revenue Code then or later enacted that apply or may apply to the certificates and that establish conditions under which the interest to be paid on the certificates will not be subject to federal income taxes. The commissioner and all other state officers shall act or refrain from acting as necessary to comply with the covenants. A sum sufficient to meet the cost of compliance is annually appropriated to the commissioner from the general fund.\nAn agreement under subdivision 7 is not effective until approved as to form and execution by the attorney general or a designee.\nInformation in any register of ownership of bonds or certificates is nonpublic data under section 13.02, subdivision 9, or private data on individuals under section 13.02, subdivision 12. The information is open only to the subject of it, except as disclosure:\n(1) is necessary for the registrar, the commissioner, or the legislative auditor to perform a duty; or\n(2) is requested by an authorized representative of the state commissioner of revenue, the state attorney general, or the United States commissioner of internal revenue to determine the application of a tax; or\n(3) is required under section 13.03, subdivision 4.\nThe commissioner may provide for listing of any bonds or certificates of indebtedness on an exchange or similar arrangement to facilitate their sale and exchange in the secondary market.\nThe commissioner and any other officer of a state department or state agency charged with the responsibility of issuing bonds for or on behalf of the state department or agency, may enter into written agreements or contracts relating to the continuing disclosure of information necessary to comply with, or facilitate the issuance of bonds in accordance with, federal securities laws, rules, and regulations, including securities and exchange commission rules and regulations, section 240.15c2-12. An agreement may be in the form of covenants with purchasers and holders of bonds set forth in the order or resolution authorizing the issuance of the bonds, or a separate document authorized by the order or resolution.",
	"repealed": false
}