{
	"id": "473.844",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.844",
	"title": "473.844 METROPOLITAN LANDFILL ABATEMENT FUND.",
	"text": "The money in the environmental fund for landfill abatement must be used to reduce to the greatest extent feasible and prudent the need for and practice of land disposal of mixed municipal solid waste in the metropolitan area. This money consists of revenue deposited in the environmental fund under section 473.843, subdivision 2, clause (1), and interest earned on investment of this money. All repayments to loans made under this section must be credited to the environmental fund. The landfill abatement money in the environmental fund may be spent only for purposes of metropolitan landfill abatement as provided in subdivision 1a and only upon appropriation by the legislature.\n(a) The money in the account may be spent only for the following purposes:\n(1) assistance to any person for resource recovery projects funded under subdivision 4 or projects to develop and coordinate markets for reusable or recyclable waste materials, including related public education, planning, and technical assistance;\n(2) grants to counties under section 473.8441;\n(3) program administration;\n(4) public education on solid waste reduction and recycling;\n(5) solid waste research; and\n(6) grants to multicounty groups for regionwide planning for solid waste management system operations and use of management capacity.\n(b) The commissioner shall allocate at least 50 percent of the annual revenue received by the account for grants to counties under section 473.8441.\nMS 1986 [Repealed, 1987 c 348 s 52]\nMS 1990 [Repealed, 1991 c 337 s 90]\nThe grant and loan program under this subdivision is administered by the commissioner. Grants and loans may be made to any person for resource recovery projects. The grants and loans may include the cost of planning, acquisition of land and equipment, and capital improvements. Grants and loans for planning may not exceed 50 percent of the planning costs. Grants and loans for acquisition of land and equipment and for capital improvements may not exceed 50 percent of the cost of the project. Grants and loans may be made for public education on the need for the resource recovery projects. A grant or loan for land, equipment, or capital improvements may not be made until the director has determined the total estimated capital cost of the project and ascertained that full financing of the project is assured. Grants and loans made to cities, counties, or solid waste management districts must be for projects that are in conformance with approved plans. A grant or loan to a city or town must be reviewed and approved by the county for conformance with the county plan. The commissioner shall require, where practical, cooperative purchase between cities, counties, and districts of capital equipment.\nMS 1986 [Repealed, 1987 c 348 s 52]",
	"repealed": false
}