{
	"id": "191.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/191.06",
	"title": "191.06 ENLISTMENT.",
	"text": "Militia members called out for duty shall be mustered at once into the service of the state for such period as the governor shall direct, not exceeding the duration of the war or other occasion for which they were called out and for six months thereafter.\nExcept as otherwise expressly provided, all the military forces shall be organized as prescribed for organization of the National Guard at the time, and shall be officered, equipped, trained, and commanded according to the laws and regulations governing the National Guard, as nearly as practicable, and all laws relating to the National Guard or to the duties, rights, privileges, or immunities of the members thereof shall apply to and govern the other military forces and the members thereof, so far as applicable; provided, that the age limits for initial appointment of officers in the federally recognized National Guard shall not apply to officers of the other military forces.\nExcept as otherwise expressly provided, the pay and allowances of the officers and enlisted personnel of all branches of the military forces on active duty in the service of the state shall be the same as provided for the National Guard when on such duty.\nThe governor may receive from the federal government any arms, equipment, munitions, supplies, and other grants for the use of the military forces of the state that may be available.\nThe military forces shall be uniformed in such manner as the governor may prescribe, subject to federal laws or regulations.\nWithout limiting any power otherwise conferred on the governor, whenever any part of the National Guard of this state has been or is about to be called or ordered into active federal service, and until such service or the occasion therefor has terminated and all units of the National Guard engaged therein have been relieved therefrom and have returned and become available for duty within the state, the governor may organize from the militia and maintain within the state such forces as the governor deems necessary.",
	"repealed": false
}