{
	"id": "256.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.012",
	"title": "256.012 MINNESOTA MERIT SYSTEM.",
	"text": "The commissioner of human services shall promulgate by rule personnel standards on a merit basis in accordance with federal standards for a merit system of personnel administration for all employees of county boards engaged in the administration of community social services or income maintenance programs, all employees of human services boards that have adopted the rules of the Minnesota Merit System, and all employees of local social services agencies.\nExcluded from the rules are employees of institutions and hospitals under the jurisdiction of the aforementioned boards and agencies; employees of county personnel systems otherwise provided for by law that meet federal merit system requirements; duly appointed or elected members of the aforementioned boards and agencies; and the director of community social services and employees in positions that, upon the request of the appointing authority, the commissioner chooses to exempt, provided the exemption accords with the federal standards for a merit system of personnel administration.\n(a) The cost of merit system operations shall be paid by counties and other entities that utilize merit system services. Total costs shall be determined by the commissioner annually and must be set at a level that neither significantly overrecovers nor underrecovers the costs of providing the service. The costs of merit system services shall be prorated among participating counties in accordance with an agreement between the commissioner and these counties. Participating counties will be billed quarterly in advance and shall pay their share of the costs upon receipt of the billing.\n(b) This subdivision does not apply to counties with personnel systems otherwise provided by law that meet federal merit system requirements. A county that applies to withdraw from the merit system must notify the commissioner of the county's intent to develop its own personnel system. This notice must be provided in writing by December 31 of the year preceding the year of final participation in the merit system. The county may withdraw after the commissioner has certified that its personnel system meets federal merit system requirements.\n(c) A county merit system operations account is established in the special revenue fund. Payments received by the commissioner for merit system costs must be deposited in the merit system operations account and must be used for the purpose of providing the services and administering the merit system.\nThe commissioner shall ensure that participating counties are consulted regularly and offered the opportunity to provide input on the management of the merit system to ensure effective use of resources and to monitor system performance.\nThe commissioner must consult with the commissioner of children, youth, and families on the administration of the merit system, including on the requirements in this section.",
	"repealed": false
}