{
	"id": "352.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.86",
	"title": "352.86 TRANSPORTATION DEPARTMENT PILOTS.",
	"text": "This section applies to any employee of the Department of Transportation in the civil service employment classification of aircraft pilot or chief pilot, who is covered for that employment by the general employee retirement plan, and who elected before June 1, 2008, special retirement coverage under this section by an irrevocable election on forms provided by the executive director.\nMS 2008 [Renumbered subd 6]\nMS 2008 [Renumbered subd 7]\n[Repealed, 2009 c 169 art 12 s 17]\n[Repealed, 1991 c 269 art 3 s 21]\nAn eligible person under subdivision 1 who terminates employment as a state employee on or after age 62 but prior to normal retirement age is entitled, upon application, to a retirement annuity computed under section 352.115, subdivisions 2 and 3, without any reduction for early retirement under section 352.116, subdivision 1.\nAn employee described in subdivision 1, who becomes disabled and physically or mentally unfit to perform occupational duties due to injury, sickness, or other disability, and who is found disqualified for retention as chief pilot or pilot as a result of a physical examination required by applicable federal laws or regulations, may submit an application for disability benefits calculated under section 352.113, subdivision 3. In considering the disability benefit application, the executive director must use the disability standard specified in this subdivision rather than the total and permanent standard specified in section 352.113, subdivision 1. If disability benefits commence under section 352.113, subdivision 3, the appointing authority shall also provide payments from the state airports fund, totaling 75 percent of current monthly salary less the amount payable under section 352.113, subdivision 3. Payments from the state airports fund must be made for five years or until normal retirement age, whichever is earlier. These benefits are in lieu of all other state benefits for the disability, including, but not limited to, workers' compensation benefits.\nAn employee covered by this section must pay an additional employee contribution of 1.6 percent of salary. The Department of Transportation must pay an additional employer contribution of 1.6 percent of salary. These contributions are in addition to the contributions required by section 352.04, subdivisions 2 and 3. They must be made in the manner provided for in section 352.04, subdivisions 4, 5, and 6.",
	"repealed": false
}