{
	"id": "515B.3-105",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-105",
	"title": "515B.3-105 TERMINATION OF CONTRACTS, LEASES; CIC CREATED BEFORE AUGUST 1, 2010.",
	"text": "(a) If entered into prior to termination of the period of declarant control, (i) any management contract, employment contract, or lease of recreational facilities, or garages or other parking facilities, (ii) any contract, lease, or license binding the association, and to which a declarant or an affiliate of a declarant is a party, or (iii) any contract, lease, or license binding the association or any unit owner other than the declarant or an affiliate of the declarant which is not bona fide or which was unconscionable to the unit owners at the time entered into under the circumstances then prevailing, may be terminated without penalty by the association under the procedures described in this section.\n(b) If prior to expiration of the suspension period described in Minnesota Statutes 2008, section 515B.2-121, subsection (c), paragraph (3), a contract, lease, or license of a type described in subsection (a) is entered into by a person having authority to appoint the directors of the master association and is binding upon the master association, then the master association, and not any association, may terminate the contract, lease, or license under the procedures described in this section.\n(c) Termination shall be upon no less than 90 days' notice. Notice of termination shall be given by the association or master association, as applicable, in accordance with section 515B.1-115; provided, that notice shall be effective only if given within two years following the termination of the period of declarant control or the suspension period described in Minnesota Statutes 2008, section 515B.2-121, subsection (c), paragraph (3), as applicable.\n(d) This section does not apply to:\n(1) any lease the termination of which would terminate the common interest community;\n(2) in the case of a cooperative, a mortgage or contract for deed encumbering real estate owned by the association, except that if the mortgage or contract for deed contains a contractual obligation involving a type of contract, lease, or license which may be terminated pursuant to subsection (a) or (b), then that contractual obligation may be terminated pursuant to subsection (c); or\n(3) an agreement between a declarant or an affiliate of a declarant, or a person having authority pursuant to Minnesota Statutes 2008, section 515B.2-121, subsection (c), paragraph (3), to appoint the directors of the master association, and any governmental entity, if such agreement is necessary to obtain governmental approvals, provide financing under any type of government program, or provide for governmentally required access, conservation, drainage, or utilities.\n(e) This section applies only to common interest communities created before August 1, 2010.",
	"repealed": false
}