{
	"id": "60A.139",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.139",
	"title": "60A.139 ELECTRONIC NOTICES AND DOCUMENTS.",
	"text": "In this section, the following words have the meanings given them:\n(1) \"delivered by electronic means\" includes:\n(i) delivery to an email address at which a party has consented to receive notices or documents; or\n(ii) posting on an electronic network or website accessible via the Internet, mobile application, computer, mobile device, tablet, or other electronic device, together with separate notice of posting, which must be provided by electronic mail to the address at which the party has consented to receive notice or by any other delivery method that has been consented to by the party; and\n(2) \"party\" means a recipient of a notice or document required as part of an insurance transaction including, but not limited to, an applicant, an insured, a policyholder, or an annuity contract holder.\nSubject to subdivision 4, a notice to a party or other document required under applicable law in an insurance transaction or that is to serve as evidence of insurance coverage may be delivered, stored, and presented by electronic means so long as it meets the requirements of the Uniform Electronic Transactions Act, chapter 325L.\nDelivery of a notice or document in accordance with this section is considered equivalent to a delivery method required under applicable law, including delivery by first class mail; first class mail, postage prepaid; certified mail; certificate of mail; or certificate of mailing.\nA notice or document may be delivered by electronic means by an insurer to a party under this section if:\n(1) the party has affirmatively consented to that method of delivery and has not withdrawn the consent;\n(2) the party, before giving consent, is provided with a clear and conspicuous statement informing the party of:\n(i) a right or option of the party to have the notice or document provided or made available in paper or another nonelectronic form;\n(ii) the right of the party to withdraw consent to have a notice or document delivered by electronic means and any fees, conditions, or consequences imposed in the event consent is withdrawn;\n(iii) whether the party's consent applies:\n(A) only to the particular transaction as to which the notice or document must be given; or\n(B) to identified categories of notices or documents that may be delivered by electronic means during the course of the parties' relationship;\n(iv)(A) the means, after consent is given, by which a party may obtain a paper copy of a notice or document delivered by electronic means; and\n(B) the fee, if any, for the paper copy; and\n(v) the procedure a party must follow to withdraw consent to have a notice or document delivered by electronic means and to update information needed to contact the party electronically;\n(3) the party:\n(i) before giving consent, is provided with a statement of the hardware and software requirements for access to and retention of a notice or document delivered by electronic means; and\n(ii) consents electronically, or confirms consent electronically, in a manner that reasonably demonstrates that the party can access information in the electronic form that will be used for notices or documents delivered by electronic means to which the party has given consent; and\n(4) after consent of the party is given, the insurer, in the event a change in the hardware or software requirements needed to access or retain a notice or document delivered by electronic means creates a material risk that the party will not be able to access or retain a subsequent notice or document to which the consent applies:\n(i) provides the party with a statement of:\n(A) the revised hardware and software requirements for access to and retention of a notice or document delivered by electronic means;\n(B) the right of the party to withdraw consent without the imposition of a fee, condition, or consequence that was not disclosed under clause (2); and\n(ii) complies with clause (2).\nThis section does not affect requirements related to content or timing of a notice or document required under applicable law.\nIf a provision of applicable law requiring a notice or document to be provided to a party expressly requires verification or acknowledgement of receipt of the notice or document, the notice or document may be delivered by electronic means only if the method used provides for verification or acknowledgement of receipt.\nThe legal effectiveness, validity, or enforceability of a contract or policy of insurance executed by a party may not be denied solely because of the failure to obtain electronic consent or confirmation of consent of the party in accordance with subdivision 4, clause (3), item (ii).\n(a) A withdrawal of consent by a party does not affect the legal effectiveness, validity, or enforceability of a notice or document delivered by electronic means to the party before the withdrawal of consent is effective.\n(b) A withdrawal of consent by a party is effective within a reasonable period of time after receipt of the withdrawal by the insurer.\n(c) Failure by an insurer to comply with subdivision 4, clause (4), may be treated, at the election of the party, as a withdrawal of consent for purposes of this section.\nIf the consent of a party to receive certain notices or documents in an electronic form is on file with an insurer before August 1, 2013, and, pursuant to this section, an insurer intends to deliver additional notices or documents to the party in an electronic form then, before delivering the additional notices or documents electronically, the insurer shall notify the party of:\n(1) the notices or documents that may be delivered by electronic means under this section that were not previously delivered electronically; and\n(2) the party's right to withdraw consent to have notices or documents delivered by electronic means.\nNotwithstanding any other provisions of this section and of section 60A.08, subdivision 3, standard property and casualty insurance policies and endorsements that do not contain personally identifiable information may be mailed, delivered, or posted on the insurer's website. If the insurer elects to post insurance policies and endorsements on its website in lieu of mailing or delivering them to the insured, it must comply with all of the following conditions:\n(1) the policy and endorsements must be accessible and remain that way for as long as the policy is in force;\n(2) after the expiration of the policy, the insurer must archive its expired policies and endorsements for a period of five years and make them available upon request;\n(3) the policies and endorsements must be posted in a manner that enables the insured to print and save the policy and endorsements using programs or applications that are widely available on the Internet and free to use;\n(4) the insurer provides the following information in or simultaneously with each declarations page provided at the time of issuance of the initial policy and any renewals of that policy:\n(i) a description of the exact policy and endorsement forms purchased by the insured;\n(ii) a method by which the insured may obtain, upon request and without charge, a paper copy of the policy; and\n(iii) the Internet address where the policy and endorsements are posted; and\n(5) the insurer provides notice, in the manner it customarily communicates with an insured, of any changes to the forms or endorsements, the insured's right to obtain, upon request and without charge, a paper copy of such forms or endorsements, and the Internet address where such forms or endorsements are posted.\nExcept as otherwise provided by law, if an oral communication or a recording of an oral communication from a party can be reliably stored and reproduced by an insurer, the oral communication or recording may qualify as a notice or document delivered by electronic means for purposes of this section. If a provision of this title or applicable law requires a signature or notice or document to be notarized, acknowledged, verified, or made under oath, the requirement is satisfied if the electronic signature of the person authorized to perform those acts, together with all other information required to be included by the provision, is attached to or logically associated with the signature, notice, or document.\nThis section may not be construed to modify, limit, or supersede the provisions of the federal Electronic Signatures in Global and National Commerce Act, Public Law 106-229, as amended.\nThis section does not apply to:\n(1) a nonprofit health service plan corporation licensed under chapter 62C;\n(2) a health maintenance organization licensed under chapter 62D; or\n(3) a health carrier, as defined under section 62A.011, subdivision 2, that is affiliated with a nonprofit health service plan corporation licensed under chapter 62C or a health maintenance organization licensed under chapter 62D.",
	"repealed": false
}