{
	"id": "326B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.07",
	"title": "326B.07 CONSTRUCTION CODES ADVISORY COUNCIL.",
	"text": "(a) The Construction Codes Advisory Council consists of the following members:\n(1) the commissioner or the commissioner's designee representing the department's Construction Codes and Licensing Division;\n(2) the commissioner of public safety or the commissioner of public safety's designee representing the Department of Public Safety's State Fire Marshal Division;\n(3) one member, appointed by the commissioner, with expertise in and engaged in each of the following occupations or industries:\n(i) certified building officials;\n(ii) fire chiefs or fire marshals;\n(iii) licensed architects;\n(iv) licensed professional engineers;\n(v) commercial building owners and managers;\n(vi) the licensed residential building industry;\n(vii) the commercial building industry;\n(viii) the heating and ventilation industry;\n(ix) a member of the Plumbing Board;\n(x) a member of the Board of Electricity;\n(xi) a member of the Board of High Pressure Piping Systems;\n(xii) the boiler industry;\n(xiii) the manufactured housing industry;\n(xiv) public utility suppliers;\n(xv) the Minnesota Building and Construction Trades Council;\n(xvi) local units of government;\n(xvii) the energy conservation industry; and\n(xviii) building accessibility.\n(b) The commissioner or the commissioner's designee representing the department's Construction Codes and Licensing Division shall serve as chair of the advisory council. For members who are not state officials or employees, compensation and removal of members of the advisory council are governed by section 15.059. The terms of the members of the advisory council shall be four years. The terms of eight of the appointed members shall be coterminous with the governor and the terms of the remaining nine appointed members shall end on the first Monday in January one year after the terms of the other appointed members expire. An appointed member may be reappointed. Each council member shall appoint an alternate to serve in their absence.\nThe council shall review laws, codes, rules, standards, and licensing requirements relating to building construction and may:\n(1) recommend ways to eliminate inconsistencies, to streamline construction regulation and construction procedures, and to improve procedures within and among jurisdictions;\n(2) review and comment on current and proposed laws and rules to promote coordination and consistency;\n(3) advise agencies on possible changes in rules to make them easier to understand and apply; and\n(4) promote the coordination, within each jurisdiction, of the administration and enforcement of construction codes.\nThe council shall meet a minimum of four times each year. The council shall report its findings and recommendations to the commissioner. The council shall recommend changes in laws or rules governing building construction. The council shall establish subcommittees to facilitate its work. If the council establishes subcommittees, it shall include in their memberships representation from entities and organizations expressing an interest in membership. The commissioner shall maintain a list of interested entities and organizations.\nState agencies and local governmental units shall cooperate with the council and, so far as possible, provide information or assistance to it upon its request. The commissioner shall provide necessary staff and administrative support to the council.",
	"repealed": false
}