{
	"id": "325E.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.60",
	"title": "325E.60 RESTROOM ACCESS.",
	"text": "This section may be cited as the \"Restroom Access Act.\"\nFor purposes of this section:\n(a) \"Customer\" means an individual who is lawfully on the premises of a retail establishment.\n(b) \"Eligible medical condition\" means Crohn's disease, ulcerative colitis, any other inflammatory bowel disease, irritable bowel syndrome, or any other medical condition that requires immediate access to a restroom facility.\n(c) \"Retail establishment\" means a place of business open to the general public for the sale of goods or services. Retail establishment does not include a filling station or service station with a structure of 800 square feet or less that has an employee restroom facility located within that structure.\nA retail establishment that has a restroom facility for its employees shall allow a customer to use that facility during normal business hours if the restroom facility is reasonably safe and all of the following conditions are met:\n(1) the customer requesting the use of the employee restroom facility suffers from an eligible medical condition or uses an ostomy device, provided that the existence of the condition or device is documented in writing by the customer's physician or a nonprofit organization whose purpose includes serving individuals who suffer from the condition;\n(2) three or more employees of the retail establishment are working at the time the customer requests use of the employee restroom facility;\n(3) the retail establishment does not normally make a restroom available to the public;\n(4) the employee restroom facility is not located in an area where providing access would create an obvious health or safety risk to the customer or an obvious security risk to the establishment; and\n(5) a public restroom is not immediately accessible to the customer.\n(a) A retail establishment or an employee of a retail establishment is not civilly liable for an act or omission in allowing a customer who claims to have an eligible medical condition to use an employee restroom facility that is not a public restroom if the act or omission:\n(1) is not negligent;\n(2) occurs in an area of the retail establishment that is not accessible to the public; and\n(3) results in an injury to or death of the customer or an individual other than an employee accompanying the customer.\n(b) This section does not require a retail establishment to make any physical changes to an employee restroom facility.\nFor a first violation of this section, the city or county attorney shall issue a warning letter to the retail establishment or employee informing the establishment or employee of the requirements of this section. A retail establishment or an employee of a retail establishment that violates this section after receiving a warning letter is guilty of a petty misdemeanor. The fine for a first offense must not exceed $50.",
	"repealed": false
}