{
	"id": "273.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.33",
	"title": "273.33 EXPRESS, STAGE AND TRANSPORTATION COMPANIES; PIPELINES.",
	"text": "The personal property of express, stage and transportation companies, and of pipeline companies engaged in the business of transporting products, except as otherwise provided by law, shall be listed and assessed in the county, town or district where the same is usually kept.\nThe personal property, consisting of the pipeline system of mains, pipes, and equipment attached thereto, of pipeline companies and others engaged in the operations or business of transporting products by pipelines, shall be listed with and assessed by the commissioner of revenue and the values provided to the city or county assessor by order. This subdivision shall not apply to the assessment of the products transported through the pipelines nor to the lines of local commercial gas companies engaged primarily in the business of distributing products to consumers at retail nor to pipelines used by the owner thereof to supply products exclusively for such owner's own consumption and not for resale to others. If more than 85 percent of the products actually transported over the pipeline is used for the owner's own consumption and not for resale to others, then this subdivision shall not apply; provided, however, that in that event, the pipeline shall be assessed in proportion to the percentage of products actually transported over such pipeline that is not used for the owner's own consumption. On or before August 1, the commissioner shall certify to the auditor of each county, the amount of such personal property assessment against each company in each district in which such property is located. If the commissioner determines that the amount of personal property assessment certified on or before August 1 is in error, the commissioner may issue a corrected certification on or before October 1. The commissioner may correct errors that are merely clerical in nature until December 31.",
	"repealed": false
}