{
	"id": "508.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.13",
	"title": "508.13 REFERENCES TO EXAMINERS; POWERS; REPORTS.",
	"text": "Immediately after the filing of the abstract of title or other evidence of title acceptable to the examiner of titles, the court administrator shall refer the file to the examiner of titles, who shall proceed to examine into the title of the land described in the application, and into the truth of all matters set forth therein. The examiner shall ascertain whether or not the land is occupied, and, if occupied, shall ascertain the nature thereof, and by what right the occupation is held. The examiner shall also ascertain whether or not any judgments exist which may be a lien upon the land. The examiner shall search all public records, and fully investigate all facts pertaining to the title which may be brought to the examiner's notice, and shall file in the case a full report thereof, together with the examiner's opinion upon the title. The court shall not be bound by any report of the examiner of titles, but may require further or other proof. An examiner of titles shall have full power to administer oaths and examine witnesses concerning any matter involved in the examiner's investigation of titles. When, in the opinion of the examiner, the state has any interest in, or lien upon, the land, the examiner shall state the nature and character thereof in the examiner's report, and in such cases, the state shall be joined as a party, and named in the summons as a party thereto, in order that its interest, estate or lien may be defined and preserved. The court administrator shall give notice to the applicant of the filing of such report. If the report of the examiner is adverse to the applicant, the applicant shall have a reasonable time in which to proceed further, or to withdraw the application. This election shall be made in writing and filed with the court administrator. Examiners shall, upon the request of the registrar, advise the registrar upon any act or duty pertaining to the conduct of the office, or prepare the form of any memorial to be made or entered by the registrar.\nIn all cases where under the provisions of this chapter application is made to the court for any order or decree, the court may refer the matter to the examiner of titles for hearing and report in like manner as herein provided for the reference of the initial application for registration.",
	"repealed": false
}