{
	"id": "62J.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.041",
	"title": "62J.041 INTERIM HEALTH PLAN COMPANY COST CONTAINMENT GOALS.",
	"text": "(a) For purposes of this section, the following definitions apply.\n(b) \"Health plan company\" has the definition provided in section 62Q.01.\n(c) \"Total expenditures\" means incurred claims or expenditures on health care services, administrative expenses, charitable contributions, and all other payments made by health plan companies out of premium revenues.\n(d) \"Net expenditures\" means total expenditures minus exempted taxes and assessments and payments or allocations made to establish or maintain reserves.\n(e) \"Exempted taxes and assessments\" means direct payments for taxes to government agencies, contributions to the Minnesota Comprehensive Health Association, the medical assistance provider's surcharge under section 256.9657, the MinnesotaCare provider tax under section 295.52, assessments by the Health Coverage Reinsurance Association, assessments by the Minnesota Life and Health Insurance Guaranty Association, assessments by the Minnesota Risk Adjustment Association, and any new assessments imposed by federal or state law.\n(f) \"Consumer cost-sharing or subscriber liability\" means enrollee coinsurance, co-payment, deductible payments, and amounts in excess of benefit plan maximums.\nThe commissioner of health shall establish cost containment goals for the increase in net expenditures by each health plan company for calendar years 1994, 1995, 1996, and 1997. The cost containment goals must be the same as the annual cost containment goals for health care spending established under section 62J.04, subdivision 1, paragraph (b). Health plan companies that are affiliates may elect to meet one combined cost containment goal.\nHealth plan companies shall submit to the commissioner of health, by April 1, 1994, for calendar year 1993; April 1, 1995, for calendar year 1994; April 1, 1996, for calendar year 1995; April 1, 1997, for calendar year 1996; and April 1, 1998, for calendar year 1997 all information the commissioner determines to be necessary to implement this section. The information must be submitted in the form specified by the commissioner. The information must include, but is not limited to, expenditures per member per month or cost per employee per month, and detailed information on revenues and reserves. The commissioner, to the extent possible, shall coordinate the submittal of the information required under this section with the submittal of the financial data required under chapter 62J, to minimize the administrative burden on health plan companies. The commissioner may adjust final expenditure figures for demographic changes, risk selection, changes in basic benefits, and legislative initiatives that materially change health care costs, as long as these adjustments are consistent with the methodology submitted by the health plan company to the commissioner, and approved by the commissioner as actuarially justified. The methodology to be used for adjustments and the election to meet one cost containment goal for affiliated health plan companies must be submitted to the commissioner by September 1, 1994. Community integrated service networks may submit the information with their application for licensure. The commissioner shall also accept changes to methodologies already submitted. The adjustment methodology submitted and approved by the commissioner must apply to the data submitted for calendar years 1994 and 1995. The commissioner may allow changes to accepted adjustment methodologies for data submitted for calendar years 1996 and 1997. Changes to the adjustment methodology must be received by September 1, 1996, and must be approved by the commissioner.\n(a) The commissioners of health and commerce shall monitor health plan company reserves and net worth as established under chapters 60A, 62C, 62D, 62H, and 64B, with respect to the health plan companies that each commissioner respectively regulates to assess the degree to which savings resulting from the establishment of cost containment goals are passed on to consumers in the form of lower premium rates.\n(b) Health plan companies shall fully reflect in the premium rates the savings generated by the cost containment goals. No premium rate, currently reviewed by the Department of Health or Commerce, may be approved for those health plan companies unless the health plan company establishes to the satisfaction of the commissioner of commerce or the commissioner of health, as appropriate, that the proposed new rate would comply with this paragraph.\n(c) Health plan companies, except those licensed under chapter 60A to sell accident and sickness insurance under chapter 62A, shall annually before the end of the fourth fiscal quarter provide to the commissioner of health or commerce, as applicable, a projection of the level of reserves the company expects to attain during each quarter of the following fiscal year. These health plan companies shall submit with required quarterly financial statements a calculation of the actual reserve level attained by the company at the end of each quarter including identification of the sources of any significant changes in the reserve level and an updated projection of the level of reserves the health plan company expects to attain by the end of the fiscal year. In cases where the health plan company has been given a certificate to operate a new health maintenance organization under chapter 62D, or been licensed as a community integrated service network under chapter 62N, or formed an affiliation with one of these organizations, the health plan company shall also submit with its quarterly financial statement, total enrollment at the beginning and end of the quarter and enrollment changes within each service area of the new organization. The reserve calculations shall be maintained by the commissioners as trade secret information, except to the extent that such information is also required to be filed by another provision of state law and is not treated as trade secret information under such other provisions.\n(d) Health plan companies in paragraph (c) whose reserves are less than the required minimum or more than the required maximum at the end of the fiscal year shall submit a plan of corrective action to the commissioner of health or commerce under subdivision 7.\n(e) The commissioner of commerce, in consultation with the commissioner of health, shall report to the legislature no later than January 15, 1995, as to whether the concept of a reserve corridor or other mechanism for purposes of monitoring reserves is adaptable for use with indemnity health insurers that do business in multiple states and that must comply with their domiciliary state's reserves requirements.\nThe commissioner of health shall publish in the State Register and make available to the public by July 1, 1995, a list of all health plan companies that exceeded their cost containment goal for the 1994 calendar year. The commissioner shall publish in the State Register and make available to the public by July 1, 1996, a list of all health plan companies that exceeded their combined cost containment goal for calendar years 1994 and 1995. The commissioner shall notify each health plan company that the commissioner has determined that the health plan company exceeded its cost containment goal, at least 30 days before publishing the list, and shall provide each health plan company with ten days to provide an explanation for exceeding the cost containment goal. The commissioner shall review the explanation and may change a determination if the commissioner determines the explanation to be valid.\nThe commissioner of commerce shall provide assistance to the commissioner of health in monitoring health plan companies regulated by the commissioner of commerce.\n[Repealed by amendment, 1997 c 150 s 4]",
	"repealed": false
}