{
	"id": "299F.054",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.054",
	"title": "299F.054 DISCLOSURE OF INFORMATION.",
	"text": "An authorized person may, in writing, require an insurance company to release to the requesting person any or all relevant information or evidence the authorized person deems important, which the company may have in its possession, relating to a fire loss or potential fire loss. Relevant information may include, and is limited to:\n(1) pertinent insurance policy information relevant to a fire loss or potential fire loss under investigation including the application for a policy;\n(2) policy premium payment records which are available;\n(3) a history of previous claims made by the insured, including, where the insured is a corporation or partnership, a history of previous claims by a subsidiary or any affiliates, and a history of claims of any other business association in which individual officers or partners or their spouses were known to be involved; and\n(4) material relating to the investigation of the loss or potential loss, including statements of any person, proof of loss or potential loss, and any other evidence relevant to the investigation.\n(a) If an insurance company has reason to believe that a fire loss or potential fire loss in which it has an interest may be of other than accidental cause, the company shall, in writing, notify an authorized person and provide the person with all relevant material specified in this section developed from the company's inquiry into the fire loss or potential fire loss.\n(b) If an insurance company provides any one of the authorized persons with notice of a fire loss or potential fire loss, it is sufficient notice for the purpose of this subdivision.\nThe authorized person provided with information pursuant to subdivision 1 or 2, may in furtherance of official purposes release or provide the information to any of the other authorized persons.\nAn insurance company providing information to an authorized person may request in writing from the authorized person relevant information and receive the information requested within a reasonable time not to exceed 30 days. The relevant information may not include nonconviction criminal history record information or any other information detrimental to another ongoing criminal investigation or that would reveal the identity of a confidential source of information. Any authorized person not furnishing the information requested shall notify the insurance company of the reasons why the information cannot be furnished within 30 days of the request.\n(a) An insurance company or its agent acting in its behalf, or an authorized person who releases information, whether oral or written, acting in good faith, pursuant to subdivisions 1 to 3a is immune from any liability, civil or criminal, that might otherwise be incurred or imposed.\n(b) A person who, acting in good faith, reports to an authorized person information, whether oral or written, that is or may be relevant to the investigation of a fire is immune from any civil liability that might otherwise be incurred or imposed.",
	"repealed": false
}