{
	"id": "86B.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.311",
	"title": "86B.311 GENERAL RULES FOR OPERATION.",
	"text": "A person may not operate or allow the operation of a watercraft or use a device relating to the use of the watercraft:\n(1) in a careless or heedless manner in disregard of the rights or safety of others;\n(2) in a reckless or grossly negligent manner that causes personal injury to another or damage to the property of another;\n(3) upon the waters of this state without the equipment required by this chapter and the rules adopted under this chapter; or\n(4) that is loaded with passengers or cargo beyond the watercraft's safe carrying capacity or is equipped with a motor or other propulsion machinery beyond the watercraft's safe power capacity.\nA person may not operate a watercraft in a manner that obstructs or tends to obstruct normal and ordinary navigation on the waters of this state.\nA person may not moor, attach, or hold in any manner a watercraft to a buoy or any other marking device or guide placed in the waters of this state pursuant to lawful authority. This subdivision does not apply to a mooring buoy.\nA person may not operate a watercraft within a water area that has been marked off or set aside as a swimming or bathing area as prescribed by the commissioner's rules.\nA person may not ride or sit and a person may not operate a motorboat while a person is riding or sitting on (i) the starboard or port gunwales; (ii) the decking over the bow, sides, or stern; or (iii) the transom, of a motorboat while underway unless the motorboat is provided with adequate guards or railing to prevent passengers from falling overboard.\nWhen approaching and passing a law enforcement watercraft with its emergency lights activated, the operator of a watercraft must safely move the watercraft away from the law enforcement watercraft and maintain a slow-no wake speed while within 150 feet of the law enforcement watercraft.",
	"repealed": false
}