{
	"id": "299A.681",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.681",
	"title": "299A.681 FINANCIAL CRIMES ADVISORY BOARD AND TASK FORCE.",
	"text": "The Minnesota Financial Crimes Advisory Board shall provide advice to the commissioner of public safety related to the investigation and prosecution of identity theft and financial crime.\nThe advisory board consists of the following individuals, or their designees:\n(1) the commissioner of public safety;\n(2) the attorney general;\n(3) two chiefs of police, selected by the Minnesota Chiefs of Police Association;\n(4) two sheriffs, selected by the Minnesota Sheriffs Association;\n(5) the United States attorney for the district of Minnesota;\n(6) a county attorney, selected by the Minnesota County Attorneys Association;\n(7) a representative from the Board of Public Defense, selected by that board;\n(8) a representative from a federal law enforcement agency, selected by the advisory board;\n(9) a representative from the retail merchants industry, selected by the advisory board;\n(10) a representative from the banking and credit union industry, selected by the advisory board;\n(11) a representative on behalf of senior citizens, selected by the advisory board;\n(12) the statewide commander of the task force;\n(13) two additional members selected by the advisory board;\n(14) a senator who serves on the committee having jurisdiction over criminal justice policy, chosen by the Subcommittee on Committees of the senate Committee on Rules and Administration; and\n(15) a representative who serves on the committee having jurisdiction over criminal justice policy, chosen by the speaker of the house.\nThe advisory board may adopt procedures to govern its conduct and shall select a chair from among its members. The legislative members of the advisory board may not vote on matters before the board.\nThe advisory board shall offer advice to the commissioner on the development of an overall strategy to ameliorate the harm caused to the public by identity theft and financial crime within Minnesota. The strategy may include the development of protocols and procedures to investigate financial crimes and a structure for best addressing these issues on a statewide basis and in a multijurisdictional manner. The commissioner shall:\n(1) establish a multijurisdictional statewide Minnesota Financial Crimes Task Force to investigate major financial crimes;\n(2) with advice from the advisory board, select a statewide commander of the task force who serves at the pleasure of the commissioner;\n(3) develop an objective grant review application process that is free from conflicts of interest;\n(4) with advice from the advisory board, issue grants to support efforts to combat identity theft and financial crime;\n(5) with advice from the advisory board, assist law enforcement agencies and victims in developing a process to collect and share information to improve the investigation and prosecution of identity theft and financial crime;\n(6) with advice from the advisory board, develop and approve an operational budget for the office of the statewide commander and the Minnesota Financial Crimes Task Force; and\n(7) enter into any contracts necessary to establish and maintain a relationship with retailers, financial institutions, and other businesses to deal effectively with identity theft and financial crime.\nThe task force described in clause (1) may consist of members from local law enforcement agencies, federal law enforcement agencies, state and federal prosecutors' offices, and representatives from retail businesses, financial institutions, and not-for-profit organizations.\n(a) The commissioner of public safety shall appoint a statewide commander.\n(b) The commander shall:\n(1) coordinate and monitor all multijurisdictional identity theft and financial crime enforcement activities;\n(2) facilitate local efforts and ensure statewide coordination with efforts to combat identity theft and financial crime;\n(3) facilitate training for law enforcement and other personnel;\n(4) monitor compliance with investigative protocols;\n(5) implement an outcome evaluation and data quality control process;\n(6) be responsible for the selection and for cause removal of assigned task force investigators who are designated participants under a memorandum of understanding or who receive grant funding;\n(7) provide supervision of assigned task force investigators;\n(8) submit a task force operational budget to the commissioner of public safety for approval; and\n(9) submit quarterly task force activity reports to the advisory board.\nAll law enforcement officers selected to participate in the task force must be licensed peace officers as defined in section 626.84, subdivision 1, or qualified federal law enforcement officers as defined in section 626.8453. Participating officers remain employees of the same entity that employed them before joining any multijurisdictional entity established under this section. Participating officers are not employees of the state.\nLaw enforcement officers participating in any multijurisdictional entity established under this section have statewide jurisdiction to conduct criminal investigations and have the same powers of arrest as those possessed by a sheriff.\nThe commissioner of public safety, with advice from the advisory board, shall make grants to state and local units of government to combat identity theft and financial crime. The commander, as funding permits, may prepare a budget to establish four regional districts and funding grant allocations programs outside the counties of Hennepin, Ramsey, Anoka, Washington, and Dakota. The budget must be reviewed and approved by the commissioner to support these efforts.\n(a) The commissioner may establish a victims' assistance program to assist victims of economic crimes and provide prevention and awareness programs. The commissioner may retain the services of not-for-profit organizations to assist in the development and delivery systems in aiding victims of financial crime. The program may not provide any financial assistance to victims, but may assist victims in obtaining police assistance and advise victims in how to protect personal accounts and identities. Services may include a victim toll-free telephone number, fax number, website, Monday through Friday telephone service, email response, and interfaces to other helpful websites. Victims' information compiled are governed under chapter 13.\n(b) The commissioner may post or communicate through public service announcements in newspapers, radio, television, cable access, billboards, Internet, websites, and other normal advertising channels, a financial reward of up to $2,000 for tips leading to the apprehension and successful prosecution of individuals committing economic crime. All rewards must be approved by the commissioner. The release of funds must be made to an individual whose information leads to the apprehension and prosecution of offenders committing economic or financial crimes against citizens or businesses in Minnesota. All rewards paid to an individual must be reported to the Department of Revenue along with the individual's Social Security number.\nNotwithstanding section 15.059, this section does not expire.\nThe commissioner may accept lawful grants and in-kind contributions from any federal, state, or local source or legal business or individual not funded by this section for general operation support, including personnel costs. These grants or in-kind contributions are not to be directed toward the case of a particular victim or business. The task force's fiscal agent shall handle all funds approved by the commissioner, including in-kind contributions.\nProperty seized by the task force is subject to forfeiture pursuant to sections 609.531, 609.5312, 609.5313, and 609.5315 if ownership cannot be established. The task force shall receive the proceeds from the sale of all property properly seized and forfeited.\n[Repealed by amendment, 2009 c 59 art 5 s 9]\nBy February 1 of each year, the commissioner shall report to the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice policy and funding on the activities of the task force. At a minimum, this annual report must include:\n(1) a description of the task force's goals for the previous year and for the coming year;\n(2) a description of the outcomes the task force achieved or did not achieve during the preceding year and a description of the outcomes they will seek to achieve during the coming year;\n(3) any legislative recommendations the advisory board or commissioner has including, where necessary, a description of the specific legislation needed to implement the recommendations;\n(4) a detailed accounting of how appropriated money, grants, and in-kind contributions were spent; and\n(5) a detailed accounting of the grants awarded under this section.",
	"repealed": false
}