{
	"id": "325M.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/325M.31",
	"title": "325M.31 DEFINITIONS.",
	"text": "(a) For purposes of sections 325M.30 to 325M.34, the following terms have the meanings given.\n(b) \"Accessible user interface\" means a way for a user to input data, make a choice, or take an action on a social media platform in two clicks or fewer.\n(c) \"Account holder\" means a natural person or legal person who holds an account or profile with a social media platform.\n(d) \"Account interactions\" means any action that a user can make within a social media platform that could have a negative impact on another account holder. Account interactions include but are not limited to:\n(1) sending messages or invitations to users;\n(2) reporting users;\n(3) commenting on, resharing, liking, voting, or otherwise reacting to users' user-generated content; and\n(4) posting user-generated content or disseminating user-generated content to users.\nActions that have no impact on other users, including viewing user-generated content or public content, are not account interactions.\n(e) \"Algorithmic ranking system\" means a computational process, including one derived from algorithmic decision making, machine learning, statistical analysis, or other data processing or artificial intelligence techniques, used to determine the selection, order, relative prioritization, or relative prominence of content from a set of information that is provided to a user on a social media platform, including search results ranking, content recommendations, content display, or any other automated content selection method.\n(f) \"Conspicuously\" means the information is presented in a manner, given the information's size, color, contrast, location, and proximity to any related information, as to be readily noticed and understood by a reasonable user.\n(g) \"Content\" means any media, including but not limited to written posts, images, visual or audio recordings, notifications, and games, that a user views, reads, watches, listens to, or otherwise interacts or engages with on a social media platform. Content includes other account holders' accounts or profiles when recommended to a user by the social media platform.\n(h) \"Engage\" or \"engagement\" means a user's utilization of the social media platform.\n(i) \"Expressed preferences\" means a freely given, considered, specific, and unambiguous indication of a user's preferences regarding the user's engagement with a social media platform. Expressed preferences must not be based on the user's time spent engaging with content on the social media platform or on the use of features that do not indicate explicit preference, including comments made, posts reshared, or similar actions that may be taken on content the user perceives to be of low quality. Expressed preferences must not be obtained through a user interface designed or manipulated with the substantial effect of subverting or impairing a user's decision making.\n(j) \"Social media platform\" means an electronic medium, including a browser-based or application-based interactive computer service, Internet website, telephone network, or data network, that allows an account holder to create, share, and view user-generated content for a substantial purpose of social interaction, sharing user-generated content, or personal networking. Social media platform does not include:\n(1) an Internet search provider;\n(2) an Internet service provider;\n(3) an email service;\n(4) a streaming service, online video game, e-commerce, or other Internet website where the content is not user generated but where interactive functions enable chat, comments, reviews, or other interactive functionality that is incidental to, directly related to, or dependent upon providing the content;\n(5) a communication service, including text, audio, or video communication technology, provided by a business to the business's employees and clients for use in the course of business activities and not for public distribution, except that social media platform includes a communication service provided by a social media platform;\n(6) an advertising network with the sole function of delivering commercial content;\n(7) a telecommunications carrier, as defined in United States Code, title 47, section 153;\n(8) a broadband service, as defined in section 116J.39, subdivision 1;\n(9) single-purpose community groups for education or public safety;\n(10) teleconferencing or video-conferencing services that allow reception and transmission of audio and video signals for real-time communication, except that social media platform includes teleconferencing or video-conferencing services provided by a social media platform;\n(11) cloud computing services, which may include cloud storage and shared document collaboration;\n(12) providing or obtaining technical support for a platform, product, or service; or\n(13) a platform designed primarily and specifically for creative professional users, as distinct from the general public, to share their portfolio and creative content, engage in professional networking, acquire clients, and market the creative professional user's creative content and creative services through facilitated transactions.\n(k) \"Time sensitive\" means content that is welcomed under a user's expressed preferences and that has significantly reduced value to the user with the passing of time.\n(l) \"User\" means a natural person who is located in Minnesota and who holds an account or profile with a social media platform.\n(m) \"User-generated content\" means any content created by an account holder that is uploaded, posted, shared, or disseminated on the social media platform.",
	"repealed": false
}