{
	"id": "15.066",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.066",
	"title": "15.066 CONFIRMATION OF APPOINTMENTS.",
	"text": "This section applies to all appointments which by statute require the advice and consent of the senate. For the purpose of this section, the term \"agency\" includes state departments, boards, committees, councils, commissions, authorities, and advisory task forces created by statute.\nIn all appointments to state agencies which require the advice and consent of the senate, the following procedure shall apply:\n(1) the appointing authority shall provide to the president of the senate a letter of appointment which shall include the position title to which the appointment is being made; the name, street address, city and county of the appointee; and the term of the appointment;\n(2) for those positions for which a statement of economic interest is required to be filed by section 10A.09, the appointing authority shall give the notice to the Campaign Finance and Public Disclosure Board required by section 10A.09, subdivision 2, at the time the letter of appointment is directed to the president of the senate;\n(3) if the appointment is subject to the open appointments program provided by section 15.0597, the appointing authority shall provide the senate with a copy of the application provided by section 15.0597, at the time the letter of appointment is directed to the president of the senate; and\n(4) the appointment shall be effective and the appointee may commence to exercise the duties of the office upon the receipt of the letter of appointment by the president of the senate.\n(a) For appointments that require confirmation by only the senate, if the senate does not reject an appointment within 60 legislative days of the day of receipt of the letter of appointment by the president of the senate, the senate has consented to the appointment.\n(b) For appointments that require confirmation by both the senate and the house of representatives, if neither the senate nor the house of representatives has rejected an appointment within 60 legislative days of the later of the day of receipt of the letter of appointment by the president of the senate or the day of receipt of the letter of appointment by the speaker of the house of representatives, the house of representatives and senate have consented to the appointment.\n(c) This section does not apply to appointments to the Campaign Finance and Public Disclosure Board under section 10A.02.\n[See Note.]",
	"repealed": false
}