{
	"id": "168.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.15",
	"title": "168.15 RIGHTS AS TO REGISTRATION CERTIFICATE AND PLATES.",
	"text": "(a) Upon the transfer of ownership, destruction, theft, dismantling, or permanent removal by the owner from this state of any vehicle registered in accordance with this chapter, the right of the owner of the vehicle to use the registration certificate and plates assigned to the vehicle expires.\n(b) When the ownership of a vehicle is transferred to another person required to register the vehicle in this state, the transferor shall assign the registration tax paid to the credit of the transferee unless the registration stickers are surrendered to the commissioner before the first day of the new registration period.\n(c) When seeking to become the owner by gift, trade, or purchase of any vehicle for which a registration certificate has been issued under this chapter, a person shall join with the registered owner in transmitting with the application for transfer of ownership, the registration certificate, with the assignment and notice of sale duly executed.\n(d) In case of loss of the title or certificate of registration of a vehicle not subject to section 325E.15, the person shall make application to the commissioner with proof of loss of the title as specified in section 168A.09 and assign a notice of sale of the vehicle on the application for title as specified in section 168A.04.\n(e) Upon the transfer of any vehicle by a manufacturer or dealer, for use within the state, whether by sale, lease, or otherwise, the transferor shall, within ten days after the transfer, file with the commissioner (1) a notice containing the date of transfer, a description of the vehicle, and the transferee's name and residence address in the state or if not a natural person then the transferee's business and mailing address, and (2) the transferee's application for registration.\nMS 2004 [Repealed, 1Sp2005 c 6 art 3 s 108]",
	"repealed": false
}