{
	"id": "297E.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.03",
	"title": "297E.03 SPORTS BOOKMAKING TAX.",
	"text": "An excise tax of six percent is imposed on the value of all bets received by, recorded by, accepted by, forwarded by, or placed with a person engaged in sports bookmaking.\nFor purposes of this section, the term \"bet\" has the meaning given it in section 609.75, subdivision 2.\nFor purposes of this section, the term \"sports bookmaking\" has the meaning given it in section 609.75, subdivision 7.\nIn determining the value or amount of any bet for purposes of this section, all charges incident to the placing of the bet must be included.\nA person engaged in sports bookmaking shall file monthly tax returns with the commissioner of revenue, in the form required by the commissioner, of all bookmaking activity, and shall include information on all bets recorded, accepted, forwarded, and placed. The returns must be filed on or before the 20th day of the month following the month in which the bets reported were recorded, accepted, forwarded, or placed. The tax imposed by this section is due and payable at the time when the returns are filed.\nEach person who is engaged in receiving, recording, forwarding, or accepting sports bookmaking bets is liable for and shall pay the tax imposed under this section.\nThe tax may be assessed by the commissioner of revenue. An assessment made pursuant to this section shall be considered a jeopardy assessment or jeopardy collection as provided in section 270C.36. The commissioner shall assess the tax based on personal knowledge or information available to the commissioner. The commissioner shall mail to the taxpayer at the taxpayer's last known address, or serve in person, a written notice of the amount of tax, demand its immediate payment, and, if payment is not immediately made, collect the tax by any method described in chapter 270C, except that the commissioner need not await the expiration of the times specified in chapter 270C. The tax assessed by the commissioner is presumed to be valid and correctly determined and assessed.\n(a) Notwithstanding any law to the contrary, neither the commissioner nor a public employee may reveal facts contained in a sports bookmaking tax return filed with the commissioner of revenue as required by this section, nor can any information contained in the report or return be used against the tax obligor in any criminal proceeding, unless independently obtained, except in connection with a proceeding involving taxes due under this section, or as provided in section 270C.055, subdivision 1.\n(b) Any person violating this section is guilty of a gross misdemeanor.\n(c) This section does not prohibit the commissioner from publishing statistics that do not disclose the identity of tax obligors or the contents of particular returns or reports.",
	"repealed": false
}