{
	"id": "504B.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.205",
	"title": "504B.205 RESIDENTIAL TENANT'S RIGHT TO SEEK POLICE AND EMERGENCY ASSISTANCE.",
	"text": "In this section, \"domestic abuse\" has the meaning given in section 518B.01, subdivision 2.\n(a) A landlord may not:\n(1) bar or limit a residential tenant's right to call for police or emergency assistance in response to domestic abuse or any other conduct, including but not limited to mental health or health crises; or\n(2) impose a penalty on a residential tenant for calling for police or emergency assistance in response to domestic abuse or any other conduct, including but not limited to mental health or health crises.\n(b) A residential tenant may not waive and a landlord may not require the residential tenant to waive the residential tenant's right to call for police or emergency assistance.\nThis section preempts any inconsistent local ordinance or rule including, without limitation, any ordinance or rule that:\n(1) requires an eviction after a specified number of calls by a residential tenant for police or emergency assistance in response to domestic abuse or any other conduct, including but not limited to mental health or health crises; or\n(2) provides that calls by a residential tenant for police or emergency assistance in response to domestic abuse or any other conduct, including but not limited to mental health or health crises, may be used to penalize or charge a fee to a landlord.\nThis subdivision shall not otherwise preempt any local ordinance or rule that penalizes a landlord for, or requires a landlord to abate, conduct on the premises that constitutes a nuisance or other disorderly conduct as defined by local ordinance or rule.\nThis section shall not be construed to condone or permit any breach of a lease or of law by a residential tenant including, but not limited to, disturbing the peace and quiet of other tenants, damage to property, and disorderly conduct.\nA residential tenant may bring a civil action for a violation of this section and recover from the landlord $250 or actual damages, whichever is greater, and reasonable attorney's fees.\nThe attorney general has authority under section 8.31 to investigate and prosecute violations of this section.",
	"repealed": false
}