{
	"id": "326B.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.50",
	"title": "326B.50 DEFINITIONS.",
	"text": "For the purposes of sections 326B.50 to 326B.59, the terms defined in this section have the meanings given them.\n\"Responsible licensed master\" means the licensed water conditioning master or licensed master plumber designated in writing by the water conditioning contractor in the water conditioning contractor's license application, or in another manner acceptable to the commissioner, as the individual responsible for the water conditioning contractor's compliance with sections 326B.50 to 326B.59, all rules adopted under these sections, the Minnesota Plumbing Code, and all orders issued under section 326B.082.\n\"Single family residential unit\" means a building or portion thereof which is arranged, designed, used or intended to be used for residential occupancy by one family, but not including a motel, hotel or rooming house.\n\"Water conditioning contractor\" means a person who performs or offers to perform any water conditioning installation or water conditioning servicing, with or without compensation, who is licensed as a water conditioning contractor by the commissioner.\n\"Water conditioning installation\" means the installation of appliances, appurtenances, and fixtures designed to treat water so as to alter, modify, add or remove mineral, chemical or bacterial content, said installation to be made in a water distribution system serving:\n(1) a single family residential unit, which has been initially established by a licensed plumber, and does not involve a direct connection without an air gap to a soil or waste pipe; or\n(2) a multifamily or nonresidential building, where the plumbing installation has been initially established by a licensed plumber. Isolation valves shall be required for all water conditioning installations and shall be readily accessible. Water conditioning installation does not include:\n(i) a valve that allows isolation of the water conditioning installation;\n(ii) piping greater than two-inch nominal pipe size; or\n(iii) a direct connection without an air gap to a soil or waste pipe.\n\"Water conditioning journeyworker\" means an individual, other than a water conditioning master, who has demonstrated practical knowledge of water conditioning installation and servicing, and who is licensed by the commissioner as a water conditioning journeyworker.\n\"Water conditioning master\" means an individual who has demonstrated skill in planning, superintending, installing, and servicing water conditioning installations, and who is licensed by the commissioner as a water conditioning master.\n\"Water conditioning servicing\" means the servicing (including servicing prior to installation) of a water conditioning installation.\n\"Direct supervision,\" with respect to direct supervision of a registered unlicensed individual, means that:\n(1) at all times while the registered unlicensed individual is performing water conditioning installation work, a direct supervisor is present at the location where the registered unlicensed individual is working;\n(2) the direct supervisor is physically present and immediately available to the registered unlicensed individual at all times for assistance and direction;\n(3) any form of electronic supervision does not meet the requirement of being physically present;\n(4) the direct supervisor reviews the water conditioning installation work performed by the registered unlicensed individual before the water conditioning installation is operated; and\n(5) the direct supervisor determines that all water conditioning installation work performed by the registered unlicensed individual is performed in compliance with sections 326B.50 to 326B.59, all rules adopted under these sections, the Minnesota Plumbing Code, and all orders issued under section 326B.082.\n\"Direct supervisor\" means a master plumber, journeyworker plumber, restricted master plumber, restricted journeyworker plumber, water conditioning master, or water conditioning journeyworker responsible for providing direct supervision of a registered unlicensed individual.",
	"repealed": false
}