{
	"id": "279.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/279.01",
	"title": "279.01 DUE DATES; PENALTIES.",
	"text": "(a) When the taxes against any tract or lot exceed $100, one-half of the amount of tax due must be paid prior to May 16, and the remaining one-half must be paid prior to the following October 16. If either tax amount is unpaid as of its due date, a penalty is imposed at a rate of two percent on homestead property and four percent on nonhomestead property. If complete payment has not been made by the first day of the month following either due date, an additional penalty of two percent on homestead property and four percent on nonhomestead property is imposed. Thereafter, for both homestead and nonhomestead property, on the first day of each subsequent month through December, an additional penalty of one percent for each month accrues and is charged on all such unpaid taxes provided that the penalty must not exceed eight percent in the case of homestead property, or 12 percent in the case of nonhomestead property.\n(b) If the property tax statement was not postmarked prior to April 25, the first half payment due date in paragraph (a) shall be 21 days from the postmark date of the property tax statement, and all penalties referenced in paragraph (a) shall be determined with regard to the later due date.\n(c) In the case of a tract or lot with taxes of $100 or less, the due date and penalties as specified in paragraph (a) or (b) for the first half payment shall apply to the entire amount of the tax due.\n(d) For commercial use real property used for seasonal residential recreational purposes and classified as class 1c or 4c, and on other commercial use real property classified as class 3a, provided that over 60 percent of the gross income earned by the enterprise on the class 3a property is earned during the months of May, June, July, and August, the first half payment is due prior to June 1. For a class 3a property to qualify for the later due date, the owner of the property must attach an affidavit to the payment attesting to compliance with the income requirements of this paragraph.\n(e) This section applies to payment of personal property taxes assessed against improvements to leased property, except as provided by section 277.01, subdivision 3.\n(f) A county may provide by resolution that in the case of a property owner that has multiple tracts or parcels with aggregate taxes exceeding $100, payments may be made in installments as provided in this subdivision.\n(g) The county treasurer may accept payments of more or less than the exact amount of a tax installment due. Payments must be applied first to the oldest installment that is due but which has not been fully paid. If the accepted payment is less than the amount due, payments must be applied first to the penalty accrued for the year or the installment being paid. Acceptance of partial payment of tax does not constitute a waiver of the minimum payment required as a condition for filing an appeal under section 278.03 or any other law, nor does it affect the order of payment of delinquent taxes under section 280.39.\n(a) The county board may, with the concurrence of the county treasurer, delegate to the county treasurer the power to abate the penalty provided for late payment of taxes in the current year. Notwithstanding section 270C.86, if any county board so elects, the county treasurer may abate the penalty on finding that the imposition of the penalty would be unjust and unreasonable.\n(b) The county treasurer shall abate the penalty provided for late payment of taxes in the current year if the property tax payment is delivered by mail to the county treasurer and the envelope containing the payment is postmarked by the United States Postal Service within one business day of the due date prescribed under this section, but only if the property owner requesting the abatement has not previously received an abatement of penalty for late payment of tax under this paragraph. If the envelope containing the payment does not contain a postmark of the United States Postal Service, or the postmark is illegible, proof of mailing within one business day of the due date may be provided by affidavit of the property owner requesting the abatement.\nIn the case of class 1b agricultural homestead, class 2a agricultural homestead property, class 2a agricultural nonhomestead property, and class 2b rural vacant land that is part of an agricultural homestead, no penalties shall attach to the second one-half property tax payment as provided in this section if paid by November 15. Thereafter, penalties shall attach as provided in subdivision 1.\nIf the owner of class 1b agricultural homestead or class 2a agricultural property receives a consolidated property tax statement that shows only an aggregate of the taxes and special assessments due on that property and on other property not classified as class 1b agricultural homestead or class 2a agricultural property, the aggregate tax and special assessments shown due on the property by the consolidated statement will be due on November 15.\nIn the case of class 4c seasonal residential recreational property not used for commercial purposes, penalties shall accrue and be charged on unpaid taxes at the times and at the rates provided in subdivision 1 for homestead property.\nIn the case of a homestead property owned by an individual who is on federal active service, as defined in section 190.05, subdivision 5c, as a member of the National Guard or a reserve component, a four-month grace period is granted for complying with the due dates imposed by subdivision 1. During this period, no late fees or penalties shall accrue against the property. The due date for property taxes owed under this chapter for an individual covered by this subdivision shall be September 15 for taxes due on May 15, and February 15 of the following year for taxes due on October 15. A taxpayer making a payment under this subdivision must accompany the payment with a signed copy of the taxpayer's orders or form DD214 showing the dates of active service which clearly indicate that the taxpayer was in active service as a member of the National Guard or a reserve component on the date the payment was due. This grace period applies to all homestead property owned by individuals on federal active service, as herein defined, for all of that property's due dates which fall on a day that is included in the taxpayer's federal active service.",
	"repealed": false
}