{
	"id": "383B.1581",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.1581",
	"title": "383B.1581 DESIGN-BUILD PROCESS.",
	"text": "If the county board determines that the design-build best value method of project delivery is appropriate for a project, the county board shall establish a two-phase procedure for awarding the design-build contract.\nThe county, after considering recommendations from the design-build selection panel, shall prepare or have prepared an RFQ. The RFQ must include the following:\n(1) the minimum qualifications of design-builders necessary to meet the requirements for acceptance;\n(2) a scope of work statement and schedule;\n(3) documents defining the project requirements;\n(4) the form of contract to be awarded;\n(5) the weighted selection criteria for compiling a short list and the number of firms to be included in the short list, which must be at least two but not more than five;\n(6) a description of the request for proposals (RFP) requirements;\n(7) the maximum time allowed for design and construction;\n(8) the county board's estimated cost of design and construction;\n(9) requirements for construction experience, design experience, financial, personnel, and equipment resources available from potential design-builders for the project and experience in other design-build projects or similar projects, provided that these requirements may not unduly restrict competition; and\n(10) the requirement that the primary designer be designated in the response to the RFQ; and\n(11) a statement that \"past performance\" or \"experience\" does not include the exercise or assertion of a person's legal rights.\n(a) The county shall solicit and evaluate proposals and select a design-builder in two phases.\n(b) In phase one, the county board, after considering the recommendations from the design-build selection panel, shall adopt a short list of no more than five of the most highly qualified firms in accordance with qualifications criteria described in the RFQ. Prior to adoption of the short list by the county board, the designer selection committee may require clarification from the design-builders to ensure conformance of proposals to the RFQ. The county must not consider cost-related or price-related evaluation factors in phase one.\n(c) In phase two, the design-build selection panel shall use the evaluation criteria in the RFP to determine the design-build proposal to be the most advantageous and the best value to the public. Prior to award of a contract, the design-build selection panel and, if necessary, the county board may require clarification from the design-builders to ensure conformance of proposals to the RFP.",
	"repealed": false
}