{
	"id": "325E.3892",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.3892",
	"title": "325E.3892 LEAD AND CADMIUM IN CONSUMER PRODUCTS; PROHIBITION.",
	"text": "For purposes of this section, \"covered product\" means any of the following products or product components:\n(1) jewelry;\n(2) toys;\n(3) cosmetics and personal care products;\n(4) puzzles, board games, card games, and similar games;\n(5) play sets and play structures;\n(6) outdoor games;\n(7) school supplies;\n(8) pots and pans;\n(9) cups, bowls, and other food containers;\n(10) craft supplies and jewelry-making supplies;\n(11) chalk, crayons, paints, and other art supplies;\n(12) fidget spinners;\n(13) costumes, costume accessories, and children's and seasonal party supplies;\n(14) keys, key chains, and key rings; and\n(15) clothing, footwear, headwear, and accessories.\n(a) A person must not import, manufacture, sell, hold for sale, or distribute or offer for use in this state any covered product containing:\n(1) lead at more than 0.009 percent by total weight (90 parts per million); or\n(2) cadmium at more than 0.0075 percent by total weight (75 parts per million).\n(b) This section does not apply to covered products containing lead or cadmium, or both, when regulation is preempted by federal law.\n(a) The commissioners of the Pollution Control Agency, commerce, and health may coordinate to enforce this section. The commissioner of the Pollution Control Agency or commerce may, with the attorney general, enforce any federal restrictions on the sale of products containing lead or cadmium, or both, as allowed under federal law. The commissioner of the Pollution Control Agency may enforce this section under sections 115.071 and 116.072. The commissioner of commerce may enforce this section under sections 45.027, subdivisions 1 to 6; 325F.10 to 325F.12; and 325F.14 to 325F.16. The attorney general may enforce this section under section 8.31.\n(b) When requested by the commissioner of the Pollution Control Agency, the commissioner of commerce, or the attorney general, a person must furnish to the commissioner or attorney general any information that the person may have or may reasonably obtain that is relevant to show compliance with this section.",
	"repealed": false
}