{
	"id": "136A.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.91",
	"title": "136A.91 CONCURRENT ENROLLMENT GRANTS.",
	"text": "(a) The Office of Higher Education must establish a competitive grant program for postsecondary institutions to expand concurrent enrollment opportunities. To the extent that there are qualified applicants, the commissioner of the Office of Higher Education shall distribute grant funds to ensure:\n(1) eligible students throughout the state have access to concurrent enrollment programs; and\n(2) preference for grants that expand programs is given to programs already at capacity.\n(b) The commissioner may award grants under this section to postsecondary institutions for any of the following purposes:\n(1) to develop new concurrent enrollment courses under section 124D.09, subdivision 10, that satisfy the elective standard for career and technical education; or\n(2) to expand the existing concurrent enrollment programs already offered by the postsecondary institution and support the preparation, recruitment, and success of students who are underrepresented in concurrent enrollment classrooms by:\n(i) creating new sections within the same high school; or\n(ii) offering the existing course in new high schools.\nThe commissioner shall develop a grant application process. A grant applicant must:\n(1) specify the purpose under subdivision 1, paragraph (b), for which the institution is applying;\n(2) specify both program and student outcome goals;\n(3) include student feedback in the development of new programs or the expansion of existing programs; and\n(4) demonstrate a commitment to equitable access to concurrent enrollment coursework for all eligible high school students.\nBy December 1 of each year, the office shall submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education regarding:\n(1) the amount of funds granted under each clause of subdivision 1, paragraph (b);\n(2) the courses developed by grant recipients and the number of students who enrolled in the courses under subdivision 1, paragraph (b), clause (1); and\n(3) the programs expanded and the number of students who enrolled in programs under subdivision 1, paragraph (b), clause (2).",
	"repealed": false
}