{
	"id": "317A.909",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.909",
	"title": "317A.909 CORPORATIONS FOR RELIGIOUS PURPOSES.",
	"text": "When authorized by its members or otherwise, a corporation formed for a religious purpose may provide directly or through a church benefits board for:\n(1) support and payment of benefits to its ministers, teachers, employees, or functionaries and to the ministers, teachers, employees, or functionaries of a nonprofit organization affiliated with it or under its jurisdiction;\n(2) payment of benefits to the surviving spouses, children, dependents, or other beneficiaries of the persons named in clause (1);\n(3) collection of contributions and other payments; or\n(4) creation, maintenance, investment, management, and disbursement of necessary endowment, reserve, and other funds for these purposes, including a trust fund or corporation that funds a \"church plan\" as defined in section 414(e) of the Internal Revenue Code of 1986, as amended through December 31, 1988.\nThe insurance laws of this state do not apply to the operations of a corporation under subdivision 1.\nExcept for property leased or used for profit, personal and real property that a religious corporation necessarily uses for a religious purpose is exempt from taxation.\n[Repealed, 2005 c 10 art 2 s 5]\nA \"church benefits board\" is an organization described in section 414(e)(3)(A) of the Internal Revenue Code of 1986, as amended through December 31, 1988, whether a civil law corporation or otherwise, the principal purpose or function of which is the administration or funding of a plan or program for the provision of retirement benefits or welfare benefits for the employees of a church or a convention or association of churches, if the organization is controlled by or associated with a church or a convention or association of churches.\nA church benefits board may act as trustee under a lawful trust and may act as agent for the performance of a lawful act relating to the purposes of the trust.",
	"repealed": false
}