{
	"id": "327.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.35",
	"title": "327.35 FINES; MANUFACTURED HOMES PRODUCED AFTER JUNE 14, 1976.",
	"text": "Notwithstanding the penalty amount of section 326B.082, subdivisions 7 and 12, any person who violates any provision of this section is liable to the state of Minnesota for a monetary penalty of not to exceed $1,000 for each violation. Each violation involving a separate manufactured home or involving a separate failure or refusal to allow or perform any act required by this section constitutes a separate violation, except that the maximum monetary penalties for any related series of violations occurring within one year from the date of the first violation may not exceed $1,000,000.\nAny individual or a director, officer, or agent of a corporation who knowingly and willfully violates any provision of this section in a manner which threatens the health or safety of any purchaser shall be guilty of a gross misdemeanor.\nNo person shall manufacture for sale, lease, sell, offer for sale or lease, or introduce or deliver into the state of Minnesota any manufactured home manufactured after June 14, 1976, which does not comply with the manufactured home construction and safety standards promulgated by the secretary. This subdivision does not apply:\n(a) to any sale or offer for sale made after the first purchase of a manufactured home in good faith for purposes other than resale;\n(b) to any person who establishes that there was no reason to know in the exercise of due care that a manufactured home is not in conformity with applicable federal manufactured home construction and safety standards;\n(c) to any person, who prior to first purchase, holds a certificate issued by the manufacturer or importer of the manufactured home certifying that the manufactured home conforms to all applicable federal manufactured home construction and safety standards, unless the person knows that the manufactured home does not conform; or\n(d) to any manufactured home intended solely for export, and so labeled or tagged on the manufactured home itself and on the outside of the container, if any, in which it is to be exported.\nNo person shall fail or refuse to permit the commissioner or an authorized agent access at any reasonable time to or the copying of records, or fail to make reports available or provide information, or fail or refuse to permit reasonable entry or inspection at any reasonable time of any manufactured home manufactured after June 14, 1976, or reasonable inspection of any related records pertaining to the manufactured home.\nNo manufacturer, dealer, or distributor shall fail to notify the purchaser of any manufactured home manufactured after June 14, 1976, of any defect in the manufactured home which the manufacturer, dealer, or distributor determines, in good faith, constitutes a violation of any federal manufactured home construction and safety standard or constitutes an imminent safety hazard to the purchaser of the manufactured home, within a reasonable time after the manufacturer, dealer, or distributor discovers the defect.\nNo person shall fail to comply with a final order issued under the requirements of the federal Manufactured Home Construction and Safety Standards Act of 1974, United States Code, title 42, section 5401, et seq., as amended.\nNo person shall fail to issue a label if required to do so under the rules adopted by and pursuant to the federal Manufactured Home Construction and Safety Standards Act of 1974, United States Code, title 42, section 5401, et seq., as amended. No person shall issue a label to the effect that a manufactured home conforms to all applicable federal manufactured home construction and safety standards if that person in the exercise of due care has reason to know that the labeling is false or misleading in any material respect.",
	"repealed": false
}