{
	"id": "179.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.07",
	"title": "179.07 LABOR DISPUTE AFFECTING PUBLIC INTERESTS; PROCEDURE.",
	"text": "If the dispute is in any industry, business, or institution affected with a public interest, which includes, but is not restricted to, any industry, business, or institution engaged in supplying the necessities of life, safety, or health, so that a temporary suspension of its operation would endanger the life, safety, health, or well-being of a substantial number of people of any community, the provisions of section 179.06 shall apply. The commissioner may appoint a fact finding commission composed of three members to conduct a hearing and make a report on the issues involved and the merits of the respective contentions of the parties to the dispute. If the commissioner decides to appoint a commission, the commissioner shall immediately notify the parties to the labor dispute. The members of such commission shall on account of vocations, employment, or affiliations be representatives of employees, employers, and the public, respectively. If and when the commissioner notifies the parties of the decision to appoint a commission, neither party to the dispute shall make any change in the situation affecting the dispute and no strike or lockout shall be instituted until 30 days after the commissioner's notification to the parties. If the commissioner fails to appoint a commission within five days after notification to the parties, this limitation on the parties shall be suspended and inoperative. If the commissioner thereafter appoints a commission, no strike or lockout having been instituted in the meantime, the limitation shall again become operative, but in no case for more than the original 30-day period. The 30-day period may be extended by stipulation of the parties to the labor dispute, which shall be filed with the commissioner. The commission shall meet within five days of its appointment by the commissioner and conduct the hearings which are necessary to render its report on the issues involved and merits of the contentions of the parties. The report of the commission shall be filed with the commissioner not less than five days prior to the end of the 30-day period set forth above or any extension thereof. The commissioner shall provide copies of the report to the parties to the dispute and may make the report public.",
	"repealed": false
}