{
	"id": "175A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/175A.01",
	"title": "175A.01 CREATION.",
	"text": "The Workers' Compensation Court of Appeals as previously constituted is reconstituted as an independent agency in the executive branch.\nThe court shall consist of five judges, each serving in the unclassified service.\nEach judge of the Workers' Compensation Court of Appeals shall be appointed by the governor, by and with the advice and consent of the senate, for a term of six years commencing at the expiration of the preceding term. Any vacancy shall be filled by the governor for the unexpired term, subject to confirmation by the senate. The terms of the judges shall expire on the first Monday in January of the year in which they expire. The terms of the judges shall be staggered.\nTo qualify for appointment to the court, a candidate shall be learned in the law, have been licensed to practice law for at least five years, and have experience with and knowledge of workers' compensation and the workers' compensation laws of Minnesota.\nThe judges of the Workers' Compensation Court of Appeals shall be subject to the provisions of the Minnesota Constitution, article VI, section 6, the jurisdiction of the Commission on Judicial Standards, as provided in sections 490A.01 and 490A.02, and the provisions of the Code of Judicial Conduct.\nThe Workers' Compensation Court of Appeals shall have statewide jurisdiction. Except for an appeal to the supreme court or any other appeal allowed under this subdivision, the Workers' Compensation Court of Appeals shall be the sole, exclusive, and final authority for the hearing and determination of all questions of law and fact arising under the workers' compensation laws of the state in those cases that have been appealed to the Workers' Compensation Court of Appeals and in any case that has been transferred by the district court to the Workers' Compensation Court of Appeals. The Workers' Compensation Court of Appeals shall have no jurisdiction in any case that does not arise under the workers' compensation laws of the state or in any criminal case, provided that the Workers' Compensation Court of Appeals shall exercise appellate jurisdiction under the laws governing employees of the state, a county, or other governmental subdivision who contract tuberculosis and under chapter 352E.\nEach judge of the Workers' Compensation Court of Appeals before entering upon the duties of office, shall take the oath prescribed by law.",
	"repealed": false
}