{
	"id": "216C.417",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.417",
	"title": "216C.417 PROGRAM ADMINISTRATION; \"MADE IN MINNESOTA\" SOLAR ENERGY PRODUCTION INCENTIVES.",
	"text": "Payment of a \"Made in Minnesota\" solar energy production incentive to an owner whose application was approved by the commissioner of commerce under section 216C.415, by May 1, 2017, must be administered under the provisions of Minnesota Statutes 2016, sections 216C.411; 216C.413; 216C.414, subdivisions 1 to 3 and 5; and 216C.415. No incentive payments may be made under this section to an owner whose application was approved by the commissioner after May 1, 2017.\n(a) Unspent money remaining in the account established under Minnesota Statutes 2016, section 216C.412, on July 1, 2017, must be transferred to the renewable development account in the special revenue fund established under section 116C.779, subdivision 1.\n(b) There is annually appropriated from the renewable development account in the special revenue fund established in section 116C.779 to the commissioner of commerce money sufficient to make the incentive payments required under Minnesota Statutes 2016, section 216C.415. Any funds appropriated under this paragraph that are unexpended at the end of a fiscal year cancel to the renewable development account.\n(c) Notwithstanding Minnesota Statutes 2016, section 216C.412, subdivision 1, none of this appropriation may be used for administrative costs.\n(a) Payments may be made under this subdivision only for solar photovoltaic module installations that meet the requirements of subdivision 1 and that first begin generating electricity between January 1, 2014, and October 31, 2018.\n(b) The payment eligibility window of the incentive begins and runs consecutively from the date the solar photovoltaic modules first begins generating electricity.\n(c) An owner of solar photovoltaic modules may receive payments under this section for a particular module for a period of ten years, provided that sufficient funds are available in the account.\n(d) No payment may be made under this section for electricity generated after October 31, 2028.",
	"repealed": false
}