{
	"id": "336A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/336A.04",
	"title": "336A.04 FILING EFFECTIVE FINANCING STATEMENT OR LIEN NOTICE.",
	"text": "An effective financing statement or lien notice must be filed in the computerized filing system operated by the Office of the Secretary of State. Effective financing statements and lien notices may be filed in writing or by any other means authorized from a filing officer.\nPresentation of an effective financing statement or lien notice with the appropriate filing fee to a filing officer or acceptance of the statement by a filing officer constitutes filing under this chapter.\nThe fee for filing and indexing a standard form or format for a lien notice, effective financing statement, or continuation statement, and stamping the date and place of filing on a copy of the filed document furnished by the filing party is as follows:\n(1) $20 for each effective financing statement and $15 for each lien notice or other filing made through the web interface of the Office of the Secretary of State;\n(2) $25 for each effective financing statement and $20 for each lien notice or other filing submitted in any other manner; and\n(3) no fee will be charged for filing a termination statement.\nFiling fees collected by a satellite office must be deposited in the general fund of the county in which the satellite office is located.\nThe standard form for a lien notice, effective financing statement, continuation statement, or termination statement is available from the filing office.\n(a) For each effective financing statement, lien notice, continuation statement, or termination statement filed in a filing office, the filing office shall:\n(1) assign a unique number to the filed record;\n(2) create a record that bears the number assigned to the filed record and the date and time of filing;\n(3) maintain the filed record for public inspection; and\n(4) index the filed record in accordance with paragraph (b).\n(b) The filing office shall index an effective financing statement or lien notice according to the name of the debtor and index all filed records relating to the initial filing in a manner that associates the related filings with the initial effective financing statement or lien notice.\n(c) The filing office shall maintain a capability:\n(1) to retrieve a record by the name of the debtor and by the file number assigned to the initial effective financing statement or lien notice to which the record relates; and\n(2) to associate and retrieve with one another an initial effective financing statement or lien notice and each filed record relating to the initial effective financing statement or lien notice as the case may be.\n(d) The filing office may not remove a debtor's name from the index until one year after the effectiveness of an effective financing statement or lien notice naming the debtor lapses under section 336A.03, subdivision 5, paragraph (b), clause (1), or paragraph (c), clause (1).\n(e) The filing office shall maintain a record of the information provided in a filed effective financing statement or lien notice for at least one year after the effectiveness of the financing statement or lien notice has lapsed under section 336A.03, subdivision 5, paragraph (b), clause (1), or paragraph (c), clause (1). The record must be retrievable by using the name of the debtor and by using the file number assigned to the initial effective financing statement or lien notice to which the record relates.\n(f) Except to the extent that a statute governing disposition of public records provides otherwise, the filing office immediately may destroy any written record evidencing an effective financing statement or lien notice. However, if the filing office destroys a written record, it shall maintain another record of the effective financing statement or lien notice which complies with paragraph (e).\nEach filing office shall enter the information from the filed documents into the computerized filing system as prescribed by the secretary of state.\nThe secretary of state shall record lien notices in the computerized filing system in a manner that separately identifies all farm products statutory liens, and shall ensure that the computerized filing and notification system distinguishes security interests covered by effective financing statements from liens covered by lien notices to the extent required by United States Code, title 7, section 1631, et seq., and regulations adopted under those sections.\nA person who has filed an effective financing statement or lien notice may verify the accuracy of the information entered into the computerized filing system and compiled into the master list by making an inquiry under section 336A.09.",
	"repealed": false
}