{
	"id": "116J.996",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.996",
	"title": "116J.996 MILITARY RESERVIST ECONOMIC INJURY AND VETERAN-OWNED SMALL BUSINESS LOANS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Active service\" has the meaning given in section 190.05.\n(c) \"Commissioner\" means the commissioner of employment and economic development.\n(d) \"Eligible business\" means a small business, as defined in section 645.445, that was operating in Minnesota on the date a military reservist received orders for active service.\n(e) \"Essential employee\" means a military reservist who is an owner or employee of an eligible business and whose managerial or technical expertise is critical to the day-to-day operation of the eligible business.\n(f) \"Military reservist\" means a member of the reserve component of the armed forces.\n(g) \"Reserve component of the armed forces\" has the meaning given it in United States Code, title 10, section 101(c).\n(h) \"Substantial economic injury\" means an economic harm to an eligible business that results in the inability of the eligible business to:\n(1) meet its obligations as they mature;\n(2) pay its ordinary and necessary operating expenses; or\n(3) manufacture, produce, market, or provide a product or service ordinarily manufactured, produced, marketed, or provided by the eligible business.\n(i) \"Veteran-owned small business\" means a small business, as defined in section 645.445, that is majority-owned and operated by a recently separated veteran.\nThe commissioner may make onetime, interest-free loans of up to $20,000 per borrower to:\n(1) eligible businesses that have sustained or are likely to sustain substantial economic injury as a result of the call to active service for 180 days or more of an essential employee; or\n(2) recently separated veterans who are veterans as defined in section 197.447, and have served in active military service, at any time on or after September 11, 2001, to start a veteran-owned small business.\nLoans for economic injury must be made for the purpose of preventing, remedying, or ameliorating the substantial economic injury.\nThe commissioner shall use money appropriated for the purpose to establish a revolving loan account. All repayments of loans made under this section must be deposited into this account. Interest earned on money in the account accrues to the account. Money in the account is appropriated to the commissioner for purposes of the loan program created in this section, including costs incurred by the commissioner to establish and administer the program.\nUsing the expedited rulemaking procedures of section 14.389, the commissioner shall develop and publish expedited rules for loan applications, use of funds, needed collateral, terms of loans, and other details of military reservist economic injury and veteran-owned small business loans.",
	"repealed": false
}