{
	"id": "626.5531",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.5531",
	"title": "626.5531 REPORTING OF CRIMES MOTIVATED BY BIAS.",
	"text": "A peace officer must report to the head of the officer's department every violation of chapter 609 or a local criminal ordinance if the officer has reason to believe, or if the victim alleges, that the act was committed in whole or in substantial part because of the victim's actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, or because of the victim's actual or perceived association with another person or group of a certain actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03. The superintendent of the Bureau of Criminal Apprehension shall adopt a reporting form to be used by law enforcement agencies in making the reports required under this section. The reports must include for each incident all of the following:\n(1) the date of the offense;\n(2) the location of the offense;\n(3) whether the target of the incident is a person, private property, or public property;\n(4) the crime committed;\n(5) the type of bias and information about the offender and the victim that is relevant to that bias;\n(6) any organized group involved in the incident;\n(7) the disposition of the case;\n(8) whether the determination that the offense was motivated by bias was based on the officer's reasonable belief or on the victim's allegation; and\n(9) any additional information the superintendent deems necessary for the acquisition of accurate and relevant data.\nThe head of a local law enforcement agency or state law enforcement department that employs peace officers licensed under section 626.843 must file a monthly report describing crimes reported under this section with the Department of Public Safety, Bureau of Criminal Apprehension. The commissioner of public safety must summarize and analyze the information received and file an annual report with the Department of Human Rights and the legislature. The commissioner may include information in the annual report concerning any additional criminal activity motivated by bias that is not covered by this section.",
	"repealed": false
}