{
	"id": "297A.994",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.994",
	"title": "297A.994 CITY OF MINNEAPOLIS SALES TAX; ALLOCATION OF REVENUES.",
	"text": "Notwithstanding the provisions of section 297A.99, subdivision 11, the provisions of this section govern the remittance of the proceeds of taxes imposed by the city of Minneapolis under the special law.\n(a) For purposes of this section, the following definitions apply.\n(b) \"City\" means the city of Minneapolis.\n(c) \"Special law\" means Laws 1986, chapter 396, sections 4 and 5, as amended.\n(d) \"Tax\" means the sales taxes imposed by the city under the special law.\n(e) The terms defined under section 473J.03 apply for purposes of this section.\nThe commissioner shall remit the revenues from the taxes, less the deductions listed in this subdivision, to the city at least quarterly. The commissioner shall make the following deductions in the order listed before distribution to the city:\n(1) refunds of any of these taxes due to taxpayers, if any;\n(2) the direct and indirect costs of the department to administer, audit, and collect the tax, according to the applicable law and agreements between the commissioner and the city. For revenues from the general local sales and use tax, the commissioner must deduct a proportionate share of costs described in section 297A.99, subdivision 11; and\n(3) notwithstanding the provisions of any agreement between the commissioner and the city providing for collection and remittance of these taxes, the commissioner must deposit to the general fund the amounts specified in subdivision 4.\n(a) The commissioner must retain and deposit to the general fund the following amounts, as required by subdivision 3, clause (3):\n(1) for state bond debt service support beginning in calendar year 2021, and for each calendar year thereafter through calendar year 2046, periodic amounts so that not later than December 31, 2046, an aggregate amount equal to a present value of $150,000,000 has been deposited in the general fund. To determine aggregate present value, the commissioner must consult with the commissioner of management and budget regarding the present value dates, discount rate or rates, and schedules of annual amounts. The present value date or dates must be based on the date or dates bonds are sold under Minnesota Statutes 2022, section 16A.965, or the date or dates other state funds, if any, are deposited into the construction fund. The discount rate or rates must be based on the true interest cost of the bonds issued under Minnesota Statutes 2022, section 16A.965, or an equivalent 30-year bond index, as determined by the commissioner of management and budget. The schedule of annual amounts must be certified to the commissioner by the commissioner of management and budget and the finance officer of the city;\n(2) for the capital improvement reserve appropriation to the Minnesota Sports Facilities Authority beginning in calendar year 2021, and for each calendar year thereafter through calendar year 2046, an aggregate annual amount equal to the amount paid by the state for this purpose in that calendar year under section 473J.13, subdivision 4;\n(3) for the operating expense appropriation to the Minnesota Sports Facilities Authority beginning in calendar year 2021, and for each calendar year thereafter through calendar year 2046, an aggregate annual amount equal to the amount paid by the state for this purpose in that calendar year under section 473J.13, subdivision 2;\n(4) to capture increases in taxes imposed under the special law, for the benefit of the Minnesota Sports Facilities Authority, beginning in calendar year 2013 and for each calendar year thereafter through 2046, there shall be deposited to the general fund in proportionate periodic payments in the following year, an amount equal to the lesser of:\n(i)(A) 50 percent of the difference, if any, by which the amount of the net annual taxes for the previous year exceeds the sum of the net actual taxes in calendar year 2011 plus $1,000,000, inflated at two percent per year since 2011, minus\n(B) 25 percent of the difference, if any, by which the amount of the net annual taxes for the preceding year exceeds the sum of the net actual taxes in calendar year 2011 plus $3,000,000, inflated at two percent per year since 2011; or\n(ii) the amount of the net annual taxes for the preceding year multiplied by three percent; and\n(5) if the bonds under section 16A.965 are defeased, redeemed, or paid in full, the commissioner of management and budget and finance officer of the city must agree to a revised schedule of annual amounts under clause (1). The revised schedule of annual amounts must factor in a discount rate equal to zero percent and otherwise consistent with the methodology previously agreed upon by the parties.\n(b) The Minnesota Sports Facility Authority must use the amounts available from the deposits under paragraph (a), clause (4), for capital repairs, replacements, and improvements for the stadium and stadium infrastructure.",
	"repealed": false
}