{
	"id": "168.127",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.127",
	"title": "168.127 FLEET VEHICLES; REGISTRATION, FEE.",
	"text": "(a) A unique registration category is established for vehicles and trailers of a fleet. Vehicles registered in the fleet must be issued a distinctive license plate. The design and size of the fleet license plate must be determined by the commissioner.\n(b) A deputy registrar may issue replacement license plates for qualified vehicles in a registered fleet pursuant to section 168.29.\nThe annual registration period for vehicles in the fleet is determined by the commissioner. The applicant must provide all information necessary to qualify as a fleet registrant, including a list of all vehicles in the fleet. On initial registration, all taxes and fees for vehicles in the fleet must be reassessed based on the expiration date.\n(a) On approval of the application for fleet registration, the commissioner must issue a registration card for each qualified vehicle in the fleet. The registration card must be carried in the vehicle at all times and be made available to a peace officer on demand. The registered gross weight must be indicated on the license plate.\n(b) A new vehicle may be registered to an existing fleet upon application to a deputy registrar and payment of the fee under section 168.33, subdivision 7.\n(c) A deputy registrar must issue a replacement registration card for any registered fleet or any qualified vehicle in a registered fleet upon application.\nInitial fleet applications for registration and renewals must be filed with the commissioner or authorized deputy registrar.\nOn the renewal of a fleet registration, the registrant must pay full licensing fees for every vehicle registered in the preceding year unless the vehicle has been properly deleted from the fleet. In order to delete a vehicle from a fleet, the fleet registrant must surrender to the commissioner the registration card and license plates. The commissioner may authorize alternative methods of deleting vehicles from a fleet, including destruction of the license plates and registration cards. If the card or license plates are lost or stolen, the fleet registrant must submit a sworn statement stating the circumstances for the inability to surrender the card, stickers, and license plates. A fleet registrant who fails to renew the licenses issued under this section or fails to report the removal of vehicles from the fleet within 30 days of the vehicles' removal must pay a penalty of 20 percent of the total tax due on the fleet. The penalty must be paid within 30 days after it is assessed.\nThe applicant for fleet registration must pay the filing fee described in section 168.33, subdivision 7, to the commissioner for each vehicle in the fleet.",
	"repealed": false
}