{
	"id": "32D.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/32D.30",
	"title": "32D.30 DAIRY DEVELOPMENT AND PROFITABILITY ENHANCEMENT.",
	"text": "The commissioner must implement a dairy development and profitability enhancement program consisting of a dairy profitability enhancement program, dairy business planning grants, and other services to support the dairy industry.\n(a) The dairy profitability enhancement program must provide information and technical assistance to dairy farms of all sizes to enhance their financial success and long-term sustainability. The program must assist dairy producers in all dairy-producing regions of the state. Assistance to producers from the program may be provided individually, as a team, or through other methods by farm business management instructors, dairy extension specialists, and other dairy industry partners. The program may engage in activities such as comprehensive financial analysis, risk management education, enhanced milk marketing tools and technologies, facilitating or improving production systems, including rotational grazing and other sustainable agriculture methods, and value-added opportunities.\n(b) The commissioner must make grants to regional or statewide organizations qualified to manage the various components of the program and serve as program administrators. Each regional or statewide organization must designate a coordinator responsible for overseeing the program and submitting periodic reports to the commissioner regarding aggregate changes in producer financial stability, productivity, product quality, animal health, environmental protection, and other performance measures attributable to the program. The organizations must submit this information in a format that maintains the confidentiality of individual dairy producers.\nThe commissioner may award dairy business planning grants of up to $5,000 per producer or dairy processor to use technical assistance services for evaluating operations, transitional changes, expansions, improvements, and other business modifications. Producers and processors must not use dairy business planning grants for capital improvements.\nExcept as specified in law, the commissioner may allocate dairy development and profitability enhancement program dollars for the permissible uses specified in this section and other needs to support the dairy industry, including efforts to improve the quality of milk produced in the state, in the proportions that the commissioner deems most beneficial to the state's dairy farmers.\nNo later than July 1 each year, the commissioner must submit a detailed accomplishment report and work plan detailing future plans for, and the actual and anticipated accomplishments from, expenditures under this section to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over agriculture policy and finance. If the commissioner significantly modifies a submitted work plan during the fiscal year, the commissioner must notify the chairs and ranking minority members.",
	"repealed": false
}