{
	"id": "129D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/129D.02",
	"title": "129D.02 BOARD OF THE ARTS.",
	"text": "The Board of the Arts shall consist of 11 members to be appointed by the governor with the advice and consent of the senate. One member shall be appointed from each of the congressional districts, and the remaining members shall be appointed at large. Persons appointed to the board shall have demonstrated experience or interest in the arts. No member shall within two years prior to appointment have received or applied for, in the member's name, a grant, loan or other form of assistance from the board or its predecessor, the State Arts Council. No more than four of the members shall during their terms of office be officers, directors or employees of recipient sponsoring organizations. The board members shall annually select from their membership a chair and other officers as they deem necessary.\nThree of the initial members including one at-large member shall be appointed to terms ending the first Monday in January in each of the years 1977, 1979 and 1980. The remaining two members shall be appointed to terms ending the first Monday in January, 1978. Thereafter, the terms of all members of the board shall be four years. Members may serve until their successors are appointed and qualify. If the governor fails to appoint a successor by the July 1 of the year in which the term expires, the term of the member for whom a successor has not been appointed shall extend, subject to the advice and consent of the senate, until the first Monday in January four years after the scheduled end of the original term.\nMembers shall be compensated as provided in section 15.0575, subdivision 3.\nA member may be removed by the governor at any time (1) for cause after notice and hearing, (2) for failing to submit any report required in subdivision 5, or (3) for missing three consecutive scheduled meetings of the board. The chair shall inform the governor of a member missing the three meetings. The secretary of the board shall inform in writing a member after two consecutive missed meetings and before the next meeting that the member is subject to removal by missing the next meeting. Vacancies on the board shall be filled by the governor, with the advice and consent of the senate, for the remainder of the unexpired term.\nBy November 15 of each year, the board shall prepare and deliver to the legislature and the governor a report that includes the following:\n(1) a financial statement showing receipts and disbursements for the year ending the preceding June 30, including a listing of the donors and amounts of gifts to the board or its advisory committees valued in excess of $1,000;\n(2) a brief description of the activities of the board for the preceding year;\n(3) the number of meetings and approximate hours spent by board members in meetings and on other board activities;\n(4) the names of board members and their addresses, occupations, and dates of appointment and reappointment to the board;\n(5) the names and job classifications of board employees;\n(6) a brief summary of board rules proposed or adopted during the period with appropriate citations to the State Register and published rules;\n(7) the number of requests for assistance received by the board and the number of written and oral complaints received from residents of the state relating to the activities of the board or the performance of the duties of the board as provided in this chapter;\n(8) a summary by category of the substance of the complaints and requests referred to in clause (7) and the responses of the board thereto; and\n(9) a listing of all grants, loans, or other forms of assistance given by the board. This listing must indicate (i) the recipients of board assistance who are members of the board or its advisory committees and (ii) each recipient sponsoring organization having a member of the board or its advisory committees as a director, officer, or employee. The indication required in item (ii) must also specify the name of the member who is the officer, director, or employee. The listing must also include the amount of money, number of grants, and the basis for the allocations made to major arts organizations, to individuals, for statewide distribution, for regional distribution, for sponsor assistance to community organizations, and for sponsor assistance to educational organizations.",
	"repealed": false
}