{
	"id": "32D.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/32D.18",
	"title": "32D.18 MILK BOUGHT BY WEIGHT; TESTING METHODS.",
	"text": "(a) Milk must be purchased from producers using a formula based on one or more of the following:\n(1) payment of a standard rate with uniform differentials for milk testing above or below 3.5 percent milk fat;\n(2) payment of a standard rate for the pounds of milk fat contained in the milk;\n(3) payment of a standard rate for the pounds of protein contained in the milk;\n(4) payment of a standard rate for the pounds of nonfat solids contained in the milk; or\n(5) payment of standard rates based on other attributes of value in the milk.\n(b) In addition, an adjustment may be made on the basis of milk quality and other premiums. Testing procedures for determining the percentages of milk fat, protein, and nonfat solids must comply with the methods approved by the Association of Analytical Chemists or be as adopted by rule.\nGlassware, test bottles, pipettes, acid measures, chemicals, scales, and other apparatus used in the operation of these tests shall conform to the specifications for the particular test method.\nA person who:\n(1) employs any test other than those tests authorized by rule adopted by the commissioner, or any methods other than the standard official methods for determining the milk fat content of milk or cream;\n(2) incorrectly samples milk or cream purchased or sold;\n(3) incorrectly weighs milk or cream purchased or sold;\n(4) incorrectly grades milk or cream purchased or sold;\n(5) makes a false entry of the weight, test result, or grade of any milk or cream purchased or sold;\n(6) incorrectly samples, weighs, tests, or records or reports weights or tests of skim milk or buttermilk purchased or sold;\n(7) underreads the tests;\n(8) falsifies the reading of the tests;\n(9) manipulates the reading of the tests; or\n(10) falsely states, certifies, or uses in the purchase or sale of milk or cream a misreading of such tests, whether the tests or actual reading have been made by the person or by any other person,\nis guilty of a misdemeanor.",
	"repealed": false
}