{
	"id": "273.1391",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1391",
	"title": "273.1391 SUPPLEMENTARY HOMESTEAD PROPERTY TAX RELIEF.",
	"text": "The property tax to be paid in respect to property taxable within a tax relief area described in subdivision 2 on homestead property, as otherwise determined by law and regardless of the market value of the property, for all purposes shall be reduced in the amount prescribed by subdivision 2, subject to the limitations contained therein.\nThe amount of the reduction authorized by subdivision 1 shall be:\n(a) In the case of property located within a school district which does not meet the qualifications of section 273.134, paragraph (b), as a tax relief area, but which is located in a county with a population of less than 100,000 in which taconite is mined or quarried and wherein a school district is located which does meet the qualifications of a tax relief area, and provided that at least 90 percent of the area of the school district which does not meet the qualifications of section 273.134, paragraph (b), lies within such county, 57 percent of the tax on qualified property located in the school district that does not meet the qualifications of section 273.134, paragraph (b), provided that the amount of said reduction shall not exceed the maximum amounts specified in paragraph (d). The reduction provided by this paragraph shall only be applicable to property located within the boundaries of the county described therein.\n(b) In the case of property located within a school district which does not meet the qualifications of section 273.134, paragraph (b), as a tax relief area, but which is located in a school district in a county containing a city of the first class and a municipality as defined in section 273.134, paragraph (a), but not in a school district containing a city of the first class or adjacent to a school district containing a city of the first class unless the school district so adjacent contains a municipality as defined in section 273.134, paragraph (a), 57 percent of the tax, but not to exceed the maximums specified in paragraph (d).\n(c) In the case of property located within the boundaries of a municipality that meets the qualifications in section 273.134, paragraph (a), but not the qualifications of a tax relief area in section 273.134, paragraph (b), 66 percent of the tax, provided that the reduction shall not exceed $315.10. In the case of property located within the boundaries of a school district which qualifies as a taconite assistance area under section 273.1341, but does not qualify as a tax relief area under section 273.134, paragraph (b), but which is outside the boundaries of a municipality which meets the qualifications of the preceding sentence, 57 percent of the tax, provided that the reduction shall not exceed the maximum amounts specified in paragraph (d).\n(d) Except as otherwise provided in this section, the maximum reduction of the tax is $289.80.\nMS 1988 [Repealed, 1Sp1989 c 1 art 3 s 34]\nNot later than December 1, each county auditor having jurisdiction over one or more tax relief areas defined in subdivision 2 shall certify to the commissioner of revenue an estimate of the total amount of the reduction, determined under subdivision 2, in taxes payable the next succeeding year with respect to all tax relief areas in the auditor's county. The commissioner shall make payments to the county at the times provided in section 477A.015. The county treasurer shall distribute as part of the May and October settlements the funds received from the commissioner.\nFor the purposes of this section, the amount of property tax to be paid shall be determined after the allowance of any reduction prescribed by section 273.13, and the reduction prescribed by this section shall be in addition to that prescribed by section 273.13.\nA sum sufficient to make the payments required by section 477A.15 and this section is annually appropriated from the general fund to the commissioner of revenue for the purpose of funding those sections.",
	"repealed": false
}