{
	"id": "92.163",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.163",
	"title": "92.163 EXTENSION FOR PAYMENT ON STATE LAND CERTIFICATES.",
	"text": "The time for payment of the principal of any certificate of sale of state public land sold before May 1, 1941, which has expired or will expire, is extended as provided in this section.\nBefore the expiration of the time for the payment of principal specified in the original certificate of sale, or any lawful extension, the holder of the certificate shall file with the commissioner of natural resources an application for an extension of time of payment in the form prescribed by the commissioner. The applicant shall submit to the commissioner the certificate of sale or an affidavit of the circumstances if it has been lost or destroyed, or cannot be produced for any other reason, together with other proof of the applicant's rights required by the commissioner. At least 15 percent of the unpaid principal must be paid with the application, together with all unpaid interest and penalties accrued. The remaining unpaid principal, with interest, is payable as provided by Mason's Minnesota Statutes 1927, section 6267, as amended by Laws 1941, chapter 374. The rights of the certificate holder and all other proceedings in the matter are subject to that section and other applicable laws, as if the land has been sold under them on the date of the filing of the application for extension.\nThereupon the time for payment is extended. The commissioner shall issue a certificate of extension in form approved by the attorney general, and the original certificate shall be deemed modified in accordance with it. The duplicate of the certificate must be attached to the duplicate original certificate of sale on record in the office of the commissioner of natural resources.\nThis section does not apply if the certificate of sale has been absolutely terminated and made void, without right of redemption, or if the land has become forfeited to the state for delinquent taxes.",
	"repealed": false
}