{
	"id": "103D.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.011",
	"title": "103D.011 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Affected\" means the jurisdiction or property of an entity that receives benefits, is assessed costs, or is part of a watershed district.\n\"Appraisers\" means the persons appointed by the managers to determine and report benefits and damages arising from a proposed project.\n\"Auditor\" means the county auditor of a county affected by a watershed district.\n\"Board\" means the Board of Water and Soil Resources.\n\"City\" means a statutory or home rule charter city.\n\"Commissioner\" means the commissioner of natural resources.\n\"Court administrator\" means the court administrator of the district court of the county where a judicial proceeding concerning a watershed district is pending.\n\"Director\" means the director of the Division of Ecological and Water Resources of the Department of Natural Resources.\n\"Engineer\" means a licensed professional engineer as described in section 326.02 and designated by the managers to act as engineer. The board of managers or engineer may work in cooperation with other licensed professionals as described in section 326.02 in the planning and design of a watershed district project.\n\"Establishment petition\" means a petition to establish a watershed district and may consist of one or more separate petitions.\n\"Hearing\" means a hearing conducted by the managers or the Board of Water and Soil Resources.\n\"Interested party\" means a person or political subdivision with an interest in the pending subject matter. Interested party includes the director or any agency of government.\n\"Notice by mail\" means a notice mailed and addressed to each person entitled to receive the notice if the address is known to the auditor or court administrator or can be obtained at the office of the county treasurer of the affected county.\n\"Managers\" means the board of managers of a watershed district.\n\"Metropolitan area\" has the meaning given in section 473.121, subdivision 2.\n\"Municipality\" means a statutory or home rule charter city.\n\"Person\" means an individual, firm, partnership, association, or corporation, but does not include a political subdivision.\n\"Petition\" means a petition to begin a project and may consist of one or more separate petitions.\n\"Political subdivision\" means a county, town, school district, or a political division or subdivision of the state. Political subdivision does not mean a watershed district unless the context clearly indicates watershed districts are to be included.\n\"Project\" means planning and development, construction, maintenance, repair, or improvement of a watershed district for a purpose for which the watershed district is established.\n\"Publication\" means publication once a week for two successive weeks as provided in section 645.11.\n\"Public health\" means an act or thing that tends to improve the general sanitary conditions of the watershed district.\n\"Public welfare,\" \"general welfare,\" and \"public benefit\" mean an act or thing that tends to improve, benefit, or contribute to the safety or well-being of the general public, or benefit the inhabitants of the watershed district.\n\"Resident owner\" means a resident of the state who is the owner of property or the purchaser of property under a contract for deed.",
	"repealed": false
}