{
	"id": "349.1721",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.1721",
	"title": "349.1721 CONDUCT OF PULL-TABS.",
	"text": "The board shall by rule permit pull-tab games with multiple seals. The board shall also adopt rules for pull-tab games with cumulative or carryover prizes. The rules shall also apply to electronic pull-tab games.\nThe board shall by rule permit pull-tab games in which certain winners are determined by the random selection of one or more bingo numbers or by another method approved by the board. The rules shall also apply to electronic pull-tab games.\nThe following pertain to pull-tab dispensing devices as defined under section 349.12, subdivision 32a.\n(a) The use of any pull-tab dispensing device must be at a permitted premises which is:\n(1) a licensed premises for on-sale of intoxicating liquor or 3.2 percent malt beverages;\n(2) a premises where bingo is conducted as the primary business; or\n(3) an establishment licensed for the off-sale of intoxicating liquor, other than drug stores and general food stores licensed under section 340A.405, subdivision 1.\n(b) The number of pull-tab dispensing devices located at any permitted premises is limited to three.\nThe following pertain to the use of electronic pull-tab devices as defined under section 349.12, subdivision 12b.\n(a) The use of any electronic pull-tab device may only be at a permitted premises that is:\n(1) a premises licensed for the on-sale of intoxicating liquor or on-sale 3.2 percent malt beverages; or\n(2) a premises where bingo is conducted as the primary business and has a seating capacity of at least 100; and\n(3) where a licensed organization sells paper pull-tabs and consents to the conduct of electronic pull-tab devices on the premises.\n(b) The number of electronic pull-tab devices is limited to:\n(1) no more than six devices in play at any permitted premises with 200 seats or less;\n(2) no more than 12 devices in play at any permitted premises with 201 seats or more; and\n(3) no more than 50 devices in play at any permitted premises where the primary business is bingo.\nSeating capacity is determined as specified under the local fire code.\n(c) The hours of operation for the devices are limited to 8:00 a.m. to 2:00 a.m.\n(d) All electronic pull-tab games must be sold and played on the permitted premises and may not be linked to other permitted premises.\n(e) Electronic pull-tab games may not be transferred electronically or otherwise to any other location by the licensed organization.\n(f) Electronic pull-tab games may be commingled if the games are from the same family of games and manufacturer and contain the same game name, form number, type of game, ticket count, prize amounts, and prize denominations. Each commingled game must have a unique serial number.\n(g) An organization may remove from play a device that a player has not maintained in an activated mode for a specified period of time determined by the organization. The organization must provide the notice in its house rules.\n(h) Before participating in the play of an electronic pull-tab game, a player must present a valid picture identification card that includes the player's date of birth. Except for prize receipts required by section 349.19, subdivision 10, an organization is not required to register or retain any information contained on the player's picture identification card.\n(i) A licensed organization must require each person cashing out an electronic pull-tab device with $600 or more in credits to present identification in the form of a driver's license, Minnesota identification card, or other identification the board deems sufficient to allow the identification and tracking of the winner. The organization must retain the winner's identification in the form of a prize receipt for 3-1/2 years. A prize receipt for electronic pull-tabs must include the same information as is required in board rules for a paper pull-tab game prize receipt.\n(j) Except for prize receipts required by paragraph (i), an organization is not required to register or retain any information contained on the player's picture identification card.\n(k) Each player is limited to the use of one device at a time.\nThe board may permit pull-tab games in which the holders of certain predesignated winning tickets, with a prize value not to exceed $75 each, have the option of turning in the winning tickets for the chance to win a prize of greater value.",
	"repealed": false
}