{
	"id": "35.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.68",
	"title": "35.68 RABIES PROCLAMATION.",
	"text": "If a community health board as defined in section 145A.02, subdivision 5, investigates and finds that rabies does exist in a town or city the community health board shall make and file a proclamation of the investigation and determination which prohibits the owner or custodian of any dog from allowing the dog to be at large within the town or city unless the dog is effectively muzzled so that it cannot bite any other animal or person.\nIf the executive director of the Board of Animal Health, after investigation, has determined that rabies exists in any territory in the state, similar proclamations must be issued in all towns and cities within the territory or area in which it is necessary to control the outbreak and prevent the spread of the disease. The proclamation must prohibit the owner or custodian of any dog within the designated territory from permitting or allowing the dog to be at large within the territory unless the dog is effectively muzzled so that it cannot bite any other animal or person.\nAll local peace officers and community health boards shall enforce sections 35.67 to 35.69.\nA proclamation issued by the community health board must be filed with the clerk of the political subdivision responsible for the community health board. One issued by the executive director of the Board of Animal Health must be filed with the clerk of each town and city within the territory it covers.\nEach officer with whom the proclamation is filed shall publish a copy of it in one issue of a legal newspaper published in the clerk's town or city if one is published there. If no newspaper is published there, the clerk must post a copy of the proclamation in three public places. Publication is at the expense of the municipality.\nProof of publication must be by affidavit of the publisher and proof of posting must be by the person doing the posting. The affidavit must be filed with the proclamation. The proclamation is effective five days after the publication or posting and remains effective for the period of time not exceeding six months specified in it by the community health board making the proclamation.",
	"repealed": false
}