{
	"id": "260.691",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.691",
	"title": "260.691 AFRICAN AMERICAN CHILD WELL-BEING ADVISORY COUNCIL.",
	"text": "The African American Child Well-Being Advisory Council must:\n(1) review annual reports related to African American children involved in the child welfare system. These reports may include but are not limited to the maltreatment, out-of-home placement, and permanency of African American children;\n(2) assist with and make recommendations to the commissioner for developing strategies to reduce maltreatment determinations, prevent unnecessary out-of-home placement, promote culturally appropriate foster care and shelter or facility placement decisions and settings for African American children in need of out-of-home placement, ensure timely achievement of permanency, and improve child welfare outcomes for African American children and their families;\n(3) review summary reports on targeted case reviews prepared by the commissioner to ensure that responsible social services agencies meet the needs of African American children and their families. Based on data collected from those reviews, the council shall assist the commissioner with developing strategies needed to improve any identified child welfare outcomes, including but not limited to maltreatment, out-of-home placement, and permanency for African American children;\n(4) assist the Cultural and Ethnic Communities Leadership Council with making recommendations to the commissioner and the legislature for public policy and statutory changes that specifically consider the needs of African American children and their families involved in the child welfare system;\n(5) advise the commissioner on stakeholder engagement strategies and actions that the commissioner and responsible social services agencies may take to improve child welfare outcomes for African American children and their families;\n(6) assist the commissioner with developing strategies for public messaging and communication related to racial disproportionality and disparities in child welfare outcomes for African American children and their families;\n(7) assist the commissioner with identifying and developing internal and external partnerships to support adequate access to services and resources for African American children and their families, including but not limited to housing assistance, employment assistance, food and nutrition support, health care, child care assistance, and educational support and training; and\n(8) assist the commissioner with developing strategies to promote the development of a culturally diverse and representative child welfare workforce in Minnesota that includes professionals who are reflective of the community served and who have been directly impacted by lived experiences within the child welfare system. The council must also assist the commissioner with exploring strategies and partnerships to address education and training needs, hiring, recruitment, retention, and professional advancement practices.\nBy January 1, 2026, and annually thereafter, the council shall report to the chairs and ranking minority members of the legislative committees with jurisdiction over child protection on the council's activities under subdivision 1 and other issues on which the council chooses to report. The report may include recommendations for statutory changes to improve the child protection system and child welfare outcomes for African American children and families.",
	"repealed": false
}