{
	"id": "221.172",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.172",
	"title": "221.172 SHIPPING DOCUMENT.",
	"text": "A person who transports a hazardous material by motor vehicle shall conform to the requirements of Code of Federal Regulations, title 49, with respect to shipping documents.\nA person who transports a hazardous waste by motor vehicle shall carry in the vehicle a hazardous waste manifest which conforms to the requirements of Minnesota Rules, chapter 7045.\n(a) A household goods mover shall keep a record of each shipment transported under a permit. A record may consist of one or more documents, including a bill of lading, freight bill, manifest, delivery receipt, or other document. If it consists of more than one document, the documents constituting a shipment record must be available for inspection together.\n(b) A record must show the:\n(1) names of the consignor and consignee;\n(2) date of shipment;\n(3) origin and destination points;\n(4) description of the freight;\n(5) weight, volume, or measurement of the freight, if applicable to the rating of the freight;\n(6) exact rate or rates assessed;\n(7) total charges due, including the nature and amount of any charges for special service; and\n(8) the name of each carrier participating in the transportation.\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n[Repealed, 1999 c 238 art 2 s 92]\nA shipping document or record described in subdivision 2 or 3, or a copy of it, must be retained by the carrier for at least three years from the date on the shipping document or record. A carrier may keep a shipping record described in subdivision 3 by any technology that prevents the alteration, modification, or erasure of the underlying data and will enable production of an accurate and unaltered paper copy. A carrier shall keep a shipping record in a manner that will make it readily accessible and shall have a means of identifying and producing a legible paper copy for inspection by the commissioner upon request.",
	"repealed": false
}