{
	"id": "202A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/202A.15",
	"title": "202A.15 TIME AND PLACE OF CAUCUS.",
	"text": "Precinct caucuses within a county shall be held on the day established pursuant to section 202A.14, subdivision 1, and the caucuses shall remain open for at least one hour.\nThe precinct caucuses shall be held at the regular polling places for each precinct or other suitable places designated in the call, and no caucus may be adjourned to any other place or time.\nIn the event that there is only one suitable meeting place in the precinct polling place and the major political parties cannot agree as to its use, the county auditor shall decide by lot prior to January 15, 1970, the party which is to receive the use of the meeting place in years evenly divisible by four and which party shall receive the use of the meeting place in other years in which a state general election is held. The report of such selections by lot in the county shall be filed by the auditor with the county board which shall publish the same as a part of the minutes of the board meeting at which the report is filed.\nA precinct caucus must be held at a place that meets the accessibility standards for precinct polling places specified in section 204B.16, subdivision 5. In addition, the place where a precinct caucus is held must contain restrooms that conform to the standards in the State Building Code for accessibility by disabled persons. If a precinct caucus is held on a floor of a building that is either above or below the entrance level for the building, an elevator must be available. Any elevators used for access to the room where the precinct caucus is held must conform to the standards in the State Building Code for accessibility by disabled persons.\nIf there are not enough places within a precinct that are or can be made accessible as provided by this subdivision and section 204B.16, subdivision 5, for each major party to hold its precinct caucus, a major party may hold its caucus at a place outside one of the boundaries of the precinct in order to comply with accessibility requirements.\nIf only one place satisfies the accessibility and location requirements of this subdivision, the major parties shall alternate use of the place. Prior to January 1, 1990, the county auditor shall decide by lot which party is to use the accessible place in years evenly divisible by four and which party is to use the place in other years when a state general election is held.",
	"repealed": false
}