{
	"id": "103G.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.005",
	"title": "103G.005 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Abandon\" means to give up the use and maintenance of structures or improvements to realty and to surrender them to deterioration. Abandon does not refer to intent to surrender or relinquish title to or a possessory interest in the real property where the structures or improvements are located.\n\"Agricultural land\" means: land used for horticultural, row, close grown, pasture, and hayland crops; growing nursery stocks; animal feedlots; farm yards; associated building sites; and public and private drainage systems and field roads located on any of the foregoing.\n\"Altered natural watercourse\" means a former natural watercourse that has been affected by artificial changes to straighten, deepen, narrow, or widen the original channel.\n\"Appropriating\" means withdrawal, removal, or transfer of water from its source regardless of how the water is used.\n\"Artificial watercourse\" means a watercourse artificially constructed by human beings where a natural watercourse was not previously located.\n\"Basin of origin\" means the drainage basin of the Great Lakes, the Red River of the North, the Mississippi River, or the Missouri River.\n\"Board\" means the Board of Water and Soil Resources.\n\"Commissioner\" means the commissioner of natural resources.\n[Renumbered subd 8b]\n\"Constructed management facilities for stormwater\" means ponds, basins, holding tanks, cisterns, infiltration trenches and swales, or other best management practices that have been designed, constructed, and operated to store or treat stormwater in accordance with local, state, or federal requirements.\n\"Consumptive use\" means water that is withdrawn from its source for immediate further use in the area of the source and is not directly returned to the source.\n\"Director\" means the director of the Division of Ecological and Water Resources of the Department of Natural Resources.\n\"Division\" means the Division of Ecological and Water Resources of the Department of Natural Resources.\n[Renumbered subd 9d]\n\"Ecosystem harm\" means to change the biological community and ecology in a manner that results in loss of ecological structure or function.\n\"Electronic transmission\" means the transfer of data or information through an electronic data interchange system consisting of, but not limited to, computer modems and computer networks. Electronic transmission specifically means electronic mail, unless other means of electronic transmission are mutually agreed to by the sender and recipient.\nMS 2010 [Renumbered subd 9a]\nMS 1994 [Renumbered subd 10e]\n\"50 to 80 percent area\" means a county or watershed with at least 50 but less than 80 percent of the presettlement wetland acreage intact.\n\"Greater than 80 percent area\" means a county, watershed, or, for purposes of wetland replacement, bank service area where 80 percent or more of the presettlement wetland acreage is intact and:\n(1) ten percent or more of the current total land area is wetland; or\n(2) 50 percent or more of the current total land area is state or federal land.\n\"Hayland\" means an area that was mechanically harvested or that was planted with annually seeded crops in a crop rotation seeding of grasses or legumes in six of the last ten years prior to January 1, 1991.\n[Renumbered subd 10h]\n[Renumbered subd 10i]\nMS 2011 Supp [Renumbered subd 9b]\n\"In-lieu fee program\" means a program in which wetland replacement requirements of section 103G.222 are satisfied through payment of money to the board or a board-approved sponsor to develop replacement credits according to section 103G.2242, subdivision 12.\n\"Less than 50 percent area\" means a county, watershed, or, for purposes of wetland replacement, bank service area with less than 50 percent of the presettlement wetland acreage intact or any county, watershed, or bank service area not defined as a \"greater than 80 percent area\" or \"50 to 80 percent area.\"\n\"Local government unit\" means:\n(1) outside of the seven-county metropolitan area, a city council, county board of commissioners, or a soil and water conservation district or their delegate;\n(2) in the seven-county metropolitan area, a city council, a town board under section 368.01, a watershed management organization under section 103B.211, or a soil and water conservation district or their delegate;\n(3) on state land, the agency with administrative responsibility for the land; and\n(4) for wetland banking projects established solely for replacing wetland impacts under a permit to mine under section 93.481, the commissioner of natural resources.\n\"Meandered lake\" means a body of water except streams located within the meander lines shown on plats made by the United States General Land Office.\n[Renumbered subd 15e]\n\"Municipality\" means a home rule charter or statutory city.\n\"Natural watercourse\" means a natural channel that has definable beds and banks capable of conducting confined runoff from adjacent land.\n[Renumbered subd 13c]\n\"Negative impact to surface waters\" means a change in hydrology sufficient to cause aquatic ecosystem harm or alter riparian uses long term.\n\"Once-through system\" means a space heating, ventilating, air conditioning (HVAC), or refrigeration system used for any type of temperature or humidity control application, utilizing groundwater, that circulates through the system and is then discharged without reusing it for a higher priority purpose.\n\"Ordinary high-water level\" means the boundary of water basins, watercourses, public waters, and public waters wetlands, and:\n(1) the ordinary high-water level is an elevation delineating the highest water level that has been maintained for a sufficient period of time to leave evidence upon the landscape, commonly the point where the natural vegetation changes from predominantly aquatic to predominantly terrestrial;\n(2) for watercourses, the ordinary high-water level is the elevation of the top of the bank of the channel; and\n(3) for reservoirs and flowages, the ordinary high-water level is the operating elevation of the normal summer pool.\nMS 1994 [Renumbered subd 14b]\n\"Pasture\" means an area that was grazed by domesticated livestock or that was planted with annually seeded crops in a crop rotation seeding of grasses or legumes in six of the last ten years prior to January 1, 1991.\n\"Political subdivision\" means a county, city, town, school district, or other local government jurisdiction to which the state provides state aids or on which the state imposes state mandates.\n\"Presettlement wetland\" means a wetland or public waters wetland that existed in this state at the time of statehood in 1858.\n\"Project\" means a specific plan, contiguous activity, proposal, or design necessary to accomplish a goal as defined by the local government unit. As used in this chapter, a project may not be split into components or phases for the purpose of gaining additional exemptions.\n(a) \"Public waters\" means:\n(1) water basins assigned a shoreland management classification by the commissioner under sections 103F.201 to 103F.221;\n(2) waters of the state that have been finally determined to be public waters or navigable waters by a court of competent jurisdiction;\n(3) meandered lakes, excluding lakes that have been legally drained;\n(4) water basins previously designated by the commissioner for management for a specific purpose such as trout lakes and game lakes pursuant to applicable laws;\n(5) water basins designated as scientific and natural areas under section 84.033;\n(6) water basins located within and totally surrounded by publicly owned lands;\n(7) water basins where the state of Minnesota or the federal government holds title to any of the beds or shores, unless the owner declares that the water is not necessary for the purposes of the public ownership;\n(8) water basins where there is a publicly owned and controlled access that is intended to provide for public access to the water basin;\n(9) natural and altered watercourses with a total drainage area greater than two square miles;\n(10) natural and altered watercourses designated by the commissioner as trout streams; and\n(11) public waters wetlands, unless the statute expressly states otherwise.\n(b) Public waters are not determined exclusively by:\n(1) the proprietorship of the underlying, overlying, or surrounding land;\n(2) whether it is a body or stream of water that was navigable in fact or susceptible of being used as a highway for commerce at the time this state was admitted to the union; or\n(3) their inclusion in or exclusion from the public waters inventory required under section 103G.201. This clause is effective July 1, 2027.\n\"Public waters wetlands\" means all types 3, 4, and 5 wetlands, as defined in United States Fish and Wildlife Service Circular No. 39 (1971 edition), not included within the definition of public waters, that are ten or more acres in size in unincorporated areas or 2-1/2 or more acres in incorporated areas.\nMS 2010 [Renumbered subd 15f]\nMS 2010 [Renumbered subd 15g]\nMS 2010 [Renumbered subd 15h]\n\"Shallow lake\" means a body of water, excluding a stream, that is greater than or equal to 50 acres in size and less than or equal to 15 feet in maximum depth.\n\"Shoreland wetland protection zone\" means:\n(1) for local government units that have a shoreland management ordinance approved under sections 103F.201 to 103F.221, the shoreland wetland protection zone is:\n(i) 1,000 feet from the ordinary high-water level of a water basin that is a public water identified in the shoreland management ordinance or the shoreland area approved by the commissioner as provided in the shoreland management rules adopted under section 103F.211, whichever is less; or\n(ii) 300 feet from the ordinary high-water level of a watercourse identified in the shoreland management ordinance or the shoreland area approved by the commissioner as provided in the shoreland management rules adopted under section 103F.211, whichever is less; and\n(2) for local government units that do not have a shoreland management ordinance approved under sections 103F.201 to 103F.221, the shoreland wetland protection zone is:\n(i) 1,000 feet from the ordinary high-water level of a water basin that is a public water that is at least ten acres in size within municipalities and at least 25 acres in size in unincorporated areas; or\n(ii) 300 feet from the ordinary high-water level of a watercourse identified by the public waters inventory under section 103G.201.\n\"Silviculture\" means the management of forest trees.\n[Renumbered subd 15j]\n\"Sustainable diversion limit\" means a maximum amount of water that can be removed directly or indirectly from a surface water body in a defined geographic area on a monthly or annual basis without causing a negative impact to the surface water body.\n\"Utility\" means a sanitary sewer, storm sewer, potable water distribution, and transmission, distribution, or furnishing, at wholesale or retail, of natural or manufactured gas, electricity, telephone, or radio service or communications.\n\"Water basin\" means an enclosed natural depression with definable banks, capable of containing water, that may be partly filled with waters of the state and is discernible on aerial photographs.\n\"Waters of the state\" means surface or underground waters, except surface waters that are not confined but are spread and diffused over the land. Waters of the state includes boundary and inland waters.\n\"Watershed\" means the 81 major watershed units delineated by the map, \"State of Minnesota Watershed Boundaries - 1979.\"\n\"Wetland type\" means a wetland type classified according to Wetlands of the United States, United States Fish and Wildlife Service Circular 39 (1971 edition) or A Hydrogeomorphic Classification for Wetlands, United States Army Corps of Engineers (August 1993), including updates, supplementary guidance, and replacements, if any, as determined by the board.\nMS 1994 [Renumbered subd 15a]\n(a) \"Wetlands\" means lands transitional between terrestrial and aquatic systems where the water table is usually at or near the surface or the land is covered by shallow water. For purposes of this definition, wetlands must have the following three attributes:\n(1) have a predominance of hydric soils;\n(2) are inundated or saturated by surface water or groundwater at a frequency and duration sufficient to support a prevalence of hydrophytic vegetation typically adapted for life in saturated soil conditions; and\n(3) under normal circumstances support a prevalence of such vegetation.\n(b) For the purposes of regulation under this chapter, the term wetlands does not include public waters wetlands as defined in subdivision 15a.\n(c) Notwithstanding paragraph (a), wetlands includes deepwater aquatic habitats that are not public waters or public waters wetlands. For purposes of this paragraph, \"deepwater aquatic habitats\" has the meaning given in Corps of Engineers Wetlands Delineation Manual, United States Army Corps of Engineers (January 1987).",
	"repealed": false
}