{
	"id": "147F.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/147F.01",
	"title": "147F.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given them.\n\"ABGC\" means the American Board of Genetic Counseling, a national agency for certification and recertification of genetic counselors, or its successor organization or equivalent.\n\"ABMG\" means the American Board of Medical Genetics, a national agency for certification and recertification of genetic counselors, medical geneticists, and Ph.D. geneticists, or its successor organization.\n\"ACGC\" means the Accreditation Council for Genetic Counseling, a specialized program accreditation board for educational training programs granting master's degrees or higher in genetic counseling, or its successor organization.\n\"Board\" means the Board of Medical Practice.\n\"Eligible status\" means an applicant who has met the requirements and received approval from the ABGC to sit for the certification examination.\n\"Genetic counseling\" means the provision of services described in section 147F.03 to help clients and their families understand the medical, psychological, and familial implications of genetic contributions to a disease or medical condition.\n\"Genetic counselor\" means an individual licensed under this chapter to engage in the practice of genetic counseling.\n\"Licensed physician\" means an individual who is licensed to practice medicine under chapter 147.\n\"NSGC\" means the National Society of Genetic Counselors, a professional membership association for genetic counselors that approves continuing education programs.\n\"Qualified supervisor\" means any person who is licensed under this chapter as a genetic counselor or a physician licensed under chapter 147 to practice medicine in Minnesota.\n\"Supervisee\" means a genetic counselor with a provisional license.\n\"Supervision\" means an assessment of the work of the supervisee, including regular meetings and file review, by a qualified supervisor according to the supervision contract. Supervision does not require the qualified supervisor to be present while the supervisee provides services.",
	"repealed": false
}