{
	"id": "168.1253",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1253",
	"title": "168.1253 GOLD STAR LICENSE PLATE.",
	"text": "(a) The terms used in this section have the meanings given them in this subdivision.\n(b) \"Active service\" has the meaning given in section 190.05, subdivision 5.\n(c) \"Eligible person\" means a surviving spouse, parent or legal guardian, child, or sibling of a person who has died while serving honorably in active service. For the purposes of this section, an eligibility relationship may be established by birth or adoption.\n(d) \"Motor vehicle\" means a vehicle for personal use, not used for commercial purposes, and may include a passenger automobile, motorcycle, recreational vehicle, pickup truck, or van.\nThe commissioner shall issue special plates bearing the inscription \"GOLD STAR\" to an applicant who:\n(1) is an owner or joint owner of a motor vehicle;\n(2) is an eligible person; and\n(3) complies with all laws relating to the registration and licensing of motor vehicles and drivers.\nThe commissioner shall issue a set of Gold Star plates, or a single plate for a motorcycle, to an eligible person free of charge, and shall replace the plate or plates without charge if they become damaged. If the eligible person requests personalized Gold Star plates, the commissioner must not charge the fees listed in section 168.12, subdivision 2a.\nThe special plates issued under this section must be of a design and size determined by the commissioner, in consultation with the commissioner of veterans affairs. The commissioner may design the plates in accordance with section 168.1291, subdivision 2.\nOn payment of a fee of $5 and notification to the commissioner, special plates issued under this section may be transferred to another motor vehicle owned or jointly owned by the eligible person.\nThe commissioner of management and budget may transfer money in the \"Support Our Troops\" account under section 190.19, subdivision 2a, to the driver and vehicle services operating account under section 299A.705, subdivision 1, to pay for the cost of production of the license plates authorized under this section. The commissioner of veterans affairs and the commissioner of public safety must agree on a payment schedule before any money may be transferred under this subdivision.",
	"repealed": false
}