{
	"id": "169.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.65",
	"title": "169.65 SPECIFICATIONS FOR LIGHTING AND OTHER DEVICES.",
	"text": "(a) The commissioner of public safety is hereby authorized and required to adopt and enforce standard specifications as to the amount, color and direction of light to be emitted or reflected by lighting devices and as to the general construction and mounting on the vehicle for compliance with the requirements and limitations of this chapter.\n(b) No person shall have for sale, sell, or offer for sale for use upon or as a part of the equipment of a vehicle, trailer or semitrailer, or use upon any such vehicle, any headlamp, auxiliary driving lamp, rear lamp, signal lamp, spot lamp, clearance lamp, marker lamp or reflector, or parts of any of the foregoing, unless of a type which has been submitted to and approved by the commissioner of public safety.\n(c) No person shall have for sale, sell, or offer for sale for use upon or as a part of the equipment of a vehicle, trailer or semitrailer, or bicycle, or use upon any such vehicle, any lamp or device mentioned in this section, which has been approved by the commissioner of public safety unless such lamp or device bears thereon the trademark or name and model designation all permanently marked under which it is approved so as to be legible when installed.\n(d) No person shall use upon any vehicle, trailer or semitrailer or bicycle any lamps mentioned in this section unless such lamps are equipped with bulbs of a type approved by the commissioner of public safety, having a rated candle power, and are mounted and adjusted as to focus and aim in accordance with instructions of the commissioner of public safety.\n(e) The commissioner of public safety is hereby authorized to approve or disapprove lighting devices.\n(f) The commissioner of public safety is hereby required to approve or disapprove any lighting device, of a type on which approval is specifically required in this chapter, within a reasonable time after such device has been submitted.\n(g) The commissioner of public safety is further authorized to set up a procedure which shall be followed when any device is submitted for approval.\n(h) The commissioner of public safety is authorized to set and collect a reasonable fee for the testing and approval of all types of devices upon which approval is required in this chapter. Such fee may be sufficient in amount to reimburse the Department of Public Safety for all costs connected with such test and approval.\n(i) The commissioner of public safety, upon approving any such lamp or device, shall issue to the applicant a certificate of approval, together with any instructions determined by the commissioner of public safety.\n(j) The commissioner of public safety shall publish lists of all lamps and devices by name and type which have been approved by the commissioner of public safety, together with instructions as to the permissible candlepower rating of the bulbs which the commissioner of public safety has determined for use therein and such other instructions as to adjustment as the commissioner of public safety may deem necessary. No person shall sell for use or use on any vehicle any reconverted lamp or any device redesigned for a use other than for which it was originally approved unless authorized by the commissioner of public safety.",
	"repealed": false
}