{
	"id": "178.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/178.036",
	"title": "178.036 STANDARDS OF APPRENTICESHIP.",
	"text": "Each program must have an organized, written plan of program standards embodying the terms and conditions of employment, training, and supervision of one or more apprentices in an apprenticeable trade or occupation, as defined in Code of Federal Regulations, title 29, part 29, section 29.4, and subscribed to by a sponsor and employer who has undertaken to carry out the apprentice training program. The program standards must contain the provisions that address each item identified in Code of Federal Regulations, title 29, part 29, section 29.5(b).\nIn addition to the requirements in subdivision 1, the program standards must also contain provisions in compliance with subdivisions 3 to 12.\nA minimum of 144 hours of related instruction is required each training cycle. At least 50 hours of related safety instruction is required during the term of apprenticeship. Time spent in related instruction cannot be considered as hours of work as required by the work process schedule. Related instruction must be designated in hours for each individual trade or occupation included in the standards. Every apprenticeship instructor must meet the Department of Education's requirements for a career and technical education instructor or be a subject matter expert, which is an individual such as a journeyworker who is recognized within an industry as having expertise in a specific trade or occupation.\nEach apprenticeship program must include not less than 2,000 hours of reasonably continuous employment.\nIf the apprentice is covered by a collective bargaining agreement, the employer must follow the provisions of the collective bargaining agreement regarding the maximum number of apprentices to be employed at the work site for each journeyworker employed at the same work site. In the absence of a collective bargaining agreement, for the purposes of direct supervision and the safety and instruction of the apprentice, the ratio shall be:\n(1) one apprentice for each journeyworker employed at the work site, except that for occupations in the building and construction trades or any hazardous occupation as defined by section 181A.04, subdivision 5, one apprentice for the first journeyworker employed at the work site plus one apprentice for each additional three journeyworkers employed at the work site;\n(2) the work site ratio utilized by the majority of registered apprenticeship agreements in the same trade or occupation; or\n(3) a program-specific ratio that has been approved by the Apprenticeship Advisory Board.\nThe graduated schedule of wages for an apprenticeship program shall be calculated as a percentage of the journeyworker rate in the majority of registered apprenticeship agreements in the same trade or occupation in the state. If there are no registered apprenticeship agreements in the same trade or occupation, the graduated schedule of wages may be determined by the sponsor with the approval of the division.\nThe standards must provide a period of probation of not more than one year or 25 percent of the length of the program, whichever is shorter, during which time the apprenticeship agreement shall be terminated by the director upon written request of either party, and providing that after such probationary period the apprenticeship agreement may be terminated by the director by mutual agreement of all parties thereto, or terminated by the director for good and sufficient reason.\nThe program standards must include a provision that controversies or differences concerning the terms of the apprenticeship agreement which cannot be resolved by the parties thereto, or which are not covered by a collective bargaining agreement, may be submitted to the commissioner for determination as provided for in section 178.09.\nThe term of apprenticeship may be measured either through:\n(1) the time-based approach, which requires completion of at least 2,000 work hours of on-the-job training;\n(2) the competency-based approach, which requires the attainment of competency; or\n(3) the hybrid approach, which is a blend of the time-based and competency-based approaches.\nMS 2022 [Repealed, 2024 c 110 art 4 s 25]\nAn apprentice employed under the program standards shall agree to be punctual and regular in attendance, and to endeavor to the best of the apprentice's ability to perfect the required skills for the trade or occupation.\nThe sponsor shall designate a qualified individual as a coordinator of apprentices who shall:\n(1) maintain an adequate record of progress in training each apprentice;\n(2) be responsible for assuring that the requirements of the applicable learning program are met during the prescribed training term; and\n(3) perform other duties as may be assigned by the sponsor relative to the development and operation of an effective program of apprenticeship.",
	"repealed": false
}