{
	"id": "273.371",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.371",
	"title": "273.371 REPORTS OF UTILITY COMPANIES.",
	"text": "Every electric light, power, gas, water, express, stage, transportation, and pipeline company doing business in Minnesota shall annually file with the commissioner on or before March 31 a report under oath setting forth the information prescribed by the commissioner to enable the commissioner to make valuations, recommended valuations, and equalization required under sections 273.33, 273.35, 273.36, 273.37, and 273.3711. The commissioner shall prescribe the content, format, and manner of the report pursuant to section 270C.30, except that for cooperative associations defined in section 273.40, the information provided in the report must be aggregated to the unique taxing jurisdiction level and exclude information related to property subject to the in-lieu tax under section 273.41, and that a \"law administered by the commissioner\" includes the property tax laws. If all the required information is not available on March 31, the company shall file the information that is available on or before March 31, and the balance of the information as soon as it becomes available. If a report is made by electronic means, the taxpayer's signature is defined pursuant to section 270C.304, except that a \"law administered by the commissioner\" includes the property tax laws. For purposes of this subdivision, \"unique taxing jurisdiction\" means the geographic area subject to the same set of local tax rates.\nThe commissioner for good cause may extend the time for filing the report required by subdivision 1. The extension must not exceed 15 days.\nIf a company fails to file a report required by subdivision 1, the commissioner may, from information in the commissioner's possession or obtainable by the commissioner, make and file a report for the company or make the valuations, recommended valuations, and equalizations required under sections 273.33, 273.35 to 273.37, and 273.3711.",
	"repealed": false
}