{
	"id": "373.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/373.48",
	"title": "373.48 FINANCING ENERGY PURCHASE CONTRACTS; PARTICIPATION IN GENERATION AND TRANSMISSION PROJECTS.",
	"text": "For the purpose of this section, \"project\" means a facility that generates electricity from renewable energy sources listed in section 216B.1691, subdivision 1, paragraph (c).\nA county may, for itself or in cooperation with other counties, enter into agreements for the purchase of electrical energy from one or more projects, and may enter into agreements with a utility for the purchase and sale of the electrical energy so purchased. Agreements may be for a term of one year to 20 years. A county may also acquire an ownership interest in a project and may enter into agreements for the purchase and sale of electrical energy produced. A county may not sell, transmit, or distribute the electrical energy at retail or provide for end use from an off-site facility by the county or counties of the electrical energy. A county's on-site generation authorized under this subdivision is limited to a total of ten megawatts. Nothing in this section modifies the exclusive service territories or exclusive right to serve as provided in sections 216B.37 to 216B.43. The energy to be purchased by a county under agreements entered into under this section and the energy produced that is commensurate with the county's interest in projects shall not in any year exceed the total amount of energy used by the county for its own facilities in the immediately preceding year, regardless of the source from which energy was obtained.\n(a) A county may enter into agreements under section 471.59 with other counties for joint purchase of energy or joint acquisition of interests in projects. A county that enters into a multiyear agreement for purchase of energy or acquires an interest in a project may finance the estimated cost of the energy to be purchased during the term of the agreement or the cost to the county of the interest in the project by the issuance of revenue bonds of the county, including clean renewable energy revenue bonds, provided that the annual debt service on all bonds issued under this section, together with the amounts to be paid by the county in any year for the purchase of energy under agreements entered into under this section, must not exceed the estimated revenues of the project.\n(b) An agreement entered into under section 471.59 as provided by this section may provide that:\n(1) each county issues bonds to pay their respective shares of the cost of the projects;\n(2) one of the counties issues bonds to pay the full costs of the project and that the other participating counties pay any available revenues of the project and pledge the revenues to the county that issues the bonds; or\n(3) the joint powers board issues revenue bonds to pay the full costs of the project and that the participating counties pay any available revenues of the project under this subdivision and pledge the revenues to the joint powers entity for payment of the revenue bonds.",
	"repealed": false
}