{
	"id": "62N.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/62N.31",
	"title": "62N.31 STANDARDS FOR ACCREDITED CAPITATED PROVIDER ACCREDITATION.",
	"text": "Each health care providing entity seeking initial accreditation as an accredited capitated provider shall submit to the commissioner of health sufficient information to establish that the applicant has operational capacity, facilities, personnel, and financial capability to provide the contracted covered services to the enrollees of the network for which it seeks accreditation (1) on an ongoing basis; and (2) for a period of 120 days following the insolvency of the network without receiving payment from the network. Accreditation shall continue until abandoned by the accredited capitated provider or revoked by the commissioner in accordance with subdivision 4. The applicant may establish financial capability by demonstrating that the provider amount at risk can be covered by or through any of allocated or restricted funds, a letter of credit, the taxing authority of the applicant or governmental sponsor of the applicant, an unrestricted fund balance at least two times the provider amount at risk, reinsurance, either purchased directly by the applicant or by the community network to which it will be accredited, or any other method accepted by the commissioner. Accreditation of a health care providing entity shall not in itself limit the right of the accredited capitated provider to seek payment of unpaid capitated amounts from a community network, whether the community network is solvent or insolvent; provided that, if the community network is subject to any liquidation, rehabilitation, or conservation proceedings, the accredited capitated provider shall have the status accorded creditors under section 60B.44, subdivision 10.\nEach accredited capitated provider shall submit to the commissioner annually, no later than April 15, the following information for each network to which it is accredited: the provider amount at risk for that year, the number of enrollees for the network, both for the prior year and estimated for the current year, any material change in the provider's operational or financial capacity since its last report, and any other information reasonably requested by the commissioner.\nEach accredited capitated provider shall provide the commissioner with 60 days' advance written notice of termination of the accredited capitated provider relationship with a network.\nThe commissioner may revoke the accreditation of an accredited capitated provider if the accredited capitated provider's ongoing operational or financial capabilities fail to meet the requirements of this section. The revocation shall be handled in the same fashion as placing a health maintenance organization under administrative supervision.",
	"repealed": false
}