{
	"id": "124D.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.79",
	"title": "124D.79 COMMUNITY AND COMMISSIONER PARTICIPATION IN AMERICAN INDIAN EDUCATION.",
	"text": "The commissioner must provide for the maximum involvement of the Tribal Nations Education Committee, parents of American Indian children, secondary students eligible to be served, American Indian language and culture education teachers, American Indian teachers, paraprofessionals, representatives of community groups, and persons knowledgeable in the field of American Indian education, in the formulation of policy and procedures relating to the administration of sections 124D.71 to 124D.82. The commissioner must annually hold a field hearing on Indian education to gather input from American Indian educators, parents, and students on the state of American Indian education in Minnesota. Results of the hearing must be made available to all 11 tribal nations for review and comment.\nThe commissioner shall provide technical assistance to districts, schools and postsecondary institutions for preservice and in-service training for teachers, American Indian education teachers and paraprofessionals specifically designed to implement culturally responsive teaching methods, culturally based curriculum development, testing and testing mechanisms, the development of materials for American Indian education programs, and the annual report of American Indian student data using the state count.\nThe commissioner shall apply for money which may be available under federal programs for American Indian education, including funds for administration, demonstration projects, training, technical assistance, planning and evaluation.\n(a) The commissioner shall seek consultation with the Tribal Nations Education Committee on all issues relating to American Indian education including:\n(1) administration of the commissioner's duties under sections 124D.71 to 124D.82 and other programs;\n(2) administration of other programs for the education of American Indian people, as determined by the commissioner;\n(3) awarding of scholarships to eligible American Indian students;\n(4) administration of the commissioner's duties regarding awarding of American Indian postsecondary preparation grants to school districts; and\n(5) recommendations of education policy changes for American Indians.\n(b) Membership in the Tribal Nations Education Committee is the sole discretion of the committee and nothing in this subdivision gives the commissioner authority to dictate committee membership.",
	"repealed": false
}