{
	"id": "270C.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.94",
	"title": "270C.94 PROPERTY OMITTED OR UNDERVALUED; REASSESSMENT; APPOINTMENT OF SPECIAL ASSESSOR.",
	"text": "When it shall be made to appear to the commissioner, by complaint or by the finding of a court or of the legislature, or either body of the legislature, or any committee of the legislature, or any city council or county board, that any considerable amount of property has been improperly omitted from the tax list or assessment roll of any district or county for any year, or, if assessed, that the same has been undervalued or overvalued, as compared with like property in the same county or in the state so that the assessment for such year in such district or county is grossly unfair and inequitable, whether or not the same has been equalized by the county board of equalization or the commissioner, the commissioner shall examine into the facts in the matter and, if satisfied that it would be for the best interests of the state that a reassessment of such property be made, the commissioner shall appoint a special assessor and such deputy assessors as may be necessary and cause a reassessment to be made of all or any of the real and personal property, or either, in any such district or county as the commissioner may deem best, to the end that all property in such district or county shall be assessed equitably as compared with like property in such district or county.\nThe commissioner shall appoint a special assessor and deputies and cause to be made, in any year, a reassessment of all or any real and personal property, or either, in any assessment district, when in the commissioner's judgment such reassessment is desirable or necessary, to the end that any and all property in such district shall be assessed equitably as compared with like property in the county wherein such district is situated.\nWhen an assessor has failed to properly appraise at least one-fifth of the parcels of property in a district or county as provided in section 273.01, the commissioner may appoint a special assessor and deputy assessor as necessary and cause a reappraisal to be made of the property due for reassessment in accordance with law.",
	"repealed": false
}