{
	"id": "349.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.39",
	"title": "349.39 APPEAL TO DISTRICT COURT; STAY; CONTINUANCE UNDER BOND; HEARING UPON ONE YEAR LIMITATION ON PREMISES.",
	"text": "Any licensee, or any owner of licensed premises, aggrieved by an order of an issuing authority suspending or revoking any license may appeal from that order to the district court of the county in which the licensee resides by serving a notice of the appeal upon the issuing authority or the clerk thereof. The notice of appeal shall state that the person appealing takes an appeal to that district court from the order suspending or revoking the license or licenses, describing them and identifying the order appealed from. This notice shall be served within 15 days from the date of service of the order appealed from, and the same, with proof of service thereof, shall be filed with the court administrator of the district court of the proper county. The appeal shall stand for trial at the next term of the district court following the filing of the notice of appeal, without the service of any notice of trial, and shall be tried in the district court de novo. The trial shall be by jury if the appellant shall so demand. The licensee may continue to operate the licensed business or businesses until the final disposition of such appeal. If the district court upon the appeal shall determine that any license involved in the appeal should be suspended or revoked, it may, nevertheless, in its discretion permit the continuance of the licensed business under a bond in the amount and in the form and containing the conditions prescribed by the court. The district court on the appeal, or in a separate proceeding, may permit the issuance of a new license to a different licensee before the expiration of the period of one year specified in section 349.35, subdivision 2, upon such terms and conditions imposed by the court as will insure that no gambling device shall thereafter be maintained upon the licensed premises.",
	"repealed": false
}