{
	"id": "43A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.23",
	"title": "43A.23 CONTRACTING AUTHORITY.",
	"text": "(a) The commissioner is authorized to request proposals or to negotiate and to enter into contracts with parties which in the judgment of the commissioner are best qualified to provide service to the benefit plans. Contracts entered into are not subject to the requirements of sections 16C.16 to 16C.19. The commissioner may negotiate premium rates and coverage. The commissioner shall consider the cost of the plans, conversion options relating to the contracts, service capabilities, character, financial position, and reputation of the carriers, and any other factors which the commissioner deems appropriate. Each benefit contract must be for a uniform term of at least one year, but may be made automatically renewable from term to term in the absence of notice of termination by either party. A carrier licensed under chapter 62A is exempt from the taxes imposed by chapter 297I on premiums paid to it by the state.\n(b) All self-insured hospital and medical service products must comply with coverage mandates, data reporting, and consumer protection requirements applicable to the licensed carrier administering the product, had the product been insured, including chapters 62J, 62M, and 62Q. Any self-insured products that limit coverage to a network of providers or provide different levels of coverage between network and nonnetwork providers shall comply with section 62D.123 and geographic access standards for health maintenance organizations adopted by the commissioner of health in rule under chapter 62D.\n(c) Notwithstanding paragraph (b), a self-insured hospital and medical product offered under sections 43A.22 to 43A.30 is required to extend dependent coverage to an eligible employee's child to the full extent required under chapters 62A and 62L. Dependent child coverage must, at a minimum, extend to an eligible employee's dependent child to the limiting age as defined in section 62Q.01, subdivision 2a, disabled children to the extent required in sections 62A.14 and 62A.141, and dependent grandchildren to the extent required in sections 62A.042 and 62A.302.\n(d) Beginning January 1, 2010, the health insurance benefit plans offered in the commissioner's plan under section 43A.18, subdivision 2, and the managerial plan under section 43A.18, subdivision 3, must include an option for a health plan that is compatible with the definition of a high-deductible health plan in section 223 of the United States Internal Revenue Code.\n(a) Each contract under sections 43A.22 to 43A.30 shall contain a detailed statement of benefits offered and shall include any maximums, limitations, exclusions, and other definitions of benefits the commissioner deems necessary or desirable. Each hospital and medical benefits contract shall provide benefits at least equal to those required by section 62E.06, subdivision 2.\n(b) All summaries of benefits describing the hospital and medical service benefits offered to state employees must comply with laws and rules for content and clarity applicable to the licensed carrier administering the product. Referral procedures must be clearly described. The commissioners of commerce and health, as appropriate, shall review the summaries of benefits, whether written or electronic, and advise the commissioner on any changes needed to ensure compliance.\nThe commissioner of management and budget may contract with carriers authorized to provide coverage under the state employees group insurance plan to extend coverage to eligible employees who incur medical expenses due to a personal injury which results from their state employment which is compensable under chapter 176.\nFor participants in the state employee group insurance program, the commissioner of management and budget must administer the identical benefit as is required under section 62A.3094.",
	"repealed": false
}