{
	"id": "360.0656",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.0656",
	"title": "360.0656 CUSTOM AIRPORT ZONING STANDARDS.",
	"text": "(a) Notwithstanding section 360.0655, a municipality, county, or joint airport zoning board must provide notice to the commissioner when the municipality, county, or joint airport zoning board intends to establish and adopt custom airport zoning regulations under this section.\n(b) Airport zoning regulations submitted to the commissioner under this subdivision are not subject to the commissioner's zoning regulations under section 360.0655 or Minnesota Rules, part 8800.2400.\n(c) When developing and adopting custom airport zoning regulations under this section, the municipality, county, or joint airport zoning board must include in the record a detailed analysis that explains how the proposed custom airport zoning regulations addressed the following factors to ensure a reasonable level of safety:\n(1) the location of the airport, the surrounding land uses, and the character of neighborhoods in the vicinity of the airport, including:\n(i) the location of vulnerable populations, including schools, hospitals, and nursing homes, in the airport hazard area;\n(ii) the location of land uses that attract large assemblies of people in the airport hazard area;\n(iii) the availability of contiguous open spaces in the airport hazard area;\n(iv) the location of wildlife attractants in the airport hazard area;\n(v) airport ownership or control of the federal Runway Protection Zone and the department's Clear Zone;\n(vi) land uses that create or cause interference with the operation of radio or electronic facilities used by the airport or aircraft;\n(vii) land uses that make it difficult for pilots to distinguish between airport lights and other lights, result in glare in the eyes of pilots using the airport, or impair visibility in the vicinity of the airport;\n(viii) land uses that otherwise inhibit a pilot's ability to land, take off, or maneuver the aircraft;\n(ix) airspace protection to prevent the creation of air navigation hazards in the airport hazard area; and\n(x) the social and economic costs of restricting land uses;\n(2) the airport's type of operations and how the operations affect safety surrounding the airport;\n(3) the accident rate at the airport compared to a statistically significant sample, including an analysis of accident distribution based on the rate with a higher accident incidence;\n(4) the planned land uses within an airport hazard area, including any applicable platting, zoning, comprehensive plan, or transportation plan; and\n(5) any other information relevant to safety or the airport.\n(a) Except as provided in section 360.0655, prior to adopting zoning regulations, the municipality, county, or joint airport zoning board must submit its proposed regulations and the supporting record to the commissioner for review. The commissioner must determine whether the proposed custom airport zoning regulations and supporting record (1) evaluate the criteria under subdivision 1, and (2) provide a reasonable level of safety.\n(b) Notwithstanding section 15.99, the commissioner must examine the proposed regulations within 90 days of receipt of the regulations and report to the municipality, county, or joint airport zoning board the commissioner's approval or objections, if any. Failure to respond within 90 days is deemed an approval. The commissioner may request additional information from the municipality, county, or joint airport zoning board within the 90-day review period.\n(c) If the commissioner objects on the grounds that the regulations do not provide a reasonable level of safety, the municipality, county, or joint airport zoning board must review, consider, and provide a detailed explanation demonstrating how it evaluated the objections and what action it took or did not take in response to the objections. If the municipality, county, or joint airport zoning board submits amended regulations after its initial public hearing, the municipality, county, or joint airport zoning board must conduct a second public hearing on the revisions and resubmit the revised proposed regulations to the commissioner for review. The commissioner must examine the revised proposed regulations within 90 days of receipt of the regulations. If the commissioner requests additional information, the 90-day review period is tolled until satisfactory information is received by the commissioner. Failure to respond within 90 days is deemed an approval.\n(d) If, after the second review period, the commissioner determines that the municipality, county, or joint airport zoning board failed to submit proposed regulations that provide a reasonable level of safety, the commissioner must provide a final written decision to the municipality, county, or joint airport zoning board.\n(e) A municipality, county, or joint airport zoning board is prohibited from adopting custom regulations or taking other action until the proposed regulations are approved by the commissioner.\n(f) If the commissioner approves the proposed regulations, the municipality, county, or joint airport zoning board may adopt the regulations.\n(g) A copy of the adopted regulations must be filed with the county recorder in each county that contains a zoned area subject to the regulations.\n(h) Substantive rights that existed and had been exercised prior to August 1, 2019, are not affected by the filing of the regulations.",
	"repealed": false
}