{
	"id": "151.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.37",
	"title": "151.37 LEGEND DRUGS; WHO MAY PRESCRIBE, POSSESS.",
	"text": "Except as otherwise provided in this chapter, it shall be unlawful for any person to have in possession, or to sell, give away, barter, exchange, or distribute a legend drug.\n(a) A licensed practitioner in the course of professional practice only, may prescribe, administer, and dispense a legend drug, and may cause the same to be administered by a nurse or medical student or resident under the practitioner's direction and supervision, and may cause a person who is an appropriately certified, registered, or licensed health care professional to prescribe, dispense, and administer the same within the expressed legal scope of the person's practice as defined in Minnesota Statutes. A licensed practitioner may prescribe a legend drug, without reference to a specific patient, by directing a licensed dietitian or licensed nutritionist, pursuant to section 148.634; a nurse, pursuant to section 148.235, subdivisions 8 and 9; medical student or resident; or pharmacist according to section 151.01, subdivision 27, to adhere to a particular practice guideline or protocol when treating patients whose condition falls within such guideline or protocol, and when such guideline or protocol specifies the circumstances under which the legend drug is to be prescribed and administered. An individual who verbally, electronically, or otherwise transmits a written, oral, or electronic order, as an agent of a prescriber, shall not be deemed to have prescribed the legend drug.\n(b) The commissioner of health, if a licensed practitioner, or a person designated by the commissioner who is a licensed practitioner, may prescribe a legend drug to an individual or by protocol for mass dispensing purposes where the commissioner finds that the conditions triggering section 144.4197 or 144.4198, subdivision 2, paragraph (b), exist. The commissioner, if a licensed practitioner, or a designated licensed practitioner, may prescribe, dispense, or administer a legend drug or other substance listed in subdivision 10 to control tuberculosis and other communicable diseases. The commissioner may modify state drug labeling requirements, and medical screening criteria and documentation, where time is critical and limited labeling and screening are most likely to ensure legend drugs reach the maximum number of persons in a timely fashion so as to reduce morbidity and mortality.\n(c) A licensed practitioner that dispenses for profit a legend drug that is to be administered orally, is ordinarily dispensed by a pharmacist, and is not a vaccine, must file with the practitioner's licensing board a statement indicating that the practitioner dispenses legend drugs for profit, the general circumstances under which the practitioner dispenses for profit, and the types of legend drugs generally dispensed. It is unlawful to dispense legend drugs for profit after July 31, 1990, unless the statement has been filed with the appropriate licensing board. For purposes of this paragraph, \"profit\" means (1) any amount received by the practitioner in excess of the acquisition cost of a legend drug for legend drugs that are purchased in prepackaged form, or (2) any amount received by the practitioner in excess of the acquisition cost of a legend drug plus the cost of making the drug available if the legend drug requires compounding, packaging, or other treatment. The statement filed under this paragraph is public data under section 13.03. This paragraph does not apply to a licensed doctor of veterinary medicine or a registered pharmacist. Any person other than a licensed practitioner with the authority to prescribe, dispense, and administer a legend drug under paragraph (a) shall not dispense for profit. To dispense for profit does not include dispensing by a community health clinic when the profit from dispensing is used to meet operating expenses.\n(d) A prescription drug order for the following drugs is not valid, unless it can be established that the prescription drug order was based on a documented patient evaluation, including an examination, adequate to establish a diagnosis and identify underlying conditions and contraindications to treatment:\n(1) controlled substance drugs listed in section 152.02, subdivisions 3 to 5;\n(2) drugs defined by the Board of Pharmacy as controlled substances under section 152.02, subdivisions 7, 8, and 12;\n(3) muscle relaxants;\n(4) centrally acting analgesics with opioid activity;\n(5) drugs containing butalbital; or\n(6) phosphodiesterase type 5 inhibitors when used to treat erectile dysfunction.\n(e) For the purposes of paragraph (d), the requirement for an examination shall be met if:\n(1) an in-person examination has been completed in any of the following circumstances:\n(i) the prescribing practitioner examines the patient at the time the prescription or drug order is issued;\n(ii) the prescribing practitioner has performed a prior examination of the patient;\n(iii) another prescribing practitioner practicing within the same group or clinic as the prescribing practitioner has examined the patient;\n(iv) a consulting practitioner to whom the prescribing practitioner has referred the patient has examined the patient; or\n(v) the referring practitioner has performed an examination in the case of a consultant practitioner issuing a prescription or drug order when providing services by means of telehealth; or\n(2) the prescription order is for a drug listed in paragraph (d), clause (6), or for substance use disorder treatment with medications for opioid use disorder, and the prescribing practitioner has completed an examination of the patient via telehealth as defined in section 62A.673, subdivision 2, paragraph (h).\n(f) Nothing in paragraph (d) or (e) prohibits a licensed practitioner from prescribing a drug through the use of a guideline or protocol pursuant to paragraph (a).\n(g) Nothing in this chapter prohibits a licensed practitioner from issuing a prescription or dispensing a legend drug in accordance with the Expedited Partner Therapy in the Management of Sexually Transmitted Diseases guidance document issued by the United States Centers for Disease Control.\n(h) Nothing in paragraph (d) or (e) limits prescription, administration, or dispensing of legend drugs through a public health clinic or other distribution mechanism approved by the commissioner of health or a community health board in order to prevent, mitigate, or treat a pandemic illness, infectious disease outbreak, or intentional or accidental release of a biological, chemical, or radiological agent.\n(i) No pharmacist employed by, under contract to, or working for a pharmacy located within the state and licensed under section 151.19, subdivision 1, may dispense a legend drug based on a prescription that the pharmacist knows, or would reasonably be expected to know, is not valid under paragraph (d).\n(j) No pharmacist employed by, under contract to, or working for a pharmacy located outside the state and licensed under section 151.19, subdivision 1, may dispense a legend drug to a resident of this state based on a prescription that the pharmacist knows, or would reasonably be expected to know, is not valid under paragraph (d).\n(k) Nothing in this chapter prohibits the commissioner of health, if a licensed practitioner, or, if not a licensed practitioner, a designee of the commissioner who is a licensed practitioner, from prescribing legend drugs for field-delivered therapy in the treatment of a communicable disease according to the Centers For Disease Control and Prevention Partner Services Guidelines.\nMS 2020 [Repealed, 2022 c 58 s 171]\nA licensed doctor of veterinary medicine, in the course of professional practice only and not for use by a human being, may personally prescribe, administer, and dispense a legend drug, and may cause the same to be administered or dispensed by an assistant under the doctor's direction and supervision.\n(a) Any qualified person may use legend drugs in the course of a bona fide research project, but cannot administer or dispense such drugs to human beings unless such drugs are prescribed, dispensed, and administered by a person lawfully authorized to do so.\n(b) Drugs may be dispensed or distributed by a pharmacy licensed by the board for use by, or administration to, patients enrolled in a bona fide research study that is being conducted pursuant to either an investigational new drug application approved by the United States Food and Drug Administration or that has been approved by an institutional review board. For the purposes of this subdivision only:\n(1) a prescription drug order is not required for a pharmacy to dispense a research drug, unless the study protocol requires the pharmacy to receive such an order;\n(2) notwithstanding the prescription labeling requirements found in this chapter or the rules promulgated by the board, a research drug may be labeled as required by the study protocol;\n(3) dispensing and distribution of research drugs by pharmacies shall not be considered manufacturing or wholesaling under this chapter; and\n(4) a pharmacy may compound drugs for research studies as provided in this subdivision but must follow applicable standards established by United States Pharmacopeia, chapter 795 or 797, for nonsterile and sterile compounding, respectively.\n(c) An entity that is under contract to a federal agency for the purpose of distributing drugs for bona fide research studies is exempt from the drug wholesaler licensing requirements of this chapter. Any other entity is exempt from the drug wholesaler licensing requirements of this chapter if the board finds that the entity is licensed or registered according to the laws of the state in which it is physically located and it is distributing drugs for use by, or administration to, patients enrolled in a bona fide research study that is being conducted pursuant to either an investigational new drug application approved by the United States Food and Drug Administration or that has been approved by an institutional review board.\nNothing in this chapter shall prohibit the sale to, or the possession of, a legend drug by licensed drug wholesalers, licensed manufacturers, registered pharmacies, local detoxification centers, licensed hospitals, bona fide hospitals wherein animals are treated, or licensed pharmacists and licensed practitioners while acting within the course of their practice only.\n(a) Nothing in this chapter shall prohibit the possession of a legend drug by an employee, agent, or sales representative of a registered drug manufacturer, or an employee or agent of a registered drug wholesaler, or registered pharmacy, while acting in the course of employment.\n(b) Nothing in this chapter shall prohibit an employee of the following entities, while acting in the course of employment, from possessing a legend drug for the purpose of disposing of the legend drug as pharmaceutical waste, provided that controlled substances listed in section 152.02, subdivisions 3 to 6, may only be collected and disposed of as allowed under section 152.105:\n(1) a law enforcement agency;\n(2) a hazardous waste transporter that has notified the Pollution Control Agency of its activity;\n(3) a facility permitted by the Pollution Control Agency to treat, store, or dispose of hazardous waste, including household hazardous waste;\n(4) a facility licensed by the Pollution Control Agency or a metropolitan county, as defined in section 473.121, as a very small quantity generator collection program or household hazardous waste collection program; or\n(5) a sanitary district organized under chapter 115, or a special law.\nA pharmacy licensed under section 151.19 may collect a legend drug from an ultimate user, or from a long-term care facility on behalf of an ultimate user who resides or resided at the long-term care facility, for the purpose of disposing of the legend drug as pharmaceutical waste, provided that:\n(1) a pharmacy may collect and dispose of controlled substances listed in section 152.02, subdivisions 3 to 6, only as allowed under section 152.105; and\n(2) a pharmacy that has established a controlled substance disposal program pursuant to section 152.105 may also collect and dispose of noncontrolled substance legend and nonlegend drugs, but only in the same manner in which it collects and disposes of controlled substances.\n(a) Nothing in this chapter shall prohibit the possession of a legend drug by a person for that person's use when it has been dispensed to the person in accordance with a valid prescription issued by a practitioner.\n(b) Nothing in this chapter shall prohibit a person, for whom a legend drug has been dispensed in accordance with a written or oral prescription by a practitioner, from designating a family member, caregiver, or other individual to handle the legend drug for the purpose of assisting the person in obtaining or administering the drug or sending the drug for destruction.\n(c) Nothing in this chapter shall prohibit a person for whom a legend drug has been dispensed in accordance with a valid prescription issued by a practitioner from transferring the legend drug to an entity identified in subdivision 6. Controlled substances listed in section 152.02, subdivisions 3 to 6, may only be collected, stored, transported, and disposed of as allowed under section 152.105.\nIt is unlawful for a person to procure, attempt to procure, possess, or control a legend drug by any of the following means:\n(1) deceit, misrepresentation, or subterfuge;\n(2) using a false name; or\n(3) falsely assuming the title of, or falsely representing a person to be a manufacturer, wholesaler, pharmacist, practitioner, or other authorized person for the purpose of obtaining a legend drug.\nNothing in this chapter shall prohibit the possession of a legend drug by an employee or agent of a registered analytical laboratory while acting in the course of laboratory employment.\nThe commissioner of health, in preparation for and in carrying out the duties of sections 144.05, 144.4197, and 144.4198, may purchase, store, and distribute antituberculosis drugs, biologics, vaccines, antitoxins, serums, immunizing agents, antibiotics, antivirals, antidotes, other pharmaceutical agents, and medical supplies to treat and prevent communicable disease.\nNothing in this chapter shall prohibit the purchase, possession, or use of a legend drug by an entity acting according to an emergency use authorization issued by the United States Food and Drug Administration pursuant to United States Code, title 21, section 360bbb-3. The entity must be specifically tasked in a public health response plan to perform critical functions necessary to support the response to a public health incident or event.\nNothing in this section shall prohibit an accredited public or private postsecondary school from possessing a legend drug that is not a controlled substance listed in section 152.02, provided that:\n(1) the school is approved by the United States Secretary of Education in accordance with requirements of the Higher Education Act of 1965, as amended;\n(2) the school provides a course of instruction that prepares individuals for employment in a health care occupation or profession;\n(3) the school may only possess those drugs necessary for the instruction of such individuals; and\n(4) the drugs may only be used in the course of providing such instruction and are labeled by the purchaser to indicate that they are not to be administered to patients.\nThose areas of the school in which legend drugs are stored are subject to section 151.06, subdivision 1, paragraph (a), clause (4).\nA traditional midwife licensed under chapter 147D is authorized, consistent with the midwife's scope of professional practice and as necessary for the practice of midwifery, to directly obtain supplies and devices; obtain, possess, and administer drugs and diagnostic tests as permitted under section 147D.09, paragraph (b); order tests; and receive reports.\n(a) A licensed physician, a licensed advanced practice registered nurse authorized to prescribe drugs pursuant to section 148.235, or a licensed physician assistant may authorize the following individuals to administer opiate antagonists, as defined in section 604A.04, subdivision 1:\n(1) an emergency medical responder registered pursuant to section 144E.27;\n(2) a peace officer as defined in section 626.84, subdivision 1, paragraphs (c) and (d);\n(3) correctional employees of a state or local political subdivision;\n(4) staff of community-based health disease prevention or social service programs;\n(5) a volunteer firefighter;\n(6) a nurse or any other personnel employed by, or under contract with, a charter, public, or private school; and\n(7) transit rider investment program personnel authorized under section 473.4075.\n(b) For the purposes of this subdivision, opiate antagonists may be administered by one of these individuals only if:\n(1) the licensed physician, licensed physician assistant, or licensed advanced practice registered nurse has issued a standing order to, or entered into a protocol with, the individual; and\n(2) the individual has training in the recognition of signs of opiate overdose and the use of opiate antagonists as part of the emergency response to opiate overdose.\n(c) Nothing in this section prohibits the possession and administration of naloxone pursuant to section 604A.04.\n(d) Notwithstanding section 148.235, subdivisions 8 and 9, a licensed practical nurse is authorized to possess and administer according to this subdivision an opiate antagonist in a school setting.\n(a) The board shall develop an opiate antagonist protocol. When developing the protocol, the board shall consult with the Board of Medical Practice, the Board of Nursing, the commissioner of health, and professional associations of pharmacists, physicians, physician assistants, and advanced practice registered nurses.\n(b) The commissioner of health shall provide the following items to medical consultants appointed under section 145A.04, subdivision 2a:\n(1) educational materials concerning the need for, and opportunities to provide, greater access to opiate antagonists;\n(2) the opiate antagonist protocol developed by the board under paragraph (a); and\n(3) a notice of the liability protections under section 604A.04, subdivision 3, that are extended to cover the use of the opiate antagonist protocol developed under this subdivision.\n(c) The commissioner of health may designate a practitioner who is authorized to prescribe opiate antagonists to enter into the written protocol developed under paragraph (a) with pharmacists practicing within one or more community health service areas, upon the request of the applicable community health board. A community health board making a request to the commissioner under this section must do so by October 1 for the subsequent calendar year.\n(d) The immunity in section 604A.04, subdivision 3, is extended to both the commissioner of health and to the designated practitioner when prescribing according to the protocol under this subdivision. The commissioner of health and the designated practitioner are both deemed to be acting within the scope of employment for purposes of section 3.736, subdivision 9, when prescribing according to the protocol under this subdivision.\n(a) A pharmacist is authorized to prescribe self-administered hormonal contraceptives if the intended use is contraception in accordance with this subdivision. By January 1, 2021, the board shall develop a standardized protocol for the pharmacist to follow in prescribing self-administrated hormonal contraceptives. In developing the protocol, the board shall consult with the Minnesota Board of Medical Practice; the Minnesota Board of Nursing; the commissioner of health; the Minnesota section of the American Congress of Obstetricians and Gynecologists; professional pharmacy associations; and professional associations of physicians, physician assistants, and advanced practice registered nurses. The protocol must, at a minimum, include:\n(1) requiring the patient to complete a self-screening tool to identify patient risk factors for the use of self-administered hormonal contraceptives, based on the current United States Medical Eligibility Criteria for Contraceptive Use developed by the federal Centers for Disease Control and Prevention;\n(2) requiring the pharmacist to review the screening tool with the patient;\n(3) other assessments the pharmacist should make before prescribing self-administered hormonal contraceptives;\n(4) situations when the prescribing of self-administered hormonal contraceptives by a pharmacist is contraindicated;\n(5) situations when the pharmacist must refer a patient to the patient's primary care provider or, if the patient does not have a primary care provider, to a nearby clinic or hospital; and\n(6) any additional information concerning the requirements and prohibitions in this subdivision that the board considers necessary.\n(b) Before a pharmacist is authorized to prescribe a self-administered hormonal contraceptive to a patient under this subdivision, the pharmacist shall successfully complete a training program on prescribing self-administered hormonal contraceptives that is offered by a college of pharmacy or by a continuing education provider that is accredited by the Accreditation Council for Pharmacy Education, or a program approved by the board. To maintain authorization to prescribe, the pharmacist shall complete continuing education requirements as specified by the board.\n(c) Before prescribing a self-administered hormonal contraceptive, the pharmacist shall follow the standardized protocol developed under paragraph (a), and if appropriate, may prescribe a self-administered hormonal contraceptive to a patient, if the patient is:\n(1) 18 years of age or older; or\n(2) under the age of 18 if the patient has previously been prescribed a self-administered hormonal contraceptive by a licensed physician, physician assistant, or advanced practice registered nurse.\n(d) The pharmacist shall provide counseling to the patient on the use of self-administered hormonal contraceptives and provide the patient with a fact sheet that includes but is not limited to the contraindications for use of the drug, the appropriate method for using the drug, the need for medical follow-up, and any additional information listed in Minnesota Rules, part 6800.0910, subpart 2, that is required to be given to a patient during the counseling process. The pharmacist shall also provide the patient with a written record of the self-administered hormonal contraceptive prescribed by the pharmacist.\n(e) If a pharmacist prescribes and dispenses a self-administered hormonal contraceptive under this subdivision, the pharmacist shall not prescribe a refill to the patient unless the patient has evidence of a clinical visit with a physician, physician assistant, or advanced practice registered nurse within the preceding three years.\n(f) A pharmacist who is authorized to prescribe a self-administered hormonal contraceptive is prohibited from delegating the prescribing to any other person. A pharmacist intern registered pursuant to section 151.101 may prepare a prescription for a self-administered hormonal contraceptive, but before the prescription is processed or dispensed, a pharmacist authorized to prescribe under this subdivision must review, approve, and sign the prescription.\n(g) Nothing in this subdivision prohibits a pharmacist from participating in the initiation, management, modification, and discontinuation of drug therapy according to a protocol or collaborative agreement as authorized in this section and in section 151.01, subdivision 27.\n(a) A pharmacist is authorized to prescribe nicotine replacement medications approved by the United States Food and Drug Administration in accordance with this subdivision. By January 1, 2021, the board shall develop a standardized protocol for the pharmacist to follow in prescribing nicotine replacement medications. In developing the protocol, the board shall consult with the Minnesota Board of Medical Practice; the Minnesota Board of Nursing; the commissioner of health; professional pharmacy associations; and professional associations of physicians, physician assistants, and advanced practice registered nurses.\n(b) Before a pharmacist is authorized to prescribe nicotine replacement medications under this subdivision, the pharmacist shall successfully complete a training program specifically developed for prescribing nicotine replacement medications that is offered by a college of pharmacy or by a continuing education provider that is accredited by the Accreditation Council for Pharmacy Education, or a program approved by the board. To maintain authorization to prescribe, the pharmacist shall complete continuing education requirements as specified by the board.\n(c) Before prescribing a nicotine replacement medication, the pharmacist shall follow the appropriate standardized protocol developed under paragraph (a), and if appropriate, may dispense to a patient a nicotine replacement medication.\n(d) The pharmacist shall provide counseling to the patient on the use of the nicotine replacement medication and provide the patient with a fact sheet that includes but is not limited to the indications and contraindications for use of a nicotine replacement medication, the appropriate method for using the medication or product, the need for medical follow-up, and any additional information listed in Minnesota Rules, part 6800.0910, subpart 2, that is required to be given to a patient during the counseling process. The pharmacist shall also provide the patient with a written record of the medication prescribed by the pharmacist.\n(e) A pharmacist who is authorized to prescribe a nicotine replacement medication under this subdivision is prohibited from delegating the prescribing of the medication to any other person. A pharmacist intern registered pursuant to section 151.101 may prepare a prescription for the medication, but before the prescription is processed or dispensed, a pharmacist authorized to prescribe under this subdivision must review, approve, and sign the prescription.\n(f) Nothing in this subdivision prohibits a pharmacist from participating in the initiation, management, modification, and discontinuation of drug therapy according to a protocol or collaborative agreement as authorized in this section and in section 151.01, subdivision 27.\n(a) A pharmacist is authorized to prescribe opiate antagonists for the treatment of an acute opiate overdose. By January 1, 2021, the board shall develop a standardized protocol for the pharmacist to follow in prescribing an opiate antagonist. In developing the protocol, the board shall consult with the Minnesota Board of Medical Practice; the Minnesota Board of Nursing; the commissioner of health; professional pharmacy associations; and professional associations of physicians, physician assistants, and advanced practice registered nurses.\n(b) Before a pharmacist is authorized to prescribe an opiate antagonist under this subdivision, the pharmacist shall successfully complete a training program specifically developed for prescribing opiate antagonists for the treatment of an acute opiate overdose that is offered by a college of pharmacy or by a continuing education provider that is accredited by the Accreditation Council for Pharmacy Education, or a program approved by the board. To maintain authorization to prescribe, the pharmacist shall complete continuing education requirements as specified by the board.\n(c) Before prescribing an opiate antagonist under this subdivision, the pharmacist shall follow the appropriate standardized protocol developed under paragraph (a), and if appropriate, may dispense to a patient an opiate antagonist.\n(d) The pharmacist shall provide counseling to the patient on the use of the opiate antagonist and provide the patient with a fact sheet that includes but is not limited to the indications and contraindications for use of the opiate antagonist, the appropriate method for using the opiate antagonist, the need for medical follow-up, and any additional information listed in Minnesota Rules, part 6800.0910, subpart 2, that is required to be given to a patient during the counseling process. The pharmacist shall also provide the patient with a written record of the opiate antagonist prescribed by the pharmacist.\n(e) A pharmacist who prescribes an opiate antagonist under this subdivision is prohibited from delegating the prescribing of the medication to any other person. A pharmacist intern registered pursuant to section 151.101 may prepare the prescription for the opiate antagonist, but before the prescription is processed or dispensed, a pharmacist authorized to prescribe under this subdivision must review, approve, and sign the prescription.\n(f) Nothing in this subdivision prohibits a pharmacist from participating in the initiation, management, modification, and discontinuation of drug therapy according to a protocol as authorized in this section and in section 151.01, subdivision 27.\n(a) A pharmacist is authorized to prescribe and administer drugs to prevent the acquisition of human immunodeficiency virus (HIV) in accordance with this subdivision.\n(b) By January 1, 2025, the Board of Pharmacy shall develop a standardized protocol for a pharmacist to follow in prescribing the drugs described in paragraph (a). In developing the protocol, the board may consult with community health advocacy groups, the Board of Medical Practice, the Board of Nursing, the commissioner of health, professional pharmacy associations, and professional associations for physicians, physician assistants, and advanced practice registered nurses.\n(c) Before a pharmacist is authorized to prescribe a drug described in paragraph (a), the pharmacist must successfully complete a training program specifically developed for prescribing drugs for preventing the acquisition of HIV that is offered by a college of pharmacy, a continuing education provider that is accredited by the Accreditation Council for Pharmacy Education, or a program approved by the board. To maintain authorization to prescribe, the pharmacist shall complete continuing education requirements as specified by the board.\n(d) Before prescribing a drug described in paragraph (a), the pharmacist shall follow the appropriate standardized protocol developed under paragraph (b) and, if appropriate, may dispense to a patient a drug described in paragraph (a).\n(e) Before dispensing a drug described in paragraph (a) that is prescribed by the pharmacist, the pharmacist must provide counseling to the patient on the use of the drugs and must provide the patient with a fact sheet that includes the indications and contraindications for the use of these drugs, the appropriate method for using these drugs, the need for medical follow up, and any additional information listed in Minnesota Rules, part 6800.0910, subpart 2, that is required to be provided to a patient during the counseling process.\n(f) A pharmacist is prohibited from delegating the prescribing authority provided under this subdivision to any other person. A pharmacist intern registered under section 151.101 may prepare the prescription, but before the prescription is processed or dispensed, a pharmacist authorized to prescribe under this subdivision must review, approve, and sign the prescription.\n(g) Nothing in this subdivision prohibits a pharmacist from participating in the initiation, management, modification, and discontinuation of drug therapy according to a protocol as authorized in this section and in section 151.01, subdivision 27.",
	"repealed": false
}