{
	"id": "469.1082",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1082",
	"title": "469.1082 COUNTY ECONOMIC DEVELOPMENT AUTHORITY OR HOUSING AND REDEVELOPMENT AUTHORITY WITH ECONOMIC DEVELOPMENT POWERS.",
	"text": "A county may form a county economic development authority or grant a housing and redevelopment authority the powers specified in subdivision 4, clause (2), if it receives a recommendation to do so from a committee formed under subdivision 2. An economic development authority established under this section has all the powers and rights of an authority under sections 469.090 to 469.1081, except the authority granted under section 469.094 if so limited under subdivision 4. This section is in addition to any other authority to create a county economic development authority or service provider.\nNothing in this section shall alter or impair any grant of powers, or any other authority granted to a community development agency, a county housing and redevelopment authority, or any county as provided in section 383D.41; Laws 1974, chapter 473, as amended; or Laws 1980, chapter 482, as amended. Any county that has granted economic development powers to a community development agency or a county housing and redevelopment authority under any of these provisions may not form a county economic development authority or grant a housing and redevelopment authority the powers specified in subdivision 4, clause (2).\nUpon notice to all local government units and development agencies within the county, a county may adopt a resolution to create a committee to recommend options for a county economic development service provider.\nThe committee shall consist of no fewer than 11 and no more than 15 members appointed by the county board. At least one city official, at least one housing and redevelopment official, and at least one township official from the county to be served by the county economic service provider shall be included on the committee. Members may also represent school districts, political subdivisions that currently provide services under sections 469.001 to 469.047 and 469.090 to 469.1081, nonprofit or for-profit housing and economic development organizations, business, and labor organizations located within the county. Political subdivision representatives must be selected by their local governments and must constitute at least 50 percent of the total committee membership. The county may appoint no more than two county commissioners. The committee shall select a chair at its initial meeting.\nThe committee shall issue its report within 90 days of its initial meeting. The committee may request one 60-day extension from the county board. The report must contain the committee's recommendation for the preferred organizational option for a county economic development service provider, including the distance from the boundary of the city that may be controlled by each affected city in subdivision 5. The distance may not exceed two miles from the city boundary. The report must contain written findings on issues considered by the committee including, but not limited to, the following:\n(1) identification of the current level of economic development, housing, and community development programs and services provided by existing agencies, any existing gaps in programs and services, and the capacity and ability of those agencies to expand their activities; and\n(2) the recommended organizational option for providing needed economic development, housing, and community development services in the most efficient, effective manner.\nThe committee may only recommend:\n(1) establishment of a county economic development authority to operate under sections 469.090 to 469.1081, except that the county shall not have the powers of section 469.094 without the consent of an existing county housing and redevelopment authority operating within that county. For the purposes of a county economic development authority's operation, the county is considered to be the city and the county board is considered to be the city council;\n(2) requiring an existing county housing and redevelopment authority or multicounty housing and redevelopment authority to operate under sections 469.090 to 469.1081;\n(3) that the county pursue special legislation; or\n(4) no change in the existing structure.\nThe area of operation of a county economic development service provider created under this section shall include all cities and townships within a county that have adopted resolutions electing to participate. A city or township may adopt a resolution electing to withdraw participation. The withdrawal election may be made every fifth year following adoption of the resolution electing participation. The withdrawal election is effective on the anniversary date of the original resolution provided notice is given to the county economic development authority not less than 90 nor more than 180 days prior to that anniversary date. The city or township electing to withdraw retains any rights, obligations, and liabilities it obtained or incurred during its participation. Any city or township within the county shall have the option to adopt a resolution to prohibit the county economic development service provider created under this section from operating within its boundaries and (1) within an agreed-upon urban service area, or (2) within the distance approved in the committee report referenced in subdivision 3. If a city or township prohibits a county economic development service provider created under this section from operating within its boundaries, the city's or township's property taxpayers shall not be subject to the property tax levied for the county economic development service provider.\nIf a county economic development service provider has been established under this section, existing city economic development authorities shall continue to function and operate under sections 469.090 to 469.1081. Additional city economic development authorities may be created within the area of operation of the county economic development service provider created under this section without the explicit concurrence of the county economic development service provider.\nExisting county and multicounty housing and redevelopment authorities shall continue to function and operate under the provisions of sections 469.001 to 469.047.\nIn addition to the board options under section 469.095, a county economic development authority may have a nine-member board. If the authority has a nine-member board, at least two members must be county commissioners appointed by the county board. Of the county economic development authority board members initially appointed, two each shall be appointed for terms of one, two, or three years, respectively, and one each for terms of four, five, or six years, respectively. Thereafter, all authority members shall be appointed for six-year terms.",
	"repealed": false
}