{
	"id": "116J.435",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.435",
	"title": "116J.435 INNOVATIVE BUSINESS DEVELOPMENT PUBLIC INFRASTRUCTURE GRANT PROGRAM.",
	"text": "(a) An innovative business development public infrastructure account is created in the bond proceeds fund. Money in the account may only be used for capital costs of public infrastructure for eligible innovative business development projects.\n(b) An innovative business development public infrastructure account is created in the general fund. The account consists of funds as provided by law and any other money donated, allotted, transferred, or otherwise provided to the account. Money in the account may only be expended on a project receiving financial assistance as provided under this section.\nFor purposes of this section:\n(1) \"local governmental unit\" means a county, city, town, special district, public higher education institution, or other political subdivision or public corporation;\n(2) \"governing body\" means the council, board of commissioners, board of trustees, board of regents, or other body charged with governing a local governmental unit;\n(3) \"public infrastructure\" means publicly owned physical infrastructure in this state, including, but not limited to, wastewater collection and treatment systems, drinking water systems, storm sewers, utility extensions, telecommunications infrastructure, streets, roads, bridges, parking ramps, facilities that support basic science technology and clinical research, and research infrastructure;\n(4) \"innovative business\" means a business that is engaged in, or is committed to engage in, innovation in Minnesota in one of the following: using proprietary technology to add value to a product, process, or service in a high technology field; researching or developing a proprietary product, process, or service in a high technology field; researching, developing, or producing a new proprietary technology for use in the fields of tourism, forestry, mining, transportation, or green manufacturing;\n(5) \"proprietary technology\" means the technical innovations that are unique and legally owned or licensed by a business and includes, without limitation, those innovations that are patented, patent pending, a subject of trade secrets, or copyrighted; and\n(6) \"eligible project\" means an innovative business development capital improvement project in this state, including: manufacturing; technology; warehousing and distribution; research and development; innovative business incubator; agricultural processing; or industrial, office, or research park development that would be used by an innovative business.\n(a) The commissioner shall make grants to local governmental units to acquire and prepare land on which public infrastructure required to support an eligible project will be located and to construct, furnish, and equip public infrastructure required to support an eligible project. The local governmental unit receiving a grant must provide for the remainder of the public infrastructure costs from other sources.\n(b) The amount of a grant may not exceed 50 percent of the sum of the cost of the public infrastructure project.\n(c) The purpose of the program is to keep or enhance jobs in the area, increase the tax base, or to expand or create new economic development through the growth of new innovative businesses and organizations.\n(a) The commissioner must develop forms and procedures for soliciting and reviewing applications for grants under this section. At a minimum, a local governmental unit must include in its application a resolution certifying that the money required to be supplied by the local governmental unit to complete the public infrastructure project is available and committed. The commissioner must evaluate complete applications for eligible projects using the following criteria:\n(1) the project is an eligible project as defined under subdivision 2;\n(2) the project is expected to result in or will attract substantial public and private capital investment and provide substantial economic benefit to the county or city in which the project would be located;\n(3) the project is not relocating substantially the same operation from another location in the state, unless the commissioner determines the project cannot be reasonably accommodated within the county or city in which the business is currently located, or the business would otherwise relocate to another state; and\n(4) the project is expected to create or retain full-time jobs.\n(b) The determination of whether to make a grant for a site is within the discretion of the commissioner, subject to this section. The commissioner's decisions and application of the criteria are not subject to judicial review, except for abuse of discretion.\nMS 2022 [Repealed, 2024 c 120 art 6 s 3]\nIf a grant is awarded to a local governmental unit and funds are not encumbered for the grant within four years after the award date, the grant must be canceled.\nIf an eligible project supported by public infrastructure funded with a grant awarded under this section is not occupied by an innovative business in accordance with the grant application under subdivision 4 within five years after the date of the last grant payment, the grant recipient must repay the amount of the grant received. The commissioner must deposit all money received under this subdivision into the state treasury and credit it to the debt service account in the state bond fund if the grant was funded with state general obligation bond proceeds or to the general fund if the grant was funded with money from the general fund.",
	"repealed": false
}