{
	"id": "177.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.50",
	"title": "177.50 EARNED SICK AND SAFE TIME ENFORCEMENT.",
	"text": "The definitions in section 181.9445 apply to this section.\nAn action to recover damages under section 181.944 for violation of sections 181.9445 to 181.9448 must be commenced within three years of the violation that caused the injury to the employee.\nThe commissioner may make grants to community organizations for the purpose of outreach to and education for employees regarding their rights under sections 181.9445 to 181.9448. The community-based organizations must be selected based on their experience, capacity, and relationships in high-violation industries. The work under such a grant may include the creation and administration of a statewide worker hotline.\n(a) The commissioner must submit an annual report to the legislature, including to the chairs and ranking minority members of any relevant legislative committee. The report must include but is not limited to:\n(1) a list of all violations of sections 181.9445 to 181.9448, including the employer involved, and the nature of any violations; and\n(2) an analysis of noncompliance with sections 181.9445 to 181.9448, including any patterns by employer, industry, or county.\n(b) A report under this section must not include an employee's name or other identifying information, any health or medical information regarding an employee or an employee's family member, or any information pertaining to domestic abuse, sexual assault, or stalking of an employee or an employee's family member.\nIt is the responsibility of all employers to not enter into any contract or agreement for labor or services where the employer has any actual knowledge or knowledge arising from familiarity with the normal facts and circumstances of the business activity engaged in, or has any additional facts or information that, taken together, would make a reasonably prudent person undertake to inquire whether, taken together, the contractor is not complying or has failed to comply with this section. For purposes of this subdivision, \"actual knowledge\" means information obtained by the employer that the contractor has violated this section within the past two years and has failed to present the employer with credible evidence that such noncompliance has been cured going forward.\nThe commissioner may adopt rules to carry out the purposes of this section and sections 181.9445 to 181.9448.\n(a) If an employer does not provide earned sick and safe time pursuant to section 181.9446, or does not allow the use of earned sick and safe time pursuant to section 181.9447, the employer is liable to all employees who were not provided or not allowed to use earned sick and safe time for an amount equal to all earned sick and safe time that should have been provided or could have been used, plus an additional equal amount as liquidated damages.\n(b) If the employer does not possess records sufficient to determine the earned sick and safe time an employee should have been provided pursuant to paragraph (a), the employer is liable to the employee for an amount equal to 48 hours of earned sick and safe time for each year earned sick and safe time was not provided, plus an additional equal amount as liquidated damages.",
	"repealed": false
}