{
	"id": "60A.0782",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.0782",
	"title": "60A.0782 DEFINITIONS.",
	"text": "For the purpose of sections 60A.078 to 60A.0789, unless the context clearly indicates otherwise, the terms in this section have the meanings given them.\n\"Act\" means sections 60A.078 to 60A.0789.\n\"Business entity\" includes, but is not limited to, a joint venture, partnership, corporation, limited liability company, and business trust.\n\"Commissioner\" means the commissioner of commerce.\n\"Legitimate settlement contracts\" mean settlement contracts that comply with Minnesota law governing viatical settlement contracts and that are not prohibited by section 60A.0785 or otherwise part of or in furtherance of an act, practice, or arrangement that is prohibited by sections 60A.078 to 60A.0789.\n\"Life expectancy evaluation\" means an evaluation conducted by any person other than the insurer or its authorized representatives for the purpose of projecting or estimating how long a particular individual is expected to live.\n\"Person\" means any natural person or legal entity, including, but not limited to, a partnership, limited liability company, association, trust, or corporation.\n\"Policy\" means an individual or group policy, group certificate, contract, or arrangement of life insurance affecting the rights of a resident of this state or bearing a reasonable relation to this state, regardless of whether delivered or issued for delivery in this state.\n\"Policyowner\" means the owner of a policy.\n\"Prospective purchaser\" means any person that may purchase or acquire the policy or a beneficial interest in the policy, but excluding individuals closely related to the insured by blood or law or who have a lawful and substantial interest in the continued life of the insured, or trusts established for the benefit of those individuals, provided those trusts meet the requirements of section 60A.0783, subdivision 2, paragraph (d).\n(a) \"Settlement contract\" means an agreement between a policyowner and another person establishing the terms under which compensation or anything of value will be paid or which compensation or value is less than the expected death benefit of the insurance policy, in return for the owner's assignment, transfer, sale, devise, or bequest of the death benefit or ownership of any portion of the policy. Settlement contract also includes:\n(1) the transfer for compensation or value of ownership or beneficial interest in a trust or other entity that owns such a policy if the trust or other entity was formed or availed of for the principal purpose of acquiring one or more policies, which policy insures the life of an individual who is a resident of this state; and\n(2) a premium finance loan made for a policy by a lender to a policyowner on, before, or after the date of issuance of the policy where:\n(i) the policyowner or the insured receives a guarantee of a future settlement value of the policy; or\n(ii) the policyowner or the insured agrees to sell the policy or any portion of its death benefit on any date following the issuance of the policy.\n(b) Settlement contract does not include:\n(1) a policy loan or accelerated death benefit made by the insurer under the policy's terms;\n(2) loan proceeds that are used solely to pay premiums for the policy and loan-related costs, including, without limitation, interest, arrangement fees, utilization fees and similar fees, closing costs, legal fees and expenses, trustee fees and expenses, and third-party collateral provider fees and expenses, including fees payable to letter of credit issuers;\n(3) a loan made by a bank or other licensed financial institution in which the lender takes an interest in a policy solely to secure repayment of a loan or, if there is a default on the loan and the policy is transferred, the transfer of such a policy by the lender, as long as the default itself is not pursuant to an agreement or understanding with any other person for the purpose of evading regulation under sections 60A.078 to 60A.0789;\n(4) an agreement in which all the parties are closely related to the insured by blood or law or have a lawful substantial economic interest in the continued life, health, and bodily safety of the person insured or are trusts established for the benefit of such parties;\n(5) any designation, consent, or agreement by an insured who is an employee or an employer in connection with the purchase by the employer, or by a trust established by the employer, of life insurance on the life of the employee;\n(6) a bona fide business succession planning arrangement:\n(i) between shareholders in a corporation or between a corporation and one or more of its shareholders or one or more trusts established by its shareholders;\n(ii) between partners in a partnership or between a partnership and one or more of its partners or one or more trusts established by its partner; or\n(iii) between members in a limited liability company or between a limited liability company and one or more of its members or one or more trusts established by its members; or\n(7) an agreement entered into by a service recipient, or a trust established by the service recipient, and a service provider, or a trust established by the service provider, who performs significant services for the service recipient's trade or business.\n\"Stranger-originated life insurance practices\" or \"STOLI practices\" means an act, practice, or arrangement to initiate a life insurance policy for the benefit of a third-party investor who, at the time of policy origination, has no insurable interest in the insured. STOLI practices include, but are not limited to, cases in which life insurance is purchased with resources or guarantees from or through a person or entity, who, at the time of policy inception, could not lawfully initiate the policy themselves, and where, at the time of inception, there is an arrangement or agreement, whether spoken or written, to directly or indirectly transfer the ownership of the policy and/or the policy benefits to a third party. Trusts that are created to give the appearance of insurable interest and are used to initiate policies for investors violate the insurable interest requirements and the prohibition against STOLI practices.",
	"repealed": false
}