{
	"id": "103I.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.301",
	"title": "103I.301 WELL SEALING REQUIREMENTS.",
	"text": "(a) A property owner must have a well or boring sealed if:\n(1) the well or boring is contaminated or may contribute to the spread of contamination;\n(2) the well or boring was attempted to be sealed but was not sealed according to the provisions of this chapter; or\n(3) the well or boring is located, constructed, or maintained in a manner that its continued use or existence endangers groundwater quality or is a safety or health hazard.\n(b) A well or boring that is not in use must be sealed unless the property owner has a maintenance permit for the well.\n(c) The property owner must have a well or boring sealed by a licensed person authorized to seal the well or boring, consistent with provisions of this chapter.\nThe owner of the property where an environmental well is located must have the environmental well sealed when the well is no longer in use. The owner must have a well contractor, limited well/boring sealing contractor, or an environmental well contractor seal the environmental well.\n(a) The owner of the property where a dewatering well is located must have the dewatering well sealed when the dewatering well is no longer in use.\n(b) A well contractor, limited well/boring sealing contractor, or limited dewatering well contractor shall seal the dewatering well.\n(a) The owner of the property where a temporary boring is located must have the temporary boring sealed within 72 hours after the start of construction of the temporary boring.\n(b) The owner must have a well contractor, a limited well/boring sealing contractor, or an environmental well contractor seal the temporary boring.\nWells and borings must be sealed according to rules adopted by the commissioner.\n[Repealed, 1990 c 597 s 73]\nA person may not seal a well or temporary boring until a notification of the proposed sealing is filed as prescribed by the commissioner. A single notification is required for all temporary borings sealed on a single property. Temporary borings less than 25 feet in depth are exempt from the notification requirements in this chapter.",
	"repealed": false
}