{
	"id": "156.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.02",
	"title": "156.02 APPLICANTS FOR LICENSE; QUALIFICATIONS.",
	"text": "Application for a license to practice veterinary medicine in this state shall be made in writing to the Board of Veterinary Medicine upon a form furnished by the board, accompanied by satisfactory evidence that the applicant is at least 18 years of age, is of good moral character, and has one of the following:\n(1) a diploma conferring the degree of doctor of veterinary medicine, or an equivalent degree, from an accredited or approved college of veterinary medicine;\n(2) an ECFVG or PAVE certificate; or\n(3) a certificate from the dean of an accredited or approved college of veterinary medicine stating that the applicant is a student in good standing expecting to be graduated at the completion of the current academic year of the college in which the applicant is enrolled.\nThe application shall contain the information and material required by subdivision 2 and any other information that the board may, in its sound judgment, require. The application shall be filed with the board at least 60 days before the date of the examination. If the board deems it advisable, it may require that such application be verified by the oath of the applicant.\nEvery application shall contain the following information and material:\n(1) the application fee set by the board in the form of a check or money order payable to the board, which fee is not returnable in the event permission to take the examination is denied for good cause;\n(2) a copy of a diploma from an accredited or approved college of veterinary medicine or a certificate from the dean or secretary of an accredited or approved college of veterinary medicine showing the time spent in the school and the date when the applicant was duly and regularly graduated or will duly and regularly graduate or verification of ECFVG or PAVE certification;\n(3) affidavits of at least two veterinarians and three adults who are not related to the applicant setting forth how long a time, when, and under what circumstances they have known the applicant, and any other facts as may be proper to enable the board to determine the qualifications of the applicant; and\n(4) if the applicant has served in the armed forces, a copy of discharge papers.\nThe board may, on an individual basis, permit individuals not qualified for a Minnesota license by reason of graduation from a nonaccredited or approved college of veterinary medicine to take the national examinations in veterinary medicine when necessary as a prerequisite to obtaining the ECFVG certification.",
	"repealed": false
}