{
	"id": "148E.230",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.230",
	"title": "148E.230 CONFIDENTIALITY AND RECORDS.",
	"text": "(a) A social worker must obtain valid, informed consent, appropriate to the circumstances, before providing services to clients. When obtaining informed consent, the social worker must determine whether the client has the capacity to provide informed consent. If the client does not have the capacity to provide consent, the social worker must obtain consent for the services from the client's legal representative. The social worker must not provide services, unless authorized or required by law, if the client or the client's legal representative does not consent to the services.\n(b) If a social worker determines that a client does not have the capacity to provide consent, and the client does not have a legal representative, the social worker:\n(1) must, except as provided in clause (2), secure a legal representative for a client before providing services; or\n(2) may, notwithstanding clause (1), provide services, except when prohibited by other applicable law, that are necessary to ensure the client's safety or to preserve the client's property or financial resources.\n(c) A social worker must use clear and understandable language, including using an interpreter proficient in the client's primary language as necessary, to inform clients of the plan of services, risks related to the plan, limits to services, relevant costs, terms of payment, reasonable alternatives, the client's right to refuse or withdraw consent, and the time frame covered by the consent.\nAt the beginning of a professional relationship and during the professional relationship as necessary and appropriate, a social worker must inform the client of those circumstances under which the social worker may be required to disclose client information specified in subdivision 3, paragraph (a), without the client's consent.\n(a) A social worker must ensure the confidentiality of all client information obtained in the course of the social worker/client relationship and all client information otherwise obtained by the social worker that is relevant to the social worker/client relationship. Except as provided in this section, client information may be disclosed or released only with the client's or the client's legal representative's valid informed consent, appropriate to the circumstances, except when otherwise required by law. A social worker must seek consent to disclose or release client information only when such disclosure or release is necessary to provide social work services.\n(b) A social worker must continue to maintain confidentiality of the client information specified in paragraph (a) upon termination of the professional relationship including upon the death of the client, except as provided under this section or other applicable law.\n(c) A social worker must limit access to the client information specified in paragraph (a) in a social worker's agency to appropriate agency staff whose duties require access.\n(a) Except as provided in subdivision 5, client information specified in subdivision 3, paragraph (a), may be released only with the client's or the client's legal representative's written informed consent. The written informed consent must:\n(1) explain to whom the client's records may be released;\n(2) explain the purpose for the release; and\n(3) state an expiration date for the authorized release of the records.\n(b) A social worker may provide client information specified in subdivision 3, paragraph (a), to a third party for the purpose of payment for services rendered only with the client's written informed consent.\n(c) Except as provided in subdivision 5, a social worker may disclose client information specified in subdivision 3, paragraph (a), only with the client's or the client's legal representative's written informed consent. When it is not practical to obtain written informed consent before providing necessary services, a social worker may disclose or release client information with the client's or the client's legal representative's oral informed consent.\n(d) Unless otherwise authorized by law, a social worker must obtain a client's written informed consent before taking a photograph of the client or making an audio or video recording of the client, or allowing a third party to do the same. The written informed consent must explain:\n(1) the purpose of the photograph or the recording and how the photograph or recording will be used, how it will be stored, and when it will be destroyed; and\n(2) how the client may have access to the photograph or recording.\n(a) A social worker may disclose client information specified in subdivision 3, paragraph (a), without the written consent of the client or the client's legal representative only under the following circumstances or under the circumstances described in paragraph (b):\n(1) when mandated or authorized by federal or state law, including the mandatory reporting requirements under the duty to warn, maltreatment of minors, and vulnerable adult laws specified in section 148E.240, subdivisions 6 to 8;\n(2) when the board issues a subpoena to the social worker; or\n(3) when a court of competent jurisdiction orders release of the client records or information.\n(b) When providing services authorized or required by law to a client who does not have the capacity to provide consent and who does not have a legal representative, a social worker must disclose or release client records or information as necessary to provide services to ensure the client's safety or to preserve the client's property or financial resources.\nWhen releasing client records or information under this section, a social worker must release current, accurate, and complete records or information.",
	"repealed": false
}