{
	"id": "116.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.46",
	"title": "116.46 DEFINITIONS.",
	"text": "As used in sections 116.47 to 116.50, the terms defined in this section have the meanings given them.\n\"Aboveground storage tank\" means any one or a combination of containers, vessels, and enclosures, including structures and appurtenances connected to them, that is used to contain or dispense regulated substances, and that is not an underground storage tank.\n\"Agency\" means the Pollution Control Agency.\n\"Installer\" means a person who places, constructs, or repairs an aboveground or underground tank, or permanently takes an aboveground or underground tank out of service.\n\"Operator\" means a person in control of, or having responsibility for, the daily operation of an underground storage tank.\n\"Owner\" means a person who owns an underground storage tank and a person who owned it immediately before discontinuation of its use.\n\"Person\" has the meaning given it in section 116.06, subdivision 17.\n\"Regulated substance\" means:\n(1) a hazardous material listed in Code of Federal Regulations, title 49, section 172.101; or\n(2) petroleum, including crude oil or a fraction of crude oil that is liquid at a temperature of 60 degrees Fahrenheit and pressure of 14.7 pounds per square inch absolute.\n\"Release\" means a spilling, leaking, emitting, discharging, escaping, leaching, or disposing from an underground storage tank into the environment. Release does not include designed venting consistent with the agency's air quality rules.\n\"Retail location\" means a facility located in the metropolitan area as defined in section 473.121, subdivision 2, where gasoline is offered for sale to the general public for use in automobiles and trucks.\n\"Transport delivery vehicle\" means a liquid fuel cargo tank used to deliver gasoline into underground storage tanks.\n\"Underground storage tank\" means any one or a combination of containers including tanks, vessels, enclosures, or structures and underground appurtenances connected to them, that is used to contain or dispense an accumulation of regulated substances and the volume of which, including the volume of the underground pipes connected to them, is ten percent or more beneath the surface of the ground.\n[Renumbered subd 1a]\n\"Vapor recovery system\" means a system which transfers vapors from underground storage tanks during the filling operation to the storage compartment of the transport vehicle delivering gasoline.",
	"repealed": false
}