{
	"id": "458A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.06",
	"title": "458A.06 SPECIAL PROVISIONS.",
	"text": "The commission may exercise the power of eminent domain as provided by chapter 117 for the purpose of acquiring any land, waters, easements, or other rights or interests therein which it is herein authorized to acquire by condemnation. The fact that any such property is owned by or is in charge of a public agency or a public service corporation organized for a purpose specified in section 301B.01, or is already devoted to a public use or to use by such a corporation or was acquired therefor by condemnation shall not prevent its acquisition by the commission by condemnation; provided, that in the case of such property in actual public use or in actual use by such a corporation for any purpose of interest or benefit to the public, the taking thereof by the commission by condemnation shall not be authorized unless the court shall find and determine that there is greater public necessity for the proposed use by the commission than for the existing use thereof. Except in case of property in actual public use or in actual use by such a public service corporation for a purpose of interest or benefit to the public, the commission may take possession of any property for which condemnation proceedings have been commenced at any time after the filing of the petition describing the property in the proceedings.\nAny state department or other agency of the state government or any county, municipality, or other public agency may sell, lease, grant, transfer, or convey to the commission, with or without consideration, any facilities or any part or parts thereof or any real or personal property or interest therein which may be useful to the commission for any authorized purpose. In any case where the construction of any such facilities has not been completed, the public agency concerned may also transfer, sell, assign, and set over to the commission, with or without consideration, any existing contract for the construction of the facilities.\nNotwithstanding the provisions of any law or municipal charter or ordinance to the contrary, the commission, on its own motion or on petition of any operator, municipality, or other public agency, may investigate the need for changes in existing routes, schedules, and stops in effect in any public transit system now or hereafter operating in the transit area. In conducting such investigation, the commission shall consider recommendations as to the subject matter made by any affected municipality or other public agency, and shall give due consideration to street surfaces, traffic conditions, cost of operations, and the planning programs of such municipalities or agencies. In connection with any such investigation, the commission may hold hearings on any matter under consideration, affording all parties concerned an opportunity to appear and be heard thereat. If upon any such investigation or hearing the commission finds that there is no need for any change in existing conditions or operations, it shall make an order so determining and discontinuing the investigation. If the commission finds that there is need for any such change, it shall proceed as provided in subdivision 4.\nIf the transit commission, upon investigation or hearing as provided in subdivision 3, finds that any change in routes, schedules, or stops will be in the public interest, the commission shall file a petition for the proposed change or changes with the secretary of the Public Utilities Commission and serve copies of it on the affected operator and the clerk, secretary, or other recording officer of each municipality and other public agency affected. Upon receiving the petition, the Public Utilities Commission shall set a hearing on it at the earliest convenient date. If any operator, municipality, or other public agency affected is opposed to the petition, it may, within 30 days after the filing and service of the petition, file with the secretary of the Public Utilities Commission an answer stating the grounds of opposition and serve a copy of it on the secretary of the transit commission. If no answers are filed and served within the 30-day period, the Public Utilities Commission shall, upon finding that the change proposed in the petition is in the public interest, order the change. If any answer opposing the petition is received by the Public Utilities Commission within the 30-day period, it shall hold a hearing and make a determination in the matter as provided by applicable laws and rules. An appeal from the action of the Public Utilities Commission in the matter may be taken in accordance with chapter 14.\nThe transit commission may petition the commissioner of transportation for changes in rates of operators of public transit systems serving the transit area. Upon receipt of such petition, the commissioner shall order a hearing and conduct further proceedings as provided by applicable laws and rules. The transit commission may appear in behalf of the public interest in any such proceedings or in any other proceeding before the Department of Transportation, federal agencies, the courts, or other public authorities involving any matter relating to public transit within or affecting the transit area.\nThere shall be transferred to and vested in the transit commission all of the powers and functions of the Minnesota Public Utilities Commission with respect to any public transit system or part thereof which shall have been acquired or constructed by and is owned and operated by or under the authority of the transit commission. Whenever and so long as such public transit system or systems in the aggregate serve in excess of 50 percent of the persons using public transit systems in the area as determined by the Public Utilities Commission, all of the powers and functions of the Public Utilities Commission over all public transit systems in the area shall be transferred to and vested in the transit commission. With respect to a public transit system or any part thereof over which the transit commission shall exercise the powers and functions of the Public Utilities Commission as hereinbefore provided the exercise of such powers and functions by the transit commission shall be exclusive and the Public Utilities Commission shall not have authority to exercise such powers and functions with respect thereto. An appeal from any order or decision of the transit commission may be taken by any party aggrieved thereby in like manner and with like effect as provided by law for appeals in corresponding cases from the orders or decisions of the Public Utilities Commission.\nThe commission may plan for and assist in the relocation of individuals, families, business concerns, nonprofit organizations, and others displaced by operations of the commission, and may make relocation payments in connection therewith in accordance with federal regulations.\nThe commission may provide for self insurance or may otherwise provide for the insurance of any of its property, rights, or revenue, workers' compensation, public liability, or any other risk or hazard arising from its activities, and may provide for insuring any of its officers or employees against any such risk or hazard at the expense of the commission.\nThe commission may enter in a reasonable manner upon any lands, waters, or premises for the purpose of making any reasonably necessary or proper surveys, soundings, drillings, and examinations. No such entry shall be deemed a trespass, except that the commission shall be liable for any actual and consequential loss, injury, or damage therefrom.\nThe commission or its authorized agents may require the production of accounts, books, records, memoranda, correspondence, and other documents and papers of any operator relating to its public transit operations in the transit area, may inspect and copy any thereof at the operator's place of business, and shall have access to and may inspect any of the lands, buildings, facilities, or equipment of any such operator used for such operations.\nThe commission shall employ a certified public accountant or firm thereof to make an annual audit of the commission's financial accounts and affairs, and copies of the report thereof shall be filed and kept open to public inspection in the offices of the secretary of the commission, the secretary of state, the county auditors of all counties and the clerks, secretaries, or other recording officers of all municipalities in the transit area.",
	"repealed": false
}