{
	"id": "148E.080",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.080",
	"title": "148E.080 REACTIVATIONS.",
	"text": "MS 2018 [Repealed by amendment, 2020 c 79 art 3 s 40]\nTo restore a license from temporary leave license status to active status, a licensee must do the following within the time period specified in section 148E.0751, subdivision 2:\n(1) submit a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified. An application that the applicant has not completed and signed is void. The board must return the application and any fee to the applicant;\n(2) document compliance with the continuing education requirements specified in subdivision 4; and\n(3) pay the reactivation fee specified in section 148E.180.\nTo restore a license from emeritus inactive license status to active status, a licensee must do the following within the time period specified in section 148E.0752, subdivision 2:\n(1) submit a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified. An application that the applicant has not completed and signed is void. The board must return the application and any fee to the applicant;\n(2) document compliance with the continuing education requirements specified in subdivision 4; and\n(3) pay the reactivation fee specified in section 148E.180.\nTo restore an expired license to active status, a licensee must do the following within one year of the expiration date:\n(1) submit a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified. An application that the applicant has not completed and signed is void. The board must return the application and any fee to the applicant;\n(2) document compliance with the continuing education requirements that were in effect at the time that the license expired; and\n(3) pay the reactivation fee specified in section 148E.180.\n(a) At the time of reactivation, a licensee who is on temporary leave license status or who is on emeritus inactive license status must document compliance with the following continuing education requirements:\n(1) obtain at least two continuing education hours in social work ethics; and\n(2) complete the board's jurisprudence exam.\n(b) A licensee applying for reactivation according to this section may apply for an extension to the continuing education requirements according to section 148E.130, subdivision 10.\nTo restore a voluntarily terminated license to active status, a licensee must do the following within one year of the date that the voluntary termination takes effect:\n(1) submit a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified. An application that the applicant has not completed and signed is void. The board must return the application and any fee to the applicant;\n(2) document compliance with the continuing education requirements that were in effect at the time that the license was voluntarily terminated; and\n(3) pay the reactivation fee specified in section 148E.180.\nTo restore a license from emeritus active license status to active status, a licensee must do the following while the license remains in emeritus active license status:\n(1) submit a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified. An application that is not completed and signed is void. The board must return the application and any fee to the applicant; and\n(2) pay the reactivation fee specified in section 148E.180.",
	"repealed": false
}