{
	"id": "116J.554",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.554",
	"title": "116J.554 GRANTS.",
	"text": "(a) The commissioner may make a grant to an applicant development authority to pay for up to 75 percent of the project costs for a qualifying site.\n(b) The commissioner may also make a grant to an applicant development authority to pay up to 75 percent or $50,000, whichever is less, toward the cost of performing contaminant investigations and the development of a response action plan for a qualifying site.\n(c) The commissioner may also make a grant to an applicant to fill a site that would represent more than 50 percent of the remaining land in a city suitable for industrial development if it were properly filled.\n(d) The determination of whether to make a grant for a qualifying site is within the sole discretion of the commissioner, subject to the process provided by this section, and available unencumbered money in the appropriation. The commissioner's decisions and application of the priorities under section 116J.555 are not subject to judicial review, except for abuse of discretion.\n(e) The total amount of money provided in grants under paragraph (b) may not exceed $500,000 per fiscal year.\n(f) In making grants under paragraph (b), the commissioner shall give priority to applicants that have not received a grant under paragraph (a) or section 473.252 during the year ending on the date of application.\nThe commissioner may not make a grant to a municipality in the metropolitan area unless it is participating in the local housing incentives program under section 473.254.\nA site qualifies for a grant under this section, if the following criteria are met:\n(1) the site is not scheduled for funding during the current or next fiscal year under the Comprehensive Environmental Response, Compensation, and Liability Act, United States Code, title 42, section 9601, et seq. or under the Environmental Response, and Liability Act under sections 115B.01 to 115B.20;\n(2) if the proposed cleanup is completed, it is expected that the site will be improved with buildings or other improvements and these improvements will provide a substantial increase in the property tax base within a reasonable period of time or the site will be used for an important publicly owned or tax-exempt facility.",
	"repealed": false
}