{
	"id": "299A.475",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.475",
	"title": "299A.475 POSTTRAUMATIC STRESS SYNDROME BENEFIT.",
	"text": "(a) A law enforcement agency shall provide benefits to any peace officer, as defined in section 626.84, subdivision 1, paragraph (c), employed by the agency who:\n(1) suffers a debilitating psychological reaction to a traumatic event;\n(2) is diagnosed by a psychiatrist or a licensed psychologist as suffering from posttraumatic stress syndrome; and\n(3) is determined by a psychiatrist or a licensed psychologist to be unable to perform other peace officer job duties offered by the employer through reassignment.\nA peace officer who meets all of the conditions of this paragraph is entitled to the benefits described in paragraph (b). A peace officer who meets the conditions in clauses (1) and (2) is entitled to the benefits in paragraph (b), clause (2). The availability of benefits does not depend on whether there is also an accompanying physical injury or physical cause of the condition.\n(b) The benefits provided by the law enforcement agency shall include:\n(1) payment by the employer for unreimbursed loss of wages during the time period the officer is disabled, but not to exceed one year; and\n(2) payment by the employer for unreimbursed expenses for medical treatment, including psychiatric or psychological counseling, to cure and relieve the effects of the posttraumatic stress syndrome during the time period the officer is disabled, but not to exceed one year.\n(c) The employer may request a peace officer to undergo an examination by a psychiatrist or licensed psychologist selected by the employer.\n(d) As used in this section, \"traumatic event\" means an event involving the employee lawfully taking the life of or causing great bodily harm, as defined in section 609.02, subdivision 8, to another by force or violence. \"Debilitating psychological reaction\" means that, following the traumatic event, the peace officer is unable to perform the essential functions of the peace officer's job without reassignment.",
	"repealed": false
}