{
	"id": "524.1-201",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.1-201",
	"title": "524.1-201 GENERAL DEFINITIONS.",
	"text": "Subject to additional definitions contained in the subsequent articles which are applicable to specific articles or parts, and unless the context otherwise requires, in chapters 524 and 525:\n(1) \"Adoptee\" means an individual who is adopted.\n(2) \"Application\" means a written request to the registrar for an order of informal probate or appointment under article III, part 3.\n(3) \"Assisted reproduction\" means a method of causing pregnancy other than sexual intercourse.\n(4) \"Beneficiary,\" as it relates to trust beneficiaries, includes a person who has any present or future interest, vested or contingent, and also includes the owner of an interest by assignment or other transfer and as it relates to a charitable trust, includes any person entitled to enforce the trust.\n(5) \"Birth mother\" means a woman who gives birth to a child, including a woman who is the child's genetic mother and including a woman who gives birth to a child of assisted reproduction. \"Birth mother\" does not include a woman who gives birth pursuant to a gestational agreement.\n(6) \"Child\" includes any individual entitled to take as a child under law by intestate succession from the parent whose relationship is involved and excludes any person who is only a stepchild, a foster child, a grandchild or any more remote descendant.\n(7) \"Child of assisted reproduction\" means a child conceived by means of assisted reproduction by a woman other than a child conceived pursuant to a gestational agreement.\n(8) \"Claims\" includes liabilities of the decedent whether arising in contract or otherwise and liabilities of the estate which arise after the death of the decedent including funeral expenses and expenses of administration. The term does not include taxes, demands or disputes regarding title of a decedent to specific assets alleged to be included in the estate, tort claims, foreclosure of mechanic's liens, or to actions pursuant to section 573.02.\n(9) \"Court\" means the court or branch having jurisdiction in matters relating to the affairs of decedents. This court in this state is known as the district court.\n(10) \"Conservator\" means a person who is appointed by a court to manage the estate of a protected person.\n(11) \"Descendant\" of an individual means all of the individual's descendants of all generations, with the relationship of parent and child at each generation being determined by the definition of child and parent contained in this section.\n(12) \"Devise,\" when used as a noun, means a testamentary disposition of real or personal property and when used as a verb, means to dispose of real or personal property by will.\n(13) \"Devisee\" means any person designated in a will to receive a devise. In the case of a devise to an existing trust or trustee, or to a trustee on trust described by will, the trust or trustee is the devisee and the beneficiaries are not devisees.\n(14) \"Disability\" means cause for appointment of a conservator as described in section 524.5-401, or a protective order as described in section 524.5-412.\n(15) \"Distributee\" means any person who has received or who will receive property of a decedent from the decedent's personal representative other than as a creditor or purchaser. A testamentary trustee is a distributee with respect to property which the trustee has received from a personal representative only to the extent of distributed assets or their increment remaining in the trustee's hands. A beneficiary of a testamentary trust to whom the trustee has distributed property received from a personal representative is a distributee of the personal representative. For purposes of this provision, \"testamentary trustee\" includes a trustee to whom assets are transferred by will, to the extent of the devised assets.\n(16) \"Divorce\" includes an annulment, dissolution, and declaration of invalidity of marriage.\n(17) \"Electronic will\" means a will or codicil that (i) is created, signed, or maintained in an electronic, digital, magnetic, wireless, optical, electromagnetic, or other similar medium, (ii) is retrievable in perceivable form, and (iii) is capable of verification that the writing of the electronic will has not been altered after its signing.\n(18) \"Estate\" includes all of the property of the decedent, trust, or other person whose affairs are subject to this chapter as originally constituted and as it exists from time to time during administration.\n(19) \"Fiduciary\" includes personal representative, guardian, conservator and trustee.\n(20) \"Foreign personal representative\" means a personal representative of another jurisdiction.\n(21) \"Formal proceedings\" means those conducted before a judge with notice to interested persons.\n(22) \"Functioned as a parent of the child\" means behaving toward a child in a manner consistent with being the child's parent and performing functions that are customarily performed by a parent, including fulfilling parental responsibilities toward the child, recognizing or holding out the child as the individual's child, materially participating in the child's upbringing, and residing with the child in the same household as a regular member of that household.\n(23) \"Genetic father\" means the man whose sperm fertilized the egg of a child's genetic mother. If the father-child relationship is established under the presumption of paternity under chapter 257, \"genetic father\" means only the man for whom that relationship is established.\n(24) \"Genetic mother\" means the woman whose egg was fertilized by the sperm of a child's genetic father.\n(25) \"Genetic parent\" means a child's genetic father or genetic mother.\n(26) \"Gestational agreement\" means an agreement for assisted reproduction in which a woman agrees to carry a child to birth for an intended parent or intended parents.\n(27) \"Governing instrument\" means a deed; will; trust; insurance or annuity policy; account with POD designation; security registered in beneficiary form (TOD); transfer on death (TOD) deed; pension, profit-sharing, retirement, or similar benefit plan; instrument creating or exercising a power of appointment or a power of attorney; or a dispositive, appointive, or nominative instrument of any similar type.\n(28) \"Guardian\" means a person who has qualified as a guardian of a minor or incapacitated person pursuant to testamentary or court appointment, but excludes one who is merely a guardian ad litem.\n(29) \"Heirs\" means those persons, including the surviving spouse, who are entitled under the statutes of intestate succession to the property of a decedent.\n(30) \"Incapacitated person\" is as described in section 524.5-102, subdivision 6, other than a minor.\n(31) \"Incapacity\" when used in sections 524.2-114 to 524.2-120 means the inability of an individual to function as a parent of a child because of the individual's physical or mental condition.\n(32) \"Informal proceedings\" means those conducted by the judge, the registrar, or the person or persons designated by the judge for probate of a will or appointment of a personal representative in accordance with sections 524.3-301 to 524.3-311.\n(33) \"Intended parent\" means an individual who entered into a gestational agreement providing that the individual will be the parent of a child born to a woman by means of assisted reproduction, including an individual who has a genetic relationship with the child.\n(34) \"Interested person\" includes heirs, devisees, children, spouses, creditors, beneficiaries and any others having a property right in or claim against the estate of a decedent, ward or protected person which may be affected by the proceeding. It also includes persons having priority for appointment as personal representative, and other fiduciaries representing interested persons. The meaning as it relates to particular persons may vary from time to time and must be determined according to the particular purposes of, and matter involved in, any proceeding.\n(35) \"Lease\" includes an oil, gas, or other mineral lease.\n(36) \"Letters\" includes letters testamentary, letters of guardianship, letters of administration, and letters of conservatorship.\n(37) \"Mortgage\" means any conveyance, agreement or arrangement in which property is used as security.\n(38) \"Nonresident decedent\" means a decedent who was domiciled in another jurisdiction at the time of death.\n(39) \"Organization\" includes a corporation, government or governmental subdivision or agency, business trust, estate, trust, partnership or association, two or more persons having a joint or common interest, or any other legal entity.\n(40) \"Person\" means an individual, a corporation, an organization, or other legal entity.\n(41) \"Personal representative\" includes executor, administrator, successor personal representative, special administrator, and persons who perform substantially the same function under the law governing their status. \"General personal representative\" excludes special administrator.\n(42) \"Petition\" means a written request to the court for an order after notice.\n(43) \"Presence\" or \"conscious presence\" for purposes of sections 524.2-501 to 524.2-517 means either:\n(i) an individual being in a physical location in relation to the testator that allows the individual to see and hear the testator; or\n(ii) an individual being in a state and communicating simultaneously with the testator by means of an electronic device or process by sight and sound to substantially the same extent as if the individual were in a physical location in relation to the testator that would allow an individual to see and hear the testator, allowing for reasonable accommodation for individuals with hearing, vision, or speech impairments as necessary.\n(44) \"Proceeding\" includes action at law and suit in equity.\n(45) \"Property\" includes both real and personal property or any interest therein and means anything that may be the subject of ownership.\n(46) \"Protected person\" is as described in section 524.5-102, subdivision 14.\n(47) \"Registrar\" refers to the judge of the court or the person designated by the court to perform the functions of registrar as provided in section 524.1-307.\n(48) \"Relative\" means a grandparent or a descendant of a grandparent.\n(49) \"Security\" includes any note, stock, treasury stock, bond, debenture, evidence of indebtedness, certificate of interest or participation in an oil, gas or mining title or lease or in payments out of production under such a title or lease, collateral trust certificate, transferable share, voting trust certificate or, in general, any interest or instrument commonly known as a security, or any certificate of interest or participation, any temporary or interim certificate, receipt or certificate of deposit for, or any warrant or right to subscribe to or purchase, any of the foregoing.\n(50) \"Settlement,\" in reference to a decedent's estate, includes the full process of administration, distribution and closing.\n(51) \"Signed\" or \"signing\" for testators and witnesses for purposes of sections 524.2-501 to 524.2-517 means either:\n(i) the physical act of applying a signature or mark on the tangible medium upon which a writing is located; or\n(ii) to affix to or to logically associate with a writing an electronic symbol, signature, mark, or process with the intent to execute, witness, or authenticate the writing.\n(52) \"Special administrator\" means a personal representative as described by sections 524.3-614 to 524.3-618.\n(53) \"State\" includes any state of the United States, the District of Columbia, the Commonwealth of Puerto Rico, and any territory or possession subject to the legislative authority of the United States.\n(54) \"Successor personal representative\" means a personal representative, other than a special administrator, who is appointed to succeed a previously appointed personal representative.\n(55) \"Successors\" means those persons, other than creditors, who are entitled to property of a decedent under the decedent's will, this chapter or chapter 525. \"Successors\" also means a funeral director or county government that provides the funeral and burial of the decedent, or a state or county agency with a claim authorized under section 256B.15.\n(56) \"Supervised administration\" refers to the proceedings described in sections 524.3-501 to 524.3-505.\n(57) \"Testacy proceeding\" means a proceeding to establish a will or determine intestacy.\n(58) \"Third-party donor\" means an individual who produces eggs or sperm used for assisted reproduction, whether or not for consideration. The term does not include:\n(i) a spouse who provides sperm, or a spouse who provides eggs, that are used for assisted reproduction by the spouse;\n(ii) the birth mother of a child of assisted reproduction; or\n(iii) a man who has been determined under section 524.2-120, subdivision 4 or 5, to have a parent-child relationship with a child of assisted reproduction.\n(59) \"Trust\" includes any express trust, private or charitable, with additions thereto, wherever and however created. It also includes a trust created or determined by judgment or decree under which the trust is to be administered in the manner of an express trust. \"Trust\" excludes other constructive trusts, and it excludes resulting trusts, conservatorships, personal representatives, trust accounts as defined in chapter 528, custodial arrangements pursuant to sections 149A.97, 318.01 to 318.06, 527.21 to 527.44, business trusts providing for certificates to be issued to beneficiaries, common trust funds, voting trusts, security arrangements, liquidation trusts, and trusts for the primary purpose of paying debts, dividends, interest, salaries, wages, profits, pensions, or employee benefits of any kind, and any arrangement under which a person is nominee or escrowee for another.\n(60) \"Trustee\" includes an original, additional, or successor trustee, whether or not appointed or confirmed by court.\n(61) \"Ward\" is as described in section 524.5-102, subdivision 17.\n(62) \"Will\" includes an electronic will, any codicil to a will or electronic will, and any testamentary instrument which merely appoints an executor or revokes or revises another will, electronic will, or codicil.\n(63) \"Witnessing\" for purposes of sections 524.2-501 to 524.2-517 means observing or authenticating the testator's signing or acknowledgment of signing a will by individuals in the presence of the testator at the time of the testator's signing or acknowledgment of signing the will.\n(64) \"Writing,\" \"written instrument,\" or \"written statement,\" for purposes of sections 524.1-201 and 524.2-501 to 524.2-517, means any reasonably permanent record that is readable as text at the time of signing and is retrievable in perceivable form, including any information that is: (i) inscribed on a tangible medium; or (ii) stored in an electronic, digital, magnetic, wireless, optical, electromagnetic, or other similar medium.",
	"repealed": false
}