{
	"id": "123B.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.90",
	"title": "123B.90 SCHOOL BUS SAFETY TRAINING.",
	"text": "[Repealed, 1Sp2003 c 9 art 10 s 14]\n(a) Each district must provide public school pupils enrolled in kindergarten through grade 10 with age-appropriate school bus safety training, as described in this section, of the following concepts:\n(1) transportation by school bus is a privilege and not a right;\n(2) district policies for student conduct and school bus safety;\n(3) appropriate conduct while on the school bus;\n(4) the danger zones surrounding a school bus;\n(5) procedures for safely boarding and leaving a school bus;\n(6) procedures for safe street or road crossing; and\n(7) school bus evacuation.\n(b) Each nonpublic school located within the district must provide all nonpublic school pupils enrolled in kindergarten through grade 10 who are transported by school bus at public expense and attend school within the district's boundaries with training as required in paragraph (a).\n(c) Students enrolled in kindergarten through grade 6 who are transported by school bus and are enrolled during the first or second week of school must receive the school bus safety training competencies by the end of the third week of school. Students enrolled in grades 7 through 10 who are transported by school bus and are enrolled during the first or second week of school and have not previously received school bus safety training must receive the training or receive bus safety instructional materials by the end of the sixth week of school. Students taking driver's training instructional classes must receive training in the laws and proper procedures when operating a motor vehicle in the vicinity of a school bus as required by section 169.446, subdivisions 2 and 3. Students enrolled in kindergarten through grade 10 who enroll in a school after the second week of school and are transported by school bus and have not received training in their previous school district shall undergo school bus safety training or receive bus safety instructional materials within four weeks of the first day of attendance. Upon request of the superintendent of schools, the school transportation safety director in each district must certify to the superintendent that all students transported by school bus within the district have received the school bus safety training according to this section. Upon request of the superintendent of the school district where the nonpublic school is located, the principal or other chief administrator of each nonpublic school must certify to the school transportation safety director of the district in which the school is located that the school's students transported by school bus at public expense have received training according to this section.\n(d) A district and a nonpublic school with students transported by school bus at public expense may provide kindergarten pupils with bus safety training before the first day of school.\n(e) A district and a nonpublic school with students transported by school bus at public expense must make reasonable accommodations for the school bus safety training of pupils known to speak English as a second language and pupils with disabilities.\n(f) The district and a nonpublic school with students transported by school bus at public expense must provide students enrolled in kindergarten through grade 3 school bus safety training twice during the school year.\n(g) A district and a nonpublic school with students transported by school bus at public expense must conduct a school bus evacuation drill at least once during the school year.\nThe commissioner shall develop and maintain a comprehensive list of school bus safety training instructional materials for pupils who ride the bus that includes bus safety curriculum for both classroom and practical instruction.",
	"repealed": false
}