{
	"id": "149A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.01",
	"title": "149A.01 PURPOSE AND SCOPE.",
	"text": "This chapter regulates the removal, preparation, transportation, arrangements for disposition, and final disposition of dead human bodies for purposes of public health and protection of the public.\nIn Minnesota no person shall, without being licensed by the commissioner of health:\n(1) take charge of or remove from the place of death a dead human body;\n(2) prepare a dead human body for final disposition, in any manner; or\n(3) arrange, direct, or supervise a funeral, memorial service, or graveside service.\n(a) Except as otherwise provided in this chapter, nothing in this chapter shall in any way interfere with the duties of:\n(1) an anatomical bequest program located within an accredited school of medicine or an accredited college of mortuary science;\n(2) a person engaged in the performance of duties prescribed by law relating to the conditions under which unclaimed dead human bodies are held subject to anatomical study;\n(3) authorized personnel from a licensed ambulance service in the performance of their duties;\n(4) licensed medical personnel in the performance of their duties; or\n(5) the coroner or medical examiner in the performance of the duties of their offices.\n(b) This chapter does not apply to or interfere with the recognized customs or rites of any culture or recognized religion in the ceremonial washing, dressing, casketing, and public transportation of their dead, to the extent that all other provisions of this chapter are complied with.\n(c) Noncompensated persons with the right to control the dead human body, under section 149A.80, subdivision 2, may remove a body from the place of death; transport the body; prepare the body for disposition, except embalming; or arrange for final disposition of the body, provided that all actions are in compliance with this chapter.\n(d) Persons serving internships pursuant to section 149A.20, subdivision 6; students officially registered for a practicum or clinical through a program of mortuary science accredited by the American Board of Funeral Service Education; or transfer care specialists registered pursuant to section 149A.47 are not required to be licensed, provided that the persons, students, or transfer care specialists are registered with the commissioner and act under the direct and exclusive supervision of a person holding a current license to practice mortuary science in Minnesota.\n(e) Notwithstanding this subdivision, nothing in this section shall be construed to prohibit an institution or entity from establishing, implementing, or enforcing a policy that permits only persons licensed by the commissioner to remove or cause to be removed a dead body or body part from the institution or entity.\n(f) An unlicensed person may arrange for and direct or supervise a memorial service if that person or that person's employer does not have charge of the dead human body. An unlicensed person may not take charge of the dead human body, unless that person has the right to control the dead human body under section 149A.80, subdivision 2, or is that person's noncompensated designee.\n(a) Nothing in this chapter shall be construed to limit the powers granted to the commissioner of health, commissioner of commerce, state attorney general, or a county attorney in any other statute, law, or rule, except as described in paragraph (b).\n(b) A county, within its jurisdiction as a coroner or medical examiner, may establish transportation standards for transporting a dead human body from the death scene to the place where an autopsy is to be conducted, so long as the standards do not specifically require that the transporter be a licensed funeral director.",
	"repealed": false
}