{
	"id": "3.988",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.988",
	"title": "3.988 EXCEPTIONS TO LOCAL IMPACT NOTES.",
	"text": "A local impact note need not be prepared for increases in the cost of providing an existing service if the increases result directly from inflation. \"Resulting directly from inflation\" means attributable to maintaining an existing level of service rather than increasing the level of service. A cost-of-living increase in welfare benefits is an example of a cost resulting directly from inflation.\nA local impact note need not be prepared for increased local costs that do not result from a new program or an increased level of service.\nA local impact note or an attachment as provided in section 3.987, subdivision 2, need not be prepared for the cost of a mandated action if the law containing the mandate:\n(1) accommodates a specific local request;\n(2) results in no new local government duties;\n(3) leads to revenue losses from exemptions to taxes;\n(4) provided only clarifying or conforming, nonsubstantive charges on local government;\n(5) imposes additional net local costs that are minor (an amount less than or equal to one-half of one percent of the local revenue base as defined in section 477A.011, subdivision 27, or $50,000, whichever is less for any single local government if the mandate does not apply statewide or less than $1,000,000 if the mandate is statewide);\n(6) is a law or executive order enacted before July 1, 1997, or a rule initially implementing a law enacted before July 1, 1997;\n(7) implements something other than a law or executive order, such as a federal, court, or voter-approved mandate;\n(8) results in savings that equal or exceed costs;\n(9) requires the holding of elections;\n(10) ensures due process or equal protection;\n(11) provides for the notification and conduct of public meetings;\n(12) establishes the procedures for administrative and judicial review of actions taken by political subdivisions;\n(13) protects the public from malfeasance, misfeasance, or nonfeasance by officials of political subdivisions;\n(14) relates directly to financial administration, including the levy, assessment, and collection of taxes;\n(15) relates directly to the preparation and submission of financial audits necessary to the administration of state laws; or\n(16) requires uniform standards to apply to public and private institutions without differentiation.",
	"repealed": false
}