{
	"id": "169.448",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.448",
	"title": "169.448 OTHER BUSES.",
	"text": "(a) A bus that is not used as a school bus must not be operated on a street or highway unless it is painted a color significantly different than national school bus glossy yellow.\n(b) A bus that is not used as a school bus or Head Start bus may not be operated if it is equipped with school bus or Head Start bus-related equipment and printing.\n(c) A violation of this subdivision is a misdemeanor.\n(d) This subdivision does not apply to a school bus owned by or under contract to a school district operated as a charter or leased bus.\n(e) This subdivision does not apply to a school bus operated by a licensed child care provider if:\n(1) the stop-signal arm is removed;\n(2) the lighting systems for prewarning flashing amber signals, flashing red signals, and supplemental warnings under section 169.4503, subdivision 31, are deactivated;\n(3) the school bus is identified as a \"child care bus\" in letters at least eight inches high on the front and rear top of the bus;\n(4) the name, address, and telephone number of the owner or operator of the bus is identified on each front door of the bus in letters not less than three inches high; and\n(5) the conditions under section 171.02, subdivision 2a, paragraphs (a) to (j) and (l), have been met.\n(a) A school district may not acquire a motor coach for transportation purposes.\n(b) A motor coach acquired by a school district before March 26, 1986, may be used by it only to transport students participating in school activities, their instructors, and supporting personnel to and from school activities. A motor coach may not be outwardly equipped and identified as a school bus. A motor coach operated under this subdivision is not a school bus for purposes of section 123B.92. The commissioner of education shall implement rules governing the equipment, identification, operation, inspection, and certification of motor coaches operated under this subdivision.\n(c) After January 1, 1998, a school district may not own or operate a motor coach for any purpose.\nNotwithstanding subdivision 1, a vehicle used to transport students under Public Law 99-425, the Head Start Act, may be equipped as a school bus or Head Start bus.\nNotwithstanding subdivision 1, a vehicle used to transport adults to and from a day activity center may be equipped with prewarning flashing amber signals and a stop-signal arm, and the operator of the vehicle may activate this equipment, under the following circumstances:\n(1) the operator possesses a commercial driver's license with a school bus endorsement;\n(2) the vehicle is engaged in picking up or dropping off adults at locations predesignated by the day activity center that owns or leases the bus;\n(3) the vehicle is identified as a \"day activity center bus\" in letters at least eight inches high on the front and rear top of the bus; and\n(4) the name, address, and telephone number of the owner and operator of the bus is identified on each front door of the bus in letters not less than three inches high.\nThe provisions of section 169.444 relating to duties of care of a motorist to a school bus, and violations thereof, apply to a vehicle described in this section when the vehicle is operated in conformity with this subdivision. The provisions of section 169.443 relating to bus driver's duties apply to a vehicle described in this section except those that by their nature have no application.",
	"repealed": false
}