{
	"id": "93.335",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.335",
	"title": "93.335 LANDS HELD IN TRUST; MINERAL RIGHTS ONLY; MINERAL RIGHTS ACQUIRED UNDER TAX LAWS.",
	"text": "Mining leases issued as provided by sections 93.14 to 93.33, except as otherwise specifically provided under this section, shall be subject to all the terms, conditions, and provisions of sections 93.14 to 93.33, regardless of whether or not the lands or minerals and mineral rights are held in trust for taxing districts.\n(a) If the interest in lands or minerals and mineral rights acquired by the state under the tax laws is an undivided part of the whole interest therein, the quarterly and annual rentals and minimum royalty to be bid and paid to the state upon the leasing thereof shall be such proportion of the amounts stipulated in the laws under which such leases are executed as the undivided part owned by the state bears to the whole interest in such lands, or minerals and mineral rights. The specification in any such lease issued in the form provided by such sections that the interest covered thereby is a fractional undivided interest shall be a sufficient statement that the quarterly rentals, annual rentals, and minimum royalties to be paid thereunder shall be such proportion of the amount stated in the lease as the undivided interest covered thereby bears to the whole interest in such lands or minerals and mineral rights.\n(b) If it shall be determined by final judgment or decree that the interest owned by the state in any tract of land covered by any iron ore or taconite iron ore mining lease issued pursuant to this section is less than that described in said lease, such lease, upon application by the lessee to the commissioner of natural resources, shall be amended in such form as the attorney general shall approve to delete the interest not owned by the state as determined by said judgment or decree. The lessee shall be entitled to a credit against royalties which shall thereafter become due pursuant to said lease for all moneys previously paid to the state for such deleted interest.\nIf, because of having sold the surface of such lands, reserving the minerals and mineral rights, or from any other cause, the state owns only the minerals and mineral rights in any lands leased hereunder, the commissioner of natural resources shall confine such lease to such minerals and mineral rights. The amount of the quarterly rentals, annual rentals, and minimum royalties to be bid and paid to the state upon such leases shall not be reduced by reason of that fact, and the lessee shall acquire all such rights to use the surface of such lands as were reserved or are owned by the state under its reservation of minerals and mineral rights. Any specification of rights to the surface in such lease shall be construed as limited by this subdivision.\n[Repealed, 2000 c 495 s 53]\n[Repealed, 2000 c 495 s 53]",
	"repealed": false
}