{
	"id": "475A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/475A.03",
	"title": "475A.03 GUARANTEED BONDS; APPLICATION.",
	"text": "The governing body of any municipality, upon compliance with the terms of sections 475A.01 to 475A.06 and approval of the commissioner of management and budget may, after July 1, 1971 and before May 1, 1984, include in general obligation bonds of the municipality issued for the purpose of providing funds to acquire or to better public lands and buildings and other public improvements of a capital nature, or bonds issued to refund guaranteed bonds, the following statement or such modification thereof consistent with sections 475A.01 to 475A.06 as the secretary shall prescribe:\nThe payment of this bond and the interest thereon is secured by the state municipal bond guaranty fund in accordance with the Minnesota Municipal Debt Service Aid Law.\nThe bonds may also include the designation \"secured by the state municipal bond guaranty fund,\" and the notice of sale of such bonds may include a reference to such guaranty.\nSubject to the provisions of sections 475A.01 to 475A.06, the state, upon application of the appropriate officer of any municipality, shall guarantee general obligation bonds of the municipality issued for the purpose of providing funds for acquisition or betterment of public lands or buildings or other public improvements of a capital nature or for the refunding of guaranteed bonds. The governing body of any municipality seeking a state guaranty of bonds shall by resolution or ordinance undertake to pay the fee required and to comply with the other conditions of sections 475A.01 to 475A.06, and authorize and direct the appropriate officer of the municipality to apply to the commissioner of management and budget on behalf of the municipality for such guaranty. The application shall include a certified copy of the resolution or ordinance, and shall set forth the principal amount of the bonds to be issued, a maturity schedule for the bonds, the dates on which principal and interest are to be paid, and such other information as the commissioner of management and budget shall prescribe.\nUpon receipt of the application the commissioner of management and budget shall estimate the total amount of principal and interest calculated at the probable average rate on the bonds described in the application, together with the total amount of principal and interest to become due on all guaranteed bonds then outstanding, and if the sum of these amounts does not exceed 20 times the sum of (a) the aggregate principal amount of all Minnesota state municipal aid bonds theretofore authorized and not theretofore issued, plus (b) the balance then on hand in the state municipal bond guaranty fund, the commissioner shall approve the application and issue the certificate provided in subdivision 4.\nUpon receipt of the application in the proper form the commissioner of management and budget shall execute and issue to the municipality not less than 14 days thereafter a certificate of guaranty which shall provide that the payment of the bonds and interest shall be secured by the state municipal bond guaranty fund in accordance with the provisions of sections 475A.01 to 475A.06. Such guaranty shall become effective as of the date of payment for and delivery of the guaranteed obligations: provided that counsel subject to whose opinion the bonds are offered for sale, issues as of that date a written opinion, based on examination of a transcript of proceedings taken preliminary to their issuance, that the bonds are validly authorized for the acquisition or betterment of public lands, buildings, or capital improvements, or for the refunding of guaranteed bonds; that they are valid and binding general obligations of the issuer; and that all taxable property within the corporate limits of the municipality is subject to the levy of a direct, general, annual ad valorem tax for the payment of the bonds and interest thereon when due, without limitation as to rate or amount.\nWithin 14 days after the date of payment and delivery of the guaranteed obligations, the municipality shall remit to the commissioner of management and budget a guaranty fee in an amount equal to 2-1/2 percent of the total principal sum of the guaranteed obligations or $1,000, whichever is higher, which fee may be paid out of the proceeds of the guaranteed obligations as an expense incidental to the issuance of such obligations. All guaranty fees shall be credited to the municipal bond guaranty fund created by section 475A.05. Failure of the municipality to remit the guaranty fee required by this subdivision shall not invalidate the municipal bonds or the state's guaranty thereof: if the fee is unpaid the state auditor shall include in the certification under section 475A.04, subdivision 3, an amount equal to three percent of the total principal sum of the guaranteed bonds or $1,500, whichever is higher.\nUpon the occurrence of any deficiency requiring a loan under section 475A.04 the commissioner of management and budget shall make an investigation to ascertain the reasons therefor and to assure that adequate amounts of taxes, special assessments, and other revenues pledged for payment of the bonds have been levied and provided for in accordance with law and the provisions of the resolution or other instrument securing the bonds, and the officers of the municipality shall furnish all information and copies of all documents and records requested by the secretary for this purpose and shall promptly take all action requested and permitted by law to avoid future deficiencies. The commissioner of management and budget may request the state auditor to examine the books, records, accounts, and affairs of the municipality, and the cost of such examination shall be paid by the municipality.",
	"repealed": false
}