{
	"id": "473.388",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.388",
	"title": "473.388 REPLACEMENT SERVICE PROGRAM.",
	"text": "A replacement service program is established to continue the metropolitan transit service demonstration program established in Minnesota Statutes 1982, section 174.265, as provided in this section.\nThe council may provide assistance under the program to a statutory or home rule charter city or town or combination thereof, that:\n(a) is located in the metropolitan transit taxing district;\n(b) is not served by the council bus service or is served only with council bus routes which begin or end within the applying city or town or combination thereof; and\n(c) has fewer than four scheduled runs of council bus service during off-peak hours as defined by the Metropolitan Council.\nEligible cities or towns or combinations thereof may apply on behalf of a transit operator with whom they propose to contract for service.\nThe council may not provide assistance under this section to a statutory or home rule charter city or town unless the city or town,\n(i) was receiving assistance under Minnesota Statutes 1982, section 174.265, by July 1, 1984,\n(ii) had submitted an application for assistance under that section by July 1, 1984, or\n(iii) had submitted a letter of intent to apply for assistance under that section by July 1, 1984, and submits an application for assistance under this section by July 1, 1988. A statutory or home rule charter city or town has an additional 12-month extension if it notified the former regional transit board before July 1, 1988, that the city or town is in the process of completing a transportation evaluation study that includes an assessment of the local transit needs of the city or town.\nAn application for assistance under this section must:\n(a) describe the existing service provided to the applicant by the council, including the estimated number of passengers carried and the routes, schedules, and fares;\n(b) describe the transit service proposed for funding under the demonstration program, including the anticipated number of passengers and the routes, schedules, and fares; and\n(c) indicate the total amount of available local transit funds, the portion of the available local transit funds proposed to be used to subsidize replacement services, and the amount of assistance requested for the replacement services.\n(a) The council must grant financial assistance if (1) the service of the statutory or home rule charter city, town, or combination, replaces the council's service to the statutory or home rule charter city, town, or combination, and (2) the service meets the needs of the recipient at least as efficiently and effectively as the council's service.\n(b) The amount of assistance which the council must provide to a system under this section must not be less than the sum of (1) the amounts calculated under paragraph (c), and (2) the amount calculated under subdivision 4a.\n(c) The financial assistance base allocation for each replacement service municipality is calculated as:\n(1) an amount equal to 3.74 percent of the total state revenues generated from the taxes imposed under chapter 297B for the current fiscal year; times\n(2) the ratio of:\n(i) the transit operating assistance grants received under this subdivision by the municipality in calendar year 2001 or the tax revenues for transit services levied by the municipality for taxes payable in 2001, including that portion of the levy derived from the areawide pool under section 473F.08, subdivision 3, clause (a), plus the portion of the municipality's aid under Minnesota Statutes 2002, section 273.1398, subdivision 2, attributable to the transit levy; to\n(ii) the total transit operating assistance grants received under this subdivision in calendar year 2001 or the tax revenues for transit services levied by all replacement service municipalities under this section for taxes payable in 2001, including that portion of the levy derived from the areawide pool under section 473F.08, subdivision 3, clause (a), plus the portion of homestead and agricultural credit aid under Minnesota Statutes 2002, section 273.1398, subdivision 2, attributable to nondebt transit levies; times\n(3) the ratio of:\n(i) the municipality's total taxable market value for taxes payable in 2006 divided by the municipality's total taxable market value for taxes payable in 2001; to\n(ii) the total taxable market value of all property located in replacement service municipalities for taxes payable in 2006 divided by the total taxable market value of all property located in replacement service municipalities for taxes payable in 2001.\n(d) The council must pay the amount to be provided to the recipient under this subdivision from the funds the council receives in the metropolitan area transit account under section 16A.88.\n(a) In addition to the assistance under subdivision 4, paragraph (c), for fiscal years 2019, 2020, and 2021, the council must annually provide financial assistance through regional allocation to replacement service municipalities. The amount of financial assistance under this paragraph must equal at least 0.35 percent of the total state revenues generated from the taxes imposed under chapter 297B for the current fiscal year.\n(b) The council must establish a process to regionally allocate financial assistance under this subdivision. At a minimum, the council must:\n(1) adopt and implement a regional allocation policy that specifies funding priorities, identifies decision-making procedures, and establishes criteria to determine the amount allocated to a replacement service municipality; and\n(2) ensure transparency and stakeholder input, which must include publishing on the council's website the policy adopted under clause (1), a summary of the regional allocation process, and financial information on the allocations.\n(c) The regional allocation policy may specify eligibility requirements based on a replacement service municipality's transit service operating reserves.\n(d) The council must provide financial assistance under this subdivision using funds appropriated to the council from the metropolitan area transit account in the transit assistance fund.\nA city or town receiving assistance or levying a transit tax under this section may also receive assistance from the council under section 473.384. In applying for assistance under that section an applicant must describe the portion of its available local transit funds or local transit taxes which are not obligated to subsidize its replacement transit service and which the applicant proposes to use to subsidize additional service. An applicant which has exhausted its available local transit funds or local transit taxes may use any other local subsidy funds to complete the required local share.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\n(a) A statutory or home rule charter city or town that is eligible for assistance under this section may levy a tax for payment of obligations issued by the municipality for capital expenditures for transit and other related activities, provided that property taxes were pledged to satisfy the obligations, and provided that legislative appropriations are insufficient to satisfy the obligations.\n(b) This subdivision is consistent with the transit redesign plan. Eligible municipalities opting to operate under this subdivision shall continue to meet the regional performance standards established by the council.\n(c) Within the designated Americans with Disabilities Act area, Metro Mobility remains the obligation of the state.\nMS 2013 Supp [Repealed, 2014 c 271 art 3 s 22]",
	"repealed": false
}