{
	"id": "121A.642",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.642",
	"title": "121A.642 PARAPROFESSIONAL TRAINING.",
	"text": "(a) For purposes of this section, \"school\" means a school district, charter school, intermediate school district, other cooperative unit, Perpich Center for Arts Education, or the Minnesota State Academies.\n(b) A school must provide a minimum of eight hours of paid orientation or professional development annually to all paraprofessionals, Title I aides, and other instructional support staff.\n(c) Six of the eight hours must be completed before the first instructional day of the school year or within 30 days of hire.\n(d) The orientation or professional development must be relevant to the employee's occupation and may include collaboration time with classroom teachers and planning for the school year.\n(e) For paraprofessionals who provide direct support to students, at least 50 percent of the professional development or orientation must be dedicated to meeting the requirements of this section. Professional development for paraprofessionals may also address the requirements of section 120B.363, subdivision 3.\n(f) A school administrator must provide an annual certification of compliance with this requirement to the commissioner.\n(g) For the 2024-2025 school year only, a school may reduce the hours of training required in paragraphs (b) to (e) to a minimum of six hours and must pay for paraprofessional test materials and testing fees for any paraprofessional employed by the school district during the 2023-2024 school year who has not yet successfully completed the paraprofessional assessment or met the requirements of the paraprofessional competency grid.\n(a) Beginning in fiscal year 2025, the commissioner of education must reimburse schools in the form and manner specified by the commissioner for paraprofessional training costs.\n(b) The paraprofessional reimbursement equals the prior year compensation expenses associated with providing up to eight hours of paid orientation and professional development for each paraprofessional trained under subdivision 1. For purposes of this paragraph, \"compensation expenses\" means the sum of the following amounts attributable to the school's paraprofessionals:\n(1) regular hourly wages;\n(2) Federal Insurance Contributions Act (FICA) taxes under United States Code, title 26, chapter 21; and\n(3) the employer share of retirement contributions required under chapter 352, 353, 354, or 354A.\n(c) The commissioner may establish procedures to ensure that any costs reimbursed under this section are excluded from other school revenue calculations.\n(d) For reimbursements paid in fiscal year 2026 only, the commissioner must reimburse a school for six hours of paraprofessional training required under subdivision 1, paragraph (b).\n(e) In addition to the amounts under paragraph (d), for fiscal year 2026 only, the commissioner must pay each school an additional amount equal to 33.33 percent of the amount in paragraph (d). The school must use these funds either for paraprofessional test preparation and exam fees under subdivision 1, paragraph (g), or additional training under subdivision 1, paragraph (b).\nA school district or charter school must consult the exclusive representative for employees receiving this training before creating or planning the training required under this section.",
	"repealed": false
}