{
	"id": "340A.3021",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.3021",
	"title": "340A.3021 IMPORTATION RESTRICTIONS.",
	"text": "(a) No person may consign, ship, or deliver alcoholic beverages to any place in Minnesota except to a licensed wholesaler's warehouse, if the alcoholic beverages:\n(1) were manufactured outside Minnesota; and\n(2) have not previously been unloaded into a licensed wholesaler's warehouse in Minnesota.\n(b) No person may ship or consign into Minnesota any alcoholic beverages manufactured outside the state unless the alcoholic beverages are continuously in the possession of a motor carrier of property as defined in section 221.012, subdivision 27, or a common carrier as defined in section 218.011, subdivision 10, or are carried in a motor vehicle owned, leased, or rented by a wholesaler licensed under this chapter, between the time the alcoholic beverages are introduced into Minnesota and the time they are unloaded into a licensed wholesaler's warehouse.\nSubdivision 1 does not apply to:\n(1) alcoholic beverages passing through Minnesota in interstate commerce;\n(2) alcoholic beverages imported into Minnesota by individuals for personal use in the amounts permitted under section 297G.07, subdivision 2, or 340A.417; and\n(3) a holder of a manufacturer's warehouse permit.\nNo manufacturer, importer, or wholesaler licensed under this chapter may introduce into Minnesota or sell in Minnesota any bottle or other container containing alcoholic beverages unless the alcoholic beverages are packaged, labeled, and sold in conformity with all applicable federal and state regulations.\nNo person may send or mail, or cause to be sent or mailed any letter, postcard, circular, catalog, pamphlet, or similar publication for delivery into Minnesota that is intended to solicit an order for alcoholic beverages to be shipped to any location into Minnesota other than a licensed wholesaler's warehouse.\nIn addition to any penalties provided in this chapter, a person who is adversely affected by a violation of this section may bring an action in a court of appropriate jurisdiction to seek damages or injunctive relief. On a finding by the court that a person has violated or is violating this section, the court may enjoin the violation or violations. Any person licensed under this chapter is presumed to be adversely affected by a violation of this section.",
	"repealed": false
}