{
	"id": "80A.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.67",
	"title": "80A.67 SECTION 412; DENIAL, REVOCATION, SUSPENSION, WITHDRAWAL, RESTRICTION, CONDITION, OR LIMITATION OF REGISTRATION.",
	"text": "(a) Disciplinary conditions-applicants. If the administrator finds that the order is in the public interest and subsection (d) authorizes the action, an order issued under this chapter may deny an application, or may condition or limit registration of an applicant to be a broker-dealer, agent, or investment adviser, and, if the applicant is a broker-dealer or investment adviser, of a partner, officer, director, or person having a similar status or performing similar functions, or a person directly or indirectly in control of the broker-dealer or investment adviser.\n(b) Disciplinary conditions-registrants. If the administrator finds that the order is in the public interest and subsection (d) authorizes the action an order issued under this chapter may revoke, suspend, condition, or limit the registration of a registrant and, if the registrant is a broker-dealer or investment adviser, of a partner, officer, director, or person having a similar status or performing similar functions, or a person directly or indirectly in control of the broker-dealer or investment adviser. However, the administrator may not:\n(1) institute a revocation or suspension proceeding under this subsection based on an order issued under a law of another state that is reported to the administrator or a designee of the administrator more than one year after the date of the order on which it is based; or\n(2) under subsection (d)(5)(A) or (B), issue an order on the basis of an order issued under the securities act of another state unless the other order was based on conduct for which subsection (d) would authorize the action had the conduct occurred in this state.\n(c) Disciplinary penalties-registrants. If the administrator finds that the order is in the public interest and subsection (d)(1) through (6), (8), (9), (10), or (12) and (13) authorizes the action, an order under this chapter may censure, impose a bar, or impose a civil penalty in an amount up to $10,000 for each violation, on a registrant, and, if the registrant is a broker-dealer or investment adviser, a partner, officer, director, person having a similar status or performing similar functions, or a person directly or indirectly in control, of the broker-dealer or investment adviser.\n(d) Grounds for discipline. A person may be disciplined under subsections (a) through (c) if the person:\n(1) has filed an application for registration in this state under this chapter or the predecessor act within the previous ten years, which, as of the effective date of registration or as of any date after filing in the case of an order denying effectiveness, was incomplete in any material respect or contained a statement that, in light of the circumstances under which it was made, was false or misleading with respect to a material fact;\n(2) willfully violated or willfully failed to comply with this chapter or the predecessor act or a rule adopted or order issued under this chapter or the predecessor act within the previous ten years;\n(3) has been convicted of a felony or within the previous ten years has been convicted of a misdemeanor involving a security, a commodity future or option contract, or an aspect of a business involving securities, commodities, investments, franchises, insurance, banking, or finance;\n(4) is enjoined or restrained by a court of competent jurisdiction in an action instituted by the administrator under this chapter or the predecessor act, a state, the Securities and Exchange Commission, or the United States from engaging in or continuing an act, practice, or course of business involving an aspect of a business involving securities, commodities, investments, franchises, insurance, banking, or finance;\n(5) is the subject of an order, issued after notice and opportunity for hearing by:\n(A) the securities, depository institution, insurance, or other financial services regulator of a state or by the Securities and Exchange Commission or other federal agency denying, revoking, barring, or suspending registration as a broker-dealer, agent, investment adviser, federal covered investment adviser, or investment adviser representative;\n(B) the securities regulator of a state or the Securities and Exchange Commission against a broker-dealer, agent, investment adviser, investment adviser representative, or federal covered investment adviser;\n(C) the Securities and Exchange Commission or a self-regulatory organization suspending or expelling the registrant from membership in the self-regulatory organization;\n(D) a court adjudicating a United States Postal Service fraud order;\n(E) the insurance regulator of a state denying, suspending, or revoking registration as an insurance agent; or\n(F) a depository institution regulator suspending or barring the person from the depository institution business;\n(6) is the subject of an adjudication or determination, after notice and opportunity for hearing, by the Securities and Exchange Commission, the Commodity Futures Trading Commission; the Federal Trade Commission; a federal depository institution regulator, or a depository institution, insurance, or other financial services regulator of a state that the person willfully violated the Securities Act of 1933, the Securities Exchange Act of 1934, the Investment Advisers Act of 1940, the Investment Company Act of 1940, or the Commodity Exchange Act, the securities or commodities law of a state, or a federal or state law under which a business involving investments, franchises, insurance, banking, or finance is regulated;\n(7) is insolvent, either because the person's liabilities exceed the person's assets or because the person cannot meet the person's obligations as they mature, but the administrator may not enter an order against an applicant or registrant under this paragraph without a finding of insolvency as to the applicant or registrant;\n(8) refuses to allow or otherwise impedes the administrator from conducting an audit or inspection under section 80A.66(d) or refuses access to a registrant's office to conduct an audit or inspection under section 80A.66(d);\n(9) has failed to reasonably supervise an agent, investment adviser representative, or other individual, if the agent, investment adviser representative, or other individual was subject to the person's supervision and committed a violation of this chapter or the predecessor act or a rule adopted or order issued under this chapter or the predecessor act within the previous ten years;\n(10) has not paid the proper filing fee within 30 days after having been notified by the administrator of a deficiency, but the administrator shall vacate an order under this paragraph when the deficiency is corrected;\n(11) after notice and opportunity for a hearing, has been found within the previous ten years:\n(A) by a court of competent jurisdiction to have willfully violated the laws of a foreign jurisdiction under which the business of securities, commodities, investment, franchises, insurance, banking, or finance is regulated;\n(B) to have been the subject of an order of a securities regulator of a foreign jurisdiction denying, revoking, or suspending the right to engage in the business of securities as a broker-dealer, agent, investment adviser, investment adviser representative, or similar person; or\n(C) to have been suspended or expelled from membership by or participation in a securities exchange or securities association operating under the securities laws of a foreign jurisdiction;\n(12) is the subject of a cease and desist order issued by the Securities and Exchange Commission or issued under the securities, commodities, investment, franchise, banking, finance, or insurance laws of a state;\n(13) has engaged in dishonest or unethical practices in the securities, commodities, investment, franchise, banking, finance, or insurance business within the previous ten years; or\n(14) is not qualified on the basis of factors such as training, experience, and knowledge of the securities business. However, in the case of an application by an agent for a broker-dealer that is a member of a self-regulatory organization, a denial order may not be based on this paragraph if the individual has successfully completed all examinations required by subsection (e). The administrator may require an applicant for registration under section 80A.57 who has not been registered in a state within the two years preceding the filing of an application in this state to successfully complete an examination.\n(e) Examinations. A rule adopted or order issued under this chapter may require that an examination, including an examination developed or approved by an organization of securities regulators, be successfully completed by a class of individuals or all individuals. An order issued under this chapter may waive, in whole or in part, an examination as to an individual and a rule adopted under this chapter may waive, in whole or in part, an examination as to a class of individuals if the administrator determines that the examination is not necessary or appropriate in the public interest and for the protection of investors.\n(f) Summary process. The administrator may suspend or deny an application summarily; restrict, condition, limit, or suspend a registration; or censure, bar, or impose a civil penalty on a registrant before final determination of an administrative proceeding. Upon the issuance of an order, the administrator shall promptly notify each person subject to the order that the order has been issued, the reasons for the action, and that within 15 days after the receipt of a request in a record from the person the matter will be scheduled for a hearing. If a hearing is not requested and none is ordered by the administrator within 30 days after the date of service of the order, the order becomes final by operation of law. If a hearing is requested or ordered, the administrator, after notice of and opportunity for hearing to each person subject to the order, may modify or vacate the order or extend the order until final determination.\n(g) Procedural requirements. An order issued may not be issued under this section, except under subsection (f), without:\n(1) appropriate notice to the applicant or registrant;\n(2) opportunity for hearing; and\n(3) findings of fact and conclusions of law in a record in accordance with chapter 14.\n(h) Control person liability. A person that controls, directly or indirectly, a person not in compliance with this section may be disciplined by order of the administrator under subsections (a) through (c) to the same extent as the noncomplying person, unless the controlling person did not know, or knowingly or recklessly disregarded evidence, of the existence of conduct that is a ground for discipline under this section.\n(i) Limit on investigation or proceeding. The administrator may not institute a proceeding under subsection (a), (b), or (c) based solely on material facts actually known by the administrator unless an investigation or the proceeding is instituted within one year after the administrator actually acquires knowledge of the material facts.",
	"repealed": false
}