{
	"id": "60B.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.26",
	"title": "60B.26 NOTICE TO CREDITORS AND OTHERS.",
	"text": "(a) The liquidator shall give notice of the liquidation order as soon as possible by first class mail and either by telegram or telephone to the commissioner of commerce of each jurisdiction in which the insurer is licensed to do business, by first class mail and by telephone to the Department of Labor and Industry of this state if the insurer is or has been an insurer of workers' compensation, by first class mail within this state and by airmail outside this state to all agents of the insurer having a duty under this chapter, by first class mail, if the insurer is a surety company to every district court judge exercising probate jurisdiction and the court administrator of all courts of record in this state and upon receipt of such notice it shall be the duty of those judges and court administrators to notify and require every executor, administrator, guardian, trustee, or other fiduciary having filed a bond on which such company is surety, to forthwith file a new bond with new sureties, and by first class mail within this state and by airmail outside this state at the last known address to all persons known or reasonably expected to have claims against the insurer, including all policyholders. The liquidator also shall publish a notice three consecutive times in a newspaper of general circulation in the county in which the liquidation is pending or in Ramsey County, the last publication to be not less than three months before the earliest deadline specified in the notice under subdivision 2.\n(b) Notice to agents shall inform them of their duties under this chapter and inform them what information they must communicate to policyholders. Notice to policyholders shall include notice of impairment and termination of coverage under section 60B.22. When it is applicable, notice to policyholders shall include (1) notice of withdrawal of the insurer from the defense of any case in which the policyholder is interested, and (2) notice of the right to file a claim under section 60B.40, subdivision 2.\n(c) Within 15 days of the date of entry of the order, the liquidator shall report to the court what notice has been given. The court may order such additional notice as it deems appropriate.\nNotice to potential claimants under subdivision 1 shall require claimants to file with the court their claims together with proper proofs thereof under section 60B.38, on or before a date the liquidator specifies in the notice, which shall be no less than six months nor more than one year after entry of the order, except that the liquidator need not require persons claiming unearned premiums or subscription rates and persons claiming cash surrender values or other investment values in life insurance and annuities to file a claim. The liquidator may specify different dates for the filing of different kinds of claims. Notice to potential claimants shall include notice of the existence of any guaranty association charged by statute with the guaranty of the obligations of the insurer. Where procedures have been established by the association for the filing of claims this notice shall include an explanation of those procedures.\nIf notice is given in accordance with this section, the distribution of the assets of the insurer under sections 60B.01 to 60B.61 shall be conclusive with respect to all claimants, whether or not they received notice.",
	"repealed": false
}