{
	"id": "365.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/365.10",
	"title": "365.10 ANNUAL TOWN MEETING; POWERS OF ELECTORS.",
	"text": "The electors of a town, at their annual town meeting, may do what is in this section.\nThe electors may (1) decide the locations of pounds, (2) set the number of poundmasters, and (3) discontinue a pound.\nMS 1998 [Repealed, 1999 c 132 s 46]\nThe electors may make orders and bylaws on restraining horses, cattle, sheep, swine, and other domestic animals from going at large on roads. They may also make orders and bylaws on the impounding of domestic animals going at large and fix penalties for violations of the orders and bylaws.\nThe electors may vote money to repair and build roads and bridges. They may also vote as much money as they consider expedient for the good of the town for other town expenses, including the building and maintenance of docks and breakwaters.\nThe electors may direct that a certain amount of the road tax be spent on the roads of an adjoining town. The spending must be for the good of the town and under the control of the town board.\nThe electors may let the town board buy or build a town hall or other building for the use of the town. The electors must decide the amount of money to be raised for that purpose. Once the town gets a site for a town hall the site must not be changed for another site, except by a vote choosing a new site. To get a new site two-thirds of those voting on the question must vote for it.\nThe electors may let the town board vote to buy grounds for a town cemetery. The electors may limit the price to be paid for the cemetery and may vote a tax to pay for it.\nThe electors may let the town board, by itself or with other towns, buy grounds for a public park and may limit the price to be paid for the grounds. The electors may let the town, alone or with the other towns, care for, improve, and beautify the parks. The electors may vote a tax to pay for what they allow under this subdivision.\nThe electors may vote money to help build community halls. The community halls may be built by farm bureaus, farmers clubs, or other like organizations.\nThe electors may vote a tax to buy and maintain a public dump.\nThe electors may let the town board, by resolution, determine whether to open or maintain town roads or town cartways under the jurisdiction of the town board upon which no maintenance or construction has been conducted for 25 years or more. For purposes of this subdivision, section 163.16 does not apply to town roads described in this subdivision. This subdivision does not limit the right of town voters or land owners to petition to establish a cartway under section 164.08.\nThe electors may set an amount of money and let the town board spend it to commemorate an event of historical significance to the town, to recognize volunteers, service efforts, and retiring town officers, or to host or support a community celebration.\nThe electors may let the town board pass an ordinance for licensing dogs and cats and regulating their presence, keeping, and running at large in the town.\nThe electors may let the town board contract with nonprofit organizations for not more than $10,000 per year of health, social, and recreational services. To do so, the town board must consider the services to be in the public interest and good for the town.\nThe electors may let the town board find a way to collect and get rid of household waste and other refuse. The way must be consistent with other law.\nThe electors may let the town board set up a perpetual care program to administer and maintain a cemetery in the town. The town board must first decide that it has enough money available from burial plot sales, gifts, and private assistance to administer and maintain the cemetery. Cemetery administration may include the sale of burial plots and the supervision of burials. The town may accept gifts of money and other help from individuals to set up the perpetual care program.\n(a) To grant the town board authority to provide for a specific activity that is within any of the following categories:\n(1) the government and good order of the town,\n(2) the suppression of vice and immorality,\n(3) the prevention of crime,\n(4) the protection of public and private property,\n(5) the benefit of residence, trade, and commerce,\n(6) the promotion of health, safety, order, and convenience, and\n(7) the general welfare.\n(b) Authority under this subdivision may be exercised by ordinances that the board deems expedient and that are consistent with the Constitution and laws of the United States and this state.\nThe electors may authorize creation of a capital reserve fund and designate its use for any lawful purpose.",
	"repealed": false
}