{
	"id": "17.4985",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4985",
	"title": "17.4985 TRANSPORTATION OF AQUATIC LIFE.",
	"text": "Except as provided in subdivision 3, a licensee may not import aquatic life into the state, transport aquatic life within the state, or stock waters of the state with aquatic life without first obtaining a bill of lading or transportation permit from the commissioner, with disease certification, if applicable.\n(a) A state-issued bill of lading is required for:\n(1) intrastate transportation of aquatic life other than salmonids, catfish, or species on the VHS-susceptible-species list between licensed private fish hatcheries, aquatic farms, or aquarium facilities licensed for the species being transported if the aquatic life is being transported into a watershed where it is not currently present, if walleyes whose original source is south of marked State Highway 210 are being transported to a facility north of marked State Highway 210, or if the original source of the aquatic life is outside Minnesota and contiguous states; and\n(2) stocking waters other than public waters with aquatic life other than salmonids, catfish, or species on the VHS-susceptible-species list.\n(b) When aquatic life is transported under paragraph (a), a copy of the bill of lading must be submitted to the regional fisheries manager at least 72 hours before the transportation.\n(c) For transportation and stocking of waters that are not public waters:\n(1) a bill of lading must be submitted to the regional fisheries manager 72 hours before transporting fish for stocking;\n(2) a bill of lading must be submitted to the regional fisheries manager within five days after stocking if the waters to be stocked are confirmed by telecopy or telephone prior to stocking by the regional fisheries office not to be public waters; or\n(3) a completed bill of lading may be submitted to the regional fisheries office by telecopy prior to transporting fish for stocking. Confirmation that the waters to be stocked are not public waters may be made by returning the bill of lading by telecopy or in writing, in which cases additional copies need not be submitted to the Department of Natural Resources.\n(d) Bill of lading forms may only be issued by the Department of Natural Resources in St. Paul, and new bill of lading forms may not be issued until all previously issued forms have been returned.\n(a) A state-issued bill of lading or transportation permit is not required by an aquatic farm licensee for importing animals not on the VHS-susceptible-species list, transporting animals not on the VHS-susceptible-species list, or exporting the following:\n(1) minnows taken under an aquatic farm license in this state and transported intrastate;\n(2) aquarium or ornamental fish including goldfish and tropical, subtropical, and saltwater species that cannot survive in the waters of the state, which may be imported or transported if accompanied by shipping documents;\n(3) fish or fish eggs that have been processed for use as food, bait, or other purposes unrelated to fish propagation;\n(4) live fish from a licensed aquatic farm, which may be transported directly to an outlet for processing or for other food purposes if accompanied by shipping documents;\n(5) fish being exported if accompanied by shipping documents;\n(6) sucker eggs, sucker fry, or fathead minnows transported intrastate for bait propagation or feeding of cultural aquatic life, except that if either species becomes listed on the VHS-susceptible-species list, then a transportation permit is required;\n(7) species of fish that are found within the state used in connection with public shows, exhibits, demonstrations, or fishing pools for periods not exceeding 14 days;\n(8) fish being transported through the state if accompanied by shipping documents; or\n(9) intrastate transportation of aquatic life between or within licensed private fish hatcheries, aquatic farms, or aquarium facilities licensed for the species being transported, except where required in subdivision 2 and except that salmonids, catfish, or species on the VHS-susceptible-species list may only be transferred or transported intrastate without a transportation permit if they had no record of bacterial kidney disease or viral hemorrhagic septicemia at the time they were imported into the state and if they have had a fish health inspection within the preceding year that has shown no certifiable diseases to be present.\nAquatic life being transferred between licensed private fish hatcheries, aquatic farms, or aquarium facilities must be accompanied by shipping documents and salmonids, catfish, or species on the VHS-susceptible-species list being transferred or transported intrastate without a transportation permit must be accompanied by a copy of their most recent fish health inspection.\n(b) Shipping documents required under paragraph (a) must show the place of origin, owner or consignee, destination, number, and species.\nA transportation permit is required for all importation, transportation, or stocking of private aquatic life not covered by subdivision 2 or exempted in subdivision 3. A transportation permit may be used for multiple shipments within the 30-day term for the permit if the source and the destination remains the same. Transportation permits, which may authorize importation or stocking of public waters, may be issued through Department of Natural Resources regional offices or the St. Paul office, and must be obtained prior to shipment.\nAn application for a transportation permit must be made on forms provided by the commissioner. An incomplete application must be rejected. An application for a transportation permit for salmonids, catfish, or species on the VHS-susceptible-species list; their eggs; or their sperm must be accompanied by certification that the source of the eggs or sperm are free of certifiable diseases, except that eggs with enteric redmouth, whirling disease, or furunculosis may be imported, transported, or stocked following treatment approved by the commissioner, and fish with bacterial kidney disease or viral hemorrhagic septicemia may be imported, transported, or stocked into areas where the disease has been identified as being present. A copy of the transportation permit showing the date of certification inspection must accompany the shipment of fish while in transit and must be available for inspection by the commissioner. By 14 days after a completed application is received, the commissioner must approve or deny the importation permits as provided in this section.\n(a) A vehicle used by a licensee for transporting aquatic life must be identified with the licensee's name and town of residence as it appears on the license and the license number.\n(b) A vehicle used by a licensee must have identification displayed so that it is readily visible from either side of the vehicle in letters and numbers not less than 2-1/2 inches high and with a three-eighths inch wide stroke. Identification may be permanently affixed to vehicles or displayed on removable plates or placards placed on opposite doors of the vehicle or on the tanks carried on the vehicle.\n(c) An application to license a vehicle for minnow transport or export or for use as a fish vendor that is received by the commissioner is a temporary license until it is approved or denied.",
	"repealed": false
}