{
	"id": "300.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/300.64",
	"title": "300.64 LIABILITY OF STOCKHOLDERS AND DIRECTORS.",
	"text": "If the capital stock of a manufacturing corporation is withdrawn and refunded to the stockholders before the payment of corporate debts for which it would have been liable, the stockholders are liable to a creditor, to the amount of the sum refunded to each of them, respectively. If, in an action under this statute, a stockholder is compelled to pay a debt, the stockholder may call upon every stockholder to whom any part of the stock has been refunded to contribute a proportionate share of the sum so paid by the stockholder.\nIf the directors pay a dividend when the corporation is insolvent, knowing that the corporation is insolvent, or that the dividend would render it so, or when its payment would render it insolvent, those assenting to the payment are jointly and severally liable in an action on the statute for all debts due from the corporation at the time of the dividend.\nEvery officer who intentionally neglects or refuses to perform a duty imposed by law is liable for all corporate debts contracted during the period of the neglect. If the corporation violates a provision of law whereby it becomes insolvent, the directors ordering or assenting to the violation are liable in an action under the statute for all debts contracted after the violation.\nA director's personal liability to the corporation or its stockholders or members for monetary damages for breach of fiduciary duty as a director may be eliminated or limited in the certificate. The certificate shall not eliminate or limit the liability of a director:\n(1) for a breach of the director's duty of loyalty to the corporation or its stockholders or members;\n(2) for acts or omissions not in good faith or that involve intentional misconduct or a knowing violation of law;\n(3) for acts prohibited under Minnesota Statutes 2004, section 300.60;\n(4) under subdivision 1, 2, or 3;\n(5) for a transaction from which the director derived an improper personal benefit; or\n(6) for an act or omission occurring prior to the date when the provision in the certificate eliminating or limiting liability becomes effective.",
	"repealed": false
}