{
	"id": "120B.124",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.124",
	"title": "120B.124 READ ACT IMPLEMENTATION PARTNERSHIP.",
	"text": "(a) The Department of Education must partner with CAREI for two years beginning July 1, 2023, until August 30, 2025, to support implementation of the Read Act. The department and CAREI must jointly:\n(1) identify at least five literacy curricula and supporting materials that are evidence-based or focused on structured literacy by January 1, 2024, and post a list of the curricula on the department website. The list must include curricula that use culturally and linguistically responsive materials that reflect diverse populations and curricula that reflect the experiences of students from diverse backgrounds, including multilingual learners, biliterate students, and students who are Black, Indigenous, and People of Color. A district that purchases an approved curriculum before the cultural responsiveness review is completed is encouraged to work with the curriculum's publisher to obtain updated materials that are culturally and linguistically responsive and reflect diverse populations. A district is not required to use an approved curriculum;\n(2) identify at least three professional development programs that focus on the five pillars of literacy and the components of structured literacy by August 15, 2023, subject to final approval by the department. The department must post a list of the programs on the department website. The programs may include a program offered by CAREI. The requirements of section 16C.08 do not apply to the selection of a provider under this section;\n(3) identify evidence-based literacy intervention materials for students in kindergarten through grade 12;\n(4) develop an evidence-based literacy lead training and coaching program that trains and supports literacy specialists throughout Minnesota to support schools' efforts in screening, measuring growth, monitoring progress, and implementing interventions in accordance with subdivision 1. Literacy lead training must include instruction on how to train paraprofessionals and volunteers that provide Tier 2 interventions on evidence-based literacy intervention;\n(5) identify measures of foundational literacy skills and mastery that a district must report on a local literacy plan;\n(6) provide guidance to districts about best practices in literacy instruction, and practices that are not evidence-based;\n(7) develop MTSS model plans that districts may adopt to support efforts to screen, identify, intervene, and monitor the progress of students not reading at grade level;\n(8) ensure that teacher professional development options and MTSS framework trainings are geographically equitable by supporting trainings through the regional service cooperatives;\n(9) develop a coaching and mentorship program for certified trained facilitators based on the previously approved trainings; and\n(10) identify at least 15 evidence-based literacy intervention models by November 1, 2025, and post a list of the interventions on the department website. A district is not required to use an approved intervention model.\n(b) The department must contract with a third party to develop culturally and linguistically responsive supplemental materials and guidance for the approved literacy curricula to meet the culturally and linguistically responsive standards under paragraph (a), clause (1).\n(a) The department and CAREI must provide districts an opportunity to request that the department and CAREI add to the list of curricula or professional development programs a specific curriculum or professional development program. The department must publish the request for reconsideration procedure on the department website. A request for reconsideration must demonstrate that the curriculum or professional development program meets the requirements of the Read Act, is evidence-based, and has structured literacy components. The department and CAREI must review the request for reconsideration and approve or deny the request within 60 days.\n(b) The department and CAREI must conduct a final curriculum review of previously submitted curriculum by March 3, 2025, to review curriculum that is available to districts at no cost.\nThe department and CAREI must support district efforts to implement the Read Act by:\n(1) issuing guidance for teachers on implementing curriculum that is evidence-based, or focused on structured literacy;\n(2) providing teachers accessible options for evidence-based professional development focused on structured literacy;\n(3) providing districts with guidance on adopting MTSS; and\n(4) providing districts with literacy implementation guidance and support.\n(a) The department and CAREI must develop and provide training on evidence-based literacy interventions for the following unlicensed persons that regularly provide Tier 2 interventions to students in Minnesota districts:\n(1) paraprofessionals and other unlicensed school staff; and\n(2) volunteers, contractors, and other persons not employed by Minnesota districts.\n(b) The regional literacy networks must develop and provide training on evidence-based literacy interventions consistent with paragraph (a).\n(c) CAREI and the regional literacy networks must collaborate to ensure that training provided by CAREI and the regional literacy networks is consistent across providers. The trainings must not exceed eight hours. The trainings must be based on approved training developed for teachers, and must include a train the trainer component to enable literacy leads to provide the training to paraprofessionals and volunteers. CAREI and the regional literacy networks must provide the trainings at no cost to paraprofessionals and other unlicensed school staff who regularly provide Tier 2 interventions to students in Minnesota districts.\nThe department may partner with one or more institutions of higher education to conduct independent and objective reviews of curriculum and intervention materials. The department must determine whether it will partner with an institution of higher education to conduct ongoing reviews of literacy materials by June 1, 2026. A publisher may submit curriculum or intervention materials for review. The publisher is responsible for paying the cost of the review directly to the institution of higher education. The review must use the rubric used to approve curriculum under subdivision 1. The department and institution of higher education may approve the curriculum or intervention materials if they determine that the curriculum or intervention materials are evidence-based, focused on structured literacy, culturally and linguistically responsive, and reflect diverse populations. The department must add the approved curriculum or intervention materials to the list of curricula and materials approved under the Read Act.\nStarting in 2033, the department and an institution of higher education may partner to conduct a comprehensive review of curriculum and intervention materials to identify literacy curriculum and supporting materials, and intervention materials that are evidence-based, focused on structured literacy, culturally and linguistically responsive, and reflect diverse populations. The department must revise the list of approved curriculum and supporting materials, and intervention materials based on the findings of the review.",
	"repealed": false
}