{
	"id": "221.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.012",
	"title": "221.012 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n\"Bulk commodity\" means a commodity that (1) can be poured, scooped, or shoveled into a vehicle, (2) is carried loose in that vehicle, (3) is confined by the bottom and sides of the vehicle, and (4) is not sacked, boxed, bundled, or otherwise assembled before delivery.\n\"Certificated carrier\" means a motor carrier holding a certificate of registration.\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n\"Commissioner\" means the commissioner of transportation.\n\"Commuter van\" means a motor vehicle used in a ride-sharing arrangement and used principally to provide prearranged transportation of persons for a fee to or from their place of employment or to or from a transit stop authorized by a local transit authority:\n(1) when the vehicle is operated by a person who does not drive the vehicle for that person's principal occupation but is driving it only to or from that person's principal place of employment or to or from a transit stop authorized by a local transit authority; or\n(2) when the vehicle is operated for personal use at other times by an authorized driver.\n\"Contiguous\" means having any portion of a common boundary with another municipality or with one of a group of contiguous municipalities.\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n\"Department\" means the Department of Transportation.\n\"For hire\" means for remuneration or compensation of any kind promised, paid, or given to or received by a person for the transportation of persons or property on the highways, and includes compensation obtained by a motor carrier indirectly, by subtraction from the purchase price or addition to the selling price of property transported, when the purchase or sale of the property is not a bona fide purchase or sale. The transportation of property by a person who purchases it immediately before transporting it, and sells it immediately after transporting it, is transportation for hire. The lease or rental of a motor vehicle to a person for transportation of the person's property is transportation for hire and not private carriage when the lessor, directly or indirectly, serves as driver or obtains or arranges for a driver under the terms of the motor vehicle lease. For hire does not include motor vehicle operations conducted by a private carrier.\n\"Gross vehicle weight\" has the meaning given it in section 169.011, subdivision 32.\n\"Hazardous material\" means a substance or material determined by the United States secretary of transportation to be capable of posing an unreasonable risk to health, safety, and property when transported in commerce, and so designated by the United States secretary of transportation.\n\"Hazardous substance\" has the meaning given it in Code of Federal Regulations, title 49, section 171.8.\n\"Hazardous waste\" has the meaning given it in Code of Federal Regulations, title 49, section 171.8.\n\"Household goods\" means personal effects and property used or to be used by the owner in the owner's dwelling.\n\"Interstate carrier\" means any person engaged in transporting property or passengers for hire in interstate commerce in Minnesota, from or into Minnesota, or between any point in the state of Minnesota and the Dominion of Canada.\n[Repealed, 2009 c 64 s 57]\n\"Lightweight vehicle\" means a vehicle with a gross vehicle weight of 10,000 pounds or less, but does not include a vehicle transporting passengers for hire or a vehicle transporting hazardous materials that must be placarded or marked under Code of Federal Regulations, title 49, section 177.823.\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n\"Motor carrier\" means a person engaged in the for-hire transportation of property or passengers. \"Motor carrier\" does not include a person providing transportation described in section 221.025, a building mover subject to section 221.81, or a person providing limousine service as defined in section 221.84.\n\"Motor carrier of passengers\" means a person engaged in the for-hire transportation of passengers in vehicles designed to transport eight or more persons, including the driver.\n\"Motor carrier of property\" means a motor carrier engaged in the for-hire transportation of property, other than household goods, in Minnesota who has filed a registration statement with the commissioner.\n\"Motor carrier of railroad employees\" means a motor carrier engaged in the for-hire transportation of railroad employees of a Class I or II common carrier, as defined in Code of Federal Regulations, title 49, part 1201, general instruction 1-1, under the terms of a contractual agreement with a common carrier, as defined in section 218.011, subdivision 10.\n\"Out-of-service order\" has the meaning given it in Code of Federal Regulations, title 49, section 383.5.\n\"Permit\" means the license that may be issued to motor carriers under the provisions of this chapter, authorizing the use of the highways of Minnesota for transportation for hire.\n[Repealed, 2009 c 64 s 57]\n\"Person\" means any individual, firm, copartnership, cooperative, company, association and corporation, or their lessees, trustees, or receivers. \"Person\" does not include the federal government, the state, or any political subdivision.\n[Repealed, 2009 c 64 s 57]\n\"Petroleum products\" means crude petroleum and natural gas and any and all derivatives arising out of the refinement thereof, including anhydrous ammonia and liquid fertilizer.\n\"Petroleum transport\" means a vehicle, trailer, or semitrailer with a tank (1) that is mounted on it or made an integral part of it, other than the fuel supply tank for the engine of that vehicle, (2) that is filled or emptied while on the vehicle, and (3) that is used to transport petroleum products in bulk.\n\"Private carrier\" means a person engaged in the transportation of property or passengers by motor vehicle when:\n(1) the person transporting the property or passengers is engaged in a business other than transportation; and\n(2) the transportation is within the scope of and furthers a primary business, other than transportation, of that person.\n\"Private carrier\" does not include a person while engaged in transportation described in section 221.025.\n\"Public highway\" means every public street, alley, road, highway or thoroughfare of any kind, except waterways, open to public travel and use.\n\"Service of notice and orders\" means depositing the notice and orders in the United States mails properly enveloped, addressed, and stamped, provided that service of a notice or order requiring an affirmative or negative action by a person must be by certified United States mail with return receipt.\n(a) \"Small vehicle passenger service\" means a service provided by a person engaged in the for-hire transportation of passengers in a vehicle designed to transport seven or fewer persons, including the driver.\n(b) In the metropolitan area as defined in section 473.121, subdivision 2, \"small vehicle passenger service\" also includes for-hire transportation of persons who are certified by the Metropolitan Council to use special transportation service provided under section 473.386, in a vehicle designed to transport not more than 15 persons including the driver, that is equipped with a wheelchair lift and at least three wheelchair securement positions.\n(c) Small vehicle passenger service does not include a motor carrier of railroad employees.\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n[Repealed, 2009 c 64 s 57]\n\"Vehicle\" means a vehicle or combination of vehicles used upon the highways for the transportation of persons or property.",
	"repealed": false
}