{
	"id": "149A.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.91",
	"title": "149A.91 PREPARATION OF BODY.",
	"text": "In handling and preparing dead human bodies for final disposition, any person who comes in direct contact with an unembalmed dead human body or who enters a room where dead human bodies are embalmed, shall use universal precautions and otherwise exercise all reasonable precautions to minimize the risk of transmitting any communicable disease from the body. All persons present in a preparation and embalming room while a body is being prepared for final disposition must be attired in accordance with all applicable state and federal regulations regarding the control of infectious disease and occupational and workplace health and safety.\nThe preparation of a dead human body for final disposition shall be performed in privacy. No person shall be permitted to be present in the preparation room while a dead human body is being embalmed, washed, or otherwise prepared for final disposition, except:\n(1) licensed morticians;\n(2) registered interns or students as described in subdivision 6;\n(3) public officials or representatives in the discharge of their official duties; and\n(4) licensed medical personnel.\nLicensed funeral homes may work with family and friends of the deceased to allow for their participation in washing and dressing of the body in a private location other than the preparation room of the funeral home.\n(a) A dead human body must be embalmed by a licensed mortician or registered intern or practicum student or clinical student, refrigerated, or packed in dry ice in the following circumstances:\n(1) if the body will be transported by public transportation, pursuant to section 149A.93, subdivision 7;\n(2) if final disposition will not be accomplished within 72 hours after death or release of the body by a competent authority with jurisdiction over the body or the body will be lawfully stored for final disposition in the future, except as provided in section 149A.94, subdivision 1;\n(3) if the body will be publicly viewed subject to paragraph (b); or\n(4) if so ordered by the commissioner of health for the control of infectious disease and the protection of the public health.\n(b) For purposes of this subdivision, \"publicly viewed\" means reviewal of a dead human body by anyone other than those mentioned in section 149A.80, subdivision 2, and their minor children. Dry ice may only be used when the dead human body is publicly viewed within private property.\n(c) A body may not be kept in refrigeration for a period that exceeds six calendar days, or packed in dry ice for a period that exceeds four calendar days, from the time and release of the body from the place of death or from the time of release from the coroner or medical examiner.\nNo dead human body shall be embalmed without written authorization. Written authorization to embalm a dead human body must be obtained from the individual lawfully entitled to custody of the body or the individual's legal designee as soon as is practicable following the death. Oral permission to embalm shall constitute an effective authorization to embalm if the individual seeking permission uses the word \"embalm,\" briefly explains the nature of embalming, and briefly outlines the existing laws regulating the timing and reasons for embalming, and obtains written authorization as soon as is possible thereafter. The original written authorization to embalm shall be maintained in the records of the funeral establishment that causes the embalming to be performed and a copy of the authorization must be delivered to the person who has legal right to control the disposition or that person's legal designee. Predeath directives authorizing embalming, duly executed by the deceased, shall be given full legal effect and shall constitute an effective authorization to embalm under this subdivision. When embalming is required by subdivision 3, permission to embalm shall, as a matter of law, be implied.\nA written authorization to embalm must contain the following information:\n(1) the date of the authorization;\n(2) the name of the funeral establishment that will perform the embalming;\n(3) the name, address, and relationship to the decedent of the person signing the authorization;\n(4) an acknowledgment of the circumstances where embalming is required by law under subdivision 3;\n(5) a statement certifying that the person signing the authorization is the person with legal right to control the disposition of the body prescribed in section 149A.80 or that person's legal designee;\n(6) the name and signature of the person requesting the authorization and that person's relationship to the funeral establishment where the procedure will be performed; and\n(7) the signature of the person who has the legal right to control the disposition or their legal designee.\nEmbalming of a dead human body shall be performed only by an individual holding a license to practice mortuary science in Minnesota, a registered intern pursuant to section 149A.20, subdivision 6, or a student registered for a practicum or clinical through an accredited college or university or a college of funeral service education accredited by the American Board of Funeral Service Education. An individual who holds a funeral director only license issued pursuant to section 149A.40, subdivision 2, is prohibited from engaging in the embalming of a dead human body.\nEmbalming fluid containing compounds of arsenic, mercury, zinc, silver, or other poisonous metals shall not be sold in Minnesota or used for or in the embalming of any dead human body.\nIn every case where a dead human body is embalmed, standards of performance known to and accepted in the practice of mortuary science shall be followed to ensure the inhibition of pathogenic organisms in the dead human body.\nAll bodies awaiting final disposition shall be kept in an appropriate holding facility or preparation and embalming room. The holding facility must be secure from access by anyone except the authorized personnel of the funeral establishment, preserve the dignity and integrity of the body, and protect the health and safety of the personnel of the funeral establishment.\nEvery funeral establishment that causes a dead human body to be embalmed shall create and maintain on its premises or other business location in Minnesota an accurate record of every embalming performed. The record shall include all of the following information for each embalming:\n(1) the name of the decedent and the date of death;\n(2) the date the funeral establishment took physical custody of the body and, if applicable, the name of the person releasing the body to the custody of the funeral establishment;\n(3) the reason for embalming the body;\n(4) the name, address, and relationship to the decedent of the person who authorized the embalming of the body;\n(5) the date the body was embalmed, including the time begun and the time of completion;\n(6) the name, license number, and signature of the mortician who performed or personally supervised the intern or student who performed the embalming;\n(7) the name, permit number, if applicable, and signature of any intern or practicum student or clinical student that participates in the embalming of a body, whether the intern or practicum student or clinical student performs part or all of the embalming; and\n(8) the original written authorization to embalm and any other supporting documentation that establishes the legal right of the funeral establishment to physical custody of the body and to embalm the body.\nRecords required under subdivision 10 shall be maintained for a period of three calendar years after the embalming of the body. Following this period and subject to any other laws requiring retention of records, the funeral establishment may then place the records in storage or reduce them to microfilm, microfiche, laser disc, or any other method that can produce an accurate reproduction of the original record, for retention for a period of ten calendar years from the date of the embalming of the body. At the end of this period and subject to any other laws requiring retention of records, the funeral establishment may destroy the records by shredding, incineration, or any other manner that protects the privacy of the individuals identified in the records.",
	"repealed": false
}