{
	"id": "144.1911",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1911",
	"title": "144.1911 INTERNATIONAL MEDICAL GRADUATES ASSISTANCE PROGRAM.",
	"text": "The international medical graduates assistance program is established to address barriers to practice and facilitate pathways to assist immigrant international medical graduates to integrate into the Minnesota health care delivery system, with the goal of increasing access to primary care in rural and underserved areas of the state.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of health.\n(c) \"Immigrant international medical graduate\" means an international medical graduate who was born outside the United States, now resides permanently in the United States or who has entered the United States on a temporary status based on urgent humanitarian or significant public benefit reasons, and who did not enter the United States on a J1 or similar nonimmigrant visa following acceptance into a United States medical residency or fellowship program.\n(d) \"International medical graduate\" means a physician who received a basic medical degree or qualification from a medical school located outside the United States and Canada.\n(e) \"Minnesota immigrant international medical graduate\" means an immigrant international medical graduate who has lived in Minnesota for at least two years.\n(f) \"Rural community\" means a statutory and home rule charter city or township that is outside the seven-county metropolitan area as defined in section 473.121, subdivision 2, excluding the cities of Duluth, Mankato, Moorhead, Rochester, and St. Cloud.\n(g) \"Underserved community\" means a Minnesota area or population included in the list of designated primary medical care health professional shortage areas, medically underserved areas, or medically underserved populations (MUPs) maintained and updated by the United States Department of Health and Human Services.\nIn administering the international medical graduates assistance program, the commissioner shall:\n(1) provide overall coordination for the planning, development, and implementation of a comprehensive system for integrating qualified immigrant international medical graduates into the Minnesota health care delivery system, particularly those willing to serve in rural or underserved communities of the state;\n(2) develop and maintain, in partnership with community organizations working with international medical graduates, a voluntary roster of immigrant international medical graduates interested in entering the Minnesota health workforce to assist in planning and program administration, including making available summary reports that show the aggregate number and distribution, by geography and specialty, of immigrant international medical graduates in Minnesota;\n(3) work with graduate clinical medical training programs to address barriers faced by immigrant international medical graduates in securing residency positions in Minnesota, including the requirement that applicants for residency positions be recent graduates of medical school. The annual report required in subdivision 10 shall include any progress in addressing these barriers;\n(4) develop a system to assess and certify the clinical readiness of eligible immigrant international medical graduates to serve in a residency program. The system shall include assessment methods, an operating plan, and a budget. Initially, the commissioner may develop assessments for clinical readiness for practice of one or more primary care specialties, and shall add additional assessments as resources are available. The commissioner may contract with an independent entity or another state agency to conduct the assessments. In order to be assessed for clinical readiness for residency, an eligible international medical graduate must have obtained a certification from the Educational Commission of Foreign Medical Graduates. The commissioner shall issue a Minnesota certificate of clinical readiness for residency to those who pass the assessment;\n(5) explore and facilitate more streamlined pathways for immigrant international medical graduates to serve in nonphysician professions in the Minnesota workforce; and\n(6) study, in consultation with the Board of Medical Practice and other stakeholders, changes necessary in health professional licensure and regulation to ensure full utilization of immigrant international medical graduates in the Minnesota health care delivery system. The commissioner shall include recommendations in the annual report required under subdivision 10, due January 15, 2017.\nThe commissioner shall award grants to eligible nonprofit organizations and eligible postsecondary educational institutions, including the University of Minnesota, to provide career guidance and support services to immigrant international medical graduates seeking to enter the Minnesota health workforce. Eligible grant activities include the following:\n(1) educational and career navigation, including information on training and licensing requirements for physician and nonphysician health care professions, and guidance in determining which pathway is best suited for an individual international medical graduate based on the graduate's skills, experience, resources, and interests;\n(2) support in becoming proficient in medical English;\n(3) support in becoming proficient in the use of information technology, including computer skills and use of electronic health record technology;\n(4) support for increasing knowledge of and familiarity with the United States health care system;\n(5) support for other foundational skills identified by the commissioner;\n(6) support for immigrant international medical graduates in becoming certified by the Educational Commission on Foreign Medical Graduates, including help with preparation for required licensing examinations and financial assistance for fees; and\n(7) assistance to international medical graduates in registering with the program's Minnesota international medical graduate roster.\n(a) The commissioner shall award grants to support clinical preparation for Minnesota international medical graduates needing additional clinical preparation or experience to qualify for residency. The grant program shall include:\n(1) proposed training curricula;\n(2) associated policies and procedures for clinical training sites, which must be part of existing clinical medical education programs in Minnesota; and\n(3) monthly stipends for international medical graduate participants. Priority shall be given to primary care sites in rural or underserved areas of the state, and international medical graduate participants must commit to serving at least five years in a rural or underserved community of the state.\n(b) The policies and procedures for the clinical preparation grants must be developed by December 31, 2015, including an implementation schedule that begins awarding grants to clinical preparation programs beginning in June of 2016.\n(a) The commissioner shall award grants to support primary care residency positions designated for Minnesota immigrant physicians who are willing to serve in rural or underserved areas of the state. No grant shall exceed $150,000 per residency position per year. Eligible primary care residency grant recipients include accredited family medicine, general surgery, internal medicine, obstetrics and gynecology, psychiatry, and pediatric residency programs. Eligible primary care residency programs shall apply to the commissioner. Applications must include the number of anticipated residents to be funded using grant funds and a budget. Notwithstanding any law to the contrary, funds awarded to grantees in a grant agreement do not lapse until the grant agreement expires. Before any funds are distributed, a grant recipient shall provide the commissioner with the following:\n(1) a copy of the signed contract between the primary care residency program and the participating international medical graduate;\n(2) certification that the participating international medical graduate has lived in Minnesota for at least two years and is certified by the Educational Commission on Foreign Medical Graduates. Residency programs may also require that participating international medical graduates hold a Minnesota certificate of clinical readiness for residency, once the certificates become available; and\n(3) verification that the participating international medical graduate has executed a participant agreement pursuant to paragraph (b).\n(b) Upon acceptance by a participating residency program, international medical graduates shall enter into an agreement with the commissioner to provide primary care for at least five years in a rural or underserved area of Minnesota after graduating from the residency program and make payments to the revolving international medical graduate residency account for five years beginning in their second year of postresidency employment. Participants shall pay $15,000 or ten percent of their annual compensation each year, whichever is less.\n(c) A revolving international medical graduate residency account is established as an account in the special revenue fund in the state treasury. The commissioner of management and budget shall credit to the account appropriations, payments, and transfers to the account. Earnings, such as interest, dividends, and any other earnings arising from fund assets, must be credited to the account. Funds in the account are appropriated annually to the commissioner to award grants and administer the grant program established in paragraph (a). Notwithstanding any law to the contrary, any funds deposited in the account do not expire. The commissioner may accept contributions to the account from private sector entities subject to the following provisions:\n(1) the contributing entity may not specify the recipient or recipients of any grant issued under this subdivision;\n(2) the commissioner shall make public the identity of any private contributor to the account, as well as the amount of the contribution provided; and\n(3) a contributing entity may not specify that the recipient or recipients of any funds use specific products or services, nor may the contributing entity imply that a contribution is an endorsement of any specific product or service.\nA hospital may establish residency programs for foreign-trained physicians to become candidates for licensure to practice medicine in the state of Minnesota. A hospital may partner with organizations, such as the New Americans Alliance for Development, to screen for and identify foreign-trained physicians eligible for a hospital's particular residency program.\nNothing in this section alters the authority of the Board of Medical Practice to regulate the practice of medicine.\nThe commissioner shall administer the international medical graduates assistance program, including the grant programs described under subdivisions 4, 5, and 6, in consultation with representatives of the following sectors:\n(1) state agencies:\n(i) Board of Medical Practice;\n(ii) Office of Higher Education; and\n(iii) Department of Employment and Economic Development;\n(2) health care industry:\n(i) a health care employer in a rural or underserved area of Minnesota;\n(ii) a health plan company;\n(iii) the Minnesota Medical Association;\n(iv) licensed physicians experienced in working with international medical graduates; and\n(v) the Minnesota Academy of Physician Assistants;\n(3) community-based organizations:\n(i) organizations serving immigrant and refugee communities of Minnesota;\n(ii) organizations serving the international medical graduate community, such as the New Americans Alliance for Development and Women's Initiative for Self Empowerment; and\n(iii) the Minnesota Association of Community Health Centers;\n(4) higher education:\n(i) University of Minnesota;\n(ii) Mayo Clinic School of Health Professions;\n(iii) graduate medical education programs not located at the University of Minnesota or Mayo Clinic School of Health Professions; and\n(iv) Minnesota physician assistant education programs; and\n(5) two international medical graduates.\nMS 2020 [Repealed, 2022 c 98 art 14 s 33]",
	"repealed": false
}