{
	"id": "256B.073",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.073",
	"title": "256B.073 ELECTRONIC VISIT VERIFICATION.",
	"text": "The commissioner of human services shall establish implementation requirements and standards for electronic visit verification to comply with the 21st Century Cures Act, Public Law 114-255. Within available appropriations, the commissioner shall take steps to comply with the electronic visit verification requirements in the 21st Century Cures Act, Public Law 114-255.\n(a) For purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Electronic visit verification\" means the electronic documentation of the:\n(1) type of service performed;\n(2) individual receiving the service;\n(3) date of the service;\n(4) location of the service delivery;\n(5) individual providing the service; and\n(6) time the service begins and ends.\n(c) \"Electronic visit verification system\" means a system that provides electronic verification of services that complies with the 21st Century Cures Act, Public Law 114-255, and the requirements of subdivision 3.\n(d) \"Service\" means one of the following:\n(1) personal care assistance services as defined in section 256B.0625, subdivision 19a, and provided according to section 256B.0659;\n(2) community first services and supports under section 256B.85;\n(3) home health services under section 256B.0625, subdivision 6a; or\n(4) other medical supplies and equipment or home and community-based services that are required to be electronically verified by the 21st Century Cures Act, Public Law 114-255.\n(a) In developing implementation requirements for electronic visit verification, the commissioner shall ensure that the requirements:\n(1) are minimally administratively and financially burdensome to a provider;\n(2) are minimally burdensome to the service recipient and the least disruptive to the service recipient in receiving and maintaining allowed services;\n(3) consider existing best practices and use of electronic visit verification;\n(4) are conducted according to all state and federal laws;\n(5) are effective methods for preventing fraud when balanced against the requirements of clauses (1) and (2); and\n(6) are consistent with the Department of Human Services' policies related to covered services, flexibility of service use, and quality assurance.\n(b) The commissioner shall make training available to providers on the electronic visit verification system requirements.\n(c) The commissioner shall establish baseline measurements related to preventing fraud and establish measures to determine the effect of electronic visit verification requirements on program integrity.\n(d) The commissioner shall make a state-selected electronic visit verification system available to providers of services.\n(e) The commissioner shall make available and publish on the agency website the name and contact information for the vendor of the state-selected electronic visit verification system and the other vendors that offer alternative electronic visit verification systems. The information provided must state that the state-selected electronic visit verification system is offered at no cost to the provider of services and that the provider may choose an alternative system that may be at a cost to the provider.\n(a) A provider of services may select any electronic visit verification system that meets the requirements established by the commissioner.\n(b) All electronic visit verification systems used by providers to comply with the requirements established by the commissioner must provide data to the commissioner in a format and at a frequency to be established by the commissioner.\n(c) Providers must implement the electronic visit verification systems required under this section by a date established by the commissioner to be set after the state-selected electronic visit verification systems for personal care services and home health services are in production. For purposes of this paragraph, \"personal care services\" and \"home health services\" have the meanings given in United States Code, title 42, section 1396b(l)(5). Reimbursement rates for providers must not be reduced as a result of federal action to reduce the federal medical assistance percentage under the 21st Century Cures Act, Public Law 114-255.\n(a) The vendor of the electronic visit verification system selected by the commissioner and the vendor's affiliate must comply with the requirements of this subdivision.\n(b) The vendor of the state-selected electronic visit verification system and the vendor's affiliate must:\n(1) notify the provider of services that the provider may choose the state-selected electronic visit verification system at no cost to the provider;\n(2) offer the state-selected electronic visit verification system to the provider of services prior to offering any fee-based electronic visit verification system;\n(3) notify the provider of services that the provider may choose any fee-based electronic visit verification system prior to offering the vendor's or its affiliate's fee-based electronic visit verification system; and\n(4) when offering the state-selected electronic visit verification system, clearly differentiate between the state-selected electronic visit verification system and the vendor's or its affiliate's alternative fee-based system.\n(c) The vendor of the state-selected electronic visit verification system and the vendor's affiliate must not use state data that are not available to other vendors of electronic visit verification systems to promote or sell the vendor's or its affiliate's alternative electronic visit verification system.\n(d) Upon request from the provider, the vendor of the state-selected electronic visit verification system must provide proof of compliance with the requirements of paragraph (b).\n(e) An agreement between the vendor of the state-selected electronic visit verification system or its affiliate and a provider of services for an electronic visit verification system that is not the state-selected system entered into on or after July 1, 2023, is subject to immediate termination by the provider if the vendor violates any of the requirements of paragraph (b).",
	"repealed": false
}