{
	"id": "103B.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.205",
	"title": "103B.205 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 103B.211 to 103B.255.\n\"Board\" means the Board of Water and Soil Resources unless the context indicates otherwise.\n\"Capital improvement program\" means an itemized program for at least a five-year prospective period, and any amendments to it, subject to at least biennial review, setting forth the schedule, timing, and details of specific contemplated capital improvements by year, together with their estimated cost, the need for each improvement, financial sources, and the financial effect that the improvements will have on the local government unit or watershed management organization.\n\"Groundwater plan\" means a county plan adopted under section 103B.255.\n\"Groundwater system\" means one of the 14 principal aquifers of the state as defined by the United States Geological Survey in the Water-Resources Investigations 81-51, entitled \"Designation of Principal Water-Supply Aquifers in Minnesota\" (August 1981), and its revisions.\n\"Local comprehensive plan\" has the meaning given it in section 473.852, subdivision 5.\n\"Local government unit\" or \"local unit\" has the meaning given it in section 473.852.\n\"Metropolitan area\" has the meaning given in section 473.121, subdivision 2.\n\"Minor watershed units\" means the drainage areas identified and delineated as such pursuant to Laws 1977, chapter 455, section 33, subdivision 7, paragraph (a).\n\"Official controls\" has the meaning given it in section 473.852.\n\"State review agencies\" means the commissioners of natural resources, the Pollution Control Agency, agriculture, and health.\n\"Subwatershed unit\" means a hydrologic area less than the entire area under the jurisdiction of a watershed management organization.\n\"Watershed\" means a drainage area having boundaries which are substantially coterminous with those of an aggregation of contiguous minor watershed units possessing similar drainage patterns and which cross the borders of two or more local government units.\n\"Watershed district\" means a district established under chapter 103D.\n\"Watershed management organization\" or \"organization\" means a watershed district wholly within the metropolitan area or a joint powers entity established wholly or partly within the metropolitan area by special law or by agreement that performs some or all of the functions of a watershed district for a watershed and that has the characteristics and the authority specified under section 103B.211. Lake improvement or conservation districts are not watershed management organizations.",
	"repealed": false
}