{
	"id": "524.5-317",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-317",
	"title": "524.5-317 TERMINATION OR MODIFICATION OF GUARDIANSHIP; COURT ORDERS.",
	"text": "(a) A guardianship terminates upon the death of the person subject to guardianship, upon the expiration of the duration of guardianship established in the order appointing the guardian, or upon order of the court.\n(b) On petition of any person interested in the welfare of the person subject to guardianship the court may terminate a guardianship if the person subject to guardianship no longer needs the assistance or protection of a guardian. The court may modify the type of appointment or powers granted to the guardian if the extent of protection or assistance previously granted is currently excessive or insufficient or the capacity of the person subject to guardianship to provide for support, care, education, health, and welfare has so changed as to warrant that action. The court may make any other order that is in the best interests of the person subject to guardianship or may grant other appropriate relief.\n(c) Except as otherwise ordered by the court for good cause, the court, before terminating a guardianship, shall follow the same procedures to safeguard the rights of the person subject to guardianship as apply to a petition for guardianship. Upon presentation by the petitioner of evidence establishing a prima facie case for termination, the court shall order the termination and discharge the guardian unless it is proven that continuation of the guardianship is in the best interest of the person subject to guardianship.\n(d) Any documents or information disclosing or pertaining to health or financial information shall be filed as confidential documents, consistent with the bill of particulars under section 524.5-121.\n(e) A guardian has the right to petition the court for discharge from the guardianship.\n(f) If, after a good faith effort, the guardian is unable to find a successor guardian, the guardian may petition the court for resignation. The court may allow the guardian to resign if the resignation would not result in imminent substantial harm to the person subject to guardianship based on clear and convincing evidence.",
	"repealed": false
}