{
	"id": "429.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/429.061",
	"title": "429.061 ASSESSMENT PROCEDURE.",
	"text": "At any time after the expense incurred or to be incurred in making an improvement shall be calculated under the direction of the council, the council shall determine by resolution the amount of the total expense the municipality will pay, other than the amount, if any, which it will pay as a property owner, and the amount to be assessed. If a county proposes to assess within the boundaries of a city for a county state-aid highway or county highway, including curbs, gutters, and storm sewers, the resolution must include the portion of the cost proposed to be assessed within the city. The county shall forward the resolution to the city and it may not proceed with the assessment procedure nor may the county allocate any cost under this section for property within the city unless the city council adopts the resolution approving the assessment. Thereupon the clerk, with the assistance of the engineer or other qualified person selected by the council, shall calculate the proper amount to be specially assessed for the improvement against every assessable lot, piece or parcel of land, without regard to cash valuation, in accordance with the provisions of section 429.051. The proposed assessment roll shall be filed with the clerk and be open to public inspection. The clerk shall thereupon, under the council's direction, publish notice that the council will meet to consider the proposed assessment. Such notice shall be published in the newspaper at least once and shall be mailed to the owner of each parcel described in the assessment roll. For the purpose of giving mailed notice under this subdivision, owners shall be those shown to be such on the records of the county auditor or, in any county where tax statements are mailed by the county treasurer, on the records of the county treasurer; but other appropriate records may be used for this purpose. Such publication and mailing shall be no less than two weeks prior to such meeting of the council. Except as to the owners of tax-exempt property or property taxes on a gross earnings basis, every property owner whose name does not appear on the records of the county auditor or the county treasurer shall be deemed to have waived such mailed notice unless the owner has requested in writing that the county auditor or county treasurer, as the case may be, include the name on the records for such purpose. Such notice shall state the date, time, and place of such meeting, the general nature of the improvement, the area proposed to be assessed, the total amount of the proposed assessment, that the proposed assessment roll is on the file with the clerk, and that written or oral objections thereto by any property owner will be considered. The notice must also state that no appeal may be taken as to the amount of any assessment adopted pursuant to subdivision 2, unless a written objection signed by the affected property owner is filed with the municipal clerk prior to the assessment hearing or presented to the presiding officer at the hearing. The notice shall also state that an owner may appeal an assessment to district court pursuant to section 429.081 by serving notice of the appeal upon the mayor or clerk of the municipality within 30 days after the adoption of the assessment and filing such notice with the district court within ten days after service upon the mayor or clerk. The notice shall also inform property owners of the provisions of sections 435.193 to 435.195 and the existence of any deferment procedure established pursuant thereto in the municipality. In addition, the notice mailed to the owner must state in clear language the following information:\n(1) the amount to be specially assessed against that particular lot, piece, or parcel of land;\n(2) adoption by the council of the proposed assessment may be taken at the hearing;\n(3) the right of the property owner to prepay the entire assessment and the person to whom prepayment must be made;\n(4) whether partial prepayment of the assessment has been authorized by ordinance;\n(5) the time within which prepayment may be made without the assessment of interest; and\n(6) the rate of interest to be accrued if the assessment is not prepaid within the required time period.\nAt such meeting or at any adjournment thereof the council shall hear and pass upon all objections to the proposed assessment, whether presented orally or in writing. The council may amend the proposed assessment as to any parcel and by resolution adopt the same as the special assessment against the lands named in the assessment roll. Notice of any adjournment of the hearing shall be adequate if the minutes of the meeting so adjourned show the time and place when and where the hearing is to be continued.\nThe council may consider any objection to the amount of a proposed assessment as to a specific parcel of land at an adjourned hearing upon further notice to the affected property owner as it deems advisable. At the adjourned hearing the council or a committee of it may hear further written or oral testimony on behalf of the objecting property owner and may consider further written or oral testimony from appropriate city officials and other witnesses as to the amount of the assessment. The council or committee shall prepare a record of the proceedings at the adjourned hearing and written findings as to the amount of the assessment. The amount of the assessment as finally determined by the council shall become a part of the adopted assessment roll. No appeal may be taken as to the amount of any assessment adopted under this section unless written objection signed by the affected property owner is filed with the municipal clerk prior to the assessment hearing or presented to the presiding officer at the hearing. All objections to the assessments not received at the assessment hearing in the manner prescribed by this subdivision are waived, unless the failure to object at the assessment hearing is due to a reasonable cause.\nIf the adopted assessment differs from the proposed assessment as to any particular lot, piece, or parcel of land, the clerk must mail to the owner a notice stating the amount of the adopted assessment. Owners must also be notified by mail of any changes adopted by the council in interest rates or prepayment requirements from those contained in the notice of the proposed assessment.\nThe assessment, with accruing interest, shall be a lien upon all private and public property included therein, from the date of the resolution adopting the assessment, concurrent with general taxes; but the lien shall not be enforceable against public property as long as it is publicly owned, and during such period the assessment shall be recoverable from the owner of such property only in the manner and to the extent provided in section 435.19. Unless otherwise provided in the resolution, all assessments shall be payable in equal annual installments extending over such period, not exceeding 30 years, as the resolution determines, payable on the first Monday in January in each year, but the number of installments need not be uniform for all assessments included in a single assessment roll if a uniform criterion for determining the number of installments is provided by the resolution. Assessments on property located in a targeted neighborhood as defined in Laws 1987, chapter 386, article 6, section 4, may be payable in variable annual installments if the resolution provides for a variable payment. The first installment of each assessment shall be included in the first tax rolls completed after its adoption and shall be payable in the same year as the taxes contained therein; except that the payment of the first installment of any assessment levied upon unimproved property may be deferred until a designated future year, or until the platting of the property or the construction of improvements thereon, upon such terms and conditions and based upon such standards and criteria as may be provided by resolution of the council. If special assessments against the property have been deferred pursuant to this subdivision, the governmental unit shall record with the county recorder in the county in which the property is located a certificate containing the legal description of the affected property and of the amount deferred. In any event, every assessment the payment of which is so deferred, when it becomes payable, shall be divided into a number of installments such that the last installment thereof will be payable not more than 30 years after the levy of the assessment. All assessments shall bear interest at such rate as the resolution determines. To the first installment of each assessment shall be added interest on the entire assessment from a date specified in the resolution levying the assessment, not earlier than the date of the resolution, until December 31 of the year in which the first installment is payable, and to each subsequent installment shall be added interest for one year on all unpaid installments; or alternatively, any assessment may be made payable in equal annual installments including principal and interest, each in the amount annually required to pay the principal over such period with interest at such rate as the resolution determines, not exceeding the maximum period and rate specified above. In the latter event no prepayment shall be accepted under subdivision 3 without payment of all installments due to and including December 31 of the year of prepayment, together with the original principal amount reduced only by the amounts of principal included in such installments, computed on an annual amortization basis. When payment of an assessment is deferred, as authorized in this subdivision, interest thereon for the period of deferment may be made payable annually at the same times as the principal installments of the assessment would have been payable if not deferred; or interest for this period may be added to the principal amount of the assessment when it becomes payable; or, if so provided in the resolution levying the assessment, interest thereon to December 31 of the year before the first installment is payable may be forgiven.\nAfter the adoption of the assessment, the clerk shall transmit a certified duplicate of the assessment roll with each installment, including interest, set forth separately to the county auditor of the county to be extended on the proper tax lists of the county; but in lieu of such certification, the council may in its discretion direct the clerk to file all assessment rolls in the clerk's office and to certify annually to the county auditor, on or before November 30 in each year, the total amount of installments of and interest on assessments on each parcel of land in the municipality which are to become due in the following year. If any installment and interest has not been so certified prior to the year when it is due, the clerk shall forthwith certify the same to the county auditor for collection in the then succeeding year; and if the municipality has issued improvement warrants to finance the improvement, it shall pay out of its general funds into the fund of the improvement interest on the then unpaid balance of the assessment for the year or years during which the collection of such installment is postponed. All assessments and interest thereon shall be collected and paid over in the same manner as other municipal taxes. The owner of any property so assessed may, at any time prior to certification of the assessment or the first installment thereof to the county auditor, pay the whole of the assessment on such property, with interest accrued to the date of payment, to the municipal treasurer, except that no interest shall be charged if the entire assessment is paid within 30 days from the adoption thereof; and, except as hereinafter provided, the owner may at any time prior to November 15 of any year, prepay to the treasurer of the municipality having levied said assessments, the whole assessment remaining due with interest accrued to December 31 of the year in which said prepayment is made. If the assessment roll is retained by the municipal clerk, the installment and interest in process of collection on the current tax list shall be paid to the county treasurer and the remaining principal balance of the assessment, if paid, shall be paid to the municipal treasurer. The council may by ordinance authorize the partial prepayment of assessments, in such manner as the ordinance may provide, prior to certification of the assessment or the first installment thereof to the county auditor.\nOn the confirmation of any assessments the clerk shall mail to the county auditor a notice specifying the amount payable by any county, to the clerk or recorder of any other political subdivision a notice specifying the amount payable by the political subdivision and to the owner of any right-of-way, at its principal office in the state, a notice specifying the amount payable on account of any right-of-way. The amount payable on account of any right-of-way or public property shall be payable to the municipality's treasurer and shall be payable in like installments and with like interest and penalties as provided for in reference to the installments payable on account of assessable real property, except that interest accruing shall not begin to run until the notice provided in this subdivision has been properly given and 30 days thereafter have elapsed. The governing body of any such political subdivision shall provide for the payment of these amounts and shall take appropriate action to that end. If the assessment is not paid in a single installment, the municipal treasurer shall annually mail to the owner of any right-of-way and, as long as the property is publicly owned, to the owner of any public property a notice stating that an installment is due and should be paid to the municipal treasurer of the municipality which levied the special assessment. The municipality may collect the amount due on account of the right-of-way of any railroad or privately owned public utility by distress and sale of personal property in the manner provided by law in case of taxes levied upon personal property or by suit brought to enforce the collection of this indebtedness unless a different method of collecting such amounts is provided for by any contract between the owner of any right-of-way and the municipality.\nNotwithstanding any general or special law to the contrary, a municipality shall pay to the county auditor all administrative expenses incurred by the county under subdivision 3 for each special assessment of any local improvement certified by the municipality to the county auditor.",
	"repealed": false
}