{
	"id": "125B.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/125B.26",
	"title": "125B.26 TELECOMMUNICATIONS/INTERNET ACCESS EQUITY AID.",
	"text": "(a) A district, charter school, or intermediate school district shall submit its actual telecommunications/Internet access costs for the previous fiscal year, adjusted for any e-rate revenue received, to the department by August 15 of each year as prescribed by the commissioner. Costs eligible for reimbursement under this program are limited to the following:\n(1) ongoing or recurring telecommunications/Internet access costs associated with Internet access, data lines, and video links providing:\n(i) the equivalent of one data line, video link, or integrated data/video link that relies on a transport medium that operates at a minimum speed of 1.544 megabytes per second (T1) for each elementary school, middle school, or high school under section 120A.05, subdivisions 9, 11, and 13, including the recurring telecommunications line lease costs and ongoing Internet access service fees; or\n(ii) the equivalent of one data line or video circuit, or integrated data/video link that relies on a transport medium that operates at a minimum speed of 1.544 megabytes per second (T1) for each district, including recurring telecommunications line lease costs and ongoing Internet access service fees;\n(2) recurring costs of contractual or vendor-provided maintenance on the school district's wide area network to the point of presence at the school building up to the router, codec, or other service delivery equipment located at the point of presence termination at the school or school district;\n(3) recurring costs of cooperative, shared arrangements for regional delivery of telecommunications/Internet access between school districts, postsecondary institutions, and public libraries including network gateways, peering points, regional network infrastructure, Internet2 access, and network support, maintenance, and coordination; and\n(4) service provider installation fees for installation of new telecommunications lines or increased bandwidth.\n(b) Costs not eligible for reimbursement under this program include:\n(1) recurring costs of school district staff providing network infrastructure support;\n(2) recurring costs associated with voice and standard telephone service;\n(3) costs associated with purchase of network hardware, telephones, computers, or other peripheral equipment needed to deliver telecommunications access to the school or school district;\n(4) costs associated with laying fiber for telecommunications access;\n(5) costs associated with wiring school or school district buildings;\n(6) costs associated with purchase, installation, or purchase and installation of Internet filtering; and\n(7) costs associated with digital content, including online learning or distance learning programming, and information databases.\nTo be eligible for aid under this section, a district, charter school, or intermediate school district is required to file an e-rate application either separately or through its telecommunications access cluster. Discounts received on telecommunications expenditures shall be reflected in the costs submitted to the department for aid under this section.\nThe commissioner shall develop criteria for approving costs submitted by organized school districts, charter schools, and intermediate school districts under subdivision 1.\nFor fiscal year 2006 and later, a district, charter school, or intermediate school district's Internet access equity aid equals the district, charter school, or intermediate school district's approved cost for the previous fiscal year according to subdivision 1 exceeding $16 times the district's adjusted pupil units for the previous fiscal year or no reduction if the district is part of an organized telecommunications access cluster. Equity aid must be distributed to the telecommunications access cluster for districts, charter schools, or intermediate school districts that are members of the cluster or to individual districts, charter schools, or intermediate school districts not part of a telecommunications access cluster.\n(a) Districts shall provide each year upon formal request by or on behalf of a nonpublic school, not including home schools, located in that district or area, ongoing or recurring telecommunications access services to the nonpublic school either through existing district providers or through separate providers.\n(b) The amount of district aid for telecommunications access services for each nonpublic school under this subdivision equals the lesser of:\n(1) 90 percent of the nonpublic school's approved cost for the previous fiscal year according to subdivision 1 exceeding $10 for fiscal year 2006 and later times the number of weighted pupils enrolled at the nonpublic school as of October 1 of the previous school year; or\n(2) the product of the district's aid per pupil unit according to subdivision 4 times the number of weighted pupils enrolled at the nonpublic school as of October 1 of the previous school year.\n(c) For purposes of this subdivision, nonpublic school pupils shall be weighted by grade level using the weighting factors defined in section 126C.05, subdivision 1.\n(d) Each year, a district providing services under paragraph (a) may claim up to five percent of the aid determined in paragraph (b) for costs of administering this subdivision. No district may expend an amount for these telecommunications access services which exceeds the amount allocated under this subdivision. The nonpublic school is responsible for the Internet access costs not covered by this section.\n(e) At the request of a nonpublic school, districts may allocate the amount determined in paragraph (b) directly to the nonpublic school to pay for or offset the nonpublic school's costs for telecommunications access services; however, the amount allocated directly to the nonpublic school may not exceed the actual amount of the school's ongoing or recurring telecommunications access costs.\nIf any portion of this section is found by a court to be unconstitutional, the remaining portions of the section shall remain in effect.",
	"repealed": false
}