{
	"id": "609.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.35",
	"title": "609.35 COSTS OF MEDICAL EXAMINATION.",
	"text": "(a) Costs incurred by a hospital or other emergency medical facility or by a physician, sexual assault nurse examiner, forensic nurse, or other licensed health care provider for the examination of a victim of criminal sexual conduct that occurred in the state shall be paid by the state. These costs include, but are not limited to, the cost of the medical forensic examination, associated tests and treatments relating to sexually transmitted infection, and pregnancy status, including emergency contraception. A hospital, emergency medical facility, or health care provider shall submit the costs for examination and any associated tests and treatment to the Office of Justice Programs for payment. Upon receipt of the costs, the commissioner shall provide payment to the facility or health care provider. Reimbursement for an examination and any associated test and treatments shall not exceed $1,400. Beginning on January 1, 2024, the maximum amount of an award shall be adjusted annually by the inflation rate.\n(b) Nothing in this section shall be construed to limit the duties, responsibilities, or liabilities of any insurer, whether public or private. The hospital or other licensed health care provider performing the examination may seek insurance reimbursement from the victim's insurer only if authorized by the victim. This authorization may only be sought after the examination is performed. When seeking this authorization, the hospital or other licensed health care provider shall inform the victim that if the victim does not authorize this, the state is required by law to pay for the examination and that the victim is in no way liable for these costs or obligated to authorize the reimbursement.\n(c) The applicability of this section does not depend upon whether the victim reports the offense to law enforcement or the existence or status of any investigation or prosecution.\n(d) Requests for reimbursement and supporting documents are private data on individuals as defined in section 13.02, subdivision 12.",
	"repealed": false
}