{
	"id": "181.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.145",
	"title": "181.145 PROMPT PAYMENT OF COMMISSIONS TO COMMISSION SALESPEOPLE.",
	"text": "For the purposes of this section, \"commission salesperson\" means a person who is paid on the basis of commissions for sales and who is not covered by sections 181.13 and 181.14 because the person is an independent contractor. For the purposes of this section, the phrase \"commissions earned through the last day of employment\" means commissions due for services or merchandise which have actually been delivered to and accepted by the customer by the final day of the salesperson's employment.\n(a) When any person, firm, company, association, or corporation employing a commission salesperson in this state terminates the salesperson, or when the salesperson resigns that position, the employer shall promptly pay the salesperson, at the usual place of payment, commissions earned through the last day of employment or be liable to the salesperson for the penalty provided under subdivision 3 in addition to any earned commissions unless the employee requests that the commissions be sent to the employee through the mails. If, in accordance with a request by the employee, the employee's commissions are sent to the employee through the mail, the commissions shall be deemed to have been paid as of the date of their postmark for the purposes of this section.\n(b) If the employer terminates the salesperson or if the salesperson resigns giving at least five days' written notice, the employer shall pay the salesperson's commissions earned through the last day of employment on demand no later than three working days after the salesperson's last day of work.\n(c) If the salesperson resigns without giving at least five days' written notice, the employer shall pay the salesperson's commissions earned through the last day of employment on demand no later than six working days after the salesperson's last day of work.\n(d) Notwithstanding the provisions of paragraphs (b) and (c), if the terminated or resigning salesperson was, during employment, entrusted with the collection, disbursement, or handling of money or property, the employer has ten working days after the termination of employment to audit and adjust the accounts of the salesperson before the salesperson can demand commissions earned through the last day of employment. In such cases, the penalty provided in subdivision 3 shall apply only from the date of demand made after the expiration of the ten working day audit period.\nIf the employer fails to pay the salesperson commissions earned through the last day of employment on demand within the applicable period as provided under subdivision 2, the employer shall be liable to the salesperson, in addition to earned commissions, for a penalty for each day, not exceeding 15 days, which the employer is late in making full payment or satisfactory settlement to the salesperson for the commissions earned through the last day of employment. The daily penalty shall be in an amount equal to 1/15 of the salesperson's commissions earned through the last day of employment which are still unpaid at the time that the penalty will be assessed.\n(a) When there is a dispute concerning the amount of the salesperson's commissions earned through the last day of employment or whether the employer has properly audited and adjusted the salesperson's account, the penalty provided in subdivision 3 shall not apply if the employer pays the amount it in good faith believes is owed the salesperson for commissions earned through the last day of employment within the applicable period as provided under subdivision 2; except that, if the dispute is later adjudicated and it is determined that the salesperson's commissions earned through the last day of employment were greater than the amount paid by the employer, the penalty provided in subdivision 3 shall apply.\n(b) If a dispute under this subdivision is later adjudicated and it is determined that the salesperson was not promptly paid commissions earned through the last day of employment as provided under subdivision 2, the employer shall pay reasonable attorney's fees incurred by the salesperson.\nNothing in this section shall be construed to impair a commission salesperson from collecting commissions on merchandise ordered prior to the last day of employment but delivered and accepted after termination of employment. However, the penalties prescribed in subdivision 3 apply only with respect to the payment of commissions earned through the last day of employment.",
	"repealed": false
}