{
	"id": "349.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.18",
	"title": "349.18 PREMISES USED FOR GAMBLING.",
	"text": "(a) An organization may conduct lawful gambling only on premises it owns or leases. Leases must be on a form prescribed by the board. The term of the lease is concurrent with the premises permit. Leases approved by the board must specify that the board may authorize an organization to withhold rent from a lessor for a period of up to 90 days if the board determines that illegal gambling occurred on the premises or that the lessor or its employees participated in the illegal gambling or knew of the gambling and did not take prompt action to stop the gambling. The lease must authorize the continued tenancy of the organization without the payment of rent during the time period determined by the board under this paragraph. Copies of all leases must be made available to employees of the board and the Division of Alcohol and Gambling Enforcement on request.\n(b) Rent paid by an organization for leased premises for the conduct of lawful gambling is subject to the following limits and restrictions:\n(1) For booth operations, monthly rent may not exceed ten percent of gross profits for that month. Total rent paid to a lessor from all organizations from leases governed by this clause may not exceed $1,750 per month.\n(2) For bar operations, monthly rent may not exceed:\n(i) 15 percent of the gross profits for that month from electronic pull-tab games and electronic linked bingo games; and\n(ii) more than 20 percent of gross profits from all other forms of lawful gambling.\n(3) For electronic linked bingo games and electronic pull-tab games that are operated for separate time periods within a business day by an organization and the lessor, monthly rent may not be more than:\n(i) 15 percent of the gross profits for that month for the time periods operated by the lessor. The lessor is responsible for cash shortages that occur during the time periods the games are operated by the lessor; and\n(ii) ten percent of gross profits for that month for the time periods operated by the organization. The organization is responsible for cash shortages that occur during the time periods the games are operated by the organization.\n(4) For bingo conducted at a leased premises where the primary business is bingo, rent is limited to either not more than ten percent of the monthly gross profit from all lawful gambling activities held during bingo occasions, excluding bar bingo or at a rate based on a cost per square foot not to exceed 110 percent of a comparable cost per square foot for leased space as approved by the director.\n(5) No rent may be paid for bar bingo as defined in section 349.12, subdivision 3c.\n(6) A lease not governed by clauses (1) to (5) must be approved by the director before becoming effective.\n(c) Amounts paid as rent under leases are all-inclusive. No other services or expenses provided or contracted by the lessor may be paid by the organization, including, but not limited to, trash removal, janitorial and cleaning services, snow removal, lawn services, electricity, heat, security, security monitoring, storage, and other utilities or services, unless approved by the director. The lessor shall be responsible for the cost of any communications network or service required to conduct electronic pull-tab games or electronic bingo games. Any other expenditure made by an organization that is related to a leased premises must be approved by the director. For bar operations, the lessor is responsible for cash shortages. An organization may not provide any compensation or thing of value to a lessor or the lessor's employees from any fund source other than its gambling account. Rent payments may not be made to an individual.\n(d) Notwithstanding paragraph (b), an organization may pay a lessor for food or beverages or meeting room rental if the charge made is comparable to similar charges made to other individuals or groups.\n(e) A licensed organization may not conduct any activity on behalf of the lessor on a leased premises.\n(a) Gambling equipment owned by or in the possession of an organization must be kept at a permitted premises owned or leased by the organization, or at other storage sites within the state that the organization has notified the board are being used as gambling equipment storage sites. At each storage site or permitted premises, the organization must have the invoices or true and correct copies of the invoices for the purchase of all gambling equipment at the site or premises. Gambling equipment owned by an organization may not be kept at a distributor's office, warehouse, storage unit, or other place of the distributor's business.\n(b) Gambling equipment, other than devices for selecting bingo numbers, owned by an organization must be secured and kept separate from gambling equipment owned by other persons, organizations, distributors, or manufacturers.\n(c) Paddlewheels must be covered or disabled when not in use by the organization in the conduct of lawful gambling.\n(d) Gambling equipment kept in violation of this subdivision is contraband under section 349.2125.\n(e) An organization may transport gambling equipment it owns or possesses between approved gambling equipment storage sites and to and from licensed distributors, if the invoices or true and correct copies of the invoices for the organization's acquisition of the gambling equipment accompany the gambling equipment at all times and are available for inspection.\nMS 2008 [Repealed, 2009 c 124 s 60]\nMS 2008 [Repealed, 2009 c 124 s 60]\n(a) An organization may not pay rent to itself or to any of its affiliates for use of space for conducting lawful gambling.\n(b) An organization may not pay rent for space for conducting lawful gambling from any account or fund other than the organization's separate gambling account.\nAn organization may not enter into or be a party to a lending agreement under which any of the organization's receipts from lawful gambling are pledged as collateral for a loan.",
	"repealed": false
}