{
	"id": "161.3420",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.3420",
	"title": "161.3420 DESIGN-BUILD RFQ; SELECTION TEAM; EVALUATION.",
	"text": "If the commissioner determines that the design-build best-value method of project delivery is appropriate for a project, the commissioner shall establish a two-phase procedure for awarding the design-build contract, as described in this subdivision and section 161.3422.\nDuring the phase-one request for qualifications (RFQ) and before solicitation, the commissioner shall appoint a Technical Review Committee of at least five individuals. The Technical Review Committee must include an individual whose name and qualifications are submitted to the commissioner by the Minnesota chapter of the Associated General Contractors, after consultation with other commercial contractor associations in the state. Members of the Technical Review Committee who are not state employees are subject to the Minnesota Government Data Practices Act and section 16C.06 to the same extent that state agencies are subject to those provisions. A Technical Review Committee member may not participate in the review or discussion of responses to an RFQ or request for proposals (RFP) when the member has a financial interest in any of the design-build firms that respond to that RFQ or RFP. \"Financial interest\" includes, but is not limited to, being or serving as an owner, employee, partner, limited liability partner, shareholder, joint venturer, family member, officer, or director of a design-build firm responding to an RFQ or RFP for a specific project, or having any other economic interest in that design-build firm. The members of the Technical Review Committee must be treated as state employees in the event of litigation resulting from any action arising out of their service on the committee.\nThe commissioner shall prepare or have prepared an RFQ. The RFQ must include the following:\n(1) the minimum qualifications of design-builders necessary to meet the requirements for acceptance;\n(2) a scope of work statement and schedule;\n(3) documents defining the project requirements;\n(4) the form of contract to be awarded;\n(5) the weighted selection criteria for compiling a short list and the number of firms to be included in the short list, which must be at least two but not more than five;\n(6) a description of the request for proposals (RFP) requirements;\n(7) the maximum time allowed for design and construction;\n(8) the commissioner's estimated cost of design and construction;\n(9) requirements for construction experience, design experience, financial, personnel, and equipment resources available from potential design-builders for the project and experience in other design-build transportation projects or similar projects, provided that these requirements may not unduly restrict competition; and\n(10) a statement that \"past performance\" or \"experience\" does not include the exercise or assertion of a person's legal rights.\nThe selection team shall evaluate the design-build qualifications of responding firms and shall compile a short list of no more than five most highly qualified firms in accordance with qualifications criteria described in the request for qualifications (RFQ). If only one design-build firm responds to the RFQ or remains on the short list, the commissioner may readvertise or cancel the project as the commissioner deems necessary.",
	"repealed": false
}