{
	"id": "144A.4799",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.4799",
	"title": "144A.4799 DEPARTMENT OF HEALTH LICENSED HOME CARE PROVIDER ADVISORY COUNCIL.",
	"text": "The commissioner of health shall appoint 13 persons to a home care and assisted living program advisory council consisting of the following:\n(1) two public members as defined in section 214.02 who shall be persons who are currently receiving home care services, persons who have received home care services within five years of the application date, persons who have family members receiving home care services, or persons who have family members who have received home care services within five years of the application date;\n(2) two Minnesota home care licensees representing basic and comprehensive levels of licensure who may be a managerial official, an administrator, a supervising registered nurse, or an unlicensed personnel performing home care tasks;\n(3) one member representing the Minnesota Board of Nursing;\n(4) one member representing the Office of Ombudsman for Long-Term Care;\n(5) one member representing the Office of Ombudsman for Mental Health and Developmental Disabilities;\n(6) beginning July 1, 2021, one member of a county health and human services or county adult protection office;\n(7) two Minnesota assisted living facility licensees representing assisted living facilities and assisted living facilities with dementia care levels of licensure who may be the facility's assisted living director, managerial official, or clinical nurse supervisor;\n(8) one organization representing long-term care providers, home care providers, and assisted living providers in Minnesota; and\n(9) two public members as defined in section 214.02. One public member shall be a person who either is or has been a resident in an assisted living facility and one public member shall be a person who has or had a family member living in an assisted living facility setting.\nThe advisory council shall be organized and administered under section 15.059 with per diems and costs paid within the limits of available appropriations. Meetings will be held quarterly and hosted by the department. Subcommittees may be developed as necessary by the commissioner. Advisory council meetings are subject to the Open Meeting Law under chapter 13D.\n(a) At the commissioner's request, the advisory council shall provide advice regarding regulations of Department of Health licensed assisted living and home care providers in this chapter, including advice on the following:\n(1) community standards for home care practices;\n(2) enforcement of licensing standards and whether certain disciplinary actions are appropriate;\n(3) ways of distributing information to licensees and consumers of home care and assisted living services defined under chapter 144G;\n(4) training standards;\n(5) identifying emerging issues and opportunities in home care and assisted living services defined under chapter 144G;\n(6) identifying the use of technology in home and telehealth capabilities;\n(7) allowable home care licensing modifications and exemptions, including a method for an integrated license with an existing license for rural licensed nursing homes to provide limited home care services in an adjacent independent living apartment building owned by the licensed nursing home; and\n(8) recommendations for studies using the data in section 62U.04, subdivision 4, including but not limited to studies concerning costs related to dementia and chronic disease among an elderly population over 60 and additional long-term care costs, as described in section 62U.10, subdivision 6.\n(b) The advisory council shall perform other duties as directed by the commissioner.\n(c) The advisory council shall annually make recommendations to the commissioner for the purposes in section 144A.474, subdivision 11, paragraph (i). The recommendations shall address ways the commissioner may improve protection of the public under existing statutes and laws and include but are not limited to projects that create and administer training of licensees and their employees to improve residents' lives, supporting ways that licensees can improve and enhance quality care and ways to provide technical assistance to licensees to improve compliance; information technology and data projects that analyze and communicate information about trends of violations or lead to ways of improving client care; communications strategies to licensees and the public; and other projects or pilots that benefit clients, families, and the public.",
	"repealed": false
}