{
	"id": "3C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/3C.08",
	"title": "3C.08 MINNESOTA STATUTES; CONTENTS.",
	"text": "The revisor's office shall publish editions of Minnesota Statutes. Minnesota Statutes must contain the Constitution of the United States, the Constitution of Minnesota, all general and permanent statutes in force, an alphabetical index, a table of permanent local laws, rules of the supreme court, rules of the district court, rules of other courts, rules applicable to the courts generally, and any other information the revisor considers desirable and practicable.\nThe decimal system of numbering of sections contained in Minnesota Statutes 1945 must be continued in all future editions of Minnesota Statutes, except that alphabetical letters may be used in addition to the decimal numbers. Chapters and sections of Minnesota Statutes retain the numbers and titles given them in Minnesota Revised Statutes until changed by the revisor or by statute.\nThe headnotes of the sections of any edition of the Minnesota Statutes printed in boldface type are mere catchwords to indicate the contents of the section and are not any part of the statute.\nAs soon as possible after a session of the legislature has adjourned, the revisor's office shall incorporate into the text of Minnesota Statutes the permanent general laws enacted and the amendments made to the statutes at that session and at any extra session of the legislature. The office shall also omit any sections expressly repealed. The office shall assign appropriate chapter and section numbers to these laws and shall arrange them in proper order. After each section the office shall place a source note indicating the chapter and section of the session law from which the section was derived.\nThe form and style of Minnesota Statutes may be changed as necessary to improve its quality and to permit the use of electronic data processing equipment, computer compatible media, and other related equipment in connection with its publication.",
	"repealed": false
}