{
	"id": "336A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/336A.08",
	"title": "336A.08 MASTER LIST.",
	"text": "(a) The secretary of state shall compile the information on effective financing statements in the computerized filing system into a master list:\n(1) organized according to farm product;\n(2) arranged within each product:\n(i) in alphabetical order according to the last name of the individual debtor or, in the case of debtors doing business other than as individuals, the first word in the name of the debtors;\n(ii) in numerical order according to the unique identifier assigned by the secretary of state to, and associated with, the Social Security number or tax identification number of the debtor;\n(iii) geographically by county; and\n(iv) by crop year;\n(3) containing the information provided on an effective financing statement; and\n(4) designating any applicable terminations of the effective financing statement.\n(b) The secretary of state shall compile information from lien notices recorded in the computerized filing system into a statutory lien master list in alphabetical order according to the last name of the individual debtor or, in the case of debtors doing business other than as individuals, the first word in the name of the debtors. The secretary of state may also organize the statutory lien master list according to one or more of the categories of information established in paragraph (a). Any terminations of lien notices must be noted.\nThe secretary of state shall remove lapsed effective financing statements and lien notices from the computerized filing system before preparing master lists.\n[Repealed, 2014 c 283 s 8]\nA registered buyer who requests a monthly list may ask for a list of all crops including wool, milk, eggs, cheese, and honey/bees wax, all livestock including wool, milk, eggs, cheese, and honey/bees wax, or both. The list given to the buyer must then include information about all the crops or all the livestock listed in subdivision 1, or both.\n(a) The secretary of state shall maintain and distribute the information on the effective financing statement master list to allow the buyer to sort:\n(1) by farm product arranged alphabetically by debtor;\n(2) by farm product arranged numerically by the unique identifier assigned by the secretary of state to, and associated with, the Social Security number or tax identification number of the debtor; and\n(3) by county arranged alphabetically by debtor.\n(b) Information in the farm products statutory lien master list must be included in the effective financing statement master list, subject to the sort options in paragraph (a), clauses (1) and (3).\n(c) The secretary of state shall distribute or make available the requested lists on a monthly basis to farm product dealers registered under section 336A.11. Lists will be distributed or made available on or before the tenth day of each month or on the next business day thereafter if the tenth day is not a business day.\n(d) The secretary of state shall make the lists available as written or printed paper documents and in an electronically transmitted medium.\n(e) There shall be no fee for lists distributed via an electronically transmitted medium. The annual fee for paper partial lists is $250 and $400 for paper master lists.\n(f) A farm products dealer shall register pursuant to section 336A.11 to receive the monthly lists requested by the farm products dealer starting with the lists created in the month following the month in which registration takes place.\n(g) If a registered farm products dealer receives a monthly list that cannot be read or is incomplete, the farm products dealer must immediately inform the secretary of state by telephone or email of the problem. The registered farm products dealer shall confirm the existence of the problem by writing to the secretary of state. The secretary of state shall provide the registered farm products dealer with new monthly lists in the medium chosen by the registered farm products dealer no later than five business days after receipt of the oral notice from the registered farm products dealer. A registered farm products dealer is not considered to have received notice of the information on the monthly lists until the duplicate list is received from the secretary of state or until five days have passed since the duplicate lists were deposited in the mail or delivered electronically by the secretary of state, whichever comes first.\n(h) On receipt of a written notice pursuant to section 336A.13, the secretary of state shall duplicate the monthly lists requested by the registered farm products dealer. The duplicate monthly lists must be deposited in the mail or delivered electronically to the registered farm products dealer no later than five business days after receipt of the written notice from the registered farm products dealer.\n(i) A registered farm products dealer may request monthly lists in one medium per registration.\n(j) Registered farm products dealers must renew their registration on or before the 12-month anniversary of their registration or subsequent 12-month anniversaries. Failure to renew will result in the farm products dealer not receiving the monthly lists.\n(k) Registered farm products dealers will receive all of the information for the monthly lists. New registrants shall receive monthly lists starting with the list created in the month following registration.\n[See Note.]",
	"repealed": false
}