{
	"id": "3.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.055",
	"title": "3.055 OPEN MEETINGS.",
	"text": "Meetings of the legislature shall be open to the public, including sessions of the senate, sessions of the house of representatives, joint sessions of the senate and the house of representatives, and meetings of a standing committee, committee division, subcommittee, conference committee, or legislative commission, but not including a caucus of the members of any of those bodies from the same house and political party nor a delegation of legislators representing a geographic area or political subdivision. For purposes of this section, a meeting occurs when a quorum is present and action is taken regarding a matter within the jurisdiction of the body. Each house shall provide by rule for posting notices of meetings, recording proceedings, and making the recordings and votes available to the public.\n(a) A meeting governed by this section may be conducted by interactive television so long as:\n(1) all members of the body participating in the meeting, wherever their physical location, can hear and see one another and can hear and see all discussion and testimony presented at any location at which at least one member is present;\n(2) members of the public present at the regular meeting location of the body can hear and see all discussion and testimony and all votes of members of the body; and\n(3) at least one member of the body is physically present at the regular meeting location.\n(b) Each member of a body participating in a meeting by interactive television is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(c) If interactive television is used to conduct a meeting, to the extent practical, a body shall allow a person to monitor the meeting electronically from a remote location. The body may require the person making such a connection to pay for documented marginal costs that the body incurs as a result of the additional connection.\n(d) House of representatives and senate rules governing notice of meetings must provide for giving notice that interactive television will be used to conduct a meeting.\nThe house of representatives and the senate shall adopt rules to implement this section. Remedies provided by rules of the house of representatives and senate are exclusive. No court or administrative agency has jurisdiction to enforce, enjoin, penalize, award damages, or otherwise act upon a violation or alleged violation of this section, to invalidate any provision of law because of a violation of this section, or to otherwise interpret this section.",
	"repealed": false
}