{
	"id": "340A.418",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.418",
	"title": "340A.418 ALCOHOLIC BEVERAGE TASTINGS.",
	"text": "For purposes of this section, an \"alcoholic beverage tasting\" or \"tasting\" means an event at which persons pay a fee or donation to participate, and are allowed to consume wine, malt liquor, or both, by the glass without paying a separate charge for each glass.\n(a) A charitable, religious, or other nonprofit organization may conduct a tasting of not more than four hours duration on premises the organization owns or leases or has use donated to it, or on the licensed premises of a holder of an on-sale intoxicating liquor license that is not a temporary license, if the organization holds a temporary on-sale intoxicating liquor license under section 340A.404, subdivision 10, and complies with this section. An organization holding a temporary license may be assisted in conducting the tasting by another nonprofit organization.\n(b) An organization that conducts a tasting under this section may use the net proceeds from the tasting only for:\n(1) the organization's primary nonprofit purpose; or\n(2) donation to another nonprofit organization assisting in the tasting, if the other nonprofit organization uses the donation only for that organization's primary nonprofit purpose.\n(c) No wine or malt liquor at a tasting under this section may be sold, or orders taken, for off-premises consumption.\n(d) Notwithstanding any other law, an organization may purchase or otherwise obtain wine or malt liquor for a tasting conducted under this section from a wholesaler licensed to sell wine or malt liquor, and the wholesaler may sell or give wine or malt liquor to an organization for a tasting conducted under this section and may provide personnel to assist in the tasting. A wholesaler who sells or gives wine or malt liquor to an organization for a tasting under this section must deliver the wine or malt liquor directly to the location where the tasting is conducted.\n(e) This section does not prohibit or restrict a tasting that is:\n(1) located on on-sale premises where no charitable organization is participating; or\n(2) located on on-sale premises where the proceeds are for a designated charity but where the tasting is primarily for educational purposes.\n(f) The four-hour limitation specified in paragraph (a) shall not apply to a tasting at a convention of fine wine, malt liquor, and gourmet food exhibitors, provided the convention has at least 100 exhibitors and takes place over not more than three days.",
	"repealed": false
}