{
	"id": "403.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.161",
	"title": "403.161 PREPAID WIRELESS FEES IMPOSED; COLLECTION; REMITTANCE.",
	"text": "(a) A prepaid wireless E911 fee of 80 cents per retail transaction is imposed on prepaid wireless telecommunications service until the fee is adjusted as an amount per retail transaction under subdivision 7.\n(b) A prepaid wireless telecommunications access Minnesota fee, in the amount of the monthly charge provided for in section 237.52, subdivision 2, is imposed on each retail transaction for prepaid wireless telecommunications service until the fee is adjusted as an amount per retail transaction under subdivision 7.\n(c) A prepaid wireless 988 fee, in the amount of the monthly charge provided for in section 145.561, subdivision 4, paragraph (b), is imposed on each retail transaction for prepaid wireless telecommunications service until the fee is adjusted as an amount per retail transaction under subdivision 7.\nThe fees established under subdivision 1 are not imposed on a minimal amount of prepaid wireless telecommunications service that is sold with a prepaid wireless device and is charged a single nonitemized price, and a seller may not apply the fees to such a transaction. For purposes of this subdivision, a minimal amount of service means an amount of service denominated as either ten minutes or less or $5 or less.\nThe prepaid wireless E911, telecommunications access Minnesota, and 988 fees must be collected by the seller from the consumer for each retail transaction occurring in this state. The amount of each fee must be combined into one amount, which must be separately stated on an invoice, receipt, or other similar document that is provided to the consumer by the seller.\nFor purposes of this section, a retail transaction conducted in person by a consumer at a business location of the seller must be treated as occurring in this state if that business location is in this state, and any other retail transaction must be treated as occurring in this state if the retail transaction is treated as occurring in this state for purposes of the sales and use tax as specified in section 297A.669, subdivision 3, paragraph (c).\nThe prepaid wireless E911, telecommunications access Minnesota, and 988 fees are the liability of the consumer and not of the seller or of any provider, except that the seller is liable to remit all fees as provided in section 403.162.\nThe combined amount of the prepaid wireless E911, telecommunications access Minnesota, and 988 fees collected by a seller from a consumer must not be included in the base for measuring any tax, fee, surcharge, or other charge that is imposed by this state, any political subdivision of this state, or any intergovernmental agency.\n(a) The prepaid wireless E911, telecommunications access Minnesota, and 988 fees must be proportionately increased or reduced upon any change to the fee imposed under section 403.11, subdivision 1, paragraph (c), the fee imposed under section 237.52, subdivision 2, or the fee imposed under section 145.561, subdivision 4, as applicable.\n(b) The department shall post notice of any fee changes on its website at least 30 days in advance of the effective date of the fee changes. It is the responsibility of sellers to monitor the department's website for notice of fee changes.\n(c) Fee changes are effective 60 days after the first day of the first calendar month after the commissioner of public safety or the Public Utilities Commission, as applicable, changes the fee.",
	"repealed": false
}