{
	"id": "504B.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.195",
	"title": "504B.195 DISCLOSURE REQUIRED FOR OUTSTANDING INSPECTION AND CONDEMNATION ORDERS.",
	"text": "(a) Except as provided in subdivision 3, a landlord, agent, or person acting under the landlord's direction or control shall provide a copy of all outstanding inspection orders for which a citation has been issued, pertaining to a rental unit or common area, specifying code violations issued under section 504B.185, that the housing inspector identifies as requiring notice because the violations threaten the health or safety of the tenant, and all outstanding condemnation orders and declarations that the premises are unfit for human habitation to:\n(1) a tenant, either by delivery or by United States mail, postage prepaid, within 72 hours after issuance of the citation;\n(2) a person before signing a lease or paying rent or a security deposit to begin a new tenancy; and\n(3) a person prior to obtaining new ownership of the property subject to the order or declaration. The housing inspector shall indicate on the inspection order whether the violation threatens the health or safety of a tenant or prospective tenant.\n(b) If an inspection order, for which a citation has been issued, does not involve code violations that threaten the health or safety of the tenants, the landlord, agent, or person acting under the landlord's control shall post a summary of the inspection order in a conspicuous place in each building affected by the inspection order, along with a notice that the inspection order will be made available by the landlord for review, upon a request of a tenant or prospective tenant. The landlord shall provide a copy of the inspection order for review by a tenant or a prospective tenant as required under this subdivision.\nIf the landlord, agent, or person acting under the landlord's direction or control violates this section, the tenant is entitled to remedies provided by section 8.31, subdivision 3a, and other equitable relief as determined by the court.\nA landlord, agent, or person acting under the landlord's direction or control is not in violation of this section if:\n(1) the landlord, agent, or person acting under the landlord's direction or control has received only an initial order to repair;\n(2) the time allowed to complete the repairs, including any extension of the deadline, has not yet expired, or less than 60 days has elapsed since the expiration date of repair orders and any extension or no citation has been issued; or\n(3) the landlord, agent, or person acting under the landlord's direction or control completes the repairs within the time given to repair, including any extension of the deadline.\nIt is an affirmative defense in an action brought under this section for the landlord, agent, or person acting under the landlord's control to prove that disclosure was made as required under subdivision 1.\nThe remedies provided in this section are in addition to and shall not limit other rights or remedies available to landlords and tenants. Any provision, whether oral or written, of any lease or other agreement, whereby any provision of this section is waived by a tenant, is contrary to public policy and void.",
	"repealed": false
}