{
	"id": "458D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.06",
	"title": "458D.06 SEWER SERVICE FUNCTION.",
	"text": "The board may, to the extent it deems proper and reasonable to implement its comprehensive plan, acquire, construct, better, equip, operate and maintain any or all interceptors and treatment works for the district, subject to the provisions of sections 458D.01 to 458D.24. A treatment works owned by a local government unit may be acquired or operated by the board to implement the comprehensive plan if any part of the treatment works is needed for such purpose.\nThe board may require any local government unit to transfer to the board, all of its right, title and interest in any interceptors or treatment works and all necessary appurtenances thereto owned by such local government unit which will be needed for the purpose stated in subdivision 1. Appropriate instruments of conveyance for all such property shall be executed and delivered to the board by the proper officers of each local government unit concerned. All persons regularly employed by a local government unit to operate and maintain any treatment works or interceptors so transferred to the board, on the date on which the transfer becomes effective, shall be employees of the board, and may at their option become members of the retirement system applicable to persons employed directly by the executive director or may continue as members of a public retirement association under chapter 422, or any other law, to which they belong before such date, and shall retain all pension rights which they may have under such latter laws, and all other rights to which they are entitled by contract or law. The board shall make the employer's contributions to pension funds of its employees. Such employees shall perform such duties as may be prescribed by the board.\nThe board, upon assuming ownership of any interceptors or treatment works pursuant to subdivision 2, shall become obligated to pay the local government unit such amounts at such times as will be necessary to pay when due all remaining principal of and interest on bonds issued by such local government unit for the acquisition or betterment of all such interceptors or treatment works taken over. The board shall also assume the same obligation with respect to so much of any other existing disposal system owned by a local government unit as the board determines to have been replaced or rendered useless by the district disposal system. The amounts to be paid under this subdivision may be offset against any amount to be paid to the board by the local government unit as provided in section 458D.09.\nUpon assuming ownership of any interceptor or treatment works as provided in subdivision 2, the board may give the local government unit or units which paid all or part of the costs of such facility, directly or pursuant to contracts for reimbursement of costs, a credit against amounts to be allocated to them under section 458D.09, which may be spread over such period not exceeding 30 years as the board shall determine, and an additional credit equal to interest on the unused credit balance from time to time at such rate as may be determined by the board but not to exceed five percent per annum. If the board determines to give such a credit, it shall be given with respect to all existing interceptors and treatment works over which the board assumes ownership. The amount of such credit shall equal the current value of the facility at the time the board acquires it computed by the board in the following manner. The original cost of the facility for purposes of such computation shall be the total actual costs of constructing it, including engineering, legal, and administrative costs, less (a) any part of the cost of such facility paid from state or federal grants, and (b) the principal amount of any bonds outstanding at the time of acquisition which were issued to finance its construction. The original cost shall be multiplied by a factor equal to a cost index current at the time of acquisition divided by the same cost index at the time of the construction, to determine replacement cost. The cost indices used shall be Engineering News Record Construction Cost Indices for facilities or parts thereof completed before 1930, and the United States Public Health Service Federal Water Pollution Control Values for Sewer and Treatment Plan Construction, as applied to facilities or parts thereof completed in or after 1930. The current value of the facility shall be the replacement cost depreciated by 2.50 percent per annum from the date of construction of treatment works and 1.25 percent per annum from the date of construction of interceptors; and decreased further by a reasonable allowance for obsolescence if the board determines that the facility or any part thereof will not be useful for board purposes for at least the remaining period required to depreciate it fully, assuming no salvage value. The current value of each such facility shall be credited to each local government unit in proportion to the amount of the construction costs paid by that unit, as determined by the board, taking into account reimbursements previously made under contracts between any of the local government units. The board shall prepare an itemized statement of the amount of credit each local government unit is given under this subdivision, and the years and amounts of installments of principal and interest thereon, and shall cause it to be mailed or delivered to the governing body of each local government unit concerned. The amount of the annual credits of principal and interest made under this subdivision to each local government unit shall be allocated as current costs in accordance with section 458D.09.\nThe board may terminate upon 60 days' mailed notice to the contracting parties, any existing contract between or among local government units requiring payments by a local government unit to any other local government unit, for the use of a disposal system, or as reimbursement of capital costs of such a disposal system, all or part of which will be needed to implement the board's comprehensive plan. All contracts between or among local government units for use of a disposal system entered into subsequent to July 8, 1971, shall be submitted to the board for approval as to those features affecting the board's responsibilities as determined by the board and shall not become effective until such approval is given.",
	"repealed": false
}