{
	"id": "221.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.84",
	"title": "221.84 LIMOUSINE.",
	"text": "\"Limousine service\" means a service that:\n(1) is not provided on a regular route;\n(2) is provided in a luxury passenger automobile that has a seating capacity of not more than 15 persons, including the driver;\n(3) provides only prearranged pickup; and\n(4) charges more than a taxicab fare for a comparable trip.\n(a) No person may operate a for-hire limousine service without a permit from the commissioner.\n(b) The commissioner shall adopt rules governing the issuance of permits for for-hire operation of limousines that include:\n(1) annual inspections of limousines;\n(2) driver qualifications, including requiring a criminal history check of drivers;\n(3) insurance requirements;\n(4) advertising regulation, including requiring a copy of the permit to be carried in the limousine and use of the words \"licensed and insured\";\n(5) provisions for agreements with political subdivisions for sharing enforcement costs;\n(6) issuance of temporary permits and temporary permit fees; and\n(7) other requirements deemed necessary by the commissioner.\n(c) This section does not apply to limousines operated by persons meeting the definition of private carrier in section 221.012, subdivision 35.\nThe commissioner may issue an order requiring violations of statutes, rules, and local ordinances governing operation of limousines to be corrected and assessing monetary penalties up to $1,000. The commissioner may suspend or revoke a permit for violation of applicable statutes and rules and, upon the request of a political subdivision, may immediately suspend a permit for multiple violations of local ordinances. The commissioner shall immediately suspend a permit for failure to maintain required insurance and shall not restore the permit until proof of insurance is provided. A person whose permit is revoked or suspended or who is assessed an administrative penalty may appeal the commissioner's action in a contested case proceeding under chapter 14.\n(a) The commissioner shall design a distinctive decal to be issued to permit holders under this section. Each decal is valid for one year from the date of issuance. No person may operate a limousine that provides limousine service unless the limousine has such a decal conspicuously displayed.\n(b) The fee for each decal is $80. The fee for each permit issued under this section is $150. The commissioner shall deposit all fees under this section in the trunk highway fund.",
	"repealed": false
}