{
	"id": "270C.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.57",
	"title": "270C.57 SUCCESSOR LIABILITY OF BUSINESSES.",
	"text": "(a) The following terms used in this section have the following meanings.\n(b) \"Successor\" means a person who directly or indirectly purchases, acquires, is gifted, or succeeds to the business or stock of goods of any person quitting, selling, or otherwise disposing of a business or stock of goods. Successor does not include a personal representative or beneficiary of an estate, a trustee in bankruptcy, a debtor in possession, a receiver, a secured party, a mortgagee, an assignee of rents, or any other lienholder.\n(c) \"Person\" means an individual, partnership, corporation, sole proprietorship, joint venture, limited liability company, or any other type of business entity or association.\n(d) \"Withhold\" means setting aside money or dealing with the payment of consideration in a manner that denies a transferring business the benefit of the transfer in an amount equal to the tax liability of the transferring business.\n(e) \"Purchase price\" means the consideration paid or to be paid for the transfer by the successor to the transferring business, and includes amounts paid for tangible property or intangibles such as leases, licenses, or goodwill. Purchase price also includes debts assumed or forgiven by the successor, or real or personal property conveyed or to be conveyed by the successor to the transferring business.\n(f) \"Arm's-length transaction\" means a transfer for adequate consideration between independent parties both acting in their own best interests. If the parties are related to each other, a rebuttable presumption arises that the transaction is not at arm's length.\n(g) \"Transfer\" means every mode, direct or indirect, absolute or conditional, voluntary or involuntary, of disposing of or parting with a business or an interest in a business, or a stock of goods, whether by gift or for consideration. Transfer includes a change in the type of business entity or the name of the business, where one business is discontinued and a new one started. Transfer also includes the acquisition by a new corporation of the assets of a prior business in exchange for the stock of the new corporation. Transfer does not include an assignment for the benefit of creditors, foreclosure or enforcement of a mortgage, assignment of rents, security interest or lien, sale or disposition in a bankruptcy proceeding, or sale or disposition by a receiver.\n(h) \"Transfer in bulk\" means a transfer, other than in the ordinary course of the transferor's trade or business, of more than one-half of all the property of a business at all locations combined, as measured by the value of the property at the time of the transfer.\n(i) For purposes of this section, \"tax\" means sales, withholding, and any tax imposed by chapter 296A.\n(a) Whenever a business transfers in bulk to a successor the business assets, and an enforceable lien for unpaid taxes has been filed against the business by the commissioner under section 270C.63, at least 20 days before taking possession of the assets or paying the purchase price, the successor shall notify the commissioner of the transfer and the terms and conditions related to it. The notice must include the tax identification number of the transferring business. If an agreement to transfer has been entered into, this notice requirement only applies: (1) if a lien described under this paragraph has been filed prior to the date of the agreement; or (2) if the date of the transfer is more than 30 days after the date of the agreement, and a lien described under this paragraph is filed at least 30 days prior to the date of transfer.\n(b) If the successor fails to give the notice required in paragraph (a), the successor is liable for any unpaid taxes, interest, and penalties due from the transferring business to the extent of the purchase price. If the successor provides the notice required in paragraph (a) and, within 20 days after receipt of the notice, the commissioner notifies the successor that tax liabilities exist in addition to those included on the lien or there are tax returns due but not filed, the successor is, in addition to being liable for the amounts included on the lien, liable for all other uncontested taxes, interest, and penalties as stated in the commissioner's notice from the transferring business to the extent of the purchase price if the successor pays the purchase price or takes possession of the assets without withholding and remitting the liability to the commissioner. The successor is liable whether the purchase price is paid or the assets are transferred prior to or after notification from the commissioner. The commissioner may also notify the successor that there are tax liabilities or tax returns due from the transferring business other than the liabilities included on the lien, and of the current balance due to satisfy the lien.\n(c) If, based upon the information available, the commissioner determines that a transfer was not at arm's length or was a gift, the successor's liability under this section equals the value of the assets transferred. For purposes of imposing the liability, the value of the property transferred is presumed, subject to rebuttal, to equal the unpaid taxes, interest, and penalties of the transferring business.\n(d) In the case of a gift resulting in successor liability under this section, return of the gifted property by the donee to the donor releases the donee's successor liability.\n(e) A successor who complies with the requirements of paragraphs (a) and (b) is not liable for any assessments of taxes of the transferring business made after the commissioner provides notice to the successor under paragraph (b), except for taxes assessed on returns filed to comply with the notice. If the commissioner fails to provide the notice and the 20-day period expires, the successor is not liable for any taxes of the transferring business other than those included on the lien.\nThe commissioner may assess liability against a successor business under this section within the time prescribed for collecting the underlying taxes, interest, and penalties. The assessment is presumed to be valid, and the burden is upon the successor to show it is incorrect or invalid. An order assessing successor liability is reviewable administratively under section 270C.35 and is appealable to Tax Court under chapter 271. The commissioner may abate an assessment if the successor's failure to give the notice required under this section is due to reasonable cause. The procedural and appeal provisions under section 270C.34 apply to abatement requests under this subdivision. Collection remedies available against the transferring business are available against the successor from the date of assessment of successor liability.\nNotification by the commissioner to the successor under subdivision 2, paragraph (b), that the transferring business owes taxes, interest, and penalties or has returns that are due, or that there are no outstanding liabilities or returns other than the liabilities included on the lien, or of the current balance due to satisfy the lien, is not a disclosure violation under chapter 270B.",
	"repealed": false
}