{
	"id": "93.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.17",
	"title": "93.17 APPLICATION FOR LEASES; BIDS; AWARDS.",
	"text": "(a) Applications for leases to prospect for iron ore shall be presented to the commissioner in writing in such form as the commissioner may prescribe at any time before 4:30 p.m., St. Paul, Minnesota time, on the last business day before the day specified for the opening of bids, and no bids submitted after that time shall be considered. The application shall be accompanied by a certified check, cashier's check, or bank money order payable to the Department of Natural Resources in the sum of $100 for each mining unit.\n(b) Each application shall be accompanied by a sealed bid setting forth the amount of royalty per gross ton of crude ore based upon the iron content of the ore when dried at 212 degrees Fahrenheit, in its natural condition or when concentrated, as set out in section 93.20, subdivisions 12 to 18, that the applicant proposes to pay to the state of Minnesota in case the lease shall be awarded.\n(a) Whenever a bid on any mining unit exceeds the minimums prescribed in section 93.20, the bidder shall offer a uniform amount above the minimums on all schedules unless the mining unit is expressly excepted from this requirement by the commissioner of natural resources by so specifying in the list of lands and mining units.\n(b) The envelope containing each bid shall be plainly marked on the outside showing the date of application, date received by the commissioner, and the name of the applicant. The commissioner shall endorse upon each application and sealed bid the exact time of presentation and preserve the same unopened in the commissioner's office.\n(a) At the time and place fixed for the sale, the commissioner shall publicly announce the number of applications and bids received. The commissioner shall then publicly open the bids and announce the amount of each bid separately. Thereafter, the commissioner, together with the Executive Council, shall award the leases to the highest bidders for the respective mining units, but no bids shall be accepted that do not equal or exceed the minimum amounts provided for in section 93.20, nor shall any bid be accepted that does not comply with the law. The right is reserved to the state to reject any and all bids.\n(b) All applications for leases and bids not accepted at the sale shall become void at the close of the sale and the payment accompanying the applications and bids shall be returned to the applicants entitled to them.\n(c) Upon the award of a lease, the payment submitted with the application as provided by subdivision 1 shall be deposited with the commissioner of management and budget as a fee for the lease.",
	"repealed": false
}