{
	"id": "367.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/367.31",
	"title": "367.31 ADOPTION OF SPECIFIC OPTION.",
	"text": "Except as provided in subdivision 2, the town board may, and upon a petition signed by electors equal in number to at least 15 percent of the electors voting at the last previous town election shall, submit to the electors at an annual town election the question of adopting option A, B, C, or D.\nThe town board of a town exercising the powers of a statutory city pursuant to section 368.01 or a special law granting substantially similar powers shall submit the adoption of option A to the electors at the annual town meeting next following June 3, 1975. The town board of any town that subsequently qualifies under section 368.01 or receives substantially similar powers pursuant to a special law adopted after June 3, 1975, shall submit the adoption of option A to the electors at the annual town election next following the grant of powers.\nWhen the adoption of a specific option is to be voted on at the annual election, the town clerk shall include notice of the question in the notice of the annual election.\nThe proposals for adoption of the options shall be stated on the ballot substantially as follows:\n\"Shall option A, providing for a five-member town board of supervisors, be adopted for the government of the town?\"\n\"Shall option B, providing for the appointment of the clerk and treasurer by the town board, be adopted for the government of the town?\"\n\"Shall option C, providing for the appointment of a town administrator by the town board, be adopted for the government of the town?\"\n\"Shall option D, providing for combining the offices of clerk and treasurer, be adopted for the government of the town?\"\nIf a proposal under option B is to appoint only the clerk or only the treasurer, or if it is to appoint the combined clerk-treasurer following the adoption of option D or when submitted simultaneously with the ballot question for option D, the ballot question shall be varied to read appropriately. If an option B ballot question is submitted for the combined clerk-treasurer office at the same election in which option D is also on the ballot, the ballot must note that the approval of option B is contingent on the simultaneous approval of option D. In any of these cases, the question shall be followed by the words \"Yes\" and \"No\" with an appropriate oval or similar target shape before each in which an elector may record a choice.\nIf a majority of the votes cast on the question of adoption of option A, B, C, or D is in the affirmative, the option voted upon shall be adopted in the town. It shall remain in effect until abandoned by a similar majority at a subsequent annual town election at which the question of abandonment is submitted.\nAt any time more than three years after the adoption of an option, the question of its abandonment may be submitted to the electors, in the same manner provided for the submission of the question of adoption, except that in the statement of the question on the ballot, the word \"abandoned\" shall be substituted for the word \"adopted.\" If a majority of the votes cast on the question is in favor of abandonment, the plan shall be abandoned. Subject to the provisions for transition back to the regular form of town government, the form of town government existing prior to adoption of the abandoned option shall be resumed in the town.\nWhen the question of adoption or abandonment of an option is submitted, the town clerk shall promptly file with the county auditor and the secretary of state a certificate stating the date of the election, the question submitted, and the vote on the question.",
	"repealed": false
}