{
	"id": "256.9741",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9741",
	"title": "256.9741 DEFINITIONS.",
	"text": "\"Long-term care facility\" means a nursing home licensed under sections 144A.02 to 144A.10; a boarding care home licensed under sections 144.50 to 144.56; an assisted living facility or an assisted living facility with dementia care licensed under chapter 144G; a licensed or registered residential setting that provides or arranges for the provision of home care services; or a setting defined under section 144G.08, subdivision 7, clauses (10) to (13), that provides or arranges for the provision of home care services.\n\"Acute care facility\" means a facility licensed as a hospital under sections 144.50 to 144.56.\n\"Client\" means an individual who requests, or on whose behalf a request is made for, ombudsman services and is (a) a resident of a long-term care facility or (b) a Medicare beneficiary who requests assistance relating to access, discharge, or denial of inpatient or outpatient services, or (c) an individual reserving, receiving, or requesting a home care service.\n\"Area agency on aging\" means an agency responsible for coordinating a comprehensive aging services system within a planning and service area that has been designated an area agency on aging by the Minnesota Board on Aging.\n\"Office\" means the organizational unit established within the Minnesota Board on Aging headed by the state long-term care ombudsman.\n\"Home care service\" means health, social, or supportive services provided to an individual for a fee in the individual's residence and in the community to promote, maintain, or restore health, or maximize the individual's level of independence, while minimizing the effects of disability and illness.\n\"Representatives of the office\" means employees of the office, as well as employees designated as regional ombudsmen and volunteers designated as certified ombudsman volunteers by the state long-term care ombudsman.\n\"State long-term care ombudsman\" or \"ombudsman\" means the individual serving on a full-time basis and who in the individual's official capacity, or through representatives of the office, is responsible to fulfill the functions, responsibilities, and duties set forth in section 256.9742.",
	"repealed": false
}