{
	"id": "150A.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.091",
	"title": "150A.091 FEES.",
	"text": "No fee may be refunded for any reason.\nEach applicant shall submit with a license, advanced dental therapist certificate, or permit application a nonrefundable fee in the following amounts in order to administratively process an application:\n(1) dentist, $308;\n(2) full faculty dentist, $308;\n(3) limited faculty dentist, $140;\n(4) resident dentist or dental provider, $55;\n(5) advanced dental therapist, $100;\n(6) dental therapist, $220;\n(7) dental hygienist, $115;\n(8) licensed dental assistant, $115;\n(9) dental assistant with limited radiology registration as described in Minnesota Rules, part 3100.1320, $27; and\n(10) guest license, $50.\nMS 2020 [Repealed, 2022 c 98 art 3 s 26]\nEach limited faculty or resident dentist shall submit with an annual license renewal application a fee established by the board not to exceed the following amounts:\n(1) limited faculty dentist, $168; and\n(2) resident dentist or dental provider, $85.\nEach of the following applicants shall submit with a biennial license or permit renewal application a fee as established by the board, not to exceed the following amounts:\n(1) dentist or full faculty dentist, $475;\n(2) dental therapist, $300;\n(3) dental hygienist, $200;\n(4) licensed dental assistant, $150; and\n(5) dental assistant with a limited radiology registration as described in Minnesota Rules, part 3100.1320, $24.\nApplications for renewal of any license received after the time specified in Minnesota Rules, part 3100.1750, must be assessed a late fee equal to 50 percent of the annual renewal fee.\nApplications for renewal of any license or permit received after the time specified in Minnesota Rules, part 3100.1700, must be assessed a late fee equal to 25 percent of the biennial renewal fee.\nEach applicant shall submit, with a request for issuance of a duplicate of the original license, or of an annual or biennial renewal certificate for a license or permit, a fee in the following amounts:\n(1) original dentist, full faculty dentist, dental therapist, dental hygiene, or dental assistant license, $35; and\n(2) annual or biennial renewal certificates, $10.\nEach applicant for licensure as a dentist, dental hygienist, or dental assistant by credentials pursuant to section 150A.06, subdivisions 4 and 8, and Minnesota Rules, part 3100.1400, shall submit with the license application a fee in the following amounts:\n(1) dentist, $893;\n(2) dental hygienist, $235;\n(3) dental assistant, $71; and\n(4) dental therapist, $340.\nApplicants who have graduated from a nonaccredited dental college desiring licensure as a dentist pursuant to section 150A.06, subdivision 1, shall submit an application for credential review and an application fee not to exceed the amount of $200.\nEach applicant for licensure as a limited general dentist pursuant to section 150A.06, subdivision 9, shall submit the applicable fees established by the board not to exceed the following amounts:\n(1) initial limited general license application, $140;\n(2) annual limited general license renewal application, $155; and\n(3) late fee assessment for renewal application equal to 50 percent of the annual limited general license renewal fee.\nApplications for a temporary military permit in accordance with section 197.4552 shall submit a fee not to exceed the amount of $250.\nNo dentist, dental therapist, dental hygienist, or dental assistant whose license has been suspended or revoked may have the license reinstated or a new license issued until a fee has been submitted to the board in the following amounts:\n(1) dentist, $140;\n(2) dental therapist, $85;\n(3) dental hygienist, $55; and\n(4) dental assistant, $35.\nEach dentist shall submit with a general anesthesia or moderate sedation application, a contracted sedation provider application, or biennial renewal, a fee as established by the board not to exceed the following amounts:\n(1) for both a general anesthesia and moderate sedation application, $400;\n(2) for a general anesthesia application only, $400;\n(3) for a moderate sedation application only, $400; and\n(4) for a contracted sedation provider application, $400.\nApplications for renewal of a general anesthesia or moderate sedation certificate or a contracted sedation provider certificate received after the time specified in Minnesota Rules, part 3100.3600, subparts 19 and 21, must be assessed a late fee equal to 50 percent of the biennial renewal fee for an anesthesia/sedation certificate.\nNo dentist whose general anesthesia or moderate sedation certificate has been terminated by the board or voluntarily terminated by the dentist may become recertified until a fee has been submitted to the board not to exceed the amount of $500.\nEach dentist shall submit with a request for issuance of a duplicate of the original general anesthesia or moderate sedation certificate or contracted sedation provider certificate a fee in the amount of $10.\nAn on-site inspection fee must be paid to the individual, organization, or agency conducting the inspection and be limited to a maximum fee as determined by the board. Travel, lodging, and other expenses are not part of the on-site inspection fee.\nEach licensee shall submit with a request for an affidavit of licensure a fee in the amount of $10.\nMS 2020 [Repealed, 2022 c 98 art 3 s 26]\n(a) If a licensee fails a professional development portfolio audit under Minnesota Rules, part 3100.5300, the board is authorized to take the following actions:\n(1) for the first failure, the board may issue a warning to the licensee;\n(2) for the second failure within ten years, the board may assess a penalty of not more than $250; and\n(3) for any additional failures within the ten-year period, the board may assess a penalty of not more than $1,000.\n(b) In addition to the penalty fee, the board may initiate the complaint process to address multiple failed audits.\nMS 2020 [Repealed, 2022 c 98 art 3 s 26]\nAny corporation or professional firm whose annual fee is not postmarked or otherwise received by the board by the due date of December 31 shall, in addition to the fee, submit a late fee as established by the board, not to exceed $15.\nAn individual applying for emeritus inactive licensure under section 150A.06, subdivision 10, must pay a onetime fee of $50. There is no renewal fee for an emeritus inactive license.\nAn individual applying for emeritus active licensure under section 150A.06, subdivision 11, must pay a fee upon application and upon renewal every two years. The fees for emeritus active license application and renewal are as follows: dentist, $212; dental therapist, $100; dental hygienist, $75; and dental assistant, $55.\n(a) If a licensee practices without a current license and pursues reinstatement, the board may take the following administrative actions based on the length of time practicing without a current license:\n(1) for under one month, the board may not assess a penalty fee;\n(2) for one month to six months, the board may assess a penalty of $250;\n(3) for over six months, the board may assess a penalty of $500; and\n(4) for over 12 months, the board may assess a penalty of $1,000.\n(b) In addition to the penalty fee, the board shall initiate the complaint process against the licensee for failure to practice with a current license for over 12 months.\n(a) If a dentist or dental therapist delegates regulated procedures to another dental professional who had their license terminated, the board may take the following administrative actions against the delegating dentist or dental therapist based on the length of time they delegated regulated procedures:\n(1) for under one month, the board may not assess a penalty fee;\n(2) for one month to six months, the board may assess a penalty of $100;\n(3) for over six months, the board may assess a penalty of $250; and\n(4) for over 12 months, the board may assess a penalty of $500.\n(b) In addition to the penalty fee, the board shall initiate the complaint process against a dentist or dental therapist who delegated regulated procedures to a dental professional with a terminated license for over 12 months.\nEach licensee must submit a nonrefundable $5 fee to request a mailing address list.",
	"repealed": false
}