{
	"id": "256L.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.03",
	"title": "256L.03 COVERED HEALTH SERVICES.",
	"text": "(a) \"Covered health services\" means the health services reimbursed under chapter 256B, with the exception of special education services, home care nursing services, nonemergency medical transportation services, personal care assistance and case management services, community first services and supports under section 256B.85, behavioral health home services under section 256B.0757, housing stabilization services under section 256B.051, and nursing home or intermediate care facilities services.\n(b) Covered health services shall be expanded as provided in this section.\n(c) For the purposes of covered health services under this section, \"child\" means an individual younger than 19 years of age.\nChildren are eligible for coverage of all services that are eligible for reimbursement under the medical assistance program according to chapter 256B, except special education services and that abortion services under MinnesotaCare shall be limited as provided under subdivision 1. Children are exempt from the provisions of subdivision 5, regarding co-payments. Children who are lawfully residing in the United States but who are not \"qualified noncitizens\" under title IV of the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, Public Law 104-193, Statutes at Large, volume 110, page 2105, are eligible for coverage of all services provided under the medical assistance program according to chapter 256B.\nA pregnant woman enrolled in MinnesotaCare is eligible for coverage of all services provided under the medical assistance program according to chapter 256B retroactive to the date of conception. Co-payments totaling $30 or more, paid after the date of conception, shall be refunded.\nBeginning July 1, 1993, covered health services shall include individual outpatient treatment of substance use disorder by a qualified health professional or outpatient program.\nPersons who may need substance use disorder services under the provisions of this chapter must be assessed by a qualified professional as defined in section 245G.11, subdivisions 1 and 5, and under the assessment provisions of section 254A.03, subdivision 3. A local agency or managed care plan under contract with the Department of Human Services must offer services to a person in need of substance use disorder services based on the recommendations of section 245G.05. Persons who are recipients of medical benefits under the provisions of this chapter and who are financially eligible for behavioral health fund services provided under the provisions of chapter 254B shall receive substance use disorder treatment services under the provisions of chapter 254B only if:\n(1) they have exhausted the substance use disorder benefits offered under this chapter; or\n(2) an assessment indicates that they need a level of care not provided under the provisions of this chapter.\nRecipients of covered health services under the children's health plan, as provided in Minnesota Statutes 1990, section 256.936, and as amended by Laws 1991, chapter 292, article 4, section 17, and recipients of covered health services enrolled in the children's health plan or the MinnesotaCare program after October 1, 1992, pursuant to Laws 1992, chapter 549, article 4, sections 5 and 17, are eligible to receive substance use disorder benefits under this subdivision.\n(a) Covered health services shall include inpatient hospital services, including inpatient hospital mental health services and inpatient hospital and residential substance use disorder treatment, subject to those limitations necessary to coordinate the provision of these services with eligibility under the medical assistance spenddown.\n(b) Admissions for inpatient hospital services paid for under section 256L.11, subdivision 3, must be certified as medically necessary in accordance with Minnesota Rules, parts 9505.0505 to 9505.0540, except as provided in clauses (1) and (2):\n(1) all admissions must be certified, except those authorized under rules established under section 254A.03, subdivision 3, or approved under Medicare; and\n(2) payment under section 256L.11, subdivision 3, shall be reduced by five percent for admissions for which certification is requested more than 30 days after the day of admission. The hospital may not seek payment from the enrollee for the amount of the payment reduction under this clause.\nCovered services include sign and spoken language interpreter services that assist an enrollee in obtaining covered health care services.\nMinnesotaCare covers the following chiropractic services: medically necessary exams, manual manipulation of the spine, and x-rays.\nThe commissioner shall coordinate the provision of hospital inpatient services under the MinnesotaCare program with enrollee eligibility under the medical assistance spenddown.\nHealth coverage provided through the MinnesotaCare program must have a medical loss ratio of at least 85 percent, as defined using the loss ratio methodology described in section 1001 of the Affordable Care Act.\n(a) Co-payments, coinsurance, and deductibles do not apply to children under the age of 21 and to American Indians as defined in Code of Federal Regulations, title 42, section 600.5.\n(b) The commissioner must adjust co-payments, coinsurance, and deductibles for covered services in a manner sufficient to maintain the actuarial value of the benefit to 94 percent. The cost-sharing changes described in this paragraph do not apply to eligible recipients or services exempt from cost-sharing under state law. The cost-sharing changes described in this paragraph shall not be implemented prior to January 1, 2016.\n(c) The cost-sharing changes authorized under paragraph (b) must satisfy the requirements for cost-sharing under the Basic Health Program as set forth in Code of Federal Regulations, title 42, sections 600.510 and 600.520.\n(d) Cost-sharing for prescription drugs and related medical supplies to treat chronic disease must comply with the requirements of section 62Q.481.\n(e) Co-payments, coinsurance, and deductibles do not apply to additional diagnostic services or testing that a health care provider determines an enrollee requires after a mammogram, as specified under section 62A.30, subdivision 5.\n(f) Cost-sharing must not apply to drugs used for tobacco and nicotine cessation or to tobacco and nicotine cessation services covered under section 256B.0625, subdivision 68.\n(g) Co-payments, coinsurance, and deductibles do not apply to pre-exposure prophylaxis (PrEP) and postexposure prophylaxis (PEP) medications when used for the prevention or treatment of the human immunodeficiency virus (HIV).\n[See Note.]\n[Repealed, 2002 c 220 art 15 s 27]\nWhen the state agency provides, pays for, or becomes liable for covered health services, the agency shall have a lien for the cost of the covered health services upon any and all causes of action accruing to the enrollee, or to the enrollee's legal representatives, as a result of the occurrence that necessitated the payment for the covered health services. All liens under this section shall be subject to the provisions of section 256.015. For purposes of this subdivision, \"state agency\" includes participating entities, under contract with the commissioner according to section 256L.121.",
	"repealed": false
}