{
	"id": "47.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.62",
	"title": "47.62 AUTHORIZATION.",
	"text": "Any person may establish and maintain one or more electronic financial terminals. Any financial institution may provide for its customers the use of an electronic financial terminal by entering into an agreement with any person who has established and maintains one or more electronic financial terminals if that person authorizes use of the electronic financial terminal to all financial institutions on a nondiscriminatory basis pursuant to section 47.64.\nNo electronic financial terminal shall be established by a person other than a state or federal savings association, state or federal savings bank, state or federal credit union, or state bank or national banking association unless the commissioner has approved the establishment of the terminal.\nApplication for authorization shall be made in the manner prescribed by rule. The commissioner shall grant authorization for the establishment of an electronic financial terminal if the commissioner finds that:\n(a) there is reason to believe that the terminal will be properly and safely managed;\n(b) the applicant is financially sound;\n(c) the proposed charges for making the services of the terminal available to financial institutions are fair, equitable, and nondiscriminatory;\n(d) the applicant has furnished all of the information required by rule;\n(e) the terminal applicant will not gain an unfair competitive advantage because the terminal is not operationally available to other financial institutions or their data processors within a reasonable period of time.\nIf the commissioner has not denied the application within 45 days of its submission, the authorization shall be deemed to be granted.\nWhen more than one electronic financial terminal is established and maintained at a single place of business by the same person, or if a person wishes to make an application that encompasses more than one place of business or location, a single application and fee shall be sufficient. For each application, a $100 fee shall be paid to the commissioner, and for each application for a change in pricing structure, a $10 fee shall be paid to the commissioner. If the $100 fee or the $10 fee is less than the costs incurred by the commissioner in approving or disapproving the application, the fee shall be equal to those costs.\n[Repealed, 2007 c 44 s 9; 2007 c 57 art 3 s 64]\nAn application or notification to relocate an existing financial terminal outside a radius of three miles measured in a straight line must be approved by, or a notification must be filed with, the commissioner of commerce as provided for in this section.",
	"repealed": false
}