{
	"id": "356.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.50",
	"title": "356.50 SERVICE AND SALARY CREDIT FROM BACK PAY AWARDS IN THE EVENT OF WRONGFUL DISCHARGE; ANNUITY AND DISABILITY TREATMENT.",
	"text": "(a) A person who is wrongfully discharged from public employment that gave rise to coverage by a public employee pension plan enumerated in section 356.30, subdivision 3, is entitled to obtain allowable service credit from the applicable public employee pension plan for the applicable period caused by the wrongful discharge.\n(b) A person is wrongfully discharged for purposes of this section if:\n(1) the person has been determined by a court of competent jurisdiction, by an arbitrator in binding arbitration, by the commissioner of veterans affairs, or by a board, commission, or panel acting under section 197.46, whichever applies, to have been wrongfully discharged from public employment;\n(2) the person received an award of back pay with respect to that discharge; and\n(3) the award does not include any amount for any lost or interrupted public pension plan coverage.\n(a) To obtain the public pension plan allowable service credit, the eligible person under subdivision 1 shall pay the required member contribution amount. The required member contribution amount is the member contribution rate or rates in effect for the pension plan during the period of service covered by the back pay award, applied to the unpaid gross salary amounts of the back pay award including unemployment insurance, workers' compensation, or wages from other sources which reduced the back award. No contributions may be made under this clause for compensation covered by a public pension plan listed in section 356.30, subdivision 3, for employment during the removal period. The person shall pay the required member contribution amount within 60 days of the date of receipt of the back pay award or within 60 days of a billing from the retirement fund, whichever is later.\n(b) The public employer who wrongfully discharged the public employee must pay an employer contribution on the back pay award. The employer contribution must be based on the employer contribution rate or rates in effect for the pension plan during the period of service covered by the back pay award, applied to the salary amount on which the member contribution amount was determined under paragraph (a). The employer must pay compound interest on both the required member and employer contribution amounts at the applicable monthly rate or rates specified in section 356.59, subdivision 2, 3, 4, or 5, whichever applies, between the date the contribution amount would have been paid to the date of actual payment. The employer payment must be made within 30 days of the payment under paragraph (a).\nThe employer must report to the executive director of the applicable pension plan that a person has been determined to be wrongfully discharged and the employer must provide a copy of the written order or decision.\nNotwithstanding subdivisions 1 and 2, if after being discharged, the person commences receipt of an annuity from the applicable plan, and it is later determined that the person was wrongfully discharged, the person shall repay the annuity received in a lump sum within 60 days of receipt of the back pay award.\nIf a person is wrongfully discharged and before reinstatement takes a refund of employee contributions under the applicable plan's refund provision and fails to repay that refund, then not withstanding other law to the contrary, if the person applies for a disability benefit and is approved for that benefit, the disability benefit amount must be computed solely on the years of covered service provided after reinstatement, on the individual's salary for benefit computation purposes, and on the applicable plan accrual rates, rather than receiving a minimum disability benefit amount, if applicable, specified in plan law.",
	"repealed": false
}