{
	"id": "16A.1335",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.1335",
	"title": "16A.1335 EMPLOYEE SALARIES AND BENEFITS IN EVENT OF STATE GOVERNMENT SHUTDOWN.",
	"text": "As used in this section, \"government shutdown\" means that, as of July 1 of an odd-numbered year, legislation appropriating money for the general operations of (1) an executive agency, (2) an office or department of the legislature, including each house of the legislature and the Legislative Coordinating Commission, or (3) a judicial branch agency or department, including a court, has not been enacted for the biennium beginning July 1 of that year.\nNotwithstanding section 16A.17, subdivision 8, state employees must be provided payment for lost salary and benefits resulting from their absence from work during a government shutdown. An employee is eligible for a payment under this section only upon the employee's return to work.\n(a) In the event of a government shutdown, the amount necessary to pay the salary and benefits of employees of any impacted agency, office, or department is appropriated beginning on that July 1 to that agency, office, or department. The appropriation is made from the fund or funds from which an appropriation was made in the previous fiscal year for salary and benefits paid to each affected employee.\n(b) Amounts appropriated under this subdivision may not exceed the amount or amounts appropriated for general operations of the affected agency, office, or department in the previous fiscal year.\nBy June 25 of an odd-numbered year, if a government shutdown appears imminent, the director of the Legislative Coordinating Commission, the chief clerk of the house of representatives, the secretary of the senate, and the chief clerk of the supreme court must each certify to the commissioner of management and budget the amount needed for salaries and benefits for each fiscal year of the next biennium, and the commissioner of management and budget shall make the certified amount available on July 1 of that year or on another schedule that permits payment of all salary and benefit obligations required by this section in a timely manner.\nA subsequent appropriation to the agency, office, or department for regular operations for a biennium in which this section has been applied may only supersede and replace the appropriation provided by subdivision 3 by express reference to this section.",
	"repealed": false
}