{
	"id": "62A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.01",
	"title": "62A.01 REQUIREMENTS; CERTIFICATES OF COVERAGE UNDER POLICY OF ACCIDENT AND SICKNESS INSURANCE.",
	"text": "The term \"policy of accident and sickness insurance\" as used herein includes any policy covering the kind of insurance described in section 60A.06, subdivision 1, clause (5)(a), or the paid family and medical leave benefits as described in section 268B.10.\nA certificate of insurance or similar evidence of coverage issued to a Minnesota resident shall provide coverage for all benefits required to be covered in group policies in Minnesota by this chapter and chapter 62E.\nThis subdivision supersedes any inconsistent provision of this chapter and chapter 62E.\nA policy of accident and sickness insurance that is issued or delivered in this state and that covers a person residing in another state may provide coverage or contain provisions that are less favorable to that person than required by this chapter and chapter 62E. Less favorable coverages or provisions must meet the requirements that the state in which the person resides would have required had the policy been issued or delivered in that state.\nSubdivision 2 does not apply to certificates issued in regard to a master policy issued outside the state of Minnesota if all of the following are true:\n(1) the policyholder or certificate holder exists primarily for purposes other than to obtain insurance;\n(2) the policyholder or certificate holder is not a Minnesota corporation and does not have its principal office in Minnesota;\n(3) the policy or certificate covers fewer than 25 employees who are residents of Minnesota and the Minnesota employees represent less than 25 percent of all covered employees; and\n(4) on request of the commissioner, the issuer files with the commissioner a copy of the policy and a copy of each form of certificate.\nThis subdivision applies to employers who are not corporations if they are policyholders or certificate holders providing coverage to employees through the certificate or policy.\nSection 60A.08, subdivision 4, shall not be construed as requiring a certificate of insurance or similar evidence of insurance that meets the conditions of subdivision 3 to comply with this chapter or chapter 62E.",
	"repealed": false
}