{
	"id": "609.2243",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.2243",
	"title": "609.2243 SENTENCING; REPEAT DOMESTIC ASSAULT.",
	"text": "A person convicted of gross misdemeanor domestic assault under section 609.2242, subdivision 2, shall be sentenced to a minimum of 20 days imprisonment, at least 96 hours of which must be served consecutively. The court may stay execution of the minimum sentence required under this subdivision on the condition that the person sentenced complete anger therapy or counseling and fulfill any other condition, as ordered by the court; provided, however, that the court shall revoke the stay of execution and direct the person to be taken into immediate custody if it appears that the person failed to attend or complete the ordered therapy or counseling, or violated any other condition of the stay of execution. If the court finds at the revocation hearing required under section 609.14, subdivision 2, that the person failed to attend or complete the ordered therapy, or violated any other condition of the stay of execution, the court shall order execution of the sentence previously imposed.\n(a) Except as otherwise provided in paragraph (b), in determining an appropriate disposition for felony domestic assault under section 609.2242, subdivision 4, the court shall presume that a stay of execution with at least a 45-day period of incarceration as a condition of probation shall be imposed. If the court imposes a stay of execution with a period of incarceration as a condition of probation, at least 15 days must be served consecutively.\n(b) If the defendant's criminal history score, determined according to the Sentencing Guidelines, indicates a presumptive executed sentence, that sentence shall be imposed unless the court departs from the Sentencing Guidelines pursuant to section 244.10. A stay of imposition of sentence under this paragraph may be granted only if accompanied by a statement on the record of the reasons for it.",
	"repealed": false
}