{
	"id": "4.077",
	"url": "https://www.revisor.mn.gov/statutes/cite/4.077",
	"title": "4.077 ST. PAUL LANDMARK AUTHORITY.",
	"text": "(a) The Old Federal Courts Building in the city of St. Paul, called in this section the \"courts building,\" is an outstanding example of federal architecture of its period and a significant symbol of constitutional government which spans much of this state's history. Its acquisition, preservation, and appropriate use is a concern of the state and an important aspect of state policy declared in the Historic Sites Act of 1965.\n(b) The legislature is informed that feasible renovation and remodeling of the structure of this historic site would make it suitable to meet existing and foreseeable need of the state for school, classroom, and other educational use, or for use in the protection of public health, and such practical adaptation of the courts building should not be incompatible, but rather in keeping with, continued observance of the building as an historic monument.\n(c) National policy expressed in enactments of the Congress (including, but not necessarily limited to, the Surplus Property Act of 1944 and Federal Property and Administrative Services Act of 1949) make this historic site, now held by and subject to the control of the administrator of the General Service Administration, available to this state, its political subdivisions or instrumentalities upon compliance with the conditions of the statutes and rules promulgated thereunder for educational use or use in the protection of the public health, or as an historic monument for the benefit of the public.\n(a) To implement state and national policy a public corporation sole is hereby created in the persons of the governors of the state of Minnesota, that is, in the person of the incumbent governor and in the person of each successor in turn, named \"the Governor's Office for a Minnesota Landmark,\" but referred to herein as \"the corporation.\"\n(b) The purpose of the corporation is the acquisition, preservation, and appropriate use for the public benefit of the courts building, a public purpose, and in pursuance of this purpose it has the powers and duties herein enumerated.\n(c) The corporation is empowered to take title to the courts building by a donative grant as an instrumentality of the state, with such restrictions and conditions compatible with appropriate use of the courts building as may be imposed by federal authority, but it shall first determine, after consideration of all relevant factors, including but not limited to potential income from all sources, that ownership and appropriate use will be feasible and probably self-supporting.\n(d) \"Appropriate use\" as a purpose of the corporation created by Laws 1971, chapter 605, means that the corporation will own, control, manage, and use the courts building if the courts building is transferred to it:\n(1) to provide space therein by lease or other arrangement to tax-supported and other nonprofit educational institutions for school, classroom, or other educational use, or use in protection of public health; or\n(2) as an historic monument; and\n(3) whether or not used as in clause (1) or (2), for such other use, private and public, as may be compatible with the conditions and restrictions of the grant, permissible under controlling law and rule governing the use under the grant, and in accord with the purpose of the corporation.\nAssociates of the corporation are:\n(1) members of the executive council of the Minnesota Historical Society;\n(2) members of the Capitol Area Architectural and Planning Board;\n(3) the mayor and members of the council of the city of St. Paul; and\n(4) members of a Minnesota nonprofit corporation that shows by its application on behalf of its members who desire to be associates that in pursuit of a purpose expressed in its articles it is engaged in an effort to save the courts building for the public benefit,\nwho request the corporation to be named an associate. An associate is not a member of the corporation.\nThe corporation has a board of advisors consisting of a number, not more than nine, of advisors limited by the corporation bylaws. The corporation may delegate by a bylaw to the board of advisors specified duties and authority in the management of the corporation property and affairs within the area of the authority of the corporation. The term of an advisor is four years except that the first appointments shall be so limited as to result in a staggered ending of terms with about one-half terminating each two years. An advisor receives no compensation but is reimbursed for actual expenses necessarily incurred in the business of the corporation as its bylaws may provide.\nIn addition to the powers elsewhere given to the corporation it has the following general powers:\n(1) to have succession until dissolved by law;\n(2) to sue and be sued in its corporate name;\n(3) to adopt, alter, and use a corporate seal which shall be judicially noticed;\n(4) to accept, hold, and administer gifts and bequests of money, securities, or other personal property of whatsoever character, absolutely or on trust, for the purposes for which the corporation is created. Unless otherwise restricted by the terms of the gift or bequest, the corporation is authorized to sell, exchange, or otherwise dispose of and to invest or reinvest in such investments as it may determine from time to time the money, securities, or other property given or bequeathed to it. The principal of such corporate funds and the income therefrom, and all other revenues received by it from any source whatsoever shall be placed in such depositories as the board of directors shall determine and shall be subject to expenditure for corporate purposes;\n(5) to enter into contracts generally and to execute all instruments necessary or appropriate to carry out its corporate purposes;\n(6) to appoint and prescribe the duties of officers, agents, and employees as may be necessary to carry out its work and to compensate them;\n(7) to purchase all supplies and materials necessary for carrying out of its purposes;\n(8) to accept from the United States or the state of Minnesota, or any of their agencies, moneys or other assistance whether by gift, loan, or otherwise, to carry out its corporate purposes, and to enter into such contracts with the United States or the state of Minnesota, or any of the agencies of either, or with any of the political subdivisions of the state, as it may deem proper and consistent with the purposes of this section;\n(9) to adopt such bylaws and rules as it deems necessary for the administration of its functions and the accomplishment of its purpose, including among other matter the establishment of a business office and the rules, the use of the courts building, and the administration of corporation funds;\n(10) to contract and make cooperative agreements with federal, state, and municipal departments and agencies and private corporations, associations, and individuals for the use of the corporation property, including but not limited to rental agreements and concessions;\n(11) to convey its property, real and personal, should the accomplishment of its purpose prove to be not feasible or compliance with the terms and conditions of the grant of the courts building appear to be impractical;\n(12) to operate and maintain and furnish, restore, and as needed or suitable from time to time, renovate and remodel the courts building; and to accomplish its purpose and in execution of its powers, to borrow money and issue its debentures payable from income either unsecured or secured by pledge of revenues to be derived from the operation of its property or from other sources, or both, and to agree, if in consonance with national policy, that income derived from property conveyed to it by federal authority in excess of costs of repair, rehabilitation, restoration, and maintenance will be used by it only for park or recreational purposes, and to fulfill such agreement; and in its corporate discretion to use any such excess income which has not been so committed for park or recreation purposes, or for educational purposes by supporting educational institutions or activity, or for both of such purposes, and generally to do any and all lawful acts necessary or appropriate to carry out the purposes for which it is created.\nProvided, however, that the state of Minnesota is not and shall not be held liable on any contract of the corporation for the payment of money or otherwise except as the legislature may expressly assume or accept responsibility, but this limitation does not prevent or limit the authority of a state department or agency to contract with the corporation for the rental of space, or for any other purpose, if the contract is within the general authority of the department or agency and there are funds available to it.",
	"repealed": false
}