{
	"id": "219.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.016",
	"title": "219.016 HAZARDOUS MATERIALS RAIL SAFETY.",
	"text": "A hazardous materials rail safety program is established for the purpose of reducing the risks associated with the transportation of oil, ethanol, and other hazardous material by rail.\nTwo hazardous materials rail safety program accounts are created, one in the special revenue fund and one in the bond proceeds fund. The account in the special revenue fund consists of money as provided by law, and any other money donated, allotted, transferred, or otherwise provided to the account. Money in each account is appropriated to the commissioner of transportation to make grants as provided in this section.\nA county, statutory or home rule charter city, or town that is responsible for establishing and maintaining public highway-rail grade crossings on rail corridors transporting crude oil and other hazardous materials may apply to the commissioner for financial assistance under this section.\n(a) A project is eligible for a grant from the account in the bond proceeds fund if the project is for the acquisition or betterment of public land, buildings, and other public improvements of a capital nature within the meaning of the Minnesota Constitution, article XI, section 5, clause (a) or (i), including capital costs associated with hazardous materials rail safety projects on public highway-rail grade crossings. Qualifying capital costs include but are not limited to upgrades to existing protection systems, the closing of crossings and necessary roadwork, and reconstruction of at-grade crossings to full grade separations.\n(b) A project is eligible for a grant from the account in the special revenue fund if it is for purposes described in paragraph (a) or other capital facility improvement purposes that support the purposes for which this grant program is established, including capital costs associated with planning, engineering, administration, and construction of public highway-rail grade crossing improvements on rail corridors transporting crude oil and other hazardous materials. Improvements may include upgrades to existing protection systems, the closing of crossings and necessary roadwork, and reconstruction of at-grade crossings to full grade separations.\nThe commissioner must consider the following criteria to evaluate applications for a grant award under this section:\n(1) whether the crossing was identified as a potential candidate for grade separation in the Department of Transportation's crude by rail grade crossing study (Improvements to Highway Grade Crossings and Rail Safety, December 2014);\n(2) roadway traffic volumes and speeds;\n(3) train volumes and speeds;\n(4) adjacent land use;\n(5) crash history;\n(6) use of the crossing by emergency vehicles;\n(7) use of the crossing by vehicles carrying hazardous materials; and\n(8) local financial contributions to the project.\nThe commissioner must develop forms and procedures for soliciting and reviewing applications for grants under this section. An applicant must apply for a grant in the manner and at the times determined by the commissioner.\nIf, five years after execution of a grant agreement, the commissioner determines that the grantee has not proceeded in a timely manner with implementation of the project funded, the commissioner must cancel the grant and the grantee must repay to the commissioner all grant money paid to the grantee. Section 16A.642 applies to any appropriations made from the bond proceeds fund to the commissioner under this section that have not been awarded as financial assistance.",
	"repealed": false
}