{
	"id": "216B.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.241",
	"title": "216B.241 PUBLIC UTILITIES; ENERGY CONSERVATION AND OPTIMIZATION.",
	"text": "MS 2020 [Repealed, 2021 c 29 s 19]\n(a) The owner of a large customer facility may petition the commissioner to exempt both electric and gas utilities serving the large customer facility from contributing to investments and expenditures made under an energy and conservation optimization plan filed under subdivision 2 or section 216B.2403, subdivision 3, with respect to retail revenues attributable to the large customer facility. The filing must include a discussion of the competitive or economic pressures facing the owner of the facility and the efforts taken by the owner to identify, evaluate, and implement energy conservation and efficiency improvements. A filing submitted on or before October 1 of any year must be approved within 90 days and become effective January 1 of the year following the filing, unless the commissioner finds that the owner of the large customer facility has failed to take reasonable measures to identify, evaluate, and implement energy conservation and efficiency improvements. If a facility qualifies as a large customer facility solely due to its peak electrical demand or annual natural gas usage, the exemption may be limited to the qualifying utility if the commissioner finds that the owner of the large customer facility has failed to take reasonable measures to identify, evaluate, and implement energy conservation and efficiency improvements with respect to the nonqualifying utility. Once an exemption is approved, the commissioner may request the owner of a large customer facility to submit, not more often than once every five years, a report demonstrating the large customer facility's ongoing commitment to energy conservation and efficiency improvement after the exemption filing. The commissioner may request such reports for up to ten years after the effective date of the exemption, unless the majority ownership of the large customer facility changes, in which case the commissioner may request additional reports for up to ten years after the change in ownership occurs. The commissioner may, within 180 days of receiving a report submitted under this paragraph, rescind any exemption granted under this paragraph upon a determination that the large customer facility is not continuing to make reasonable efforts to identify, evaluate, and implement energy conservation improvements. A large customer facility that is, under an order from the commissioner, exempt from the investment and expenditure requirements of paragraph (a) as of December 31, 2010, is not required to submit a report to retain its exempt status, except as otherwise provided in this paragraph with respect to ownership changes. No exempt large customer facility may participate in a utility conservation improvement program unless the owner of the facility submits a filing with the commissioner to withdraw its exemption.\n(b) A commercial gas customer that is not a large customer facility and that purchases or acquires natural gas from a public utility having fewer than 600,000 natural gas customers in Minnesota may petition the commissioner to exempt gas utilities serving the commercial gas customer from contributing to investments and expenditures made under an energy and conservation optimization plan filed under subdivision 2 or section 216B.2403, subdivision 3, with respect to retail revenues attributable to the commercial gas customer. The petition must be supported by evidence demonstrating that the commercial gas customer has acquired or can reasonably acquire the capability to bypass use of the utility's gas distribution system by obtaining natural gas directly from a supplier not regulated by the commission. The commissioner shall grant the exemption if the commissioner finds that the petitioner has made the demonstration required by this paragraph.\n(c) A public utility, consumer-owned utility, or owner of a large customer facility may appeal a decision of the commissioner under paragraph (a) or (b) to the commission under subdivision 2. In reviewing a decision of the commissioner under paragraph (a) or (b), the commission shall rescind the decision if it finds the decision is not in the public interest.\n(d) Notwithstanding paragraph (a), a large customer facility or commercial gas customer that is exempt from the investment and expenditure requirements of this section pursuant to an order from the commissioner as of December 31, 2020, is not required to submit additional documentation to maintain the exemption and must not be assessed any costs related to any energy conservation and optimization plan filed under this section or section 216B.2403, including but not limited to costs, incentives, or rates of return associated with investments in programs for efficient fuel-switching improvements.\n(e) A public utility is prohibited from spending for or investing in energy conservation improvements that directly benefit a large energy facility or a large electric customer facility the commissioner has issued an exemption to under this section.\nMS 2020 [Repealed, 2021 c 29 s 19]\n(a) The commissioner shall establish energy-saving goals for energy conservation improvements and shall evaluate an energy conservation improvement program on how well it meets the goals set.\n(b) A public utility providing electric service has an annual energy-savings goal equivalent to 1.75 percent of gross annual retail energy sales unless modified by the commissioner under paragraph (c). A public utility providing natural gas service has an annual energy-savings goal equivalent to one percent of gross annual retail energy sales, which cannot be lowered by the commissioner. The savings goals must be calculated based on the most recent three-year weather-normalized average. A public utility providing electric service may elect to carry forward energy savings in excess of 1.75 percent for a year to the succeeding three calendar years, except that savings from electric utility infrastructure projects allowed under paragraph (d) may be carried forward for five years. A public utility providing natural gas service may elect to carry forward energy savings in excess of one percent for a year to the succeeding three calendar years. A particular energy savings can only be used to meet one year's goal.\n(c) In its energy conservation and optimization plan filing, a public utility may request the commissioner to adjust its annual energy-savings percentage goal based on its historical conservation investment experience, customer class makeup, load growth, a conservation potential study, or other factors the commissioner determines warrants an adjustment.\n(d) The commissioner may not approve a plan of a public utility that provides for an annual energy-savings goal of less than one percent of gross annual retail energy sales from energy conservation improvements.\nThe balance of the 1.75 percent annual energy savings goal may be achieved through energy savings from:\n(1) additional energy conservation improvements;\n(2) electric utility infrastructure projects approved by the commission under section 216B.1636 that result in increased efficiency greater than would have occurred through normal maintenance activity; or\n(3) subject to department approval, demand-side natural gas or electric energy displaced by use of waste heat recovered and used as thermal energy, including the recovered thermal energy from a cogeneration or combined heat and power facility.\n(e) A public utility is not required to make energy conservation investments to attain the energy-savings goals of this subdivision that are not cost-effective even if the investment is necessary to attain the energy-savings goals. For the purpose of this paragraph, in determining cost-effectiveness, the commissioner shall consider: (1) the costs and benefits to ratepayers, the utility, participants, and society; (2) the rate at which a public utility is increasing both its energy savings and its expenditures on energy conservation; and (3) the public utility's lifetime energy savings and cumulative energy savings.\n(f) On an annual basis, the commissioner shall produce and make publicly available a report on the annual energy and capacity savings and estimated carbon dioxide reductions achieved by the programs under this section and section 216B.2403 for the two most recent years for which data is available. The report must also include information regarding any annual energy sales or generation capacity increases resulting from efficient fuel-switching improvements. The commissioner shall report on program performance both in the aggregate and for each entity filing an energy conservation improvement plan for approval or review by the commissioner, and must estimate progress made toward the statewide energy-savings goal under section 216B.2401.\n(a) The commissioner shall evaluate energy conservation improvement programs filed under this section and section 216B.2403 on the basis of cost-effectiveness and the reliability of the technologies employed. The commissioner shall, by order, establish, maintain, and update energy-savings assumptions that must be used by utilities when filing energy conservation improvement programs. The department must track a public utility's or consumer-owned utility's lifetime energy savings and cumulative lifetime energy savings reported in plans submitted under this section and section 216B.2403.\n(b) The commissioner shall establish an inventory of the most effective energy conservation programs, techniques, and technologies, and encourage all Minnesota utilities to implement them, where appropriate. The commissioner shall describe these programs in sufficient detail to provide a utility reasonable guidance concerning implementation. The commissioner shall prioritize the opportunities in order of potential energy savings and in order of cost-effectiveness.\n(c) The commissioner may contract with a third party to carry out any of the commissioner's duties under this subdivision, and to obtain technical assistance to evaluate the effectiveness of any conservation improvement program.\n(d) The commissioner may assess up to $850,000 annually for the purposes of this subdivision. The assessments must be deposited in the state treasury and credited to the energy and conservation account created under subdivision 2a. An assessment made under this subdivision is not subject to the cap on assessments provided by section 216B.62, or any other law.\n(e) The commissioner must work with stakeholders to develop technical guidelines that public utilities and consumer-owned utilities must use to:\n(1) determine whether deployment of a fuel-switching improvement meets the criteria established in subdivision 11, paragraph (d); subdivision 12, paragraph (a); or section 216B.2403, subdivision 8, as applicable; and\n(2) calculate the amount of energy saved due to the deployment of a fuel-switching improvement.\nThe guidelines must be issued by the commissioner by order no later than March 15, 2022, and must be updated as the commissioner determines is necessary.\n(a) The commissioner may, by order, approve and make grants for applied research and development projects of general applicability that identify new technologies or strategies to maximize energy savings, improve the effectiveness of energy conservation programs, or document the carbon dioxide reductions from energy conservation programs. When approving projects, the commissioner shall consider proposals and comments from utilities and other interested parties. The commissioner may assess up to $3,600,000 annually for the purposes of this subdivision. The assessments must be deposited in the state treasury and credited to the energy and conservation account created under subdivision 2a. An assessment made under this subdivision is not subject to the cap on assessments provided by section 216B.62, or any other law.\n(b) The commissioner, as part of the assessment authorized under paragraph (a), shall annually assess and grant up to $500,000 for the purpose of subdivision 9.\n(c) The commissioner, as part of the assessment authorized under paragraph (a), each state fiscal year shall assess $500,000 for a grant to the partnership created by section 216C.385, subdivision 2. The grant must be used to exercise the powers and perform the duties specified in section 216C.385, subdivision 3.\n(d) By February 15 annually, the commissioner shall report to the chairs and ranking minority members of the committees of the legislature with primary jurisdiction over energy policy and energy finance on the assessments made under this subdivision for the previous calendar year and the use of the assessment. The report must clearly describe the activities supported by the assessment and the parties that engaged in those activities.\n(a) The commissioner of administration and the commissioner of commerce shall maintain and, as needed, revise the sustainable building design guidelines developed under section 16B.325.\n(b) The commissioner of administration and the commissioner of commerce shall maintain and update the benchmarking tool developed under Laws 2001, chapter 212, article 1, section 3, so that all public buildings can use the benchmarking tool to maintain energy use information for the purposes of establishing energy efficiency benchmarks, tracking building performance, and measuring the results of energy efficiency and conservation improvements.\n(c) The commissioner shall require that utilities include in their conservation improvement plans programs that facilitate professional engineering verification to qualify a building as Energy Star-labeled, Leadership in Energy and Environmental Design (LEED) certified, or Green Globes-certified.\n(d) The commissioner may assess up to $500,000 annually for the purposes of this subdivision. The assessments must be deposited in the state treasury and credited to the energy and conservation account created under subdivision 2a. An assessment made under this subdivision is not subject to the cap on assessments provided by section 216B.62, or any other law.\n(a) A public utility shall submit filings to the department via the department's electronic filing system. The commissioner may approve an exemption from this requirement in the event a public utility is unable to submit filings via the department's electronic filing system. All other interested parties shall submit filings to the department via the department's electronic filing system whenever practicable but may also file by personal delivery or by mail.\n(b) Submission of a document to the department's electronic filing system constitutes service on the department. Where department rule requires service of a notice, order, or other document by the department, public utility, or interested party upon persons on a service list maintained by the department, service may be made by personal delivery, mail, or electronic service, except that electronic service may only be made upon persons on the service list who have previously agreed in writing to accept electronic service at an electronic address provided to the department for electronic service purposes.\n(a) The commissioner may require a public utility to make investments and expenditures in energy conservation improvements, explicitly setting forth the interest rates, prices, and terms under which the improvements must be offered to the customers.\n(b) A public utility shall file an energy conservation and optimization plan by June 1, on a schedule determined by order of the commissioner, but at least every three years. As provided in subdivisions 11 to 13, plans may include programs for efficient fuel-switching improvements and load management. An individual utility program may combine elements of energy conservation, load management, or efficient fuel-switching. The plan must estimate the lifetime energy savings and cumulative lifetime energy savings projected to be achieved under the plan. A plan filed by a public utility by June 1 must be approved or approved as modified by the commissioner by December 1 of that same year.\n(c) The commissioner shall evaluate the plan on the basis of cost-effectiveness and the reliability of technologies employed. The commissioner's order must provide to the extent practicable for a free choice, by consumers participating in an energy conservation program, of the device, method, material, or project constituting the energy conservation improvement and for a free choice of the seller, installer, or contractor of the energy conservation improvement, provided that the device, method, material, or project seller, installer, or contractor is duly licensed, certified, approved, or qualified, including under the residential conservation services program, where applicable.\n(d) The commissioner may require a utility subject to subdivision 1c to make an energy conservation improvement investment or expenditure whenever the commissioner finds that the improvement will result in energy savings at a total cost to the utility less than the cost to the utility to produce or purchase an equivalent amount of new supply of energy.\n(e) Each public utility subject to this subdivision may spend and invest annually up to ten percent of the total amount that the public utility spends and invests on energy conservation, efficient fuel-switching, or load management improvements under this section on research and development projects that meet the applicable definition of energy conservation, efficient fuel-switching, or load management improvement.\n(f) The commissioner shall consider and may require a public utility to undertake an energy conservation or efficient fuel-switching program, subject to the requirements of subdivisions 11 and 12, that is suggested by an outside source, including a political subdivision, a nonprofit corporation, or community organization. When approving a proposal under this paragraph, the commissioner must consider the qualifications and experience of the entity proposing the program and any other criteria the commissioner deems relevant.\n(g) A public utility, a political subdivision, or a nonprofit or community organization that has suggested an energy conservation program, the attorney general acting on behalf of consumers and small business interests, or a public utility customer that has suggested an energy conservation program and is not represented by the attorney general under section 8.33 may petition the commission to modify or revoke a department decision under this section, and the commission may do so if it determines that the energy conservation program is not cost-effective, does not adequately address the residential conservation improvement needs of low-income persons, has a long-range negative effect on one or more classes of customers, or is otherwise not in the public interest. The commission shall reject a petition that, on its face, fails to make a reasonable argument that an energy conservation program is not in the public interest.\n(h) The commissioner may order a public utility to include, with the filing of the public utility's annual status report, the results of an independent audit of the public utility's conservation improvement programs and expenditures performed by the department or an auditor with experience in the provision of energy conservation and energy efficiency services approved by the commissioner and chosen by the public utility. The audit must specify the energy savings or increased efficiency in the use of energy within the service territory of the public utility that is the result of the public utility's spending and investments. The audit must evaluate the cost-effectiveness of the public utility's conservation programs.\n(i) The energy conservation and optimization plan of each public utility subject to this section must include activities to improve energy efficiency in public schools served by the utility. As applicable to each public utility, at a minimum the activities must include programs to increase the efficiency of the school's lighting and heating and cooling systems, and to provide for building recommissioning, building operator training, and opportunities to educate students, teachers, and staff regarding energy efficiency measures implemented at the school.\n(j) The commissioner may require investments or spending greater than the amounts proposed in a plan filed under this subdivision or section 216C.17 for a public utility whose most recent advanced forecast required under section 216B.2422 projects a peak demand deficit of 100 megawatts or more within five years under midrange forecast assumptions.\n(k) A public utility filing a conservation and optimization plan that includes an efficient fuel-switching program must, as part of the filing, demonstrate that the requirements of subdivisions 11 or 12 are met, as applicable.\nThe energy and conservation account is established in the special revenue fund in the state treasury. The commissioner must deposit money assessed or contributed under subdivisions 1d, 1e, 1f, and 7 in the state treasury and credit it to the energy and conservation account in the special revenue fund. Money in the account is appropriated to the commissioner for the purposes of subdivisions 1d, 1e, 1f, and 7. Interest on money in the account accrues to the account.\n(a) The commission shall allow a public utility to recover expenses resulting from an energy conservation and optimization plan approved by the department under this section and contributions and assessments to the energy and conservation account, unless the recovery would be inconsistent with a financial incentive proposal approved by the commission.\n(b) A public utility may file annually, or the Public Utilities Commission may require the public utility to file, and the commission may approve, rate schedules containing provisions for the automatic adjustment of charges for utility service in direct relation to changes in the expenses of the public utility for real and personal property taxes, fees, and permits, the amounts of which the public utility cannot control. A public utility is eligible to file for adjustment for real and personal property taxes, fees, and permits under this subdivision only if, in the year previous to the year in which it files for adjustment, it has spent or invested at least 1.75 percent of its gross revenues from provision of electric service, excluding gross operating revenues from electric service provided in the state to large electric customer facilities for which the commissioner has issued an exemption under subdivision 1a, paragraph (b), and 0.6 percent of its gross revenues from provision of gas service, excluding gross operating revenues from gas services provided in the state to large electric customer facilities for which the commissioner has issued an exemption under subdivision 1a, paragraph (b), for that year for energy conservation improvements under this section.\nMS 2020 [Repealed, 2021 c 29 s 19]\n(a) A preweatherization measure or energy conservation improvement made to or installed in a building in accordance with this section, except systems owned by a public utility and designed to turn off, limit, or vary the delivery of energy, are the exclusive property of the owner of the building except to the extent that the improvement is subjected to a security interest in favor of the public utility in case of a loan to the building owner.\n(b) A public utility has no liability for loss, damage or injury caused directly or indirectly by a preweatherization measure or energy conservation improvement except for negligence by the utility in purchasing, installing, or modifying a preweatherization measure or energy conservation improvement.\nMS 2020 [Repealed, 2021 c 29 s 19]\n(a) Each public utility and consumer-owned utility that provides electric service to retail customers and is subject to subdivision 1c or section 216B.2403 shall include as part of its conservation improvement activities a program to strongly encourage the use of LEDs. The program must include at least a public information campaign to encourage use of LEDs and proper management of spent lamps and LEDs by all customer classifications.\n(b) A public utility that provides electric service at retail to 200,000 or more customers shall establish, either directly or through contracts with other persons, including lamp manufacturers, distributors, wholesalers, and retailers and local government units, a system to collect for delivery to a reclamation or recycling facility spent fluorescent and high-intensity discharge lamps from households and from small businesses as defined in section 645.445 that generate an average of fewer than ten spent lamps per year.\n(c) A collection system must include establishing reasonably convenient locations for collecting spent lamps from households and financial incentives sufficient to encourage spent lamp generators to take the lamps to the collection locations. Financial incentives may include coupons for purchase of new LEDs, a cash back system, or any other financial incentive or group of incentives designed to collect the maximum number of spent lamps from households and small businesses that is reasonably feasible.\n(d) A public utility that provides electric service at retail to fewer than 200,000 customers or a consumer-owned utility that provides electric service at retail to customers may establish a collection system under paragraphs (b) and (c) as part of conservation improvement activities required under this section.\n(e) The commissioner of the Pollution Control Agency may not, unless clearly required by federal law, require a public utility or consumer-owned utility that establishes a household fluorescent and high-intensity discharge lamp collection system under this section to manage the lamps as hazardous waste as long as the lamps are managed to avoid breakage and are delivered to a recycling or reclamation facility that removes mercury and other toxic materials contained in the lamps prior to placement of the lamps in solid waste.\n(f) If a public utility or consumer-owned utility contracts with a local government unit to provide a collection system under this subdivision, the contract must provide for payment to the local government unit of all the unit's incremental costs of collecting and managing spent lamps.\n(g) All the costs incurred by a public utility or consumer-owned utility to promote the use of LEDs and to collect LEDs under this subdivision are conservation improvement spending under this section.\n(h) For the purposes of this subdivision, \"LED\" means a light-emitting diode bulb or lighting product.\n(a) A utility or association may include in its conservation plan programs for the installation of qualifying solar energy projects as defined by section 216B.2411 to the extent of the spending allowed for generation projects by section 216B.2411. The cost-effectiveness of a qualifying solar energy project may be determined by a different standard than for other energy conservation improvements under this section if the commissioner determines it is in the public interest to do so to encourage solar energy projects. Energy savings from qualifying solar energy projects may not be counted toward the minimum energy-savings goal of at least one percent for energy conservation improvements required under subdivision 1c, but may, if the conservation plan is approved:\n(1) be counted toward energy savings above that minimum percentage; and\n(2) be eligible for a performance incentive under section 216B.16, subdivision 6c, or 216B.241, subdivision 2c, that is distinct from the incentive for energy conservation and is based on the competitiveness and cost-effectiveness of solar projects in relation to other potential solar projects available to the utility.\n(b) Qualifying solar energy projects may not be considered when establishing demand-side management targets under section 216B.2422, 216B.243, or any other section of this chapter.\n(a) A natural gas utility may include in its conservation plan purchases of biomethane, and may use up to five percent of the total amount to be spent on energy conservation improvements under this section for that purpose. The cost-effectiveness of biomethane purchases may be determined by a different standard than for other energy conservation improvements under this section if the commissioner determines that doing so is in the public interest in order to encourage biomethane purchases. Energy savings from purchasing biomethane may not be counted toward the minimum energy-savings goal of at least one percent for energy conservation improvements required under subdivision 1c, but may, if the conservation plan is approved:\n(1) be counted toward energy savings above that minimum percentage; and\n(2) be considered when establishing performance incentives under subdivision 2c.\n(b) For the purposes of this subdivision, \"biomethane\" means biogas produced through anaerobic digestion of biomass, gasification of biomass, or other effective conversion processes, that is cleaned and purified into biomethane that meets natural gas utility quality specifications for use in a natural gas utility distribution system.\n(a) For the purpose of this subdivision:\n(1) \"project\" means a solar electric generation project consisting of arrays of solar photovoltaic cells with a capacity of up to two megawatts located on the site of a closed landfill in Olmsted County owned by the Minnesota Pollution Control Agency; and\n(2) \"cooperative electric association\" means a generation and transmission cooperative electric association that has a member distribution cooperative association to which it provides wholesale electric service in whose service territory a project is located.\n(b) A cooperative electric association may elect to count all of its purchases of electric energy from a project toward only one of the following:\n(1) its energy-savings goal under subdivision 1c; or\n(2) its energy objective or standard under section 216B.1691.\n(c) A cooperative electric association may include in its conservation plan purchases of electric energy from a project. The cost-effectiveness of project purchases may be determined by a different standard than for other energy conservation improvements under this section if the commissioner determines that doing so is in the public interest in order to encourage solar energy. The kilowatt hours of solar energy purchased by a cooperative electric association from a project may count for up to 33 percent of its one percent savings goal under subdivision 1c or up to 22 percent of its 1.5 percent savings goal under that subdivision. Expenditures made by a cooperative association for the purchase of energy from a project may not be used to meet the revenue expenditure requirements of subdivisions 1a and 1b.\n(a) For the purposes of this subdivision:\n(1) \"utility\" means a public utility, municipal utility, or cooperative electric association subject to subdivision 1c that provides electric or natural gas service to retail customers; and\n(2) \"on-bill repayment program\" means a program in which a utility collects on a customer's bill repayment of a loan to the customer by an eligible lender to finance the customer's investment in eligible energy conservation or renewable energy projects, and remits loan repayments to the lender.\n(b) A utility may include as part of its conservation improvement plan an on-bill repayment program to enable a customer to finance eligible projects with installment loans originated by an eligible lender. An eligible project is one that is either an energy conservation improvement, or a project installed on the customer's site that uses an eligible renewable energy source as that term is defined in section 216B.2411, subdivision 2, paragraph (b), but does not include mixed municipal solid waste or refuse-derived fuel from mixed municipal solid waste. An eligible renewable energy source also includes solar thermal technology that collects the sun's radiant energy and uses that energy to heat or cool air or water, and meets the requirements of section 216C.25. To be an eligible lender, a lender must:\n(1) have a federal or state charter and be eligible for federal deposit insurance;\n(2) be a government entity, including an entity established under chapter 469, that has authority to provide financial assistance for energy efficiency and renewable energy projects;\n(3) be a joint venture by utilities established under section 452.25; or\n(4) be licensed, certified, or otherwise have its lending activities overseen by a state or federal government agency.\nThe commissioner must allow a utility broad discretion in designing and implementing an on-bill repayment program, provided that the program complies with this subdivision.\n(c) A utility may establish an on-bill repayment program for all customer classes or for a specific customer class.\n(d) A public utility that implements an on-bill repayment program under this subdivision must enter into a contract with one or more eligible lenders that complies with the requirements of this subdivision and contains provisions addressing capital commitments, loan origination, transfer of loans to the public utility for on-bill repayment, and acceptance of loans returned due to delinquency or default.\n(e) A public utility's contract with a lender must require the lender to comply with all applicable federal and state laws, rules, and regulations related to lending practices and consumer protection; to conform to reasonable and prudent lending standards; and to provide businesses that sell, maintain, and install eligible projects the ability to participate in an on-bill repayment program under this subdivision on a nondiscriminatory basis.\n(f) A public utility's contract with a lender may provide:\n(1) for the public utility to purchase loans from the lender with a condition that the lender must purchase back loans in delinquency or default; or\n(2) for the lender to retain ownership of loans with the public utility servicing the loans through on-bill repayment as long as payments are current.\nThe risk of default must remain with the lender. The lender shall not have recourse against the public utility except in the event of negligence or breach of contract by the utility.\n(g) If a public utility customer makes a partial payment on a utility bill that includes a loan installment, the partial payment must be credited first to the amount owed for utility service, including taxes and fees. A public utility may not suspend or terminate a customer's utility service for delinquency or default on a loan that is being serviced through the public utility's on-bill repayment program.\n(h) An outstanding balance on a loan being repaid under this subdivision is a financial obligation only of the customer who is signatory to the loan, and not to any subsequent customer occupying the property associated with the loan. If the public utility purchases loans from the lender as authorized under paragraph (f), clause (1), the public utility must return to the lender a loan not repaid when a customer borrower no longer occupies the property.\n(i) Costs incurred by a public utility under this subdivision are recoverable as provided in section 216B.16, subdivision 6b, paragraph (c), including reasonable incremental costs for billing system modifications necessary to implement and operate an on-bill repayment program and for ongoing costs to operate the program. Costs in a plan approved by the commissioner may be counted toward a utility's conservation spending requirements under subdivisions 1a and 1b. Energy savings from energy conservation improvements resulting from this section may be counted toward satisfying a utility's energy-savings goals under subdivision 1c.\n(j) This subdivision does not require a utility to terminate or modify an existing financing program and does not prohibit a utility from establishing an on-bill financing program in which the utility provides the financing capital.\n(k) A municipal utility or cooperative electric association that implements an on-bill repayment program shall design the program to address the issues identified in paragraphs (d) through (h) as determined by the governing board of the utility or association.\nMS 2008 [Expired]\n(a) The commissioner shall ensure that each public utility subject to subdivision 1c provides energy conservation and efficient fuel-switching programs to low-income households. When approving spending and energy-savings goals for low-income programs, the commissioner shall consider historic spending and participation levels, energy savings achieved by low-income programs, and the number of low-income persons residing in the utility's service territory. Beginning January 1, 2022, a public utility furnishing gas service must spend at least one percent of its most recent three-year average gross operating revenue from residential customers in the state on low-income programs. A public utility that furnishes electric service must spend at least 0.4 percent of its gross operating revenue from residential customers in the state on low-income programs. Beginning in 2024, a public utility that furnishes electric service must spend 0.6 percent of the public utility's gross operating revenue from residential customers in the state on low-income programs.\n(b) To meet the requirements of paragraph (a), a public utility may contribute money to the energy and conservation account established under subdivision 2a. An energy conservation improvement plan must state the amount, if any, of low-income energy conservation improvement funds the public utility will contribute to the energy and conservation account. Contributions must be remitted to the commissioner by February 1 of each year.\n(c) The commissioner shall establish low-income energy conservation programs to utilize contributions made to the energy and conservation account under paragraph (b). In establishing low-income programs, the commissioner shall consult political subdivisions, utilities, and nonprofit and community organizations, especially organizations providing energy and weatherization assistance to low-income households. Contributions made to the energy and conservation account under paragraph (b) must provide programs for low-income households, including low-income renters, in the service territory of the public utility providing the money. The commissioner shall record and report expenditures and energy savings achieved as a result of low-income programs funded through the energy and conservation account in the report required under subdivision 1c, paragraph (f). The commissioner may contract with a political subdivision, nonprofit or community organization, public utility, or consumer-owned utility to implement low-income programs funded through the energy and conservation account.\n(d) A public utility may petition the commissioner to modify its required spending under paragraph (a) if the utility and the commissioner have been unable to expend the amount required under paragraph (a) for three consecutive years.\n(e) Representatives of each public utility must participate in the stakeholder group on multifamily building eligibility for low-income energy conservation programs, as provided under section 216B.2403, subdivision 5, paragraph (e). Notwithstanding the definition of low-income household under section 216B.2402, a public utility may apply the most recent guidelines for eligibility of multifamily buildings to participate in low-income energy conservation programs published by the commissioner under section 216B.2403, subdivision 5, paragraph (e).\n(f) Up to 15 percent of a public utility's spending on low-income programs may be spent on preweatherization measures. A public utility is prohibited from claiming energy savings from preweatherization measures toward the public utility's energy savings goal.\n(g) The commissioner must, by order, establish a list of preweatherization measures eligible for inclusion in low-income programs no later than March 15, 2022.\n(h) A public utility may elect to contribute money to the Healthy AIR account under section 216B.2403, subdivision 5, paragraph (h), to provide preweatherization measures to households eligible for weatherization assistance under section 216C.264. Remediation activities must be executed in conjunction with federal weatherization assistance program services. Money contributed to the account counts toward: (1) the minimum low-income spending requirement in paragraph (a); and (2) the cap on preweatherization measures under paragraph (f).\n(i) The costs and benefits associated with any approved low-income gas or electric conservation improvement program that is not cost-effective when considering the costs and benefits to the public utility may, at the discretion of the utility, be excluded from the calculation of net economic benefits for purposes of calculating the financial incentive to the public utility. The energy and demand savings may, at the discretion of the public utility, be applied toward the calculation of overall portfolio energy and demand savings for purposes of determining progress toward annual goals and in the financial incentive mechanism.\nThe commission or department may assess public utilities subject to this section to carry out the purposes of subdivisions 1d, 1e, and 1f. An assessment under this subdivision must be proportionate to a public utility's gross operating revenue from sales of gas or electric service within Minnesota during the last calendar year, as applicable. Assessments made under this subdivision are not subject to the cap on assessments provided by section 216B.62, or any other law.\n(a) The purpose of this subdivision is to establish cost-effective energy-efficiency performance standards for new and substantially reconstructed commercial, industrial, and institutional buildings that can significantly reduce carbon dioxide emissions by lowering energy use in new and substantially reconstructed buildings. For the purposes of this subdivision, the establishment of these standards may be referred to as Sustainable Building 2030.\n(b) The commissioner shall contract with the Center for Sustainable Building Research at the University of Minnesota to coordinate development and implementation of energy-efficiency performance standards, strategic planning, research, data analysis, technology transfer, training, and other activities related to the purpose of Sustainable Building 2030. The commissioner and the Center for Sustainable Building Research shall, in consultation with utilities, builders, developers, building operators, and experts in building design and technology, develop a Sustainable Building 2030 implementation plan that must address, at a minimum, the following issues:\n(1) training architects to incorporate the performance standards in building design;\n(2) incorporating the performance standards in utility conservation improvement programs; and\n(3) developing procedures for ongoing monitoring of energy use in buildings that have adopted the performance standards.\nThe plan must be submitted to the chairs and ranking minority members of the senate and house of representatives committees with primary jurisdiction over energy policy by July 1, 2009.\n(c) Sustainable Building 2030 energy-efficiency performance standards must be firm, quantitative measures of total building energy use and associated carbon dioxide emissions per square foot for different building types and uses, that allow for accurate determinations of a building's conformance with a performance standard. Performance standards must address energy use by electric vehicle charging infrastructure in or adjacent to buildings as that infrastructure begins to be made widely available. The energy-efficiency performance standards must be updated every three or five years to incorporate all cost-effective measures. The performance standards must reflect the reductions in carbon dioxide emissions per square foot resulting from actions taken by utilities to comply with the renewable energy standards in section 216B.1691. The performance standards should be designed to achieve reductions equivalent to the following reduction schedule, measured against energy consumption by an average building in each applicable building sector in 2003: (1) 60 percent in 2010; (2) 70 percent in 2015; (3) 80 percent in 2020; and (4) 90 percent in 2025. A performance standard must not be established or increased absent a conclusive engineering analysis that it is cost-effective based upon established practices used in evaluating utility conservation improvement programs.\n(d) The annual amount of the contract with the Center for Sustainable Building Research is up to $500,000. The Center for Sustainable Building Research shall expend no more than $150,000 of this amount each year on administration, coordination, and oversight activities related to Sustainable Building 2030. The balance of contract funds must be spent on substantive programmatic activities allowed under this subdivision that may be conducted by the Center for Sustainable Building Research and others, and for subcontracts with not-for-profit energy organizations, architecture and engineering firms, and other qualified entities to undertake technical projects and activities in support of Sustainable Building 2030. The primary work to be accomplished each year by qualified technical experts under subcontracts is the development and thorough justification of recommendations for specific energy-efficiency performance standards. Additional work may include:\n(1) research, development, and demonstration of new energy-efficiency technologies and techniques suitable for commercial, industrial, and institutional buildings;\n(2) analysis and evaluation of practices in building design, construction, commissioning and operations, and analysis and evaluation of energy use in the commercial, industrial, and institutional sectors;\n(3) analysis and evaluation of the effectiveness and cost-effectiveness of Sustainable Building 2030 performance standards, conservation improvement programs, and building energy codes;\n(4) development and delivery of training programs for architects, engineers, commissioning agents, technicians, contractors, equipment suppliers, developers, and others in the building industries; and\n(5) analysis and evaluation of the effect of building operations on energy use.\n(e) The commissioner shall require utilities to develop and implement conservation improvement programs that are expressly designed to achieve energy efficiency goals consistent with the Sustainable Building 2030 performance standards. These programs must include offerings of design assistance and modeling, financial incentives, and the verification of the proper installation of energy-efficient design components in new and substantially reconstructed buildings. A utility's design assistance program must consider the strategic planting of trees and shrubs around buildings as an energy conservation strategy for the designed project. A utility making an expenditure under its conservation improvement program that results in a building meeting the Sustainable Building 2030 performance standards may claim the energy savings toward its energy-savings goal established in subdivision 1c.\n(f) The commissioner shall report to the legislature every three years, beginning January 15, 2010, on the cost-effectiveness and progress of implementing the Sustainable Building 2030 performance standards and shall make recommendations on the need to continue the program as described in this section.\nMS 2020 [Repealed, 2021 c 29 s 19]\n(a) A public utility providing electric service at retail may include in the plan required under subdivision 2 a proposed goal for efficient fuel-switching improvements that the utility expects to achieve under the plan and the programs to implement efficient fuel-switching improvements or combinations of energy conservation improvements, fuel-switching improvements, and load management. For each program, the public utility must provide a proposed budget, an analysis of the program's cost-effectiveness, and estimated net energy and demand savings.\n(b) The department may approve proposed programs for efficient fuel-switching improvements if the department determines the improvements meet the requirements of paragraph (d).\n(c) A public utility may file a rate schedule with the commission that provides for annual cost recovery of reasonable and prudent costs to implement and promote efficient fuel-switching programs. The utility, department, or other entity may propose, and the commission may approve, modify, or reject, a proposal for a financial incentive to encourage efficient fuel-switching programs operated by a public utility providing electric service approved under this subdivision. When making a decision on the financial incentive proposal, the commission must apply the considerations established in section 216B.16, subdivision 6c, paragraphs (b) and (c).\n(d) A fuel-switching improvement is deemed efficient if, applying the technical criteria established under section 216B.241, subdivision 1d, paragraph (e), the improvement meets the following criteria, relative to the fuel that is being displaced:\n(1) results in a net reduction in the amount of source energy consumed for a particular use, measured on a fuel-neutral basis, using (i) the utility's annual system average efficiency, or (ii) if the utility elects, a seasonal, monthly, or more granular level of analysis for the electric utility system over the measure's life;\n(2) results in a net reduction of statewide greenhouse gas emissions as defined in section 216H.01, subdivision 2, over the lifetime of the improvement. For an efficient fuel-switching improvement installed by an electric utility, the reduction in emissions must be measured using (i) the utility's annual average emissions factor, or (ii) if the utility elects, a seasonal, monthly or more granular level of analysis, for the electric utility system over the measure's life; and\n(3) is cost-effective, considering the costs and benefits from the perspective of the utility, participants, and society.\n(e) For purposes of this subdivision, \"source energy\" means the total amount of primary energy required to deliver energy services, adjusted for losses in generation, transmission, and distribution, and expressed on a fuel-neutral basis.\n(a) As part of a public utility's plan filed under subdivision 2, a public utility that provides natural gas service to Minnesota retail customers may propose one or more programs to install electric technologies that reduce the consumption of natural gas by the utility's retail customers as an energy conservation improvement. The commissioner may approve a proposed program if the commissioner, applying the technical criteria developed under section 216B.241, subdivision 1d, paragraph (e), determines that:\n(1) the electric technology to be installed meets the criteria established under section 216B.241, subdivision 11, paragraph (d), clauses (1) and (2); and\n(2) the program is cost-effective, considering the costs and benefits to ratepayers, the utility, participants, and society.\n(b) If a program is approved by the commission under this subdivision, the public utility may count the program's energy savings toward its energy savings goal under section 216B.241, subdivision 1c. Notwithstanding section 216B.2402, subdivision 4, efficient fuel-switching achieved through programs approved under this subdivision is energy conservation.\n(c) A public utility may file rate schedules with the commission that provide annual cost-recovery for programs approved by the department under this subdivision, including reasonable and prudent costs to implement and promote the programs.\n(d) The commission may approve, modify, or reject a proposal made by the department or a utility for an incentive plan to encourage efficient fuel-switching programs approved under this subdivision, applying the considerations established under section 216B.16, subdivision 6c, paragraphs (b) and (c). The commission may approve a financial incentive mechanism that is calculated based on the combined energy savings and net benefits that the commission has determined have been achieved by a program approved under this subdivision, provided the commission determines that the financial incentive mechanism is in the ratepayers' interest.\n(a) A public utility may include in the utility's plan required under subdivision 2 programs to implement load management activities, or combinations of energy conservation improvements, fuel-switching improvements, and load management activities. For each program the public utility must provide a proposed budget, cost-effectiveness analysis, and estimated net energy and demand savings.\n(b) The commissioner may approve a proposed program if the commissioner determines the program is cost-effective, considering the costs and benefits to ratepayers, the utility, participants, and society.\n(c) A public utility providing retail electric service to Minnesota customers may file rate schedules with the commission that provide for annual cost recovery of reasonable and prudent costs incurred to implement and promote cost-effective load management programs approved by the department under this subdivision.\n(d) The commission may approve, modify, or reject a proposal made by the department or a public utility for an incentive plan to encourage investments in load management programs. The commission may approve a proposal that the commission determines:\n(1) is needed to increase the public utility's investment in cost-effective load management;\n(2) is compatible with the interest of the public utility's ratepayers; and\n(3) links the incentive to the public utility's performance in achieving cost-effective load management.\n(e) The commission may structure an incentive plan to encourage cost-effective load management programs as an asset on which a public utility earns a rate of return at a level the commission determines is reasonable and in the public interest.\n(f) The commission may include the net benefits from a load management activity integrated with an energy efficiency program approved under this section in the net benefits of the energy efficiency program for purposes of a financial incentive program under section 216B.16, subdivision 6c, if the department determines the primary purpose of the load management activity is energy efficiency.\n(g) A public utility is not eligible for a financial incentive for a load management program in any year in which the utility achieves energy savings below one percent of gross annual retail energy sales, excluding savings achieved through load management programs.\n(h) The commission may include net benefits from a particular load management activity in an incentive plan under this subdivision or section 216B.16, subdivision 6c, but not both.\n(a) A nonprofit organization with extensive experience implementing energy efficiency programs in Minnesota and conducting efficient technology research in the state may file a proposal with the commissioner of commerce for a program to accelerate deployment and reduce the cost of emerging and innovative efficient technologies and approaches and lead to lower energy costs for Minnesota consumers. Accelerator activities include strategic initiatives with technology manufacturers to improve the efficiency and performance of products, as well as with equipment installers and other key actors in the technology supply chain. Benefits of activities expected from the accelerator include cost effective energy savings for Minnesota utilities, bill savings for Minnesota utility consumers, enhanced employment opportunities in Minnesota, and avoidance of greenhouse gas emissions.\n(b) Prior to developing and filing a proposal, the nonprofit must submit to the commissioner of commerce a notice of intent to file a proposal under this subdivision. The notice of intent must describe the nonprofit's qualifications and eligibility to file a proposal under this subdivision. The commissioner must review the notice of intent and issue a determination of eligibility within 30 days if the commissioner determines the nonprofit meets the required qualifications.\n(c) Upon receiving the determination by the commissioner under paragraph (b), the nonprofit organization must engage with interested stakeholders on at least the following attributes required of a program proposal under this subdivision:\n(1) a proposed budget and operational guidelines for the accelerator;\n(2) a proposed energy savings attribution, evaluation, and allocation methodology that includes a method for calculating net benefits from activities under the program. Energy savings and net benefits from activities under the program must be allocated to participating utilities and be considered when determining cost-effectiveness of achieved energy savings and related incentives;\n(3) a process to ensure that the technologies that are selected for the program benefit electric and natural gas utility customers in proportion to the funds each utility sector contributes to the program and address residential, commercial, and industrial building energy use; and\n(4) a process for identifying and tracking performance metrics for each technology selected against which progress can be measured, including one or more methods for evaluating cost-effectiveness.\n(d) No earlier than 180 days from the date of the commissioner's eligibility determination under paragraph (b), the nonprofit may file a program proposal under this subdivision. The filing must describe how the proposal addresses each of the required attributes listed in paragraph (c), clauses (1) to (4), and how the proposal addresses the recommendations and concerns identified in the stakeholder engagement process required under paragraph (c).\n(e) Within ten days of receiving the proposal, the commissioner must provide public notice of the proposal and solicit feedback from interested parties for a period of not less than ten business days.\n(f) Within 90 days of the filing of the proposal, the commissioner must approve, modify, or reject a proposal under this subdivision. In making a determination, the commissioner must consider public comments, the expected costs and benefits of the program from the perspectives of ratepayers, the participating utilities, and society, and the expected costs and benefits relative to other energy conservation programming authorized under this section.\n(g) The initial program term may be up to five years. At the request of the nonprofit, the commissioner may renew a program approved under paragraph (d) for up to five years at a time. The nonprofit must submit to the commissioner a request to renew the program no later than 180 days prior to the end of the term of the program approved or renewed under this subdivision. When making a request to renew and determination on renewal, the nonprofit and commissioner must follow the process established under this subdivision, except that a qualified nonprofit is not required to seek eligibility under paragraph (b).\n(h) Upon approval, each public utility with over 30,000 customers must participate in the program and contribute to the approved budget of the program by depositing annually in the energy and conservation account under subdivision 2a an amount that is proportional to the utility's gross operating revenue from sales of gas or electric service in Minnesota, excluding revenues from large customer facilities exempted under subdivision 1a. A participating utility must not be required to contribute more than the following percentages of the utility's spending approved by the commission in the plan filed under subdivision 2: (1) two percent in the program's initial two years; (2) 3.5 percent in the program's third and fourth years; and (3) five percent thereafter. Other utilities may elect to participate in the accelerator program. Costs incurred by a public utility under this subdivision are recoverable under subdivision 2b as an assessment to the energy and conservation account. Amounts provided to the account under this subdivision are not subject to the cap on assessments in section 216B.62. The commissioner may make expenditures from the account for the purposes of this subdivision, including amounts necessary to cover administrative costs incurred by the department under this subdivision. Costs for research projects under this subdivision that the commissioner determines may be duplicative to projects that would be eligible for funding under subdivision 1e, paragraph (a), may be deducted from the assessment under subdivision 1e for utilities participating in the accelerator.\n(i) The commissioner must not approve more than one program to be implemented or in operation at any given time under this subdivision.\n(j) At least once during the term of a program that is approved or renewed, the commissioner must contract for an independent review of the program to determine if it meets the objectives and requirements of this section and any criteria established by the department as a condition of approval. The review may not be conducted by an entity or person that acted as a stakeholder or interested party, or otherwise participated in the program preparation, filing, or review process. Upon completion, the reviewer must prepare a report detailing findings and recommendations, and the commissioner must transmit a copy of the report to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over energy policy. Money required to conduct the review and prepare the report must be deducted from the total contribution amount under paragraph (h).",
	"repealed": false
}