{
	"id": "145.903",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.903",
	"title": "145.903 SCHOOL-BASED HEALTH CENTERS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"School-based health center\" or \"comprehensive school-based health center\" means a safety net health care delivery model that is located in or near a school facility and that offers comprehensive health care, including preventive and behavioral health services, provided by licensed and qualified health professionals in accordance with federal, state, and local law. When not located on school property, the school-based health center must have an established relationship with one or more schools in the community and operate to primarily serve those student groups.\n(c) \"Sponsoring organization\" means any of the following that operate a school-based health center:\n(1) health care providers;\n(2) community clinics;\n(3) hospitals;\n(4) federally qualified health centers and look-alikes as defined in section 145.9269;\n(5) health care foundations or nonprofit organizations;\n(6) higher education institutions; or\n(7) local health departments.\n(a) The commissioner of health shall administer a program to provide grants to school districts and school-based health centers to support existing centers and facilitate the growth of school-based health centers in Minnesota.\n(b) Grant funds distributed under this subdivision shall be used to support new or existing school-based health centers that:\n(1) operate in partnership with a school or school district and with the permission of the school or school district board;\n(2) provide health services through a sponsoring organization that meets the requirements in subdivision 1, paragraph (c); and\n(3) provide health services to all students and youth within a school or school district, regardless of ability to pay, insurance coverage, or immigration status, and in accordance with federal, state, and local law.\n(c) The commissioner of health shall administer a grant to a nonprofit organization to facilitate a community of practice among school-based health centers to improve quality, equity, and sustainability of care delivered through school-based health centers; encourage cross-sharing among school-based health centers; support existing clinics; and expand school-based health centers in new communities in Minnesota.\n(d) Grant recipients shall report their activities and annual performance measures as defined by the commissioner in a format and time specified by the commissioner.\n(e) The commissioners of health and of education shall coordinate the projects and initiatives funded under this section with other efforts at the local, state, or national level to avoid duplication and promote coordinated efforts.\n(a) Services provided by a school-based health center may include but are not limited to:\n(1) preventive health care;\n(2) chronic medical condition management, including diabetes and asthma care;\n(3) mental health care and crisis management;\n(4) acute care for illness and injury;\n(5) oral health care;\n(6) vision care;\n(7) nutritional counseling;\n(8) substance abuse counseling;\n(9) referral to a specialist, medical home, or hospital for care;\n(10) additional services that address social determinants of health; and\n(11) emerging services such as mobile health and telehealth.\n(b) Services provided by a school-based health center must not replace the daily student support provided in the school by educational student service providers, including but not limited to licensed school nurses, educational psychologists, school social workers, and school counselors.\nA sponsoring organization that agrees to operate a school-based health center must enter into a memorandum of agreement with the school or school district. The memorandum of agreement must require the sponsoring organization to be financially responsible for the operation of school-based health centers in the school or school district and must identify the costs that are the responsibility of the school or school district, such as Internet access, custodial services, utilities, and facility maintenance. To the greatest extent possible, a sponsoring organization must bill private insurers, medical assistance, and other public programs for services provided in the school-based health centers in order to maintain the financial sustainability of school-based health centers.",
	"repealed": false
}