{
	"id": "175.007",
	"url": "https://www.revisor.mn.gov/statutes/cite/175.007",
	"title": "175.007 ADVISORY COUNCIL ON WORKERS' COMPENSATION; CREATION.",
	"text": "(a) There is created a permanent Council on Workers' Compensation consisting of 12 voting members as follows: the presidents of the largest statewide Minnesota business and organized labor organizations as measured by the number of employees of its business members and in its affiliated labor organizations in Minnesota on July 1, 1992, and every five years thereafter; five additional members representing business, and five additional members representing organized labor. The commissioner of labor and industry shall serve as chair of the council and shall be a nonvoting member. This council does not expire unless the council no longer fulfills the purpose for which the council was established, the council has not met in the last 18 months, or the council does not comply with the registration requirements of section 15.0599, subdivision 3.\n(b) The governor, the majority leader of the senate, the speaker of the house, the minority leader of the senate, and the minority leader of the house of representatives shall each select a business and a labor representative. At least four of the labor representatives shall be chosen from the affiliated membership of the Minnesota AFL-CIO. At least two of the business representatives shall be representatives of small employers as defined in section 177.23, subdivision 13. None of the council members shall represent attorneys, health care providers, qualified rehabilitation consultants, or insurance companies. If the appointing officials cannot agree on a method of appointing the required number of Minnesota AFL-CIO and small business representatives by the second Monday in June of the year in which appointments are made, they shall notify the secretary of state. The distribution of appointments shall then be determined publicly by lot by the secretary of state or a designee in the presence of the appointing officials or their designees on the third Monday in June.\n(c) Each council member shall appoint an alternate. Alternates shall serve in the absence of the member they replace.\n(d) The ten appointed voting members shall serve for terms of five years and may be reappointed.\n(e) The council shall designate liaisons to the council representing workers' compensation insurers; medical, hospital, and rehabilitation providers; and the legal profession. The speaker and minority leader of the house of representatives shall each appoint a caucus member as a liaison to the council. The majority and minority leaders of the senate shall each appoint a caucus member to serve as a liaison to the council.\n(f) The compensation and removal of members shall be as provided in section 15.059.\nThe advisory council shall advise the department in carrying out the purposes of chapter 176. The council shall submit its recommendations with respect to amendments to chapter 176 by February 1 of each year to each regular session of the legislature and shall report its views upon any pending bill relating to chapter 176 to the proper legislative committee. A recommendation may not be made by the council unless it is supported by a majority of the employer members and a majority of the labor members. At the request of the chairs of the senate and house of representatives committees that hear workers' compensation matters, the department shall schedule a meeting of the council with the members of the committees to discuss matters of legislative concern arising under chapter 176.\nMS 1974 [Repealed, 1975 c 315 s 26]\n(a) The council shall meet as frequently as necessary to carry out its duties and responsibilities. The council may also conduct public hearings throughout the state as may be necessary to give interested persons an opportunity to comment and make suggestions on the operation of the state's workers' compensation law.\n(b) The meetings of the council are subject to the state's Open Meeting Law, chapter 13D; except that the six employer voting members and the six labor voting members may meet in separate closed caucuses for the purpose of deliberating on matters before the council. All votes of the council must be public and recorded.\n(a) The assistant commissioner for workers' compensation at the Department of Labor and Industry shall serve as executive director of the council.\n(b) The executive director shall provide administrative support and information to the council in order to allow it to monitor all elements of Minnesota's workers' compensation system. Specific duties of the executive director shall include:\n(1) examining the activities of the various entities involved in Minnesota's workers' compensation system and identifying problem areas for the council's consideration;\n(2) identifying trends and developments in the workers' compensation law of other states, and reporting to the council on issues that are developing and solutions that are being proposed or attempted;\n(3) monitoring the decisions of Minnesota courts, including the Workers' Compensation Court of Appeals and the supreme court, to determine the impact of court decisions on the workers' compensation system;\n(4) monitoring workers' compensation research activities and bringing important research findings and recommendations to the attention of the council; and\n(5) conducting other activities and duties as may be requested by the council.\nThe commissioner of labor and industry shall supply necessary office space, supplies, and staff support to assist the council and its executive director in their duties.",
	"repealed": false
}