{
	"id": "148.512",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.512",
	"title": "148.512 DEFINITIONS.",
	"text": "For the purpose of sections 148.511 to 148.5198, the following terms have the meanings given to them.\n\"Accredited educational institution\" means a university or college that offers speech-language pathology or audiology graduate degrees and that is accredited by the Council on Academic Accreditation in Audiology and Speech-Language Pathology, a body recognized by the United States Department of Education, or an equivalent as determined by the commissioner.\n\"Advisory council\" means the Minnesota Speech-Language Pathologist and Audiologist Advisory Council established under section 214.13, subdivision 4.\n\"Applicant\" means a person who applies to the commissioner for licensure or licensure renewal.\n\"Continuing education sponsor\" means an organization that offers a learning experience designed to promote continuing competency in the procedures and techniques of the practice of speech-language pathology or audiology and whose activities meet the criteria in section 148.5193, subdivision 2.\n\"Audiologist\" means a natural person who engages in the practice of audiology, meets the qualifications required by sections 148.511 to 148.5198, and is licensed by the commissioner under a general, clinical fellowship, doctoral externship, or temporary license. Audiologist also means a natural person using any descriptive word with the title audiologist.\n\"Commissioner\" means the commissioner of health or a designee.\n\"Contact hour\" means an instructional session of 60 consecutive minutes, excluding coffee breaks, registration, meals without a speaker, and social activities.\n\"Continuing education\" is a planned learning experience in speech-language pathology or audiology not including the basic educational program leading to a degree if the education is used by the licensee for credit to achieve a baccalaureate or master's degree in speech-language pathology or audiology.\n\"Credential\" means a license, permit, certification, registration, or other evidence of qualification or authorization to engage in the practice of speech-language pathology or audiology issued by any authority.\n\"Hearing aid\" means a prescribed aid, or any of its parts, worn in the ear canal and designed to or represented as being able to aid human hearing. \"Hearing aid\" includes the aid's parts, attachments, or accessories, including, but not limited to, ear molds and behind the ear (BTE) devices with or without an ear mold. Batteries and cords are not parts, attachments, or accessories of a hearing aid. Surgically implanted hearing aids, and assistive listening devices not worn within the ear canal, are not hearing aids.\n\"Hearing aid dispensing\" means making ear mold impressions, prescribing a hearing aid, assisting the consumer in prescription aid selection, or testing human hearing in connection with these activities regardless of whether the person conducting these activities has a monetary interest in the dispensing of prescription hearing aids to the consumer. Hearing aid dispensing does not include selling over-the-counter hearing aids.\n\"Over-the-counter hearing aid\" or \"OTC hearing aid\" has the meaning given to that term in Code of Federal Regulations, title 21, section 800.30(b).\n[Repealed, 2003 c 87 s 53]\nThe \"practice of audiology\" means:\n(1) identification, assessment, and interpretation, diagnosis, rehabilitation, and prevention of hearing disorders;\n(2) conservation of the auditory system function; development and implementation of hearing conservation programs;\n(3) measurement, assessment, and interpretation of auditory and vestibular function;\n(4) selecting, fitting, and dispensing of assistive listening devices, alerting and amplification devices, and systems for personal and public use, including hearing aids and devices, and providing training in their use;\n(5) aural habilitation and rehabilitation and related counseling for individuals who are deaf, deafblind, and hard-of-hearing and their families;\n(6) screening of speech, language, voice, or fluency for the purposes of audiologic evaluation or identification of possible communication disorders; or\n(7) supervision of the functions in clauses (1) to (6).\nThe practice of audiology does not include the practice of medicine and surgery, or osteopathic medicine and surgery, or medical diagnosis that is commonly performed by a physician.\nThe \"practice of speech-language pathology\" means:\n(1) identification, assessment, and interpretation, diagnosis, habilitation, rehabilitation, treatment and prevention of disorders of speech, articulation, fluency, voice, and language;\n(2) identification, assessment, and interpretation, diagnosis, habilitation, and rehabilitation of disorders of oral-pharyngeal function and related disorders;\n(3) identification, assessment, and interpretation, diagnosis, habilitation, and rehabilitation of communication disorders associated with cognition;\n(4) assessing, selecting, and developing augmentative and alternative communication systems and providing training in their use;\n(5) aural habilitation and rehabilitation and related counseling for individuals who are deaf, deafblind, and hard-of-hearing and their families;\n(6) enhancing speech-language proficiency and communication effectiveness;\n(7) screening individuals for hearing loss or middle ear pathology for the purposes of speech-language evaluation or for the identification of possible hearing disorders; or\n(8) supervision of the functions in clauses (1) to (7).\nThe practice of speech-language pathology does not include the practice of medicine and surgery, or osteopathic medicine and surgery, or medical diagnosis that is commonly performed by a physician.\n\"Prescription hearing aid\" means a hearing aid requiring a prescription from a certified hearing aid dispenser or licensed audiologist that is not an OTC hearing aid.\n\"License\" or \"licensed\" means the act or status of a person who meets the requirements of sections 148.511 to 148.5198.\n\"Licensee\" means an individual who meets the requirements of sections 148.511 to 148.5198.\n\"Licensure\" is the system of regulation defined in section 214.001, subdivision 3, clause (3), and is the process specified in sections 148.511 to 148.5198.\n\"Speech-language pathologist\" means a person who practices speech-language pathology, meets the qualifications under sections 148.511 to 148.5198, and is licensed by the commissioner. Speech-language pathologist also means a natural person using, as an occupational title, a term identified in section 148.513.\n\"Speech-language pathology assistant\" means a person who meets the qualifications under section 148.5181 and provides speech-language pathology services under the supervision of a licensed speech-language pathologist in accordance with section 148.5192.\n[See Note.]\n\"Supervisee\" means a person who, under the direction or evaluation of a supervisor, is:\n(1) engaging in the supervised practice of speech-language pathology or audiology;\n(2) performing a function of supervised clinical training as a student of speech-language pathology or audiology; or\n(3) performing a function of supervised postgraduate or doctoral clinical experience in speech-language pathology or audiology.\n\"Supervision\" means the direct or indirect evaluation or direction of:\n(1) a practitioner of speech-language pathology or audiology;\n(2) a person performing a function of supervised clinical training as a student of speech-language pathology or audiology;\n(3) a person performing a function of supervised postgraduate clinical experience in speech-language pathology or audiology; or\n(4) a speech-language pathology assistant in accordance with section 148.5192.\n\"Supervisor\" means a person who has the authority to direct or evaluate a supervisee and who:\n(1) is a licensed speech-language pathologist or audiologist under section 148.515, 148.516, or 148.517; or\n(2) when the commissioner determines that supervision by a licensed speech-language pathologist or audiologist as required in clause (1) is unobtainable, and in other situations considered appropriate by the commissioner, is a person practicing speech-language pathology or audiology who holds a current certificate of clinical competence from the American Speech-Language-Hearing Association or board certification in audiology by the American Board of Audiology.",
	"repealed": false
}