{
	"id": "245G.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.15",
	"title": "245G.15 CLIENT RIGHTS PROTECTION.",
	"text": "A client has the rights identified in sections 144.651, 148F.165, and 253B.03, as applicable. The license holder must give each client on the day of service initiation a written statement of the client's rights and responsibilities. A staff member must review the statement with a client at that time.\nOn the day of service initiation, the license holder must explain the grievance procedure to the client or the client's representative. The grievance procedure must be posted in a place visible to clients, and made available upon a client's or former client's request. The grievance procedure must require that:\n(1) a staff member helps the client develop and process a grievance;\n(2) current telephone numbers and addresses of the Department of Human Services, Licensing Division; the Office of Ombudsman for Mental Health and Developmental Disabilities; the Department of Health Office of Health Facilities Complaints; and the Board of Behavioral Health and Therapy, when applicable, be made available to a client; and\n(3) a license holder responds to the client's grievance within three days of a staff member's receipt of the grievance, and the client may bring the grievance to the highest level of authority in the program if not resolved by another staff member.\n(a) A photograph, video, or motion picture of a client taken in the provision of treatment service is considered client records. A photograph for identification and a recording by video or audio technology to enhance either therapy or staff member supervision may be required of a client, but may only be available for use as communications within a program. A client must be informed when the client's actions are being recorded by camera or other technology, and the client must have the right to refuse any recording or photography, except as authorized by this subdivision.\n(b) A license holder must have a written policy regarding the use of any personal electronic device that can record, transmit, or make images of another client. A license holder must inform each client of this policy and the client's right to refuse being photographed or recorded.",
	"repealed": false
}