{
	"id": "62W.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62W.10",
	"title": "62W.10 SYNCHRONIZATION.",
	"text": "(a) For purposes of this section, \"synchronization\" means the coordination of prescription drug refills for a patient taking two or more medications for one or more chronic conditions, to allow the patient's medications to be refilled on the same schedule for a given period of time.\n(b) A contract between a pharmacy benefit manager and a pharmacy must allow for synchronization of prescription drug refills for a patient on at least one occasion per year, if the following criteria are met:\n(1) the prescription drugs are covered under the patient's health plan or have been approved by a formulary exceptions process;\n(2) the prescription drugs are maintenance medications as defined by the health plan and have one or more refills available at the time of synchronization;\n(3) the prescription drugs are not Schedule II, III, or IV controlled substances;\n(4) the patient meets all utilization management criteria relevant to the prescription drug at the time of synchronization;\n(5) the prescription drugs are of a formulation that can be safely split into short-fill periods to achieve synchronization; and\n(6) the prescription drugs do not have special handling or sourcing needs that require a single, designated pharmacy to fill or refill the prescription.\n(c) When necessary to permit synchronization, the pharmacy benefit manager must apply a prorated, daily patient cost-sharing rate to any prescription drug dispensed by a pharmacy under this section. The dispensing fee must not be prorated, and all dispensing fees shall be based on the number of prescriptions filled or refilled.\n(d) Synchronization may be requested by the patient or by the patient's parent or legal guardian if the patient is under the age of 18 or is incapacitated as defined in section 524.5-102, or by the patient's health care agent as defined in chapter 145C.",
	"repealed": false
}