{
	"id": "142G.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.40",
	"title": "142G.40 60-MONTH TIME LIMIT; EXEMPTIONS.",
	"text": "(a) Except as otherwise provided for in this section, an assistance unit in which any adult caregiver has received 60 months of cash assistance funded in whole or in part by the TANF block grant in this or any other state or United States territory, or from a tribal TANF program, MFIP, the AFDC program formerly codified in sections 256.72 to 256.87, or the family general assistance program formerly codified in sections 256D.01 to 256D.23, funded in whole or in part by state appropriations, is ineligible to receive MFIP. Any cash assistance funded with TANF dollars in this or any other state or United States territory, or from a tribal TANF program, or MFIP assistance funded in whole or in part by state appropriations, that was received by the unit on or after the date TANF was implemented, including any assistance received in states or United States territories of prior residence, counts toward the 60-month limitation. Months during which any cash assistance is received by an assistance unit with a mandatory member who is disqualified for wrongfully obtaining public assistance under section 256.98, subdivision 8, counts toward the time limit for the disqualified member. The 60-month limit applies to a minor caregiver except under subdivision 4. The 60-month time period does not need to be consecutive months for this provision to apply.\n(b) The months before July 1998 in which individuals received assistance as part of the field trials as an MFIP, MFIP-R, or MFIP or MFIP-R comparison group family are not included in the 60-month time limit.\nIn determining the number of months for which an adult has received assistance under MFIP, the county agency must disregard any month during which the adult lived in Indian country if during the month at least 50 percent of the adults living in Indian country were not employed.\nAny cash assistance received by an assistance unit in a month when a caregiver complied with a safety plan, an alternative employment plan, or an employment plan under section 142G.56, subdivision 3, does not count toward the 60-month limitation on assistance.\n(a) Any cash assistance received by an assistance unit does not count toward the 60-month limit on assistance during a month in which the caregiver is age 60 or older.\n(b) From July 1, 1997, until the date MFIP is operative in the caregiver's county of financial responsibility, any cash assistance received by a caregiver who is complying with Minnesota Statutes 1996, section 256.73, subdivision 5a, and Minnesota Statutes 1998, section 256.736, if applicable, does not count toward the 60-month limit on assistance. Thereafter, any cash assistance received by a minor caregiver who is complying with the requirements of sections 142G.14 and 142G.57, if applicable, does not count towards the 60-month limit on assistance.\n(c) Any diversionary assistance or emergency assistance received prior to July 1, 2003, does not count toward the 60-month limit.\n(d) Any cash assistance received by an 18- or 19-year-old caregiver who is complying with an employment plan that includes an education option under section 142G.57 does not count toward the 60-month limit.\n(e) Payments provided to meet short-term emergency needs under section 142G.76 do not count toward the 60-month time limit.\n[See Note.]\n(a) Within 180 days, but not less than 60 days, before the end of the participant's 60th month on assistance, the county agency or job counselor must review the participant's case to determine if the employment plan is still appropriate and attempt to meet with the participant face-to-face.\n(b) During the face-to-face meeting, a county agency or the job counselor must:\n(1) inform the participant how many months of counted assistance the participant has accrued and when the participant is expected to reach the 60th month;\n(2) explain the hardship extension criteria under section 142G.42 and what the participant should do if the participant thinks a hardship extension applies;\n(3) identify other resources that may be available to the participant to meet the needs of the family; and\n(4) inform the participant of the right to appeal the case closure under section 142G.45.\n(c) If a face-to-face meeting is not possible, the county agency must send the participant a notice of adverse action as provided in section 142G.21, subdivisions 4 and 5.\n(d) Before a participant's case is closed under this section, the county must ensure that:\n(1) the case has been reviewed by the job counselor's supervisor or the review team designated by the county to determine if the criteria for a hardship extension, if requested, were applied appropriately; and\n(2) the county agency or the job counselor attempted to meet with the participant face-to-face.",
	"repealed": false
}