{
	"id": "216D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/216D.06",
	"title": "216D.06 DAMAGE TO FACILITY.",
	"text": "(a) If any damage occurs to an underground facility or its protective covering, the excavator shall notify the operator promptly. When the operator receives a damage notice, the operator shall promptly dispatch personnel to the damage area to investigate. If the damage results in the escape of any flammable, toxic, or corrosive gas or liquid or endangers life, health, or property, the excavator responsible shall immediately notify the operator and the 911 public safety answering point, as defined in section 403.02, subdivision 19, and take immediate action to protect the public and property. The excavator shall also attempt to minimize the hazard until arrival of the operator's personnel or until emergency responders have arrived and completed their assessment. The 911 public safety answering point shall maintain a response plan for notifications generated by this section.\n(b) An excavator shall delay backfilling in the immediate area of the damaged underground facilities until the damage has been investigated by the operator, unless the operator authorizes otherwise. The repair of damage must be performed by the operator or by qualified personnel authorized by the operator.\n(c) An excavator who knowingly damages an underground facility, and who does not notify the operator as soon as reasonably possible or who backfills in violation of paragraph (b), is guilty of a misdemeanor.\n(a) If an excavator damages an underground facility, the excavator shall reimburse the operator for the cost of necessary repairs, and for a pipeline the cost of the product that was being carried in the pipeline and was lost as a direct result of the damage.\n(b) Reimbursement is not required if the damage to the underground facility was caused by the sole negligence of the operator or the operator failed to comply with section 216D.04, subdivision 3.\nMS 2022 [Repealed, 2024 c 104 art 1 s 110]",
	"repealed": false
}