{
	"id": "327.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.20",
	"title": "327.20 RULES.",
	"text": "No domestic animals or house pets of occupants of manufactured home parks or recreational camping areas shall be allowed to run at large, or commit any nuisances within the limits of a manufactured home park or recreational camping area. Each manufactured home park or recreational camping area licensed under the provisions of sections 327.10, 327.11, and 327.14 to 327.28 shall, among other things, provide for the following:\n(1) A responsible attendant or caretaker shall be in charge of every manufactured home park or recreational camping area at all times, who shall maintain the park or area, and its facilities and equipment in a clean, orderly and sanitary condition. In any manufactured home park containing more than 50 lots, the attendant, caretaker, or other responsible park employee, shall be readily available at all times in case of emergency.\n(2) All manufactured home parks shall be well drained and be located so that the drainage of the park area will not endanger any water supply. No wastewater from manufactured homes or recreational camping vehicles shall be deposited on the surface of the ground. All sewage and other water carried wastes shall be discharged into a municipal sewage system whenever available. When a municipal sewage system is not available, a sewage disposal system acceptable to the state commissioner of health shall be provided.\n(3) No manufactured home shall be located closer than three feet to the side lot lines of a manufactured home park, if the abutting property is improved property, or closer than ten feet to a public street or alley. Each individual site shall abut or face on a driveway or clear unoccupied space of not less than 16 feet in width, which space shall have unobstructed access to a public highway or alley. There shall be a space of at least ten feet between the sides of adjacent manufactured homes including their attachments and at least three feet between manufactured homes when parked end to end. The space between manufactured homes may be used for the parking of motor vehicles and other property. The requirements of this paragraph shall not apply to recreational camping areas and variances may be granted by the state commissioner of health in manufactured home parks when the variance is applied for in writing and in the opinion of the commissioner the variance will not endanger the health, safety, and welfare of manufactured home park occupants.\n(4) An adequate supply of water of safe, sanitary quality shall be furnished at each manufactured home park or recreational camping area. The source of the water supply shall first be approved by the state Department of Health.\n(5) All plumbing shall be installed in accordance with the rules of the state commissioner of labor and industry and the provisions of the Minnesota Plumbing Code.\n(6) In the case of a manufactured home park with less than ten manufactured homes, a plan for the sheltering or the safe evacuation to a safe place of shelter of the residents of the park in times of severe weather conditions, such as tornadoes, high winds, and floods. The shelter or evacuation plan shall be developed with the assistance and approval of the municipality where the park is located and shall be posted at conspicuous locations throughout the park. The park owner shall provide each resident with a copy of the approved shelter or evacuation plan, as provided by section 327C.025. Nothing in this paragraph requires the Department of Health to review or approve any shelter or evacuation plan developed by a park. Failure of a municipality to approve a plan submitted by a park shall not be grounds for action against the park by the Department of Health if the park has made a good faith effort to develop the plan and obtain municipal approval.\n(7) A manufactured home park with ten or more manufactured homes, licensed prior to March 1, 1988, shall provide a safe place of shelter for park residents or a plan for the evacuation of park residents to a safe place of shelter within a reasonable distance of the park for use by park residents in times of severe weather, including tornadoes and high winds. The shelter or evacuation plan must be approved by the municipality by March 1, 1989. The municipality may require the park owner to construct a shelter if it determines that a safe place of shelter is not available within a reasonable distance from the park. A copy of the municipal approval and the plan shall be submitted by the park owner to the Department of Health. The park owner shall provide each resident with a copy of the approved shelter or evacuation plan, as provided by section 327C.025.\n(8) A manufactured home park with ten or more manufactured homes, receiving an initial license after March 1, 1988, must provide the type of shelter required by section 327.205, except that for manufactured home parks established as temporary, emergency housing in a disaster area declared by the President of the United States or the governor, an approved evacuation plan may be provided in lieu of a shelter for a period not exceeding 18 months.\n(9) For the purposes of this subdivision, \"park owner\" and \"resident\" have the meanings given them in section 327C.015.\nThe state Department of Health may prescribe such rules for the operation and maintenance of manufactured home parks or recreational camping areas and for safeguarding the health and safety of persons occupying licensed manufactured home parks and recreational camping areas as the department shall deem to be necessary and expedient. Such rules pertaining to health and safety shall have the force and effect of law.\nA manufactured home park owner shall maintain streets and roadways in the park so as to permit passage of emergency vehicles and normal resident travel.\nEach special event camping area licensed under sections 327.10, 327.11, and 327.14 to 327.28 is subject to this section.\n(1) Recreational camping vehicles and tents, including attachments, must be separated from each other and other structures by at least seven feet.\n(2) A minimum area of 300 square feet per site must be provided and the total number of sites must not exceed one site for every 300 square feet of usable land area.\n(3) Each site must abut or face a driveway or clear unoccupied space of at least 16 feet in width, which space must have unobstructed access to a public roadway.\n(4) If no approved on-site water supply system is available, hauled water may be used, provided that persons using hauled water comply with Minnesota Rules, parts 4720.4000 to 4720.4600.\n(5) Nonburied sewer lines may be permitted provided they are of approved materials, watertight, and properly maintained.\n(6) If a sanitary dumping station is not provided on site, arrangements must be made with a licensed sewage pumper to service recreational camping vehicle holding tanks as needed.\n(7) Toilet facilities must be provided consisting of toilets connected to an approved sewage disposal system, portable toilets, or approved, properly constructed privies.\n(8) Toilets must be provided in the ratio of one toilet for each sex for each 150 sites.\n(9) Toilets must be not more than 400 feet from any site.\n(10) If a central building or buildings are provided with running water, then toilets and handwashing lavatories must be provided in the building or buildings that meet the requirements of this subdivision.\n(11) Showers, if provided, must be provided in the ratio of one shower for each sex for each 250 sites. Showerheads must be provided, where running water is available, for each camping event exceeding two nights.\n(12) Central toilet and shower buildings, if provided, must be constructed with adequate heating, ventilation, and lighting, and floors of impervious material sloped to drain. Walls must be of a washable material. Permanent facilities must meet the requirements of the Americans with Disabilities Act.\n(13) An adequate number of durable, covered, watertight containers must be provided for all garbage and refuse. Garbage and refuse must be collected as often as necessary to prevent nuisance conditions.\n(14) Campgrounds must be located in areas free of poison ivy or other noxious weeds considered detrimental to health. Sites must not be located in areas of tall grass or weeds and sites must be adequately drained.\n(15) Campsites for recreational vehicles may not be located on inclines of greater than eight percent grade or one inch drop per linear foot.\n(16) A responsible attendant or caretaker must be available on site at all times during the operation of any special event recreational camping area that has 50 or more sites.",
	"repealed": false
}