{
	"id": "325N.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/325N.18",
	"title": "325N.18 ENFORCEMENT.",
	"text": "A violation of sections 325N.10 to 325N.17 is considered to be a violation of section 325F.69, and all the remedies of section 8.31 are available for such an action. A private right of action under section 8.31 by an owner is in the public interest.\nNotwithstanding any other provision of this section, no action may be brought on the basis of a violation of sections 325N.10 to 325N.18, except by an owner against whom the violation was committed or by the attorney general. This limitation does not apply to administrative action by the commissioner of commerce.\nIn a private right of action under section 8.31 for a violation of section 325N.17, the court may award exemplary damages of any amount. In the event the court determines that an award of exemplary damages is appropriate, the amount of exemplary damages awarded shall not be less than 1-1/2 times the owner's actual damages. Any claim for exemplary damages brought pursuant to this section must be commenced within four years after the date of the alleged violation.\nThe remedies provided in this section are cumulative and do not restrict any remedy that is otherwise available. The provisions of sections 325N.10 to 325N.18 are not exclusive and are in addition to any other requirements, rights, remedies, and penalties provided by law. No action under this section shall affect the rights in the foreclosed property held by a good faith purchaser for value under sections 507.34, 508.48, 508A.48, or other applicable law.\nAny equity purchaser who engages in any practice which would operate as a fraud or deceit upon an owner may, upon conviction, be fined not more than $50,000 or imprisoned not more than 364 days, or both. Prosecution or conviction for any one of the violations does not bar prosecution or conviction for any other offenses.\nFailure of the parties to complete the reconveyance transaction, in the absence of additional misconduct, shall not subject an equity purchaser to the criminal penalties under this section or section 325N.07.\n(a) A court hearing an eviction action against an owner must issue an automatic stay, without imposition of a bond, if a defendant makes a prima facie showing that the defendant:\n(1) has (i) commenced an action concerning a property reconveyance; (ii) asserts a defense under section 504B.121 that the property that is the subject of the eviction action is also the subject of a property reconveyance in violation of sections 325N.10 to 325N.17; or (iii) asserts a claim or affirmative defense of fraud, false pretense, false promise, misrepresentation, misleading statement, or deceptive practice, in connection with a property reconveyance;\n(2) owned the covered residence;\n(3) conveyed title to the covered residence to a third party upon a promise that the defendant would be allowed to occupy the covered residence or other real property in which the equity purchaser or a person acting in participation with the equity purchaser has an interest and that the covered residence or other real property would be the subject of a property reconveyance; and\n(4) since the conveyance, has continuously occupied the covered residence or other real property in which the equity purchaser or a person acting in participation with the equity purchaser has an interest.\nFor purposes of this subdivision, notarized affidavits are acceptable means of proof to meet the defendant's burden. Upon good cause shown, a defendant may request and the court may grant up to an additional two weeks to produce evidence required to make the prima facie showing.\n(b) A court may award to a plaintiff a $500 penalty upon a showing that the defendant filed a frivolous claim or asserted a frivolous defense.\n(c) The automatic stay expires upon the later of:\n(1) the failure of the owner to commence an action in a court of competent jurisdiction in connection with a property reconveyance transaction within 90 days after the issuance of the stay; or\n(2) the issuance of an order lifting the stay by a court hearing claims related to the property reconveyance.\n(d) If, after the expiration of the stay or an order lifting the stay, a court finds that the defendant's claim or defense was asserted in bad faith and wholly without merit, the court may impose a sanction against the defendant of $500 plus reasonable attorney fees.",
	"repealed": false
}