{
	"id": "446A.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.075",
	"title": "446A.075 SMALL COMMUNITY WASTEWATER TREATMENT PROGRAM.",
	"text": "A small community wastewater treatment account is created in the special revenue fund. The authority shall make loans and grants from the account as provided in this section. Money in the fund is annually appropriated to the authority and does not lapse. The account shall be credited with all loan repayments and investment income from the account and servicing fees assessed under section 446A.04, subdivision 5. The authority shall manage and administer the small community wastewater treatment account and for these purposes, may exercise all powers provided in this chapter.\nIf requested, and if it is an eligible use of funds, the authority may provide technical assistance grants to governmental units seeking to address noncomplying subsurface sewage treatment systems. A grant under this subdivision must not exceed $20,000 plus $1,000 per household, for a maximum total of $60,000. Technical assistance grant funds may be used by a county recipient to pay its qualified staff for services listed in clauses (1) to (3) or by a governmental unit to contract with a licensed subsurface sewage treatment system business, county, the University of Minnesota on-site sewage treatment program, a regional development commission, or other qualified nonprofit organization for one or more of the following services:\n(1) conduct site evaluations and prepare a report by a certified subsurface sewage treatment system designer indicating the feasibility of installing new subsurface sewage treatment systems meeting the requirements of section 115.55;\n(2) provide independent advice on the feasibility of subsurface sewage treatment system alternatives; and\n(3) assist the governmental unit to develop the technical, managerial, and financial capacity necessary to build, operate, and maintain subsurface sewage treatment systems.\n(a) The authority may award loans and grants as provided in this subdivision to governmental units from the small community wastewater treatment account for projects to replace noncomplying subsurface sewage treatment systems with a subsurface sewage treatment system or systems meeting the requirements of section 115.55 or a land-based treatment system with a state disposal system permit. A governmental unit receiving a loan or grant from the account shall own the subsurface sewage treatment systems built under the program and shall be responsible, either directly or through a contract with a private vendor, for all inspections, maintenance, and repairs necessary to ensure proper operation of the systems.\n(b) Loans as provided in subdivision 6 may be awarded for up to 100 percent of eligible project costs minus any grants awarded under paragraph (c) or from other sources.\n(c) The authority may award a grant to a project if the estimated average annual residential wastewater system cost after completion of the project would otherwise exceed 1.4 percent of the median household income of the project service area. In determining the estimated average annual residential wastewater system cost, the authority must consider the total costs associated with building, operating, and maintaining the wastewater system including debt service. The amount of the grant shall be 80 percent of the amount needed to reduce the average annual residential wastewater system cost to 1.4 percent of the median household income, but not to exceed 80 percent of the eligible project cost minus any other grants.\nGovernmental units seeking loans or grants from the small community wastewater treatment program shall first submit a project proposal to the Pollution Control Agency on a form prescribed by the Pollution Control Agency. A project proposal shall include the compliance status for all subsurface sewage treatment systems in the project area. The Pollution Control agency shall rank project proposals on its project priority list used for the clean water revolving fund under section 446A.07.\nGovernmental units with projects on the project priority list shall submit applications for loans or grants under this program to the authority on forms prescribed by the authority. An application for technical assistance funds shall include the number of households served by subsurface sewage treatment systems in the community and a work plan and schedule for the proposed use of funds. An application for construction funds shall include:\n(1) a list of the subsurface sewage treatment systems proposed to be replaced over a period of up to three years;\n(2) a project schedule and cost estimate for each year of the project;\n(3) a financing plan for repayment of the loan; and\n(4) a management plan providing for the inspection, maintenance, and repairs necessary to ensure proper operation of the systems.\n(a) The authority must award loans and grants as provided in this section to governmental units with approved applications based on their ranking on the Pollution Control Agency's project priority list.\n(b) Except as provided in paragraph (c), prior to the award of construction loans or grants under subdivision 2, paragraph (b), the Pollution Control Agency shall certify that the land-based treatment systems to be built are designed according to the criteria set forth in section 115.55 and rules of the Pollution Control Agency.\n(c) If a governmental unit receives preliminary approval by the Pollution Control Agency of its feasibility report prepared under subdivision 1a, clause (1), the authority may make a partial construction award for eligible design costs.\n(d) The total amount awarded for a construction project under subdivision 2 must not exceed $2,000,000.\nLoans from the small community wastewater treatment account shall comply with the following terms and conditions:\n(1) principal and interest payments must begin no later than two years after the loan is awarded;\n(2) loans shall carry an interest rate of one percent;\n(3) loans shall be fully amortized within 20 years but not to exceed the expected design life of the system;\n(4) a governmental unit receiving a loan must establish a dedicated source or sources of revenues for repayment of the loan and must issue a general obligation note to the authority for the full amount of the loan; and\n(5) each property owner voluntarily seeking assistance for repair or replacement of an individual treatment system under this program must provide a utility easement to the governmental unit to allow access to the system for management and repairs.\n(a) A governmental unit receiving a loan under this section that levies special assessments to repay the loan may defer payment of the assessments under the provisions of sections 435.193 to 435.195.\n(b) A governmental unit that defers payment of special assessments for one or more properties under paragraph (a) may request deferral of that portion of the debt service on its loan, and the authority shall accept appropriate amendments to the general obligation note of the governmental unit. If special assessment payments are later received from properties that received a deferral, the funds received shall be paid to the authority with the next scheduled loan payment.\n(a) Eligible costs for technical assistance grants as provided in subdivision 1a shall include the cost of soil borings.\n(b) Eligible costs for construction loans and grants shall include the costs for design, construction, related legal fees, and land acquisition.\nLoan and grant disbursements by the authority under this section must be made for eligible project costs as incurred by the recipients, and must be made in accordance with the project loan or grant and loan agreement and applicable state law.\nA governmental unit receiving a loan under this section must annually provide to the authority for the term of the loan a copy of its annual independent audit or, if the governmental unit is not required to prepare an independent audit, a copy of the annual financial reporting form it provides to the state auditor.",
	"repealed": false
}