{
	"id": "256B.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.27",
	"title": "256B.27 MEDICAL ASSISTANCE; COST REPORTS.",
	"text": "In the interests of efficient administration of the medical assistance to the needy program and incident to the approval of rates and charges therefor, the commissioner of human services may require any reports, information, and audits of medical vendors which the commissioner deems necessary.\nAll reports as to the costs of operations or of medical care provided which are submitted by vendors of medical care for use in determining their rates or reimbursement shall be submitted under oath as to the truthfulness of their contents by the vendor or an officer or authorized representative of the vendor.\n[Repealed, 2016 c 99 art 1 s 43]\nThe commissioner of human services, with the written consent of the recipient, on file with the local welfare agency, shall be allowed access in the manner and within the time prescribed by the commissioner to all personal medical records of medical assistance recipients solely for the purposes of investigating whether or not: (a) a vendor of medical care has submitted a claim for reimbursement, a cost report or a rate application which is duplicative, erroneous, or false in whole or in part, or which results in the vendor obtaining greater compensation than the vendor is legally entitled to; or (b) the medical care was medically necessary. When the commissioner is investigating a possible overpayment of Medicaid funds, the commissioner must be given immediate access without prior notice to the vendor's office during regular business hours and to documentation and records related to services provided and submission of claims for services provided. The department shall document in writing the need for immediate access to records related to a specific investigation. Denying the commissioner access to records is cause for the vendor's immediate suspension of payment or termination according to section 256B.064. The determination of provision of services not medically necessary shall be made by the commissioner. Notwithstanding any other law to the contrary, a vendor of medical care shall not be subject to any civil or criminal liability for providing access to medical records to the commissioner of human services pursuant to this section.\nA person determined to be eligible for medical assistance shall be deemed to have authorized the commissioner of human services in writing to examine, for the investigative purposes identified in subdivision 3, all personal medical records developed while receiving medical assistance.\nMedical records obtained by the commissioner of human services pursuant to this section are private data, as defined in section 13.02, subdivision 12.",
	"repealed": false
}