{
	"id": "116A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.20",
	"title": "116A.20 BOND ISSUES.",
	"text": "The county board of each county is authorized, at any time after the establishment of any system, or the formation of any district under section 116A.02, subdivision 4, to issue the bonds of the county in such amount as may be necessary to defray, in whole or in part, the cost of establishing and constructing a system. The board may in like manner issue bonds to pay the cost of improvement or extension of any system, when ordered in accordance with section 116A.12. It may also issue bonds to refund outstanding bonds issued pursuant to this section, in accordance with chapter 475.\nSuch bonds shall be sold and issued in accordance with chapter 475, as amended, and shall pledge the full faith, credit, and resources of the county for the prompt payment of principal and interest. An election shall be required to authorize bonds to be issued under this section, unless the board or court having jurisdiction of the system has determined that special assessments and revenues are sufficient for their payment, by order entered pursuant to section 116A.12, subdivision 8. The bonds shall be further secured by pledge of the net revenues from the systems financed by the bonds to the debt redemption fund, and a covenant that rates and charges shall be established for the service of such system, sufficient to pay all costs of operation and maintenance thereof and to produce net revenues adequate, with special assessments received in the fund, to pay all of the bonds and interest thereon when due.\nThe bonds shall be payable at such time or times, not to exceed (1) 30 years from their date or (2) 40 years or the useful life of the asset, whichever is less, if financed or guaranteed by the United States Department of Agriculture, and bear such rate or rates of interest not exceeding eight percent per annum, payable annually or semiannually as the county board shall by resolution determine. The years and amounts of principal maturities shall be such as in the opinion of the county board are warranted by the anticipated collections of the water and sewer improvement assessments without regard to any limitations on such maturities imposed by section 475.54.\nEach bond shall contain a recital that it is issued by authority of and in strict accordance with sections 116A.01 to 116A.26. The recital shall be conclusive in favor of the holders of the bonds, that the water or sewer improvement has been properly established, that property within the county is subject to assessment for benefits in amount not less than the amount of the bonds, and that all proceedings relative to the construction of the system or systems financed by the bonds have been or will be taken according to law.\nThe board shall pay the principal of and interest on bonds issued under the provisions of this section out of any available funds in the county treasury when the moneys on hand in the fund from which they are primarily payable are insufficient therefor; but the funds from which said moneys have been taken shall be replenished with interest for the time actually needed at the rate of eight percent per annum from the assessments levied for the water or sewer or combined system or from the net revenues of the system or from the taxes, if any, levied for the payment of principal and interest on the bonds.\nNotwithstanding anything in sections 116A.01 to 116A.26 to the contrary, the county board of each county is authorized, at any time after the conditions in subdivision 1 exist, to issue for any of the purposes set forth in subdivision 1, general obligation temporary bonds in anticipation of and in an amount not to exceed any grant or loan of state or federal funds. Such bonds shall mature within not more than three years from the date of issuance and shall otherwise be sold and issued in accordance with chapter 475, and shall pledge the full faith, credit, and resources of the county for the prompt payment of the principal and interest thereof, except that no election shall be required and the debt limitations of chapter 475 shall not apply to such bonds. Prior to the issuance of such bonds, the board shall secure a commitment for the grant or loan in anticipation of which the bonds are to be issued, and if any of the bonds are to be issued in anticipation of a loan, the board shall also determine that all conditions exist precedent to the authorization of definitive bonds in an amount equal at least to the principal sum of the loan. In the event such temporary bonds are issued, the proceeds of the grant or loan when received shall be irrevocably appropriated to the sinking fund for the temporary bonds, and the estimated amount thereof may be deducted from the tax which would otherwise be required by section 475.61, subdivision 1, to be levied. The provisions of subdivision 4 shall apply to such bonds. Any amount of the temporary bonds which cannot be paid at maturity from the proceeds of the grant or loan or from any other funds appropriated by the board for the purpose, shall be paid from the proceeds of definitive obligations to be issued and sold before the maturity date in accordance with subdivisions 2, 3 and 4, except that no election shall be required; or, if sufficient funds are not available for payment in full of the temporary obligations at maturity, the holders thereof shall have the right to require the issuance in exchange therefor of such definitive obligations bearing interest at the maximum rate permitted by law.",
	"repealed": false
}