{
	"id": "611A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.32",
	"title": "611A.32 DOMESTIC ABUSE PROGRAMS.",
	"text": "The commissioner shall award grants to programs which provide emergency shelter services, housing supports, and support services to domestic abuse victims and their children. The commissioner shall also award grants for training, technical assistance, and for the development and implementation of education programs to increase public awareness of the causes of domestic abuse, the solutions to preventing and ending domestic violence, and the problems faced by domestic abuse victims. Grants shall be awarded in a manner that ensures that they are equitably distributed to programs serving metropolitan and nonmetropolitan populations.\nThe commissioner shall establish at least one program under this section to provide emergency shelter services and support services to American Indian domestic abuse victims and their children. The commissioner shall grant continuing operating expenses to the program established under this subdivision in the same manner as operating expenses are granted to programs established under subdivision 1.\nAny public or private nonprofit agency may apply to the commissioner for a grant to provide emergency shelter services, housing supports, support services, and one or more of these services and supports to domestic abuse victims and their children. The application shall be submitted in a form approved by the commissioner by rule adopted under chapter 14 and shall include:\n(1) a proposal for the provision of emergency shelter services, housing supports, support services, and one or more of these services and supports for domestic abuse victims and their children;\n(2) a proposed budget;\n(3) the agency's overall operating budget, including documentation on the retention of financial reserves and availability of additional funding sources;\n(4) evidence of an ability to integrate into the proposed program the uniform method of data collection and program evaluation established under section 611A.33;\n(5) evidence of an ability to represent the interests of domestic abuse victims and their children to local law enforcement agencies and courts, county welfare agencies, and local boards or departments of health;\n(6) evidence of an ability to do outreach to unserved and underserved populations and to provide culturally and linguistically appropriate services; and\n(7) any other content the commissioner may require by rule adopted under chapter 14.\nPrograms which have been approved for grants in prior years may submit materials which indicate changes in items listed in clauses (1) to (7), in order to qualify for renewal funding. Nothing in this subdivision may be construed to require programs to submit complete applications for each year of renewal funding.\nEvery public or private nonprofit agency which receives a grant to provide emergency shelter services, housing supports, or support services to domestic abuse victims shall comply with all rules of the commissioner related to the administration of the programs.\n[Repealed, 1991 c 272 s 20]\nPersonal history information and other information collected, used or maintained by a grantee from which the identity or location of any victim of domestic abuse may be determined is private data on individuals, as defined in section 13.02, subdivision 12, and the grantee shall maintain the data in accordance with the provisions of chapter 13.",
	"repealed": false
}