{
	"id": "245.473",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.473",
	"title": "245.473 ACUTE CARE HOSPITAL INPATIENT SERVICES.",
	"text": "By July 1, 1988, county boards must make available through contract or direct provision enough acute care hospital inpatient treatment services as close to the county as possible for adults with mental illness residing in the county. Acute care hospital inpatient treatment services must be designed to:\n(1) stabilize the medical and mental health condition for which admission is required;\n(2) improve functioning to the point where discharge to residential treatment or community-based mental health services is possible; and\n(3) facilitate appropriate referrals for follow-up mental health care in the community.\nProviders of acute care hospital inpatient services must meet applicable standards established by the commissioners of health and human services.\nNo later than January 1, 1992, the county board shall ensure that placement decisions for acute care inpatient services are based on the clinical needs of the adult. The county board shall ensure that each entity under contract with the county to provide acute care hospital treatment services has admission, continued stay, discharge criteria and discharge planning criteria as part of the contract. Contracts shall specify specific responsibilities between the county and service providers to ensure comprehensive planning and continuity of care between needed services according to data privacy requirements. All contracts for the provision of acute care hospital inpatient treatment services must include provisions guaranteeing clients the right to appeal under section 245.477 and to be advised of their appeal rights.\nExcept for services reimbursed under chapters 256B and 256D, the county board shall enter into an individual placement agreement with a provider of acute care hospital inpatient treatment services to an adult eligible for services under this section. The agreement must specify the payment rate and the terms and conditions of county payment for the placement.",
	"repealed": false
}