{
	"id": "462A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.20",
	"title": "462A.20 HOUSING DEVELOPMENT FUND; CREATION, SOURCES.",
	"text": "There is created and established under the jurisdiction and control of the agency a revolving fund to be known as the \"housing development fund.\"\nThere shall be paid into the housing development fund:\n(1) any moneys appropriated and made available by the state for the purposes of the fund;\n(2) any moneys which the agency receives in repayment of advances made from the fund;\n(3) any other moneys which may be made available to the agency for the purpose of the fund from any other source or sources;\n(4) all fees and charges collected by the agency;\n(5) all interest or other income not required by the provisions of a resolution or indenture securing notes or bonds to be paid into another special fund.\nWhenever any money is appropriated by the state to the agency solely for a specified purpose or purposes, the agency shall establish a separate bookkeeping account or accounts in the housing development fund to record the receipt and disbursement of such money and of the income, gain, and loss from the investment and reinvestment thereof. Earnings from investment of any amounts appropriated by the state to the agency for a specified purpose or purposes may be aggregated. The costs and expenses necessary and incidental to the development and operation of all programs funded by state appropriations may be paid from the aggregated earnings from investments prior to periodic distributions of earnings to separate accounts to be used for the same purpose as the respective original appropriation. The agency may transfer unencumbered balances from one appropriated account to another, provided that no money appropriated for the purpose of agency loan programs may be transferred to an account to be used for making grants, except that money appropriated for the purpose of section 462A.05, subdivision 14a, may be transferred for the purpose of section 462A.05, subdivision 15a.\nOn or before February 15 of each year, the agency shall deliver a report to the chairs of the finance and appropriations committees of the legislature on the costs of operating the agency in the previous fiscal year. The report shall include the expenditures for salaries and benefits, rent, professional and technical services, general agency administration, and agency's audited financial statements which include information on expenditures and receipts relating to debt issuance and administration and loan origination and administration. The report shall include a budget plan for salaries and benefits, rent, professional and technical services, and general administration for the current fiscal year, including estimates of changes in costs from the previous fiscal year. If it appears that the costs in the current fiscal year will exceed the budget plan contained in the report submitted under this subdivision, the agency must notify the chairs of the legislative committees or divisions with jurisdiction over the agency's budget that the costs in the current fiscal year will exceed the submitted budget plan and the reasons for the changes in costs and must submit a revised budget plan to the commissioner of management and budget and obtain the commissioner's concurrence with the revised plan. The agency must also notify the chairs of the legislative committees or divisions with jurisdiction over the agency's budget when the agency is considering an expansion of agency activities that were not contemplated in the submitted budget plan.",
	"repealed": false
}