{
	"id": "484.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.70",
	"title": "484.70 REFEREE POSITIONS, RULES.",
	"text": "The chief judge of the judicial district may appoint one or more suitable persons to act as referees. Referees shall hold office at the pleasure of the judges of the district court and shall be learned in the law, except that persons holding the office of referee on January 1, 1983, may continue to serve under the terms and conditions of their appointment. All referees are subject to the administrative authority and assignment power of the chief judge of the district as provided in section 484.69, subdivision 3, and are not limited to assignment to family, probate, juvenile or special term court.\n[Repealed, 1981 c 272 s 7]\n[Repealed, 1981 c 272 s 7]\n[Repealed, 1981 c 272 s 7]\n[Repealed, 1981 c 272 s 7]\nNo referee may hear a contested trial, hearing, motion or petition if a party or attorney for a party objects in writing to the assignment of a referee to hear the matter. The court shall by rule, specify the time within which an objection must be filed.\nThe duties and powers of referees shall be as follows:\n(a) Hear and report all matters assigned by the chief judge.\n(b) Recommend findings of fact, conclusions of law, temporary and interim orders, and final orders for judgment.\nAll recommended orders and findings of a referee shall be subject to confirmation by a judge.\n(c) Upon the conclusion of the hearing in each case, the referee shall transmit to a judge the court file together with recommended findings and orders in writing. The recommended findings and orders of a referee become the findings and orders of the court when confirmed by a judge. The order of the court shall be proof of such confirmation, and also of the fact that the matter was duly referred to the referees.\n(d) Review of any recommended order or finding of a referee by a judge may be by notice served and filed within ten days of effective notice of the recommended order or finding. The notice of review shall specify the grounds for review and the specific provisions of the recommended findings or orders disputed, and the court, upon receipt of a notice of review, shall set a time and place for a review hearing.\n(e) All orders and findings recommended by a referee become an effective order when countersigned by a judge and remain effective during the pendency of a review, including a remand to the referee, unless a judge:\n(1) expressly stays the effect of the order;\n(2) changes the order during the pendency of the review; or\n(3) changes or vacates the order upon completion of the review.\n(f) Notwithstanding paragraphs (d) and (e), referee orders and decrees in probate or civil commitment court proceedings, if appealed, must be appealed directly to the court of appeals, in the same manner as judicial orders and decrees.",
	"repealed": false
}