{
	"id": "469.320",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.320",
	"title": "469.320 ZONE PERFORMANCE; REMEDIES.",
	"text": "An applicant receiving designation of a job opportunity building zone under section 469.314 must annually report to the commissioner on its progress in meeting the zone performance goals under the development plan for the zone and the applicant's compliance with the business subsidy law under sections 116J.993 to 116J.995.\nFor reports required by subdivision 1, the commissioner may prescribe:\n(1) the required time or times by which the reports must be filed;\n(2) the form of the report; and\n(3) the information required to be included in the report.\nIf the commissioner determines, based on a report filed under subdivision 1 or other available information, that a zone or subzone is failing to meet its performance goals, the commissioner may take any actions the commissioner determines appropriate, including modification of the boundaries of the zone or a subzone or termination of the zone or a subzone. Before taking any action, the commissioner shall consult with the applicant and the affected local government units, including notifying them of the proposed actions to be taken. The applicant may appeal the commissioner's order under the contested case procedures of chapter 14.\n(a) An action to remove area from a zone or to terminate a zone under this section does not apply to:\n(1) the property tax on improvements constructed before the first January 2 following publication of the commissioner's order;\n(2) sales tax on purchases made before the first day of the next calendar month beginning at least 30 days after publication of the commissioner's order; and\n(3) individual income tax or corporate franchise tax attributable to a facility that was in operation before the publication of the commissioner's order.\n(b) The tax exemptions specified in paragraph (a) terminate on the date on which the zone expires under the original designation.",
	"repealed": false
}