{
	"id": "122A.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.63",
	"title": "122A.63 GRANTS TO PREPARE INDIAN TEACHERS.",
	"text": "(a) A grant program is established to assist American Indian people to become teachers and to provide additional education for American Indian teachers. The commissioner may award a joint grant to each of the following:\n(1) the Duluth campus of the University of Minnesota and Independent School District No. 709, Duluth;\n(2) Bemidji State University and Independent School District No. 38, Red Lake;\n(3) Moorhead State University and one of the school districts located within the White Earth Reservation; and\n(4) Augsburg College, Independent School District No. 625, St. Paul, and Special School District No. 1, Minneapolis.\n(b) If additional funds are available, the commissioner may award additional joint grants to other postsecondary institutions and school districts.\n(c) Grantees may enter into contracts with tribal, technical, and community colleges and four-year postsecondary institutions to identify and provide grants to students at those institutions interested in the field of education. A grantee may contract with partner institutions to provide professional development and supplemental services to a tribal, technical, or community college or four-year postsecondary institution, including identifying prospective students, providing instructional supplies and materials, and providing grant money to students. A contract with a tribal, technical, or community college or four-year postsecondary institution includes coordination of student identification, professional development, and mentorship services.\nTo obtain a joint grant, a joint application must be submitted to the commissioner of education. The application must be developed with the participation of the parent advisory committee, established according to section 124D.78, and the Indian advisory committee at the postsecondary institution. The joint application shall set forth:\n(1) the in-kind, coordination, and mentorship services to be provided by the postsecondary institution; and\n(2) the coordination and mentorship services to be provided by the school district.\nThe commissioner must submit the joint application to the American Indian Education Committee for review and comment.\nThe commissioner may award a joint grant in the amount it determines to be appropriate. The grant shall include money for the postsecondary institution, school district, and student scholarships.\nAt the time a student applies for a scholarship, the student must be provided information about the fields of licensure needed by school districts in the part of the state within which the district receiving the joint grant is located. The information must be acquired and periodically updated by the recipients of the joint grant and their contracted partner institutions. Information provided to students must clearly state that scholarship decisions are not based upon the field of licensure selected by the student.\n(a) An eligible student is a person who:\n(1) has origins in any of the original peoples of North America and maintains cultural identification through tribal affiliation or community recognition; and\n(2) is:\n(i) a student, including a teacher aide employed by a district receiving a joint grant or their contracted partner school, who intends to become a teacher or is interested in the field of education, and enrolled in a postsecondary institution;\n(ii) a licensed employee of a district receiving a joint grant or a contracted partner institution, who is enrolled in a master of education program; or\n(iii) a student who, after applying for federal and state financial aid and an American Indian scholarship according to section 136A.126, has financial needs that remain unmet. Financial need must be determined according to the congressional methodology for needs determination or as otherwise set in federal law.\n(b) Priority must be given first to eligible students who are tribally enrolled in a federally or state recognized Tribe and then to first- and second-generation descendants.\nMS 2018 [Repealed, 1Sp2019 c 11 art 3 s 25]\nMS 2018 [Repealed, 1Sp2019 c 11 art 3 s 25]\n(a) The grantee institutions may provide scholarships to eligible students progressing toward educational goals in any area of teacher licensure, including an associate's, bachelor's, master's, or doctoral degree in the following:\n(1) any educational certification necessary for employment;\n(2) early childhood family education or prekindergarten licensure;\n(3) elementary and secondary education;\n(4) school administration; or\n(5) any educational program that provides services to American Indian students in prekindergarten through grade 12.\n(b) Scholarships may be used to cover an eligible student's cost of attendance under section 136A.126, subdivision 3.\n(c) For purposes of recruitment, the grantees or their contracted partner institutions must agree to work with their respective organizations to hire an American Indian work-study student or other American Indian staff to conduct initial information queries and to contact persons working in schools to provide programming regarding education professions to high school students who may be interested in education as a profession.\n(d) At least 80 percent of the grants awarded under this section must be used for student scholarships. No more than 20 percent of the grants awarded under this section may be used for recruitment or administration of the student scholarships.\n(a) An account is established in the special revenue fund known as the \"Minnesota Indian teacher training program account.\"\n(b) Funds appropriated for the Minnesota Indian teacher training program under this section must be transferred to the Minnesota Indian teacher training program account in the special revenue fund.\n(c) Money in the account is annually appropriated to the commissioner for the Minnesota Indian teacher training program under this section. Any returned funds are available to be regranted. Grant recipients may apply to use grant money over a period of up to 60 months.\n(d) Up to $75,000 annually is appropriated to the commissioner for costs associated with administering and monitoring the program under this section.",
	"repealed": false
}