{
	"id": "103G.551",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.551",
	"title": "103G.551 DAMS USED ONLY FOR WATER LEVEL REGULATION.",
	"text": "This section and section 103G.555 apply to public waters if:\n(1) a dam constructed or maintained in any manner has existed in the outlet of the lake affecting the water level of the lake for a continuous period of at least 15 years;\n(2) the lake has been used by the public for navigation, fishing, hunting, or other beneficial public purposes continuously throughout the 15-year period when allowed by natural conditions;\n(3) the use of the dam for a purpose other than regulating, controlling, or maintaining the water level of the lake in aid of navigation, propagation of fish or waterfowl, or other beneficial public purposes has been discontinued;\n(4) continued regulation, control, or maintenance of the water levels of the lake by the dam in the same manner as during the 15-year period would be desirable and in the public interests in navigation, propagation of fish or waterfowl, or other beneficial public uses of the lake; and\n(5) discontinuance of regulation of water levels through deterioration or removal of the dam would be detrimental to public interests in navigation, propagation of fish and waterfowl, or other beneficial public uses.\n(a) Owners of property and interests in property bordering on a lake or connecting waters affected by a dam are considered to have dedicated to the state for the use and benefit of the public a perpetual flowage easement on the property for all overflow and other effects of water on their property resulting from the existence, maintenance, or operation of the dam during the 15-year period.\n(b) The perpetual flowage easement has the extent and effect as if the state had:\n(1) owned and controlled the dam;\n(2) regulated, controlled, and maintained the water levels of the lake and connecting waters affected by the dam for public use and benefit under the conditions existing during the 15-year period; and\n(3) acquired the flowage easement by prescription.\nThe commissioner may accept a conveyance or release of a property or an interest in property that grants the state a flowage easement on the property for overflow or other effects of water resulting from the existence, maintenance, or operation of a dam, or reconstruction or improvement of a dam, or construction of a dam in the outlet of a lake to regulate, control, or maintain the water level of the lake in aid of navigation, propagation of fish or waterfowl, or other beneficial public purposes.\n(a) An action may be brought in the name of the state in the district court of the county where affected property is located to determine:\n(1) the extent and effect of a flowage easement obtained by the state;\n(2) the title and rights of the state under the flowage easement;\n(3) adverse claims to the flowage easement; and\n(4) the rights of all parties interested in or affected by the flowage easement.\n(b) The action may be brought by the attorney general upon the attorney general's own initiative or on request of the commissioner. On request of the attorney general, the county attorney of the county where the property affected by the flowage easement is located shall assist in bringing the action.\n(c) Part or all of the property affected by the flowage easement that is bordering on one lake and the connecting waters of the lake and located in one county may be included in one action. The parties interested in the affected property may be joined as defendants in the action.\n(d) Except as otherwise provided in this section and section 103G.555, the law relating to actions for the determination of title to real estate in the district court governs the action.\n(e) The cost of the action may be paid from money appropriated for the maintenance, operation, and control of the dam involved, or may be paid by the county where the lake and connecting waters are located.\n(a) If the water levels maintained by a dam that has existed as provided in subdivision 1 have established an ordinary high-water level above the natural ordinary high-water level, the ordinary high-water level reestablishes the natural ordinary high-water level of the waters. Property owners and the owners of an interest in property affected by the reestablished natural ordinary high-water level are presumed to have consented to the reestablished natural ordinary high-water level and to have dedicated their property to the state for the use and benefit of the public.\n(b) The commissioner may determine the reestablished natural ordinary high-water level in the same manner as provided by law for the determination of natural ordinary high-water levels. The determination is prima facie evidence of the level and has the same effect as a determination of natural ordinary high-water level by the commissioner.\nA flowage easement obtained by the state under this section attaches and is appurtenant to a dam that is acquired or taken over and maintained or controlled in aid of public navigation, propagation of fish or waterfowl, or other beneficial public purposes by the commissioner or another agency of the state, a county, a political subdivision, or a combination authorized by law. The flowage easement attaches and is appurtenant to the reconstruction or improvement of the dam and to a new dam constructed in the outlet of the lake that is taken over and maintained or controlled by the commissioner, a state agency, a county, a political subdivision, or a combination authorized by law.\n(a) If a dam not owned or controlled by the state or a public agency is not used or maintained by or under the authority of the owner of the dam for a lawful purpose for a continuous period of at least 15 years, the dam and the dam site are presumed to be abandoned by the owner and dedicated to the state with flowage easements appurtenant for the use and benefit of the public. The commissioner:\n(1) shall take possession of the dam and the dam site and the flowage easements on behalf of the state and use, maintain, operate, and control the dam, dam site, and flowage easements for public purposes; or\n(2) may dispose of the dam, dam site, or flowage easements for public purposes as provided in paragraph (b) or as otherwise authorized by law.\n(b) The commissioner may dispose of a dam, dam site, or flowage easement after:\n(1) publishing notice of a hearing on disposing of the dam, dam site, or flowage easement in a legal newspaper in the county where the dam is situated;\n(2) holding a hearing; and\n(3) determining that it is not in the public interest for the state to use, maintain, operate, and control the dam.\n(c) The commissioner may construct other or additional control works to supplement or supplant the dam under other provisions of law.\n(d) The title of the state to a dam, dam site, or flowage easement acquired under this subdivision may be established and determined by action in the district court as provided by law for actions for the determination of title to real estate.\n(e) Before taking possession of an abandoned dam, dam site, or flowage easement, the commissioner must file a written certificate executed by the commissioner stating the dam is abandoned and is acquired by the state, in the office of the county recorder of the county where the dam is situated. The responsibility for a dam, dam site, or flowage easement is not on the state until the certificate is recorded or a judgment entered in an appropriate action establishing the state's title to the dam, dam site, and flowage easement. If a county or other political subdivision of the state or combination desires to take over an abandoned dam, dam site, and flowage easement and maintain, operate, control, or dispose of the dam, dam site, and flowage easement for public purposes, the commissioner may convey the dam, dam site, and flowage easement from the state to the county or other political subdivision or combination.",
	"repealed": false
}