{
	"id": "297A.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.63",
	"title": "297A.63 USE TAXES IMPOSED; RATES.",
	"text": "(a) For the privilege of using, storing, distributing, or consuming in Minnesota tangible personal property or taxable services purchased for use, storage, distribution, or consumption in this state, a use tax is imposed on a person in Minnesota. The tax is imposed on the purchase price of retail sales of the tangible personal property or taxable services at the rate of tax imposed under section 297A.62. A person that purchases property from a Minnesota retailer and returns the tangible personal property to a point within Minnesota, except in the course of interstate commerce, after it was delivered outside of Minnesota, is subject to the use tax.\n(b) No tax is imposed under paragraph (a) if the tax imposed by section 297A.62 was paid on the sales price of the tangible personal property or taxable services.\n(c) No tax is imposed under paragraph (a) if the purchase meets the requirements for exemption under section 297A.67, subdivision 21.\n(d) When a transaction otherwise meets the definition of a bundled transaction, but is not a bundled transaction under section 297A.61, subdivision 38, paragraph (d), and the seller's purchase price of the taxable product or taxable tangible personal property is equal to or greater than $100, then use tax is imposed on the purchase price of the taxable product or taxable personal property. For purposes of this paragraph, \"purchase price\" means the measure subject to use tax on purchases made by the seller.\n(a) A use tax is imposed on a person who manufactures, fabricates, or assembles tangible personal property from materials, either within or outside this state and who uses, stores, distributes, or consumes the tangible personal property in Minnesota. The tax is imposed on the purchase price of retail sales of the materials contained in the tangible personal property at the rate of tax imposed under section 297A.62.\n(b) No tax is imposed under paragraph (a) if the tax imposed by section 297A.62 was paid on the sales price of materials contained in the tangible personal property.\nWhen there is a change in the rate of tax imposed by this section, the following transitional period shall apply to the taxable services purchased for use, storage, distribution, or consumption in this state when the service purchased covers a billing period starting before and ending after the statutory effective date of the rate change:\n(1) for a rate increase, the new rate shall apply to the first billing period starting on or after the effective date; and\n(2) for a rate decrease, the new rate shall apply to bills rendered on or after the effective date.",
	"repealed": false
}