{
	"id": "245.467",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.467",
	"title": "245.467 QUALITY OF SERVICES.",
	"text": "Mental health services required by this chapter must be:\n(1) based, when feasible, on research findings;\n(2) based on individual clinical needs, cultural and ethnic needs, and other special needs of individuals being served;\n(3) provided in the most appropriate, least restrictive setting available to the county board;\n(4) accessible to all age groups;\n(5) delivered in a manner that provides accountability;\n(6) provided by qualified individuals as required in this chapter;\n(7) coordinated with mental health services offered by other providers; and\n(8) provided under conditions which protect the rights and dignity of the individuals being served.\nA provider of services governed by this section must complete a diagnostic assessment of a client according to the standards of section 245I.10.\nA provider of services governed by this section must complete an individual treatment plan for a client according to the standards of section 245I.10, subdivisions 7 and 8.\nEach provider of emergency services, day treatment services, outpatient treatment, community support services, residential treatment, acute care hospital inpatient treatment, or regional treatment center inpatient treatment must inform each of its clients with serious and persistent mental illness of the availability and potential benefits to the client of case management. If the client consents, the provider must refer the client by notifying the county employee designated by the county board to coordinate case management activities of the client's name and address and by informing the client of whom to contact to request case management. The provider must document compliance with this subdivision in the client's record.\nEach provider of outpatient treatment, community support services, day treatment services, emergency services, residential treatment, or acute care hospital inpatient treatment must include the name and home address of each client for whom services are included on a bill submitted to a county, if the client has consented to the release of that information and if the county requests the information. Each provider shall attempt to obtain each client's consent and must explain to the client that the information can only be released with the client's consent and may be used only for purposes of payment and maintaining provider accountability. The provider shall document the attempt in the client's record.\nThe county board shall establish procedures to ensure that the names and addresses of persons receiving mental health services are disclosed only to:\n(1) county employees who are specifically responsible for determining county of financial responsibility or making payments to providers;\n(2) staff who provide treatment services or case management and their clinical supervisors; and\n(3) personnel of the welfare system or health care providers who have access to the data under section 13.46, subdivision 7.\nRelease of mental health data on individuals submitted under subdivisions 4 and 5, to persons other than those specified in this subdivision, or use of this data for purposes other than those stated in subdivisions 4 and 5, results in civil or criminal liability under the standards in section 13.08 or 13.09.",
	"repealed": false
}