{
	"id": "149A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.51",
	"title": "149A.51 RENEWAL OF LICENSE TO OPERATE A FUNERAL ESTABLISHMENT.",
	"text": "A license to operate a funeral establishment issued by the commissioner expires on June 30 following the date of issuance of the license and must be renewed to remain valid.\nLicensees who wish to renew their licenses must submit to the commissioner a completed renewal application and the renewal fee no later than June 30 following the date the license was issued. A completed renewal application includes:\n(1) a completed renewal application form, as provided by the commissioner; and\n(2) proof of liability insurance coverage or other financial documentation, as determined by the commissioner, that demonstrates the applicant's ability to respond in damages for liability arising from the ownership, maintenance, management, or operation of a funeral establishment.\nUpon receipt of the completed renewal application and appropriate fee, the commissioner shall review and verify all information. Upon completion of the verification process and resolution of any deficiencies in the renewal application information, the commissioner shall make a determination, based on all the information available, to reissue or refuse to reissue the license. If the commissioner's determination is to reissue the license, the applicant shall be notified and the license shall issue and remain valid for a period prescribed on the license, but not to exceed one calendar year from the date of issuance of the license. If the commissioner's determination is to refuse to reissue the license, section 149A.09, subdivision 2, applies.\nRenewal applications received after the expiration date of a license shall result in the assessment of a late filing penalty. The late filing penalty must be paid prior to the reissuance of the license and received by the commissioner no later than 31 calendar days after the expiration date of the license.\nLicenses to operate funeral establishments shall automatically lapse when a completed renewal application and renewal fee are not received by the commissioner within 31 calendar days after the expiration date of a license or a late filing penalty assessed under subdivision 3 is not received by the commissioner within 31 calendar days after the expiration of a license.\nUpon the lapse of a license, the person to whom the license was issued is no longer licensed to operate a funeral establishment in Minnesota. The commissioner shall issue a cease and desist order to prevent the holder of a lapsed license from operating a funeral establishment in Minnesota and may pursue any additional lawful remedies as justified by the case.\nThe commissioner may restore a lapsed license upon receipt and review of a completed renewal application, receipt of the renewal fee and late filing penalty, reinspection of the premises, and receipt of the reinspection fee, provided that the receipt is made within one calendar year from the expiration date of the lapsed license, and the cease and desist order issued by the commissioner has not been violated. If a lapsed license is not restored within one calendar year from the expiration date of the lapsed license, the holder of the lapsed license may not be relicensed until the requirements in section 149A.50 are met.\n[Repealed, 2013 c 108 art 12 s 109]\nAny change of license information must be reported to the commissioner, on forms provided by the commissioner, no later than 30 calendar days after the change occurs. Failure to report changes is grounds for disciplinary action.\nAll information submitted to the commissioner by an applicant for renewal of licensure to operate a funeral establishment is classified as licensing data under section 13.41, subdivision 5.",
	"repealed": false
}