{
	"id": "17.1016",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.1016",
	"title": "17.1016 COOPERATIVE GRANTS.",
	"text": "For purposes of this section:\n(1) \"agricultural commodity\" and \"agricultural product processing facility\" have the meanings given in section 17.101, subdivision 5; and\n(2) \"agricultural service\" means an action made under the direction of a farmer that provides value to another entity. Agricultural service includes grazing to manage vegetation.\n(a) The commissioner may establish and implement a grant program to help farmers finance new cooperatives that organize for purposes of operating an agricultural product processing facility or marketing an agricultural product or agricultural service.\n(b) To be eligible for this program, a grantee must:\n(1) be a cooperative organized under chapter 308A or 308B;\n(2) certify that all control of the cooperative is from farmers, family farm partnerships, family farm limited liability companies, or family farm corporations as defined in section 500.24, subdivision 2, who are actively engaged in agricultural commodity production;\n(3) be operated primarily to process agricultural commodities or market agricultural products or services produced in Minnesota;\n(4) receive agricultural commodities produced primarily by shareholders or members of the cooperative; and\n(5) not allow nonpatron voting rights.\n(c) The commissioner may receive applications and make grants up to $50,000 to eligible grantees for feasibility, marketing analysis, assistance with organizational development, financing and managing new cooperatives, product development, development of business and marketing plans, and predesign of facilities, including site analysis, the development of bid specifications, preliminary blueprints and schematics, and the completion of purchase agreements and other necessary legal documents.\n(d) Grants must be matched dollar-for-dollar with other money or in-kind contributions.",
	"repealed": false
}