{
	"id": "3.9215",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.9215",
	"title": "3.9215 OMBUDSPERSON FOR AMERICAN INDIAN FAMILIES.",
	"text": "In recognition of the sovereign status of Indian Tribes and the unique laws and standards involved in protecting Indian children, this section creates the Office of the Ombudsperson for American Indian Families and gives the ombudsperson the powers and duties necessary to effectively carry out the functions of the office.\nThe ombudsperson shall operate independently from and in collaboration with the Indian Affairs Council and the American Indian Child Welfare Advisory Council under section 260.835.\nThe ombudsperson shall be selected by the American Indian community-specific board established in section 3.9216. The ombudsperson serves in the unclassified service at the pleasure of the community-specific board and may be removed only for just cause. Each ombudsperson must be selected without regard to political affiliation and shall be a person highly competent and qualified to analyze questions of law, administration, and public policy regarding the protection and placement of children. In addition, the ombudsperson must be experienced in working collaboratively with the American Indian and Alaska Native communities or nations and knowledgeable about the needs of those communities, the Indian Child Welfare Act and Minnesota Indian Family Preservation Act, and best practices regarding prevention, cultural resources, and historical trauma. No individual may serve as the ombudsperson for American Indian families while holding any other public office.\nMoney appropriated for the ombudsperson for American Indian families from the general fund or the special fund authorized by section 256.01, subdivision 2, paragraph (o), is under the control of the ombudsperson.\n(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Agency\" means the local district courts or a designated county social service agency as defined in section 256G.02, subdivision 7, engaged in providing child protection and placement services for children. Agency also means any individual, service, organization, or program providing child protection, placement, or adoption services in coordination with or under contract with any other entity specified in this subdivision, including guardians ad litem.\n(c) \"American Indian\" refers to individuals who are members of federally recognized Tribes, eligible for membership in a federally recognized Tribe, or children or grandchildren of a member of a federally recognized Tribe. American Indian is a political status established through treaty rights between the federal government and Tribes. Each Tribe has a unique culture and practices specific to the Tribe.\n(d) \"Facility\" means any entity required to be licensed under chapter 245A.\n(e) \"Indian custodian\" has the meaning given in United States Code, title 25, section 1903.\n(a) The ombudsperson may select, appoint, and compensate assistants and employees that the ombudsperson finds necessary to discharge responsibilities. All employees, except the secretarial and clerical staff, serve at the pleasure of the ombudsperson in the unclassified service. The ombudsperson and full-time staff are members of the Minnesota State Retirement Association.\n(b) The ombudsperson may delegate to staff members or members of the American Indian Community-Specific Board under section 3.9216 any of the ombudsperson's authority or duties except the duty of formally making recommendations to an administrative agency or reports to the Office of the Governor or to the legislature.\n(a) The ombudsperson has the duties listed in this paragraph.\n(1) The ombudsperson shall monitor agency compliance with all laws governing child protection and placement, public education, and housing issues related to child protection that impact American Indian children and their families. In particular, the ombudsperson shall monitor agency compliance with sections 260.751 to 260.835; section 260C.193, subdivision 3; and section 260C.215.\n(2) The ombudsperson shall work with local state courts to ensure that:\n(i) court officials, public policy makers, and service providers are trained in cultural competency. The ombudsperson shall document and monitor court activities to heighten awareness of diverse belief systems and family relationships;\n(ii) qualified expert witnesses from the appropriate American Indian community, including Tribal advocates, are used as court advocates and are consulted in placement decisions that involve American Indian children; and\n(iii) guardians ad litem and other individuals from American Indian communities are recruited, trained, and used in court proceedings to advocate on behalf of American Indian children.\n(3) The ombudsperson shall primarily work on behalf of American Indian children and families, but shall also work on behalf of any Minnesota children and families as the ombudsperson deems necessary and appropriate.\n(b) The ombudsperson has the authority to investigate decisions, acts, and other matters of an agency, program, or facility providing protection or placement services to American Indian children. In carrying out this authority and the duties in paragraph (a), the ombudsperson has the power to:\n(1) prescribe the methods by which complaints are made, reviewed, and acted upon;\n(2) determine the scope and manner of investigations;\n(3) investigate, upon a complaint or upon personal initiative, any action of any agency;\n(4) request and be given access to any information in the possession of any agency deemed necessary for the discharge of responsibilities. The ombudsperson is authorized to set reasonable deadlines within which an agency must respond to requests for information. Data obtained from any agency under this clause retains the classification that the data has under section 13.02 and the ombudsperson shall maintain and disseminate the data according to chapter 13;\n(5) examine the records and documents of an agency;\n(6) enter and inspect, during normal business hours, premises within the control of an agency; and\n(7) subpoena any agency personnel to appear, testify, or produce documentation or other evidence that the ombudsperson deems relevant to a particular matter under investigation, and petition the appropriate state court to seek enforcement of the subpoena. Any witness at a hearing or for an investigation has the same privileges of a witness in the courts or under the laws of this state. The ombudsperson may compel individuals who are not agency personnel to testify or produce evidence according to procedures developed by the advisory board.\n(c) The ombudsperson may apply for grants and accept gifts, donations, and appropriations for training relating to the duties of the ombudsperson. Grants, gifts, donations, and appropriations received by the ombudsperson shall be used for training. The ombudsperson may seek and apply for grants to develop new programs and initiatives and to continue existing programs and initiatives. These funds may not be used for operating expenses for the Office of the Ombudsperson for American Indian Families.\n(a) In selecting matters for review, an ombudsperson should give particular attention to actions of an agency, facility, or program that:\n(1) may be contrary to law or rule;\n(2) may be unreasonable, unfair, oppressive, or inconsistent with a policy or order of an agency, facility, or program;\n(3) may result in abuse or neglect of a child;\n(4) may disregard the rights of a child or another individual served by an agency or facility; or\n(5) may be unclear or inadequately explained, when reasons should have been revealed.\n(b) The ombudsperson shall, in selecting matters for review, inform other interested agencies in order to avoid duplicating other investigations or regulatory efforts, including activities undertaken by a Tribal organization under the authority of sections 260.751 to 260.835.\nThe ombudsperson may receive a complaint from any source concerning an action of an agency, facility, or program. After completing a review, the ombudsperson shall inform the complainant, agency, facility, or program. Services to a child shall not be unfavorably altered as a result of an investigation or complaint. An agency, facility, or program shall not retaliate or take adverse action, as defined in section 260E.07, against an individual who, in good faith, makes a complaint or assists in an investigation.\n(a) If, after reviewing a complaint or conducting an investigation and considering the response of an agency, facility, or program and any other pertinent material, the ombudsperson determines that the complaint has merit or that the investigation reveals a problem, the ombudsperson may recommend that the agency, facility, or program:\n(1) consider the matter further;\n(2) modify or cancel its actions;\n(3) alter a rule, order, or internal policy;\n(4) explain more fully the action in question; or\n(5) take other action as authorized under section 257.0762.\n(b) At the ombudsperson's request, the agency, facility, or program shall, within a reasonable time, inform the ombudsperson about the action taken on the recommendation or the reasons for not complying with the recommendation.\n(c) Data obtained from any agency under this section retains the classification that the data has under section 13.02, and the ombudsperson shall maintain and disseminate the data according to chapter 13.\n(a) The ombudsperson may send conclusions and suggestions concerning any reviewed matter to the governor and shall provide copies of all reports to the advisory board and to the groups specified in section 257.0768, subdivision 1. Before making public a conclusion or recommendation that expressly or implicitly criticizes an agency, facility, program, or any person, the ombudsperson shall inform the governor and the affected agency, facility, program, or person concerning the conclusion or recommendation. When sending a conclusion or recommendation to the governor that is adverse to an agency, facility, program, or any person, the ombudsperson shall include any statement of reasonable length made by that agency, facility, program, or person in defense or mitigation of the ombudsperson's conclusion or recommendation.\n(b) In addition to conclusions or recommendations that the ombudsperson makes to the governor on an ad hoc basis, the ombudsperson shall, at the end of each year, report to the governor concerning the exercise of the ombudsperson's functions during the preceding year.\nThe ombudsperson and designees are not civilly liable for any action taken under this section if the action was taken in good faith, was within the scope of the ombudsperson's authority, and did not constitute willful or reckless misconduct.\nAny funds received by the ombudsperson from any source may be used to compensate members of the American Indian community-specific board for reasonable and necessary expenses incurred in aiding and assisting the ombudsperson in programs and initiatives.",
	"repealed": false
}