{
	"id": "308B.411",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.411",
	"title": "308B.411 ELECTION OF DIRECTORS.",
	"text": "The organizers shall elect and obtain the acknowledgment of the first board to serve until directors are elected by members. Until election by members, the first board shall appoint directors to fill any vacancies.\n(a) Directors shall be elected for the term, at the time, and in the manner provided in this section and the bylaws.\n(b) A majority of the directors shall be members and a majority of the directors shall be elected exclusively by the members holding patron membership interests unless otherwise provided in the articles or bylaws.\n(c) The voting authority of the directors may be allocated according to allocation units or equity classifications of the cooperative provided that at least one-half of the voting power on general matters of the cooperative shall be allocated to the directors elected by members holding patron membership interests, or in the alternative, the directors elected by the members holding patron membership interests shall have an equal or shall not have a minority voting power on general matters of the cooperative.\n(d) A director holds office for the term the director was elected and until a successor is elected and has qualified, or until the earlier death, resignation, removal, or disqualification of the director.\n(e) The expiration of a director's term with or without election of a qualified successor does not make the prior or subsequent acts of the director or the board void or voidable.\n(f) Subject to any limitation in the articles or bylaws, the board may set the compensation of directors.\n(g) Directors may be divided into or designated and elected by class or other distinction as provided in the articles or bylaws.\n(h) A director may resign by giving written notice to the chair of the board or the board. The resignation is effective without acceptance when the notice is given to the chair of the board or the board unless a later effective time is specified in the notice.\nDirectors shall be elected at the regular members' meeting for the terms of office prescribed in the bylaws. Except for directors elected at district meetings or special meetings to replace a vacancy, all directors shall be elected at the regular members' meeting. There shall be no cumulative voting for directors except as provided in this chapter and the articles or bylaws.\nFor a cooperative with districts or other units, members may elect directors on a district or unit basis if provided in the bylaws. The directors may be nominated or elected at district meetings if provided in the bylaws. Directors who are nominated at district meetings shall be elected at the annual regular members' meeting by vote of the entire membership, unless the bylaws provide that directors who are nominated at district meetings are to be elected by vote of the members of the district, at the district meeting, or the annual regular members' meeting.\nThe following shall apply to voting by mail or alternative ballot voting:\n(1) a member may not vote for a director other than by being present at a meeting or by mail ballot or alternative ballot authorized by the board;\n(2) the ballot shall be in a form prescribed by the board;\n(3) the member shall mark the ballot for the candidate chosen and mail the ballot to the cooperative in a sealed plain envelope inside another envelope bearing the member's name, or shall vote designating the candidate chosen by alternative ballot in the manner prescribed by the board; and\n(4) if the ballot of the member is received by the cooperative on or before the date of the regular members' meeting or as otherwise prescribed for alternative ballots, the ballot shall be accepted and counted as the vote of the absent member.\nIf a member of a cooperative is not a natural person, and the bylaws do not provide otherwise, the member may appoint or elect one or more natural persons to be eligible for election as a director.\nA director holds office for the term the director was elected and until a successor is elected and has qualified, or the earlier death, resignation, removal, or disqualification of the director.\nThe expiration of a director's term with or without the election of a qualified successor does not make prior or subsequent acts of the director void or voidable.\nSubject to any limitation in the articles or bylaws, the board may fix the compensation of the directors.\nDirectors may be divided into classes as provided in the articles or bylaws.",
	"repealed": false
}