{
	"id": "477A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.30",
	"title": "477A.30 LOCAL HOMELESS PREVENTION AID.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"city\" means a statutory or home rule charter city;\n(2) \"distribution factor\" means the total number of students experiencing homelessness in a county in the current school year and the previous two school years divided by the total number of students experiencing homelessness in all counties in the current school year and the previous two school years;\n(3) \"families\" means families and persons 24 years of age or younger; and\n(4) \"Tribal government\" means any of the 11 federally recognized Indian Tribes located in Minnesota.\nThe purpose of this section is to help local governments and Tribal governments ensure no child is homeless within a local jurisdiction by keeping families from losing housing and helping those experiencing homelessness find housing.\n(a) A county's initial local homeless prevention aid amount equals the greater of: (1) $5,000; or (2)(i) five percent of the money appropriated under subdivision 6, paragraph (a), times (ii) the ratio of the population of the county to the population of all counties. For the purpose of this paragraph, \"population\" means the population estimate used to calculate aid under section 477A.0124 for the same aid payable year.\n(b) The amount of the appropriation in subdivision 6, paragraph (a), remaining after the allocation under paragraph (a) must be allocated to counties by multiplying each county's distribution factor by the total distribution available under this paragraph. Distribution factors must be based on the most recent counts of students experiencing homelessness in each county, as certified by the commissioner of education to the commissioner of revenue by July 1 of the year the aid is certified to the counties under subdivision 5.\n(c) A county's total local homeless prevention aid equals the sum of the amounts under paragraphs (a) and (b).\n(a) A Tribal government may choose to receive an aid distribution under this section by submitting an application under this subdivision. The application must be in the manner and form prescribed by the commissioner of revenue and must be annually submitted by July 1 in the year prior to the year the aid is paid. For aid payable in 2023 only, the application must be submitted by July 15, 2023.\n(b) The total local homeless prevention aid distributed to Tribal governments equals the amount appropriated under subdivision 6, paragraph (b). Each Tribal government which, pursuant to this subdivision, chooses to receive a distribution under this section must receive an equal share of the amount available under subdivision 6, paragraph (b).\n(a) Counties and Tribal governments that receive a distribution under this section must use the proceeds to fund new or existing family homeless prevention and assistance projects or programs. These projects or programs may be administered by a county, a group of contiguous counties jointly acting together, a city, a group of contiguous cities jointly acting together, a Tribal government, a group of Tribal governments, or a community-based nonprofit organization. Each project or program must include plans for:\n(1) targeting families with children who are eligible for a prekindergarten through grade 12 academic program and are:\n(i) living in overcrowded conditions in their current housing;\n(ii) paying more than 50 percent of their income for rent; or\n(iii) lacking a fixed, regular, and adequate nighttime residence;\n(2) targeting unaccompanied youth in need of an alternative residential setting;\n(3) connecting families with the social services necessary to maintain the families' stability in their homes, including but not limited to housing navigation, legal representation, and family outreach; and\n(4) one or more of the following:\n(i) providing rental assistance for a specified period of time which may exceed 24 months; or\n(ii) providing support and case management services to improve housing stability, including but not limited to housing navigation and family outreach.\n(b) Counties may choose not to spend all or a portion of the distribution under this section. Any unspent funds must be returned to the commissioner of revenue by December 31 of the year following the year that the aid was received. Any funds returned to the commissioner under this paragraph must be added to the overall distribution of aids certified under this section in the following year. Any unspent funds returned to the commissioner after the expiration under subdivision 8 are canceled to the general fund.\nThe commissioner of revenue must compute the amount of local homeless prevention aid payable to each county and Tribal government under this section. On or before August 1 of each year, the commissioner shall certify the amount to be paid to each county and Tribal government in the following year. The commissioner shall pay local homeless prevention aid annually at the times provided in section 477A.015. For aids payable in 2023 only, the commissioner must recalculate and recertify the aid under this section by July 15, 2023.\n(a) $17,600,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to counties required under this section.\n(b) $2,400,000 is annually appropriated from the general fund to the commissioner of revenue to make payments to Tribal governments required under this section.\n(a) No later than January 15, 2025, the commissioner of revenue must produce a report on projects and programs funded by counties and Tribal governments under this section. The report must include a list of the projects and programs, the number of people served by each, and an assessment of how each project and program impacts people who are currently experiencing homelessness or who are at risk of experiencing homelessness, as reported by the counties and Tribal governments to the commissioner by December 31 each year on a form prescribed by the commissioner. The commissioner must provide a copy of the report to the chairs and ranking minority members of the legislative committees with jurisdiction over property taxes and services for persons experiencing homelessness.\n(b) The report in paragraph (a) must be updated every two years and the commissioner of revenue must provide copies of the updated reports to the chairs and ranking minority members of the legislative committees with jurisdiction over property taxes and services for persons experiencing homelessness by January 15 of the year the report is due. Report requirements under this subdivision expire following the report which includes the final distribution preceding the expiration in subdivision 8.\nDistributions under this section expire after aids payable in 2028 have been distributed.",
	"repealed": false
}