{
	"id": "169.475",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.475",
	"title": "169.475 USE OF WIRELESS COMMUNICATIONS DEVICE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Electronic message\" means a self-contained piece of digital communication that is designed or intended to be transmitted between physical devices. An electronic message includes, but is not limited to: email; a text message; an instant message; a command or request to access a web page; a voice mail message; a transmitted image; transmitted video content, including through video calling; transmitted gaming data; and other data transmitted using a commonly recognized electronic communications protocol. An electronic message does not include: voice or audio data transmitted as a result of making a phone call; data transmitted between a motor vehicle and a wireless communications device located in the vehicle; data transmitted by a two-way radio, citizens band radio, or amateur radio used in accordance with Federal Communications Commission rules and regulations; or data transmitted automatically without direct initiation by a person.\n(c) \"Voice-activated or hands-free mode\" means an attachment, accessory, wirelessly paired or tethered capability, application, wireless connection, or built-in feature of a wireless communications device or a motor vehicle that allows the person to use verbal or single touch commands to:\n(1) activate or deactivate the device; and\n(2) activate or deactivate a function or software application of the device.\nVoice-activated or hands-free mode does not include typing or scrolling on a device.\n(d) For purposes of this section, a motor vehicle is not in motion or a part of traffic if the vehicle is lawfully stopped, is in a location that is not designed or ordinarily used for vehicular travel, and is not obstructing traffic.\n(a) Except as provided in subdivision 3, when a motor vehicle is in motion or a part of traffic, the person operating the vehicle upon a street or highway is prohibited from:\n(1) holding a wireless communications device with one or both hands; or\n(2) using a wireless communications device to:\n(i) initiate, compose, send, retrieve, or read an electronic message;\n(ii) engage in a cellular phone call, including initiating a call, talking or listening, and participating in video calling; and\n(iii) access the following types of content stored on the device: video content, audio content, images, games, or software applications.\n(b) A person who violates paragraph (a) a second or subsequent time must pay a fine of $275.\n(a) The prohibitions in subdivision 2 do not apply if a person uses a wireless communications device:\n(1) solely in a voice-activated or hands-free mode to (i) initiate or participate in a cellular phone call, provided that the person does not hold the device with one or both hands; or (ii) initiate, compose, send, or listen to an electronic message;\n(2) to view or operate a global positioning system or navigation system in a manner that does not require the driver to type while the vehicle is in motion or a part of traffic, provided that the person does not hold the device with one or both hands;\n(3) to listen to audio-based content in a manner that does not require the driver to scroll or type while the vehicle is in motion or a part of traffic, provided that the person does not hold the device with one or both hands;\n(4) to obtain emergency assistance to (i) report a traffic accident, medical emergency, or serious traffic hazard, or (ii) prevent a crime about to be committed;\n(5) in the reasonable belief that a person's life or safety is in immediate danger; or\n(6) in an authorized emergency vehicle while in the performance of official duties.\n(b) The exception in paragraph (a), clause (1), does not apply to accessing nonnavigation video content, engaging in video calling, engaging in live-streaming, accessing gaming data, or reading electronic messages.",
	"repealed": false
}