{
	"id": "321.0102",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.0102",
	"title": "321.0102 DEFINITIONS.",
	"text": "In this chapter:\n(1) \"Certificate of limited partnership\" means the certificate required by section 321.0201. The term includes the certificate as amended or restated.\n(2) \"Contribution,\" except in the phrase \"right of contribution,\" means any benefit provided by a person to a limited partnership in order to become a partner or in the person's capacity as a partner.\n(3) \"Debtor in bankruptcy\" means a person that is the subject of:\n(A) an order for relief under Title 11 of the United States Code or a comparable order under a successor statute of general application; or\n(B) a comparable order under federal, state, or foreign law governing insolvency.\n(4) \"Designated office\" means:\n(A) with respect to a limited partnership, the office that the limited partnership is required to designate and maintain under section 321.0114; and\n(B) with respect to a foreign limited partnership, its principal office.\n(5) \"Distribution\" means a transfer of money or other property from a limited partnership to a partner in the partner's capacity as a partner or to a transferee on account of a transferable interest owned by the transferee.\n(6) \"Foreign limited liability limited partnership\" means a foreign limited partnership whose general partners have limited liability for the obligations of the foreign limited partnership under a provision similar to section 321.0404(c).\n(7) \"Foreign limited partnership\" means a partnership formed under the laws of a jurisdiction other than this state and required by those laws to have one or more general partners and one or more limited partners. The term includes a foreign limited liability limited partnership.\n(8) \"General partner\" means:\n(A) with respect to a limited partnership, a person that:\n(i) becomes a general partner under section 321.0401 and has not become dissociated as a general partner under section 321.0603; or\n(ii) was a general partner in a limited partnership when the limited partnership became subject to this chapter under section 321.1206(b), (c), or (f) and has not become dissociated as a general partner under section 321.0603; and\n(B) with respect to a foreign limited partnership, a person that has rights, powers, and obligations similar to those of a general partner in a limited partnership.\n(9) \"Limited liability limited partnership,\" except in the phrases \"foreign limited liability limited partnership\" and \"limited partnership that is a limited liability limited partnership under section 322A.88,\" means:\n(A) a limited partnership whose certificate of limited partnership states that the limited partnership is a limited liability limited partnership; or\n(B) a limited partnership that:\n(i) became subject to this chapter under section 321.1206(b), (c), or (f);\n(ii) immediately before becoming subject to this chapter was a limited liability limited partnership under section 322A.88; and\n(iii) since becoming subject to this chapter has not amended its certificate of limited partnership to state that it is not a limited liability limited partnership.\n(10) \"Limited partner\" means:\n(A) with respect to a limited partnership, a person that:\n(i) becomes a limited partner under section 321.0301 and has not become dissociated as a limited partner under section 321.0601; or\n(ii) was a limited partner in a limited partnership when the limited partnership became subject to this chapter under section 321.1206(b), (c), or (f) and has not become dissociated as a limited partner under section 321.0601; and\n(B) with respect to a foreign limited partnership, a person that has rights, powers, and obligations similar to those of a limited partner in a limited partnership.\n(11) \"Limited partnership,\" except in the phrases \"foreign limited partnership,\" \"foreign limited liability limited partnership,\" \"limited partnership formed under chapter 322,\" \"limited partnership formed under chapter 322A,\" and \"limited partnership that is a limited liability limited partnership under chapter 322A,\" means an entity, having one or more general partners and one or more limited partners, which is formed under this chapter by two or more persons or becomes subject to this chapter under article 11 or section 321.1206(b), (c), or (f). The term includes a limited liability limited partnership.\n(12) \"Partner\" means a limited partner or general partner.\n(13) \"Partnership agreement\" means the partners' agreement, whether oral, implied, in a record, or in any combination, concerning the limited partnership. The term includes the agreement as amended.\n(14) \"Person\" means an individual, corporation, business trust, estate, trust, partnership, limited liability company, association, joint venture, government; governmental subdivision, agency, or instrumentality; public corporation, or any other legal or commercial entity.\n(15) \"Person dissociated as a general partner\" means a person dissociated as a general partner of a limited partnership.\n(16) \"Principal office\" means the office where the principal executive office of a limited partnership or foreign limited partnership is located, whether or not the office is located in this state.\n(17) \"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n(18) \"Required information\" means the information that a limited partnership is required to maintain under section 321.0111.\n(19) \"Sign\" means:\n(A) to execute or adopt a tangible symbol with the present intent to authenticate a record; or\n(B) to attach or logically associate an electronic symbol, sound, or process to or with a record with the present intent to authenticate the record.\n(20) \"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.\n(21) \"Transfer\" includes an assignment, conveyance, deed, bill of sale, lease, mortgage, security interest, encumbrance, gift, and transfer by operation of law.\n(22) \"Transferable interest\" means a partner's right to receive distributions.\n(23) \"Transferee\" means, except in section 321.0409, a person to which all or part of a transferable interest has been transferred, whether or not the transferor is a partner.",
	"repealed": false
}