{
	"id": "103C.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.305",
	"title": "103C.305 GENERAL ELECTION OF SUPERVISORS.",
	"text": "Elections must be held at the state general election specified in section 204D.03, subdivision 2. A primary may not be held.\nA candidate for the office of supervisor shall file an affidavit of candidacy with the county auditor of the county in which the district office is located during the period provided for filing affidavits of candidacy for county offices in section 204B.09, subdivision 1. The county auditor accepting affidavits of candidacy shall forward copies of all affidavits filed by candidates for supervisor to the auditor of any other county in which the office is voted on.\nBallots shall be prepared by the county auditor. The names of candidates shall be placed on the state general election ballot. The office title printed on the ballot must be either \"Soil and Water Conservation District Supervisor\" or \"Conservation District Supervisor,\" based upon the district from which the supervisor is to be elected.\nLaws relating to elections for county office shall govern to the extent that they are consistent with this section and section 103C.311. The county auditor shall certify the result to the state board. If the district includes land in more than one county, the county auditor shall immediately certify to the state board the vote, as shown by the report of the county canvassing board, for candidates voted for in more than one county. In the latter case, the state board shall certify and publish the result.\nIn a district where a supervisor nomination district is entirely within lands of an American Indian tribe or band to which county election laws do not apply, a supervisor to represent the district shall be elected or appointed as provided by the governing body of the tribe or band.\n(a) If a vacancy occurs in the office of an elected supervisor more than 56 days before the next state primary, the district board shall fill the vacancy by appointment. The supervisor appointed shall hold office until the first Monday in January following the next general election. A successor shall be elected at the general election following the appointment and hold office for the remainder of the term or for the next regular term, whichever is appropriate.\n(b) If a vacancy occurs less than 56 days before the next state primary, the district board shall fill the vacancy by appointment. The appointed supervisor shall hold office until the expiration of the term or until the first Monday in January following the second succeeding general election, whichever is shorter. A successor shall be elected at the general election preceding expiration of the appointed term and hold office for the remainder of the term or for the next regular term, whichever is appropriate.\n(c) All terms under this subdivision continue until a successor has been elected and has qualified.",
	"repealed": false
}