{
	"id": "145.713",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.713",
	"title": "145.713 OPTOMETRIST AND PHYSICIAN PRACTICES.",
	"text": "No optometrist or physician may:\n(1) condition the availability of an eye examination or the release of a prescription to a patient on a requirement that the patient agree to purchase ophthalmic goods from the optometrist or physician who performed the eye examination or from another specified optometrist or physician;\n(2) charge a patient a fee in addition to the optometrist's or physician's examination and fitting fees as a condition of releasing the prescription to the patient. An optometrist or physician may charge a reasonable additional fee for fitting ophthalmic goods dispensed by another practitioner if that fee is imposed at the time the fitting is performed; or\n(3) prescribe a manufacturer's brand name contact lens that can only be dispensed through the prescribing physician or optometrist's office.\nIf an optometrist or physician determines that a patient's ocular health presents a contraindication for contact lenses, the optometrist or physician must orally inform the patient of the contraindication and must document the contraindication in the patient's records. An optometrist or physician may exclude categories of contact lenses where clinically indicated.\nNo optometrist or physician may place on a patient's prescription, require a patient to sign, or deliver to a patient a form or notice waiving liability or responsibility for the accuracy of the eye examination or the accuracy of the ophthalmic goods and ophthalmic services dispensed by another practitioner. Prohibiting waivers of liability under this subdivision does not impose liability on an optometrist or physician for the ophthalmic goods or ophthalmic services dispensed by another practitioner pursuant to the optometrist's or physician's prescription.\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"contact lens\" means any lens that is placed directly on the surface of the eye, whether or not the lens is intended to correct a visual defect, including any cosmetic, therapeutic, or corrective lens;\n(2) \"ophthalmic prescription\" means a handwritten or electronic order of a provider that includes:\n(i) in the case of contact lenses, all information required by the Fairness to Contact Lens Consumers Act, United States Code, title 15, section 7601, et seq.;\n(ii) in the case of prescription eyeglasses, all information required by the Ophthalmic Practice Rule, also known as the Eyeglass Rule, Code of Federal Regulations, title 16, part 456; and\n(iii) necessary and appropriate information for the dispensing of prescription eyeglasses or contact lenses for a patient, including, at a minimum, the provider's name, the physical address of the provider's practice, and the provider's telephone number; and\n(3) \"provider\" means an optometrist or physician.\n(b) For the purposes of a provider prescribing ophthalmic goods to a patient, the provider must establish a provider-patient relationship through an examination pursuant to paragraph (c).\n(c) An examination meets the requirements of paragraph (b) if it takes place:\n(1) in person;\n(2) through face-to-face interactive, two-way, real-time communication; or\n(3) through store-and-forward technologies when all of the following conditions are met:\n(i) the provider obtains an updated medical history and makes a diagnosis at the time of prescribing;\n(ii) the provider conforms to the standard of care expected of in-person care as appropriate to the patient's age and presenting condition, including when the standard of care requires the use of diagnostic testing and performance of a physical examination, which may be carried out through the use of peripheral devices appropriate to the patient's condition;\n(iii) the ophthalmic prescription is not determined solely by use of an online questionnaire;\n(iv) the provider is licensed and authorized to issue an ophthalmic prescription in the state; and\n(v) upon request, the provider provides patient records in a timely manner in accordance with state and federal requirements.\n(d) This subdivision does not apply to the sale of over-the-counter eyeglasses, also known as readers, that are not designed to address the visual needs of the individual wearer.",
	"repealed": false
}