{
	"id": "116L.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.665",
	"title": "116L.665 WORKFORCE DEVELOPMENT BOARD.",
	"text": "The governor's Workforce Development Board serves as Minnesota's state workforce development board for the purposes of the federal Workforce Innovation and Opportunity Act, United States Code, title 29, section 3111, and must perform the duties under that act.\n(a) The governor's Workforce Development Board is composed of members appointed by the governor. In selecting the representatives of the board, the governor shall ensure that a majority of the members come from the private sector, pursuant to United States Code, title 29, section 3111. For the public members, membership terms, compensation of members, and removal of members are governed by section 15.059, subdivisions 2, 3, and 4. To the extent practicable, the membership should be balanced as to gender and ethnic diversity.\n(b) No person shall serve as a member of more than one category described in paragraph (c).\n(c) Voting members shall consist of the following:\n(1) the governor or the governor's designee;\n(2) two members of the house of representatives, one appointed by the speaker of the house and one appointed by the minority leader of the house of representatives;\n(3) two members of the senate, one appointed by the senate majority leader and one appointed by the senate minority leader;\n(4) a majority of the members must be representatives of businesses in the state appointed by the governor who:\n(i) are owners of businesses, chief executives, or operating officers of businesses, or other business executives or employers with optimum policy-making or hiring authority and who, in addition, may be members of a local board under United States Code, title 29, section 3122(b)(2)(A)(i);\n(ii) represent businesses, including small businesses, or organizations representing businesses that provide employment opportunities that, at a minimum, include high-quality, work-relevant training and development in in-demand industry sectors or occupations in the state; and\n(iii) are appointed from individuals nominated by state business organizations and business trade associations;\n(5) six representatives of labor organizations appointed by the governor, including:\n(i) representatives of labor organizations who have been nominated by state labor federations; and\n(ii) a member of a labor organization or a training director from a joint labor organization;\n(6) commissioners of the state agencies with primary responsibility for core programs identified within the state plan including:\n(i) the Department of Employment and Economic Development;\n(ii) the Department of Education;\n(iii) the Department of Human Services; and\n(iv) the Department of Children, Youth, and Families;\n(7) two chief elected officials, appointed by the governor, collectively representing cities and counties;\n(8) two representatives who are people of color or people with disabilities, appointed by the governor, of community-based organizations that have demonstrated experience and expertise in addressing the employment, training, or education needs of individuals with barriers to employment; and\n(9) four officials responsible for education programs in the state, appointed by the governor, including chief executive officers of community colleges and other institutions of higher education, including:\n(i) the chancellor of the Minnesota State Colleges and Universities;\n(ii) the president of the University of Minnesota;\n(iii) a president from a private postsecondary school; and\n(iv) a representative of career and technical education.\n(d) The nonvoting members of the board shall be appointed by the governor and consist of one of each of the following:\n(1) a representative of Adult Basic Education;\n(2) a representative of public libraries;\n(3) a person with expertise in women's economic security;\n(4) the chair or executive director of the Minnesota Workforce Council Association;\n(5) the commissioner of labor and industry;\n(6) the commissioner of the Office of Higher Education;\n(7) the commissioner of corrections;\n(8) the commissioner of management and budget;\n(9) two representatives of community-based organizations who are people of color or people with disabilities who have demonstrated experience and expertise in addressing the employment, training, and education needs of individuals with barriers to employment;\n(10) a representative of secondary, postsecondary, or career-technical education;\n(11) a representative of school-based service learning;\n(12) a representative of the Council on Asian-Pacific Minnesotans;\n(13) a representative of the Minnesota Council on Latino Affairs;\n(14) a representative of the Council for Minnesotans of African Heritage;\n(15) a representative of the Minnesota Indian Affairs Council;\n(16) a representative of the Minnesota State Council on Disability; and\n(17) a representative of the Office on the Economic Status of Women.\n(e) Each member shall be appointed for a term of three years from the first day of January or July immediately following their appointment. Elected officials shall forfeit their appointment if they cease to serve in elected office.\n(a) The board shall hold regular in-person meetings at least quarterly and as often as necessary to perform the duties outlined in the statement of authority and the board's bylaws. Meetings shall be called by the chair. Special meetings may be called as needed. Notices of all meetings shall be made at least 48 hours before the meeting date.\n(b) The governor shall designate a chair from among the appointed business representative voting members. The chair shall approve an agenda for each meeting. Members shall submit a written request for consideration of an agenda item no less than 24 hours in advance of the meeting. Members of the public may submit a written request within 48 hours of a meeting to be considered for inclusion in the agenda. Members of the public attending a meeting of the board may address the board only with the approval or at the request of the chair.\n(c) All meeting notices must be posted on the board's website. All meetings of the board and committees must be open to the public. The board must make available to the public, on a regular basis through electronic means and open meetings, information regarding the activities of the board, information regarding membership, and, on request, minutes of formal meetings of the board.\n(d) For the purpose of conducting business before the board at a duly called meeting, a simple majority of the voting members, excluding any vacancies, constitutes a quorum.\n[Repealed by amendment, 2017 c 94 art 6 s 10]\nThe executive committee must, with advice and input of local workforce boards and other stakeholders as appropriate, develop performance standards for the state workforce centers. By January 15, 2019, and each odd-numbered year thereafter, the executive committee shall submit a report to the senate and house of representatives committees with jurisdiction over workforce development programs regarding the performance and outcomes of the workforce centers. The report must provide recommendations regarding workforce center funding levels and sources, program changes, and administrative changes.\nThe chair of the Workforce Development Board may establish subcommittees in order to carry out the duties and responsibilities of the board.\nThe commissioner of employment and economic development must provide staff to the board necessary to carry out the duties of the board. At the request of the board, state departments and agencies must provide the board with the assistance it requires to fulfill its duties and responsibilities.\nThe board expires if there is no federal funding for the human resource programs within the scope of the board's duties.\nThe commissioner of employment and economic development must provide at least $350,000 each fiscal year from existing agency resources to the board for staffing and administrative expenses.",
	"repealed": false
}