{
	"id": "150A.106",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.106",
	"title": "150A.106 ADVANCED DENTAL THERAPIST.",
	"text": "In order to be certified by the board to practice as an advanced dental therapist, a person must:\n(1) complete a dental therapy education program;\n(2) pass an examination to demonstrate competency under the dental therapy scope of practice;\n(3) be licensed as a dental therapist;\n(4) complete 2,000 hours of dental therapy clinical practice under direct or indirect supervision;\n(5) graduate from a master's advanced dental therapy education program;\n(6) pass a board-approved certification examination to demonstrate competency under the advanced scope of practice; and\n(7) submit an application and fee for certification as prescribed by the board.\n(a) An advanced dental therapist certified by the board under this section may perform the following services and procedures pursuant to the written collaborative management agreement:\n(1) an oral evaluation and assessment of dental disease and the formulation of an individualized treatment plan authorized by the collaborating dentist;\n(2) the services and procedures described under section 150A.105, subdivision 4, paragraphs (c) and (d); and\n(3) nonsurgical extractions of permanent teeth as limited in subdivision 3, paragraph (b).\n(b) The services and procedures described under this subdivision may be performed under general supervision.\n(a) An advanced practice dental therapist shall not perform any service or procedure described in subdivision 2 except as authorized by the collaborating dentist.\n(b) An advanced dental therapist may perform nonsurgical extractions of periodontally diseased permanent teeth with tooth mobility of +3 to +4 under general supervision if authorized in advance by the collaborating dentist. The advanced dental therapist shall not extract a tooth for any patient if the tooth is unerupted, impacted, fractured, or needs to be sectioned for removal.\n(c) The collaborating dentist is responsible for directly providing or arranging for another dentist or specialist to provide any necessary advanced services needed by the patient.\n(d) An advanced dental therapist in accordance with the collaborative management agreement must refer patients to another qualified dental or health care professional to receive any needed services that exceed the scope of practice of the advanced dental therapist.\n(e) In addition to the collaborative management agreement requirements described in section 150A.105, a collaborative management agreement entered into with an advanced dental therapist must include specific written protocols to govern situations in which the advanced dental therapist encounters a patient who requires treatment that exceeds the authorized scope of practice of the advanced dental therapist. The collaborating dentist must ensure that a dentist is available to the advanced dental therapist for timely consultation during treatment if needed and must either provide or arrange with another dentist or specialist to provide the necessary treatment to any patient who requires more treatment than the advanced dental therapist is authorized to provide.\n(a) An advanced dental therapist may provide, dispense, and administer the following drugs within the parameters of the collaborative management agreement, within the scope of practice of the advanced dental therapist practitioner, and with the authorization of the collaborating dentist: analgesics, anti-inflammatories, and antibiotics.\n(b) The authority to provide, dispense, and administer shall extend only to the categories of drugs identified in this subdivision, and may be further limited by the collaborative management agreement.\n(c) The authority to dispense includes the authority to dispense sample drugs within the categories identified in this subdivision if dispensing is permitted by the collaborative management agreement.\n(d) Notwithstanding paragraph (a), an advanced dental therapist is prohibited from providing, dispensing, or administering a narcotic drug as defined in section 152.01, subdivision 10.",
	"repealed": false
}