{
	"id": "473.523",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.523",
	"title": "473.523 CONSTRUCTION CONTRACTS SUBJECT TO MUNICIPAL BID LAW.",
	"text": "All contracts for construction work, or for the purchase of materials, supplies, or equipment relating to the metropolitan disposal system shall be made as provided in section 471.345, subdivisions 3 to 6. Contracts subject to section 471.345, subdivision 3, shall be made by the council by publishing once in a legal newspaper or trade paper published in a city of the first class not less than two weeks before the last day for submission of bids, notice that bids or proposals will be received. Such notice shall state the nature of the work or purchase and the terms and conditions upon which the contract is to be awarded, and a time and place where such bids will be received, opened, and read publicly. After such bids have been duly received, opened, read publicly, and recorded, the council shall award such contract to the lowest responsible bidder or it may reject all bids and readvertise. Each contract shall be duly executed in writing and the party to whom the contract is awarded shall give sufficient bond or security to the council for the faithful performance of the contract as required by law. The council shall have the right to set qualifications and specifications and to require bids to meet all such qualifications and specifications before being accepted. If the council by an affirmative vote of two-thirds of its members declares that an emergency exists requiring the immediate purchase of materials or supplies at a cost in excess of the amount specified in section 471.345, subdivision 3, or in making emergency repairs, it shall not be necessary to advertise for bids.\nAs an alternative to the procurement method described in subdivision 1, the council may issue a request for proposals and award the contract to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nMS 2013 Supp [Repealed, 2014 c 271 art 3 s 22]\nMS 1985 Supp [Repealed, 1986 c 460 s 59]",
	"repealed": false
}