{
	"id": "145A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.14",
	"title": "145A.14 SPECIAL GRANTS.",
	"text": "(a) The commissioner may make special grants to cities, counties, groups of cities or counties, or nonprofit corporations to establish, operate, or subsidize clinic facilities and services, including mobile clinics, to furnish health services for migrant agricultural workers and their families in areas of the state where significant numbers of migrant workers are located. \"Migrant agricultural worker\" means any individual whose principal employment is in agriculture on a seasonal basis, who has been so employed within the past 24 months, and who has established a temporary residence for the purpose of such employment.\n(b) Applicants must submit for approval a plan and budget for the use of the funds in the form and detail specified by the commissioner.\n(c) Applicants must keep records, including records of expenditures to be audited, as the commissioner specifies.\n(a) The commissioner may make special grants to establish, operate, or subsidize clinic facilities and services to furnish health services for American Indians who reside off reservations.\n(b) Applicants must submit for approval a plan and budget for the use of the funds in the form and detail specified by the commissioner.\n(c) Applicants must keep records, including records of expenditures to be audited, as the commissioner specifies.\n(a) Of the funding available for local public health grants, $1,500,000 per year is available to tribal governments for:\n(1) maternal and child health activities under section 145.882, subdivision 7;\n(2) activities to reduce health disparities under section 145.928, subdivision 10; and\n(3) emergency preparedness.\n(b) The commissioner, in consultation with tribal governments, shall establish a formula for distributing the funds and developing the outcomes to be measured.\nThe commissioner must distribute grants to Tribal governments for foundational public health responsibilities as defined by each Tribal government.\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n[Repealed, 1Sp2003 c 14 art 8 s 32]",
	"repealed": false
}