{
	"id": "147A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/147A.14",
	"title": "147A.14 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of any conduct constituting grounds for discipline under this chapter may report the violation to the board.\nAny hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state shall report to the board any action taken by the institution or organization, any of its administrators, or its medical or other committees to revoke, suspend, restrict, or condition a physician assistant's privilege to practice or treat patients in the institution or as part of the organization, any denial of privileges, or any other disciplinary action. The institution or organization shall also report the resignation of any physician assistants prior to the conclusion of any disciplinary proceeding, or prior to the commencement of formal charges but after the physician assistant had knowledge that formal charges were contemplated or in preparation. Each report made under this subdivision must state the nature of the action taken, state in detail the reasons for the action, and identify the specific patient medical records upon which the action was based. No report shall be required of a physician assistant voluntarily limiting the practice of the physician assistant at a hospital provided that the physician assistant notifies all hospitals at which the physician assistant has privileges of the voluntary limitation and the reasons for it.\nA state or local physician assistant organization shall report to the board any termination, revocation, or suspension of membership or any other disciplinary action taken against a physician assistant. If the society has received a complaint which might be grounds for discipline under this chapter against a member physician assistant on which it has not taken any disciplinary action, the society shall report the complaint and the reason why it has not taken action on it or shall direct the complainant to the Board of Medical Practice. This subdivision does not apply to a physician assistant organization when it performs peer review functions as an agent of an outside entity, organization, or system.\nLicensed health professionals and persons holding residency permits under section 147.0391, shall report to the board personal knowledge of any conduct which the person reasonably believes constitutes grounds for disciplinary action under this chapter by a physician assistant, including any conduct indicating that the person may be incompetent, or may have engaged in unprofessional conduct or may be medically or physically unable to engage safely in practice as a physician assistant. No report shall be required if the information was obtained in the course of a provider-patient relationship if the patient is a physician assistant, and the treating provider successfully counsels the person to limit or withdraw from practice to the extent required by the impairment.\nFour times each year as prescribed by the board, each insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to physician assistants, and any medical clinic, hospital, political subdivision, or other entity that self-insures and provides professional liability coverage to physician assistants, shall submit to the board a report concerning the physician assistants against whom professional malpractice settlements or awards have been made to the plaintiff.\nAny medical clinic, hospital, political subdivision, or other entity which provides liability coverage on behalf of a physician assistant shall submit to the board a report concerning settlements or awards paid on behalf of a physician assistant, and any settlements or awards paid by a clinic, hospital, political subdivision, or other entity on its own behalf because of care rendered by a physician assistant. The report shall be made to the board within 30 days of any settlement. The report must contain at least the following information:\n(1) the total number of medical malpractice settlements or awards made to the plaintiff;\n(2) the date the medical malpractice settlements or awards to the plaintiff were made;\n(3) the allegations contained in the claim or complaint leading to the settlements or awards made to the plaintiff;\n(4) the dollar amount of each medical malpractice settlement or award;\n(5) the regular address of the practice of the physician assistant against whom an award was made or with whom a settlement was made; and\n(6) the name of the physician assistant against whom an award was made or with whom a settlement was made.\nThe insurance company shall, in addition to the above information, report to the board any information it possesses which tends to substantiate a charge that a physician assistant may have engaged in conduct violating this chapter.\nThe court administrator of district court or any other court of competent jurisdiction shall report to the board any judgment or other determination of the court which adjudges or includes a finding that a physician assistant is mentally ill, mentally incompetent, guilty of a felony, guilty of a violation of federal or state narcotics laws or controlled substances act, or guilty of an abuse or fraud under Medicare or Medicaid, appoints a guardian of the physician assistant pursuant to sections 524.5-101 to 524.5-502, or commits a physician assistant pursuant to chapter 253B.\nA physician assistant shall report to the board any personal action which is a violation of this chapter.\nReports required by subdivisions 2 to 7 must be submitted not later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to assure prompt and accurate reporting.\nThe board may issue subpoenas for the production of any reports required by subdivisions 2 to 7 or any related documents.",
	"repealed": false
}