{
	"id": "142G.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.32",
	"title": "142G.32 AMOUNT OF ASSISTANCE PAYMENT.",
	"text": "Except as provided in paragraphs (a) to (e), the amount of an assistance payment is equal to the difference between the MFIP standard of need or the Minnesota family wage level in section 142G.17 and countable income.\n(a) MFIP assistance units are eligible for an MFIP housing assistance grant of $110 per month, unless:\n(1) the housing assistance unit is currently receiving public and assisted rental subsidies provided through the Department of Housing and Urban Development (HUD) and is subject to section 142G.31, subdivision 6; or\n(2) the assistance unit is a child-only case under section 142G.01, subdivision 8.\n(b) On October 1 of each year, the commissioner shall adjust the MFIP housing assistance grant in paragraph (a) for inflation based on the CPI-U for the prior calendar year.\n(c) When MFIP eligibility exists for the month of application, the amount of the assistance payment for the month of application must be prorated from the date of application or the date all other eligibility factors are met for that applicant, whichever is later. This provision applies when an applicant loses at least one day of MFIP eligibility.\n(d) MFIP overpayments to an assistance unit must be recouped according to section 256P.08, subdivision 6.\n(e) An initial assistance payment must not be made to an applicant who is not eligible on the date payment is made.\nHousing assistance grants under subdivision 1, paragraph (a), must be a forecasted program and the commissioner, with the approval of the commissioner of management and budget, may transfer unencumbered appropriation balances within fiscal years of each biennium with other forecasted programs of the department. The commissioner shall inform the chairs and ranking minority members of the house of representatives and senate committees and divisions with primary jurisdiction over the housing assistance grants quarterly about transfers made under this provision.",
	"repealed": false
}