{
	"id": "297F.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.17",
	"title": "297F.17 LIMITATIONS ON TIME FOR ASSESSMENT OF TAX.",
	"text": "Except as otherwise provided in this chapter, the amount of any tax due must be assessed within 3-1/2 years after a return is filed.\nFor purposes of this chapter, a return filed before the last day prescribed by law for its filing is considered filed on the last day.\nWhen a person required to file a return under this chapter files a false or fraudulent return or claim for refund, or fails to file a return, the tax may be assessed, and a proceeding in court for the collection of such tax may be begun at any time.\nIf the person required to file the return omits from the return a dollar amount properly includable in it that is in excess of 25 percent of the dollar amount reported in the return, the tax may be assessed, or a proceeding in court for the collection of such tax may be begun, at any time within 6-1/2 years after the return was filed.\nUnless otherwise provided in this chapter, a claim for a refund of an overpayment of tax must be filed within 3-1/2 years from the date prescribed for filing the return, plus any extension of time granted for filing the return, but only if filed within the extended time, or one year after the date of assessment, whichever period expires later.\nClaims for refund must be filed with the commissioner during the one-year period beginning with the timely filing of the taxpayer's federal income tax return containing the bad debt deduction that is being claimed. Claimants under this subdivision are subject to the notice requirements of sections 289A.38, subdivision 7, and 289A.382.\nIf before the expiration of the time prescribed in this section for the assessment of the tax, the commissioner and the person filing the return consent in writing to an extension of time for the assessment of the tax, the tax may be assessed at any time prior to the expiration of the period agreed upon. The period so agreed upon may be extended by subsequent agreements in writing made before the expiration of the period previously agreed upon.\nThe time during which a tax must be assessed or collection proceedings commenced under this chapter is suspended during the period from the date of a filing of a petition in bankruptcy until 30 days after notice to the commissioner that the bankruptcy proceedings have been closed or dismissed, or that the automatic stay has been terminated or has expired.\nThe suspension of the statute of limitations under this subdivision applies to the person against whom the petition in bankruptcy is filed, and to all other persons who may be wholly or partially liable for the tax under this chapter.",
	"repealed": false
}