{
	"id": "62A.046",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.046",
	"title": "62A.046 COORDINATION OF BENEFITS.",
	"text": "No group contract providing coverage for hospital and medical treatment or expenses issued or renewed after August 1, 1984, which is responsible for secondary coverage for services provided, may deny coverage or payment of the amount it owes as a secondary payor solely on the basis of the failure of another group contract, which is responsible for primary coverage, to pay for those services.\nA group contract which provides coverage of a claimant as a dependent of a parent who has legal responsibility for the dependent's medical care pursuant to a court order under section 518A.41 must make payments directly to the provider of care, the custodial parent, or the Department of Human Services pursuant to section 62A.045. In such cases, liability to the insured is satisfied to the extent of benefit payments made under this section.\nThis section applies to an insurer, a vendor of risk management services regulated under section 60A.23, a nonprofit health service plan corporation regulated under chapter 62C and a health maintenance organization regulated under chapter 62D. Nothing in this section shall require a secondary payor to pay the obligations of the primary payor nor shall it prevent the secondary payor from recovering from the primary payor the amount of any obligation of the primary payor that the secondary payor elects to pay.\nPayments made by an enrollee or by the commissioner on behalf of an enrollee in the MinnesotaCare program under sections 256L.01 to 256L.10, or a person receiving benefits under chapter 256B, for services that are covered by the policy or plan of health insurance shall, for purposes of the deductible, be treated as if made by the insured.\nThe commissioner of human services shall recover payments made by the MinnesotaCare program from the responsible insurer, for services provided by the MinnesotaCare program and covered by the policy or plan of health insurance.\nInsurers, vendors of risk management services, nonprofit health service plan corporations, fraternals, and health maintenance organizations may coordinate benefits to prohibit greater than 100 percent coverage when an insured, subscriber, or enrollee is covered by both an individual and a group contract providing coverage for hospital and medical treatment or expenses. Benefits coordinated under this paragraph must provide for 100 percent coverage of an insured, subscriber, or enrollee. To the extent appropriate, all coordination of benefits provisions currently applicable by law or rule to insurers, vendors of risk management services, nonprofit health service plan corporations, fraternals, and health maintenance organizations, shall apply to coordination of benefits between individual and group contracts. Notwithstanding the definition of \"plan\" in Minnesota Rules, parts 2742.0200, subpart 2, and 4685.0910, subpart 7, an individual contract must coordinate benefits with a group contract under this subdivision consistent with applicable coordination of benefit rules. When a covered person's other coverage is Medicare or TRICARE, a health plan company must determine primacy and coordinate benefits in accordance with the Medicare Secondary Payor or TRICARE provisions of federal law. This subdivision does not apply to specified accident, hospital indemnity, specified disease, or other limited benefit insurance policies.\nIf a health carrier is advised by a covered person that all health plans covering the person are high-deductible health plans and the person intends to contribute to a health savings account established in accordance with section 223 of the Internal Revenue Code of 1986, the primary high-deductible health plan's deductible is not an allowable expense, except for any health care expense incurred that may not be subject to the deductible as described in section 223(c)(2)(C) of the Internal Revenue Code of 1986.",
	"repealed": false
}