{
	"id": "41B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.02",
	"title": "41B.02 DEFINITIONS.",
	"text": "For the purposes of sections 41B.01 to 41B.23, the terms defined in this section have the meanings given them.\n\"Amortized restructured loan\" means a loan after it has been modified pursuant to section 41B.04, subdivision 9, paragraph (d).\n\"Authority\" means the Minnesota Rural Finance Authority created in section 41B.025.\nMS 1986 [Renumbered subd 10]\n\"Basic interest\" means that part of interest on primary principal that is payable while the loan is in effect.\nMS 1987 Supp [Renumbered subd 8]\n\"Bonds\" means bonds, notes, or other obligations issued by the authority. For the purposes of section 41B.19, \"bonds\" also includes bonds or other obligations issued by the state.\nMS 1987 Supp [Renumbered subd 9]\n\"Borrower\" means the person or persons liable on a qualified agricultural loan.\nMS 1987 Supp [Renumbered subd 13]\n\"Current market value\" means, for the purposes of section 41B.04, the value determined by an appraisal considering comparable sales in the area where the real estate is located and the reasonable productive value of the property based on past production history. The state and the eligible agricultural lender must mutually agree on the current market value.\nMS 1986 [Renumbered subd 4]\n\"Deferred interest\" means that portion of the interest on primary principal and secondary principal the payment of which is deferred for the term of the deferred restructured loan. The deferred interest on primary principal may accrue at a different rate from the deferred interest on secondary principal as described in section 41B.04.\n\"Direct loan\" means a loan originated and serviced by the authority without involvement of an eligible lender.\n\"Deferred restructured loan\" means a loan after it has been modified pursuant to section 41B.04, subdivision 9, paragraph (a).\nMS 1986 [Renumbered subd 16]\n\"Eligible agricultural lender\" or \"eligible lender\" means a bank, credit union, or savings association chartered by the state or federal government, a subdivision of the Farm Credit System, the Federal Deposit Insurance Corporation, the Federal Savings and Loan Insurance Corporation, or any insurance company, fund, or other financial institution doing business as an agricultural lender within the state, if the authority determines that the agricultural lender has sufficient personnel and other resources to efficiently and properly originate and service qualified agricultural loans. An eligible agricultural lender must enter into one or more agreements with the authority providing for the origination and servicing of qualified agricultural loans on the terms and conditions the authority determines to be appropriate.\n\"Eligible borrower\" means a borrower who meets the eligibility criteria for a program in section 41B.03.\nMS 1986 [Renumbered subd 15]\n\"Farm\" means a family farm as defined in section 500.24, located in Minnesota.\n\"Livestock expansion and modernization\" means the purchase of a livestock farm or improvements to a livestock operation, including the purchase and construction or installation of improvements to land, buildings, and other permanent structures, including equipment incorporated in or permanently affixed to the land, buildings, or structures, which are useful for and intended to be used for the purpose of raising livestock.\nMS 1987 Supp [Renumbered subd 3]\n\"Original loan\" means a loan prior to restructuring as provided in section 41B.04.\nMS 1986 [Renumbered subd 7]\n\"Primary principal\" means that portion of the outstanding balance on a loan covered by section 41B.04 that is equal to the current market value of the property secured by the loan or such lesser amount as may be established by the authority by rule.\nMS 1987 Supp [Renumbered subd 6]\n\"Qualified agricultural loan\" means a loan to an eligible borrower made under agricultural programs established and implemented by the authority.\nMS 1987 Supp [Renumbered subd 5]\n\"Restructured loan\" means both a deferred restructured loan and an amortized restructured loan after it is modified pursuant to section 41B.04.\nMS 1987 Supp [Renumbered subd 11]\n\"Secondary principal\" means that portion of the outstanding balance of a deferred restructured loan covered by section 41B.04 that is in excess of the primary principal.\nMS 1986 [Renumbered subd 14]\n\"Security account\" means the Rural Finance Authority security account established in section 41B.19, subdivision 5.\nMS 1986 [Repealed, 1987 c 396 art 1 s 32]\n\"Seller-sponsored loan\" means a loan in which part or all of the price of a farm is financed by a loan from the seller of the farm who is a natural person, a partnership, or a family farm corporation as defined in section 500.24, located in Minnesota.\n\"Agricultural improvements\" means improvements to a farm, including the purchase and construction or installation of improvements to land, buildings, and other permanent structures, including equipment incorporated in or permanently affixed to the land, buildings, or structures, which are useful for and intended to be used for the purpose of farming. \"Agricultural improvements\" includes wind energy conversion facilities, as defined in section 216C.06, subdivision 19, each with an output capacity of one megawatt or less, as determined by the nameplate capacity. \"Agricultural improvements\" does not include equipment not affixed to real estate or improvements or additions to that equipment.\n\"Ethanol production facility\" means a facility that ferments, distills, dewaters, or otherwise produces ethanol as defined in section 41A.09, subdivision 2a, paragraph (a).",
	"repealed": false
}