{
	"id": "10A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.03",
	"title": "10A.03 LOBBYIST REGISTRATION.",
	"text": "A lobbyist must file a registration form with the board within five days after becoming a lobbyist or being engaged by a new individual, association, political subdivision, or public higher education system.\nThe board must prescribe a registration form, which must include:\n(1) the name, address, and email address of the lobbyist;\n(2) the principal place of business of the lobbyist;\n(3) the name and address of each individual, association, political subdivision, or public higher education system, if any, by whom the lobbyist is retained or employed or on whose behalf the lobbyist appears;\n(4) the website address of each association, political subdivision, or public higher education system identified under clause (3), if the entity maintains a website;\n(5) the general lobbying categories on which the lobbyist expects to lobby on behalf of a represented entity; and\n(6) if the lobbyist lobbies on behalf of an association, the name and address of the officers and directors of the association.\nIf a lobbyist fails to file a registration form by the date that the form was due, the board may impose a late filing fee of $25 per day, not to exceed $1,000, starting on the day after the form was due. The board must send notice by certified mail to a lobbyist who fails to file a form within ten business days after the form was due that the lobbyist may be subject to a civil penalty for failure to file the form. A lobbyist who fails to file a form within seven days after the certified mail notice was sent by the board is subject to a civil penalty imposed by the board of up to $1,000.\nThe restrictions of section 10.60 notwithstanding, the board may publish the information required in subdivision 2 on its website.\nFor good cause shown, the board must grant exemptions to the requirement that email addresses be provided.\nA list of general lobbying categories and specific subjects of interest must be specified by the board and updated periodically based on public comment and information provided by lobbyists. The board must publish on its website the current list of general lobbying categories and specific subjects of interest. Chapter 14 and section 14.386 do not apply to the specification, publication, or periodic updates of the list of general lobbying categories and specific subjects of interest.",
	"repealed": false
}