{
	"id": "62J.2930",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.2930",
	"title": "62J.2930 INFORMATION CLEARINGHOUSE.",
	"text": "The commissioner of health shall establish an information clearinghouse within the Department of Health to facilitate the ability of consumers, employers, providers, health plan companies, and others to obtain information on health reform activities in Minnesota. The commissioner shall make available through the clearinghouse updates on federal and state health reform activities, including information developed or collected by the Department of Health on cost containment or other research initiatives, the development of voluntary purchasing pools, action plans submitted by health plan companies, reports or recommendations of the Health Technology Advisory Committee and other entities on technology assessments, and reports or recommendations from other formal committees applicable to health reform activities. The clearinghouse shall also refer requestors to sources of further information or assistance. The clearinghouse is subject to chapter 13.\nThe information clearinghouse shall provide information on all health plan companies operating in a specific geographic area to consumers and purchasers who request it.\n(a) The information clearinghouse or another entity designated by the commissioner shall provide consumer information to health plan company enrollees to:\n(1) assist enrollees in understanding their rights;\n(2) explain and assist in the use of all available complaint systems, including internal complaint systems within health carriers, community integrated service networks, and the Departments of Health and Commerce;\n(3) provide information on coverage options in each region of the state;\n(4) provide information on the availability of purchasing pools and enrollee subsidies; and\n(5) help consumers use the health care system to obtain coverage.\n(b) The information clearinghouse or other entity designated by the commissioner for the purposes of this subdivision shall not:\n(1) provide legal services to consumers;\n(2) represent a consumer or enrollee; or\n(3) serve as an advocate for consumers in disputes with health plan companies.\n(c) Nothing in this subdivision shall interfere with the ombudsman program established under section 256B.6903 or other existing ombudsman programs.\nTo the extent possible, the commissioner shall coordinate the activities of the clearinghouse with the activities of the Minnesota Health Data Institute.",
	"repealed": false
}