{
	"id": "204B.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.28",
	"title": "204B.28 CLERKS; ELECTION SUPPLIES; DUTIES.",
	"text": "At least 12 weeks before each regularly scheduled town general election conducted in March, and at least 18 weeks before all other general elections, each county auditor shall conduct a meeting or otherwise communicate with local election officials to review the procedures for the election. The county auditor may require the head election judges in the county to attend this meeting.\n(a) Except as otherwise provided in this section and for absentee ballots in section 204B.35, subdivision 4, the county auditor shall complete the preparation of the election materials for which the auditor is responsible at least four days before every state primary and state general election. At any time after all election materials are available from the county auditor but not later than four days before the election each municipal clerk shall secure from the county auditor:\n(1) the forms that are required for the conduct of the election;\n(2) any printed voter instruction materials furnished by the secretary of state;\n(3) any other instructions for election officers; and\n(4) a sufficient quantity of the official ballots, registration files, envelopes for ballot returns, and other supplies and materials required for each precinct in order to comply with the provisions of the Minnesota Election Law. The county auditor may furnish the election supplies to the municipal clerks in the same manner as the supplies are furnished to precincts in unorganized territory pursuant to section 204B.29, subdivision 1.\n(b) The county auditor must prepare and make available election materials for early voting to municipal clerks designated to administer early voting under section 203B.05 on or before the 19th day before the election.\n[See Note.]\nThe county auditor or municipal clerk must certify the number of ballots being provided to each precinct and provide this number to the election judges for inclusion on the summary statement. The auditor or clerk must not open prepackaged ballots, but must count the ballots, presuming that the total count for each package is correct.",
	"repealed": false
}