{
	"id": "223.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/223.25",
	"title": "223.25 GRAIN INDEMNITY PREMIUMS.",
	"text": "(a) Except as provided in subdivision 3, producers of grain must be charged a grain indemnity premium as determined and published by the commissioner not to exceed 0.2 percent of the price on all marketed grain that is sold to a grain buyer as defined in chapter 223.\n(b) The grain indemnity premiums required under this section are in addition to any other fees or assessments required by law.\n(a) Each producer must pay to the commissioner a grain indemnity premium of not more than 0.2 percent of the net proceeds from all grain sold by the producer to a grain buyer purchasing grain in Minnesota. When a producer sells grain to a grain buyer, the grain buyer must deduct the grain indemnity premium from the proceeds of the sale and pay the grain indemnity premium to the commissioner on behalf of the producer.\n(b) When purchasing grain from a producer, a grain buyer must deduct the grain indemnity premium described in paragraph (a) from the proceeds of the sale and notify the producer of the amount of the deduction in writing. The grain buyer must forward the grain indemnity premium to the commissioner for deposit into the grain indemnity account on behalf of the producer as described in this subdivision.\n(c) A grain buyer must clearly indicate the grain indemnity premiums collected under paragraph (b) in the grain buyer's books and records. A grain buyer must retain books and records containing the grain indemnity premiums for at least three years. A grain buyer must make the grain buyer's books and records available for inspection by the commissioner during regular business hours. The department must take steps reasonably necessary to verify the accuracy of the grain indemnity premiums as recorded in the grain buyer's books and records. Any record or portion thereof seized or copied by the commissioner is private or nonpublic data as provided in section 13.02, except that the commissioner may disclose data to aid in the law enforcement process.\n(d) A grain buyer must submit grain indemnity premiums collected under paragraph (a) to the commissioner for the purpose of financing or contributing to the financing of the grain indemnity account by:\n(1) January 31 for grain indemnity premiums collected during the months of July, August, September, October, November, and December; and\n(2) July 31 for grain indemnity premiums collected during the months of January, February, March, April, May, and June.\n(a) Except as provided in paragraph (b), the grain indemnity premiums required under this section must be collected until the grain indemnity account contains more than $15,000,000 as of June 30 of any given year.\n(b) The commissioner must not require the collection of additional grain indemnity premiums until the amount in the grain indemnity account drops below $8,000,000. In a year when the commissioner determines that the grain indemnity account is at or below $8,000,000, the commissioner may reinstate the collection described in this section. If the account contains at least $8,000,000, the commissioner may, after holding a public meeting, suspend premium payments for all producers in the event of economic hardship.\n(c) The commissioner shall announce the intention to collect the premiums described in this section by May 1 with collection to begin July 1 until the grain indemnity account contains at least $15,000,000. The commissioner must notify the public of the commissioner's intent to reinstate collection of additional grain indemnity premiums through publication in the State Register and by notifying each licensee of the licensee's obligation to collect premiums.",
	"repealed": false
}