{
	"id": "590.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/590.01",
	"title": "590.01 AVAILABILITY, CONDITIONS.",
	"text": "Except at a time when direct appellate relief is available, a person convicted of a crime, who claims that:\n(1) the conviction obtained or the sentence or other disposition made violated the person's rights under the Constitution or laws of the United States or of the state; or\n(2) scientific evidence not available at trial, obtained pursuant to a motion granted under subdivision 1a, establishes the petitioner's actual innocence;\nmay commence a proceeding to secure relief by filing a petition in the district court in the county in which the conviction was had to vacate and set aside the judgment and to discharge the petitioner or to resentence the petitioner or grant a new trial or correct the sentence or make other disposition as may be appropriate. A petition for postconviction relief after a direct appeal has been completed may not be based on grounds that could have been raised on direct appeal of the conviction or sentence. Nothing contained herein shall prevent the supreme court or the court of appeals, upon application by a party, from granting a stay of a case on appeal for the purpose of allowing an appellant to apply to the district court for an evidentiary hearing under the provisions of this chapter. The proceeding shall conform with sections 590.01 to 590.06.\n(a) A person convicted of a crime may make a motion for the performance of fingerprint or forensic DNA testing to demonstrate the person's actual innocence if:\n(1) the testing is to be performed on evidence secured in relation to the trial which resulted in the conviction; and\n(2) the evidence was not subject to the testing because either the technology for the testing was not available at the time of the trial or the testing was not available as evidence at the time of the trial.\nThe motion shall be filed before the district court that entered the judgment of conviction. Reasonable notice of the motion shall be served on the prosecuting attorney who represented the state at trial.\n(b) A person who makes a motion under paragraph (a) must present a prima facie case that:\n(1) identity was an issue in the trial; and\n(2) the evidence to be tested has been subject to a chain of custody sufficient to establish that it has not been substituted, tampered with, replaced, or altered in any material aspect.\n(c) The court shall order that the testing be performed if:\n(1) a prima facie case has been established under paragraph (b);\n(2) the testing has the scientific potential to produce new, noncumulative evidence materially relevant to the defendant's assertion of actual innocence; and\n(3) the testing requested employs a scientific method generally accepted within the relevant scientific community. The court shall impose reasonable conditions on the testing designed to protect the state's interests in the integrity of the evidence and the testing process.\nThis remedy takes the place of any other common law, statutory or other remedies which may have been available for challenging the validity of a conviction, sentence, or other disposition and must be used exclusively in place of them unless it is inadequate or ineffective to test the legality of the conviction, sentence or other disposition.\nA person who has been convicted and sentenced for a crime committed before May 1, 1980, may institute a proceeding applying for relief under this chapter upon the ground that a significant change in substantive or procedural law has occurred which, in the interest of justice, should be applied retrospectively, including resentencing under subsequently enacted law.\nNo petition seeking resentencing shall be granted unless the court makes specific findings of fact that release of the petitioner prior to the time the petitioner would be released under the sentence currently being served does not present a danger to the public and is not incompatible with the welfare of society.\n(a) No petition for postconviction relief may be filed more than two years after the later of:\n(1) the entry of judgment of conviction or sentence if no direct appeal is filed; or\n(2) an appellate court's disposition of petitioner's direct appeal.\n(b) Notwithstanding paragraph (a), a court may hear a petition for postconviction relief if:\n(1) the petitioner establishes that a physical disability or mental disease precluded a timely assertion of the claim;\n(2) the petitioner alleges the existence of newly discovered evidence, including scientific evidence, that provides facts necessary to sustain one or more legally cognizable claims for postconviction relief, if such evidence could not have been ascertained by the exercise of due diligence by the petitioner or petitioner's attorney within the two-year time period for filing a postconviction petition, is not cumulative to evidence presented at trial, and is not for impeachment purposes;\n(3) the petitioner asserts a new interpretation of federal or state constitutional or statutory law by either the United States Supreme Court or a Minnesota appellate court and the petitioner establishes that this interpretation is retroactively applicable to the petitioner's case;\n(4) the petition is brought pursuant to subdivision 3; or\n(5) the petitioner establishes to the satisfaction of the court that the petition is not frivolous and is in the interests of justice.\n(c) Any petition invoking an exception provided in paragraph (b) must be filed within two years of the date the claim arises.\n[See Note.]",
	"repealed": false
}