{
	"id": "237.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.59",
	"title": "237.59 CLASSIFICATION OF COMPETITIVE SERVICE; HEARING.",
	"text": "(a) The following services provided by the telephone company are subject to emerging competition unless and until reclassified as noncompetitive or subject to effective competition under this section:\n(1) apartment door answering services;\n(2) automatic call distribution;\n(3) billing and collection services;\n(4) call waiting, call forwarding, and three-way calling services for businesses with three or more lines;\n(5) central office-based pricing packages providing switched business access lines which substitute for private branch exchange systems which may or may not share intelligence with customer premises equipment;\n(6) command link-type services for network reconfiguring to rearrange cross-connections between channel services;\n(7) custom network services and special assemblies;\n(8) Digicom switchnet services for full duplex, synchronous, information transport;\n(9) direct customer access services for telephone number information;\n(10) teleconferencing services;\n(11) inter-LATA and intra-LATA message toll service;\n(12) inter-LATA and intra-LATA private line services;\n(13) inter-LATA and intra-LATA wide area telephone service;\n(14) mobile radio services;\n(15) operator services, excluding local operator services;\n(16) public pay telephone services, excluding charges for access to the central office;\n(17) special construction of facilities;\n(18) systems for automatic dialing; and\n(19) versanet-type service access line involving continuous monitoring and transmission of data from customer's premises to the central office.\n(b) A service classified as subject to emerging competition before June 1, 1994, retains that classification unless and until it is reclassified pursuant to subdivision 3 or 10.\nNotwithstanding the terms of subdivision 1, paragraph (b), CLASS services may be classified as competitive services only when so classified according to subdivision 3 or 10.\n(a) A telephone company, or the commission on its own motion, may petition to have a service of that telephone company classified as subject to effective competition or emerging competition. The petition must be served on the commission, the department, the Office of the Attorney General, and any other person designated by the commission. The petition must contain at least:\n(1) a list of the known alternative providers of the service available to the company's customers; and\n(2) a description of affiliate relationships with any other provider of the service in the company's market.\n(b) At the time the company first offers a service, it shall also file a petition with the commission for a determination as to how the service should be classified. In the event that no interested party or the commission objects to the company's proposed classification within 20 days of the filing of the petition, the company's proposed classification of the service is deemed approved. If an objection is filed, the commission shall determine the appropriate classification after a hearing conducted pursuant to section 237.61. In either event, the company may offer the new service to its customers ten days after the company files the price list and incremental cost study as provided in Minnesota Rules, parts 7811.2210 and 7812.2210.\n(c) A new service may be classified as subject to effective competition or emerging competition pursuant to the criteria set forth in subdivision 5. A new service must be regulated under the emerging competition provisions if it is not integrally related to the provision of adequate local service or access to the telephone network or to the privacy, health, or safety of the company's customers, whether or not it meets the criteria set forth in subdivision 5.\nAn interested party wishing to contest the change of classification of a service must file an objection with the commission within 20 days after the filing of the petition. If no party files an objection, the service must be reclassified in accordance with the petition. If a petition is contested, a telephone company that is the subject of a petition under subdivision 2 may request that the commission determine the classification of the service through an expedited proceeding under section 237.61 or a contested case hearing. If an expedited proceeding is requested, the commission must provide interested persons an opportunity to comment on the appropriateness of the process and the merits of the petition.\nWhen an expedited proceeding is requested, the commission shall make a final determination within 60 days of the date on which all required information required under subdivision 2 is filed, unless during the 60 days the commission finds that a material issue of fact is in dispute, in which case it shall order that a contested case hearing be conducted to evaluate the petition.\nIf a contested case hearing is held under this section, the commission shall make a final determination on the petition within eight months from the date the petitioning party requests a contested case hearing or from the date the commission orders a contested case hearing under subdivision 3. When a contested case hearing is requested in the petition or when the commission acts on its own motion, this deadline may be extended for no more than 60 days by agreement of all parties or by order of the commission if the commission finds that the case cannot be completed within the required time and that without an extension there is substantial probability that the public interest will be harmed.\n(a) If a proposed classification is objected to pursuant to subdivision 2, paragraph (b), on the basis that the service does not meet the criteria of this subdivision, the commission shall consider, in determining whether a service is subject to either effective competition or emerging competition from available alternative service providers, the following factors:\n(1) the number and sizes of alternative providers of service and affiliation to other providers;\n(2) the extent to which services are available from alternative providers in the relevant market;\n(3) the ability of alternative providers to make functionally equivalent or substitute services readily available at competitive rates, terms, and conditions of service;\n(4) the market share, the ability of the market to hold prices close to cost, and other economic measures of market power; and\n(5) the necessity of the service to the well-being of the customer.\n(b) In order for the commission to find a service subject to effective competition alternative services must be available to over 50 percent of the company's customers for that service.\n(c) In order for the commission to find a service subject to emerging competition alternative services must be available to over 20 percent of the company's customers for that service.\nThe classification of a service may not be changed so as to result in lessened regulation unless it is demonstrated by a preponderance of the evidence that the criteria of subdivision 5 have been met.\n[Repealed, 1993 c 268 s 6]\nA telephone company that has a petition pending before the commission under this section to declare a service competitive may decrease its price for that service without notice while the commission considers the petition. A company must provide an incremental cost study if requested by the commission. The commission shall suspend a company's right under this subdivision to decrease rates if, after an expedited hearing conducted under section 237.61, the commission finds that the service is being priced below cost, or that the company has within the previous 12 months charged customers interim rates under this subdivision for the same service, and that service was determined by the commission to be noncompetitive.\nA telephone company that offers only competitive services is not subject to the accounting and reporting requirements of this chapter unless otherwise ordered by the commission for good cause. A telephone company that offers both competitive and noncompetitive services is not subject to the reporting requirements with regard to its effective competition services unless otherwise ordered by the commission for good cause.\n(a) The commission, on its own motion or upon complaint, shall reclassify a service as noncompetitive or as subject to emerging competition and reinstate, in whole or in part, rate regulation of the service if, after notice and hearing, the commission finds either:\n(1) that the competitive market for that service, on review of the criteria found in subdivision 5, has failed so that rate regulation of that service is necessary to protect the interest of consumers, that it has considered the alternatives to rate regulation, and that the benefits of rate regulation outweigh the burdens of rate regulation; or\n(2) that unreasonable discrimination has occurred between different areas of the state.\n(b) In any proceeding to reclassify a service the person initiating the complaint has the burden of proving that the existing classification is inappropriate, except the telephone company providing the service has the burden of proving that the classification is appropriate when the proceeding is commenced by the commission on its own motion or when the complainant is the department or the attorney general.",
	"repealed": false
}