{
	"id": "270C.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.86",
	"title": "270C.86 POWER TO ABATE; CORRECTION OF ERRORS.",
	"text": "(a) Except for matters delegated to the various boards of county commissioners under section 375.192, and except as otherwise provided by law, the commissioner shall have power to grant such reduction or abatement of net tax capacities, taxes imposed by the property tax laws, or special assessments, and of any costs, penalties, or interest thereon as the commissioner may deem just and equitable, and to order the refundment, in whole or in part, of any taxes or special assessments, and costs, penalties, or interest thereon which have been erroneously or unjustly paid. Application therefor shall be submitted with a statement of facts in the case and the favorable recommendation of the county board or of the board of abatement of any city where any such board exists, and the county auditor of the county wherein such tax was levied or paid. No reduction, abatement, or refundment of any special assessments made or levied by any municipality for local improvements shall be made unless it is also approved by the board of review or similar taxing authority of such municipality.\n(b) The commissioner shall forward to the county auditor a copy of the order made by the commissioner in all cases in which the approval of the county board is required.\n(c) An appeal may not be taken to the Tax Court from any order of the commissioner made in the exercise of the discretionary authority granted in paragraph (a) with respect to the reduction or abatement of real or personal property taxes in response to an application for an abatement, reduction, or refund of taxes, net tax capacities, costs, penalties, or interest.\n(a) The commissioner shall examine all applications submitted by a county board pursuant to section 375.192, subdivision 3. If the applicant has previously submitted a claim for property tax relief pursuant to chapter 290A based on the property taxes payable prior to receiving the abatement, the commissioner may approve the application in an amount reduced by the relief provided pursuant to chapter 290A.\n(b) An appeal may be taken to the Tax Court from an order of the commissioner made pursuant to this subdivision.\nOn application of the county auditor with the approval of the county board, the commissioner may order the correction of any administrative and clerical errors in the assessment, levy, and extension of taxes under the property tax laws, other than valuation.",
	"repealed": false
}