{
	"id": "6.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.54",
	"title": "6.54 EXAMINATION OF POLITICAL SUBDIVISION RECORDS; PETITION.",
	"text": "The registered voters in a political subdivision other than a town or school district or the electors at an annual or special town meeting of a town may petition the state auditor to examine the books, records, accounts, and affairs of the political subdivision or of any organizational unit, activity, project, enterprise, or fund thereof; and the scope of the examination may be limited by the petition, but the examination shall cover, at least, all cash received and disbursed and the transactions relating thereto, provided that the state auditor shall not examine more than the six latest years preceding the circulation of the petition, unless it appears to the state auditor during the examination that the audit period should be extended to permit a full recovery under bonds furnished by public officers or employees, and may if it appears to the auditor in the public interest confine the period or the scope of audit or both period and scope of audit, to less than that requested by the petition. In the case of a political subdivision other than a town or school district, the petition shall be signed by a number of registered voters at least equal to 20 percent of those voting in the last presidential election.\nThe eligible voters of any school district may petition the state auditor, who shall be subject to the same restrictions regarding the scope and period of audit, provided that the petition shall be signed by at least ten eligible voters for each 50 resident pupils in average daily membership during the preceding school year as shown on the records in the office of the commissioner of education. In the case of school districts, the petition shall be signed by at least ten eligible voters.\nAt the time it is circulated, every petition shall contain a statement that the cost of the audit will be borne by the political subdivision as provided by law. Thirty days before the petition is delivered to the state auditor it shall be presented to the appropriate clerk or chief administrative officer of the political subdivision and the county auditor. The county auditor shall determine and certify whether the petition is signed by the required number of registered voters or eligible voters as the case may be. The certificate shall be conclusive evidence thereof in any action or proceeding for the recovery of the costs, charges, and expenses of any examination made pursuant to the petition.",
	"repealed": false
}