{
	"id": "260C.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.175",
	"title": "260C.175 TAKING CHILD INTO CUSTODY.",
	"text": "No child may be taken into immediate custody except:\n(1) with an order issued by the court in accordance with the provisions of section 260C.151, subdivision 6, or Laws 1997, chapter 239, article 10, section 10, paragraph (a), clause (3), or 12, paragraph (a), clause (3), or by a warrant issued in accordance with the provisions of section 260C.154;\n(2) by a peace officer:\n(i) when a child has run away from a parent, guardian, or custodian, or when the peace officer reasonably believes the child has run away from a parent, guardian, or custodian, but only for the purpose of transporting the child home, to the home of a relative, or to another safe place, which may include a shelter care facility; or\n(ii) when a child is found in surroundings or conditions which endanger the child's health or welfare or which such peace officer reasonably believes will endanger the child's health or welfare. If an Indian child is a resident of a reservation or is domiciled on a reservation but temporarily located off the reservation, the taking of the child into custody under this clause shall be consistent with the Indian Child Welfare Act of 1978, United States Code, title 25, section 1922;\n(3) by a peace officer or probation or parole officer when it is reasonably believed that the child has violated the terms of probation, parole, or other field supervision; or\n(4) by a peace officer or probation officer under section 260C.143, subdivision 1 or 4.\n(a) At the time that a peace officer takes a child into custody for relative placement or shelter care pursuant to subdivision 1, section 260C.151, subdivision 5, or section 260C.154, the officer shall notify the child's parent or custodian and the child, if the child is ten years of age or older, that under section 260C.181, subdivision 2, the parent or custodian or the child may request to place the child with a relative as defined in section 260C.007, subdivision 27, instead of in a shelter care facility.\n(b) When a child who is not alleged to be delinquent is taken into custody pursuant to subdivision 1, clause (1) or (2), item (ii), and placement with an identified relative is requested, the peace officer shall coordinate with the responsible social services agency to ensure the child's safety and well-being and comply with section 260C.181, subdivision 2.\n(c) The officer also shall give the parent or custodian of the child a list of names, addresses, and telephone numbers of social services agencies that offer child welfare services. If the parent or custodian was not present when the child was removed from the residence, the list shall be left with an adult on the premises or left in a conspicuous place on the premises if no adult is present. If the officer has reason to believe the parent or custodian is not able to read and understand English, the officer must provide a list that is written in the language of the parent or custodian. The list shall be prepared by the commissioner of children, youth, and families. The commissioner shall prepare lists for each county and provide each county with copies of the list without charge. The list shall be reviewed annually by the commissioner and updated if it is no longer accurate. Neither the commissioner nor any peace officer or the officer's employer shall be liable to any person for mistakes or omissions in the list. The list does not constitute a promise that any agency listed will assist the parent or custodian.\n(a) A peace officer who takes a child of any age or gender into custody under the provisions of this section is authorized to perform a protective pat-down search of the child in order to protect the officer's safety.\n(b) A peace officer also may perform a protective pat-down search of a child in order to protect the officer's safety in circumstances where the officer does not intend to take the child into custody, if this section authorizes the officer to take the child into custody.\n(c) Evidence discovered in the course of a lawful search under this section is admissible.",
	"repealed": false
}