{
	"id": "321.0204",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.0204",
	"title": "321.0204 SIGNING OF RECORDS.",
	"text": "(a) Each record delivered to the secretary of state for filing pursuant to this chapter must be signed in the following manner:\n(1) An initial certificate of limited partnership must be signed by all general partners listed in the certificate.\n(2) An amendment adding or deleting a statement that the limited partnership is a limited liability limited partnership must be signed by all general partners listed in the certificate.\n(3) An amendment designating as general partner a person admitted under section 321.0801(3)(B) following the dissociation of a limited partnership's last general partner must be signed by that person.\n(4) An amendment required by section 321.0803(c) following the appointment of a person to wind up the dissolved limited partnership's activities must be signed by that person.\n(5) Any other amendment must be signed by:\n(A) at least one general partner listed in the certificate;\n(B) each other person designated in the amendment as a new general partner; and\n(C) each person that the amendment indicates has dissociated as a general partner, unless:\n(i) the person is deceased or a guardian or general conservator has been appointed for the person and the amendment so states; or\n(ii) the person has previously delivered to the secretary of state for filing a statement of dissociation.\n(6) A restated certificate of limited partnership must be signed by at least one general partner listed in the certificate, and, to the extent the restated certificate effects a change under any other paragraph of this subsection, the certificate must be signed in a manner that satisfies that paragraph.\n(7) A statement of termination must be signed by all general partners listed in the certificate or, if the certificate of a dissolved limited partnership lists no general partners, by the person appointed pursuant to section 321.0803(c) or (d) to wind up the dissolved limited partnership's activities.\n(8) Articles of conversion must be signed by each general partner listed in the certificate of limited partnership.\n(9) Articles of merger must be signed as provided in section 321.1108(a).\n(10) Any other record delivered on behalf of a limited partnership to the secretary of state for filing must be signed by at least one general partner listed in the certificate.\n(11) A statement by a person pursuant to section 321.0605(a)(4) stating that the person has dissociated as a general partner must be signed by that person.\n(12) A statement of withdrawal by a person pursuant to section 321.0306 must be signed by that person.\n(13) A record delivered on behalf of a foreign limited partnership to the secretary of state for filing must be signed by at least one general partner of the foreign limited partnership.\n(14) Any other record delivered on behalf of any person to the secretary of state for filing must be signed by that person.\n(b) Any person may sign by an attorney-in-fact any record to be filed pursuant to this chapter.",
	"repealed": false
}