{
	"id": "16C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.05",
	"title": "16C.05 CONTRACT MANAGEMENT; VALIDITY AND REVIEW.",
	"text": "Agencies shall fully cooperate with the commissioner in the creation, management, and oversight of state contracts. Authority delegated to agencies shall be exercised in the name of the commissioner and under the commissioner's direct supervision and control. A delegation of duties may include, but is not limited to, allowing individuals within agencies to acquire goods, services, construction, and utilities within dollar limitations and for designated types of acquisitions. Delegation of contract management and review functions must be filed with the secretary of state. The commissioner may withdraw any delegation at the commissioner's sole discretion. The commissioner may require an agency head or subordinate to accept delegated responsibility to procure goods, services, or construction intended for the exclusive use of the agency receiving the delegation.\n(a) A contract and amendments are not valid and the state is not bound by them and no agency, without the prior written approval of the commissioner granted pursuant to subdivision 2a, may authorize work to begin on them unless:\n(1) they have first been executed by the head of the agency or a delegate who is a party to the contract;\n(2) they have been approved by the commissioner; and\n(3) the accounting system shows an encumbrance for the amount of the contract liability, except as allowed by policy approved by the commissioner and commissioner of management and budget for routine, low-dollar procurements and section 16B.98, subdivision 11.\n(b) Grants, interagency agreements, purchase orders, work orders, and annual plans need not, in the discretion of the commissioner and attorney general, require the signature of the commissioner and/or the attorney general. A signature is not required for work orders and amendments to work orders related to Department of Transportation contracts. Bond purchase agreements by the Minnesota Public Facilities Authority do not require the approval of the commissioner.\n(c) Amendments to contracts must entail tasks that are substantially similar to those in the original contract or involve tasks that are so closely related to the original contract that it would be impracticable for a different contractor to perform the work. The commissioner or an agency official to whom the commissioner has delegated contracting authority under section 16C.03, subdivision 16, must determine that an amendment would serve the interest of the state better than a new contract and would cost no more.\n(d) A record must be kept of all responses to solicitations, including names of bidders and amounts of bids or proposals. A fully executed copy of every contract, amendments to the contract, and performance evaluations relating to the contract must be kept on file at the contracting agency for a time equal to that specified for contract vendors and other parties in subdivision 5. These records are open to public inspection, subject to section 13.591 and other applicable law.\n(e) The attorney general must periodically review and evaluate a sample of state agency contracts to ensure compliance with laws.\n(f) Before executing a contract or license agreement involving intellectual property developed or acquired by the state, a state agency shall seek review and comment from the attorney general on the terms and conditions of the contract or agreement.\nThe commissioner may grant an agency approval to authorize work to begin on a contract prior to the full execution of the contract in the event of an emergency as defined in section 16C.10, subdivision 2.\n[Repealed by amendment, 2014 c 196 art 2 s 4]\nA contracting agency shall diligently administer and monitor any contract it has entered into. The commissioner may require an agency to report to the commissioner at any time on the status of any contracts to which the agency is a party.\nA contract or any pass-through disbursement of public funds to a vendor of goods or services or a grantee made by or under the supervision of the commissioner or any county or unit of local government must include, expressed or implied, an audit clause that provides that the books, records, documents, and accounting procedures and practices of the vendor or other party, that are relevant to the contract or transaction, are subject to examination by the contracting agency and either the legislative auditor or the state auditor, as appropriate, for a minimum of six years. If the contracting agency is a local unit of government, and the governing body of the local unit of government requests that the state auditor examine the books, records, documents, and accounting procedures and practices of the vendor or other party pursuant to this subdivision, the contracting agency shall be liable for the cost of the examination. If the contracting agency is a local unit of government, and the grantee, vendor, or other party requests that the state auditor examine all books, records, documents, and accounting procedures and practices related to the contract, the grantee, vendor, or other party that requested the examination shall be liable for the cost of the examination. An agency contract made for purchase, lease, or license of software and data from the state is not required to contain this audit clause.\nThe attorney general may pursue remedies available by law to avoid the obligation of an agency to pay under a contract or to recover payments made if services performed or goods received under the contract are so unsatisfactory, incomplete, or inconsistent that payment would involve unjust enrichment. The contrary opinion of the contracting agency does not affect the power of the attorney general under this subdivision.\nNotwithstanding any other law, an agency may not require an Indian tribe or band to deny its sovereignty as a requirement or condition of a contract with an agency.",
	"repealed": false
}