{
	"id": "626.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.94",
	"title": "626.94 CONSERVATION LAW ENFORCEMENT AUTHORITY.",
	"text": "As used in this section, \"Indian conservation enforcement authority\" means:\n(1) a federally recognized Indian tribe, as defined in United States Code, title 25, section 450b, subsection (e), located within Minnesota, provided that the tribe has the authority to adopt and enforce game, fish, and natural resources codes governing the conduct of its members within the geographic boundaries of a reservation or in the 1854 or 1837 Ceded Territories; or\n(2) an Indian conservation agency having the authority to adopt or enforce game, fish, and natural resources codes and regulations governing the conduct of Indians in the 1854 or 1837 Ceded Territories.\nUpon agreement by the commissioner of natural resources, an Indian conservation enforcement authority may exercise authority under subdivision 3 if it satisfies the following minimum requirements:\n(1) the Indian conservation enforcement authority agrees to be subject to liability for its torts and those of its officers, employees, and agents acting within the scope of their employment or duties arising out of the conservation enforcement powers conferred by this section to the same extent as a municipality under chapter 466 and the Indian conservation enforcement authority further agrees, notwithstanding section 16C.05, subdivision 7, to waive its sovereign immunity for purposes of claims arising out of the liability;\n(2) the Indian conservation enforcement authority files with the Board of Peace Officer Standards and Training a bond or certificate of insurance for liability coverage with the maximum single occurrence amounts set forth in section 466.04 and an annual cap for all occurrences within a year of three times the single occurrence amounts;\n(3) the Indian conservation enforcement authority files with the Board of Peace Officer Standards and Training a certificate of insurance for liability of its conservation law enforcement officers, employees, and agents for lawsuits under the United States Constitution;\n(4) the Indian conservation enforcement authority agrees to be subject to section 13.82 and any other laws of the state relating to data practices of law enforcement agencies;\n(5) the Indian conservation enforcement authority enters into a written cooperative agreement with the commissioner of natural resources under section 471.59 to define and regulate the provision of conservation law enforcement services under this section and to provide conservation officers employed by the Department of Natural Resources with authority described in the cooperative agreement to enforce Indian codes and regulations on lands agreed upon within the reservation or ceded territory; and\n(6) the Indian conservation enforcement authority appoints a licensed peace officer to serve as a chief law enforcement officer with authority to appoint and supervise the authority's conservation officers under this section.\nWhen entering into an agreement under clause (5), the Indian conservation enforcement authority is considered a \"governmental unit\" as defined under section 471.59, subdivision 1. Nothing in this section shall be construed to invalidate or limit the terms of any valid agreement approved by a federal court order.\nIf the requirements of subdivision 2 are met:\n(1) the Indian conservation enforcement authority's chief law enforcement officer may appoint peace officers, as defined in section 626.84, subdivision 1, paragraph (c), to serve as conservation officers having the same powers as conservation officers employed by the Department of Natural Resources. The exercise of these powers is limited to the geographical boundaries of the reservation or ceded territory; and\n(2) the jurisdiction of conservation officers appointed under this subdivision is concurrent with the jurisdiction of conservation officers employed by the Department of Natural Resources to enforce the state's game and fish, natural resource, and recreational laws within the geographical boundaries of the reservation or ceded territory.\nNothing in this section shall be construed to restrict the Indian conservation enforcement authority's authority under federal law.\nThis section is limited to conservation enforcement authority only. Nothing in this section shall affect any other jurisdictional relationship or dispute or current agreement.",
	"repealed": false
}