{
	"id": "142G.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.56",
	"title": "142G.56 ASSESSMENT; EMPLOYMENT PLANS.",
	"text": "(a) For purposes of MFIP employment services, assessment is a continuing process of gathering information related to employability for the purpose of identifying both participant's strengths and strategies for coping with issues that interfere with employment. The job counselor must use information from the assessment process to develop and update the employment plan under subdivision 2 or 3, as appropriate, to determine whether the participant qualifies for a family violence waiver including an employment plan under subdivision 3, and to determine whether the participant should be referred to family stabilization services under section 142G.75.\n(b) The scope of assessment must cover at least the following areas:\n(1) basic information about the participant's ability to obtain and retain employment, including: a review of the participant's education level; interests, skills, and abilities; prior employment or work experience; transferable work skills; child care and transportation needs;\n(2) identification of personal and family circumstances that impact the participant's ability to obtain and retain employment, including: any special needs of the children, the level of English proficiency, family violence issues, and any involvement with social services or the legal system;\n(3) the results of a mental and chemical health screening tool designed by the commissioner and results of the brief screening tool for special learning needs. Screening tools for mental and chemical health and special learning needs must be approved by the commissioner and may only be administered by job counselors or county staff trained in using such screening tools. Participants must be told of the purpose of the screens and how the information will be used to assist the participant in identifying and overcoming barriers to employment. Screening for mental and chemical health and special learning needs must be completed by participants three months after development of the initial employment plan or earlier if there is a documented need. Failure to complete the screens will result in sanction under section 142G.70; and\n(4) a comprehensive review of participation and progress for participants who have received MFIP assistance and have not worked in unsubsidized employment during the past 12 months. The purpose of the review is to determine the need for additional services and supports, including placement in subsidized employment or unpaid work experience under section 142G.50, subdivision 11, or referral to family stabilization services under section 142G.75.\n(c) The job counselor may require the participant to complete a professional chemical use assessment to be performed according to the rules adopted under section 254A.03, subdivision 3, including provisions in the administrative rules which recognize the cultural background of the participant, or a professional psychological assessment as a component of the assessment process, when the job counselor has a reasonable belief, based on objective evidence, that a participant's ability to obtain and retain suitable employment is impaired by a medical condition. The job counselor may assist the participant with arranging services, including child care assistance and transportation, necessary to meet needs identified by the assessment. Data gathered as part of a professional assessment must be classified and disclosed according to the provisions in section 13.46.\n[See Note.]\n(a) Based on the assessment under subdivision 1, the job counselor and the participant must develop an employment plan that includes participation in activities and hours that meet the requirements of section 142G.51, subdivision 1. The purpose of the employment plan is to identify for each participant the most direct path to unsubsidized employment and any subsequent steps that support long-term economic stability. The employment plan should be developed using the highest level of activity appropriate for the participant. Activities must be chosen from clauses (1) to (6), which are listed in order of preference. Notwithstanding this order of preference for activities, priority must be given for activities related to a family violence waiver when developing the employment plan. The employment plan must also list the specific steps the participant will take to obtain employment, including steps necessary for the participant to progress from one level of activity to another, and a timetable for completion of each step. Levels of activity include:\n(1) unsubsidized employment;\n(2) job search;\n(3) subsidized employment or unpaid work experience;\n(4) unsubsidized employment and job readiness education or job skills training;\n(5) unsubsidized employment or unpaid work experience and activities related to a family violence waiver or preemployment needs; and\n(6) activities related to a family violence waiver or preemployment needs.\n(b) Participants who are determined to possess sufficient skills such that the participant is likely to succeed in obtaining unsubsidized employment must job search at least 30 hours per week for up to three months and accept any offer of suitable employment. The remaining hours necessary to meet the requirements of section 142G.51, subdivision 1, may be met through participation in other work activities under section 142G.50, subdivision 11. The participant's employment plan must specify, at a minimum: (1) whether the job search is on site or self-directed; (2) support services that will be provided; and (3) how frequently the participant must report to the job counselor. Participants who are unable to find suitable employment after three months must meet with the job counselor to determine whether other activities in paragraph (a) should be incorporated into the employment plan. Job search activities which are continued after three months must be structured and supervised.\n(c) Participants who are determined to have barriers to obtaining or maintaining suitable employment that will not be overcome during three months of job search under paragraph (b) must work with the job counselor to develop an employment plan that addresses those barriers by incorporating appropriate activities from paragraph (a), clauses (1) to (6). The employment plan must include enough hours to meet the participation requirements in section 142G.51, subdivision 1, unless a compelling reason to require fewer hours is noted in the participant's file.\n(d) The job counselor and the participant must sign the employment plan to indicate agreement on the contents.\n(e) Except as provided under paragraph (f), failure to develop or comply with activities in the plan, or voluntarily quitting suitable employment without good cause, will result in the imposition of a sanction under section 142G.70.\n(f) When a participant fails to meet the agreed-upon hours of participation in paid employment because the participant is not eligible for holiday pay and the participant's place of employment is closed for a holiday, the job counselor shall not impose a sanction or increase the hours of participation in any other activity, including paid employment, to offset the hours that were missed due to the holiday.\n(g) Employment plans must be reviewed at least every three months to determine whether activities and hourly requirements should be revised. The job counselor is encouraged to allow participants who are participating in at least 20 hours of work activities to also participate in education and training activities in order to meet the federal hourly participation rates.\n(a) A participant who requests and qualifies for a family violence waiver shall develop or revise the employment plan as specified in this subdivision with a job counselor or county, and a person trained in domestic violence. The revised or new employment plan must be approved by the county or the job counselor. The plan may address safety, legal, or emotional issues, and other demands on the family as a result of the family violence. Information in section 142G.55, clauses (1) to (8), must be included as part of the development of the plan.\n(b) The primary goal of an employment plan developed under this subdivision is to ensure the safety of the caregiver and children. To the extent it is consistent with ensuring safety, the plan shall also include activities that are designed to lead to economic stability. An activity is inconsistent with ensuring safety if, in the opinion of a person trained in domestic violence, the activity would endanger the safety of the participant or children. A plan under this subdivision may not automatically include a provision that requires a participant to obtain an order for protection or to attend counseling.\n(c) If at any time there is a disagreement over whether the activities in the plan are appropriate or the participant is not complying with activities in the plan under this subdivision, the participant must receive the assistance of a person trained in domestic violence to help resolve the disagreement or noncompliance with the county or job counselor. If the person trained in domestic violence recommends that the activities are still appropriate, the county or a job counselor must approve the activities in the plan or provide written reasons why activities in the plan are not approved and document how denial of the activities does not endanger the safety of the participant or children.\n(a) Self-employment activities may be included in an employment plan contingent on the development of a business plan which establishes a timetable and earning goals that will result in the participant exiting MFIP assistance. Business plans must be developed with assistance from an individual or organization with expertise in small business as approved by the job counselor.\n(b) Participants with an approved plan that includes self-employment must meet the participation requirements in section 142G.51, subdivision 1. Only hours where the participant earns at least minimum wage shall be counted toward the requirement. Additional activities and hours necessary to meet the participation requirements in section 142G.51, subdivision 1, must be included in the employment plan.\n(c) Employment plans which include self-employment activities must be reviewed every three months. Participants who fail, without good cause, to make satisfactory progress as established in the business plan must revise the employment plan to replace the self-employment with other approved work activities.\nParticipants who become eligible for MFIP assistance after completing the diversionary work program under section 142G.90 must comply with all requirements of subdivisions 1 and 2. Participants who become eligible for MFIP assistance after being determined unable to benefit from the diversionary work program must comply with the requirements of subdivisions 1 and 2, with the exception of subdivision 2, paragraph (b).\nParticipants who are laid off, quit with good cause, or are terminated from employment through no fault of their own must meet with the job counselor within ten working days to ascertain the reason for the job loss and to revise the employment plan as necessary to address the problem.",
	"repealed": false
}