{
	"id": "237.626",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.626",
	"title": "237.626 PROMOTION ACTIVITIES.",
	"text": "A telephone company or telecommunications carrier may promote the use of its services by offering a waiver of part or all of a recurring or a nonrecurring charge, a redemption coupon, or a premium with the purchase of a service. Section 237.09 does not apply to promotions under this section, but the customer group to which the promotion is available must be based on reasonable distinctions among customers. The service being promoted must have a price that is above the incremental cost of the service, including amortized cost of the promotion. A promotion may take effect the day after the notice is filed with the commission. The notice must identify customers to whom the promotion is available.\n(a) A telephone company or telecommunications carrier may offer telecommunications services subject to the regulatory jurisdiction of the commission as part of a package of services that may include goods and services other than those subject to the commission's regulatory jurisdiction. Subject to the requirements of this chapter and the associated rules and orders of the commission applicable to those regulated services, a telephone company may establish the prices, terms, and conditions of a package of services, except that:\n(1) each telecommunications service subject to the regulatory jurisdiction of the commission must be available to customers on a stand-alone basis; and\n(2) at the time the packaged offering is introduced or at the time the packaged price is subsequently changed, the packaged rate or price may not exceed the sum of the unpackaged rates or prices for the individual service elements or services.\n(b) Nothing in this subdivision is intended to extend or diminish the regulatory authority of the commission or the department.\nAny promotional offering lasting more than 90 days and filed with the commission under subdivision 1 must be available to qualifying carriers for resale. A qualifying carrier must hold a certificate of authority from the commission and must have an approved interconnection agreement with the company offering the promotion, the terms of which include language governing the resale of services.",
	"repealed": false
}