{
	"id": "331A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/331A.03",
	"title": "331A.03 WHERE NOTICE PUBLISHED.",
	"text": "Except as provided in subdivision 2, a public notice shall be published in a qualified newspaper, and except as otherwise provided by law, in one that is likely to give notice in the affected area or to whom it is directed. When a statute or other law requires publication in a newspaper located in a designated political subdivision or area and no qualified newspaper is located there, publication shall be made in a qualified newspaper likely to give notice unless the particular statute or law expressly provides otherwise. If no qualified newspaper exists, then publication is not required.\nA public notice required to be published by a statutory or home rule charter city of the fourth class located in the metropolitan area defined in section 473.121, subdivision 2, is not required to be published in a qualified newspaper if there is no qualified nondaily newspaper of general circulation in the city, provided the notice is printed in a newsletter or similar printed means of giving notice that is prepared by the city and either mailed or delivered to each household in the city.\n(a) In addition to or as an alternative to the statutory requirements for newspaper publication, a political subdivision may disseminate solicitations of bids, requests for information, and requests for proposals by a means authorized in paragraph (b), if the political subdivision simultaneously publishes, either as part of the minutes of a regular meeting of the governing body or in a separate notice published in the official newspaper, a description of all solicitations or requests so disseminated, along with the means by which the dissemination occurred.\n(b) A political subdivision may use its website or recognized industry trade journals as an alternative means of dissemination. A dissemination by alternative means must be in substantially the same format and for the same period of time as a publication required by this chapter.\n(c) For the first six months after a political subdivision designates an alternative means of dissemination, it must continue to publish solicitation of bids, requests for information, and requests for proposals in the official newspaper in addition to the alternative method. The publication in the official newspaper must indicate where to find the designated alternative method. After the expiration of the six-month period, an alternative means of dissemination satisfies the publication requirements of law for solicitation of bids, requests for information, and requests for proposals.",
	"repealed": false
}