{
	"id": "181.9445",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.9445",
	"title": "181.9445 DEFINITIONS.",
	"text": "For the purposes of section 177.50 and sections 181.9445 to 181.9448, the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of labor and industry or authorized designee or representative.\n\"Domestic abuse\" has the meaning given in section 518B.01.\n\"Earned sick and safe time\" means leave, including paid time off and other paid leave systems, that is paid at the same base rate as an employee earns from employment that may be used for the same purposes and under the same conditions as provided under section 181.9447, but in no case shall this base rate be less than that provided under section 177.24 or an applicable local minimum wage.\n\"Base rate\" means:\n(1) for employees paid on an hourly basis, the same rate received per hour of work;\n(2) for employees paid on an hourly basis who receive multiple hourly rates, the rate the employee would have been paid for the period of time in which leave was taken;\n(3) for employees paid on a salary basis, the same rate guaranteed to the employee as if the employee had not taken the leave; and\n(4) for employees paid solely on a commission, piecework, or any basis other than hourly or salary, a rate no less than the applicable local, state, or federal minimum wage, whichever is greater.\nFor purposes of this section and section 181.9446, base rate does not include commissions; shift differentials that are in addition to an hourly rate; premium payments for overtime work; premium payments for work on Saturdays, Sundays, holidays, or scheduled days off; bonuses; or gratuities as defined by section 177.23.\n\"Employee\" means any person who is employed by an employer, including temporary and part-time employees, who is anticipated by the employer to perform work for at least 80 hours in a year for that employer in Minnesota. Employee does not include:\n(1) an independent contractor;\n(2) an individual who is a volunteer firefighter or paid on-call firefighter, with a department charged with the prevention or suppression of fires within the boundaries of the state; is a volunteer ambulance attendant as defined in section 144E.001, subdivision 15; or is an ambulance service personnel as defined in section 144E.001, subdivision 3a, who serves in a paid on-call position;\n(3) an individual who is an elected official or a person who is appointed to fill a vacancy in an elected office as part of a legislative or governing body of Minnesota or a political subdivision; or\n(4) an individual employed by a farmer, family farm, or a family farm corporation to provide physical labor on or management of a farm if the farmer, family farm, or family farm corporation employs the individual to perform work for 28 days or less each year.\n\"Employer\" means a person who has one or more employees. Employer includes an individual, a corporation, a partnership, an association, a business trust, a nonprofit organization, a group of persons, the state of Minnesota, a county, town, city, school district, or other governmental subdivision. In the case of an employee leasing company or professional employer organization, the taxpaying employer, as described in section 268.046, subdivision 1, remains the employer. In the case of an individual provider within the meaning of section 256B.0711, subdivision 1, paragraph (d), the employer includes any participant within the meaning of section 256B.0711, subdivision 1, paragraph (e), or participant's representative within the meaning of section 256B.0711, subdivision 1, paragraph (f). In the event that a temporary employee is supplied by a staffing agency, absent a contractual agreement stating otherwise, that individual shall be an employee of the staffing agency for all purposes of section 177.50 and sections 181.9445 to 181.9448. Employer does not include the United States government.\n\"Family member\" means:\n(1) an employee's:\n(i) child, foster child, adult child, legal ward, child for whom the employee is legal guardian, or child to whom the employee stands or stood in loco parentis;\n(ii) spouse or registered domestic partner;\n(iii) sibling, stepsibling, or foster sibling;\n(iv) biological, adoptive, or foster parent, stepparent, or a person who stood in loco parentis when the employee was a minor child;\n(v) grandchild, foster grandchild, or stepgrandchild;\n(vi) grandparent or stepgrandparent;\n(vii) a child of a sibling of the employee;\n(viii) a sibling of the parents of the employee; or\n(ix) a child-in-law or sibling-in-law;\n(2) any of the family members listed in clause (1) of a spouse or registered domestic partner;\n(3) any other individual related by blood or whose close association with the employee is the equivalent of a family relationship; and\n(4) up to one individual annually designated by the employee.\n\"Health care professional\" means any person licensed, certified, or otherwise authorized under federal or state law to provide medical or emergency services, including doctors, physician assistants, nurses, advanced practice registered nurses, mental health professionals, and emergency room personnel.\n\"Sexual assault\" means an act that constitutes a violation under sections 609.342 to 609.3453 or 609.352.\n\"Stalking\" has the meaning given in section 609.749.\n\"Year\" means a regular and consecutive 12-month period, as determined by an employer and clearly communicated to each employee of that employer.",
	"repealed": false
}