{
	"id": "190.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.025",
	"title": "190.025 FRESH PURSUIT.",
	"text": "In case the United States is at war or in case of any other emergency declared by the president or the Congress of the United States or by the governor or the legislature of this state, any organization, unit, or detachment of the military forces of this state, by direction of the governor and upon order of the officer in immediate command thereof, may continue in fresh pursuit of insurrectionists, saboteurs, enemies, or enemy forces beyond the borders of this state into another state until they are apprehended or captured by such organization, unit, or detachment, or until the military or police forces of such other state or the forces of the United States have had a reasonable opportunity to take up the pursuit or to apprehend or capture the persons pursued, provided such other state shall have given authority by law for such pursuit by such forces of this state. Except as otherwise provided by law, any person who shall be apprehended or captured in another state by any of the forces of this state shall without unnecessary delay be surrendered to the military or police forces of the state in which the person is taken or to the United States, but such surrender shall not constitute a waiver by this state of its right to extradite or prosecute such person for any crime committed in this state.\nAny military forces of another state who are in fresh pursuit of insurrectionists, saboteurs, enemies, or enemy forces may continue such pursuit into this state until the military or police forces of this state or the forces of the United States have had a reasonable opportunity to take up the pursuit or to apprehend or capture the persons pursued, and the pursuing forces may arrest or capture such persons within this state while in fresh pursuit. Any such person who shall be captured or arrested by the military forces of such other state while in this state shall without unnecessary delay be surrendered to the military or police forces of this state to be dealt with according to law.\nThis section shall not be construed so as to make unlawful any arrest in this state which would otherwise be lawful, nor to repeal or prevent the application of any of the provisions of section 626.65, the Uniform Act on the Fresh Pursuit of Criminals.",
	"repealed": false
}