{
	"id": "144G.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.54",
	"title": "144G.54 APPEALS OF CONTRACT TERMINATIONS.",
	"text": "Residents have the right to appeal the termination of an assisted living contract.\nA resident may appeal a termination initiated under section 144G.52, subdivision 3, 4, or 5, on the ground that:\n(1) there is a factual dispute as to whether the facility had a permissible basis to initiate the termination;\n(2) the termination would result in great harm or the potential for great harm to the resident as determined by the totality of the circumstances, except in circumstances where there is a greater risk of harm to other residents or staff at the facility;\n(3) the resident has cured or demonstrated the ability to cure the reasons for the termination, or has identified a reasonable accommodation or modification, intervention, or alternative to the termination; or\n(4) the facility has terminated the contract in violation of state or federal law.\n(a) The Office of Administrative Hearings must conduct an expedited hearing as soon as practicable under this section, but in no event later than 14 calendar days after the office receives the request, unless the parties agree otherwise or the chief administrative law judge deems the timing to be unreasonable, given the complexity of the issues presented.\n(b) The hearing must be held at the facility where the resident lives, unless holding the hearing at that location is impractical, the parties agree to hold the hearing at a different location, or the chief administrative law judge grants a party's request to appear at another location or by telephone or interactive video.\n(c) The hearing is not a formal contested case proceeding, except when determined necessary by the chief administrative law judge.\n(d) Parties may but are not required to be represented by counsel. The appearance of a party without counsel does not constitute the unauthorized practice of law.\n(e) The hearing shall be limited to the amount of time necessary for the participants to expeditiously present the facts about the proposed termination. The administrative law judge shall issue a recommendation to the commissioner as soon as practicable, but in no event later than ten business days after the hearing.\n(a) The facility bears the burden of proof to establish by a preponderance of the evidence that the termination was permissible if the appeal is brought on the ground listed in subdivision 2, clause (1) or (4).\n(b) The resident bears the burden of proof to establish by a preponderance of the evidence that the termination was not permissible if the appeal is brought on the ground listed in subdivision 2, clause (2) or (3).\n(a) The resident's termination must be rescinded if the resident prevails in the appeal.\n(b) The order may contain any conditions that may be placed on the resident's continued residency or receipt of services, including but not limited to changes to the service plan or a required increase in services.\nA termination of housing or services shall not occur while an appeal is pending. If additional services are needed to meet the health or safety needs of the resident while an appeal is pending, the resident is responsible for contracting for those additional services from the facility or another provider and for ensuring the costs for those additional services are covered.\nA resident may not bring an action under chapter 504B to challenge a termination that has occurred and been upheld under this section.",
	"repealed": false
}