{
	"id": "394.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.25",
	"title": "394.25 FORMS OF CONTROL.",
	"text": "Official controls shall be adopted by ordinance and may include but are not limited to the features set forth in this section.\nZoning ordinances establishing districts within which the use of land or the use of water or the surface of water pursuant to section 86B.205 for agriculture, forestry, recreation, residence, industry, trade, soil conservation, water supply conservation, surface water drainage and removal, conservation of shorelands, as defined in sections 103F.201 to 103F.221, and additional uses of land and of the surface of water pursuant to section 86B.205, may be by official controls encouraged, regulated, or prohibited and for such purpose the board may divide the county into districts of such number, shape, and area as may be deemed best suited to carry out the comprehensive plan. Official controls may also be applied to wetlands preservation, open space, parks, sewage disposal, protection of groundwater, protection of floodplains as defined in section 103F.111, protection of wild, scenic, or recreational rivers as defined in sections 103F.311 and 103F.315, protection of slope, soils, unconsolidated materials or bedrock from potentially damaging development, preservation of forests, woodlands and essential wildlife habitat, reclamation of nonmetallic mining lands; protection and encouragement of access to direct sunlight for solar energy systems as defined in section 216C.06, subdivision 17; and the preservation of agricultural lands. Official controls may include provisions for purchase of development rights by the board in the form of conservation easements under chapter 84C in areas where preservation is considered by the board to be desirable, and the transfer of development rights from those areas to areas the board considers more desirable for development.\nWithin each such district zoning ordinances or maps may also be adopted designating or limiting the location, height, width, bulk, type of foundation, number of stories, size of, and the specific uses for which dwellings, buildings, and structures may be erected or altered; the minimum and maximum size of yards, courts, or other open spaces; setback from existing roads and highways and roads and highways designated on an official map; protective measures necessary to protect the public interest including but not limited to controls relating to appearance, signs, lighting, hours of operation and other aesthetic performance characteristics including but not limited to noise, heat, glare, vibrations and smoke; the area required to provide for off street loading and parking facilities; heights of trees and structures near airports; and to avoid too great concentration or scattering of the population. All such provisions shall be uniform for each class of land or building throughout each district, but the provisions in one district may differ from those in other districts. No provision may prohibit earth sheltered construction as defined in section 216C.06, subdivision 14, or manufactured homes built in conformance with sections 327.31 to 327.35 that comply with all other zoning ordinances promulgated pursuant to this section. Airport safety zones must be included on maps that illustrate boundaries of zoning districts and that are adopted as official controls.\nA county must not enact, amend, or enforce a zoning ordinance that has the effect of altering the existing density, lot-size requirements, or manufactured home setback requirements in any manufactured home park constructed before January 1, 1995, if the manufactured home park, when constructed, complied with the then existing density, lot-size and setback requirements.\nA manufactured home park, as defined in section 327.14, subdivision 3, is a conditional use in a zoning district that allows the construction or placement of a building used or intended to be used by two or more families.\n(a) A county proposing to adopt a new feedlot ordinance or amend an existing feedlot ordinance must notify the Pollution Control Agency and commissioner of agriculture at the beginning of the process, no later than the notice of the first hearing proposing to adopt or amend an ordinance purporting to address feedlots.\n(b) Prior to final approval of a feedlot ordinance, a county board may submit a copy of the proposed ordinance to the Pollution Control Agency and to the commissioner of agriculture and request review, comment, and recommendations on the environmental and agricultural effects from specific provisions in the ordinance.\n(c) The agencies' response to the county may include:\n(1) any recommendations for improvements in the ordinance; and\n(2) the legal, social, economic, or scientific justification for each recommendation under clause (1).\n(d) At the request of the county board, the county must prepare a report on the economic effects from specific provisions in the ordinance. Economic analysis must state whether the ordinance will affect the local economy and describe the kinds of businesses affected and the projected impact the proposal will have on those businesses. To assist the county, the commissioner of agriculture, in cooperation with the Department of Employment and Economic Development, must develop a template for measuring local economic effects and make it available to the county. The report must be submitted to the commissioners of employment and economic development and agriculture along with the proposed ordinance.\n(e) A local ordinance that contains a setback for new feedlots from existing residences must also provide for a new residence setback from existing feedlots located in areas zoned agricultural at the same distances and conditions specified in the setback for new feedlots, unless the new residence is built to replace an existing residence. A county may grant a variance from this requirement under section 394.27, subdivision 7.\nOfficial maps as defined in section 394.22, subdivision 12.\nMS 1971 [Repealed, 1974 c 571 s 51]\nIn counties in the metropolitan area as defined in section 473.121, official maps may for a period of up to five years designate the boundaries of areas reserved for purposes of soil conservation, water supply conservation, flood control, and surface water drainage and removal.\nMS 1971 [Repealed, 1974 c 571 s 51]\n(a) Specific controls pertaining to other subjects incorporated in the comprehensive plan or establishing standards and procedures to be employed in land development including, but not limited to, subdividing of land and the approval of land plats and the preservation and dedication of streets and land for other public purposes and the general design of physical improvement.\n(b) A county must approve a preliminary plat that meets the applicable standards and criteria contained in the county's zoning and subdivision regulations unless the county adopts written findings based on a record from the public proceedings why the application shall not be approved.\n(c) The controls may require that a portion of any proposed subdivision be dedicated to the public or preserved for public use as parks, recreational facilities, playgrounds, trails, wetlands, or open space. The requirement must be imposed by ordinance.\n(d) If a county adopts the ordinance required by paragraph (c), the county must adopt a capital improvement program and adopt a parks and open space plan or have a parks, trails, and open space component in its comprehensive plan subject to the terms and conditions in this paragraph and in paragraphs (e) through (p).\n(e) The county may choose to accept a per lot cash fee as set by ordinance from the applicant for some or all of the new lots created in the subdivision.\n(f) In establishing the portion to be dedicated or preserved or the per lot cash fee, the controls must consider the open space, park, recreational, or common areas and facilities that the applicant proposes to reserve for the subdivision.\n(g) The county must reasonably determine that it will need to acquire that portion of land for the purposes stated in this subdivision as a result of approval of the subdivision.\n(h) The fees or dedication must be fair, reasonable, and proportionate to the need created.\n(i) Any cash payments received must be placed by the county in a special fund to be used only for the purposes for which the money was obtained.\n(j) Any cash payments received must be used only for the acquisition and development or improvement of parks, recreational facilities, playgrounds, trails, wetlands, or open space. Cash payments must not be used for ongoing operation, maintenance, or redevelopment of parks, recreational facilities, playgrounds, trails, wetlands, or open space.\n(k) The county must not deny the approval of a subdivision based on an inadequate supply of parks, open spaces, trails, or recreational areas within the county.\n(l) The county must not condition the approval of any proposed subdivision or development on an agreement to waive the right to challenge the validity of a fee or dedication.\n(m) The county must use at least 75 percent of the funds collected under this subdivision according to the plan required in paragraph (d) in the township or city where the collection of funds occurs. However, the township board or city council may agree to allow the county to use these funds outside of the township or city in a manner consistent with the county parks, trails, and open space capital improvement plan or the county parks and open space component in its comprehensive plan. The remainder of the funds may be used by the county only for parks and trails connectivity and accessibility purposes. The county must annually report to cities and townships on where funds were collected and where funds were expended in the past year.\n(n) Previously subdivided property from which a park dedication has been received, being resubdivided with the same number of lots, is exempt from park dedication requirements. If, as a result of resubdividing the property, the number of lots is increased, then the park dedication or per lot cash fee must apply only to the net increase of lots.\n(o) A county must not require a dedication of a portion of a proposed subdivision or a payment in lieu of dedication in a town or city that has adopted a requirement to dedicate or a payment in place of dedication as a provision of the town or city's subdivision regulations under section 462.358, subdivision 2b, or chapter 366.\n(p) A county may negotiate an agreement with a town or city to share the revenue generated by dedicating a portion of a proposed subdivision or a payment in place of dedication.\nAny statute of Minnesota, any administrative rule of any department of the state of Minnesota affecting the county, or any code, adopted by reference as part of the official control. The term \"code\" as used herein means any compilation of rules or standards or part thereof prepared by any governmental agency or any trade or professional association for general distribution in printed form as a standard or model on the subject of building construction, plumbing, electric wiring, inflammable liquids, sanitary provisions, public health, safety, or welfare. Prior to adoption at least one copy of the statute, rule, ordinance or code shall be marked as official copies and filed for use and examination by the public in the office of the county auditor. Provisions of the statute, rule, ordinance, or code thus incorporated in such ordinance by reference shall be as much a part of the ordinance as if they had been set out in full therein.\nErosion and sediment controls with regard to clearing, grading, excavation, transporting and filling of lands. Erosion and sediment controls may include, but need not be limited to requiring the development of plans before any land is disturbed. Plans for disturbing land may be submitted to the appropriate soil and water conservation district for comment and review.\nAn amendment to official controls may be initiated by the board, the planning commission, or by petition of affected property owners as defined in the official controls. An amendment not initiated by the planning commission shall be referred to the planning commission, if there is one, for study and report and may not be acted upon by the board until it has received the recommendation of the planning commission.",
	"repealed": false
}