{
	"id": "136A.646",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.646",
	"title": "136A.646 ADDITIONAL SECURITY.",
	"text": "(a) New institutions that have been granted conditional approval for degrees or names to allow them the opportunity to apply for and receive accreditation under section 136A.65, subdivision 7, shall provide a surety bond in a sum equal to ten percent of the net revenue from tuition and fees in the registered institution's prior fiscal year, but in no case shall the bond be less than $10,000.\n(b) Any registered institution that is notified by the United States Department of Education that it has fallen below minimum financial standards and that its continued participation in Title IV will be conditioned upon its satisfying an alternative standard set forth in Code of Federal Regulations, title 34, section 668.175, shall provide a surety bond in a sum equal to the \"letter of credit\" required by the United States Department of Education in the Letter of Credit Alternative, but in no event shall such bond be less than $10,000 nor more than $250,000. If the letter of credit required by the United States Department of Education is higher than ten percent of the Title IV, Higher Education Act program funds received by the institution during its most recently completed fiscal year, the office shall reduce the office's surety requirement to represent ten percent of the Title IV, Higher Education Act program funds received by the institution during its most recently completed fiscal year, subject to the minimum and maximum in this paragraph.\n(c) In lieu of a bond, the applicant may deposit with the commissioner of management and budget:\n(1) a sum equal to the amount of the required surety bond in cash;\n(2) securities, as may be legally purchased by savings banks or for trust funds, in an aggregate market value equal to the amount of the required surety bond; or\n(3) an irrevocable letter of credit issued by a financial institution to the amount of the required surety bond.\n(d) The surety of any bond may cancel it upon giving 60 days' notice in writing to the office and shall be relieved of liability for any breach of condition occurring after the effective date of cancellation.\n(e) In the event of a school closure, the additional security must first be used to destroy any private educational data under section 13.32 left at a physical campus in Minnesota after all other governmental agencies have recovered or retrieved records under their record retention policies. Any remaining funds must then be used to reimburse tuition and fee costs to students that were enrolled at the time of the closure or had withdrawn in the previous 180 calendar days but did not graduate. Priority for refunds will be given to students in the following order:\n(1) cash payments made by the student or on behalf of a student;\n(2) private student loans; and\n(3) Veteran Administration education benefits that are not restored by the Veteran Administration. If there are additional security funds remaining, the additional security funds may be used to cover any administrative costs incurred by the office related to the closure of the school.",
	"repealed": false
}