{
	"id": "14.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.46",
	"title": "14.46 PUBLICATION IN STATE REGISTER.",
	"text": "The commissioner of administration shall publish a State Register containing all notices for hearings concerning rules, giving time, place and purpose of the hearing and the full text of the action being proposed. Further, the register shall contain all rules, amendments, suspensions, or repeals thereof, pursuant to the provisions of this chapter. The commissioner shall further publish any executive order issued by the governor which shall become effective 15 days after publication except as provided in section 4.035, subdivision 2. The commissioner shall further publish any official notices in the register which a state agency requests to be published. Such notices shall include, but shall not be limited to, the date on which a new agency becomes operational, the assumption of a new function by an existing state agency, or the appointment of commissioners. The commissioner may prescribe the form, excluding the form of the rules, and manner in which agencies submit any material for publication in the State Register and may withhold publication of any material not submitted according to the form or procedures prescribed.\nThe commissioner of administration may organize and distribute the contents of the register according to such categories as will provide economic publication and distribution and will offer easy access to information by any interested party.\nThe commissioner of administration shall publish the State Register whenever necessary, except that no material properly submitted for publication shall remain unpublished for more than ten working days.\nThe State Register shall have a distinct and permanent masthead with the title \"State Register\" and the words \"state of Minnesota\" prominently displayed. All issues of the State Register shall be numbered and dated.\nTo the extent that editing, composition, printing, distribution or other work on the State Register cannot be performed in the Department of Administration, or it is uneconomical to do so, the commissioner shall obtain competitive bids and enter into contracts to have the services performed by the lowest responsible bidder. The duration of any contracts shall not exceed the end of the state's fiscal biennium.\nAny state agency which desires to publish a notice of hearing, rule or change thereof shall submit a copy of the entire document, including dates when adopted, and filed with the secretary of state, to the commissioner of administration in addition to any other copies which may be required to be filed with the commissioner by other law.\nThe revisor of statutes shall provide assistance to the commissioner if requested. Alternatively, the commissioner may designate a contract compositor to whom the assistance is to be supplied. The assistance, in either case, shall consist of furnishing a readable digital file, or similar services, for rules which are available in the revisor's computer database and for which a written copy has been submitted by an agency to the commissioner for publication in the State Register.\nWhen an agency properly submits a rule, proposed rule, notice, or other material to the commissioner of administration, the commissioner must then be accountable for the publication of the same in the State Register. The commissioner of administration must require each agency which requests the publication of rules, proposed rules, notices, or other material in the State Register to pay its proportionate cost of the State Register unless other funds are provided and are sufficient to cover the cost of the State Register.\nThe State Register must be offered for public sale at a location centrally located as determined by the commissioner of administration and at a price as the commissioner of administration determines. The commissioner of administration must further provide for the mailing of the State Register to any person, agency, or organization if so requested, provided that reasonable costs are borne by the requesting party. The supply and expense appropriation to any state agency is deemed to include funds to purchase the State Register. One copy of each issue of the State Register, however, must be provided without cost to the Legislative Reference Library and one copy to the State Law Library.\nThe commissioner must make an electronic version of the State Register available on the Internet free of charge through the State of Minnesota main website.\nA State Register publication account is created in the state treasury. All receipts from the sale of the State Register shall be deposited in the account. All funds in the State Register publication account in the state treasury are appropriated annually to the commissioner of administration to carry out the provisions of subdivisions 1 to 4.",
	"repealed": false
}