{
	"id": "144.413",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.413",
	"title": "144.413 DEFINITIONS.",
	"text": "As used in sections 144.411 to 144.417, the terms defined in this section have the meanings given them.\n\"Indoor area\" means all space between a floor and a ceiling that is bounded by walls, doorways, or windows, whether open or closed, covering more than 50 percent of the combined surface area of the vertical planes constituting the perimeter of the area. A wall includes any retractable divider, garage door, or other physical barrier, whether temporary or permanent. A 0.011 gauge window screen with an 18 by 16 mesh count is not a wall.\n\"Place of employment\" means any indoor area at which two or more individuals perform any type of a service for consideration of payment under any type of contractual relationship, including, but not limited to, an employment relationship with or for a private corporation, partnership, individual, or government agency. Place of employment includes any indoor area where two or more individuals gratuitously perform services for which individuals are ordinarily paid. A place of employment includes, but is not limited to, public conveyances, factories, warehouses, offices, retail stores, restaurants, bars, banquet facilities, theaters, food stores, banks, financial institutions, employee cafeterias, lounges, auditoriums, gymnasiums, restrooms, elevators, hallways, museums, libraries, bowling establishments, employee medical facilities, and rooms or areas containing photocopying equipment or other office equipment used in common. Vehicles used in whole or in part for work purposes are places of employment during hours of operation if more than one person is present. An area in which work is performed in a private residence is a place of employment during hours of operation if:\n(1) the homeowner uses the area exclusively and regularly as a principal place of business and has one or more on-site employees; or\n(2) the homeowner uses the area exclusively and regularly as a place to meet or deal with patients, clients, or customers in the normal course of the homeowner's trade or business.\n\"Public place\" means any enclosed, indoor area used by the general public, including, but not limited to, restaurants; bars; any other food or liquor establishment; retail stores and other commercial establishments; educational facilities other than public schools, as defined in section 120A.05, subdivisions 9, 11, and 13; hospitals; nursing homes; auditoriums; arenas; meeting rooms; and common areas of rental apartment buildings.\n\"Public meeting\" includes all meetings open to the public pursuant to section 13D.01.\n\"Smoking\" means inhaling, exhaling, burning, or carrying any lighted or heated cigar, cigarette, pipe, or any other lighted or heated product containing, made, or derived from nicotine, tobacco, marijuana, or other plant, whether natural or synthetic, that is intended for inhalation. Smoking includes carrying or using an activated electronic delivery device, as defined in section 609.685.\n\"Public transportation\" means public means of transportation, including light and commuter rail transit; buses; enclosed bus and transit stops; taxis, vans, limousines, and other for-hire vehicles other than those being operated by the lessee; and ticketing, boarding, and waiting areas in public transportation terminals.",
	"repealed": false
}