{
	"id": "171.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.24",
	"title": "171.24 VIOLATIONS; DRIVING WITHOUT VALID LICENSE.",
	"text": "Except as otherwise provided in subdivision 5, a person is guilty of a misdemeanor if:\n(1) the person's driver's license or driving privilege has been suspended;\n(2) the person has been given notice of or reasonably should know of the suspension; and\n(3) the person disobeys the order by operating in this state any motor vehicle, the operation of which requires a driver's license, while the person's license or privilege is suspended.\nA person is guilty of a misdemeanor if:\n(1) the person's driver's license or driving privilege has been revoked;\n(2) the person has been given notice of or reasonably should know of the revocation; and\n(3) the person disobeys the order by operating in this state any motor vehicle, the operation of which requires a driver's license, while the person's license or privilege is revoked.\nA person is guilty of a misdemeanor if:\n(1) the person's driver's license or driving privilege has been canceled;\n(2) the person has been given notice of or reasonably should know of the cancellation; and\n(3) the person disobeys the order by operating in this state any motor vehicle, the operation of which requires a driver's license, while the person's license or privilege is canceled.\nA person is guilty of a misdemeanor if the person:\n(1) has been disqualified from holding a commercial driver's license or been denied the privilege to operate a commercial motor vehicle;\n(2) has been given notice of or reasonably should know of the disqualification; and\n(3) disobeys the order by operating in this state a commercial motor vehicle while the person is disqualified to hold the license or privilege.\nA person is guilty of a gross misdemeanor if:\n(1) the person's driver's license or driving privilege has been canceled or denied under section 171.04, subdivision 1, clause (10);\n(2) the person has been given notice of or reasonably should know of the cancellation or denial; and\n(3) the person disobeys the order by operating in this state any motor vehicle, the operation of which requires a driver's license, while the person's license or privilege is canceled or denied.\nThe attorney in the jurisdiction in which the violation occurred who is responsible for prosecution of misdemeanor violations of this section is also responsible for prosecution of gross misdemeanor violations of this section.\n(a) Notice of revocation, suspension, cancellation, or disqualification is sufficient if personally served, or if mailed by first class mail to the person's last known address or to the address listed on the person's driver's license. Notice is also sufficient if the person was informed that revocation, suspension, cancellation, or disqualification would be imposed upon a condition occurring or failing to occur, and where the condition has in fact occurred or failed to occur.\n(b) It is not a defense that a person failed to file a change of address with the post office, or failed to notify the Department of Public Safety of a change of name or address as required under section 171.11.",
	"repealed": false
}