{
	"id": "62H.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/62H.18",
	"title": "62H.18 AGRICULTURAL COOPERATIVE HEALTH PLAN.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Agricultural cooperative\" means a cooperative organized under chapter 308A or 308B that meets the requirements of subdivision 2.\n(c) \"Broker\" means an insurance agent engaged in brokerage business according to section 60K.49.\n(d) \"Employee Retirement Income Security Act\" means the Employee Retirement Income Security Act of 1974, United States Code, title 29, sections 1001, et seq.\n(e) \"Enrollee\" means a natural person covered by a joint self-insurance plan operating under this section.\n(f) \"Insurance agent\" has the meaning given to insurance agent in section 60A.02, subdivision 7.\n(g) \"Joint self-insurance plan\" or \"plan\" means a plan or any other arrangement established for the benefit of two or more entities authorized to transact business in the state, in order to jointly self-insure through a single employee welfare benefit plan funded through a trust, to provide health, dental, or other benefits as permitted under the Employee Retirement Income Security Act.\n(h) \"Service plan administrator\" means a vendor of risk management services licensed under section 60A.23.\n(i) \"Trust\" means a trust established to accept and hold assets of the joint self-insurance plan in trust and use and disperse funds in accordance with the terms of the written trust document and joint self-insurance plan for the sole purposes of providing benefits and defraying reasonable administrative costs of providing the benefits.\nA joint self-insurance plan, its service plan administrator, stop loss carrier, and any broker assisting the agricultural cooperative are exempt from sections 62H.01 to 62H.17, and are governed by the requirements of this section, if the joint self-insurance plan is administrated through a trust established by an agricultural cooperative that:\n(1) has members who (i) actively work in production agriculture in Minnesota and file either Form 1065 or Schedule F with the member's income tax return; or (ii) provide direct services to production agriculture in Minnesota;\n(2) specifies criteria for membership in the agricultural cooperative in their articles of organization or bylaws, however criteria cannot be based on health status factors of the individuals to be covered through the joint self-insurance plan; and\n(3) grants at least 51 percent of the aggregate voting power on matters for which all members may vote to members who satisfy clause (1) and any additional criteria in the agricultural cooperative's articles of organization and bylaws.\nA joint self-insurance plan operating under this section must:\n(1) offer health coverage to members of the agricultural cooperative that establishes the plan and their dependents, to employees of members of the agricultural cooperative that establishes the plan and their dependents, or to employees of the agricultural cooperative that establishes the plan and their dependents. Health coverage may be offered only to those individuals who meet certain criteria described in the joint self-insurance plan governing documents, however the criteria cannot be based on health status factors of the individuals to be covered through the joint self-insurance plan;\n(2) include stop-loss coverage with an individual attachment point not lower than $20,000 and an aggregate attachment point not lower than 110 percent of expected claims, issued by an insurance company licensed in Minnesota;\n(3) establish a reserve fund, certified by an actuary to be sufficient to cover unpaid claim liability for incurred but not reported liabilities in the event of plan termination. Certification from the actuary must include all maximum funding requirements for plan fixed cost requirements and current claims liability requirements, and must include a calculation of the reserve levels needed to fund all incurred but not reported liabilities in the event of member or plan termination. These reserve funds must be held in a trust;\n(4) be governed by a board elected by agricultural cooperative members that participate in the plan;\n(5) contract for services with a service plan administrator; and\n(6) satisfy the requirements of the Employee Retirement Income Security Act that apply to employee welfare benefit plans.\nA joint self-insurance plan operating under this section must submit to the commissioner of commerce copies of all filings and reports that are submitted to the United States Department of Labor according to the Employee Retirement Income Security Act. Members participating in the joint self-insurance plan may designate an agricultural cooperative that establishes the plan as the entity responsible for satisfying the reporting requirements of the Employee Retirement Income Security Act and for providing copies of these filings and reports to the commissioner of commerce.\nIf a member chooses to participate in a joint self-insurance plan under this section, the member must participate in the plan for at least three consecutive years. If a member terminates participation in the plan before the end of the three-year period, a financial penalty may be assessed under the plan, not to exceed the amount contributed by the member to the plan reserves.\nThe enrollees of a joint self-insurance plan operating under this section shall be members of a single risk pool. The plan shall provide benefits as a single, self-insured plan with the size of the plan based on the total enrollees in the risk pool.\n(a) Coverage in a joint self-insurance plan operating under this section may be promoted, marketed, and sold by insurance agents and brokers to members of the agricultural cooperative sponsoring the plan and their dependents, employees of members of the agricultural cooperative sponsoring the plan and their dependents, and employees of the agricultural cooperative sponsoring the plan and their dependents.\n(b) Coverage in a joint self-insurance plan operating under this section may be promoted and marketed by a cooperative organized under chapter 308A or 308B to persons who may be eligible to participate in the joint self-insurance plan.\nJoint self-insurance plans are exempt from the taxation imposed under section 297I.05, subdivision 12.\nA joint self-insurance plan operating under this section:\n(1) is exempt from providing the mandated health benefits in chapters 62A and 62Q, if the plan otherwise provides the benefits required under the Employee Retirement Income Security Act;\n(2) is exempt from the continuation requirements in sections 62A.146, 62A.16, 62A.17, 62A.20, and 62A.21, if the plan complies with the continuation requirements under the Employee Retirement Income Security Act; and\n(3) must comply with all requirements of the Affordable Care Act, as defined in section 62A.011, subdivision 1a, to the extent that they apply to such plans.",
	"repealed": false
}