{
	"id": "412.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.093",
	"title": "412.093 DISSOLUTION SECURED BY CLAIMANTS.",
	"text": "Whenever a duly incorporated city has, for two consecutive years, failed to hold city elections as provided by law and one or more bonds or claims against the city remain unpaid, any bondholder or claimant may proceed to secure dissolution of the city and payment of the bonds and claims in accordance with this section.\nSuch claimant may apply to the sheriff of the county in which the city lies for a certificate directed to the district court stating that the sheriff has been unable to find more than two members of the city council residing within the city. On finding that the facts so warrant, the sheriff shall execute such a certificate and deliver it to the claimant.\nWithin 30 days after receiving the sheriff's certificate, the claimant may petition the district court for a formal dissolution of the city and the liquidation of its affairs, attaching the certificate to the petition. The court shall thereupon issue an ex parte order providing for a hearing on the dissolution of the city and the liquidation of the affairs of the city, and limiting the time within which bonds and claims against the city shall be filed with the court. The court shall order such published notice to be given of the hearing and of the time when bonds and claims must be filed, and shall provide for such other notice to parties interested as it may deem proper.\nAt the time and place specified, the court shall hear the evidence of all parties interested and consider the validity of bonds and claims against the city filed within the time specified in the court order. If it determines that the city has ceased to function and it is not in the public interest for the city to continue in existence, it shall order the city dissolved on the day fixed in the order. At the same time, or at a subsequent time fixed by the court, it shall examine, adjust and allow, in whole or in part, all bonds and claims filed within the time prescribed, and shall appoint the county auditor of the county in which the former city was situated as receiver to make the necessary tax levies, pay the bonds and claims allowed by the court, collect any debts owing to the city, and generally to liquidate the affairs of the city. A copy of the court's order shall be sent to the county auditor.\nThe court shall provide for the spreading of a tax levy on all the taxable property within the former city over such period of years, not exceeding 30, as the court directs, taking into account the amount of the bonds and claims and the total taxable net tax capacity of the property to be taxed.\nThe county auditor shall spread a levy against the property in the former city in accordance with the order of the court. The county treasurer shall deposit the proceeds of such tax, when collected, in a special account in the county treasury. After paying the cost of the dissolution proceedings, the county auditor shall apply the proceeds of the tax after each tax apportionment to the payment of principal and interest of outstanding bonds of the city until all such bonds and interest thereon shall have been paid in full. Thereafter the county auditor shall apply the proceeds of the tax after each tax apportionment to the various other creditors in proportion to their several claims until all have been discharged, but interest on any such claim shall be allowed and paid only from the date of the court order allowing such claim.\nAll city property and all rights of the city shall upon dissolution inure in the town as the legal successor to the city. If the city lies in more than one town, surplus cash assets shall be distributed to the respective towns in proportion to the net tax capacity of that portion of the city lying in each; and the court shall determine the disposition of other unsold city property in such cases.",
	"repealed": false
}