{
	"id": "126C.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.19",
	"title": "126C.19 SHARED TIME AID.",
	"text": "Aid for shared time pupils must be paid to the district of the pupil's residence. If a pupil attends shared time classes in another district, the resident district must pay to the district of attendance an amount of tuition equal to the ratio in section 126C.01, subdivision 6, times the amount of tuition that would be charged and paid for a nonresident public school pupil in a similar circumstance. The district of residence is not obligated for tuition except by previous agreement.\nNotwithstanding subdivision 1, the resident district of a shared time pupil attending shared time classes in another district or a charter school must grant the district or charter school of attendance, upon its request, permission to claim the pupil as a resident for state aid purposes. In this case, state aid must be paid to the district or charter school of attendance. If the resident district agrees, the district of attendance may bill the resident district for any unreimbursed education costs, but not for unreimbursed transportation costs. The resident district and the district or charter school of attendance may negotiate an agreement for the resident district to pay the cost of any of the particular transportation categories specified in section 123B.92, subdivision 1, and in this case, aid for those categories must be paid to the district of residence rather than to the district of attendance.\nMinutes of enrollment in a public school during which a nonpublic school pupil receives services pursuant to section 123B.44 must not be used in the computation of shared time aid.\n(a) Public school programs that provide instruction in core curriculum may be provided to shared time pupils only at a public school building. Public school programs, excluding programs that provide instruction in core curriculum, may be provided to shared time pupils at a public school building, a neutral site, the nonpublic school, or any other suitable location. Guidance and counseling and diagnostic and health services required under sections 125A.03 to 125A.24 and 125A.65 may be provided at a nonpublic school building. As used in this subdivision, \"diagnostic services\" means speech, hearing, vision, psychological, medical and dental diagnostic services and \"health services\" means physician, nursing or optometric services provided to pupils in the field of physical and mental health.\n(b) For those children with a disability under sections 125A.03 to 125A.24 who attend nonpublic school at their parent's choice, a school district may provide special instruction and services at the nonpublic school building, a public school, or at a neutral site other than a nonpublic school as defined in section 123B.41, subdivision 13. The school district shall determine the location at which to provide services on a student-by-student basis, consistent with federal law.",
	"repealed": false
}