{
	"id": "352.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.87",
	"title": "352.87 STATE FIRE MARSHAL DIVISION EMPLOYEES.",
	"text": "A member of the general plan who is employed by the Department of Public Safety, State Fire Marshal Division, as a deputy state fire marshal, fire/arson investigator, who elects special benefit coverage under subdivision 8, is entitled to retirement benefits or disability benefits, as applicable, as stated in this section for eligible service under this section rendered after July 1, 1999, for which allowable service credit is received. The covered member must be at least age 55 to qualify for the retirement annuity specified in subdivision 3.\nA person specified in subdivision 1 who meets all eligibility requirements specified in this chapter applicable to general plan members is eligible for retirement benefits as specified in subdivision 3.\nA person specified in subdivision 1 is entitled to receive a retirement annuity applicable for allowable service credit under this section calculated by multiplying the employee's average salary, as defined in section 352.01, subdivision 14a, by 2.0 percent for each year or portions of a year of allowable service credit. No reduction for retirement before the normal retirement age, as specified in section 352.01, subdivision 25, applies to service to which this section applies.\nAn eligible member described in subdivision 1 who becomes disabled and physically or mentally unfit to perform the duties of the position because of sickness or injury while not engaged in covered employment is entitled to a disability benefit amount equivalent to an annuity computed under subdivision 3 assuming the member has 15 years of service qualifying under this section and waiving the minimum age requirement. If the eligible member becomes disabled under this subdivision with more than 15 years of service covered under this section, the eligible member is entitled to a disability benefit amount equivalent to an annuity computed under subdivision 3 based on all years of service credited under this section and waiving the minimum age requirement.\nAn eligible member defined in subdivision 1 who becomes disabled and physically or mentally unfit to perform the duties of the position because of sickness or injury while engaged in covered employment is entitled to a disability benefit amount equivalent to an annuity computed under subdivision 3 assuming the member has 20 years of service qualifying under this section and waiving the minimum age requirement. An eligible member who becomes disabled under this subdivision with more than 20 years of service credited under this section is entitled to a disability benefit amount equivalent to an annuity computed under subdivision 3 based on all years of service credited under this section and waiving the age requirement.\nIf the eligible employee is entitled to receive a disability benefit as provided in subdivision 4 or 5 and has allowable service credit under this section for less service than the length of service upon which the disability benefit in subdivision 4 or 5 is based, and also has allowable service in the general plan not includable in this section, the employee is entitled to a disability benefit or deferred retirement annuity based on the general plan service not includable in this section only for the service that, when combined with the service includable in this section, exceeds the number of years on which the disability benefit provided in subdivision 4 or 5 is based. The benefit recipient under subdivision 4 or 5 who also has credit for regular plan service must in all respects qualify under section 352.113 to be entitled to receive a disability benefit based on the general plan service not includable in this section, except that the service may be combined to satisfy length of service requirements. Any deferred annuity to which the employee may be entitled based on general plan service not includable in this section must be augmented as provided in section 352.22, subdivision 3a, while the employee is receiving a disability benefit under this section.\nThe special retirement annuity and disability coverage under this section must be financed by an employee contribution of 2.78 percent of covered salary and an employer contribution of 4.20 percent of covered salary. These contributions are in addition to the contributions required by section 352.04, subdivisions 2 and 3, and must be made in the manner provided for in section 352.04, subdivisions 4, 5, and 6.\nTo be covered by this section, an employee of the Department of Public Safety described in subdivision 1 who is employed in a position described in that subdivision must file a notice with the executive director of the system on a form prescribed by the executive director stating that the employee elects to be covered by this section. Notice must be filed within 90 days of employment. Elected coverage is effective retroactively as of the first day of employment. Amounts that would have been deducted from the employee's salary starting with the first day of employment but were not deducted because the employee had not yet filed the election must be deducted from the employee's future salary in accordance with a schedule of deductions determined by the executive director and the Department of Public Safety. Elections are irrevocable during any period of covered employment. A failure to file a timely notice is deemed a waiver of coverage by this section.",
	"repealed": false
}