{
	"id": "458D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.11",
	"title": "458D.11 GOVERNMENT PAYMENTS.",
	"text": "Each government unit shall pay to the board all sums charged to it as provided in section 458D.09, at the times and in the manner determined by the board. The governing body of each such government unit shall take all action that may be necessary to provide the funds required for such payments and to make the same when due.\nCharges payable to the board by local government units may be made payable at such times during each year as the board determines, after it has taken into account the dates on which taxes, assessments, revenue collections and other funds become available to the government units required to pay such charges.\nTo accomplish any duty imposed on it by the board, the governing body of every government unit may, in addition to the powers granted in sections 458D.01 to 458D.24 and in any other law or charter, exercise the powers granted any municipality by chapters 117, 412, 429, 475, and sections 115.46, 444.075 and 471.59. In addition thereto, the governing body of every government unit may levy taxes upon all taxable property in that part of the government unit located in the district for all or a part of the amount payable to the board, to be assessed and extended as a tax upon such taxable property by the county auditor for the next calendar year, free from any limitation of rate or amount imposed by law or charter. Such tax shall be collected and remitted in the same manner as other general taxes of the government unit.\nIf the local government unit fails to make any payment to the board when due, the board may certify to the auditor of the county in which the government unit is located the amount required for payment of such amount with interest at not more than the maximum rate per annum authorized at that time on assessments pursuant to section 429.061, subdivision 2. The auditor shall levy and extend such amount as a tax upon all taxable property in that part of the government unit located in the district for the next calendar year, free from any existing limitations imposed by law or charter. Such tax shall be collected in the same manner as other general taxes of the government unit, and the proceeds thereof, when collected, shall be paid by the county treasurer to the treasurer of the board and credited to the government unit for which the tax was levied.",
	"repealed": false
}