{
	"id": "86B.532",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.532",
	"title": "86B.532 CARBON MONOXIDE DETECTION; SYSTEM REQUIREMENTS.",
	"text": "(a) No motorboat used for recreational purposes that has an enclosed accommodation compartment may be operated on any waters of the state unless the motorboat is equipped with a functioning marine carbon monoxide detection system installed according to the manufacturer's instructions and this subdivision.\n(b) No new motorboat used for recreational purposes that has an enclosed accommodation compartment may be sold or offered for sale in Minnesota unless the motorboat is equipped with a new functioning marine carbon monoxide detection system installed according to the manufacturer's instructions and this subdivision.\n(c) A marine carbon monoxide detection system must be located:\n(1) to monitor the atmosphere of the main cabin of the enclosed accommodation compartment; and\n(2) in each sleeping accommodation or within ten feet or 3.048 meters of any designated sleeping accommodations.\nAll state-sponsored boating safety courses and all boating safety courses that require state approval by the commissioner must incorporate information about the dangers of being overcome by carbon monoxide poisoning while on or behind a motorboat and how to prevent that poisoning.\n(a) No gasoline-powered motorboat that has an enclosed occupancy compartment may be operated on any waters of the state unless labels warning of carbon monoxide dangers are affixed in the vicinity of: the aft reboarding/stern area, the steering station, and in or at the entrance to any enclosed occupancy compartment.\n(b) For a motorboat sold by a dealer, the dealer must ensure that specified warning labels have been affixed before completion of the transaction.\n(c) Warning labels approved by the American Boat and Yacht Council, National Marine Manufacturers Association, or the commissioner satisfy the requirements of this section when installed as specified.\nThe commissioner shall mail the information and labels to all owners of motorboats that are 19 feet and greater in length the first year. The commissioner must also provide license agents with informational brochures and warning labels about the dangers of carbon monoxide poisoning while boating. A license agent must make the brochure and labels available to motorboat owners and make efforts to inform new owners of the requirement. The commissioner shall highlight the new requirements on the watercraft renewal reminder postcard for three consecutive three-year license cycles and in the Minnesota Boating Guide. The brochure must instruct motorboat owners to place the labels according to subdivision 3, and inform motorboat owners of carbon monoxide dangers of gasoline-powered generators.\nA first violation of this section shall not result in a penalty, but is punishable only by a safety warning. A second or subsequent violation is a petty misdemeanor.",
	"repealed": false
}