{
	"id": "137.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.45",
	"title": "137.45 PROGRAM FOR STUDENTS WITH INTELLECTUAL AND DEVELOPMENTAL DISABILITIES.",
	"text": "The Board of Regents of the University of Minnesota is requested to offer an academic program consistent with the requirements of this section for students with intellectual and developmental disabilities at the University of Minnesota-Morris.\nThe program must establish an enrollment goal of at least 15 incoming students per academic year. The board is requested to establish an application process for the program. A student who successfully completes the program must be awarded a certificate, diploma, or other appropriate academic credential.\n(a) The program must provide an inclusive, full-time, two-year residential college experience for students with intellectual and developmental disabilities. The curriculum must include:\n(1) core courses that develop life skills, financial literacy, and the ability to live independently;\n(2) rigorous academic work in a student's chosen field of study; and\n(3) an internship, apprenticeship, or other skills-based experience to prepare for meaningful employment upon completion of the program.\n(b) In addition to academic requirements, the program must allow participating students the opportunity to engage fully in campus life. Program activities must include, but are not limited to:\n(1) the establishment of on-campus mentoring and peer support communities; and\n(2) opportunities for personal growth through leadership development and other community engagement activities.\n(c) The program may tailor its curriculum and activities to highlight academic programs, student and community life experiences, and employment opportunities unique to the campus or the region where the campus is located.\nBy January 15 of each year, the board must submit a report on the program to the chairs and ranking minority members of the committees in the house of representatives and the senate with jurisdiction over higher education finance and policy. The report must include, but need not be limited to, information regarding:\n(1) the number of students participating in the program;\n(2) program goals and outcomes; and\n(3) the success rate of participants.",
	"repealed": false
}