{
	"id": "60M.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/60M.05",
	"title": "60M.05 SOLICITATION.",
	"text": "(a) A producer is prohibited from, in or on the grounds of a jail, prison, or other location where an incarcerated person is confined, or in or on the grounds of a court unless requested by the principal, a potential indemnitor, or the legal counsel of a principal:\n(1) approaching, enticing, inviting, or soliciting a person to use a bail bond agency's services;\n(2) distributing, displaying, or wearing an item that advertises a bail bond agency's services;\n(3) no producer or bail bond agency is permitted to solicit by calling or leaving messages for principals on jail phones or any other messaging devices available to principals while in custody; or\n(4) no producer or bail bond agency is permitted to place money on the canteen or books of any individual held in custody.\n(b) Notwithstanding paragraph (a), clause (3), permissible print advertising in a jail is limited to:\n(1) a listing in a telephone directory; and\n(2) posting the producer's or bail bond agency's name, address, and telephone number in a designated location within the jail, as approved by the jail.\nA producer is prohibited from wearing or displaying any information, other than identification approved by the surety or bail bond agency, which constitutes marketing material that a surety or bail bond agency must approve and maintain under Minnesota Rules, chapter 2790. A producer is prohibited from displaying any information constituting marketing material in or on the property or grounds of: (1) a jail, prison, or other location where incarcerated people are confined; or (2) a court.\n(a) A producer is prohibited from loitering in or about the courthouse, jail, or any other place where individuals are held in custody.\n(b) A producer is prohibited from making unauthorized and unsolicited cold calls without having first spoken with the principal.\n(c) A producer is prohibited from soliciting a bond to a person by recorded or electronic communication, or by live telephone contact, unless the producer otherwise complies with applicable state and federal law, including but not limited to:\n(1) the National Do Not Call Registry under Code of Federal Regulations, title 16, part 310; and\n(2) the Telephone Consumer Protection Act of 1991, Code of Federal Regulations, title 47, part 64.1200.\n(d) A surety, bail bond agency, or producer is prohibited from obtaining a credit check on a person unless the person has authorized the surety, bail bond agency, or producer to do so in writing. The surety, bail bond agency, or producer must retain the written authorization provided by the person subject to the credit check.\n(a) A surety, bail bond agency, and producer must comply with all federal and state privacy laws related to information provided to a producer during the application process and during bond underwriting by a bond principal, indemnitor, or other person.\n(b) A surety, bail bond agency, and producer must comply with sections 60K.46, subdivision 6; 72A.494; 72A.496, subdivision 1; 72A.501; and 72A.502, subdivision 1.\n(c) A surety, bail bond agency, and producer must receive preauthorization before collecting and disclosing personal or privileged information about an applicant or proposed insured, and must provide all notices otherwise required by Minnesota law.\n(d) A surety, bail bond agency, and producer must otherwise comply with all applicable Minnesota law.\nThe act of soliciting, underwriting, negotiating, or selling a bail bond constitutes an insurance transaction.",
	"repealed": false
}