{
	"id": "354A.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.091",
	"title": "354A.091 TEACHERS ON EXTENDED LEAVE.",
	"text": "Notwithstanding any provision to the contrary of this chapter or the articles of incorporation or bylaws of the association relating to the salary figure to be used for the determination of contributions or the accrual of service credit an elementary, secondary, or technical college teacher in Independent School District No. 625, St. Paul, who is granted an extended leave of absence pursuant to section 122A.46, or a teacher who is granted an extended leave of absence under section 136F.43, may pay employee contributions to the association and must be entitled to receive allowable service credit in the association for each year of leave, provided the member and the employing board make the required employer contributions, in any proportion they may agree upon, to the association during the period of leave which shall not exceed five years. The state must not make an employer contribution on behalf of the teacher. The employee and employer contributions must be based upon the rates of contribution prescribed by section 354A.12 as applied to a salary figure equal to the teacher's actual covered salary for the plan year immediately preceding the leave. Payment of the employee and employer contributions authorized pursuant to this section must be made on or before June 30 of the fiscal year for which service credit is to be received. No allowable service with respect to a year of extended leave of absence shall be credited to a teacher until payment of the required employee and employer contributions has been received by the association.\n[Repealed, 2008 c 349 art 5 s 37]\n[Repealed, 2008 c 349 art 5 s 37]\nA teacher on extended leave under either section 122A.46 or 136F.43 whose employee and employer contributions are made to the teachers retirement fund association pursuant to subdivision 1 must retain membership in the association for each year during which the contributions are made, under the same terms and conditions as if the teacher had continued to teach in the district.\nA teacher on extended leave under either section 122A.46 or 136F.43 who does not make employee contributions or whose employer contribution is not made to the teachers retirement fund association in any year must be deemed to have ceased to be an active member of the association and to have ceased to render teaching services beginning in that year for purposes of this chapter and the articles of incorporation and bylaws of the association, and may not pay employee or employer contributions into the fund in any subsequent year of the leave. Nonpayment of contributions into the fund must not affect the rights or obligations of the teacher or the employing school district under section 122A.46 or the Minnesota State Colleges and Universities system under section 136F.43.\nIf a teacher who has made employee contributions to the teachers retirement fund association for the agreed maximum duration of an extended leave does not resume teaching service in the first school year after that maximum duration has elapsed, the teacher must be deemed to have ceased to be an active member of the association and to have ceased to render teaching services beginning in that first school year after that maximum duration has elapsed for purposes of this chapter and the articles of incorporation and bylaws of the association.\nThe provisions of this section must not apply to a teacher who is discharged pursuant to section 122A.41 while the teacher is on an extended leave of absence pursuant to section 122A.46. The provisions of this section also do not apply to a teacher who is discharged for cause while the teacher is on an extended leave of absence under section 136F.43.\nA teacher who makes employee contributions to and receives allowable service credit in the teachers retirement fund association pursuant to this section may not make employee contributions or receive allowable service credit for the same period of time in any other Minnesota public employee pension plan, except a firefighters relief association governed by sections 424A.091 to 424A.096 or the statewide volunteer firefighter plan governed by chapter 353G. This subdivision must not be construed to prohibit a member who pays employee contributions and receives allowable service credit in the fund pursuant to this section in any year from being employed as a substitute teacher by any school district during that year. Notwithstanding the provisions of this chapter or the bylaws of a retirement association, a teacher may not pay retirement contributions or receive allowable service credit in the fund for teaching service rendered for any part of any year for which the teacher pays retirement contributions or receives allowable service credit pursuant to section 354.094 or this section while on an extended leave of absence under either section 122A.46 or 136F.43.",
	"repealed": false
}