{
	"id": "429.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/429.031",
	"title": "429.031 PRELIMINARY PLANS, HEARINGS.",
	"text": "(a) Before the municipality awards a contract for an improvement or orders it made by day labor, or before the municipality may assess any portion of the cost of an improvement to be made under a cooperative agreement with the state or another political subdivision for sharing the cost of making the improvement, the council shall hold a public hearing on the proposed improvement following two publications in the newspaper of a notice stating the time and place of the hearing, the general nature of the improvement, the estimated cost, and the area proposed to be assessed. The two publications must be a week apart, and the hearing must be at least three days after the second publication. Not less than ten days before the hearing, notice of the hearing must also be mailed to the owner of each parcel within the area proposed to be assessed and must contain a statement that a reasonable estimate of the impact of the assessment will be available at the hearing, but failure to give mailed notice or any defects in the notice does not invalidate the proceedings. For the purpose of giving mailed notice, owners are those shown as owners on the records of the county auditor or, in any county where tax statements are mailed by the county treasurer, on the records of the county treasurer; but other appropriate records may be used for this purpose. For properties that are tax exempt or subject to taxation on a gross earnings basis and are not listed on the records of the county auditor or the county treasurer, the owners may be ascertained by any practicable means, and mailed notice must be given them as provided in this subdivision.\n(b) Before the adoption of a resolution ordering the improvement, the council shall secure from the city engineer or some other competent person of its selection a report advising it in a preliminary way as to whether the proposed improvement is necessary, cost-effective, and feasible and as to whether it should best be made as proposed or in connection with some other improvement. The report must also include the estimated cost of the improvement as recommended. A reasonable estimate of the total amount to be assessed, and a description of the methodology used to calculate individual assessments for affected parcels, must be available at the hearing. No error or omission in the report invalidates the proceeding unless it materially prejudices the interests of an owner.\n(c) If the report is not prepared by an employee of a municipality, the compensation for preparing the report under this subdivision must be based on the following factors:\n(1) the time and labor required;\n(2) the experience and knowledge of the preparer;\n(3) the complexity and novelty of the problems involved; and\n(4) the extent of the responsibilities assumed.\n(d) The compensation must not be based primarily on a percentage of the estimated cost of the improvement.\n(e) The council may also take other steps prior to the hearing, including, among other things, the preparation of plans and specifications and the advertisement for bids that will in its judgment provide helpful information in determining the desirability and feasibility of the improvement.\n(f) The hearing may be adjourned from time to time, and a resolution ordering the improvement may be adopted at any time within six months after the date of the hearing by vote of a majority of all members of the council when the improvement has been petitioned for by the owners of not less than 35 percent in frontage of the real property abutting on the streets named in the petition as the location of the improvement. When there has been no such petition, the resolution may be adopted only by vote of four-fifths of all members of the council; provided that if the mayor of the municipality is a member of the council but has no vote or votes only in case of a tie, the mayor is not deemed to be a member for the purpose of determining a four-fifths majority vote.\n(g) The resolution ordering the improvement may reduce, but not increase, the extent of the improvement as stated in the notice of hearing.\nA resolution ordering a park improvement may be adopted only by a four-fifths vote of the council and shall also be approved by the park board, if there is one; provided, that if the mayor of the municipality is a member of the council but has no vote or votes only in case of a tie, the mayor shall not be deemed to be a member for the purpose of determining such four-fifths majority vote. A resolution ordering an improvement of the water, sewer, steam heating, street lighting or other facility over which a utilities commission has jurisdiction shall also be approved by the utilities commission.\nWhenever all owners of real property abutting upon any street named as the location of any improvement shall petition the council to construct the improvement and to assess the entire cost against their property, the council may, without a public hearing, adopt a resolution determining such fact and ordering the improvement. The validity of the resolution shall not be questioned by any taxpayer or property owner or the municipality unless an action for that purpose is commenced within 30 days after adoption of the resolution as provided in section 429.036. Nothing herein prevents any property owner from questioning the amount or validity of the special assessment against the owner's property pursuant to section 429.081. In the case of a petition for the municipality to own and install a fire protection system, energy improvement projects, a pedestrian skyway system, or on-site water contaminant improvements, the petition must contain or be accompanied by an undertaking satisfactory to the city by the petitioner that the petitioner will grant the municipality the necessary property interest in the building to permit the city to enter upon the property and the building to construct, maintain, and operate the fire protection system, energy improvement projects, pedestrian skyway system, or on-site water contaminant improvements. In the case of a petition for the installation of a privately owned fire protection system, energy improvement projects, a privately owned pedestrian skyway system, or privately owned on-site water contaminant improvements, the petition shall contain the plans and specifications for the improvement, the estimated cost of the improvement and a statement indicating whether the city or the owner will contract for the construction of the improvement. If the owner is contracting for the construction of the improvement, the city shall not approve the petition until it has reviewed and approved the plans, specifications, and cost estimates contained in the petition. The construction cost financed under section 429.091 shall not exceed the amount of the cost estimate contained in the petition. In the case of a petition for the installation of a fire protection system, energy improvement projects, a pedestrian skyway system, or on-site water contaminant improvements, the petitioner may request abandonment of the improvement at any time after it has been ordered pursuant to subdivision 1 and before contracts have been awarded for the construction of the improvement under section 429.041, subdivision 2. If such a request is received, the city council shall abandon the proceedings but in such case the petitioner shall reimburse the city for any and all expenses incurred by the city in connection with the improvement.",
	"repealed": false
}