{
	"id": "609A.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/609A.015",
	"title": "609A.015 AUTOMATIC EXPUNGEMENT OF RECORDS.",
	"text": "(a) A person who is the subject of a criminal record or delinquency record is eligible for a grant of expungement relief without the filing of a petition:\n(1) if the person was arrested and all charges were dismissed after a case was filed unless dismissal was based on a finding that the defendant was incompetent to proceed;\n(2) upon the dismissal and discharge of proceedings against a person under section 152.18, subdivision 1, for violation of section 152.024, 152.025, or 152.027 for possession of a controlled substance; or\n(3) if all pending actions or proceedings were resolved in favor of the person.\n(b) For purposes of this chapter, a verdict of not guilty by reason of mental illness is not a resolution in favor of the person. For purposes of this chapter, an action or proceeding is resolved in favor of the person if the petitioner received an order under section 590.11 determining that the person is eligible for compensation based on exoneration.\n(c) The service requirements in section 609A.03, subdivision 8, do not apply to any expungements ordered under this subdivision.\n(d) An expungement order does not apply to records held by the commissioners of children, youth, and families; health; and human services.\n(a) A person is eligible for a grant of expungement relief if the person has successfully completed the terms of a diversion program or stay of adjudication for a qualifying offense that is not a felony and has not been petitioned or charged with a new offense, other than an offense that would be a petty misdemeanor, in Minnesota:\n(1) for one year immediately following completion of the diversion program or stay of adjudication; or\n(2) for one year immediately preceding a subsequent review performed pursuant to subdivision 5, paragraph (a).\n(b) The service requirements in section 609A.03, subdivision 8, do not apply to any expungements ordered under this subdivision.\n(c) An expungement order does not apply to records held by the commissioners of children, youth, and families; health; and human services.\n(a) A person is eligible for a grant of expungement relief if the person:\n(1) was convicted of a qualifying offense;\n(2) has not been convicted of a new offense, other than an offense that would be a petty misdemeanor, in Minnesota:\n(i) during the applicable waiting period immediately following discharge of the disposition or sentence for the crime; or\n(ii) during the applicable waiting period immediately preceding a subsequent review performed pursuant to subdivision 5, paragraph (a); and\n(3) is not charged with an offense, other than an offense that would be a petty misdemeanor, in Minnesota at the time the person reaches the end of the applicable waiting period or at the time of a subsequent review.\n(b) As used in this subdivision, \"qualifying offense\" means a conviction for:\n(1) any petty misdemeanor offense other than a violation of a traffic regulation relating to the operation or parking of motor vehicles;\n(2) any misdemeanor offense other than:\n(i) section 169A.20 under the terms described in section 169A.27 (fourth-degree driving while impaired);\n(ii) section 518B.01, subdivision 14 (violation of an order for protection);\n(iii) section 609.224 (assault in the fifth degree);\n(iv) section 609.2242 (domestic assault);\n(v) section 609.746 (interference with privacy);\n(vi) section 609.748 (violation of a harassment restraining order);\n(vii) section 609.78 (interference with emergency call);\n(viii) section 609.79 (obscene or harassing phone calls);\n(ix) section 617.23 (indecent exposure); or\n(x) section 629.75 (violation of domestic abuse no contact order);\n(3) any gross misdemeanor offense other than:\n(i) section 169.13, subdivision 1, if the person causes great bodily harm or death to another (reckless driving resulting in great bodily harm or death);\n(ii) section 169A.25 (second-degree driving while impaired);\n(iii) section 169A.26 (third-degree driving while impaired);\n(iv) section 518B.01, subdivision 14 (violation of an order for protection);\n(v) section 609.2113, subdivision 3 (criminal vehicular operation);\n(vi) section 609.2231 (assault in the fourth degree);\n(vii) section 609.224 (assault in the fifth degree);\n(viii) section 609.2242 (domestic assault);\n(ix) section 609.233 (criminal neglect);\n(x) section 609.3451 (criminal sexual conduct in the fifth degree);\n(xi) section 609.377 (malicious punishment of child);\n(xii) section 609.485 (escape from custody);\n(xiii) section 609.498 (tampering with witness);\n(xiv) section 609.582, subdivision 4 (burglary in the fourth degree);\n(xv) section 609.746 (interference with privacy);\n(xvi) section 609.748 (violation of a harassment restraining order);\n(xvii) section 609.749 (harassment; stalking);\n(xviii) section 609.78 (interference with emergency call);\n(xix) section 617.23 (indecent exposure);\n(xx) section 617.261 (nonconsensual dissemination of private sexual images); or\n(xxi) section 629.75 (violation of domestic abuse no contact order); or\n(4) any felony offense listed in section 609A.02, subdivision 3, paragraph (b), other than:\n(i) section 152.023, subdivision 2 (possession of a controlled substance in the third degree);\n(ii) 152.024, subdivision 2 (possession of a controlled substance in the fourth degree);\n(iii) section 609.485, subdivision 4, paragraph (a), clause (2) or (4) (escape from civil commitment for mental illness);\n(iv) section 609.582, subdivision 3, paragraph (a) (burglary in the third degree; other than trespass); or\n(v) section 609.746, subdivision 1, paragraph (g) (interference with privacy; subsequent violation or minor victim).\n(c) As used in this subdivision, \"applicable waiting period\" means:\n(1) if the offense was a petty misdemeanor, two years since discharge of the sentence;\n(2) if the offense was a misdemeanor, two years since discharge of the sentence for the crime;\n(3) if the offense was a gross misdemeanor, three years since discharge of the sentence for the crime;\n(4) if the offense was a felony violation of section 152.025, four years since the discharge of the sentence for the crime; and\n(5) if the offense was any other felony, five years since discharge of the sentence for the crime.\n(d) Felony offenses deemed to be a gross misdemeanor or misdemeanor pursuant to section 609.13, subdivision 1, remain ineligible for expungement under this section. Gross misdemeanor offenses ineligible for a grant of expungement under this section remain ineligible if deemed to be for a misdemeanor pursuant to section 609.13, subdivision 2.\n(e) The service requirements in section 609A.03, subdivision 8, do not apply to any expungements ordered under this subdivision.\n(f) An expungement order does not apply to records held by the commissioners of children, youth, and families; health; and human services.\n(a) The court shall notify a person who may become eligible for an automatic expungement under this section of that eligibility at any hearing where the court dismisses and discharges proceedings against a person under section 152.18, subdivision 1, for violation of section 152.024, 152.025, or 152.027 for possession of a controlled substance; concludes that all pending actions or proceedings were resolved in favor of the person; grants a person's placement into a diversion program; or sentences a person or otherwise imposes a consequence for a qualifying offense.\n(b) To the extent possible, prosecutors, defense counsel, supervising agents, and coordinators or supervisors of a diversion program shall notify a person who may become eligible for an automatic expungement under this section of that eligibility.\n(c) If any party gives notification under this subdivision, the notification shall inform the person that:\n(1) a record expunged under this section may be opened for purposes of a background study by the Department of Human Services or the Department of Health under section 245C.08 and for purposes of a background check by the Professional Educator Licensing and Standards Board as required under section 122A.18, subdivision 8; and\n(2) the person can file a petition under section 609A.03, subject to the process in section 609A.03 and the limitations in section 609A.02, to expunge the records held by the commissioner of human services, the commissioner of health, and the Professional Educator Licensing and Standards Board.\n(a) The Bureau of Criminal Apprehension shall identify any records that qualify for a grant of expungement relief pursuant to this subdivision or subdivision 1, 2, or 3. The Bureau of Criminal Apprehension shall make an initial determination of eligibility within 30 days of the end of the applicable waiting period. If a record is not eligible for a grant of expungement at the time of the initial determination, the Bureau of Criminal Apprehension shall make subsequent eligibility determinations annually until the record is eligible for a grant of expungement.\n(b) In making the determination under paragraph (a), the Bureau of Criminal Apprehension shall identify individuals who are the subject of relevant records through the use of fingerprints and thumbprints where fingerprints and thumbprints are available. Where fingerprints and thumbprints are not available, the Bureau of Criminal Apprehension shall identify individuals through the use of the person's name and date of birth. Records containing the same name and date of birth shall be presumed to refer to the same individual unless other evidence establishes, by a preponderance of the evidence, that they do not refer to the same individual. The Bureau of Criminal Apprehension is not required to review any other evidence in making a determination.\n(c) The Bureau of Criminal Apprehension shall grant expungement relief to qualifying persons and seal its own records without requiring an application, petition, or motion. Records shall be sealed 60 days after notice is sent to the judicial branch pursuant to paragraph (e) unless an order of the judicial branch prohibits sealing the records or additional information establishes that the records are not eligible for expungement.\n(d) Nonpublic criminal records maintained by the Bureau of Criminal Apprehension and subject to a grant of expungement relief shall display a notation stating \"expungement relief granted pursuant to section 609A.015.\"\n(e) The Bureau of Criminal Apprehension shall inform the judicial branch of all cases for which expungement relief was granted pursuant to this section. Notification may be through electronic means and may be made in real time or in the form of a monthly report. Upon receipt of notice, the judicial branch shall seal all records relating to an arrest, indictment or information, trial, verdict, or dismissal and discharge for any case in which expungement relief was granted and shall issue any order deemed necessary to achieve this purpose.\n(f) The Bureau of Criminal Apprehension shall inform each law enforcement agency that its records may be affected by a grant of expungement relief. Notification may be through electronic means. Each notified law enforcement agency that receives a request to produce records shall first determine if the records were subject to a grant of expungement under this section. The law enforcement agency must not disclose records relating to an arrest, indictment or information, trial, verdict, or dismissal and discharge for any case in which expungement relief was granted and must maintain the data consistent with the classification in paragraph (g). This paragraph does not apply to requests from a criminal justice agency as defined in section 609A.03, subdivision 7a, paragraph (f).\n(g) Data on the person whose offense has been expunged under this subdivision, including any notice sent pursuant to paragraph (f), are private data on individuals as defined in section 13.02, subdivision 12.\n(h) The prosecuting attorney shall notify the victim that an offense qualifies for automatic expungement under this section in the manner provided in section 611A.03, subdivisions 1 and 2.\n(i) In any subsequent prosecution of a person granted expungement relief, the expunged criminal record may be pleaded and has the same effect as if the relief had not been granted.\n(j) The Bureau of Criminal Apprehension is directed to develop, modify, or update a system to provide criminal justice agencies with uniform statewide access to criminal records sealed by expungement.\nEmployees of the Bureau of Criminal Apprehension shall not be held civilly liable for the exercise or the failure to exercise, or the decision to exercise or the decision to decline to exercise, the powers granted by this section or for any act or omission occurring within the scope of the performance of their duties under this section.",
	"repealed": false
}