{
	"id": "260.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.64",
	"title": "260.64 DUTY TO PREVENT OUT-OF-HOME PLACEMENT AND PROMOTE FAMILY REUNIFICATION.",
	"text": "A responsible social services agency shall make active efforts to prevent the out-of-home placement of an African American or a disproportionately represented child, eliminate the need for a child's removal from the child's home, and reunify an African American or a disproportionately represented child with the child's family as soon as practicable.\n(a) Prior to petitioning the court to remove an African American or a disproportionately represented child from the child's home under section 260.66, a responsible social services agency must work with the child's family to allow the child to remain in the child's home while implementing a safety plan based on the family's needs. The responsible social services agency must:\n(1) make active efforts to engage the child's parent or custodian and the child, when appropriate;\n(2) assess the family's cultural and economic needs and, if applicable, needs and services related to the child's disability;\n(3) hold a family group consultation meeting and connect the family with supports to establish a safety network for the family; and\n(4) provide support, guidance, and input to assist the family and the family's safety network with developing the safety plan.\n(b) The safety plan must:\n(1) address the specific allegations impacting the child's safety in the home. If neglect is alleged, the safety plan must incorporate economic services and supports for the child and the child's family, if eligible, to address the family's specific needs and prevent neglect;\n(2) incorporate family and community support to ensure the child's safety while keeping the family intact; and\n(3) be adjusted as needed to address the child's and family's ongoing needs and support.\n(c) The responsible social services agency is not required to establish a safety plan:\n(1) in a case with allegations of sexual abuse or egregious harm;\n(2) when the parent is not willing to follow a safety plan;\n(3) when the parent has abandoned the child or is unavailable to follow a safety plan; or\n(4) when the parent has chronic substance use disorder issues and is unable to parent the child.\nUnless the court finds by clear and convincing evidence that the child would be at risk of serious emotional damage or serious physical damage if the child were to remain in the child's home, a court shall not order a foster care or permanent out-of-home placement of an African American or a disproportionately represented child alleged to be in need of protection or services. At each hearing regarding an African American or a disproportionately represented child who is alleged or adjudicated to be in need of child protective services, the court shall review whether the responsible social services agency has provided active efforts to the child and the child's family and shall require the responsible social services agency to provide evidence and documentation that demonstrate that the agency is providing culturally informed, strength-based, community-involved, and community-based services to the child and the child's family.\nWhen determining whether the responsible social services agency has made active efforts to preserve the child's family, the court shall make findings regarding whether the responsible social services agency made appropriate and meaningful services available to the child's family based upon the family's specific needs. If a court determines that the responsible social services agency did not make active efforts to preserve the family as required by this section, the court shall order the responsible social services agency to immediately provide active efforts to the child and child's family to preserve the family.",
	"repealed": false
}