{
	"id": "245G.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.09",
	"title": "245G.09 CLIENT RECORDS.",
	"text": "(a) A license holder must maintain a file of current and accurate client records on the premises where the treatment service is provided or coordinated. For services provided off site, client records must be available at the program and adhere to the same clinical and administrative policies and procedures as services provided on site. The content and format of client records must be uniform and entries in each record must be signed and dated by the staff member making the entry. Client records must be protected against loss, tampering, or unauthorized disclosure according to section 254A.09, chapter 13, and Code of Federal Regulations, title 42, chapter 1, part 2, subpart B, sections 2.1 to 2.67, and title 45, parts 160 to 164.\n(b) The program must have a policy and procedure that identifies how the program will track and record client attendance at treatment activities, including the date, duration, and nature of each treatment service provided to the client.\n(c) The program must identify in the client record designation of an individual who is receiving services under section 254A.03, subdivision 3, including the start date and end date of services eligible under section 254A.03, subdivision 3.\nThe client records of a discharged client must be retained by a license holder for seven years. A license holder that ceases to provide treatment service must retain client records for seven years from the date of facility closure and must notify the commissioner of the location of the client records and the name of the individual responsible for maintaining the client's records.\nClient records must contain the following:\n(1) documentation that the client was given information on client rights and responsibilities, grievance procedures, tuberculosis, and HIV, and that the client was provided an orientation to the program abuse prevention plan required under section 245A.65, subdivision 2, paragraph (a), clause (4). If the client has an opioid use disorder, the record must contain documentation that the client was provided educational information according to section 245G.04, subdivision 3;\n(2) an initial services plan completed according to section 245G.04;\n(3) a comprehensive assessment completed according to section 245G.05;\n(4) an individual abuse prevention plan according to sections 245A.65, subdivision 2, and 626.557, subdivision 14, when applicable;\n(5) an individual treatment plan according to section 245G.06, subdivisions 1 and 1a;\n(6) documentation of treatment services, significant events, appointments, concerns, and treatment plan reviews according to section 245G.06, subdivisions 2a, 2b, 3, and 3a; and\n(7) a summary at the time of service termination according to section 245G.06, subdivision 4.",
	"repealed": false
}