{
	"id": "97C.811",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.811",
	"title": "97C.811 COMMERCIAL FISHING IN INLAND WATERS.",
	"text": "For the purposes of this section and section 97A.475, subdivision 30, \"inland waters\" means all waters entirely located within the boundaries of the state and the border waters between Minnesota and North Dakota, South Dakota and Iowa, excluding those waters described in section 97C.801.\nFor purposes of this section and section 97A.475, subdivision 30, \"commercial fish\" are common carp and native rough fish, except for bowfin.\nThe commissioner shall, by rule, regulate the taking, possession, transportation, and sale of commercial fish, and the licensing of commercial fishing operators in inland waters.\nA person may not commercially fish inland waters without a commercial fishing license. Nonresidents may only be licensed to fish waters not previously assigned to residents. In the license application the applicant must list the number of feet of seine of each depth to be licensed.\nLicenses to net commercial fish in inland waters are issued to residents and nonresidents annually subject to this section and shall be valid for commercial fishing during the open season for commercial fishing in inland waters from the day after Labor Day to the day before the open season for walleye.\n(a) A license to take commercial fish is void upon:\n(1) the licensee's death;\n(2) cessation of commercial fishing operations within an assigned area, except as provided by paragraph (c);\n(3) conviction of two or more violations of inland commercial fishing laws within a license period; or\n(4) failure to apply for a new or renewal license prior to June 15 of any year.\n(b) A commercial inland fishing license is not subject to the license revocation provisions of section 97A.421. Commercial fishing rights and area assignments covered by a license that becomes void reverts to the commissioner for reassignment.\n(c) A person possessing a valid inland commercial fishing license may apply to the commissioner for transfer of an assigned commercial fishing area to another person. Upon receipt of the application, the commissioner shall notify the applicant that the application for transfer has been received and shall determine if other people are interested in the assigned area by:\n(1) notifying the Inland Commercial Fish Trade Association in writing; and\n(2) publishing notice in a newspaper of general circulation in the vicinity of the assigned area.\nThese notices must allow interested persons 30 days to notify the commissioner of their interest in the assigned area. Within 60 days after publishing notice, the commissioner shall review the qualifications of all interested persons and approve or deny the transfer based on the criteria in section 97C.815, subdivision 2. If the transfer is denied, the licensee may retain the license or request that it become void.\nA licensed inland commercial fishing operator shall submit a report on the licensed activities the operator was engaged in to the commissioner each month. The report must be on a form provided by the commissioner and submitted prior to the 15th day of the following month. The report shall be submitted whether fishing activity took place unless the operator has a written release from this obligation signed by the commissioner.",
	"repealed": false
}