{
	"id": "256R.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.261",
	"title": "256R.261 PROPERTY RATE DEFINITIONS.",
	"text": "For purposes of sections 256R.26 to 256R.267, the terms in this section have the meanings given unless otherwise provided for in this chapter.\n\"Addition\" means an extension, enlargement, or expansion of the nursing facility for the purpose of increasing the number of licensed beds or improving resident care.\n\"Appraisal\" means an evaluation of the nursing facility's physical real estate conducted by a property appraisal firm selected by the commissioner to establish the valuation of a building and fixed equipment. An appraisal does not include an evaluation of movable equipment, land, or land improvements. An appraisal may include an evaluation of shared space provided the valuation is subsequently adjusted for any shared area included in the depreciated replacement cost and undepreciated replacement cost that is not used exclusively for nursing facility purposes.\n\"Building\" means the physical plant and fixed equipment used directly for resident care and licensed under chapter 144A or sections 144.50 to 144.56. Building excludes buildings or portions of buildings used by central, affiliated, or corporate offices.\n\"Capacity days\" means the number of licensed beds within the nursing facility multiplied by 365 days.\n\"Construction cost per square foot value\" means the RSMeans nursing home cost per square foot of floor area for a 40,000-square-foot nursing home with precast concrete and bearing walls multiplied by the commercial location factor for Minneapolis as indicated in the most recently available edition of the Square Foot Costs with RSMeans Data, as published by Gordian.\n\"Commercial valuation system\" means the commercially available building valuation system selected by the commissioner for use in all appraisals.\n\"Depreciable movable equipment\" means the standard movable care equipment and support service equipment generally used in nursing facilities. Depreciable movable equipment includes equipment specified in the major movable equipment table of the depreciation guidelines.\n\"Depreciated replacement cost\" or \"DRC\" means the depreciated replacement cost determined by an appraisal using the commercial valuation system selected by the commissioner. DRC excludes costs related to parking structures.\n\"Depreciation expense\" means the portion of a capital asset deemed to be consumed or expired over the life of the asset.\n\"Depreciation guidelines\" means the most recent publication of \"Estimated Useful Lives of Depreciable Hospital Assets\" issued by the American Hospital Association.\n\"Equipment allowance\" means the component of the property payment rate that is a payment for the use of depreciable movable equipment.\nThe equipment allowance per bed value is $10,000 adjusted annually for rate years beginning on or after January 1, 2021, by the percentage change indicated by the urban consumer price index for Minneapolis-St. Paul, as published by the Bureau of Labor Statistics (series 1982-84=100) for the two previous Julys. The computation for this annual adjustment is based on the data that is publicly available on November 1 immediately preceding the start of the rate year.\n\"Fair rental value system\" means a system that establishes a price for the use of a space based on an appraised value of the property. The price is established without consideration of the actual accounting cost to construct or remodel the property. The price is the nursing facility value, subject to limits, multiplied by an established rental rate.\n\"Fixed equipment\" means equipment affixed to the building and not subject to transfer, including but not limited to wiring, electrical fixtures, plumbing, elevators, and heating and air conditioning systems.\n\"Land improvement\" means improvement to the land surrounding the nursing facility directly used for nursing facility operations as specified in the land improvements table of the depreciation guidelines, if replacement of the land improvement is the responsibility of the nursing facility. Land improvement includes construction of auxiliary buildings including sheds, garages, storage buildings, and parking structures. Parking structures are a land improvement and included only in the land and land improvement value under section 256R.26, subdivision 4. Parking structures are not to be included in either the undepreciated replacement cost or depreciated replacement cost.\n(a) \"Rental rate\" means the percentage applied to the allowable value of the building, movable, and fixed equipment per year in the property payment rate calculation.\n(b) The rental rate is the sum of the 20-year treasury bond rate as published in the Federal Reserve Bulletin using the average for the calendar year preceding the rate year based on data publicly available on November 1 each year, plus a risk value of three percent.\n(c) Regardless of the result in paragraph (b), the rental rate must not be less than 7.5 percent or more than 12 percent.\n\"Shared area\" means square footage that a nursing facility shares with a nonnursing facility operation to provide a support service. The appraisals initially may include the full value of all shared areas. The undepreciated replacement cost and depreciated replacement cost established by the appraisals must be adjusted in the final nursing facility values to reflect only the nursing facility usage. The adjustment must be based on a Medicare-approved allocation basis for the type of service provided by each area. Shared areas outside the appraised space must be added to DRC, URC, and related square footage using the average of each value from the space in the appraisal.\n\"Threshold project\" means additions to a building or fixed equipment that are subject to the threshold project limits under section 256R.267, paragraph (a). Threshold project excludes land, land improvements, and depreciable movable equipment purchases.\n\"Undepreciated replacement cost\" or \"URC\" means the undepreciated replacement cost determined by the appraisal for building and fixed equipment using the commercial valuation system and appraisal firm.",
	"repealed": false
}