{
	"id": "515.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/515.19",
	"title": "515.19 CONTENTS OF BYLAWS; ANNUAL MEETING, REPORT.",
	"text": "The bylaws may provide for the following:\n(a) The election from among the apartment owners of a board of directors, the number of persons constituting the same, and that the terms of at least one-third of the directors shall expire annually; the powers and duties of the board; the compensation, if any, of the directors; the method of removal from office of directors; and whether or not the board may engage the services of a manager or managing agent.\n(b) Method of calling meetings of the apartment owners; what percentage, if other than a majority of apartment owners, shall constitute a quorum.\n(c) Election of a president from among the board of directors who shall preside over the meetings of the board of directors and of the association of apartment owners.\n(d) Election of a secretary who shall keep the minute book wherein resolutions shall be recorded.\n(e) Election of a treasurer who shall keep the financial records and books of account.\n(f) Maintenance, repair and replacement of the common areas and facilities and payments therefor, including the method of approving payment vouchers.\n(g) Manner of collecting from the apartment owners their share of the common expenses.\n(h) Designation and removal of personnel necessary for the maintenance, repair and replacement of the common areas and facilities.\n(i) Method of adopting and of amending administrative rules and rules governing the details of the operation and use of the common areas and facilities.\n(j) Such restrictions on and requirements respecting the use and maintenance of the apartments and the use of the common areas and facilities, not set forth in the declaration, as are designed to prevent unreasonable interference with the use of their respective apartments and of the common areas and facilities by the several apartment owners.\n(k) The percentage of votes required to amend the bylaws.\n(l) Other provisions as may be deemed necessary for the administration of the property consistent with sections 515.01 to 515.29.\nThe bylaws shall provide that the association of apartment owners shall meet at least once each year. The bylaws shall specify an officer who shall, at least 21 days in advance of any annual or regularly scheduled meeting and at least seven days in advance of any other meeting, send to each apartment owner notice of the time, place and complete agenda of the meeting. The notice shall be sent by United States mail to all apartment owners of record at the address of their respective apartments and to other addresses as any of them may have designated to the officer.\nThe bylaws shall provide that no vote in the association of apartment owners shall be deemed to inure to any apartment during the time when the apartment owner thereof is the association of apartment owners.\nThe bylaws shall provide that an annual report be prepared by the association of apartment owners, that a copy of the report be provided to each apartment owner, and that the report contains at a minimum the following:\n(a) a statement of any capital expenditures in excess of $1,000 anticipated by the association of apartment owners during the current year or succeeding two fiscal years;\n(b) a statement of the status and amount of any reserve for replacement fund and any portion of the fund designated for any specified project by the board of directors;\n(c) a copy of the statement of financial condition for the association of apartment owners for the last fiscal year;\n(d) a statement of the status of any pending suits or judgments in which the association of apartment owners is a party;\n(e) a statement of the insurance coverage provided by the association of apartment owners; and\n(f) a statement of any unpaid assessments by the association of apartment owners on individual apartments, identifying the apartment number and the amount of the unpaid assessment.",
	"repealed": false
}