{
	"id": "198.003",
	"url": "https://www.revisor.mn.gov/statutes/cite/198.003",
	"title": "198.003 POWERS AND DUTIES.",
	"text": "The commissioner shall determine policy and, subject to chapter 14, adopt, amend, and repeal rules for the governance of the homes. With respect to residents' administrative appeal time periods that are not established by statute, the commissioner may create by rule reasonable time periods within which a resident must appeal an administrative determination to the next administrative level. If the determination is not appealed within the time set by rule, the determination becomes final.\nThe commissioner shall take other action as provided by law.\n[Repealed, 2004 c 219 s 7]\nThe commissioner may allow veterans organizations or public or private social service, educational, or rehabilitation agencies or organizations and their clients to use surplus space on a home's campus, staff, and other resources of the commissioner and may require the participating agencies or organizations to pay for that use.\nMoney received by the commissioner under subdivision 3 must be deposited in the state treasury and credited to a veterans homes resources account in the special revenue fund. Money in the account is appropriated to the commissioner to operate, maintain, and make repairs at the campus used under subdivision 3, including payment of associated legal fees and expenses.\nThe commissioner is authorized to apply for and accept federal funding for purposes of this section.\n[Repealed, 2008 c 297 art 2 s 30]\n[Repealed, 2008 c 297 art 2 s 30]\n(a) The commissioner shall maximize the use of Medicare Part D to pay pharmacy costs for eligible veterans residing at the veterans homes.\n(b) The commissioner shall encourage eligible veterans to participate in the Medicare Part D program and assist veterans in obtaining Medicare Part D coverage.\n(c) The commissioner shall take any necessary steps to prevent an eligible veteran participating in Medicare Part D from receiving fewer benefits under Medicare Part D than they would have received under their existing Veterans Administration benefits.",
	"repealed": false
}