{
	"id": "204C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.10",
	"title": "204C.10 POLLING PLACE ROSTER; VOTER SIGNATURE CERTIFICATE; VOTER RECEIPT.",
	"text": "(a) An individual seeking to vote shall sign a polling place roster or voter signature certificate which states that the individual:\n(1) is at least 18 years old;\n(2) is a citizen of the United States;\n(3) has maintained residence in Minnesota for 20 days immediately preceding the election;\n(4) maintains residence at the address shown;\n(5) is not under a guardianship in which the court order revokes the individual's right to vote;\n(6) has not been found by a court of law to be legally incompetent to vote;\n(7) has the right to vote because, if the individual was convicted of a felony, the individual is not currently incarcerated for that conviction;\n(8) is registered; and\n(9) has not already voted in the election.\nThe roster must also state: \"I understand that deliberately providing false information is a felony punishable by not more than five years imprisonment and a fine of not more than $10,000, or both.\"\n(b) At the presidential nomination primary, the polling place roster must also state: \"I am in general agreement with the principles of the party for whose candidate I intend to vote.\" This statement must appear separately from the statements required in paragraph (a). The felony penalty provided for in paragraph (a) does not apply to this paragraph.\n(c) A judge may, before the applicant signs the roster or voter signature certificate, confirm the applicant's name, address, and date of birth.\n(d) After the applicant signs the roster or voter signature certificate, the judge shall give the applicant a voter's receipt. The voter shall deliver the voter's receipt to the judge in charge of ballots as proof of the voter's right to vote, and thereupon the judge shall hand to the voter the ballot. The voters' receipts must be maintained during the time for notice of filing an election contest.\n(e) Whenever a challenged status appears on the polling place roster, an election judge must ensure that the challenge is concealed or hidden from the view of any voter other than the voter whose status is challenged.",
	"repealed": false
}