{
	"id": "145.712",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.712",
	"title": "145.712 REQUIREMENTS FOR CONTACT LENSES PRESCRIPTIONS.",
	"text": "An optometrist or physician must provide a patient with a copy of the patient's prescription upon completion of the patient's eye examination and fitting. An optometrist or physician may refuse to give a patient a copy of the patient's prescription until after the patient has paid for the eye examination and fitting, but only if the optometrist or physician would have required immediate payment from that patient if the examination had revealed that no ophthalmic goods were required.\nA prescription written by an optometrist or physician must expire two years after it is written, unless a different expiration date is warranted by the patient's ocular health. If the prescription is valid for less than two years, the optometrist or physician must note the medical reason for the prescription's expiration date in the patient's record and must orally explain to the patient at the time of the eye examination the reason for the prescription's expiration date.\nAn optometrist or physician must promptly respond to any request received from a physician, optometrist, optician, or contact lens retailer to verify a patient's prescription information in order for the person requesting the information to accurately dispense the contact lenses. Verification must be requested by telephone, fax, or through electronic communications during the prescriber's normal business hours. Consistently failing to respond to verification requests within a reasonable period of time is grounds for disciplinary action by the respective regulatory board.\nWhen filling a contact lens prescription, no optometrist, physician, or contact lens retailer may:\n(1) substitute or in any way dispense a different contact lens than the contact lens ordered on the prescription;\n(2) dispense a contact lens for a period of time beyond the written expiration date; or\n(3) dispense contact lenses that are not based on prescription parameters pursuant to a valid prescription.\nA copy of the dispensing records must be kept on file at the dispensing location for a period of no less than two years.",
	"repealed": false
}