{
	"id": "65A.298",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.298",
	"title": "65A.298 HOMEOWNER'S INSURANCE; FORTIFIED PROGRAM STANDARDS.",
	"text": "(a) For purposes of this section the following term has the meaning given.\n(b) \"Insurable property\" means a residential property designated as meeting Fortified program standards that include a hail supplement as administered by the Insurance Institute for Business and Home Safety (IBHS).\n(a) An insurer must provide a premium discount or an insurance rate reduction to an owner who builds or locates a new insurable property in Minnesota.\n(b) An owner of insurable property claiming a premium discount or rate reduction under this subdivision must submit and maintain a certificate issued by IBHS showing proof of compliance with the Fortified program standards to the insurer prior to receiving the premium discount or rate reduction. At the time of policy renewal an insurer may require evidence that the issued certificate remains in good standing.\n(a) An insurer must provide a premium discount or insurance rate reduction to an owner who retrofits an existing property to meet the requirements to be an insurable property in Minnesota.\n(b) An owner of insurable property claiming a premium discount or rate reduction under this subdivision must submit a certificate issued by IBHS showing proof of compliance with the Fortified program standards to the insurer prior to receiving the premium discount or rate reduction.\n(a) A participating insurer must submit to the commissioner actuarially justified rates and a rating plan for a person who builds or locates a new insurable property in Minnesota.\n(b) A participating insurer must submit to the commissioner actuarially justified rates and a rating plan for a person who retrofits an existing property to meet the requirements to be an insurable property.\n(c) A participating insurer may offer, in addition to the premium discount and insurance rate reductions required under subdivisions 2 and 3, more generous mitigation adjustments to an owner of insurable property.\n(d) Any premium discount, rate reduction, or mitigation adjustment offered by an insurer under this section applies only to policies that include wind coverage and may be applied to: (1) only the portion of the premium for wind coverage; or (2) the total premium, if the insurer does not separate the premium for wind coverage in the insurer's rate filing.\n(e) A rate and rating plan submitted to the commissioner under this section must not be used until 60 days after the rate and rating plan has been filed with the commissioner, unless the commissioner approves the rate and rating plan before that time. A rating plan, rating classification, and territories applicable to insurance written by a participating insurer and any related statistics are subject to chapter 70A. When the commissioner is evaluating rate and rating plans submitted under this section, the commissioner must evaluate:\n(i) evidence of cost savings directly attributable to the Fortified program standards as administered by IBHS; and\n(ii) whether the cost savings are passed along in full to qualified policyholders.\n(f) A participating insurer must resubmit a rate and rating plan at least once every five years following the initial submission under this section.\n(g) The commissioner may annually publish the premium savings that policyholders experience pursuant to this section.\n(h) An insurer must provide the commissioner with all requested information necessary for the commissioner to meet the requirements of this subdivision.",
	"repealed": false
}