{
	"id": "609.5312",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.5312",
	"title": "609.5312 FORFEITURE OF PROPERTY ASSOCIATED WITH DESIGNATED OFFENSES.",
	"text": "(a) All personal property is subject to forfeiture if it was used or intended for use to commit or facilitate the commission of a designated offense. All money and other property, real and personal, that represent proceeds of a designated offense, and all contraband property, are subject to forfeiture, except as provided in this section.\n(b) All money used or intended to be used to facilitate the commission of a violation of section 609.322 or 609.324 or a violation of a local ordinance substantially similar to section 609.322 or 609.324 is subject to forfeiture.\n(c) The Department of Corrections Fugitive Apprehension Unit shall not seize real property for the purposes of forfeiture under paragraph (a).\n(a) As used in this subdivision, \"property\" has the meaning given in section 609.87, subdivision 6.\n(b) When a computer or a component part of a computer is used or intended for use to commit or facilitate the commission of a designated offense, the computer and all software, data, and other property contained in the computer are subject to forfeiture unless prohibited by the Privacy Protection Act, United States Code, title 42, sections 2000aa to 2000aa-12, or other state or federal law.\n(c) Regardless of whether a forfeiture action is initiated following the lawful seizure of a computer and related property, if the appropriate agency returns hardware, software, data, or other property to the owner, the agency may charge the owner for the cost of separating contraband from the computer or other property returned, including salary and contract costs. The agency may not charge these costs to an owner of a computer or related property who was not privy to the act or omission upon which the seizure was based, or who did not have knowledge of or consent to the act or omission, if the owner:\n(1) requests from the agency copies of specified legitimate data files and provides sufficient storage media; or\n(2) requests the return of a computer or other property less data storage devices on which contraband resides.\n(a) Property used by a person as a common carrier in the transaction of business as a common carrier is subject to forfeiture under this section only if the owner of the property is a consenting party to, or is privy to, the commission of a designated offense.\n(b) Property is subject to forfeiture under this section only if the owner was privy to the act or omission upon which the forfeiture is based, or the act or omission occurred with the owner's knowledge or consent.\n(c) Property encumbered by a bona fide security interest is subject to the interest of the secured party unless the party had knowledge of or consented to the act or omission upon which the forfeiture is based. A person claiming a security interest bears the burden of establishing that interest by clear and convincing evidence.\n(d) Notwithstanding paragraphs (b) and (c), property is not subject to forfeiture based solely on the owner's or secured party's knowledge of the act or omission upon which the forfeiture is based if the owner or secured party took reasonable steps to terminate use of the property by the offender.\n(a) A motor vehicle is subject to forfeiture under this subdivision if it was used to commit or facilitate, or used during the commission of, a violation of section 609.324 or a violation of a local ordinance substantially similar to section 609.324. A motor vehicle is subject to forfeiture under this subdivision only if the offense is established by proof of a criminal conviction for the offense. Except as otherwise provided in this subdivision, a forfeiture under this subdivision is governed by sections 609.531, 609.5312, and 609.5313.\n(b) When a motor vehicle subject to forfeiture under this subdivision is seized in advance of a judicial forfeiture order, a hearing before a judge or referee must be held within 96 hours of the seizure. Notice of the hearing must be given to the registered owner within 48 hours of the seizure. The prosecuting authority shall certify to the court, at or in advance of the hearing, that it has filed or intends to file charges against the alleged violator for violating section 609.324 or a local ordinance substantially similar to section 609.324. After conducting the hearing, the court shall order that the motor vehicle be returned to the owner if:\n(1) the prosecuting authority has failed to make the certification required by paragraph (b);\n(2) the owner of the motor vehicle has demonstrated to the court's satisfaction that the owner has a defense to the forfeiture, including but not limited to the defenses contained in subdivision 2; or\n(3) the court determines that seizure of the vehicle creates or would create an undue hardship for members of the owner's family.\n(c) If the defendant is acquitted or prostitution charges against the defendant are dismissed, neither the owner nor the defendant is responsible for paying any costs associated with the seizure or storage of the vehicle.\n(d) A vehicle leased or rented under section 168.27, subdivision 4, for a period of 180 days or less is not subject to forfeiture under this subdivision.\n(e) For purposes of this subdivision, seizure occurs either:\n(1) at the date at which personal service of process upon the registered owner is made; or\n(2) at the date when the registered owner has been notified by certified mail at the address listed in the Minnesota Department of Public Safety computerized motor vehicle registration records.\n(f) The Department of Corrections Fugitive Apprehension Unit shall not participate in paragraphs (a) to (e).\n(a) A motor vehicle is subject to forfeiture under this subdivision if it was used to commit a violation of section 609.487 and endanger life or property. A motor vehicle is subject to forfeiture under this subdivision only if the offense is established by proof of a criminal conviction for the offense. Except as otherwise provided in this subdivision, a forfeiture under this subdivision is governed by sections 609.531, 609.5312, 609.5313, and 609.5315, subdivision 6.\n(b) When a motor vehicle subject to forfeiture under this subdivision is seized in advance of a judicial forfeiture order, a hearing before a judge or referee must be held within 96 hours of the seizure. Notice of the hearing must be given to the registered owner within 48 hours of the seizure. The prosecuting authority shall certify to the court, at or in advance of the hearing, that it has filed or intends to file charges against the alleged violator for violating section 609.487. After conducting the hearing, the court shall order that the motor vehicle be returned to the owner if:\n(1) the prosecuting authority has failed to make the certification required by this paragraph;\n(2) the owner of the motor vehicle has demonstrated to the court's satisfaction that the owner has a defense to the forfeiture, including but not limited to the defenses contained in subdivision 2; or\n(3) the court determines that seizure of the vehicle creates or would create an undue hardship for members of the owner's family.\n(c) If the defendant is acquitted or the charges against the defendant are dismissed, neither the owner nor the defendant is responsible for paying any costs associated with the seizure or storage of the vehicle.\n(d) A vehicle leased or rented under section 168.27, subdivision 4, for a period of 180 days or less is not subject to forfeiture under this subdivision.\n(e) A motor vehicle that is an off-road recreational vehicle as defined in section 169A.03, subdivision 16, or a motorboat as defined in section 169A.03, subdivision 13, is not subject to paragraph (b).\n(f) For purposes of this subdivision, seizure occurs either:\n(1) at the date at which personal service of process upon the registered owner is made; or\n(2) at the date when the registered owner has been notified by certified mail at the address listed in the Minnesota Department of Public Safety computerized motor vehicle registration records.\n(g) The Department of Corrections Fugitive Apprehension Unit shall not seize a motor vehicle for the purposes of forfeiture under paragraphs (a) to (f).",
	"repealed": false
}