{
	"id": "299A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.41",
	"title": "299A.41 DEFINITIONS.",
	"text": "The definitions used in this section apply to sections 299A.41 to 299A.46.\nA \"dependent child\" means a person who is unmarried and who was either living with or was receiving support contributions from the public safety officer at the time of death, including a child by birth, a stepchild, an adopted child, or a posthumous child, and who is:\n(1) under 18 years of age;\n(2) over 18 years of age and incapable of self-support because of physical or mental disability; or\n(3) over 18 years of age and a student as defined by United States Code, title 5, section 8101.\n(a) \"Killed in the line of duty\" does not include deaths from natural causes, except as provided in this subdivision. In the case of a public safety officer, killed in the line of duty includes the death of a public safety officer caused by accidental means while the public safety officer is acting in the course and scope of duties as a public safety officer. Killed in the line of duty also means if a public safety officer dies as the direct and proximate result of a heart attack, stroke, or vascular rupture, that officer shall be presumed to have died as the direct and proximate result of a personal injury sustained in the line of duty if:\n(1) that officer, while on duty:\n(i) engaged in a situation, and that engagement involved nonroutine stressful or strenuous physical law enforcement, fire suppression, rescue, hazardous material response, emergency medical services, prison security, disaster relief, or other emergency response activity; or\n(ii) participated in a training exercise, and that participation involved nonroutine stressful or strenuous physical activity;\n(2) that officer died as a result of a heart attack, stroke, or vascular rupture suffered:\n(i) while engaging or participating under clause (1);\n(ii) while still on duty after engaging or participating under clause (1); or\n(iii) not later than 24 hours after engaging or participating under clause (1); and\n(3) the presumption is not overcome by competent medical evidence to the contrary.\n(b) \"Killed in the line of duty\" also means that the officer died due to suicide:\n(1) secondary to a diagnosis of posttraumatic stress disorder as described in the most recent edition of the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association; or\n(2) within 45 days of the end of exposure, while on duty, to a traumatic event.\n\"Public safety officer\" includes:\n(1) a peace officer defined in section 626.84, subdivision 1, paragraph (c) or (d);\n(2) a correction officer employed at a correctional facility and charged with maintaining the safety, security, discipline, and custody of inmates at the facility;\n(3) a corrections staff person working in a public agency and supervising offenders in the community as defined in sections 243.05, subdivision 6; 244.19, subdivision 1; and 401.01, subdivision 2;\n(4) an individual employed on a full-time basis by the state or by a fire department of a governmental subdivision of the state, who is engaged in any of the following duties:\n(i) firefighting;\n(ii) emergency motor vehicle operation;\n(iii) investigation into the cause and origin of fires;\n(iv) the provision of emergency medical services; or\n(v) hazardous material responder;\n(5) a legally enrolled member of a volunteer fire department or member of an independent nonprofit firefighting corporation who is engaged in the hazards of firefighting;\n(6) a good samaritan while complying with the request or direction of a public safety officer to assist the officer;\n(7) a reserve police officer or a reserve deputy sheriff while acting under the supervision and authority of a political subdivision;\n(8) a driver or attendant with a licensed basic or advanced life-support transportation service who is engaged in providing emergency care;\n(9) a first responder who is certified by the director of the Office of Emergency Medical Services to perform basic emergency skills before the arrival of a licensed ambulance service and who is a member of an organized service recognized by a local political subdivision to respond to medical emergencies to provide initial medical care before the arrival of an ambulance; and\n(10) a person, other than a state trooper, employed by the commissioner of public safety and assigned to the State Patrol, whose primary employment duty is either Capitol security or the enforcement of commercial motor vehicle laws and regulations.\n\"Spouse\" means a person legally married to the decedent at the time of the decedent's death.\n\"Traumatic event\" means:\n(1) a homicide, suicide, or the violent or gruesome death of another individual, including but not limited to a death resulting from a mass casualty event, mass fatality event, or mass shooting;\n(2) a harrowing circumstance posing an extraordinary and significant danger or threat to the life of or of serious bodily harm to any individual, including but not limited to a death resulting from a mass casualty event, mass fatality event, or mass shooting; or\n(3) an act of criminal sexual violence committed against any individual.",
	"repealed": false
}