{
	"id": "176.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.83",
	"title": "176.83 RULES.",
	"text": "In addition to any other section under this chapter giving the commissioner the authority to adopt rules, the commissioner may adopt, amend, or repeal rules to implement the provisions of this chapter. The rules include but are not limited to the rules listed in this section.\nRules necessary to implement and administer section 176.102, including the establishment of qualifications necessary to be a qualified rehabilitation consultant and the requirements to be an approved registered vendor of rehabilitation services.\nThe rules may also provide for penalties to be imposed by the commissioner against insurers or self-insured employers who fail to provide rehabilitation consultation to employees pursuant to section 176.102.\nThese rules may also establish criteria for determining \"reasonable moving expenses\" under section 176.102.\nThe rules shall also establish criteria, guidelines, methods, or procedures to be met by an employer or insurer in providing the initial rehabilitation consultation required under this chapter which would permit the initial consultation to be provided by an individual other than a qualified rehabilitation consultant. In the absence of rules regarding an initial consultation this consultation shall be conducted pursuant to section 176.102.\nRules establishing standards for reviewing and evaluating the clinical consequences of services provided by qualified rehabilitation consultants, approved registered vendors of rehabilitation services, and services provided to an employee by health care providers.\nRules establishing standards and procedures for determining whether or not charges for health services or rehabilitation services rendered under this chapter are excessive. In this regard, the standards and procedures shall be structured to determine what is necessary to encourage providers of health services and rehabilitation services to develop and deliver services for the rehabilitation of injured employees.\nThe procedures shall include standards for evaluating hospital care, other health care and rehabilitation services to insure that quality hospital, other health care, and rehabilitation is available and is provided to injured employees.\n(a) In consultation with the Medical Services Review Board or the rehabilitation review panel, the commissioner shall adopt rules establishing standards and procedures for health care provider treatment. The rules shall apply uniformly to all providers including those providing managed care under section 176.1351. The rules shall be used to determine whether a provider of health care services and rehabilitation services, including a provider of medical, chiropractic, podiatric, surgical, hospital, or other services, is performing procedures or providing services at a level or with a frequency that is excessive, unnecessary, or inappropriate under section 176.135, subdivision 1, based upon accepted medical standards for quality health care and accepted rehabilitation standards.\n(b) The rules shall include, but are not limited to, the following:\n(1) criteria for diagnosis and treatment of the most common work-related injuries including, but not limited to, low back injuries and upper extremity repetitive trauma injuries;\n(2) criteria for surgical procedures including, but not limited to, diagnosis, prior conservative treatment, supporting diagnostic imaging and testing, and anticipated outcome criteria;\n(3) criteria for use of appliances, adaptive equipment, and use of health clubs or other exercise facilities;\n(4) criteria for diagnostic imaging procedures;\n(5) criteria for inpatient hospitalization;\n(6) criteria for treatment of chronic pain;\n(7) criteria for the long-term use of opioids or other scheduled medications to alleviate intractable pain and improve function, including the use of written contracts between the injured worker and the health care provider who prescribes the medication; and\n(8) criteria for treatment of post-traumatic stress disorder. In developing such treatment criteria, the commissioner and the Medical Services Review Board shall consider the guidance set forth in the American Psychological Association's most recently adopted Clinical Practice Guideline for the Treatment of Posttraumatic Stress Disorder (PTSD) in Adults. The commissioner shall adopt such rules using the expedited rulemaking process in section 14.389, including subdivision 5, to commence promptly upon May 20, 2018. Such rules shall apply to employees with all dates of injury who receive treatment after the commissioner adopts the rules. In consultation with the Medical Services Review Board, the commissioner shall review and update the rules governing criteria for treatment of post-traumatic stress disorder each time the American Psychological Association adopts a significant change to their Clinical Practice Guideline for the Treatment of PTSD in Adults, using the expedited rulemaking process in section 14.389, including subdivision 5.\n(c) If it is determined by the payer that the level, frequency, or cost of a procedure or service of a provider is excessive, unnecessary, or inappropriate according to the standards established by the rules, the provider shall not be paid for the procedure, service, or cost by an insurer, self-insurer, or group self-insurer, and the provider shall not be reimbursed or attempt to collect reimbursement for the procedure, service, or cost from any other source, including the employee, another insurer, the special compensation fund, or any government program unless the commissioner or compensation judge determines at a hearing or administrative conference that the level, frequency, or cost was not excessive under the rules in which case the insurer, self-insurer, or group self-insurer shall make the payment deemed reasonable.\n(d) A rehabilitation provider who is determined by the rehabilitation review panel board, after hearing, to be consistently performing procedures or providing services at an excessive level or cost may be prohibited from receiving any further reimbursement for procedures or services provided under this chapter. A prohibition imposed on a provider under this subdivision may be grounds for revocation or suspension of the provider's license or certificate of registration to provide health care or rehabilitation service in Minnesota by the appropriate licensing or certifying body. The commissioner and Medical Services Review Board shall review excessive, inappropriate, or unnecessary health care provider treatment under section 176.103.\nRules requiring insurers, self-insurers, and group self-insurers to report medical and other data necessary to implement the procedures required by this chapter.\nRules establishing procedures and standards for the certification of physicians, chiropractors, podiatrists, and other health care providers in order to assure the coordination of treatment, rehabilitation, and other services and requirements of chapter 176 for carrying out the purposes and intent of this chapter.\nRules necessary for implementing and administering the provisions of Minnesota Statutes 1990, section 176.131, Minnesota Statutes 1994, section 176.132, sections 176.238 and 176.239; sections 176.251 and 176.66, and rules regarding proper allocation of compensation under section 176.111. Under the rules adopted under section 176.111 a party may petition for a hearing before a compensation judge to determine the proper allocation. In this case the compensation judge may order a different allocation than prescribed by rule.\nRules establishing standards or criteria under which a physician, podiatrist, or chiropractor is selected or under which a change of physician, podiatrist, or chiropractor is allowed under section 176.135, subdivision 2.\nRules to govern the procedure for intervention pursuant to section 176.361.\nJoint rules with either or both the Workers' Compensation Court of Appeals and the chief administrative law judge which may be necessary in order to provide for the orderly processing of claims or petitions made or filed pursuant to this chapter.\nRules establishing criteria to be used by the division, compensation judge, and court of appeals to determine \"independent contractor.\"\nThe chief administrative law judge shall adopt rules relating to procedures in matters pending before a compensation judge in the Office of Administrative Hearings.\nThe commissioner may adopt rules regarding requirements which must be met by individuals who are employed by insurers or self-insurers or claims servicing or adjusting agencies and who work as claims adjusters in the field of workers' compensation insurance.\n[Deleted, 1995 c 233 art 2 s 56]\nThe commissioner may prescribe forms and other reporting procedures to be used by an employer, insurer, medical provider, qualified rehabilitation consultant, approved vendor of rehabilitation services, attorney, employee, or other person subject to the provisions of this chapter.",
	"repealed": false
}