{
	"id": "174.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.52",
	"title": "174.52 LOCAL ROAD IMPROVEMENT FUND.",
	"text": "A local road improvement fund is created in the state treasury. The fund consists of money transferred to the fund through appropriation, gift, or grant.\nA trunk highway corridor projects account is established in the local road improvement fund. Money in the account is annually appropriated to the commissioner of transportation for expenditure as specified in this section. Money in the account must be used as grants or loans to statutory or home rule charter cities, towns, counties, and federally recognized Indian Tribes to assist in paying the local or Tribal share of trunk highway projects that have local or Tribal costs that are directly or partially related to the trunk highway improvement and that are not funded or are only partially funded with other state and federal funds. The commissioner shall determine the amount of the local or Tribal share of costs eligible for assistance from the account.\n(a) The commissioner must establish a local road improvement program advisory committee consisting of the following members:\n(1) one county commissioner;\n(2) one county engineer;\n(3) one city engineer;\n(4) one city council member or city administrator representing a city with a population over 5,000;\n(5) one city council member or city administrator representing a city with a population under 5,000; and\n(6) one town board member appointed by the Minnesota Association of Townships.\n(b) The advisory committee must provide recommendations to the commissioner regarding expenditures from the accounts established in this section.\nA local road account for routes of regional significance is established in the local road improvement fund. Money in the account is annually appropriated to the commissioner of transportation for expenditure as specified in this section. Money in the account must be used as grants or loans to statutory or home rule charter cities, towns, counties, and federally recognized Indian Tribes to assist in paying the costs of constructing or reconstructing city streets, county highways, town roads, or Tribal roads with statewide or regional significance that have not been fully funded through other state, federal, local, or Tribal funding sources.\n(a) A rural road safety account is established in the local road improvement fund. Money in the account is annually appropriated to the commissioner of transportation for expenditure as specified in this subdivision. Money in the account must be used as grants to counties to assist in paying the costs of capital improvement projects on county state-aid highways that are intended primarily to reduce traffic crashes, deaths, injuries, and property damage.\n(b) The commissioner shall establish procedures for counties to apply for grants from the rural road safety account and criteria to be used to select projects for funding. The commissioner shall establish these procedures and criteria in consultation with representatives appointed by the Association of Minnesota Counties. Eligibility for project selection must be based on the ability of each proposed project to reduce the frequency and severity of crashes.\n(c) Money in the account must be allocated in each fiscal year as follows:\n(1) one-third of money in the account must be used for projects in the counties of Anoka, Chisago, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington; and\n(2) the remainder must be used for projects elsewhere in the state.\n(a) The commissioner shall establish procedures for statutory or home rule charter cities, towns, counties, and federally recognized Indian Tribes to apply for grants or loans from the fund and criteria to be used to select projects for funding. The commissioner must publish the procedures on the department's website. The commissioner shall establish these procedures and criteria in consultation with representatives appointed by the Association of Minnesota Counties, League of Minnesota Cities, Minnesota Association of Townships, the appropriate state agency as needed, and Tribal representatives under section 10.65. The criteria for determining project priority and the amount of a grant or loan must be based upon consideration of:\n(1) the availability of other state, federal, local, and Tribal funds;\n(2) the regional significance of the route;\n(3) effectiveness of the proposed project in eliminating a transportation system deficiency;\n(4) the number of persons who will be positively impacted by the project;\n(5) the project's contribution to other local, regional, state, or Tribal economic development or redevelopment efforts including livestock and other agricultural operations permitted after July 1, 2005; and\n(6) ability of the local unit of government or federally recognized Indian Tribe to adequately provide for the safe operation and maintenance of the facility upon project completion.\n(b) The commissioner must publish on the department's website a list of all projects that were considered for funding. The list must identify the projects that were selected and the projects that were not selected. For each project that was not selected, the commissioner must include the reason it was not selected. This paragraph does not apply when there is no funding from any source for the program in a fiscal year.\nA sum of 0.25 percent of the total amount in the fund, other than amounts deposited in the fund from the proceeds from the sale of state bonds, is available to be used for administrative costs incurred by the department in carrying out the provisions of this section.",
	"repealed": false
}