{
	"id": "128D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/128D.05",
	"title": "128D.05 BOARD: NUMBER, TERM, PAY, VACANCIES.",
	"text": "(a) The board of education of such district shall consist of seven directors. The term of office of each director shall be four years or until a successor is elected and qualified. The directors shall receive such compensation as may be fixed by the board of education.\n(b) The governing body of Special School District No. 1 may provide for election of four of its directors in 1994 and subsequent years for four-year terms, and election of three of its directors in 1996 and subsequent years for four-year terms. To accomplish this change, the governing body may provide that the terms of office for directors elected in 1991 will expire January 1, 1995, and that the terms of office for directors to be elected in 1993 will expire January 1, 1997.\nA proposed change in election years adopted under subdivision 1 is effective 240 days after passage and publication or at a later date fixed in the proposal. Within 180 days after passage and publication of the proposal, a petition requesting a referendum on the proposal may be filed with the school district clerk. The petition must be signed by eligible voters equal in number to five percent of the total number of votes cast in the city of Minneapolis at the most recent state general election. If the requisite petition is filed within the prescribed period, the proposal does not become effective until it is approved by a majority of the voters voting on the question at a general or special election held on a date authorized by section 205A.05, subdivision 1a. If the petition is filed, the governing body may reconsider its action in adopting the proposal.\nIn case any vacancy occurs in the office of school director because of death, resignation, or cessation of residence in the district, or any other cause, so that after the next general school election following such vacancy there shall be remaining at least two years of the unexpired term, a school director shall be elected at the next general school election to fill the place of such director, but until such election, or if no election is to be had under the foregoing provisions or because of the lack of time to comply with the election requirements when an election is pending, the remaining directors shall fill such vacancy. The director so appointed shall hold office until the first business day in January following the election of a successor, or until that successor qualifies.",
	"repealed": false
}