{
	"id": "144.343",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.343",
	"title": "144.343 PREGNANCY, VENEREAL DISEASE, ALCOHOL OR DRUG ABUSE, ABORTION.",
	"text": "Any minor may give effective consent for medical, mental and other health services to determine the presence of or to treat pregnancy and conditions associated therewith, venereal disease, alcohol and other drug abuse, and the consent of no other person is required.\nNotwithstanding the provisions of section 13.02, subdivision 8, no abortion operation shall be performed upon an unemancipated minor or upon a woman for whom a guardian has been appointed pursuant to sections 524.5-101 to 524.5-502 because of a finding of incapacity, until at least 48 hours after written notice of the pending operation has been delivered in the manner specified in subdivisions 2 to 4.\n(a) The notice shall be addressed to the parent at the usual place of abode of the parent and delivered personally to the parent by the physician or an agent.\n(b) In lieu of the delivery required by paragraph (a), notice shall be made by certified mail addressed to the parent at the usual place of abode of the parent with return receipt requested and restricted delivery to the addressee which means postal employee can only deliver the mail to the authorized addressee. Time of delivery shall be deemed to occur at 12 o'clock noon on the next day on which regular mail delivery takes place, subsequent to mailing.\n[See Note.]\n(a) For purposes of this section, \"parent\" means both parents of the pregnant woman if they are both living, one parent of the pregnant woman if only one is living or if the second one cannot be located through reasonably diligent effort, or the guardian or conservator if the pregnant woman has one.\n(b) For purposes of this section, \"abortion\" means the use of any means to terminate the pregnancy of a woman known to be pregnant with knowledge that the termination with those means will, with reasonable likelihood, cause the death of the fetus and \"fetus\" means any individual human organism from fertilization until birth.\nNo notice shall be required under this section if:\n(1) the attending physician certifies in the pregnant woman's medical record that the abortion is necessary to prevent the woman's death and there is insufficient time to provide the required notice; or\n(2) the abortion is authorized in writing by the person or persons who are entitled to notice; or\n(3) the pregnant minor woman declares that she is a victim of sexual abuse, neglect, or physical abuse as defined in chapter 260E. Notice of that declaration shall be made to the proper authorities as provided in section 260E.06.\nPerformance of an abortion in violation of this section shall be a misdemeanor and shall be grounds for a civil action by a person wrongfully denied notification. A person shall not be held liable under this section if the person establishes by written evidence that the person relied upon evidence sufficient to convince a careful and prudent person that the representations of the pregnant woman regarding information necessary to comply with this section are bona fide and true, or if the person has attempted with reasonable diligence to deliver notice, but has been unable to do so.\nIf subdivision 2 of this law is ever temporarily or permanently restrained or enjoined by judicial order, subdivision 2 shall be enforced as though the following paragraph were incorporated as paragraph (c) of that subdivision; provided, however, that if such temporary or permanent restraining order or injunction is ever stayed or dissolved, or otherwise ceases to have effect, subdivision 2 shall have full force and effect, without being modified by the addition of the following substitute paragraph which shall have no force or effect until or unless an injunction or restraining order is again in effect.\n(c)(1) If such a pregnant woman elects not to allow the notification of one or both of her parents or guardian or conservator, any judge of a court of competent jurisdiction shall, upon petition, or motion, and after an appropriate hearing, authorize a physician to perform the abortion if said judge determines that the pregnant woman is mature and capable of giving informed consent to the proposed abortion. If said judge determines that the pregnant woman is not mature, or if the pregnant woman does not claim to be mature, the judge shall determine whether the performance of an abortion upon her without notification of her parents, guardian, or conservator would be in her best interests and shall authorize a physician to perform the abortion without such notification if said judge concludes that the pregnant woman's best interests would be served thereby.\n(2) Such a pregnant woman may participate in proceedings in the court on her own behalf, and the court may appoint a guardian ad litem for her. The court shall, however, advise her that she has a right to court appointed counsel, and shall, upon her request, provide her with such counsel.\n(3) Proceedings in the court under this section shall be confidential and shall be given such precedence over other pending matters so that the court may reach a decision promptly and without delay so as to serve the best interests of the pregnant woman. A judge of the court who conducts proceedings under this section shall make in writing specific factual findings and legal conclusions supporting the decision and shall order a record of the evidence to be maintained including the judge's own findings and conclusions.\n(4) An expedited confidential appeal shall be available to any such pregnant woman for whom the court denies an order authorizing an abortion without notification. An order authorizing an abortion without notification shall not be subject to appeal. No filing fees shall be required of any such pregnant woman at either the trial or the appellate level. Access to the trial court for the purposes of such a petition or motion, and access to the appellate courts for purposes of making an appeal from denial of the same, shall be afforded such a pregnant woman 24 hours a day, seven days a week.\nIf any provision, word, phrase or clause of this section or the application thereof to any person or circumstance shall be held invalid, such invalidity shall not affect the provisions, words, phrases, clauses or application of this section which can be given effect without the invalid provision, word, phrase, clause, or application, and to this end the provisions, words, phrases, and clauses of this section are declared to be severable.",
	"repealed": false
}