{
	"id": "123A.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.58",
	"title": "123A.58 COMMON DISTRICT TO INDEPENDENT DISTRICT.",
	"text": "If six or more eligible voters of a common district desire to change the organization of their district to an independent district, they may call for a vote upon the question at the next annual meeting by filing a petition therefor with the clerk. In the notice for the meeting, the clerk shall include a statement that the question will be voted upon at the meeting.\nAt the annual meeting, if a majority of the votes cast on the question favors the conversion to an independent district, a board of six members shall be elected. Nominations may be made from the floor of the meeting and election shall be by secret ballot. All board members elected at this meeting shall serve for terms expiring on the third Tuesday in the next May following the election on which date a regular annual election shall be held in the manner provided by law. At this first annual election for independent districts, six directors shall be elected, two to hold office until July 1 following the next annual election, two to hold office until the expiration of one year from said July 1 and two to hold office until the expiration of two years from said July 1; the time which each director shall hold office being designated on the ballot.\nIf the organization of the district is changed from common to independent at the meeting, the clerk shall notify the auditor and the commissioner.\nUpon receipt of such notification, the commissioner shall assign a new identification number to the district and shall notify the auditor and the clerk of the district thereof.\nAs of the date of election, if a majority of votes cast on the question favor the conversion to an independent district, the classification of the district is changed from common to independent. Title to all the property, real and personal, of the common district passes to the independent district and all current outstanding contractual obligations, including the bonded indebtedness, if any, of the common district, together with any legally valid and enforceable claims against the common district are imposed on the independent district.\nUpon receipt of the identification number from the commissioner, the clerk of the district shall record such change of number with the county recorder in any county in which the common district owns any real estate.",
	"repealed": false
}