{
	"id": "299A.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.45",
	"title": "299A.45 EDUCATION BENEFIT.",
	"text": "A person is eligible to receive educational benefits under this section if the person:\n(1) is certified under section 299A.44 and in compliance with this section and rules of the commissioner of public safety and the Minnesota Office of Higher Education;\n(2) is enrolled in an undergraduate degree or certificate program after June 30, 1990, or a graduate degree or certificate program after June 30, 2011, at an eligible Minnesota institution as provided in section 136A.101, subdivision 4;\n(3) has not received benefits for the maximum duration specified in subdivision 4; and\n(4) is related in one of the following ways to a public safety officer killed in the line of duty on or after January 1, 1973:\n(i) as a dependent child less than 23 years of age;\n(ii) as a surviving spouse; or\n(iii) as a dependent child less than 30 years of age who has served on active military duty 181 consecutive days or more and has been honorably discharged or released to the dependent child's reserve or National Guard unit.\n(a) The amount of the award is the lesser of:\n(1) the average tuition and fees charged by the institution; or\n(2) the tuition maximums established by law for the state grant program under section 136A.121. The tuition maximum for graduate study is the maximum established by law for the state grant program for four-year programs.\n(b) An award under this subdivision must not affect a recipient's eligibility for a state grant under section 136A.121.\n(c) For the purposes of this subdivision, \"fees\" include only those fees that are mandatory and charged to all students attending the institution.\n(d) For the purpose of benefits awarded under this section, \"full time\" for a graduate program is eight or more credits per term or the equivalent.\nOn proof of eligibility for this program, an eligible institution, on behalf of the student, shall request payment of the award from the Minnesota Office of Higher Education. An institution must not request payment unless the student is enrolled in or has completed the term for which the payment is intended.\nEach award must be given for one academic year and is renewable for a maximum of eight semesters or the equivalent. A student who withdraws from enrollment for active military service or for a major illness, while under the care of a medical professional, that substantially limits the student's ability to complete the term is entitled to an additional semester or the equivalent of grant eligibility. An award must not be given to a dependent child who is 23 years of age or older on the first day of the academic year.",
	"repealed": false
}