{
	"id": "256B.763",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.763",
	"title": "256B.763 CRITICAL ACCESS MENTAL HEALTH RATE INCREASE.",
	"text": "(a) For services defined in paragraph (b) and rendered on or after July 1, 2007, payment rates shall be increased by 23.7 percent over the rates in effect on January 1, 2006, for:\n(1) psychiatrists and advanced practice registered nurses with a psychiatric specialty;\n(2) community mental health centers under section 256B.0625, subdivision 5; and\n(3) mental health clinics certified under section 245I.20, or hospital outpatient psychiatric departments that are designated as essential community providers under section 62Q.19.\n(b) This increase applies to group skills training when provided as a component of children's therapeutic services and support, psychotherapy, medication management, evaluation and management, diagnostic assessment, explanation of findings, psychological testing, neuropsychological services, direction of behavioral aides, and inpatient consultation.\n(c) This increase does not apply to rates that are governed by section 256B.0625, subdivision 30, or 256B.761, paragraph (b), other cost-based rates, rates that are negotiated with the county, rates that are established by the federal government, or rates that increased between January 1, 2004, and January 1, 2005.\n(d) Payment rates shall be increased by 23.7 percent over the rates in effect on December 31, 2007, for:\n(1) medication education services provided on or after January 1, 2008, by adult rehabilitative mental health services providers certified under section 256B.0623; and\n(2) mental health behavioral aide services provided on or after January 1, 2008, by children's therapeutic services and support providers certified under section 256B.0943.\n(e) For services defined in paragraph (b) and rendered on or after January 1, 2008, by children's therapeutic services and support providers certified under section 256B.0943 and not already included in paragraph (a), payment rates shall be increased by 23.7 percent over the rates in effect on December 31, 2007.\n(f) Payment rates shall be increased by 2.3 percent over the rates in effect on December 31, 2007, for individual and family skills training provided on or after January 1, 2008, by children's therapeutic services and support providers certified under section 256B.0943.\n(g) For services described in paragraphs (b), (d), and (f) and rendered on or after July 1, 2017, payment rates for mental health clinics certified under section 245I.20 that are not designated as essential community providers under section 62Q.19 shall be equal to payment rates for mental health clinics certified under section 245I.20 that are designated as essential community providers under section 62Q.19. In order to receive increased payment rates under this paragraph, a provider must demonstrate a commitment to serve low-income and underserved populations by:\n(1) charging for services on a sliding-fee schedule based on current poverty income guidelines; and\n(2) not restricting access or services because of a client's financial limitation.\n(h) For services identified under this section that are rendered by providers identified under this section, managed care plans and county-based purchasing plans shall reimburse the providers at a rate that is at least equal to the fee-for-service payment rate. The commissioner shall monitor the effect of this requirement on the rate of access to the services delivered by mental health providers.\nThe critical access mental health rate add-on under this section must be reduced according to the following schedule:\n(1) effective for services provided on or after January 1, 2025, the rate add-on is reduced to 11.85 percent;\n(2) effective for services provided on or after January 1, 2026, the rate add-on is reduced to 5.92 percent; and\n(3) effective for services provided on or after January 1, 2027, the rate add-on is zero percent.",
	"repealed": false
}