{
	"id": "256P.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.04",
	"title": "256P.04 DOCUMENTING, VERIFYING, AND RECERTIFYING ELIGIBILITY.",
	"text": "Participants who receive Minnesota supplemental aid and who maintain Supplemental Security Income eligibility under chapters 256D and 256I are exempt from the reporting requirements of this section, except that the policies and procedures for transfers of assets are those used by the medical assistance program under section 256B.0595. Participants who receive child care assistance under chapter 142E are exempt from the requirements of this section.\nAn agency must offer, in person or by mail, the application forms prescribed by the commissioner as soon as a person makes a written or oral inquiry about assistance. Applications must be received by the agency as a signed written application, an application submitted by telephone, or an application submitted through Internet telepresence. When a person submits an application by telephone or through Internet telepresence, the agency must receive a signed written application within 30 days of the date that the person submitted the application by telephone or through Internet telepresence.\nAn agency must only require verification of information necessary to determine eligibility and the amount of the assistance payment. If necessary, the agency shall assist the applicant or participant in obtaining verifications and required documents when the applicant or participant is unable to do so.\nThe applicant or participant must document the information required under subdivisions 4 to 7 or authorize the agency to verify the information. The applicant or participant has the burden of providing documentary evidence to verify eligibility. The agency must accept a signed personal statement from the applicant or participant when determining personal property values under section 256P.02. The signed personal statement must include general penalty warnings and a disclaimer that any false or misrepresented information is subject to prosecution for fraud under sections 609.52 and 609.821 and perjury under section 609.48.\n(a) The agency shall verify the following at application:\n(1) identity of adults;\n(2) age, if necessary to determine eligibility;\n(3) immigration status;\n(4) income;\n(5) spousal support and child support payments made to persons outside the household;\n(6) vehicles;\n(7) checking and savings accounts, including but not limited to any business accounts used to pay expenses not related to the business;\n(8) inconsistent information, if related to eligibility;\n(9) residence; and\n(10) Social Security number.\n(b) Applicants who are qualified noncitizens and victims of domestic violence as defined under section 142G.02, subdivision 80, clauses (8) and (9), are not required to verify the information in paragraph (a), clause (10). When a Social Security number is not provided to the agency for verification, this requirement is satisfied when each member of the assistance unit cooperates with the procedures for verification of Social Security numbers, issuance of duplicate cards, and issuance of new numbers which have been established jointly between the Social Security Administration and the commissioner.\nIn addition to subdivision 4, the agency shall verify the following for programs under chapter 142G:\n(1) the presence of the minor child in the home, if questionable;\n(2) the relationship of a minor child to caregivers in the assistance unit;\n(3) pregnancy, if related to eligibility;\n(4) school attendance, if related to eligibility;\n(5) a claim of family violence, if used as a basis to qualify for the family violence waiver under chapter 142G; and\n(6) disability, if used as the basis for reducing the hourly participation requirements under section 142G.51, subdivision 1, or for the type of activity included in an employment plan under section 142G.56, subdivision 2.\nIf there is inconsistent information known to the agency when reporting personal property under section 256P.02, an agency must require the applicant or participant to document the information required under section 256P.02 or authorize the county agency to verify the information. The applicant or participant has the burden of providing documentary evidence to verify eligibility. The agency shall assist the applicant or participant in obtaining required documents when the applicant or participant is unable to do so.\nWhen the agency verifies inconsistent information under subdivision 4, paragraph (a), clause (8); subdivision 6; or subdivision 8, clause (3), the reason for verifying the information must be documented in the financial case record.\nThe agency shall recertify eligibility annually. During recertification and reporting under section 256P.10, the agency shall verify the following:\n(1) income, unless excluded, including self-employment earnings;\n(2) assets when the value is within $200 of the asset limit; and\n(3) inconsistent information, if related to eligibility.\n[See Note.]\nIn addition to subdivision 8, the agency shall verify the following for programs under chapter 256J:\n(1) the presence of the minor child in the home, if questionable; and\n(2) whether a single-caregiver household meets the requirements in section 142G.75, subdivision 3.\nA participant must complete forms prescribed by the commissioner which are required for recertification of eligibility according to subdivisions 8 and 9. An agency must end benefits when the participant fails to submit the recertification form and verifications before the end of the certification period. If the participant submits the recertification form within 30 days of the termination of benefits, benefits must be reinstated and made available retroactively for the full benefit month.\n(a) When a participant is required to complete a household report form, the following paragraphs apply.\n(b) If the agency receives an incomplete household report form, the agency must immediately contact the participant by phone or in writing to acquire the necessary information to complete the form.\n(c) The automated eligibility system must send a notice of proposed termination of assistance to the participant if a complete household report form is not received by the agency. The automated notice must be mailed to the participant by approximately the 16th of the month. When a participant submits an incomplete form on or after the date a notice of proposed termination has been sent, the termination is valid unless the participant submits a complete form before the end of the month.\n(d) The submission of a household report form is considered to have continued the participant's application for assistance if a complete household report form is received within a calendar month after the month in which the form was due. Assistance shall be paid for the period beginning with the first day of that calendar month.\n(e) An agency must allow good cause exemptions for a participant required to complete a household report form when any of the following factors cause a participant to fail to submit a completed household report form before the end of the month in which the form is due:\n(1) an employer delays completion of employment verification;\n(2) the agency does not help a participant complete the household report form when the participant asks for help;\n(3) a participant does not receive a household report form due to a mistake on the part of the department or the agency or a reported change in address;\n(4) a participant is ill or physically or mentally incapacitated; or\n(5) some other circumstance occurs that a participant could not avoid with reasonable care which prevents the participant from providing a completed household report form before the end of the month in which the form is due.\nAn agency must not request information about an applicant or participant that is not of public record from a source other than agencies, the department, or the United States Department of Health and Human Services without the applicant's or participant's prior written consent. An applicant's signature on an application form constitutes consent for contact with the sources specified on the application. An agency may use a single consent form to contact a group of similar sources, such as banks or insurance agencies, but the sources to be contacted must be identified by the agency prior to requesting an applicant's consent.\nAgencies, in consultation with the commissioners of human services and children, youth, and families, shall provide notification to undocumented persons regarding the release of personal data to the United States Citizenship and Immigration Services and develop protocols regarding the release or sharing of data about undocumented persons with the United States Citizenship and Immigration Services as required under sections 404, 411A, and 434 of the Personal Responsibility and Work Opportunity Reconciliation Act of 1996.\nThe commissioner shall comply with the reporting requirements under United States Code, title 42, section 611a, and any federal regulation or guidance adopted under that law.\nThe agency may accept a signed personal statement from the applicant or participant explaining the reasons that the documentation requested in subdivision 3 is unavailable as sufficient documentation at the time of application, recertification, or change related to eligibility only for the following factors:\n(1) a claim of family violence, if used as a basis to qualify for the family violence waiver;\n(2) relationship of a minor child to caregivers in the assistance unit;\n(3) citizenship status from a noncitizen who reports to be, or is identified as, a victim of severe forms of trafficking in persons, if the noncitizen reports that the noncitizen's immigration documents are being held by an individual or group of individuals against the noncitizen's will. The noncitizen must follow up with the Office of Refugee Resettlement (ORR) to pursue certification. If verification that certification is being pursued is not received within 30 days, the case must be closed and the agency shall pursue overpayments. The ORR documents certifying the noncitizen's status as a victim of severe forms of trafficking in persons, or the reason for the delay in processing, must be received within 90 days, or the case must be closed and the agency shall pursue overpayments; and\n(4) other documentation unavailable for reasons beyond the control of the applicant or participant. The applicant or participant must have made reasonable attempts to obtain the documents requested under subdivision 3.\nPayments of funds made according to litigation and subsequent appropriation by the United States Congress to compensate members of Indian tribes for the taking of tribal lands by the federal government are excluded.",
	"repealed": false
}