{
	"id": "353E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/353E.04",
	"title": "353E.04 CORRECTIONAL SERVICE PLAN RETIREMENT ANNUITY.",
	"text": "After termination of public employment, a member who has attained the age of at least 55 years and who is vested under section 353.01, subdivision 47, in the local government correctional service plan is entitled, upon application, to a normal retirement annuity. Instead of a normal retirement annuity, a retiring employee may elect to receive the optional annuity provided in section 353.30, subdivision 3.\nIn calculating the annuity under subdivision 3, \"average salary\" means an amount equivalent to the average of the highest salary earned as a member upon which employee contributions were paid for any five successive years of allowable service. Average salary must be based on all allowable service if this service is less than five years.\n(a) The average salary as defined in subdivision 2, multiplied by 1.9 percent for each year of allowable service before July 1, 2025, and 2.2 percent for each year of allowable service beginning on or after July 1, 2025, determines the amount of the normal retirement annuity.\n(b) If a person has earned allowable service in the general employees retirement plan of the Public Employees Retirement Association or the public employees police and fire retirement plan before participation under this chapter, the retirement annuity representing such service must be computed in accordance with the formula specified in sections 353.29 and 353.30 or 353.651, whichever applies.\n[See Note.]\nA member who has attained the age of at least 50 years and who is vested under section 353.01, subdivision 47, in the local government correctional service plan is entitled, upon application, to a reduced retirement annuity equal to the annuity calculated under subdivision 3, reduced so that the reduced annuity is the actuarial equivalent of the annuity that would be payable if the employee deferred receipt of the annuity from the day the annuity begins to accrue until age 55.\nThe retirement annuity under this section begins to accrue as provided in section 353.29, subdivision 7. The retirement annuity is payable for the life of the recipient, or in accordance with the terms of any optional annuity form selected by the retiring member.\nA former employee who has both public employees retirement plan and public employees local government correctional retirement plan credited service must, if qualified, receive a retirement annuity from each retirement plan that takes into account both periods of service and both covered salary amounts, but no period of service may be used more than once in calculating the annuity.\nAn annuity under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}