{
	"id": "297I.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.15",
	"title": "297I.15 EXEMPTIONS FROM TAX.",
	"text": "Premiums under the Minnesota comprehensive health insurance plan and all payments, revenues, and reimbursements received from the federal government for Medicare-related coverage as defined in section 62A.3099 are not subject to tax under this chapter.\nTo the extent that the Minnesota employees insurance program under section 43A.317 operates as a self-insured group, the premiums paid to the program are exempt from the taxes imposed under this chapter, but are subject to a Minnesota Comprehensive Health Association assessment under section 62E.11.\nPremiums paid to the public employees insurance program under section 43A.316 are exempt from the taxes imposed under this chapter.\nA health carrier as defined in section 62A.011 is exempt from the taxes imposed under this chapter on premiums paid to it by the state. Premiums paid by the state under medical assistance and the MinnesotaCare program are not exempt under this subdivision.\nThe Minnesota Insurance Guaranty Association under chapter 60C is exempt from the taxes imposed under this chapter.\nThe Minnesota Life and Health Guaranty Association under chapter 61B is exempt from the taxes imposed under this chapter.\nThe Minnesota Comprehensive Health Association under chapter 62E is exempt from the taxes imposed under this chapter.\nPremiums received by the writing carrier for the comprehensive health insurance plan established under section 62E.10 in connection with that plan are exempt from the taxes imposed under this chapter.\nThe Health Coverage Reinsurance Association under chapter 62L is exempt from the taxes imposed under this chapter.\nPremiums paid to fraternal benefit societies pursuant to chapter 64B are exempt from the taxes imposed under this chapter.\nWith respect to the state employees group insurance program established under sections 43A.23 to 43A.31, premiums paid for life insurance and accidental death and dismemberment insurance for eligible employees and dependents, including premiums paid by employees or dependents for optional coverage, are exempt from the taxes imposed under this chapter to the extent the premiums are paid to a foreign insurance company domiciled in a state that exempts its state employee group life insurance program from premium taxes.\nPremiums received under the Federal Employees Health Benefits Act, United States Code, title 5, section 8909(f), as amended by the Omnibus Reconciliation Act of 1990, are exempt from the taxes and surcharges imposed under this chapter.",
	"repealed": false
}