{
	"id": "257.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.05",
	"title": "257.05 IMPORTATION.",
	"text": "No person, except as provided by subdivisions 2 and 3, shall bring or send into the state any child for the purpose of placing the child out or procuring the child's adoption without first obtaining the consent of the commissioner of children, youth, and families, and such person shall conform to all rules of the commissioner of children, youth, and families and laws of the state of Minnesota relating to protection of children in foster care. Before any child shall be brought or sent into the state for the purpose of being placed in foster care, the person bringing or sending the child into the state shall first notify the commissioner of children, youth, and families of the person's intention, and shall obtain from the commissioner of children, youth, and families a certificate stating that the home in which the child is to be placed is, in the opinion of the commissioner of children, youth, and families, a suitable adoptive home for the child if legal adoption is contemplated or that the home meets the commissioner's requirements for licensing of foster homes if legal adoption is not contemplated. The commissioner is responsible for protecting the child's interests so long as the child remains within the state and until the child reaches the age of 18 or is legally adopted. Notice to the commissioner shall state the name, age, and personal description of the child, and the name and address of the person with whom the child is to be placed, and such other information about the child and the foster home as may be required by the commissioner.\nA parent, stepparent, grandparent, brother, sister and aunt or uncle in the first degree of the minor child who bring a child into the state for placement within their own home shall be exempt from the provisions of subdivision 1. This relationship may be by blood or marriage.\nSubject to state and federal laws and rules, adoption agencies licensed under chapter 142B and Minnesota Rules, parts 9545.0755 to 9545.0845, and county social services agencies are authorized to certify that the prospective adoptive home of a child brought into the state from another country for the purpose of adoption is a suitable home, or that the home meets the commissioner's requirements for licensing of foster homes if legal adoption is not contemplated.",
	"repealed": false
}