{
	"id": "16B.325",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.325",
	"title": "16B.325 SUSTAINABLE BUILDING GUIDELINES.",
	"text": "The Department of Administration and the Department of Commerce, with the assistance of other agencies, shall develop sustainable building design guidelines for all new state buildings by January 15, 2003, and for all major renovations of state buildings by February 1, 2009. The primary objectives of these guidelines are to ensure that all new state buildings, and major renovations of state buildings, initially exceed the state energy code, as established in Minnesota Rules, chapter 7676, by at least 30 percent.\nThe guidelines must:\n(1) focus on achieving the lowest possible lifetime cost, considering both construction and operating costs, for new buildings and major renovations;\n(2) allow for revisions that encourage continual energy conservation improvements in new buildings and major renovations;\n(3) define \"major renovations\" for purposes of this section to encompass not less than 10,000 square feet or not less than the replacement of the mechanical, ventilation, or cooling system of a building or a building section;\n(4) establish sustainability guidelines that include air quality and lighting standards and that create and maintain a healthy environment and facilitate productivity improvements;\n(5) establish resiliency guidelines to encourage design that allows buildings to adapt to and accommodate projected climate-related changes that are reflected in both acute events and chronic trends, including but not limited to changes in temperature and precipitation levels;\n(6) specify ways to reduce material costs; and\n(7) consider the long-term operating costs of the building, including the use of renewable energy sources and distributed electric energy generation that uses a renewable source or natural gas or a fuel that is as clean or cleaner than natural gas.\nIn developing the guidelines, the departments shall use an open process, including providing the opportunity for public comment. The guidelines established under this section are mandatory for all new buildings receiving funding from the bond proceeds fund after January 1, 2004, and for all major renovations receiving funding from the bond proceeds fund after January 1, 2009.\nThe commissioners of administration and commerce shall review the guidelines periodically and as soon as practicable revise the guidelines to incorporate performance standards developed under section 216B.241, subdivision 9.",
	"repealed": false
}