{
	"id": "323A.0903",
	"url": "https://www.revisor.mn.gov/statutes/cite/323A.0903",
	"title": "323A.0903 FILINGS REQUIRED FOR CONVERSION; EFFECTIVE DATE AND TIME.",
	"text": "After a plan of conversion is approved:\n(1) if the converting organization is a converting partnership, the converting partnership shall file articles of conversion with the secretary of state, which articles of conversion must be signed as provided in section 323A.0105, and must include:\n(i) a statement that the partnership is converting into another organization;\n(ii) the name and form of the converted organization and the jurisdiction of its governing statute;\n(iii) the time the conversion is effective under the governing statute of the converted organization;\n(iv) a statement that the conversion was approved as required by this chapter;\n(v) a statement that the conversion was approved as required by the governing statute of the converted organization; and\n(vi) if the converted organization is a foreign organization not authorized to transact business in this state, the street address of an office that the secretary of state may use for the purposes of section 323A.0904, subdivision 3; and\n(2) if the converting organization is not a converting partnership, the converting organization shall file articles of conversion with the secretary of state, which articles of conversion must be signed as provided in section 323A.0105, and must include:\n(i) a statement that the converting organization is converting into a partnership from another organization;\n(ii) the name and form of the converting organization and the jurisdiction of its governing statute; and\n(iii) a statement that the conversion was approved in a manner that complied with the converting organization's governing statute.\nA conversion becomes effective:\n(1) if the converted organization is a partnership, when the articles of conversion are filed with the secretary of state or on a later date or later time specified in the articles of conversion; and\n(2) if the converted organization is not a partnership, as provided by the governing statute of the converted organization.\nThe secretary of state shall issue to the converted organization or its legal representative a certificate of conversion.",
	"repealed": false
}