{
	"id": "298.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.48",
	"title": "298.48 MINERAL RIGHTS; EXPLORATION DATA; FILING REQUIREMENTS; PENALTIES.",
	"text": "By April 1 each year, every owner or lessee of mineral rights who, in respect thereto, has engaged in any exploration for or mining of taconite, semitaconite, or iron-sulphide shall file with the commissioner of revenue all data of the following kinds in the possession or under the control of the owner or lessee which was acquired during the preceding calendar year:\n(a) Maps and other records indicating the location, character and extent of exploration for taconite, semitaconite, or iron-sulphides;\n(b) Logs, notes and other records indicating the nature of minerals encountered during the course of exploration;\n(c) The results of any analyses of metallurgical tests or samples taken in connection with exploration;\n(d) The ultimate pit layout and the supporting cross sections; and\n(e) Any other data which the commissioner of revenue may determine to be relevant to the determination of the location, nature, extent, quality or quantity of unmined ores of said minerals. The commissioner of revenue may compel submission of the data. The court administrator of any court of record, upon demand of the commissioner, shall issue a subpoena for the production of any data before the commissioner. Disobedience of subpoenas issued under this section shall be punished by the district court of the district in which the subpoena is issued as for a contempt of the district court.\nNotwithstanding any other law to the contrary, the commissioner of revenue may use any data filed pursuant to subdivision 1 and any similar data otherwise obtained to the extent and in the manner the commissioner deems necessary to project the future availability, value, and utilization of the metallic mineral resources of this state. In making such projections the commissioner of revenue may consult with, and provide data as deemed appropriate to, the commissioner of natural resources.\nAny owner or lessee of mineral rights who fails, neglects or refuses to make any filing required by this section is guilty of a gross misdemeanor.\nThe data filed pursuant to subdivision 1 shall be considered confidential for three years from the date it is filed with the commissioner. Nothing herein contained shall be construed to prohibit the commissioner from disclosing information or publishing statistics so classified as not to disclose the identity of particular data.\nNotwithstanding the other provisions of this subdivision, the commissioner may furnish any information supplied under this section to the commissioner of natural resources, the commissioner of employment and economic development, or a county assessor. Any person violating the provisions of this section shall be guilty of a gross misdemeanor.",
	"repealed": false
}