{
	"id": "144.417",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.417",
	"title": "144.417 COMMISSIONER OF HEALTH, ENFORCEMENT, PENALTIES.",
	"text": "The state commissioner of health shall adopt rules necessary and reasonable to implement the provisions of sections 144.411 to 144.417.\n(a) Any proprietor, person, or entity that owns, leases, manages, operates, or otherwise controls the use of an area in which smoking is prohibited under sections 144.414 to 144.417, and that knowingly fails to comply with sections 144.414 to 144.417, is guilty of a petty misdemeanor.\n(b) Any person who smokes in an area where smoking is prohibited or restricted under sections 144.414 to 144.417 is guilty of a petty misdemeanor.\n(c) A proprietor, person, or entity in charge of a public place, public meeting, place of employment, or public transportation must not retaliate or take adverse action against an employee or anyone else who, in good faith, reports a violation of sections 144.414 to 144.417 to the proprietor or person in charge of the public place, public meeting, place of employment, or public transportation, or to the commissioner of health or other designee responsible for enforcing sections 144.414 to 144.417.\n(d) No person or employer shall discharge, refuse to hire, penalize, discriminate against, or in any manner retaliate against any employee, applicant for employment, or customer because the employee, applicant, or customer exercises any right to a smoke-free environment provided by sections 144.414 to 144.417 or other law.\nThe state commissioner of health, a community health board as defined in section 145A.02, subdivision 5, or any affected party may institute an action in any court with jurisdiction to enjoin repeated violations of sections 144.414 to 144.417.\n(a) Nothing in sections 144.414 to 144.417 prohibits a statutory or home rule charter city or county from enacting and enforcing more stringent measures to protect individuals from secondhand smoke or from involuntary exposure to aerosol or vapor from electronic delivery devices.\n(b) Except as provided in sections 144.411 to 144.417, smoking is permitted outside of restaurants, bars, and bingo halls unless limited or prohibited by restrictions adopted in accordance with paragraph (a).",
	"repealed": false
}