{
	"id": "145A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.07",
	"title": "145A.07 DELEGATION OF POWERS AND DUTIES.",
	"text": "(a) The commissioner of health may enter into an agreement with any community health board, or county or city that has an established delegation agreement as of January 1, 2014, to delegate all or part of the licensing, inspection, reporting, and enforcement duties authorized under sections 144.12; 144.381 to 144.387; 144.411 to 144.417; 144.71 to 144.74; 145A.04, subdivision 6; provisions of chapter 103I pertaining to construction, repair, and abandonment of water wells; chapter 157; and sections 327.14 to 327.28.\n(b) Agreements are subject to subdivision 3.\n(c) This subdivision does not affect agreements entered into under Minnesota Statutes 1986, section 145.031, 145.55, or 145.918, subdivision 2.\nA community health board may authorize a city or county within its jurisdiction to carry out activities to fulfill community health board responsibilities. An agreement to delegate community health board powers and duties to a county or city must be approved by the commissioner.\n(a) Agreements authorized under this section must be in writing and signed by the delegating authority and the designated agent.\n(b) The agreement must list criteria the delegating authority will use to determine if the designated agent's performance meets appropriate standards and is sufficient to replace performance by the delegating authority.\n(c) The agreement may specify minimum staff requirements and qualifications, set procedures for the assessment of costs, and provide for termination procedures if the delegating authority finds that the designated agent fails to comply with the agreement.\n(d) A designated agent must not perform licensing, inspection, or enforcement duties under the agreement in territory outside its jurisdiction unless approved by the governing body for that territory through a separate agreement.\n(e) The scope of agreements established under this section is limited to duties and responsibilities agreed upon by the parties. The agreement may provide for automatic renewal and for notice of intent to terminate by either party.\n(f) During the life of the agreement, the delegating authority shall not perform duties that the designated agent is required to perform under the agreement, except inspections necessary to determine compliance with the agreement and this section or as agreed to by the parties.\n(g) The delegating authority shall consult with, advise, and assist a designated agent in the performance of its duties under the agreement.\n(h) This section does not alter the responsibility of the delegating authority for the performance of duties specified in law.",
	"repealed": false
}