{
	"id": "295.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.54",
	"title": "295.54 CREDIT FOR TAXES PAID.",
	"text": "A hospital, surgical center, or health care provider that has paid taxes to another jurisdiction measured by gross revenues and is subject to tax under sections 295.52 to 295.59 on the same gross revenues is entitled to a credit for the tax legally due and paid to another jurisdiction to the extent of the lesser of (1) the tax actually paid to the other jurisdiction, or (2) the amount of tax imposed by Minnesota on the gross revenues subject to tax in the other taxing jurisdictions.\nA pharmacy may claim an annual refund against the total amount of tax, if any, the pharmacy owes during that calendar year under section 295.52, subdivision 4. The refund shall equal the amount paid by the pharmacy to a wholesale drug distributor subject to tax under section 295.52, subdivision 3, for legend drugs delivered by the pharmacy outside of Minnesota, multiplied by the tax percentage specified in section 295.52, subdivision 3. If the amount of the refund exceeds the tax liability of the pharmacy under section 295.52, subdivision 4, the commissioner shall provide the pharmacy with a refund equal to the excess amount. Each qualifying pharmacy must apply for the refund on the annual return as prescribed by the commissioner, on or before March 15 of the year following the calendar year the legend drugs were delivered outside Minnesota. The refund shall not be allowed if the initial claim for refund is filed more than one year after the original due date of the return. Interest on refunds paid under this subdivision will begin to accrue 60 days after the date a claim for refund is filed. For purposes of this subdivision, the date a claim is filed is the due date of the return if a return is due or the date of the actual claim for refund, whichever is later.\nA wholesale drug distributor who has paid taxes to another state or province or territory of Canada measured by gross revenues or sales and is subject to tax under sections 295.52 to 295.59 on the same gross revenues or sales is entitled to a credit for the tax legally due and paid to another state or province or territory of Canada to the extent of the lesser of (1) the tax actually paid to the other state or province or territory of Canada or (2) the amount of tax imposed by Minnesota on the gross revenues or sales subject to tax in the other taxing jurisdictions.",
	"repealed": false
}