{
	"id": "144.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.98",
	"title": "144.98 ACCREDITATION OF ENVIRONMENTAL LABORATORIES.",
	"text": "The commissioner of health shall accredit environmental laboratories according to national standards developed using a consensus process as established by Circular A-119, published by the United States Office of Management and Budget.\nThe commissioner may adopt rules to carry out the commissioner's responsibilities under the national standards specified in subdivisions 1 and 2a.\nNotwithstanding the exemptions in subdivisions 8 and 9, the commissioner shall accredit laboratories according to the most current environmental laboratory accreditation standards under subdivision 1 and as accepted by the accreditation bodies recognized by the National Environmental Laboratory Accreditation Program (NELAP) of the NELAC Institute.\n(a) An application for accreditation under subdivision 6 must be accompanied by the annual fees specified in this subdivision. The annual fees include:\n(1) base accreditation fee, $600;\n(2) sample preparation techniques fee, $200 per technique;\n(3) an administrative fee for laboratories located outside this state, $2,000; and\n(4) test category fees.\n(b) For the programs in subdivision 3a, the commissioner may accredit laboratories for fields of testing under the categories listed in clauses (1) to (10) upon completion of the application requirements provided by subdivision 6 and receipt of the fees for each category under each program that accreditation is requested. The categories offered and related fees include:\n(1) microbiology, $200;\n(2) inorganics, $200;\n(3) metals, $500;\n(4) volatile organics, $1,000;\n(5) other organics, $1,000;\n(6) radiochemistry, $750;\n(7) emerging contaminants, $1,000;\n(8) agricultural contaminants, $1,000;\n(9) toxicity (bioassay), $500; and\n(10) physical characterization, $250.\n(c) The total annual fee includes the base fee, the sample preparation techniques fees, the test category fees per program, and, when applicable, an administrative fee for out-of-state laboratories.\n(a) The commissioner shall accredit laboratories that test samples under the following programs:\n(1) the clean water program, such as compliance monitoring under the federal Clean Water Act, and ambient monitoring of surface and groundwater, or analysis of biological tissue;\n(2) the safe drinking water program, including compliance monitoring under the federal Safe Drinking Water Act, and the state requirements for monitoring private wells;\n(3) the resource conservation and recovery program, including federal and state requirements for monitoring solid and hazardous wastes, biological tissue, leachates, and groundwater monitoring wells not intended as drinking water sources;\n(4) the underground storage tank program; and\n(5) the clean air program, including air and emissions testing under the federal Clean Air Act, and state and federal requirements for vapor intrusion monitoring.\n(b) The commissioner shall maintain and publish a list of analytes available for accreditation. The list must be reviewed at least once every six months and the changes published in the State Register and posted on the program's website. The commissioner shall publish the notification of changes and review comments on the changes no less than 30 days from the date the list is published.\n(a) Laboratories located outside of this state that require an on-site assessment more frequent than once every two years must pay an additional assessed fee of $3,000 per assessment for each additional on-site assessment conducted. The laboratory must pay the fee within 15 business days of receiving the commissioner's notification that an on-site assessment is required. The commissioner may conduct additional on-site assessments to determine a laboratory's continued compliance with the standards provided in subdivision 2a.\n(b) A late fee of $200 shall be added to the annual fee for accredited laboratories submitting renewal applications to the commissioner after November 1.\n(c) A change fee shall be assessed if a laboratory requests additional fields of testing at any time other than when initially applying for or renewing its accreditation. A change fee does not apply for applications to add fields of testing for new analytes in response to the published notice under subdivision 3a, paragraph (b), if the laboratory holds valid accreditation for the changed test category and applies for additional analytes within the same test category. The change fee is equal to the applicable test category fee for the field of testing requested. An application that requests accreditation of multiple fields of testing within a test category requires a single payment of the applicable test category fee per application submitted.\n(d) A variance fee shall be assessed if a laboratory requests a variance from a standard provided in subdivision 2a. The variance fee is $500 per variance.\n(e) The commissioner shall assess a fee for changes to laboratory information regarding ownership, name, address, or personnel. Laboratories must submit changes through the application process under subdivision 6. The information update fee is $250 per application.\n(f) Fees must be set so that the total fees support the laboratory accreditation program. Direct costs of the accreditation service include program administration, assessments, the agency's general support costs, and attorney general costs attributable to the fee function.\nRefunds or credits shall not be made for applications received but not approved. Accreditation of a laboratory shall not be awarded until all fees are paid.\nThe commissioner of health may set fees for proficiency testing and technical training services under section 16A.1285. Fees must be set so that the total fees cover the direct costs of the proficiency testing and technical training services, including salaries, supplies and equipment, travel expenses, and attorney general costs attributable to the fee function.\nFees collected by the commissioner under this section must be deposited in the state treasury and credited to the state government special revenue fund.\n(a) Laboratories seeking accreditation must apply on a form provided by the commissioner, include the laboratory's procedures and quality manual, and pay the applicable fees.\n(b) Laboratories may be fixed-base or mobile. The commissioner shall accredit mobile laboratories individually and require a vehicle identification number, license plate number, or other uniquely identifying information in addition to the application requirements of paragraph (a).\n(c) Laboratories maintained on separate properties, even though operated under the same management or ownership, must apply separately. Laboratories with more than one building on the same or adjoining properties do not need to submit a separate application.\n(d) The commissioner may accredit laboratories located out of state. Accreditation for out-of-state laboratories may be obtained directly from the commissioner following the requirements in paragraph (a), or out-of-state laboratories may be accredited through a reciprocal agreement if the laboratory:\n(1) is accredited by a NELAP-recognized accreditation body for those fields of testing in which the laboratory requests accreditation from the commissioner;\n(2) submits an application and documentation according to this subdivision; and\n(3) submits a current copy of the laboratory's unexpired accreditation from a NELAP-recognized accreditation body showing the fields of accreditation for which the laboratory is currently accredited.\n(e) Under the conflict of interest determinations provided in section 43A.38, subdivision 6, clause (1), the commissioner shall not accredit governmental laboratories operated by agencies of the executive branch of the state. If accreditation is required, laboratories operated by agencies of the executive branch of the state must apply for accreditation through any other NELAP-recognized accreditation body.\nAll laboratories must comply with standards under this section by July 1, 2009. Fees under subdivisions 3 and 3b apply to applications received and accreditations issued after June 30, 2009. Accreditations issued on or before June 30, 2009, shall expire upon their current expiration date.\n(a) The commissioner shall issue or renew accreditation after receipt of the completed application and documentation required in this section, provided the laboratory maintains compliance with the standards specified in subdivision 2a, notwithstanding any exemptions under subdivisions 8 and 9, and attests to the compliance on the application form.\n(b) The commissioner shall prorate the fees in subdivision 3 for laboratories applying for accreditation after December 31. The fees are prorated on a quarterly basis beginning with the quarter in which the commissioner receives the completed application from the laboratory.\n(c) Applications for renewal of accreditation must be received by November 1 and no earlier than October 1 of each year. The commissioner shall send annual renewal notices to laboratories 90 days before expiration. Failure to receive a renewal notice does not exempt laboratories from meeting the annual November 1 renewal date.\n(d) The commissioner shall issue all accreditations for the calendar year for which the application is made, and the accreditation shall expire on December 31 of that year.\n(e) The accreditation of any laboratory that fails to submit a renewal application and fees to the commissioner expires automatically on December 31 without notice or further proceeding. Any person who operates a laboratory as accredited after expiration of accreditation or without having submitted an application and paid the fees is in violation of the provisions of this section and is subject to enforcement action under sections 144.989 to 144.993, the Health Enforcement Consolidation Act. A laboratory with expired accreditation may reapply under subdivision 6.\nEffective January 1, 2012, a laboratory that analyzes samples for compliance with a permit issued under section 115.03, subdivision 5, may request exemption from the personnel requirements and specific quality control provisions for microbiology and chemistry stated in the national standards as incorporated by reference in subdivision 2a. The commissioner shall grant the exemption if the laboratory:\n(1) complies with the methodology and quality control requirements, where available, in the most recent, approved edition of the Standard Methods for the Examination of Water and Wastewater as published by the Water Environment Federation; and\n(2) supplies the name of the person meeting the requirements in section 115.73, or the personnel requirements in the national standard pursuant to subdivision 2a.\nA laboratory applying for this exemption shall not apply for simultaneous accreditation under the national standard.\n(a) Effective January 1, 2012, a laboratory applying for or requesting accreditation under the exemption in subdivision 8 must obtain an acceptable proficiency test result for each of the laboratory's accredited or requested fields of testing. The laboratory must analyze proficiency samples selected from one of two annual proficiency testing studies scheduled by the commissioner.\n(b) If a laboratory fails to successfully complete the first scheduled proficiency study, the laboratory shall:\n(1) obtain and analyze a supplemental test sample within 15 days of receiving the test report for the initial failed attempt; and\n(2) participate in the second annual study as scheduled by the commissioner.\n(c) If a laboratory does not submit results or fails two consecutive proficiency samples, the commissioner will revoke the laboratory's accreditation for the affected fields of testing.\n(d) The commissioner may require a laboratory to analyze additional proficiency testing samples beyond what is required in this subdivision if information available to the commissioner indicates that the laboratory's analysis for the field of testing does not meet the requirements for accreditation.\n(e) The commissioner may collect from laboratories accredited under the exemption in subdivision 8 any additional costs required to administer this subdivision and subdivision 8.\nMS 2020 [Expired, 2014 c 286 art 7 s 2]\n(a) The selection committee shall determine assessor and assessment organization application requirements, the frequency of application submittal, and the application review schedule. The commissioner shall publish the application requirements and procedures on the accreditation program website.\n(b) In its selection process, the committee shall ensure its application requirements and review process:\n(1) meet the standards implemented in subdivision 2a;\n(2) ensure assessors have demonstrated competence in technical disciplines offered for accreditation by the commissioner; and\n(3) consider any history of repeated nonconformance or complaints regarding assessors or assessment bodies.\n(c) The selection committee shall consider an application received from qualified applicants and shall supply a list of recommended assessors and assessment bodies to the commissioner of health no later than 90 days after the commissioner notifies the committee of the need for review of applications.\n(a) The commissioner shall approve assessors who:\n(1) are employed by the commissioner for the purpose of accrediting laboratories and demonstrate competence in assessment practices for environmental laboratories; or\n(2) are employed by a state or federal agency with established agreements for mutual assistance or recognition with the commissioner and demonstrate competence in assessment practices for environmental laboratories.\n(b) The commissioner may approve other assessors or assessment organizations who are recommended by the selection committee according to subdivision 11, paragraph (c). The commissioner shall publish the list of assessors and assessment organizations approved from the recommendations.\n(c) The commissioner shall rescind approval for an assessor or assessment organization for sufficient cause as the commissioner determines, such as:\n(1) failure to meet the minimum qualifications for performing assessments;\n(2) lack of availability;\n(3) nonconformance with the applicable laws, rules, standards, policies, and procedures;\n(4) misrepresentation of application information regarding qualifications and training; or\n(5) excessive cost to perform the assessment activities.\n(a) A laboratory accredited or seeking accreditation that requires an assessment by the commissioner must select an assessor, group of assessors, or assessment organization from the published list specified in subdivision 12, paragraph (b). An accredited laboratory must complete an assessment and make all corrective actions at least once every 24 months. Unless the commissioner grants interim accreditation, a laboratory seeking accreditation must complete an assessment and make all corrective actions prior to, but no earlier than, 18 months prior to the date the application is submitted to the commissioner.\n(b) A laboratory shall not select the same assessor more than twice in succession for assessments of the same facility unless the laboratory receives written approval from the commissioner for the selection. The laboratory must supply a written request to the commissioner for approval and must justify the reason for the request and provide the alternate options considered.\n(c) A laboratory must select assessors appropriate to the size and scope of the laboratory's application or existing accreditation.\n(d) A laboratory must enter into its own contract for direct payment of the assessors or assessment organization. The contract must authorize the assessor, assessment organization, or subcontractors to release all records to the commissioner regarding the assessment activity when the assessment is performed in compliance with this section.\n(e) A laboratory must agree to permit other assessors as selected by the commissioner to participate in the assessment activities.\n(f) If the laboratory determines no approved assessor is available to perform the assessment, the laboratory must notify the commissioner in writing and provide a justification for the determination. If the commissioner confirms no approved assessor is available, the commissioner may designate an alternate assessor from those approved in subdivision 12, paragraph (a), or the commissioner may delay the assessment until an assessor is available. If an approved alternate assessor performs the assessment, the commissioner may collect fees equivalent to the cost of performing the assessment activities.\n(g) Fees collected under this section are deposited in a special account and are annually appropriated to the commissioner for the purpose of performing assessment activities.",
	"repealed": false
}