{
	"id": "13.825",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.825",
	"title": "13.825 PORTABLE RECORDING SYSTEMS.",
	"text": "(a) This section applies to law enforcement agencies that maintain a portable recording system for use in investigations, or in response to emergencies, incidents, and requests for service.\n(b) As used in this section:\n(1) \"portable recording system\" means a device worn by a peace officer that is capable of both video and audio recording of the officer's activities and interactions with others or collecting digital multimedia evidence as part of an investigation;\n(2) \"portable recording system data\" means audio or video data collected by a portable recording system; and\n(3) \"redact\" means to blur video or distort audio so that the identity of the subject in a recording is obscured sufficiently to render the subject unidentifiable.\n(a) Data collected by a portable recording system are private data on individuals or nonpublic data, subject to the following:\n(1) data that record, describe, or otherwise document actions and circumstances surrounding either the discharge of a firearm by a peace officer in the course of duty, if a notice is required under section 626.553, subdivision 2, or the use of force by a peace officer that results in substantial bodily harm, as defined in section 609.02, subdivision 7a, are public;\n(2) data are public if a subject of the data requests it be made accessible to the public, except that, if practicable, (i) data on a subject who is not a peace officer and who does not consent to the release must be redacted, and (ii) data on a peace officer whose identity is protected under section 13.82, subdivision 17, clause (a), must be redacted;\n(3) subject to paragraphs (b) to (d), portable recording system data that are active criminal investigative data are governed by section 13.82, subdivision 7, and portable recording system data that are inactive criminal investigative data are governed by this section;\n(4) portable recording system data that are public personnel data under section 13.43, subdivision 2, clause (5), are public; and\n(5) data that are not public data under other provisions of this chapter retain that classification.\n(b) Notwithstanding section 13.82, subdivision 7, when an individual dies as a result of a use of force by a peace officer, an involved officer's law enforcement agency must allow the following individuals, upon their request, to inspect all portable recording system data, redacted no more than what is required by law, documenting the incident within five days of the request, subject to paragraphs (c) and (d):\n(1) the deceased individual's next of kin;\n(2) the legal representative of the deceased individual's next of kin; and\n(3) the other parent of the deceased individual's child.\n(c) A law enforcement agency may deny a request to inspect portable recording system data under paragraph (b) if the agency determines that there is a compelling reason that inspection would interfere with an active investigation. If the agency denies access under this paragraph, the chief law enforcement officer must provide a prompt, written denial to the individual in paragraph (b) who requested the data with a short description of the compelling reason access was denied and must provide notice that relief may be sought from the district court pursuant to section 13.82, subdivision 7.\n(d) When an individual dies as a result of a use of force by a peace officer, an involved officer's law enforcement agency shall release all portable recording system data, redacted no more than what is required by law, documenting the incident no later than 14 days after the incident, unless the chief law enforcement officer asserts in writing that the public classification would interfere with an ongoing investigation, in which case the data remain classified by section 13.82, subdivision 7.\n(e) A law enforcement agency may redact or withhold access to portions of data that are public under this subdivision if those portions of data are clearly offensive to common sensibilities.\n(f) Section 13.04, subdivision 2, does not apply to collection of data classified by this subdivision.\n(g) Any person may bring an action in the district court located in the county where portable recording system data are being maintained to authorize disclosure of data that are private or nonpublic under this section or to challenge a determination under paragraph (e) to redact or withhold access to portions of data because the data are clearly offensive to common sensibilities. The person bringing the action must give notice of the action to the law enforcement agency and subjects of the data, if known. The law enforcement agency must give notice to other subjects of the data, if known, who did not receive the notice from the person bringing the action. The court may order that all or part of the data be released to the public or to the person bringing the action. In making this determination, the court shall consider whether the benefit to the person bringing the action or to the public outweighs any harm to the public, to the law enforcement agency, or to a subject of the data and, if the action is challenging a determination under paragraph (e), whether the data are clearly offensive to common sensibilities. The data in dispute must be examined by the court in camera. This paragraph does not affect the right of a defendant in a criminal proceeding to obtain access to portable recording system data under the Rules of Criminal Procedure.\n(a) Portable recording system data that are not active or inactive criminal investigative data and are not described in paragraph (b) or (c) must be maintained for at least 90 days and destroyed according to the agency's records retention schedule approved pursuant to section 138.17.\n(b) Portable recording system data must be maintained for at least one year and destroyed according to the agency's records retention schedule approved pursuant to section 138.17 if:\n(1) the data document (i) the discharge of a firearm by a peace officer in the course of duty if a notice is required under section 626.553, subdivision 2, or (ii) the use of force by a peace officer that results in substantial bodily harm; or\n(2) a formal complaint is made against a peace officer related to the incident.\n(c) Portable recording system data that document a peace officer's use of deadly force must be maintained indefinitely.\n(d) If a subject of the data submits a written request to the law enforcement agency to retain the recording beyond the applicable retention period for possible evidentiary or exculpatory use related to the circumstances under which the data were collected, the law enforcement agency shall retain the recording for an additional time period requested by the subject of up to 180 days and notify the requester that the recording will then be destroyed unless a new request is made under this paragraph.\n(e) Notwithstanding paragraph (b), (c), or (d), a government entity may retain a recording for as long as reasonably necessary for possible evidentiary or exculpatory use related to the incident with respect to which the data were collected.\n(a) For purposes of this chapter, a portable recording system data subject includes the peace officer who collected the data, and any other individual or entity, including any other peace officer, regardless of whether the officer is or can be identified by the recording, whose image or voice is documented in the data.\n(b) An individual who is the subject of portable recording system data has access to the data, including data on other individuals who are the subject of the recording. If the individual requests a copy of the recording, data on other individuals who do not consent to its release must be redacted from the copy. The identity and activities of an on-duty peace officer engaged in an investigation or response to an emergency, incident, or request for service may not be redacted, unless the officer's identity is subject to protection under section 13.82, subdivision 17, clause (a).\nA law enforcement agency that uses a portable recording system must maintain the following information, which is public data:\n(1) the total number of recording devices owned or maintained by the agency;\n(2) a daily record of the total number of recording devices actually deployed and used by officers and, if applicable, the precincts in which they were used;\n(3) the policies and procedures for use of portable recording systems required by section 626.8473; and\n(4) the total amount of recorded audio and video data collected by the portable recording system and maintained by the agency, the agency's retention schedule for the data, and the agency's procedures for destruction of the data.\nWhile on duty, a peace officer may only use a portable recording system issued and maintained by the officer's agency in documenting the officer's activities.\n(a) A law enforcement agency must comply with sections 13.05, subdivision 5, and 13.055 in the operation of portable recording systems and in maintaining portable recording system data.\n(b) The responsible authority for a law enforcement agency must establish written procedures to ensure that law enforcement personnel have access to the portable recording system data that are not public only if authorized in writing by the chief of police, sheriff, or head of the law enforcement agency, or their designee, to obtain access to the data for a legitimate, specified law enforcement purpose.\n(a) Portable recording system data that are not public may only be shared with or disseminated to another law enforcement agency, a government entity, or a federal agency upon meeting the standards for requesting access to data as provided in subdivision 7.\n(b) If data collected by a portable recording system are shared with another state or local law enforcement agency under this subdivision, the agency that receives the data must comply with all data classification, destruction, and security requirements of this section.\n(c) Portable recording system data may not be shared with, disseminated to, sold to, or traded with any other individual or entity unless explicitly authorized by this section or other applicable law.\n(a) A law enforcement agency must maintain records showing the date and time portable recording system data were collected and the applicable classification of the data. The law enforcement agency shall arrange for an independent, biennial audit of the data to determine whether data are appropriately classified according to this section, how the data are used, and whether the data are destroyed as required under this section, and to verify compliance with subdivisions 7 and 8. If the governing body with jurisdiction over the budget of the agency determines that the agency is not complying with this section or other applicable law, the governing body may order additional independent audits. Data in the records required under this paragraph are classified as provided in subdivision 2.\n(b) The results of the audit are public, except for data that are otherwise classified under law. The governing body with jurisdiction over the budget of the law enforcement agency shall review the results of the audit. If the governing body determines that there is a pattern of substantial noncompliance with this section, the governing body must order that operation of all portable recording systems be suspended until the governing body has authorized the agency to reinstate their use. An order of suspension under this paragraph may only be made following review of the results of the audit and review of the applicable provisions of this chapter, and after providing the agency and members of the public a reasonable opportunity to respond to the audit's findings in a public meeting.\n(c) A report summarizing the results of each audit must be provided to the governing body with jurisdiction over the budget of the law enforcement agency, to the Legislative Commission on Data Practices and Personal Data Privacy, and to the chairs and ranking minority members of the committees of the house of representatives and the senate with jurisdiction over data practices and public safety issues no later than 60 days following completion of the audit.\nWithin ten days of obtaining new surveillance technology that expands the type or scope of surveillance capability of a portable recording system device beyond video or audio recording, a law enforcement agency must notify the Bureau of Criminal Apprehension that it has obtained the new surveillance technology. The notice must include a description of the technology and its surveillance capability and intended uses. The notices are accessible to the public and must be available on the bureau's website.\n(a) For purposes of this subdivision, \"portable recording system vendor\" means a person who is not a government entity and who provides services for the creation, collection, retention, maintenance, processing, or dissemination of portable recording system data for a law enforcement agency or other government entity. By providing these services to a government entity, a vendor is subject to all of the requirements of this chapter as if it were a government entity.\n(b) A portable recording system vendor that stores portable recording system data in the cloud must protect the data in accordance with the security requirements of the United States Federal Bureau of Investigation Criminal Justice Information Services Division Security Policy 5.4 or its successor version.\n(c) Subject to paragraph (d), in an action against a vendor under section 13.08 for a violation of this chapter, the vendor is liable for presumed damages of $2,500 or actual damages, whichever is greater, and reasonable attorney fees.\n(d) In an action against a vendor that improperly discloses data made not public by this chapter or any other statute classifying data as not public, the vendor is liable for presumed damages of $10,000 or actual damages, whichever is greater, and reasonable attorney fees.\nIn addition to any other remedies provided by law, in the case of a willful violation of this section a law enforcement agency is subject to exemplary damages of not less than twice the minimum, nor more than twice the maximum allowable for exemplary damages under section 13.08, subdivision 1.",
	"repealed": false
}