{
	"id": "116M.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/116M.15",
	"title": "116M.15 MINNESOTA EMERGING ENTREPRENEUR BOARD.",
	"text": "The Minnesota Emerging Entrepreneur Board is created and consists of the commissioner of employment and economic development, the commissioner of human rights, the chair of the Metropolitan Council, and 12 members from the general public appointed by the governor. Nine of the public members must be representatives from minority business enterprises. No more than six of the public members may be of one gender. At least one member must be a representative from a veteran-owned business, and at least one member must be a representative from a business owned by a person with disabilities. Appointments must ensure balanced geographic representation. At least half of the public members must have experience working to address racial income disparities. All public members must be experienced in business or economic development.\nThe board shall:\n(1) submit a report to the commissioner by February 1 of each year describing the condition of Minnesota small businesses that are majority owned and operated by a racial or ethnic minority, woman, veteran, or a person with disabilities, along with any policy recommendations;\n(2) act as a liaison between the department and nonprofit corporations engaged in small business development support activities; and\n(3) assist the department in informational outreach about the program.\nThe membership terms, compensation, removal, and filling of vacancies of public members of the board are as provided in section 15.0575.\nThe commissioner of employment and economic development shall serve as chair of the board. The board may elect other officers as necessary from its members.\nThe commissioner of employment and economic development shall provide staff, consultant support, materials, and administrative services necessary for the board's activities. The services must include personnel, budget, payroll, and contract administration.\n(a) If compliance with section 13D.02 is impractical, the Minnesota Emerging Entrepreneur Board may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the board participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the board can hear clearly all discussion and testimony and all votes of members of the board and, if needed, receive those services required by sections 15.44 and 15.441;\n(3) at least one member of the board is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(b) Each member of the board participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(c) If telephone or other electronic means is used to conduct a meeting, the board, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The board may require the person making such a connection to pay for documented marginal costs that the board incurs as a result of the additional connection.\n(d) If telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the board shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and of the provisions of paragraph (c). The timing and method of providing notice is governed by section 13D.04.",
	"repealed": false
}