{
	"id": "119A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/119A.05",
	"title": "119A.05 FUNDING CONSOLIDATION.",
	"text": "Notwithstanding existing law governing allocation of funds by local grantees, mode of service delivery, grantee planning and reporting requirements, and other procedural requirements for the grant programs identified in this section, a local grantee may elect to consolidate all or a portion of funding received from the programs under subdivision 5 in a collaboration funding plan, if all conditions specified in this section are satisfied. County boards, school boards, or governing boards of other grantees may elect not to consolidate funding for a program.\nFor grantees electing consolidation, the commissioner may waive all provisions of rules inconsistent with the intent of this section. This waiver authority does not apply to rules governing client protections, due process, or inclusion of clients, parents, cultures, and ethnicities in decision making. Funding to a local grantee must be determined according to the funding formulas or allocation rules governing the individual programs listed in section 119A.04.\nA consolidated funding account is established under the control of the commissioner of education. The purpose of this account is to clearly identify and provide accountability for funds previously distributed to local grantees through the individual categorical grant programs in subdivision 5. By direction of the commissioner, after consultation with the partnership planning team and, upon a finding that the conditions specified in this section have been satisfied, funds must be transmitted to this account and allocated to local grantees by the commissioner.\nTo be eligible to receive funding for local consolidation, as provided for in this section, a grantee must meet the following requirements:\n(1) demonstrate participation by counties and schools in a local collaborative process as defined in section 142D.15 or in a similar process of collaboration with other local governments and community organizations which satisfies the governance and planning guidelines published by the commissioner as provided for in this section;\n(2) document consultation by counties and schools with community action agencies and other community groups;\n(3) complete and document, according to guidelines published by the commissioner, a collaborative planning process which clearly identifies:\n(i) allocation of resources in the collaboration annual funding plan;\n(ii) a description of the governance structure for the execution of the funding plan;\n(iii) outcomes consistent with the statewide goals identified in this chapter and in statutes governing previous categorical funding included in the collaboration funding plan; and\n(iv) indicators sufficient to measure improvement or decline in specified outcomes compared to baseline performance;\n(4) conduct a public hearing on the funding consolidation plan under chapter 13D;\n(5) agree to periodically report information concerning progress in addressing outcomes, as provided for in guidelines to be published by the commissioner; and\n(6) execute a written agreement between the commissioner and the local grantees setting forth responsibilities, obligations, and conditions consistent with this section. The agreement must state that the funds that are being locally consolidated will be used collectively only to achieve the objectives of the separate programs being locally consolidated.\nThe geographic area for a local consolidated funding process must be an entire county, a multicounty area, or, with the approval of the county board and commissioner, a subcounty area, if county funds are used. The process may provide for coordination of service delivery in jurisdictions that extend across county boundaries.\nGrant programs transferred to the department in Minnesota Statutes 2003, section 119A.04, and programs transferred from the abolished Department of Education under Laws 1995, First Special Session chapter 3, article 16, section 11, are eligible for local funding consolidation. Eligibility of any federally funded programs for local funding consolidation is conditioned upon obtaining necessary federal waivers or changes in federal law.\nGrantees who meet all requirements of this section may elect to begin using funding for a local consolidated funding process beginning January 1, 1996, or at each six-month interval. Other local grantees that meet all requirements of this section may elect to begin using funding for a local consolidation funding process beginning July 1, 1996, or at each six-month interval.\nIf the commissioner finds that a grantee has failed to comply with this section, the grantee becomes subject to all requirements of individual grant programs as specified in statutes and rules.",
	"repealed": false
}