{
	"id": "256D.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.48",
	"title": "256D.48 PROTECTIVE PAYMENTS.",
	"text": "The county agency shall determine whether a recipient needs a protective payee when a physical or mental condition renders the recipient unable to manage funds and when payments to the recipient would be contrary to the recipient's welfare. Protective payments must be issued when there is evidence of: (1) repeated inability to plan the use of income to meet necessary expenditures; (2) repeated observation that the recipient is not properly fed or clothed; (3) repeated failure to meet obligations for rent, utilities, food, and other essentials; (4) evictions or a repeated incurrence of debts; or (5) lost or stolen checks. The determination of representative payment by the Social Security Administration for the recipient is sufficient reason for protective payment of Minnesota supplemental aid payments.\nWhen the county agency determines that a recipient needs a protective payee, the county agency shall appoint a payee according to the procedures in paragraphs (a) and (b).\n(a) The county agency shall consider the recipient's preference of protective payee. The protective payee must have an interest in or concern for the welfare of the recipient. The protective payee must be capable of and willing to provide the required assistance. A vendor of goods or services, including the recipient's landlord, shall not serve as protective payee.\n(b) The county agency shall reconsider the need for a protective payee at least annually. The criteria used to determine a person's continuing need for a protective payee are the criteria used in the Supplemental Security Income program to determine if a person is incapable of managing or directing the management of the person's money. If the need for protective payment is likely to continue beyond two years, the county agency shall seek judicial appointment of a guardian or other legal representative.\nIf the assistance unit receives benefits from the Social Security Administration, the county agency shall also petition the Social Security Administration to establish a representative payee for those benefits.",
	"repealed": false
}