{
	"id": "289A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.51",
	"title": "289A.51 ELECTRIC-ASSISTED BICYCLE REBATE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Electric-assisted bicycle\" has the meaning given in section 169.011, subdivision 27, except that the term is limited to a new electric-assisted bicycle purchased from an eligible retailer.\n(c) \"Eligible expenses\" means the amount paid for an electric-assisted bicycle and any qualifying accessories purchased at the same time as the electric-assisted bicycle, inclusive of sales tax but exclusive of any other related charges, including charges for a warranty, service, or delivery.\n(d) \"Eligible individual\" means an individual who:\n(1) is at least 15 years old;\n(2) is a resident individual taxpayer at the time of application for a rebate certificate and in the previous calendar year; and\n(3) was not claimed as a dependent on another return in the taxable year described in subdivision 3, paragraph (c).\n(e) \"Eligible retailer\" means a person who has engaged in the business of retail sales of new electric-assisted bicycles for at least six months prior to receiving the approval of the commissioner under subdivision 5.\n(f) \"Qualifying accessories\" means a bicycle helmet, lights, lock, luggage rack, basket, bag or backpack, fenders, or reflective clothing.\nAn eligible retailer that has been assigned a rebate certificate by an eligible individual may apply to the commissioner for a rebate, as provided in this section.\n(a) The amount of a rebate under this section equals the lesser of:\n(1) the applicable percentage, multiplied by the amount of eligible expenses paid by an eligible individual; or\n(2) $1,500.\n(b) The applicable percentage equals 75 percent, but is reduced by one percentage point until the percentage equals 50 percent, for each $4,000 of the eligible individual's adjusted gross income in excess of:\n(1) $50,000 for a married taxpayer filing a joint return; and\n(2) $25,000 for all other filers.\n(c) For the purposes of determining the applicable percentage under paragraph (b) and subdivision 4, paragraph (a), the commissioner must use the eligible individual's adjusted gross income for the taxable year ending in the calendar year prior to the year in which the individual applied for a rebate certificate.\n(a) To qualify for a rebate under this section, an eligible individual must apply to the commissioner for a rebate certificate in the manner specified by the commissioner prior to purchasing an electric-assisted bicycle. As part of the application, the eligible individual must include proof of the individual's adjusted gross income for the taxable year specified in subdivision 3, paragraph (c). The commissioner must issue a rebate certificate to an eligible individual stating the issuance date, the applicable percentage, and the maximum rebate for which the taxpayer is eligible. For a married taxpayer filing a joint return, each spouse may apply to the commissioner separately, and the commissioner must issue each spouse a separate rebate certificate.\n(b) The commissioner of revenue may determine the date on which to open applications for a rebate certificate, and applications must not be submitted before the date determined by the commissioner. Beginning July 1, 2024, and July 1 of each subsequent calendar year for which there is an allocation of rebate certificates, the commissioner must allocate rebate certificates on a first-come, first-served basis. The commissioner must reserve 40 percent of the certificates for a married taxpayer filing a joint return with an adjusted gross income of less than $78,000 or any other filer with an adjusted gross income of less than $41,000. Any portion of the reserved amount under this paragraph that is not allocated by September 30 is available for allocation to other rebate certificate applications beginning on October 1.\n(c) The commissioner must not issue rebate certificates totaling more than $2,000,000 in each of calendar years 2024 and 2025, except any amount authorized but not allocated in any calendar year does not cancel and is added to the allocation for the next calendar year. When calculating the amount of remaining allocations, the commissioner must assume that each allocated but unclaimed certificate reduces the available allocations by $1,500.\n(d) A rebate certificate that is not assigned to a retailer expires two months after the date the certificate was issued and may not be assigned to a retailer after expiration. The amount of any expired rebate certificates is added to the available allocation under paragraph (c).\nTo be eligible to be assigned a rebate certificate under this section, an eligible retailer must apply to the commissioner of revenue to be certified as an eligible retailer in the manner specified by the commissioner. The application must include proof that the person applying has been actively involved in the business of retail sales of new electric-assisted bicycles for at least six months.\n(a) An eligible individual who purchases an electric-assisted bicycle may assign a rebate certificate to an eligible retailer at the time of purchase. The retailer must reduce the price of the electric-assisted bicycle by the amount of the rebate determined under subdivision 3.\n(b) The commissioner must establish the form and manner by which a taxpayer may assign a rebate certificate to a retailer. The commissioner must establish a process through which retailers may quickly verify the validity of a rebate certificate at the time of purchase.\n(c) An eligible retailer that was assigned a rebate certificate may apply to the commissioner for a rebate within one month of the date of the sale. The application must be in the manner specified by the commissioner. The commissioner must pay to an eligible retailer who meets the requirements of this section the amount of the rebate determined under subdivision 3.\n(d) Only an eligible retailer may apply for a rebate under this subdivision. To receive the benefit of a rebate under this section, an eligible individual must assign a rebate certificate to an eligible retailer.\n(e) A rebate certificate under this section must not be assigned or transferred more than once.\n(f) The commissioner must not pay any rebates under this section after June 30, 2026.\n(a) The commissioner must not issue an eligible individual a rebate certificate more than one time. This limitation does not apply to a rebate certificate that expired.\n(b) If an eligible individual purchases an electric-assisted bicycle using a rebate under this section and returns the bicycle to an eligible retailer, the eligible retailer must repay to the commissioner the amount of the rebate received.\n(c) The commissioner must not issue a rebate certificate to an eligible individual who is subject to a claim for a refund under chapter 270A.\n(d) For electric-assisted bicycles purchased using rebates under this section:\n(1) an eligible retailer must charge the same retail price for an electric-assisted bicycle as the retailer charges for the same bicycle if it is purchased without a rebate; and\n(2) an eligible retailer must not charge a retail price in excess of the manufacturer's suggested retail price.\n$4,000,000 in fiscal year 2024 is appropriated from the general fund to the commissioner to implement the requirements under this section, including but not limited to administration and payment of refunds. This is a onetime appropriation and is available until June 30, 2026.\nThis section expires June 30, 2026. The expiration of this section does not affect the commissioner's authority to audit or power of examination and assessment for rebates claimed under this section.",
	"repealed": false
}