{
	"id": "260B.008",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.008",
	"title": "260B.008 USE OF RESTRAINTS.",
	"text": "(a) As used in this section, \"restraints\" means a mechanical or other device that constrains the movement of a person's body or limbs.\n(b) Restraints may not be used on a child appearing in court in a proceeding under this chapter unless the court finds that:\n(1) the use of restraints is necessary:\n(i) to prevent physical harm to the child or another; or\n(ii) to prevent the child from fleeing in situations in which the child presents a substantial risk of flight from the courtroom; and\n(2) there are no less restrictive alternatives to restraints that will prevent flight or physical harm to the child or another, including but not limited to the presence of court personnel, law enforcement officers, or bailiffs.\nThe finding in clause (1), item (i), may be based, among other things, on the child having a history of disruptive courtroom behavior or behavior while in custody for any current or prior offense that has placed others in potentially harmful situations, or presenting a substantial risk of inflicting physical harm on the child or others as evidenced by past behavior. The court may take into account the physical structure of the courthouse in assessing the applicability of the above factors to the individual child.\n(c) The court shall be provided the child's behavior history and shall provide the child an opportunity to be heard in person or through counsel before ordering the use of restraints. If restraints are ordered, the court shall make findings of fact in support of the order.\n(d) By April 1, 2022, each judicial district shall develop a protocol to address how to implement and comply with this section. In developing the protocol, a district shall consult with law enforcement agencies, prosecutors, public defenders within the district, and any other entity deemed necessary by the district's chief judge.",
	"repealed": false
}