{
	"id": "142E.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.16",
	"title": "142E.16 PROVIDER REQUIREMENTS.",
	"text": "The commissioner must authorize the provider chosen by an applicant or a participant before the county can authorize payment for care provided by that provider. The commissioner must establish the requirements necessary for authorization of providers. A provider must be reauthorized every two years.\n[See Note.]\n(a) This subdivision only applies to legal, nonlicensed family child care providers.\n(b) Prior to authorization, the commissioner of children, youth, and families shall perform a background study on individuals identified under section 245C.02, subdivision 6a.\n(c) After authorization, a background study must also be performed when an individual identified under section 245C.02, subdivision 6a, joins the household. The provider must report all family changes that would require a new background study.\n(d) At each reauthorization, the commissioner of children, youth, and families must ensure that a background study through NETStudy 2.0 has been performed on all individuals in the provider's household for whom a background study is required under paragraphs (b) and (c).\n(e) Prior to a background study through NETStudy 2.0 expiring, another background study must be completed on all individuals for whom the background study is expiring.\n(f) The commissioner of children, youth, and families shall forward the background study determination to the commissioner of children, youth, and families, who shall grant or deny authorization as a legal nonlicensed family child care provider based on the commissioner of human service's determination.\n[See Note.]\n(a) Prior to initial authorization as required in subdivision 1, a legal nonlicensed family child care provider must complete first aid and CPR training and provide the verification of first aid and CPR training to the commissioner. The training documentation must have valid effective dates as of the date the registration request is submitted to the commissioner. The training must have been provided by an individual approved to provide first aid and CPR instruction and have included CPR techniques for infants and children.\n(b) Upon each reauthorization after the authorization period when the initial first aid and CPR training requirements are met, a legal nonlicensed family child care provider must provide verification of at least eight hours of additional training listed in the Minnesota Center for Professional Development Registry.\n(c) This subdivision only applies to legal nonlicensed family child care providers.\n[See Note.]\n(a) The provider seeking authorization under this section shall collect the information required under section 245C.05 and forward the information to the commissioner of children, youth, and families. The background study must include a review of the information required under section 245C.08, subdivision 3.\n(b) A legal nonlicensed family child care provider is not authorized under this section if:\n(1) the commissioner of children, youth, and families determines that any household member who is the subject of a background study is disqualified from direct contact with, or from access to, persons served by the program and that disqualification has not been set aside or a variance has not been granted under chapter 245C;\n(2) the person has refused to give written consent for disclosure of criminal history records;\n(3) the person has been denied a family child care license;\n(4) the person has a family child care licensing disqualification that has not been set aside; or\n(5) the person has admitted or a county has found that there is a preponderance of evidence that fraudulent information was given to the county for child care assistance application purposes or was used in submitting child care assistance bills for payment.\n[See Note.]\nWhen the commissioner denies a person authorization as a legal nonlicensed family child care provider under subdivision 2, paragraph (f), the commissioner later may authorize that person as a provider if the following conditions are met:\n(1) after receiving notice of the denial of the authorization, the person applies for and obtains a valid child care license issued under chapter 142B, issued by a Tribe, or issued by another state;\n(2) the person maintains the valid child care license; and\n(3) the person is providing child care in the state of licensure or in the area under the jurisdiction of the licensing Tribe.\n[See Note.]\n(a) The commissioner may deny authorization as a child care provider to any applicant or rescind authorization of any provider when a county or the commissioner knows or has reason to believe that the provider is unsafe or that the circumstances of the chosen child care arrangement are unsafe, based on statewide criteria developed by the commissioner.\n(b) The commissioner shall develop and introduce statewide criteria for unsafe care.\n[See Note.]\n(a) As a condition of payment, all providers receiving child care assistance payments must:\n(1) keep accurate and legible daily attendance records at the site where services are delivered for children receiving child care assistance; and\n(2) make those records available immediately to the county or the commissioner upon request. Any records not provided to a county or the commissioner at the date and time of the request are deemed inadmissible if offered as evidence by the provider in any proceeding to contest an overpayment or disqualification of the provider.\n(b) As a condition of payment, attendance records must be completed daily and include the date, the first and last name of each child in attendance, and the times when each child is dropped off and picked up. To the extent possible, the times that the child was dropped off to and picked up from the child care provider must be entered by the person dropping off or picking up the child. The daily attendance records must be retained at the site where services are delivered for six years after the date of service.\n(c) When the county or the commissioner knows or has reason to believe that a current or former provider has not complied with the record-keeping requirement in this subdivision:\n(1) the commissioner may:\n(i) deny or revoke a provider's authorization to receive child care assistance payments under section 142E.17, subdivision 9, paragraph (d);\n(ii) pursue an administrative disqualification under sections 142E.51, subdivision 5, and 256.98; or\n(iii) take an action against the provider under sections 142E.50 to 142E.58; or\n(2) a county or the commissioner may establish an attendance record overpayment under paragraph (d).\n(d) To calculate an attendance record overpayment under this subdivision, the commissioner or county agency shall subtract the maximum daily rate from the total amount paid to a provider for each day that a child's attendance record is missing, unavailable, incomplete, inaccurate, or otherwise inadequate.\n(e) The commissioner shall develop criteria for a county to determine an attendance record overpayment under this subdivision.\n[See Note.]\n(a) In establishing an overpayment claim for failure to provide attendance records in compliance with subdivision 7, the county or commissioner is limited to the six years prior to the date the county or the commissioner requested the attendance records.\n(b) The commissioner or county may periodically audit child care providers to determine compliance with subdivision 7.\n(c) When the commissioner or county establishes an overpayment claim against a current or former provider, the commissioner or county must provide notice of the claim to the provider. A notice of overpayment claim must specify the reason for the overpayment, the authority for making the overpayment claim, the time period in which the overpayment occurred, the amount of the overpayment, and the provider's right to appeal.\n(d) The commissioner or county shall seek to recoup or recover overpayments paid to a current or former provider.\n(e) When a provider has been disqualified or convicted of fraud under section 256.98, theft under section 609.52, or a federal crime relating to theft of state funds or fraudulent billing for a program administered by the commissioner or a county, recoupment or recovery must be sought regardless of the amount of overpayment.\n[See Note.]\nA provider must report to the county and report on the billing form as required when a child's attendance in child care falls to less than half of the child's authorized hours or days for a four-week period. If requested by the county or the commissioner, the provider must provide additional information to the county or commissioner on the attendance of specific children.",
	"repealed": false
}