{
	"id": "451.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/451.04",
	"title": "451.04 FRANCHISE FOR CITY HEATING SYSTEM.",
	"text": "A home rule charter city of the fourth class may give a person, company, or corporation the right to use the streets, alleys, and other public grounds of the city to construct, operate, and maintain a system to furnish heat to city residents.\nThe city council must decide what terms and conditions apply to the use of the right given under subdivision 1.\nIf the city owns and operates a plant that heats water or generates steam, the city may sell the steam or hot water to the user of the right given under subdivision 1 at a profit to the city.\nThe city may make contracts and arrangements for furnishing heat, using the city's steam or hot water, to city residents. The city may also make arrangements for the regulation and control of the heating system.\nThe city may give a person, company, or corporation the right to use the streets, alleys, and other public grounds of the city to install, at no expense to the city, necessary and incidental equipment to construct, operate, and maintain the heating system. The city council must decide what terms and conditions apply to the use of the plant.\nIf the city owns and operates a plant that heats water or generates steam, the city may make the necessary and incidental contracts and arrangements to furnish, at a profit to the city, heat from the steam or hot water, to the city's residents.\nThe city may acquire, own, operate, and enlarge the heating system after it is installed.\nThe city may issue its certificates of indebtedness payable in heat to be sold by the city.\nIf the city operates a municipal electric light or water plant, the city may agree with a service company that furnishes steam or hot water heat to its residents to supply from the municipal plant to the service company, the necessary steam or hot water for the company's customers.\nThe supply agreement between the city and the service company may include terms on the subjects in this subdivision.\n(a) The agreement may provide for joint approval of the plans and joint supervision of the construction and the definite determination at the time of completion, of the cost of the company's plant.\n(b) The agreement may:\n(1) fix the rates to be charged to the company's customers for the heat supplied;\n(2) fix the charges to be billed to and collected from the customer either by the city or the service company; and\n(3) divide the revenue received from the collections between the city and the service company.\n(c) The agreement may provide for the purchase of the company's plant by the city at cost, plus reasonable interest on the cost, and for payment for the plant from the money saved by the city from its share of the collections.\nIf there is a heating system in the city that is not owned by the city, the city may buy the heating system for not more than its fair value. The city and the owner of the system must agree on the terms of the sale.\nThe city council may issue and sell as many bonds of the city as it judges are necessary to buy the heating system from its owners.\n(a) The city council must decide:\n(1) the bonds' form and denomination;\n(2) the rate of interest on the bonds, not more than six percent per year, payable semiannually; and\n(3) the time, not more than 20 years from their date, when the bonds are due and payable.\n(b) If the city issues the bonds, the bonds must be signed by the mayor and countersigned by the clerk.\n(c) The bonds must be sold for not less than par and accrued interest.\nThe powers granted in this section are to be added to other powers granted by law.",
	"repealed": false
}