{
	"id": "390.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/390.25",
	"title": "390.25 UNIDENTIFIED DECEASED PERSONS.",
	"text": "The coroner or medical examiner shall make reasonable attempts to identify the deceased person promptly. These actions may include obtaining: photographs of the body; fingerprints from the body, if possible; formal dental examination by a dentist with forensic training, with charting and radiographs; full body radiographs; specimens such as tissue, blood, bone, teeth, and/or hair, suitable for DNA analysis or other identification techniques; blood type; photographs of items such as clothing and property found on and with the body; and anthropological determination of age, race, sex, and stature, if appropriate. All of these actions shall be taken prior to the disposition of any unidentified deceased person.\n(a) After 30 days, the coroner or medical examiner shall provide to the Bureau of Criminal Apprehension missing persons clearinghouse information to be entered into federal and state databases that can aid in the identification, including the National Crime Information Center database. The coroner or medical examiner shall provide to the Bureau of Criminal Apprehension specimens suitable for DNA analysis. DNA profiles and information shall be entered by the Bureau of Criminal Apprehension into federal and state DNA databases within five business days after the completion of the DNA analysis and procedures necessary for the entry of the DNA profile.\n(b) If a deceased's remains are identified as a missing person, the Bureau of Criminal Apprehension or the lead law enforcement agency shall attempt to locate family members of the deceased person and inform them of the death and location of the deceased person's remains. All efforts to locate and notify family members shall be recorded and retained by the Bureau of Criminal Apprehension or lead law enforcement agency.\nNothing in this section shall be interpreted to preclude any medical examiner or coroner from pursuing other efforts to identify unidentified deceased persons, including publicizing information, descriptions, or photographs that may aid in the identification, allowing family members to identify missing persons, and seeking to protect the dignity of the missing persons.\nThe coroner or medical examiner may preserve and retain photographs, specimens, documents, and other data such as dental records, radiographs, fingerprints, or DNA, for establishing or confirming the identification of bodies or for other forensic purposes deemed appropriate under the jurisdiction of the office. Upon request by an appropriate agency, or upon the coroner or medical examiner's own initiative, the coroner or medical examiner may make the information available to aid in the establishment of the identity of a deceased person.\nAfter the coroner or medical examiner has completed the investigation, the coroner or medical examiner shall notify the state archaeologist, according to section 307.08, of all unidentified human remains found outside of platted, recorded, or identified cemeteries and in contexts which indicate antiquity of greater than 50 years.",
	"repealed": false
}