{
	"id": "103G.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.311",
	"title": "103G.311 PERMIT HEARING.",
	"text": "A hearing must be conducted as a contested case hearing under chapter 14.\n(a) The hearing notice on an application must include:\n(1) the date, place, and time fixed by the commissioner for the hearing;\n(2) the waters affected, the water levels sought to be established, or control structures proposed; and\n(3) the matters prescribed by sections 14.57 to 14.59 and rules adopted thereunder.\n(b) A summary of the hearing notice must be published by the commissioner at the expense of the applicant or, if the proceeding is initiated by the commissioner in the absence of an applicant, at the expense of the commissioner.\n(c) The summary of the hearing notice must be:\n(1) published once a week for two successive weeks before the day of hearing in a legal newspaper published in the county where any part of the affected waters is located; and\n(2) mailed or electronically transmitted by the commissioner to the county auditor, the mayor of a municipality, the watershed district, and the soil and water conservation district affected by the application.\n(a) The commissioner may subpoena and compel the attendance of witnesses and the production of books and documents that are material to the purposes of the hearing.\n(b) Disobedience of a subpoena is punishable in the same manner as a contempt of the district court. The commissioner must file a complaint of the disobedience of a subpoena with the district court of the county where the subpoena was disobeyed.\nThe commissioner may waive a hearing on an application and order the permit to be issued or deny the permit.\n(a) If a hearing is waived and an order is made issuing or denying the permit, the applicant, the managers of the watershed district, the board of supervisors of the soil and water conservation district, or the governing body of the municipality may file a demand for hearing on the application. The demand for a hearing must be filed within 30 days after mailed or electronically transmitted notice of the order with the bond required by subdivision 6.\n(b) The commissioner must give notice as provided in subdivision 2, hold a hearing on the application, and make a determination on issuing or denying the permit as though the previous order had not been made.\n(c) The order issuing or denying the permit becomes final at the end of 30 days after mailed or electronically transmitted notice of the order to the applicant, the managers of the watershed district, the board of supervisors of the soil and water conservation district, or the governing body of the municipality, and an appeal of the order may not be taken if:\n(1) the commissioner waives a hearing and a demand for a hearing is not made; or\n(2) a hearing is demanded but a bond is not filed as required by subdivision 6.\n(a) An applicant filing a demand for a public hearing must execute and file a corporate surety bond or equivalent security to the state of Minnesota, to be approved by the commissioner and in an amount and form determined by the commissioner. The bond or security must be conditioned to pay the costs of the hearing if the commissioner's order issuing or denying a permit is affirmed without material modification.\n(b) A bond or security is not required of a public authority that demands a public hearing.\n(c) The commissioner may waive the requirement for a bond or other security.\n(a) Except as provided in paragraphs (b) and (c), the costs of a hearing must be paid as prescribed by chapter 14 and the chief administrative law judge.\n(b) If a hearing is waived by the commissioner, but the applicant other than a public authority demands a hearing on the application and the commissioner's order is affirmed without material modification, the applicant must pay the following costs up to $750:\n(1) costs of the stenographic record and transcript;\n(2) rental costs, if any, of the place where the hearing is held; and\n(3) costs of publication of orders made by the commissioner.\n(c) If a hearing is waived by the commissioner, but a hearing is demanded by a public authority other than the applicant and the commissioner's order is affirmed without material modification, the public authority making the demand must pay:\n(1) costs of the stenographic record and transcript;\n(2) rental costs, if any, of the place where the hearing is held; and\n(3) costs of publication of orders made by the commissioner.",
	"repealed": false
}