{
	"id": "565.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/565.25",
	"title": "565.25 BONDING REQUIREMENTS.",
	"text": "An order for seizure of property from the respondent shall provide that the seizure shall be contingent upon claimant's filing of a bond approved by the court conditioned for the return of the property to the respondent, if a return be adjudged, and for the payment to the respondent of any sum adjudged against the claimant. The bond shall be in an amount which is 1-1/2 times the fair market value of the property seized.\n(a) Except as otherwise provided in paragraph (b) and section 565.251, the respondent may retain or regain possession of the property by filing of a bond approved by the court conditioned that the property shall be delivered to the claimant, if delivery be adjudged, and for the payment to the claimant of any sum adjudged against the respondent. The bond shall be in an amount 1-1/4 times the fair market value of the property or 1-1/2 times the amount of the claimant's claim, whichever is less. An order for seizure may specify a time limitation within which the bond must be filed. For the purpose of protecting or preserving the property pending final hearing on the merits, the court may in extraordinary circumstances, which shall be specified in its order, provide that the respondent may not retain or regain possession of the property upon rebonding, or may limit or condition the right to retain or regain the property upon rebonding. The costs of regaining possession of the property from the sheriff or the claimant shall be borne by respondent except as set forth in paragraph (b).\n(b) If at a hearing following seizure of property pursuant to section 565.24 claimant fails to establish a right to continued possession, the court shall order the property returned to respondent, the costs to be borne by claimant. The court may order claimant's bond to continue in an amount sufficient to offset damages claimed by respondent by reason of the seizure.\nThe current fair market value of the property shall initially be presumed as stated in the affidavit submitted pursuant to section 565.23, subdivision 1. If the court determines the current fair market value of the property is different, it shall adjust the required amount of the bonds.\nIn lieu of filing a bond, either claimant or respondent may satisfy bonding requirements by depositing with the court cash, a cashier's check, or a certified check.",
	"repealed": false
}