{
	"id": "243.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.93",
	"title": "243.93 CORRECTIONAL FACILITY SITE SELECTION COMMITTEE.",
	"text": "(a) An advisory task force is created to coordinate the site selection process for state correctional facilities. The task force shall convene when the legislature authorizes the planning of a new correctional facility. The task force, to be known as the site selection committee, consists of the:\n(1) commissioner of corrections or the commissioner's designee;\n(2) deputy commissioner of corrections who has supervision and control over correctional facilities;\n(3) commissioner of transportation or the commissioner's designee;\n(4) commissioner of administration or the commissioner's designee;\n(5) chairs of the senate Crime Prevention Committee and Crime Prevention Finance Division and the ranking members of that committee and division from the minority political caucus, or the chairs' and ranking members' designees; and\n(6) chairs of the house of representatives Judiciary Committee and Judiciary Finance Division and the ranking members of that committee and division from the minority political caucus or the chairs' and ranking members' designees.\n(b) The chairs of the senate Crime Prevention Finance Division and house of representatives Judiciary Finance Division, or the chairs' designees, shall chair the committee.\nThe committee shall develop a correctional site selection process that most effectively and efficiently utilizes state financial resources for construction of correctional facilities. The committee may include such other factors as the committee considers relevant as criteria for the site selection process.\nBefore recommendation of an individual site for a correctional facility, the committee shall require that all costs associated with the facility and the site be identified and reported, including but not limited to construction costs, site improvement, infrastructure upgrades, and operating costs for that site. The commissioners of administration and corrections and any other agencies involved with site construction or land acquisition shall cooperate with the committee in supplying information described in this subdivision and any other information required for project budgets under section 16B.335.\nThe committee shall report its recommendations for the siting of correctional facilities to the legislature.\nEach site for a new state of Minnesota correctional facility shall be chosen in the law authorizing and providing funding for the facility.\nThe committee may utilize employees from the legislative and executive branch entities with membership on the committee. The Department of Administration shall provide administrative support.",
	"repealed": false
}