{
	"id": "148.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.57",
	"title": "148.57 LICENSE.",
	"text": "(a) A person not authorized to practice optometry in the state and desiring to do so shall apply to the state Board of Optometry by filling out and swearing to an application for a license granted by the board and accompanied by a fee established by the board, not to exceed the amount specified in section 148.59. With the submission of the application form, the candidate shall prove that the candidate:\n(1) is of good moral character;\n(2) has obtained a clinical doctorate degree from a board-approved school or college of optometry, or is currently enrolled in the final year of study at such an institution; and\n(3) has passed all parts of an examination.\n(b) The examination shall include both a written portion and a clinical practical portion and shall thoroughly test the fitness of the candidate to practice in this state. In regard to the written and clinical practical examinations, the board may:\n(1) prepare, administer, and grade the examination itself;\n(2) recognize and approve in whole or in part an examination prepared, administered and graded by a national board of examiners in optometry; or\n(3) administer a recognized and approved examination prepared and graded by or under the direction of a national board of examiners in optometry.\n(c) The board shall issue a license to each applicant who satisfactorily passes the examinations and fulfills the other requirements stated in this section.\n(a) An optometrist who holds a current license from another state, and who has practiced in that state not less than three years immediately preceding application, may apply for licensure in Minnesota by filling out and swearing to an application for license by endorsement furnished by the board. The completed application with all required documentation shall be filed at the board office along with a fee established by the board, not to exceed the amount specified in section 148.59. The application fee shall be for the use of the board and in no case shall be refunded.\n(b) To verify that the applicant possesses the knowledge and ability essential to the practice of optometry in this state, the applicant must provide evidence of:\n(1) having obtained a clinical doctorate degree from a board-approved school or college of optometry;\n(2) successful completion of both written and practical examinations for licensure in the applicant's original state of licensure that thoroughly tested the fitness of the applicant to practice;\n(3) successful completion of an examination of Minnesota state optometry laws;\n(4) compliance with the requirements in section 148.575;\n(5) compliance with all continuing education required for license renewal in every state in which the applicant currently holds an active license to practice; and\n(6) being in good standing with every state board from which a license has been issued.\n(c) Documentation from a national certification system or program, approved by the board, which supports any of the listed requirements, may be used as evidence. The applicant may then be issued a license if the requirements for licensure in the other state are deemed by the board to be equivalent to those of sections 148.52 to 148.62.\n[Repealed, 2015 c 71 art 10 s 34]\n[Repealed, 2015 c 71 art 10 s 34]\nA person regulated by the board shall maintain a current name and address with the board and shall notify the board in writing within 30 days of any change in name or address. If a name change only is requested, the regulated person must request revised credentials and return the current credentials to the board. The board may require the regulated person to substantiate the name change by submitting official documentation from a court of law or agency authorized under law to receive and officially record a name change. If an address change only is requested, no request for revised credentials is required. If the regulated person's current credentials have been lost, stolen, or destroyed, the person shall provide a written explanation to the board.\n(a) Applicants seeking licensure according to this subdivision must be:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license application, and has confirmation of an honorable or general discharge status.\n(b) A qualified applicant under this subdivision must provide evidence of:\n(1) a current valid license, certificate, or permit in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(c) A temporary license issued under this subdivision is effective for six months from the initial temporary licensure date.\n(d) During the temporary license period, the individual shall complete the licensed optometrist application for licensure.\n(e) In order to remain licensed after the expiration of the temporary license, an individual must meet the requirements in section 148.57, subdivisions 1 and 2.",
	"repealed": false
}