{
	"id": "290.0684",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0684",
	"title": "290.0684 SECTION 529 PLAN CREDIT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Contribution\" means the amount contributed to one or more qualified accounts except that the amount:\n(1) is reduced by any withdrawals or distributions, other than transfers or rollovers to another qualified account, from a qualified account during the taxable year; and\n(2) excludes the amount of any transfers or rollovers from a qualified account made during the taxable year.\n(c) \"Adjusted gross income\" has the meaning given under section 62(a) of the Internal Revenue Code.\n(d) \"Qualified account\" means an account qualifying under section 529 of the Internal Revenue Code.\n(a) An individual who is a resident of Minnesota is allowed a credit against the tax imposed by this chapter. The credit is not allowed to an individual who is eligible to be claimed as a dependent, as defined in sections 151 and 152 of the Internal Revenue Code. The credit may not exceed the liability for tax under this chapter.\n(b) The amount of the credit allowed equals 50 percent of contributions for the taxable year. The maximum credit is $500, subject to the phaseout in paragraphs (c) and (d). In no case is the credit less than zero.\n(c) For individual filers, the maximum credit is reduced by two percent of adjusted gross income in excess of $78,340.\n(d) For married couples filing a joint return, the maximum credit is phased out as follows:\n(1) for married couples with adjusted gross income in excess of $78,340, but not more than $141,010, the maximum credit is reduced by one percent of adjusted gross income in excess of $78,340 until the maximum credit amount equals $250; and\n(2) for married couples with adjusted gross income in excess of $141,010, the maximum credit is $250, reduced by one percent of adjusted gross income in excess of $141,010.\n(e) The commissioner shall annually adjust the income thresholds in paragraphs (c) and (d) as provided in section 270C.22. The statutory year is taxable year 2019.\nFor a part-year resident, the credit must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).",
	"repealed": false
}