{
	"id": "352B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/352B.10",
	"title": "352B.10 DISABILITY BENEFITS.",
	"text": "(a) A member who is determined to qualify for duty disability as defined in section 352B.011, subdivision 7, is entitled to receive a duty disability benefit while disabled. The benefits must be paid monthly. The duty disability benefit is an amount equal to the member's average monthly salary multiplied by 60 percent, plus an additional 3.0 percent for each year and pro rata for completed months of service in excess of 20 years, if any.\n(b) Notwithstanding paragraph (a), if the member has applied for a duty disability based on a psychological condition, the application must be supported by evidence that the applicant is unable to perform the duties of the position held by the applicant on the date of the injury or event or the onset of the mental illness or of another position with the employer which provides salary and employer-provided benefits, including pension benefits, that are equal to or greater than those for the position held by the employee on the date of the injury, event, or onset of the mental illness.\n(a) A member who is determined to qualify for a total and permanent duty disability as defined in section 352B.011, subdivision 14, is entitled to receive a monthly disability benefit in an amount equal to 99 percent of the member's average monthly salary.\n(b) The benefit of a member receiving a total and permanent duty disability benefit whose condition is found to no longer qualify as a total and permanent duty disability but whose condition continues to qualify as a duty disability under section 352B.011, subdivision 7, must be recalculated as a duty disability benefit under subdivision 1. Payment of the total and permanent duty disability benefit must cease following the last monthly payment occurring before 60 days after the executive director notifies the member that the member is no longer eligible for total and permanent duty disability benefits. Payment of the recalculated duty disability benefit must commence on the first day of the month following 60 days after the notice by the executive director.\nA member with at least one year of service who qualifies for a regular disability benefit as defined in section 352B.011, subdivision 12, is entitled to a regular disability benefit. The regular disability benefit must be computed as if the individual were 55 years old at the date of disability and as if the annuity was payable under section 352B.08. If a regular disability under this subdivision occurs after one year of service but before 15 years of service, the regular disability benefit must be computed as though the individual had credit for 15 years of service.\nNo application for disability benefits shall be made until after the last day physically on the job. The disability benefit begins to accrue the day following the last day for which the employee is paid sick leave or annual leave but not earlier than 180 days before the date the application is filed. A member who is terminated must file a written application in an office of the system or with a person authorized by the executive director. Except as otherwise specified under section 352B.102, applications must comply with section 352.113, subdivision 2, paragraph (b).\nNo member is entitled to receive a disability benefit payment when the member has unused annual leave or sick leave, or under any other circumstances when, during the period of disability, there has been no impairment of salary. If the disabilitant resumes gainful employment, the disability benefit must be continued in an amount which, when added to current earnings, does not exceed the salary rate received by the person at the date of disability, which must be adjusted over time by the percentage increase in United States average wages used by the Social Security Administration in calculating average indexed monthly earnings for the old age, survivors, and disability insurance programs for the same period.\n(a) No disability benefits may be paid unless the member provides adequate proof to the executive director of the existence of the disability.\n(b) Adequate proof of a disability must include a written expert report by a licensed physician, an APRN, or a licensed chiropractor, or with respect to a mental impairment, by a licensed psychologist. Adequate proof of a disability based on a psychological condition, as defined under section 352B.102, subdivision 1, clause (6), must include the medical reports and assessments required under section 352B.102.\n(c) Following the commencement of benefit payments, the executive director has the right, at reasonable times, to require the disability benefit recipient to submit proof of the continuance of the disability claimed.\nA disabilitant may elect, in lieu of spousal survivorship coverage under section 352B.11, subdivision 2b, the normal disability benefit or an optional annuity as provided in section 352B.08, subdivision 3. The choice of an optional annuity must be made in writing, on a form prescribed by the executive director, and may be made before the commencement of the payment of the disability benefit. If the disabilitant did not select an optional annuity at the time of application, the disabilitant may select an optional annuity under this section within 90 days before reaching age 55 or within 90 days before reaching the five-year anniversary of the effective date of the disability benefit, whichever is later. The optional annuity is effective on the date on which the disability benefit begins to accrue, or the month following the attainment of age 55 or following the five-year anniversary of the effective date of the disability benefit, whichever is later.\nA disability benefit under this section is eligible for postretirement adjustments under section 356.415.\nDisability benefit recipients must report all earnings from reemployment and income from workers' compensation to the system annually by May 15 in a format prescribed by the executive director. If the form is not submitted by June 15, benefits must be suspended effective July 1. If the form deemed acceptable by the executive director is received after the June 15 deadline, benefits shall be reinstated retroactive to July 1.",
	"repealed": false
}