{
	"id": "219.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.501",
	"title": "219.501 RAIL CARRIER WALKWAYS.",
	"text": "(a) Rail carriers must provide walkways adjacent to those portions of yard tracks where rail carrier employees frequently work on the ground performing switching activities. For purposes of this section, \"frequently work\" means at least five days per week, one shift per day.\n(b) This section applies to reconstruction and new construction of yard track completed after July 1, 2008.\n(c) This section does not apply to an entity that owns or operates track in this state other than Class I and Class II rail carriers as classified by the Federal Railroad Administration.\n(a) Walkways constructed pursuant to this section may be surfaced with asphalt, concrete, planking, grating, native material, crushed material, or other similar nonrevenue material. When crushed material is used, 100 percent of the material must be capable of passing through a 1-1/2-inch square sieve opening, and at least 90 percent of the material must be capable of passing through a one-inch square sieve opening provided, however, a de minimus variation is not a violation of this section where the rail carrier has made a good-faith effort to comply with the percentage requirements. Smaller crushed material is preferable, where drainage and durability issues do not arise. Material that is three-quarter inch or less in size is recommended for switching lead tracks.\n(b) Walkways must have a reasonably uniform surface and must be maintained in a safe condition without compromising track drainage.\n(c) Cross slopes for walkways must not exceed one inch of elevation for each eight inches of horizontal length in any direction.\n(d) Walkways must be a minimum width of two feet.\n(e) Walkways regulated under this section must be kept reasonably clear of spilled fuel, oil, sand, posts, rocks, and other hazards or obstructions.\nRail carriers are not required to comply with the requirements of this section during (1) maintenance activities or any period of heavy rain or snow, derailments, rock and earth slides, washouts, and similar weather or seismic conditions, and (2) during a reasonable period after any occurrences identified in clause (1) in order to allow a return to compliance.\nUpon written request of a rail carrier, the commissioner may waive any portion of this section where conditions do not reasonably allow compliance. A decision of the commissioner is subject to the requirements under section 218.041.",
	"repealed": false
}