{
	"id": "257.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.69",
	"title": "257.69 RIGHT TO COUNSEL; COSTS; FREE TRANSCRIPT ON APPEAL.",
	"text": "In all proceedings under sections 257.51 to 257.74, any party may be represented by counsel. The county attorney shall represent the public authority. In proceedings under sections 257.51 to 257.74, the court shall appoint counsel for a party who would be financially unable to obtain counsel under the guidelines set forth in section 611.17. The representation of appointed counsel is limited in scope to the issue of establishment of parentage.\n(a) The court may order expert witness and guardian ad litem fees and other costs of the trial and pretrial proceedings, including appropriate tests, to be paid by the parties in proportions and at times determined by the court. The court shall require a party to pay part of the fees of court-appointed counsel according to the party's ability to pay, but if counsel has been appointed the appropriate agency shall pay the party's proportion of all other fees and costs. The agency responsible for child support enforcement shall pay the fees and costs for blood or genetic tests in a proceeding in which it is a party, is the real party in interest, or is acting on behalf of the child. However, at the close of a proceeding in which paternity has been established under sections 257.51 to 257.74, the court shall order the adjudicated father to reimburse the public agency, if the court finds he has sufficient resources to pay the costs of the blood or genetic tests. When a party bringing an action is represented by the county attorney, no filing fee shall be paid to the court administrator.\n(b) In each fiscal year, the commissioner of management and budget shall deposit guardian ad litem reimbursements in the special revenue fund and credit them to a separate account with the State Guardian Ad Litem Board. The balance of this account is appropriated to the State Guardian Ad Litem Board and does not cancel but is available until expended. Revenue from this account must be spent in the judicial district in which the reimbursement is collected.\nIf a party is financially unable to pay the cost of a transcript, the court shall furnish on request a transcript for purposes of appeal.",
	"repealed": false
}