{
	"id": "120B.252",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.252",
	"title": "120B.252 HOLOCAUST, GENOCIDE OF INDIGENOUS PEOPLES, AND OTHER GENOCIDE EDUCATION.",
	"text": "(a) \"Holocaust and genocide studies\" means interdisciplinary teaching and learning about the causes, impacts, and legacies of the Holocaust, other genocides, and incidents of mass violence.\n(b) \"Holocaust\" means the systematic, state-sponsored persecution and murder of 6,000,000 Jews by the Nazi regime and its allies and collaborators.\n(c) \"Genocide\" means an internationally recognized crime where acts are committed with the intent to destroy, in whole or in part, a national, ethnic, racial, or religious group. Acts of genocide, as defined by the United Nations and the Rome Statute, include the following categories:\n(1) killing members of the group;\n(2) causing serious bodily or mental harm to members of the group;\n(3) deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part;\n(4) imposing measures intended to prevent births within the group; or\n(5) forcibly transferring children of the group to another group.\nGenocide also means a series of purposeful actions by a perpetrator or perpetrators to destroy a collectivity through mass or selective murders of group members and suppressing the biological and social reproduction of the collectivity. The perpetrator or perpetrators may represent the state of the victim, another state, or another collectivity.\n(d) \"Incidents of mass violence\" means extreme violence deliberately inflicted on a large scale on civilians or noncombatants by state or nonstate actors. Incidents of mass violence encompass the international crimes of genocide, crimes against humanity, war crimes, and terrorism.\n(e) \"Center for Holocaust and Genocide Studies\" means the Center for Holocaust and Genocide Studies at the University of Minnesota.\n(a) A school district must, at a minimum, offer as part of its social studies curriculum for middle and high school education on the Holocaust, genocide of Indigenous Peoples, and other genocides. Curriculum must:\n(1) examine the history of the genocide of Indigenous Peoples and Indigenous removal from Minnesota, including the genocide, dispossession, and forced removal of the Dakota, Ojibwe, and Ho-Chunk;\n(2) analyze the connections between World War II, nationalism, fascism, antisemitism, and the Holocaust;\n(3) analyze how individuals, groups, and societies around the world have been affected by genocide and mass violence, especially those experienced by communities expelled from, resettled in, migrated to, or living in Minnesota; and\n(4) describe and evaluate different responses to genocides and other human rights violations.\n(b) Public schools are strongly encouraged to include in middle and high school social studies curriculum context about the history, culture, and traditions of the communities devastated by the Holocaust, genocide of Indigenous Peoples, other genocides, and incidents of mass violence.\n(c) School districts are strongly encouraged to include the Holocaust, genocide of Indigenous Peoples, other genocides, and incidents of mass violence in middle and high school English language arts curriculum.\n(d) A school district must provide Holocaust and genocide education as part of its curriculum in middle and high school by the 2026-2027 school year in accordance with Department of Education rulemaking on social studies standards and benchmarks.",
	"repealed": false
}