{
	"id": "51A.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.38",
	"title": "51A.38 LOAN PLANS.",
	"text": "Real estate loans and other loans secured by a mortgage on real estate that are eligible for investment by an association under sections 51A.01 to 51A.57 may be written according to this section and section 51A.386, or upon any other plan approved by the commissioner.\nNo investment in a real estate loan, the proceeds of which are used for the purchase of the real estate, shall be made until a qualified person or persons approved by the board of directors shall have made a physical inspection and submitted a signed appraisal of the value of the real estate securing such loan.\nPayments on real estate loans shall be applied first to other charges, and the payment of interest on the unpaid balance of the loan, in the manner determined by the association, and the remainder on the reduction of principal. All loans may be prepaid in part or in full, at any time. An association may charge a borrower a prepayment fee on any loan that is not a consumer loan. Unless otherwise agreed in writing, any prepayment of principal on any loan may, at the option of the association, be applied on the final installment of the note or other obligation until fully paid, and thereafter on the installments in the inverse order of their maturity, or, at the option of the association, the payments may be applied from time to time wholly or partially to offset payments which subsequently accrue under the loan contract.\nEvery loan shall be evidenced by a note or instrument of obligation for the amount of the loan. The note or instrument shall specify the amount, rate of interest, or manner of calculating the rate of interest of a variable rate loan, and terms of repayment including any prepayment penalty or charge for late payment, mortgage assumption fee, and may contain all other terms of the loan contract.\nEvery loan secured by a mortgage on real property, including a real estate loan, shall be evidenced by a mortgage, deed of trust, or other transaction or instrument constituting a lien or claim upon the real estate securing the loan, according to any lawful and recognized practice which is suited to the transaction. Any such instrument or transaction shall provide specifically for the usual insurance risks, ground rents, taxes, assessments, other governmental levies, maintenance, and repairs. It may provide for an assignment of rents, and if such assignment is made, any such assignment shall be absolute upon the borrower's default, becoming operative upon written demand made by the association. All such mortgages shall be recorded in accordance with the law of this state.\n[Repealed, 1988 c 666 s 75]\nAn association may pay taxes, assessments, ground rents, insurance premiums, and other similar charges for the protection of any loan secured by a mortgage on real property, including a real estate loan. All such payments shall be added to the unpaid balance of the loan and shall be equally secured by the lien on the property. An association may require life insurance to be assigned as additional collateral upon any real estate loan. In such event, the association shall obtain a lien upon such policy and may advance premiums thereon, and such premium advances shall be added to the unpaid balance of the loan and shall be equally secured by a lien on the property as provided above.\nAn association may require a borrower on any loan secured by a mortgage on real property, including a real estate loan, to pay monthly in advance, in addition to interest or interest and principal payments, the equivalent of 1/12 of the estimated annual taxes, assessments, insurance premiums, ground rents, and other charges upon the real estate securing a loan, or any of such charges, so as to enable the association to pay such charges as they become due from the funds so received. The amount of such monthly charges may be increased or decreased so as to provide reasonably for the payment of the estimated annual taxes, assessment, insurance premiums, and other charges. The association at its option may hold such funds in trust and commingle them with other such funds and use the same for such purposes, or hold such funds in open account and commingle them with its own funds and advance like amounts for such purposes, or credit such funds as received to the mortgage account and advance a like amount for the purposes stated. If such funds are held in trust or invested in savings accounts, the amounts may be pledged to further secure the indebtedness and, if held in open account or credited to the loan account, the amounts when advanced for the purposes stated may be secured by the mortgage with the same priority as the original amount advanced under the mortgage. The association shall have no obligation to pay interest, earnings, or other increment to the borrower upon such monthly payments, nor to invest the same for the benefit of the borrower, unless such funds have been placed in a savings account or accounts in the borrower's name. Every association shall keep a record of the status of taxes, assessments, insurance, ground rents, and other charges on all real estate securing its real estate loans and on all real and other property owned by it.",
	"repealed": false
}