{
	"id": "17.9896",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.9896",
	"title": "17.9896 CERTIFICATION PROCEDURES.",
	"text": "A producer who seeks certification of eligible land shall conduct an initial assessment using the certification instrument, obtain technical assistance if necessary to achieve a satisfactory score on the certification instrument, and apply for certification from a licensed certifying agent.\nOnce certified, if a producer obtains ownership of additional agricultural land, the producer must notify a certifying agent and obtain certification of the additional land within one year in order to retain the producer's original certification.\nOnce certified, if a producer leases additional land, then the producer must notify a certifying agent before farming operations commence on the newly leased land. A producer who operates leased land is not required to implement practices that permanently alter the landscape in order to be certified or remain certified if the land is added following the original certification. A producer who operates leased land must demonstrate sufficient annual crop management practices, consistent with the original certification agreement, in order to remain certified.\n(a) The commissioner may revoke a certification if the producer violates subdivision 2 or 3.\n(b) The commissioner may revoke a certification and seek reimbursement of any monetary benefit a producer may have received due to certification from a producer who fails to maintain certification criteria.\n(c) If the commissioner revokes a certification, the producer has 30 days from the date of suspension or revocation to appeal. If a producer appeals, the commissioner shall hold an administrative hearing within 30 days of the suspension or revocation of the certification, or longer by agreement of the parties, to determine whether the certification is revoked or suspended. The commissioner shall issue an opinion within 30 days. If the producer notifies the commissioner that the producer intends to contest the commissioner's opinion, the Office of Administrative Hearings shall conduct a hearing in accordance with the applicable provisions of chapter 14 for hearings in contested cases.",
	"repealed": false
}