{
	"id": "97C.345",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.345",
	"title": "97C.345 RESTRICTIONS ON USING AND POSSESSING NETS AND SPEARS.",
	"text": "Except as specifically authorized, a person may not take fish with a spear from the third Monday in February to the Friday before the last Saturday in April and may not take fish with a fish trap, net, dip net, seine, or other device capable of taking fish from the third Monday in February through April 30.\n(a) Except as specifically authorized, a person may not possess a spear, fish trap, net, dip net, seine, or other device capable of taking fish on or near any waters. Possession includes personal possession and in a vehicle.\n(b) A person may possess dip nets and spear guns allowed under section 97C.381 on or near waters between sunrise and sunset from May 1 to the last Sunday in February, or as otherwise prescribed by the commissioner. A person may possess a spear on or near waters between sunrise and sunset from the last Saturday in April to the last Sunday in February, or as otherwise prescribed by the commissioner.\nA person may possess and use a dip net between one hour before sunrise and one hour after sunset from May 1 to the third Sunday in February.\nMS 2016 [Expired, 1Sp2015 c 4 art 5 s 28]\n(a) Cast nets may be used only to take gizzard shad for use as bait for angling from July 1 to November 30 as allowed under section 84D.03, subdivision 3.\n(b) Cast nets used under this subdivision must be monofilament and may not exceed five feet in radius. Mesh size must be from three-eighths-inch to five-eighths-inch bar measure. A person may use up to two cast nets at one time.\nSubdivisions 1 to 3 do not apply to:\n(1) nets used to take rainbow smelt during the open season;\n(2) nets used to land game fish taken by angling;\n(3) seines or traps used for the taking of minnows for bait;\n(4) nets, seines, or traps possessed and used under an aquatic farm license; and\n(5) angling equipment.\nThe commissioner may adopt rules to regulate the use of nets to take fish.",
	"repealed": false
}