{
	"id": "62D.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.30",
	"title": "62D.30 DEMONSTRATION PROJECTS.",
	"text": "The commissioner of health may establish demonstration projects to allow health maintenance organizations to extend coverage to:\n(1) individuals enrolled in Part A or Part B, or both, of the Medicare program, Title XVIII of the Social Security Act, United States Code, title 42, section 1395 et seq.;\n(2) groups of fewer than 50 employees where each group is covered by a single group health policy;\n(3) individuals who are not eligible for enrollment in any group health maintenance contracts; and\n(4) low income population groups.\nFor purposes of this section, the commissioner of health may waive compliance with minimum benefits pursuant to sections 62A.151 and 62D.02, subdivision 7, full financial risk pursuant to section 62D.04, subdivision 1, clause (f), open enrollment pursuant to section 62D.10, and to applicable rules if there is reasonable evidence that the rules prohibit the operation of the demonstration project. The commissioner shall provide for public comment before any statute or rule is waived.\nA demonstration project must provide health benefits equal to or exceeding the level of benefits provided in Title XVIII of the Social Security Act and an out of hospital prescription drug benefit. The out of hospital prescription drug benefit may be waived by the commissioner if the health maintenance organization presents evidence satisfactory to the commissioner that the inclusion of the benefit would restrict the operation of the demonstration project.\nA health maintenance organization electing to participate in a demonstration project shall apply to the commissioner for approval on a form developed by the commissioner. The application shall include at least the following:\n(1) a statement identifying the population that the project is designed to serve;\n(2) a description of the proposed project including a statement projecting a schedule of costs and benefits for the enrollee;\n(3) reference to the sections of Minnesota Statutes and Department of Health rules for which waiver is requested;\n(4) evidence that application of the requirements of applicable Minnesota Statutes and Department of Health rules would, unless waived, prohibit the operation of the demonstration project;\n(5) evidence that another arrangement is available for assumption of full financial risk if full financial risk is waived under subdivision 1;\n(6) an estimate of the number of years needed to adequately demonstrate the project's effects; and\n(7) other information the commissioner may reasonably require.\nThe commissioner shall approve, deny, or refer back to the health maintenance organization for modification, the application for a demonstration project within 60 days of receipt from the health maintenance organization.\nThe commissioner may approve an application for a demonstration project for a maximum of six years, with an option to renew.\nEach health maintenance organization for which a demonstration project is approved shall annually file a report with the commissioner summarizing the project's experience at the same time it files its annual report required by section 62D.08. The report shall be on a form developed by the commissioner and shall be separate from the annual report required by section 62D.08.\nThe commissioner may rescind approval of a demonstration project if the commissioner makes any of the findings listed in section 62D.15, subdivision 1, with respect to the project for which it has not been granted a specific exemption, or if the commissioner finds that the project's operation is contrary to the information contained in the approved application.\n(a) The commissioner may permit demonstration projects to allow health maintenance organizations to extend coverage to a health improvement and purchasing coalition located in rural Minnesota, comprised of the health maintenance organization and members from a geographic area. For purposes of this subdivision, rural is defined as greater Minnesota excluding the seven-county metropolitan area of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington. The coalition must be designed in such a way that members will:\n(1) become better informed about health care trends and cost increases;\n(2) be actively engaged in the design of health benefit options that will meet the needs of their community;\n(3) pool their insurance risk;\n(4) purchase these products from the health maintenance organization involved in the demonstration project; and\n(5) actively participate in health improvement decisions for their community.\n(b) The commissioner must consider the following when approving applications for rural demonstration projects:\n(1) the extent of consumer involvement in development of the project;\n(2) the degree to which the project is likely to reduce the number of uninsured or to maintain existing coverage; and\n(3) a plan to evaluate and report to the commissioner and legislature as prescribed by paragraph (e).\n(c) For purposes of this subdivision, the commissioner must waive compliance with the following statutes and rules: the cost-sharing restrictions under section 62D.095, subdivisions 2, 3, and 4, and Minnesota Rules, part 4685.0801, subparts 1 to 7; for a period of at least two years, participation in government programs under section 62D.04, subdivision 5, in the counties of the demonstration project if that compliance would have been required solely due to participation in the demonstration project and shall continue to waive this requirement beyond two years if the enrollment in the demonstration project is less than 10,000 enrollees; small employer marketing under section 62L.05, subdivisions 1 to 3; and small employer geographic premium variations under section 62L.08, subdivision 4. The commissioner shall approve enrollee cost-sharing features desired by the coalition that appropriately share costs between employers, individuals, and the health maintenance organization.\n(d) The health maintenance organization may make the starting date of the project contingent upon a minimum number of enrollees as cited in the application, provide for an initial term of contract with the purchasers of a minimum of three years, and impose a reasonable penalty for employers who withdraw early from the project. For purposes of this subdivision, loss ratios are to be determined as if the policies issued under this section are considered individual or small employer policies pursuant to section 62A.021, subdivision 1, paragraph (f). The health maintenance organization may consider businesses of one to be a small employer under section 62L.02, subdivision 26. The health maintenance organization may limit enrollment and establish enrollment criteria for businesses of one. Health improvement and purchasing coalitions under this subdivision are not associations under section 62L.045, subdivision 1, paragraph (a).\n(e) The health improvement and purchasing coalition must report to the commissioner and legislature annually on the progress of the demonstration project and, to the extent possible, any significant findings in the criteria listed in clauses (1), (2), and (3) for the final report. The coalition must submit a final report five years from the starting date of the project. The final report must detail significant findings from the project and must include, to the extent available, but should not be limited to, information on the following:\n(1) the extent to which the project had an impact on the number of uninsured in the project area;\n(2) the effect on health coverage premiums for groups in the project's geographic area, including those purchasing health coverage outside the health improvement and purchasing coalition; and\n(3) the degree to which health care consumers were involved in the development and implementation of the demonstration project.\n(f) The commissioner must limit the number of demonstration projects under this subdivision to five projects.\n(g) Approval of the application for the demonstration project is deemed to be in compliance with section 62E.06, subdivisions 1, paragraph (a), 2, and 3.\n(h) Subdivisions 2 to 7 apply to demonstration projects under this subdivision. Waivers permitted under subdivision 1 do not apply to demonstration projects under this subdivision.\n(i) If a demonstration project under this subdivision works in conjunction with a purchasing alliance formed under chapter 62T, that chapter will apply to the purchasing alliance except to the extent that chapter 62T is inconsistent with this subdivision.",
	"repealed": false
}