{
	"id": "116J.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.80",
	"title": "116J.80 MASTER APPLICATION PROCEDURE.",
	"text": "The bureau shall develop and implement a master application procedure to expedite the identification and processing of licenses for business undertakings, projects, and activities. A master application shall be made on a form prescribed by the bureau. This form shall request concise and specific information necessary to determine those licenses which are or may be required for the undertaking, project, or activity in order to insure speedy issuance of the licenses when all necessary requirements are met.\nUse of the master application procedure shall be at the option of any person proposing a business undertaking, project, or activity. Upon request, the bureau shall assist any person in preparing a master application, describe the procedures involved, and provide other information from the comprehensive license information file as may be helpful or necessary.\nUpon receipt of a master application the bureau shall immediately notify in writing each agency having a possible interest in the proposed business undertaking, project, or activity with respect to licenses which are or may be required.\nEach agency so notified shall respond to the bureau within 20 days of receipt of the notice and shall advise the bureau whether one or more licenses under its jurisdiction are or may be required for the business undertaking, project, or activity described in the master application. The response shall specify the licenses which in the opinion of the agency are or may be required, if any, and shall indicate the fees to be charged.\nAny agency so notified which responds that it does not have an interest in the license requirements of the business undertaking, project, or activity described in the master application, or which does not respond within the time period specified in subdivision 4, shall not require a license for the undertaking, project, or activity described in the master application. Except that where unusual circumstances have prevented an agency from notifying the bureau, and the agency establishes that failure to require a license would result in substantial harm to the public health or welfare, the commissioner may order that the license be required.\nThe provisions of subdivision 5 shall not apply if the commissioner of employment and economic development determines that the master application contained false, misleading, or deceptive information, or failed to include pertinent information, the lack of which could reasonably lead an agency to misjudge the applicability of licenses under its jurisdiction, or if new license requirements or related standards subsequently became effective for which an agency had no discretion in establishing the effective date.\nThe bureau, following the 20 day notice and response period, shall promptly provide the person having submitted a master application with application forms and related information for all licenses specified by the interested agencies and shall advise the person:\n(1) that all forms are to be completed and submitted to the interested agencies; and\n(2) at the option of the applicant, that the bureau will receive all forms as a package with the fees to be charged, if any, and that the bureau will immediately separate and submit the forms and any allocable fees to the appropriate agencies.\nAn applicant may withdraw a master application at any time without forfeiture of any license approval applied for or obtained under the master application procedures contained in this section.",
	"repealed": false
}