{
	"id": "515B.2-109",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-109",
	"title": "515B.2-109 COMMON ELEMENTS AND LIMITED COMMON ELEMENTS.",
	"text": "(a) Except as limited by the declaration or this chapter, common elements other than limited common elements may be used in common by all unit owners. Limited common elements are designated for the exclusive use of the unit owners of the unit or units to which the limited common elements are allocated, subject to subsection (b) and the rights of the association as set forth in the declaration, the bylaws or this chapter.\n(b) Except for the limited common elements described in subsections (c) and (d), the declaration shall specify to which unit or units each limited common element is allocated.\n(c) Unless otherwise provided in the declaration, if any chute, flue, duct, wire, pipe, conduit, bearing wall, bearing column, or other fixture or improvement: (i) serves one or more but fewer than all units and is located wholly or partially outside the unit boundaries, it is a limited common element allocated solely to the unit or units served; (ii) serves all units or any portion of the common elements, it is a part of the common elements; or (iii) serves only the unit and is located wholly within the unit boundaries, it is a part of the unit.\n(d) Unless otherwise provided in the declaration, improvements such as shutters, awnings, window boxes, doorsteps, stoops, porches, balconies, decks, patios, perimeter doors and windows, and their frames, constructed as part of the original construction to serve a single unit or units, and authorized replacements and modifications thereof, if located wholly or partially outside the unit boundaries, are limited common elements allocated solely to the unit or units served.\n(e) If the declaration so provides, and subject to any different licensing provisions in a declaration recorded before August 1, 2010, the declarant may grant to a unit owner an exclusive license for the use of a common element originally designed and constructed to serve as a garage stall, storage locker, or other similar common element space, in which case the common element license shall be deemed to be appurtenant to the unit owner's unit, subject to transfer if so provided by the declaration. The declarant shall, at the time the license is granted, provide to the unit owner a common element license evidenced by a separate instrument signed by the declarant and provide a copy of the instrument to the association. The instrument shall, at a minimum, identify the licensed common element, the unit identifier of the unit to which it is appurtenant, and the section of the declaration governing common element licenses. If the declaration so provides, the declarant may require the onetime payment to the declarant of a consideration for the grant of a license.\n(1) A common element license may be held only by a unit owner, and the purported transfer of a license to a person other than a unit owner shall be void. Except as provided in the declaration or this subsection, no interest in the common element license may be held or transferred separate from the unit.\n(2) The right of any declarant to grant a common element license shall terminate at the earlier of (i) the conveyance of all units to persons other than a declarant or (ii) ten years after the recording of the declaration.\n(3) The document granting the common element license shall not be recorded. The association shall maintain records of all common element licenses including originals or copies of the common element licenses and transfers of common element licenses authorized by the declaration.\n(4) A common element license granted pursuant to this subsection shall not be subject to the approval requirements set forth in section 515B.3-102(a)(9).\n(f) An allocation of limited common elements may be changed by an amendment to the declaration executed by the unit owners between or among whose units the reallocation is made and the association. The amendment shall be approved by the board of directors of the association as to form, and compliance with the declaration and this chapter. The association shall establish fair and reasonable procedures and time frames for the submission and processing of the reallocations, and shall maintain records thereof. If approved, the association shall cause the amendment to be recorded promptly. The amendment shall be effective when recorded. The association may require the unit owners requesting the reallocation to pay all fees and costs for reviewing, preparing and recording the amendment and any amended CIC plat.",
	"repealed": false
}