{
	"id": "144G.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.41",
	"title": "144G.41 MINIMUM ASSISTED LIVING FACILITY REQUIREMENTS.",
	"text": "All assisted living facilities shall:\n(1) distribute to residents the assisted living bill of rights;\n(2) provide services in a manner that complies with the Nurse Practice Act in sections 148.171 to 148.285;\n(3) utilize a person-centered planning and service delivery process;\n(4) have and maintain a system for delegation of health care activities to unlicensed personnel by a registered nurse, including supervision and evaluation of the delegated activities as required by the Nurse Practice Act in sections 148.171 to 148.285;\n(5) provide a means for residents to request assistance for health and safety needs 24 hours per day, seven days per week;\n(6) allow residents the ability to furnish and decorate the resident's unit within the terms of the assisted living contract;\n(7) permit residents access to food at any time;\n(8) allow residents to choose the resident's visitors and times of visits;\n(9) allow the resident the right to choose a roommate if sharing a unit;\n(10) notify the resident of the resident's right to have and use a lockable door to the resident's unit. The licensee shall provide the locks on the unit. Only a staff member with a specific need to enter the unit shall have keys, and advance notice must be given to the resident before entrance, when possible. An assisted living facility must not lock a resident in the resident's unit;\n(11) develop and implement a staffing plan for determining its staffing level that:\n(i) includes an evaluation, to be conducted at least twice a year, of the appropriateness of staffing levels in the facility;\n(ii) ensures sufficient staffing at all times to meet the scheduled and reasonably foreseeable unscheduled needs of each resident as required by the residents' assessments and service plans on a 24-hour per day basis; and\n(iii) ensures that the facility can respond promptly and effectively to individual resident emergencies and to emergency, life safety, and disaster situations affecting staff or residents in the facility;\n(12) ensure that one or more persons are available 24 hours per day, seven days per week, who are responsible for responding to the requests of residents for assistance with health or safety needs. Such persons must be:\n(i) awake;\n(ii) located in the same building, in an attached building, or on a contiguous campus with the facility in order to respond within a reasonable amount of time;\n(iii) capable of communicating with residents;\n(iv) capable of providing or summoning the appropriate assistance; and\n(v) capable of following directions; and\n(13) provide staff access to an on-call registered nurse 24 hours per day, seven days per week.\n(a) All assisted living facilities must offer to provide or make available at least three nutritious meals daily with snacks available seven days per week, according to the recommended dietary allowances in the United States Department of Agriculture (USDA) guidelines, including seasonal fresh fruit and fresh vegetables. The menus must be prepared at least one week in advance, and made available to all residents. The facility must encourage residents' involvement in menu planning. Meal substitutions must be of similar nutritional value if a resident refuses a food that is served. Residents must be informed in advance of menu changes. The facility must not require a resident to include and pay for meals in the resident's contract. Except as provided in paragraph (b), food must be prepared and served according to the Minnesota Food Code, Minnesota Rules, chapter 4626.\n(b) For an assisted living facility with a licensed capacity of ten or fewer residents:\n(1) notwithstanding Minnesota Rules, part 4626.0033, item A, the facility may share a certified food protection manager (CFPM) with one other facility located within a 60-mile radius and under common management provided the CFPM is present at each facility frequently enough to effectively administer, manage, and supervise each facility's food service operation;\n(2) notwithstanding Minnesota Rules, part 4626.0545, item A, kick plates that are not removable or cannot be rotated open are allowed unless the facility has been issued repeated correction orders for violations of Minnesota Rules, part 4626.1565 or 4626.1570;\n(3) notwithstanding Minnesota Rules, part 4626.0685, item A, the facility is not required to provide integral drainboards, utensil racks, or tables large enough to accommodate soiled and clean items that may accumulate during hours of operation provided soiled items do not contaminate clean items, surfaces, or food, and clean equipment and dishes are air dried in a manner that prevents contamination before storage;\n(4) notwithstanding Minnesota Rules, part 4626.1070, item A, the facility is not required to install a dedicated handwashing sink in its existing kitchen provided it designates one well of a two-compartment sink for use only as a handwashing sink;\n(5) notwithstanding Minnesota Rules, parts 4626.1325, 4626.1335, and 4626.1360, item A, existing floor, wall, and ceiling finishes are allowed provided the facility keeps them clean and in good condition;\n(6) notwithstanding Minnesota Rules, part 4626.1375, shielded or shatter-resistant lightbulbs are not required, but if a light bulb breaks, the facility must discard all exposed food and fully clean all equipment, dishes, and surfaces to remove any glass particles; and\n(7) notwithstanding Minnesota Rules, part 4626.1390, toilet rooms are not required to be provided with a self-closing door.\nAll assisted living facilities must offer to provide or make available the following services to residents:\n(1) weekly housekeeping;\n(2) weekly laundry service;\n(3) upon the request of the resident, provide direct or reasonable assistance with arranging for transportation to medical and social services appointments, shopping, and other recreation, and provide the name of or other identifying information about the persons responsible for providing this assistance;\n(4) upon the request of the resident, provide reasonable assistance with accessing community resources and social services available in the community, and provide the name of or other identifying information about persons responsible for providing this assistance;\n(5) provide culturally sensitive programs; and\n(6) have a daily program of social and recreational activities that are based upon individual and group interests, physical, mental, and psychosocial needs, and that creates opportunities for active participation in the community at large.\nEach assisted living facility must have policies and procedures in place to address the following and keep them current:\n(1) requirements in section 626.557, reporting of maltreatment of vulnerable adults;\n(2) conducting and handling background studies on employees;\n(3) orientation, training, and competency evaluations of staff, and a process for evaluating staff performance;\n(4) handling complaints regarding staff or services provided by staff;\n(5) conducting initial evaluations of residents' needs and the providers' ability to provide those services;\n(6) conducting initial and ongoing resident evaluations and assessments of resident needs, including assessments by a registered nurse or appropriate licensed health professional, and how changes in a resident's condition are identified, managed, and communicated to staff and other health care providers as appropriate;\n(7) orientation to and implementation of the assisted living bill of rights;\n(8) infection control practices;\n(9) reminders for medications, treatments, or exercises, if provided;\n(10) conducting appropriate screenings, or documentation of prior screenings, to show that staff are free of tuberculosis, consistent with current United States Centers for Disease Control and Prevention standards;\n(11) ensuring that nurses and licensed health professionals have current and valid licenses to practice;\n(12) medication and treatment management;\n(13) delegation of tasks by registered nurses or licensed health professionals;\n(14) supervision of registered nurses and licensed health professionals; and\n(15) supervision of unlicensed personnel performing delegated tasks.\n(a) All assisted living facilities must establish and maintain an infection control program that complies with accepted health care, medical, and nursing standards for infection control.\n(b) The facility's infection control program must be consistent with current guidelines from the national Centers for Disease Control and Prevention (CDC) for infection prevention and control in long-term care facilities and, as applicable, for infection prevention and control in assisted living facilities.\n(c) The facility must maintain written evidence of compliance with this subdivision.\nAll assisted living facilities must have a clinical nurse supervisor who is a registered nurse licensed in Minnesota.\nThe facility must provide a resident council with space and privacy for meetings, where doing so is reasonably achievable. Staff, visitors, and other guests may attend a resident council meeting only at the council's invitation. The facility must designate a staff person who is approved by the resident council to be responsible for providing assistance and responding to written requests that result from meetings. The facility must consider the views of the resident council and must respond promptly to the grievances and recommendations of the council, but a facility is not required to implement as recommended every request of the council. The facility shall, with the approval of the resident council, take reasonably achievable steps to make residents aware of upcoming meetings in a timely manner.\nThe facility must provide a family council with space and privacy for meetings, where doing so is reasonably achievable. The facility must designate a staff person who is approved by the family council to be responsible for providing assistance and responding to written requests that result from meetings. The facility must consider the views of the family council and must respond promptly to the grievances and recommendations of the council, but a facility is not required to implement as recommended every request of the council. The facility shall, with the approval of the family council, take reasonably achievable steps to make residents and family members aware of upcoming meetings in a timely manner.\nAll facilities must post in a conspicuous place information about the facilities' grievance procedure, and the name, telephone number, and email contact information for the individuals who are responsible for handling resident grievances. The notice must also have the contact information for the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities, and must have information for reporting suspected maltreatment to the Minnesota Adult Abuse Reporting Center. The notice must also state that if an individual has a complaint about the facility or person providing services, the individual may contact the Office of Health Facility Complaints at the Minnesota Department of Health.\nAll facilities shall ensure that every resident has access to consumer advocacy or legal services by:\n(1) providing names and contact information, including telephone numbers and email addresses of at least three organizations that provide advocacy or legal services to residents, one of which must include the designated protection and advocacy organization in Minnesota that provides advice and representation to individuals with disabilities;\n(2) providing the name and contact information for the Minnesota Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities;\n(3) assisting residents in obtaining information on whether Medicare or medical assistance under chapter 256B will pay for services;\n(4) making reasonable accommodations for people who have communication disabilities and those who speak a language other than English; and\n(5) providing all information and notices in plain language and in terms the residents can understand.",
	"repealed": false
}