{
	"id": "259A.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/259A.75",
	"title": "259A.75 REIMBURSEMENT OF CERTAIN AGENCY COSTS; PURCHASE OF SERVICE CONTRACTS AND TRIBAL CUSTOMARY ADOPTIONS.",
	"text": "(a) Subject to the procedures required by the commissioner and the provisions of this section, a Minnesota county or Tribal agency shall receive a reimbursement from the commissioner equal to 100 percent of the reasonable and appropriate cost for contracted adoption placement services identified for a specific child that are not reimbursed under other federal or state funding sources.\n(b) The commissioner may spend up to $16,000 for each purchase of service contract. Only one contract per child per adoptive placement is permitted. Funds encumbered and obligated under the contract for the child remain available until the terms of the contract are fulfilled or the contract is terminated.\n(c) The commissioner shall set aside an amount not to exceed five percent of the total amount of the fiscal year appropriation from the state for the adoption assistance program to reimburse a Minnesota county or tribal social services placing agency for child-specific adoption placement services. When adoption assistance payments for children's needs exceed 95 percent of the total amount of the fiscal year appropriation from the state for the adoption assistance program, the amount of reimbursement available to placing agencies for adoption services is reduced correspondingly.\nA child who is the subject of a purchase of service contract must:\n(1) have the goal of adoption, which may include an adoption in accordance with tribal law;\n(2) be under the guardianship of the commissioner of children, youth, and families or be a ward of tribal court pursuant to section 260.755, subdivision 20; and\n(3) meet all of the special needs criteria according to section 142A.606, subdivision 2.\n(a) A Minnesota county or Tribal social services agency shall receive reimbursement for child-specific adoption placement services for an eligible child that it purchases from a private adoption agency licensed in Minnesota or any other state or tribal social services agency.\n(b) Reimbursement for adoption services is available only for services provided prior to the date of the adoption decree.\n(a) A Minnesota county or Tribal social services agency may request reimbursement of costs for adoption placement services by submitting a complete purchase of service application, according to the requirements and procedures and on forms prescribed by the commissioner.\n(b) The commissioner shall determine eligibility for reimbursement of adoption placement services. If determined eligible, the commissioner of children, youth, and families shall sign the purchase of service agreement, making this a fully executed contract. No reimbursement under this section shall be made to an agency for services provided prior to the fully executed contract.\n(c) Separate purchase of service agreements shall be made, and separate records maintained, on each child. Only one agreement per child per adoptive placement is permitted. For siblings who are placed together, services shall be planned and provided to best maximize efficiency of the contracted hours.\n(a) The agency providing adoption services is responsible to track and record all service activity, including billable hours, on a form prescribed by the commissioner. The agency shall submit this form to the state for reimbursement after services have been completed.\n(b) The commissioner shall make the final determination whether or not the requested reimbursement costs are reasonable and appropriate and if the services have been completed according to the terms of the purchase of service agreement.\nAgencies entering into purchase of service contracts shall keep a copy of the agreements, service records, and all applicable billing and invoicing according to the department's record retention schedule. Agency records shall be provided upon request by the commissioner.\n(a) The commissioner shall enter into grant contracts with Minnesota tribal social services agencies to provide child-specific recruitment and adoption placement services for Indian children under the jurisdiction of tribal court.\n(b) Children served under these grant contracts must meet the child eligibility criteria in subdivision 2.",
	"repealed": false
}