{
	"id": "35.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.155",
	"title": "35.155 FARMED CERVIDAE.",
	"text": "(a) An owner may not allow farmed Cervidae to run at large. The owner must make all reasonable efforts to return escaped farmed Cervidae to their enclosures as soon as possible. The owner must immediately notify the commissioner of natural resources of the escape of farmed Cervidae if the farmed Cervidae are not returned or captured by the owner within 24 hours of their escape.\n(b) An owner is liable for expenses of another person in capturing, caring for, and returning farmed Cervidae that have left their enclosures if the person capturing the farmed Cervidae contacts the owner as soon as possible.\n(c) If an owner is unwilling or unable to capture escaped farmed Cervidae, the commissioner of natural resources may destroy the escaped farmed Cervidae. The commissioner of natural resources must allow the owner to attempt to capture the escaped farmed Cervidae prior to destroying the farmed Cervidae. Farmed Cervidae that are not captured by 24 hours after escape may be destroyed.\n(d) A hunter licensed by the commissioner of natural resources under chapter 97A may kill and possess escaped farmed Cervidae in a lawful manner and is not liable to the owner for the loss of the animal. If the animal has been outside of its enclosure less than 72 hours following notification of the commissioner of natural resources of its escape, the farmed Cervidae owner retains ownership of the animal. A licensed hunter who harvests escaped farmed Cervidae under this paragraph must notify the commissioner of natural resources within 24 hours.\n(e) Escaped farmed Cervidae killed by a hunter or destroyed by the commissioner of natural resources must be tested for chronic wasting disease. The hunter must provide the animal to the commissioner of natural resources for testing and the commissioner must ensure the animal is tested.\n(f) The possessor of the animal is responsible for proper disposal, as determined by the board, of farmed Cervidae that are killed or destroyed under this subdivision and test positive for chronic wasting disease.\n(g) An owner is liable for any additional costs associated with escaped farmed Cervidae that are infected with chronic wasting disease. This paragraph may be enforced by the attorney general on behalf of any state agency affected.\nAn owner or an employee or agent under the direction of the owner must destroy wild Cervidae found within the owner's farmed Cervidae confinement area. The owner, employee, or agent must report the wild Cervidae destroyed to a conservation officer or an employee of the Department of Natural Resources, Division of Wildlife, within 24 hours. The wild Cervidae must be disposed of as prescribed by the commissioner of natural resources.\nA person may not raise farmed red deer in the native elk area without written approval of the commissioner of natural resources. The native elk area is the area north of U.S. Highway 2 and west of U.S. Highway 71 and Trunk Highway 72. The commissioner of natural resources shall review the proposed farming operation and approve with any condition or deny approval based on risks to the native elk population.\nFarmed Cervidae must be confined in a manner designed to prevent escape. All perimeter fences for farmed Cervidae must be at least 96 inches in height and be constructed and maintained in a way that prevents the escape of farmed Cervidae, entry into the premises by free-roaming Cervidae, and physical contact between farmed Cervidae and free-roaming Cervidae. The Board of Animal Health or commissioner of natural resources may determine whether the construction and maintenance of fencing is adequate to prevent physical contact or escape under this subdivision and may compel corrective action when fencing is determined to be inadequate. All new fencing installed and all fencing used to repair deficiencies must be high tensile. All entry areas for farmed Cervidae enclosure areas must have two redundant gates, which must be maintained to prevent the escape of animals through an open gate. If a fence deficiency allows entry or exit by farmed or wild Cervidae, the owner must immediately repair the deficiency. All other deficiencies must be repaired within a reasonable time, as determined by the Board of Animal Health, not to exceed 14 days. If a fence deficiency is detected during an inspection, the facility must be reinspected at least once in the subsequent three months. The farmed Cervidae owner must pay a reinspection fee equal to one-half the applicable annual inspection fee under subdivision 7a for each reinspection related to a fence violation. If the facility experiences more than one escape incident in any six-month period or fails to correct a deficiency found during an inspection, the board may revoke the facility's registration and order the owner to remove or destroy the animals as directed by the board. If the board revokes a facility's registration, the commissioner of natural resources may seize and destroy animals at the facility.\nFarmed Cervidae are subject to this chapter and the rules of the Board of Animal Health in the same manner as other livestock and domestic animals, including provisions related to importation and transportation. The board shall allow the movement of Cervidae from a Cervidae farm located within a chronic wasting disease management or endemic zone if the Cervidae have tested negative for chronic wasting disease with an antemortem test validated by the United States Department of Agriculture and the herd has met other movement requirements as set by the board.\n(a) Farmed Cervidae must be identified by means approved by the Board of Animal Health. The identification must include a distinct number that has not been used during the previous three years and must be visible to the naked eye during daylight under normal conditions at a distance of 50 yards. White-tailed deer must be identified before October 31 of the year in which the animal is born, at the time of weaning, or before movement from the premises, whichever occurs first. Elk and other cervids must be identified by December 31 of the year in which the animal is born or before movement from the premises, whichever occurs first. As coordinated by the board, the commissioner of natural resources may destroy any animal that is not identified as required under this subdivision.\n(b) The Board of Animal Health shall register farmed Cervidae. The owner must submit the registration request on forms provided by the board. The forms must include sales receipts or other documentation of the origin of the Cervidae. The board must provide copies of the registration information to the commissioner of natural resources upon request. The owner must keep written records of the acquisition and disposition of registered farmed Cervidae.\n(a) The Board of Animal Health must annually inspect farmed Cervidae, farmed Cervidae facilities, and farmed Cervidae records. As coordinated by the board, the commissioner of agriculture and an enforcement officer as defined under section 97A.015, subdivision 18, may participate in the inspection.\n(b) The annual inspection must include a physical inspection of all perimeter fencing around the facility and a viewing to verify that all animals are tagged. The owner of a farmed Cervidae facility must present to the inspectors an accurate inventory of the owner's farmed Cervidae and other records for review. During an annual inspection, the owner must present individual animals in a herd for a physical inventory, if required by the board.\n(c) The commissioner of natural resources may inspect farmed Cervidae, farmed Cervidae facilities, and farmed Cervidae records with reasonable suspicion that laws protecting native wild animals have been violated and must notify the owner in writing at the time of the inspection of the reason for the inspection and must inform the owner in writing after the inspection of whether (1) the cause of the inspection was unfounded; or (2) there will be an ongoing investigation or continuing evaluation.\n(d) The commissioner of natural resources may inspect farmed white-tailed deer according to the concurrent authority granted under subdivision 14.\nFor each herd, the owner must, on or before January 1, pay to the board an annual inspection fee of:\n(1) $500 if the owner manages the herd for profit or monetary gain and engages in transactions or exchanges for consideration, including sale, barter, the offer to sell, or possession with the intent to sell;\n(2) $500 if the owner sells the ability to shoot animals in the herd;\n(3) $500 if the herd consists of more than one species; or\n(4) $250 for all other herds.\nA Cervidae inspection account is established in the state treasury. The fees collected under this section and interest attributable to money in the account must be deposited in the state treasury and credited to the Cervidae inspection account in the special revenue fund. Money in the account, including interest earned, is appropriated to the Board of Animal Health for the administration and enforcement of this section.\n(a) A person raising farmed Cervidae that is aggrieved with any decision regarding the farmed Cervidae may request a contested case hearing under chapter 14.\n(b) A person requesting a contested case hearing regarding a registration revocation under this section must make the request within 30 days of the revocation notice.\n(a) A person may not possess live Cervidae in Minnesota unless the person is registered with the Board of Animal Health and meets all the requirements for farmed Cervidae under this section. Cervidae possessed in violation of this subdivision may be seized and destroyed by the commissioner of natural resources.\n(b) A person whose registration is revoked by the board is ineligible for future registration under this section unless the board determines that the person has undertaken measures that make future escapes extremely unlikely.\n(c) The board must not allow new registrations under this section for possessing white-tailed deer. This paragraph does not prohibit a person holding a valid registration under this subdivision from selling or transferring the person's registration to an immediate family member. A valid registration may be sold or transferred only once under this paragraph. Before the board approves a sale or transfer under this paragraph, the board must verify that the registration is in good standing and the eligible family member must pay a onetime transfer fee of $500 to the board.\n(a) An inventory for each farmed Cervidae herd must be verified by an accredited veterinarian and filed with the Board of Animal Health every 12 months.\n(b) Movement of farmed Cervidae from any premises to another location must be reported to the Board of Animal Health within 14 days of the movement on forms approved by the Board of Animal Health. A person must not move farmed white-tailed deer from a herd that tests positive for chronic wasting disease from any premises to another location.\n(c) All animals from farmed Cervidae herds that are over six months of age that die or are slaughtered must be tested for chronic wasting disease.\n(d) The owner of a premises where chronic wasting disease is detected must:\n(1) allow and cooperate with inspections of the premises as determined by the Board of Animal Health and Department of Natural Resources conservation officers and wildlife managers;\n(2) depopulate the premises of Cervidae after the federal indemnification process has been completed or, if an indemnification application is not submitted, within 30 days;\n(3) maintain the fencing required under subdivision 4 on the premises for ten years after the date of detection;\n(4) post the fencing on the premises with biohazard signs as directed by the board;\n(5) not raise farmed Cervidae on the premises for at least ten years;\n(6) before signing an agreement to sell or transfer the property, disclose in writing to the buyer or transferee the date of depopulation and the requirements incumbent upon the premises and the buyer or transferee under this paragraph; and\n(7) record with the county recorder or registrar of titles, as appropriate, in the county where the premises is located a notice, in the form required by the board, that meets the recording requirements of sections 507.093 and 507.24 and includes the nearest address and the legal description of the premises, the date of detection, the date of depopulation, the landowner requirements under this paragraph, and any other information required by the board. The legal description must be the legal description of record with the county recorder or registrar of titles and must not otherwise be the real estate tax statement legal description of the premises. The notice expires and has no effect ten years after the date of detection stated in the notice. The registrar of titles must omit an expired notice from future certificates of title.\n(e) An owner of farmed Cervidae that test positive for chronic wasting disease is responsible for proper disposal of the animals, as determined by the board.\n(a) A herd owner is liable in a civil action to a person injured by the owner's sale or unlawful disposal of farmed Cervidae if the herd owner knew or reasonably should have known that the farmed Cervidae were infected with or exposed to chronic wasting disease. Action may be brought in a county where the farmed Cervidae are sold, delivered, or unlawfully disposed.\n(b) A herd owner is liable to the state for costs associated with the owner's unlawful disposal of farmed Cervidae infected with or exposed to chronic wasting disease. This paragraph may be enforced by the attorney general on behalf of any state agency affected.\n(a) A person must not import live Cervidae into the state from a state or province where chronic wasting disease has been detected in the farmed or wild cervid population in the last five years unless the animal has tested not detected for chronic wasting disease with a validated live-animal test.\n(b) Live Cervidae or Cervidae semen must originate from a herd that has been subject to a state-, federal-, or provincial-approved chronic wasting disease herd certification program and that has reached a status equivalent to the highest certification.\n(c) Cervidae imported in violation of this section may be seized and destroyed by the commissioner of natural resources.\n(d) This subdivision does not apply to the interstate transfer of animals between two facilities accredited by the Association of Zoos and Aquariums.\n(e) Notwithstanding this subdivision, the commissioner of natural resources may issue a permit allowing the importation of orphaned wild cervid species that are not susceptible to chronic wasting disease from another state to an Association of Zoos and Aquariums accredited institution in Minnesota following a joint risk-based assessment conducted by the commissioner and the institution.\nThe Board of Animal Health shall adopt rules as necessary to implement this section and to otherwise provide for the control of Cervidae diseases.\nMS 2022 [Repealed, 2023 c 60 art 7 s 14]\n(a) The commissioner of natural resources may contract with the Board of Animal Health to administer some or all of sections 35.153 to 35.156 for farmed white-tailed deer.\n(b) The commissioner of natural resources must enter into an interagency agreement which establishes roles and responsibilities necessary to protect the health of Cervidae in Minnesota consistent with state regulations.",
	"repealed": false
}