{
	"id": "62J.498",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.498",
	"title": "62J.498 HEALTH INFORMATION EXCHANGE.",
	"text": "(a) The following definitions apply to sections 62J.498 to 62J.4982:\n(b) \"Clinical data repository\" means a real time database that consolidates data from a variety of clinical sources to present a unified view of a single patient and is used by a health information exchange service provider to enable health information exchange among health care providers that are not related health care entities as defined in section 144.291, subdivision 2, paragraph (k). This does not include clinical data that are submitted to the commissioner for public health purposes required or permitted by law, including any rules adopted by the commissioner.\n(c) \"Clinical transaction\" means any meaningful use transaction or other health information exchange transaction that is not covered by section 62J.536.\n(d) \"Commissioner\" means the commissioner of health.\n(e) \"Health care provider\" or \"provider\" means a health care provider or provider as defined in section 62J.03, subdivision 8.\n(f) \"Health data intermediary\" means an entity that provides the technical capabilities or related products and services to enable health information exchange among health care providers that are not related health care entities as defined in section 144.291, subdivision 2, paragraph (k). This includes but is not limited to health information service providers (HISP), electronic health record vendors, and pharmaceutical electronic data intermediaries as defined in section 62J.495.\n(g) \"Health information exchange\" means the electronic transmission of health-related information between organizations according to nationally recognized standards.\n(h) \"Health information exchange service provider\" means a health data intermediary or health information organization.\n(i) \"Health information organization\" means an organization that oversees, governs, and facilitates health information exchange among health care providers that are not related health care entities as defined in section 144.291, subdivision 2, paragraph (k), to improve coordination of patient care and the efficiency of health care delivery.\n(j) \"Major participating entity\" means:\n(1) a participating entity that receives compensation for services that is greater than 30 percent of the health information organization's gross annual revenues from the health information exchange service provider;\n(2) a participating entity providing administrative, financial, or management services to the health information organization, if the total payment for all services provided by the participating entity exceeds three percent of the gross revenue of the health information organization; and\n(3) a participating entity that nominates or appoints 30 percent or more of the board of directors or equivalent governing body of the health information organization.\n(k) \"Master patient index\" means an electronic database that holds unique identifiers of patients registered at a care facility and is used by a health information exchange service provider to enable health information exchange among health care providers that are not related health care entities as defined in section 144.291, subdivision 2, paragraph (k). This does not include data that are submitted to the commissioner for public health purposes required or permitted by law, including any rules adopted by the commissioner.\n(l) \"Participating entity\" means any of the following persons, health care providers, companies, or other organizations with which a health information organization has contracts or other agreements for the provision of health information exchange services:\n(1) a health care facility licensed under sections 144.50 to 144.56, a nursing home licensed under sections 144A.02 to 144A.10, and any other health care facility otherwise licensed under the laws of this state or registered with the commissioner;\n(2) a health care provider, and any other health care professional otherwise licensed under the laws of this state or registered with the commissioner;\n(3) a group, professional corporation, or other organization that provides the services of individuals or entities identified in clause (2), including but not limited to a medical clinic, a medical group, a home health care agency, an urgent care center, and an emergent care center;\n(4) a health plan as defined in section 62A.011, subdivision 3; and\n(5) a state agency as defined in section 13.02, subdivision 17.\n(m) \"Reciprocal agreement\" means an arrangement in which two or more health information exchange service providers agree to share in-kind services and resources to allow for the pass-through of clinical transactions.\n(n) \"State-certified health information organization\" means a health information organization that has been issued a certificate of authority to operate in Minnesota.\n(a) The commissioner shall protect the public interest on matters pertaining to health information exchange. The commissioner shall:\n(1) review and act on applications from health information organizations for certificates of authority to operate in Minnesota;\n(2) require information to be provided as needed from health information exchange service providers in order to meet requirements established under sections 62J.498 to 62J.4982;\n(3) provide ongoing monitoring to ensure compliance with criteria established under sections 62J.498 to 62J.4982;\n(4) respond to public complaints related to health information exchange services;\n(5) take enforcement actions as necessary, including the imposition of fines, suspension, or revocation of certificates of authority as outlined in section 62J.4982;\n(6) provide a biennial report on the status of health information exchange services that includes but is not limited to:\n(i) recommendations on actions necessary to ensure that health information exchange services are adequate to meet the needs of Minnesota citizens and providers statewide;\n(ii) recommendations on enforcement actions to ensure that health information exchange service providers act in the public interest without causing disruption in health information exchange services;\n(iii) recommendations on updates to criteria for obtaining certificates of authority under this section; and\n(iv) recommendations on standard operating procedures for health information exchange, including but not limited to the management of consumer preferences; and\n(7) other duties necessary to protect the public interest.\n(b) As part of the application review process for certification under paragraph (a), prior to issuing a certificate of authority, the commissioner shall:\n(1) make all portions of the application classified as public data available to the public for at least ten days while an application is under consideration. At the request of the commissioner, the applicant shall participate in a public hearing by presenting an overview of their application and responding to questions from interested parties; and\n(2) consult with hospitals, physicians, and other providers prior to issuing a certificate of authority.\n(c) When the commissioner is actively considering a suspension or revocation of a certificate of authority as described in section 62J.4982, subdivision 3, all investigatory data that are collected, created, or maintained related to the suspension or revocation are classified as confidential data on individuals and as protected nonpublic data in the case of data not on individuals.\n(d) The commissioner may disclose data classified as protected nonpublic or confidential under paragraph (c) if disclosing the data will protect the health or safety of patients.\n(e) After the commissioner makes a final determination regarding a suspension or revocation of a certificate of authority, all minutes, orders for hearing, findings of fact, conclusions of law, and the specification of the final disciplinary action, are classified as public data.",
	"repealed": false
}