{
	"id": "260C.227",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.227",
	"title": "260C.227 VOLUNTARY FOSTER CARE; REQUIRED COURT REVIEW.",
	"text": "(a) When the responsible social services agency and the child's parent or guardian agree that the child's safety, health, and best interests require that the child be in foster care, the agency and the parent or guardian may enter into a voluntary agreement for the placement of the child in foster care. The voluntary agreement must be in writing and in a form approved by the commissioner.\n(b) When the child has been placed in foster care pursuant to a voluntary foster care agreement between the agency and the parent, under this section and the child is not returned home within 90 days after initial placement in foster care, the agency responsible for the child's placement in foster care shall:\n(1) return the child to the home of the parent or parents; or\n(2) file a petition according to section 260C.141, subdivision 1 or 2, which may:\n(i) ask the court to review the child's placement in foster care and approve it as continued voluntary foster care for up to an additional 90 days;\n(ii) ask the court to order continued foster care according to sections 260C.178 and 260C.201; or\n(iii) ask the court to terminate parental rights under section 260C.301.\n(3) The out-of-home placement plan must be updated and filed along with the petition.\n(c) If the court approves continuing the child in foster care for up to 90 more days on a voluntary basis, at the end of the court-approved 90-day period, the child must be returned to the parent's home. If the child is not returned home, the responsible social services agency must proceed on the petition filed alleging the child in need of protection or services or the petition for termination of parental rights or other permanent placement of the child away from the parent. The court must find a statutory basis to order the placement of the child under section 260C.178; 260C.201; 260C.503 to 260C.521; or 260C.317.\n(d) If the child is placed in a qualified residential treatment program, the placement must follow the requirements of sections 260C.70 to 260C.714.",
	"repealed": false
}