{
	"id": "256.969",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.969",
	"title": "256.969 PAYMENT RATES.",
	"text": "(a) The hospital cost index shall be the change in the Centers for Medicare and Medicaid Services Inpatient Hospital Market Basket. The commissioner shall use the indices as forecasted for the midpoint of the prior rate year to the midpoint of the current rate year.\n(b) Except as authorized under this section, for fiscal years beginning on or after July 1, 1993, the commissioner of human services shall not provide automatic annual inflation adjustments for hospital payment rates under medical assistance.\nThe commissioner shall use to the extent possible existing diagnostic classification systems, such as the all patient-refined diagnosis-related groups (APR-DRGs) or other similar classification programs to determine the relative values of inpatient services and case mix indices. The commissioner may combine diagnostic classifications into diagnostic categories and may establish separate categories and numbers of categories based on hospital peer group. Relative values shall be recalibrated when the base year is changed. Relative value determinations shall include paid claims for admissions during each hospital's base year. The commissioner may supplement the diagnostic classification systems data with national averages. Relative value determinations shall not include Medicare crossover data and data on admissions that are paid a per day transfer rate under subdivision 14. The computation of the base year cost per admission must include identified outlier cases and their weighted costs up to the point that they become outlier cases, but must exclude costs recognized in outlier payments beyond that point. The commissioner may recategorize the diagnostic classifications and recalibrate relative values and case mix indices to reflect actual hospital practices, the specific character of specialty hospitals, or to reduce variances within the diagnostic categories after notice in the State Register and a 30-day comment period.\n[Repealed, 1989 c 282 art 3 s 98]\n(a) For discharges occurring on or after November 1, 2014, hospital inpatient services for hospitals located in Minnesota shall be paid according to the following:\n(1) critical access hospitals as defined by Medicare shall be paid using a cost-based methodology;\n(2) long-term hospitals as defined by Medicare shall be paid on a per diem methodology under subdivision 25;\n(3) rehabilitation hospitals or units of hospitals that are recognized as rehabilitation distinct parts as defined by Medicare shall be paid according to the methodology under subdivision 12; and\n(4) all other hospitals shall be paid on a diagnosis-related group (DRG) methodology.\n(b) For the period beginning January 1, 2011, through October 31, 2014, rates shall not be rebased, except that a Minnesota long-term hospital shall be rebased effective January 1, 2011, based on its most recent Medicare cost report ending on or before September 1, 2008, with the provisions under subdivisions 9 and 23, based on the rates in effect on December 31, 2010. For rate setting periods after November 1, 2014, in which the base years are updated, a Minnesota long-term hospital's base year shall remain within the same period as other hospitals.\n(c) Effective for discharges occurring on and after November 1, 2014, payment rates for hospital inpatient services provided by hospitals located in Minnesota or the local trade area, except for the hospitals paid under the methodologies described in paragraph (a), clauses (2) and (3), shall be rebased, incorporating cost and payment methodologies in a manner similar to Medicare. The base year or years for the rates effective November 1, 2014, shall be calendar year 2012. The rebasing under this paragraph shall be budget neutral, ensuring that the total aggregate payments under the rebased system are equal to the total aggregate payments that were made for the same number and types of services in the base year. Separate budget neutrality calculations shall be determined for payments made to critical access hospitals and payments made to hospitals paid under the DRG system. Only the rate increases or decreases under subdivision 3a or 3c that applied to the hospitals being rebased during the entire base period shall be incorporated into the budget neutrality calculation.\n(d) For discharges occurring on or after November 1, 2014, through the next rebasing that occurs, the rebased rates under paragraph (c) that apply to hospitals under paragraph (a), clause (4), shall include adjustments to the projected rates that result in no greater than a five percent increase or decrease from the base year payments for any hospital. Any adjustments to the rates made by the commissioner under this paragraph and paragraph (e) shall maintain budget neutrality as described in paragraph (c).\n(e) For discharges occurring on or after November 1, 2014, the commissioner may make additional adjustments to the rebased rates, and when evaluating whether additional adjustments should be made, the commissioner shall consider the impact of the rates on the following:\n(1) pediatric services;\n(2) behavioral health services;\n(3) trauma services as defined by the National Uniform Billing Committee;\n(4) transplant services;\n(5) obstetric services, newborn services, and behavioral health services provided by hospitals outside the seven-county metropolitan area;\n(6) outlier admissions;\n(7) low-volume providers; and\n(8) services provided by small rural hospitals that are not critical access hospitals.\n(f) Hospital payment rates established under paragraph (c) must incorporate the following:\n(1) for hospitals paid under the DRG methodology, the base year payment rate per admission is standardized by the applicable Medicare wage index and adjusted by the hospital's disproportionate population adjustment;\n(2) for critical access hospitals, payment rates for discharges between November 1, 2014, and June 30, 2015, shall be set to the same rate of payment that applied for discharges on October 31, 2014;\n(3) the cost and charge data used to establish hospital payment rates must only reflect inpatient services covered by medical assistance; and\n(4) in determining hospital payment rates for discharges occurring on or after the rate year beginning January 1, 2011, through December 31, 2012, the hospital payment rate per discharge shall be based on the cost-finding methods and allowable costs of the Medicare program in effect during the base year or years. In determining hospital payment rates for discharges in subsequent base years, the per discharge rates shall be based on the cost-finding methods and allowable costs of the Medicare program in effect during the base year or years.\n(g) The commissioner shall validate the rates effective November 1, 2014, by applying the rates established under paragraph (c), and any adjustments made to the rates under paragraph (d) or (e), to hospital claims paid in calendar year 2013 to determine whether the total aggregate payments for the same number and types of services under the rebased rates are equal to the total aggregate payments made during calendar year 2013.\n(h) Effective for discharges occurring on or after July 1, 2017, and every two years thereafter, payment rates under this section shall be rebased to reflect only those changes in hospital costs between the existing base year or years and the next base year or years. In any year that inpatient claims volume falls below the threshold required to ensure a statistically valid sample of claims, the commissioner may combine claims data from two consecutive years to serve as the base year. Years in which inpatient claims volume is reduced or altered due to a pandemic or other public health emergency shall not be used as a base year or part of a base year if the base year includes more than one year. Changes in costs between base years shall be measured using the lower of the hospital cost index defined in subdivision 1, paragraph (a), or the percentage change in the case mix adjusted cost per claim. The commissioner shall establish the base year for each rebasing period considering the most recent year or years for which filed Medicare cost reports are available, except that the base years for the rebasing effective July 1, 2023, are calendar years 2018 and 2019. The estimated change in the average payment per hospital discharge resulting from a scheduled rebasing must be calculated and made available to the legislature by January 15 of each year in which rebasing is scheduled to occur, and must include by hospital the differential in payment rates compared to the individual hospital's costs.\n(i) Effective for discharges occurring on or after July 1, 2015, inpatient payment rates for critical access hospitals located in Minnesota or the local trade area shall be determined using a new cost-based methodology. The commissioner shall establish within the methodology tiers of payment designed to promote efficiency and cost-effectiveness. Payment rates for hospitals under this paragraph shall be set at a level that does not exceed the total cost for critical access hospitals as reflected in base year cost reports. Until the next rebasing that occurs, the new methodology shall result in no greater than a five percent decrease from the base year payments for any hospital, except a hospital that had payments that were greater than 100 percent of the hospital's costs in the base year shall have their rate set equal to 100 percent of costs in the base year. The rates paid for discharges on and after July 1, 2016, covered under this paragraph shall be increased by the inflation factor in subdivision 1, paragraph (a). The new cost-based rate shall be the final rate and shall not be settled to actual incurred costs. Hospitals shall be assigned a payment tier based on the following criteria:\n(1) hospitals that had payments at or below 80 percent of their costs in the base year shall have a rate set that equals 85 percent of their base year costs;\n(2) hospitals that had payments that were above 80 percent, up to and including 90 percent of their costs in the base year shall have a rate set that equals 95 percent of their base year costs; and\n(3) hospitals that had payments that were above 90 percent of their costs in the base year shall have a rate set that equals 100 percent of their base year costs.\n(j) The commissioner may refine the payment tiers and criteria for critical access hospitals to coincide with the next rebasing under paragraph (h). The factors used to develop the new methodology may include, but are not limited to:\n(1) the ratio between the hospital's costs for treating medical assistance patients and the hospital's charges to the medical assistance program;\n(2) the ratio between the hospital's costs for treating medical assistance patients and the hospital's payments received from the medical assistance program for the care of medical assistance patients;\n(3) the ratio between the hospital's charges to the medical assistance program and the hospital's payments received from the medical assistance program for the care of medical assistance patients;\n(4) the statewide average increases in the ratios identified in clauses (1), (2), and (3);\n(5) the proportion of that hospital's costs that are administrative and trends in administrative costs; and\n(6) geographic location.\n(k) Subject to subdivision 2g, effective for discharges occurring on or after January 1, 2024, the rates paid to hospitals described in paragraph (a), clauses (2) to (4), must include a rate factor specific to each hospital that qualifies for a medical education and research cost distribution under section 62J.692, subdivision 4, paragraph (a).\n[See Note.]\n[Repealed, 2014 c 312 art 24 s 48]\nNotwithstanding subdivision 2b, paragraph (c), for discharges occurring on or after November 1, 2014, through March 1, 2016, the commissioner may implement an interim payment process to pay hospitals, including payments based on each hospital's average payments per claim for state fiscal years 2011 and 2012. These interim payments may be used to pay hospitals if the rebasing under subdivision 2b, paragraph (c), is not implemented by November 1, 2014, or if electronic systems changes necessary to support the conversion to the International Classification of Diseases, 10th revision (ICD-10) coding system are not completed. Claims paid at interim payment rates shall be reprocessed and paid at the rates established under subdivision 2b, paragraphs (c) and (d), upon implementation of the rebased rates.\n(a) If the days, costs, and revenues associated with patients who are eligible for medical assistance and also have private health insurance are required to be included in the calculation of the hospital-specific disproportionate share hospital payment limit for a rate year, then the commissioner, effective retroactively from rate years beginning on or after January 1, 2015, shall compute an alternate inpatient payment rate for a Minnesota hospital that is designated as a children's hospital and enumerated as such by Medicare. The commissioner shall reimburse the hospital for a rate year at the higher of the amount calculated under the alternate payment rate or the amount calculated under subdivision 9.\n(b) The alternate payment rate must meet the criteria in clauses (1) to (4):\n(1) the alternate payment rate shall be structured to target a total aggregate reimbursement amount equal to two percent less than each children's hospital's cost coverage percentage in the applicable base year for providing fee-for-service inpatient services under this section to patients enrolled in medical assistance;\n(2) costs shall be determined using the most recently available medical assistance cost report provided under subdivision 4b, paragraph (a), clause (3), for the applicable base year. Costs shall be determined using standard Medicare cost finding and cost allocation methods and applied in the same manner as the costs were in the rebasing for the applicable base year. If the medical assistance cost report is not available, costs shall be determined in the interim using the Medicare cost report;\n(3) in any rate year in which payment to a hospital is made using the alternate payment rate, no payments shall be made to the hospital under subdivision 9; and\n(4) if the alternate payment amount increases payments at a rate that is higher than the inflation factor applied over the rebasing period, the commissioner shall take this into consideration when setting payment rates at the next rebasing.\nEffective January 1, 2022, for a hospital eligible to receive disproportionate share hospital payments under subdivision 9, paragraph (d), clause (6), the commissioner shall reduce the amount calculated under subdivision 9, paragraph (d), clause (6), by 99 percent and compute an alternate inpatient payment rate. The alternate payment rate shall be structured to target a total aggregate reimbursement amount equal to what the hospital would have received for providing fee-for-service inpatient services under this section to patients enrolled in medical assistance had the hospital received the entire amount calculated under subdivision 9, paragraph (d), clause (6).\n(a) The commissioner and contracted managed care organizations shall annually pay an inpatient supplemental payment to all eligible hospitals for graduate medical education. A hospital must be an eligible hospital to receive an annual supplemental payment under this subdivision. Payments under this subdivision must comply with all applicable federal requirements and federal laws and meet the requirements of Code of Federal Regulations, title 42, section 438.60.\n(b) For purposes of this subdivision, \"eligible hospital\" means a hospital that:\n(1) is located in Minnesota;\n(2) participates in Minnesota's medical assistance program;\n(3) has received fee-for-service medical assistance payments in the payment year; and\n(4) is either:\n(i) eligible to receive graduate medical education payments from the Medicare program under Code of Federal Regulations, title 42, section 413.75; or\n(ii) a hospital in Minnesota designated as a children's hospital under Medicare, including Children's Health Care, doing business as Children's Minnesota, and Gillette Children's Specialty Healthcare, doing business as Gillette Children's.\n(c) The annual inpatient supplemental payment must be calculated as follows:\n(1) $425,000 per full-time equivalent trained for each of the first ten full-time equivalents at a hospital;\n(2) $350,000 per full-time equivalent trained for each full-time equivalent between 11 and 20 full-time equivalents at a hospital;\n(3) $95,000 per full-time equivalent trained for each full-time equivalent between 21 and 30 full-time equivalents at a hospital;\n(4) $70,000 per full-time equivalent trained for each full-time equivalent between 31 and 400 full-time equivalents at a hospital; and\n(5) $50,000 per full-time equivalent trained for each full-time equivalent above 401 full-time equivalents at a hospital.\n(d) The data source for the full-time equivalent trained under paragraph (c) must be the Medicare cost report for the fiscal year ending in calendar year 2022. The full-time equivalent is calculated by adding the two values populated on lines 10 and 11 on worksheet E, part A, of the Medicare cost report for that year, except that for eligible hospitals that are children's hospitals, the full-time equivalent is calculated based on interns and residents, as determined by adding form CMS-2552-10, worksheet E-4, lines 6, 10.01, and 15.01, or its equivalent, for that year.\n(e) An eligible hospital must not accept any reimbursement under section 62J.692 if it would result in payments in excess of eligible expenditures. The surcharge paid under section 256.9657, subdivision 2a, and the payment received under this section must be reported in the application under section 62J.692.\n(f) The supplemental payments under this subdivision:\n(1) must not be included as public program revenue under section 62J.692; and\n(2) must be deemed permissible pass-through payments for graduate medical education under Code of Federal Regulations, title 42, section 438.6(d), or when the state makes payments directly to teaching hospitals for graduate medical education costs approved under the state plan under Code of Federal Regulations, title 42, section 438.60.\n(g) The total aggregate state and federal supplemental payments for hospitals under this subdivision must not exceed $203,000,000 per year. The commissioner may reduce the amount paid for each full-time equivalent, as described in paragraph (c), on an equal basis to limit the total cost of all supplemental payments to the total dollar amounts available.\n(h) This subdivision is effective the later of July 1, 2025, or 60 days after the end of the first legislative regular session that begins following federal approval for all of the following: (1) the amendment in this act adding section 256.9657, subdivision 2a; (2) the amendment in this act to section 256.969, subdivision 2b; and (3) the amendment in this act to add section 256.969, subdivision 2g. The commissioner of human services shall notify the revisor of statutes when federal approval is obtained.\n(i) This subdivision is subject to the implementation requirements in Laws 2024, chapter 127, article 54, section 9.\n(j) This subdivision expires June 30, 2030, or five years after federal approval is obtained, whichever is later.\n(a) Effective retroactively from January 1, 2024, in any rate year in which a children's hospital discharge is included in the federally required disproportionate share hospital payment audit, where the patient discharged had resided in a children's hospital for over 20 years, the commissioner shall compute an alternate inpatient rate for the children's hospital. The alternate payment rate must be the rate computed under this section excluding the disproportionate share hospital payment under subdivision 9, paragraph (d), clause (1), increased by an amount equal to 99 percent of what the disproportionate share hospital payment would have been under subdivision 9, paragraph (d), clause (1), had the discharge been excluded.\n(b) In any rate year in which payment to a children's hospital is made using this alternate payment rate, payments must not be made to the hospital under subdivisions 2e, 2f, and 9.\n[See Note.]\n[Repealed, 1989 c 282 art 3 s 98]\n(a) Acute care hospital billings under the medical assistance program must not be submitted until the recipient is discharged. However, the commissioner shall establish monthly interim payments for inpatient hospitals that have individual patient lengths of stay over 30 days regardless of diagnostic category. Except as provided in section 256.9693, medical assistance reimbursement for treatment of mental illness shall be reimbursed based on diagnostic classifications. Individual hospital payments established under this section and sections 256.9685, 256.9686, and 256.9695, in addition to third-party and recipient liability, for discharges occurring during the rate year shall not exceed, on a per claim basis, the charges for the medical assistance covered inpatient services paid for the same period of time to the hospital. Services that have rates established under subdivision 12, must be limited separately from other services. After consulting with the affected hospitals, the commissioner may consider related hospitals one entity and may merge the payment rates while maintaining separate provider numbers. The operating and property base rates per admission or per day shall be derived from the best Medicare and claims data available when rates are established. The commissioner shall determine the best Medicare and claims data, taking into consideration variables of recency of the data, audit disposition, settlement status, and the ability to set rates in a timely manner. The commissioner shall notify hospitals of payment rates 30 days prior to implementation. The rate setting data must reflect the admissions data used to establish relative values. The commissioner may adjust base year cost, relative value, and case mix index data to exclude the costs of services that have been discontinued by October 1 of the year preceding the rate year or that are paid separately from inpatient services. Inpatient stays that encompass portions of two or more rate years shall have payments established based on payment rates in effect at the time of admission unless the date of admission preceded the rate year in effect by six months or more. In this case, operating payment rates for services rendered during the rate year in effect and established based on the date of admission shall be adjusted to the rate year in effect by the hospital cost index.\n(b) For fee-for-service admissions occurring on or after July 1, 2002, the total payment, before third-party liability and spenddown, made to hospitals for inpatient services is reduced by .5 percent from the current statutory rates.\n(c) In addition to the reduction in paragraph (b), the total payment for fee-for-service admissions occurring on or after July 1, 2003, made to hospitals for inpatient services before third-party liability and spenddown, is reduced five percent from the current statutory rates. Mental health services within diagnosis related groups 424 to 432 or corresponding APR-DRGs, and facilities defined under subdivision 16 are excluded from this paragraph.\n(d) In addition to the reduction in paragraphs (b) and (c), the total payment for fee-for-service admissions occurring on or after August 1, 2005, made to hospitals for inpatient services before third-party liability and spenddown, is reduced 6.0 percent from the current statutory rates. Mental health services within diagnosis related groups 424 to 432 or corresponding APR-DRGs, and facilities defined under subdivision 16 are excluded from this paragraph. Payments made to managed care plans shall be reduced for services provided on or after January 1, 2006, to reflect this reduction.\n(e) In addition to the reductions in paragraphs (b), (c), and (d), the total payment for fee-for-service admissions occurring on or after July 1, 2008, through June 30, 2009, made to hospitals for inpatient services before third-party liability and spenddown, is reduced 3.46 percent from the current statutory rates. Mental health services with diagnosis related groups 424 to 432 or corresponding APR-DRGs, and facilities defined under subdivision 16 are excluded from this paragraph. Payments made to managed care plans shall be reduced for services provided on or after January 1, 2009, through June 30, 2009, to reflect this reduction.\n(f) In addition to the reductions in paragraphs (b), (c), and (d), the total payment for fee-for-service admissions occurring on or after July 1, 2009, through June 30, 2011, made to hospitals for inpatient services before third-party liability and spenddown, is reduced 1.9 percent from the current statutory rates. Mental health services with diagnosis related groups 424 to 432 or corresponding APR-DRGs, and facilities defined under subdivision 16 are excluded from this paragraph. Payments made to managed care plans shall be reduced for services provided on or after July 1, 2009, through June 30, 2011, to reflect this reduction.\n(g) In addition to the reductions in paragraphs (b), (c), and (d), the total payment for fee-for-service admissions occurring on or after July 1, 2011, made to hospitals for inpatient services before third-party liability and spenddown, is reduced 1.79 percent from the current statutory rates. Mental health services with diagnosis related groups 424 to 432 or corresponding APR-DRGs, and facilities defined under subdivision 16 are excluded from this paragraph. Payments made to managed care plans shall be reduced for services provided on or after July 1, 2011, to reflect this reduction.\n(h) In addition to the reductions in paragraphs (b), (c), (d), (f), and (g), the total payment for fee-for-service admissions occurring on or after July 1, 2009, made to hospitals for inpatient services before third-party liability and spenddown, is reduced one percent from the current statutory rates. Facilities defined under subdivision 16 are excluded from this paragraph. Payments made to managed care plans shall be reduced for services provided on or after October 1, 2009, to reflect this reduction.\n(i) In addition to the reductions in paragraphs (b), (c), (d), (g), and (h), the total payment for fee-for-service admissions occurring on or after July 1, 2011, made to hospitals for inpatient services before third-party liability and spenddown, is reduced 1.96 percent from the current statutory rates. Facilities defined under subdivision 16 are excluded from this paragraph. Payments made to managed care plans shall be reduced for services provided on or after January 1, 2011, to reflect this reduction.\n(j) Effective for discharges on and after November 1, 2014, from hospitals paid under subdivision 2b, paragraph (a), clauses (1) and (4), the rate adjustments in this subdivision must be incorporated into the rebased rates established under subdivision 2b, paragraph (c), and must not be applied to each claim.\n(k) Effective for discharges on and after July 1, 2015, from hospitals paid under subdivision 2b, paragraph (a), clauses (2) and (3), the rate adjustments in this subdivision must be incorporated into the rates and must not be applied to each claim.\n(l) Effective for discharges on and after July 1, 2017, from hospitals paid under subdivision 2b, paragraph (a), clause (2), the rate adjustments in this subdivision must be incorporated into the rates and must not be applied to each claim.\n(a) The commissioner must not make medical assistance payments to a hospital for any costs of care that result from a condition identified in paragraph (c), if the condition was hospital acquired.\n(b) For purposes of this subdivision, a condition is hospital acquired if it is not identified by the hospital as present on admission. For purposes of this subdivision, medical assistance includes MinnesotaCare.\n(c) The prohibition in paragraph (a) applies to payment for each hospital-acquired condition identified in this paragraph that is represented by an ICD-9-CM or ICD-10-CM diagnosis code. The list of conditions shall be the hospital-acquired conditions (HAC) list defined by the Centers for Medicare and Medicaid Services on an annual basis.\n(d) The prohibition in paragraph (a) applies to any additional payments that result from a hospital-acquired condition identified in paragraph (c), including, but not limited to, additional treatment or procedures, readmission to the facility after discharge, increased length of stay, change to a higher diagnostic category, or transfer to another hospital. In the event of a transfer to another hospital, the hospital where the condition identified under paragraph (c) was acquired is responsible for any costs incurred at the hospital to which the patient is transferred.\n(e) A hospital shall not bill a recipient of services for any payment disallowed under this subdivision.\n(a) The total payment for fee for service admissions occurring on or after September 1, 2011, to October 31, 2014, made to hospitals for inpatient services before third-party liability and spenddown, is reduced ten percent from the current statutory rates. Facilities defined under subdivision 16, long-term hospitals as determined under the Medicare program, children's hospitals whose inpatients are predominantly under 18 years of age, and payments under managed care are excluded from this paragraph.\n(b) Effective for admissions occurring during calendar year 2010 and each year after, the commissioner shall calculate a readmission rate for admissions to all hospitals occurring within 30 days of a previous discharge using data from the Reducing Avoidable Readmissions Effectively (RARE) campaign. The commissioner may adjust the readmission rate taking into account factors such as the medical relationship, complicating conditions, and sequencing of treatment between the initial admission and subsequent readmissions.\n(c) Effective for payments to all hospitals on or after July 1, 2013, through October 31, 2014, the reduction in paragraph (a) is reduced one percentage point for every percentage point reduction in the overall readmissions rate between the two previous calendar years to a maximum of five percent.\n(d) The exclusion from the rate reduction in paragraph (a) shall apply to a hospital located in Hennepin County with a licensed capacity of 1,700 beds as of September 1, 2011, for admissions of children under 18 years of age occurring on or after September 1, 2011, through August 31, 2013, but shall not apply to payments for admissions occurring on or after September 1, 2013, through October 31, 2014.\n(e) Effective for discharges on or after November 1, 2014, from hospitals paid under subdivision 2b, paragraph (a), clauses (1) and (4), the rate adjustments in this subdivision must be incorporated into the rebased rates established under subdivision 2b, paragraph (c), and must not be applied to each claim.\n(f) Effective for discharges on and after July 1, 2015, from hospitals paid under subdivision 2b, paragraph (a), clauses (2) and (3), the rate adjustments in this subdivision must be incorporated into the rates and must not be applied to each claim.\n[Repealed, 1989 c 282 art 3 s 98]\nIf, under this section or section 256.9685, 256.9686, or 256.9695, a hospital is required to report information to the commissioner by a specified date, the hospital must report the information on time. If the hospital does not report the information on time, the commissioner may determine the information that will be used and may disregard the information that is reported late. If the Medicare program does not require or does not audit information that is needed to establish medical assistance rates, the commissioner may, after consulting the affected hospitals, require reports to be provided, in a format specified by the commissioner, that are based on allowable costs and cost-finding methods of the Medicare program in effect during the base year. The commissioner may require any information that is necessary to implement this section and sections 256.9685, 256.9686, and 256.9695 to be provided by a hospital within a reasonable time period.\n(a) A hospital that meets one of the following criteria must annually submit to the commissioner medical assistance cost reports within six months of the end of the hospital's fiscal year:\n(1) a hospital designated as a critical access hospital that receives medical assistance payments;\n(2) a Minnesota hospital or out-of-state hospital located within a Minnesota local trade area that receives a disproportionate population adjustment under subdivision 9; or\n(3) a Minnesota hospital that is designated as a children's hospital and enumerated as such by Medicare.\nFor purposes of this subdivision, local trade area has the meaning given in subdivision 17.\n(b) The commissioner shall suspend payments to any hospital that fails to submit a report required under this subdivision. Payments must remain suspended until the report has been filed with and accepted by the commissioner.\n[Repealed, 1989 c 282 art 3 s 98]\nInpatient hospital rates and payments must be established under this section and sections 256.9685, 256.9686, and 256.9695. The commissioner may adjust rates and payments based on the findings of audits of payments to hospitals, hospital billings, costs, statistical information, charges, or patient records performed by the commissioner or the Medicare program that identify billings, costs, statistical information, or charges for services that were not delivered, never ordered, in excess of limits, not covered by the medical assistance program, paid separately from rates established under this section and sections 256.9685, 256.9686, and 256.9695, or for charges that are not consistent with other payor billings. Charges to the medical assistance program must be less than or equal to charges to the general public. Charges to the medical assistance program must not exceed the lowest charge to any other payor. The audit findings may be based on a statistically valid sample of hospital information that is needed to complete the audit. If the information the commissioner uses to establish rates or payments is not audited by the Medicare program, the commissioner may require an audit using Medicare principles and may adjust rates and payments to reflect any subsequent audit.\n[Repealed, 1989 c 282 art 3 s 98]\nIn determining the payment rates, the commissioner shall consider whether the circumstances in subdivisions 8 to 14 exist.\n[Repealed, 1992 c 513 art 7 s 135]\n(a) The commissioner shall establish day outlier thresholds for each diagnostic category established under subdivision 2 at two standard deviations beyond the mean length of stay. Payment for the days beyond the outlier threshold shall be in addition to the operating and property payment rates per admission established under subdivisions 2 and 2b. Payment for outliers shall be at 70 percent of the allowable operating cost, after adjustment by the case mix index, hospital cost index, relative values and the disproportionate population adjustment. The outlier threshold for neonatal and burn diagnostic categories shall be established at one standard deviation beyond the mean length of stay, and payment shall be at 90 percent of allowable operating cost calculated in the same manner as other outliers. A hospital may choose an alternative to the 70 percent outlier payment that is at a minimum of 60 percent and a maximum of 80 percent if the commissioner is notified in writing of the request by October 1 of the year preceding the rate year. The chosen percentage applies to all diagnostic categories except burns and neonates. The percentage of allowable cost that is unrecognized by the outlier payment shall be added back to the base year operating payment rate per admission.\n(b) Effective for admissions and transfers occurring on and after November 1, 2014, the commissioner shall establish payment rates for outlier payments that are based on Medicare methodologies.\nFor an admission that is categorized to a diagnostic category that includes neonatal respiratory distress syndrome, the hospital must have a level II or level III nursery and the patient must receive treatment in that unit or payment will be made without regard to the syndrome condition.\n[Repealed, 2014 c 312 art 24 s 48]\n(a) For discharges occurring on or after November 1, 2014, payments for hospital residents shall be made as follows:\n(1) payments for the first 180 days of inpatient care shall be the APR-DRG system plus any outliers; and\n(2) payment for all medically necessary patient care subsequent to the first 180 days shall be reimbursed at a rate computed by multiplying the statewide average cost-to-charge ratio by the usual and customary charges.\n(b) For discharges occurring on or after July 1, 2017, payment for hospital residents shall be equal to the payments under subdivision 8, paragraph (b).\n(a) For admissions occurring on or after July 1, 1993, the medical assistance disproportionate population adjustment shall comply with federal law and shall be paid to a hospital, excluding regional treatment centers and facilities of the federal Indian Health Service, with a medical assistance inpatient utilization rate in excess of the arithmetic mean. The adjustment must be determined as follows:\n(1) for a hospital with a medical assistance inpatient utilization rate above the arithmetic mean for all hospitals excluding regional treatment centers and facilities of the federal Indian Health Service but less than or equal to one standard deviation above the mean, the adjustment must be determined by multiplying the total of the operating and property payment rates by the difference between the hospital's actual medical assistance inpatient utilization rate and the arithmetic mean for all hospitals excluding regional treatment centers and facilities of the federal Indian Health Service; and\n(2) for a hospital with a medical assistance inpatient utilization rate above one standard deviation above the mean, the adjustment must be determined by multiplying the adjustment that would be determined under clause (1) for that hospital by 1.1. The commissioner shall report annually on the number of hospitals likely to receive the adjustment authorized by this paragraph. The commissioner shall specifically report on the adjustments received by public hospitals and public hospital corporations located in cities of the first class.\n(b) Certified public expenditures made by Hennepin County Medical Center shall be considered Medicaid disproportionate share hospital payments. Hennepin County and Hennepin County Medical Center shall report by June 15, 2007, on payments made beginning July 1, 2005, or another date specified by the commissioner, that may qualify for reimbursement under federal law. Based on these reports, the commissioner shall apply for federal matching funds.\n(c) Upon federal approval of the related state plan amendment, paragraph (b) is effective retroactively from July 1, 2005, or the earliest effective date approved by the Centers for Medicare and Medicaid Services.\n(d) Effective July 1, 2015, disproportionate share hospital (DSH) payments shall be paid in accordance with a new methodology using 2012 as the base year. Annual payments made under this paragraph shall equal the total amount of payments made for 2012. A licensed children's hospital shall receive only a single DSH factor for children's hospitals. Other DSH factors may be combined to arrive at a single factor for each hospital that is eligible for DSH payments. The new methodology shall make payments only to hospitals located in Minnesota and include the following factors:\n(1) a licensed children's hospital with at least 1,000 fee-for-service discharges in the base year shall receive a factor of 0.868. A licensed children's hospital with less than 1,000 fee-for-service discharges in the base year shall receive a factor of 0.7880;\n(2) a hospital that has in effect for the initial rate year a contract with the commissioner to provide extended psychiatric inpatient services under section 256.9693 shall receive a factor of 0.0160;\n(3) a hospital that has received medical assistance payment for at least 20 transplant services in the base year shall receive a factor of 0.0435;\n(4) a hospital that has a medical assistance utilization rate in the base year between 20 percent up to one standard deviation above the statewide mean utilization rate shall receive a factor of 0.0468;\n(5) a hospital that has a medical assistance utilization rate in the base year that is at least one standard deviation above the statewide mean utilization rate but is less than two and one-half standard deviations above the mean shall receive a factor of 0.2300; and\n(6) a hospital that is a level one trauma center and that has a medical assistance utilization rate in the base year that is at least two and one-quarter standard deviations above the statewide mean utilization rate shall receive a factor of 0.3711.\n(e) For the purposes of determining eligibility for the disproportionate share hospital factors in paragraph (d), clauses (1) to (6), the medical assistance utilization rate and discharge thresholds shall be measured using only one year when a two-year base period is used.\n(f) Any payments or portion of payments made to a hospital under this subdivision that are subsequently returned to the commissioner because the payments are found to exceed the hospital-specific DSH limit for that hospital shall be redistributed, proportionate to the number of fee-for-service discharges, to other DSH-eligible non-children's hospitals that have a medical assistance utilization rate that is at least one standard deviation above the mean.\n(g) An additional payment adjustment shall be established by the commissioner under this subdivision for a hospital that provides high levels of administering high-cost drugs to enrollees in fee-for-service medical assistance. The commissioner shall consider factors including fee-for-service medical assistance utilization rates and payments made for drugs purchased through the 340B drug purchasing program and administered to fee-for-service enrollees. If any part of this adjustment exceeds a hospital's hospital-specific disproportionate share hospital limit, the commissioner shall make a payment to the hospital that equals the nonfederal share of the amount that exceeds the limit. The total nonfederal share of the amount of the payment adjustment under this paragraph shall not exceed $1,500,000.\n[Repealed, 2014 c 312 art 24 s 48]\n[Repealed, 2014 c 312 art 24 s 48]\nHospitals must exclude certified registered nurse anesthetist costs from the operating payment rate.\n[Repealed, 2014 c 312 art 24 s 48]\n(a) Units of hospitals that are recognized as rehabilitation distinct parts by the Medicare program shall have separate provider numbers under the medical assistance program for rate establishment and billing purposes only. These units shall also have operating payment rates and the disproportionate population adjustment, if allowed by federal law, established separately from other inpatient hospital services.\n(b) The commissioner shall establish separate relative values under subdivision 2 for rehabilitation hospitals and distinct parts as defined by the Medicare program. Effective for discharges occurring on and after November 1, 2014, the commissioner, to the extent possible, shall replicate the existing payment rate methodology under the new diagnostic classification system. The result must be budget neutral, ensuring that the total aggregate payments under the new system are equal to the total aggregate payments made for the same number and types of services in the base year, calendar year 2012.\n(c) For individual hospitals that did not have separate medical assistance rehabilitation provider numbers or rehabilitation distinct parts in the base year, hospitals shall provide the information needed to separate rehabilitation distinct part cost and claims data from other inpatient service data.\n(d) Effective with discharges on or after July 1, 2017, payment to rehabilitation hospitals shall be established under subdivision 2b, paragraph (a), clause (4).\n[Repealed, 2014 c 312 art 24 s 48]\n(a) Operating and property payment rates for admissions that result in transfers and transfers shall be established on a per day payment system. The per day payment rate shall be the sum of the adjusted operating and property payment rates determined under this subdivision and subdivisions 2, 2b, 3a, 4a, 5a, and 8 to 12, divided by the arithmetic mean length of stay for the diagnostic category. Each admission that results in a transfer and each transfer is considered a separate admission to each hospital, and the total of the admission and transfer payments to each hospital must not exceed the total per admission payment that would otherwise be made to each hospital under this subdivision and subdivisions 2, 2b, 3a, 4a, 5a, and 8 to 12.\n(b) Effective for transfers occurring on and after November 1, 2014, the commissioner shall establish payment rates for acute transfers that are based on Medicare methodologies.\nThe computation of each hospital's payment rate and the relative values of the diagnostic categories are not subject to the routine service cost limitation imposed under the Medicare program.\nFacilities of the Indian health service and facilities operated by a tribe or tribal organization under funding authorized by title III of the Indian Self-Determination and Education Assistance Act, Public Law 93-638, or by United States Code, title 25, chapter 14, subchapter II, sections 450f to 450n, are exempt from the rate establishment methods required by this section and shall be paid according to the rate published by the United States assistant secretary for health under authority of United States Code, title 42, sections 248A and 248B.\nOut-of-state hospitals that are located within a Minnesota local trade area and that have admissions in the base year or years shall have rates established using the same procedures and methods that apply to Minnesota hospitals. For this subdivision and subdivision 18, local trade area means a county contiguous to Minnesota and located in a metropolitan statistical area as determined by Medicare for October 1 prior to the most current rebased rate year. Hospitals that are not required by law to file information in a format necessary to establish rates shall have rates established based on the commissioner's estimates of the information. Relative values of the diagnostic categories shall not be redetermined under this subdivision until required by statute. Hospitals affected by this subdivision shall then be included in determining relative values. However, hospitals that have rates established based upon the commissioner's estimates of information shall not be included in determining relative values. This subdivision is effective for hospital fiscal years beginning on or after July 1, 1988. A hospital shall provide the information necessary to establish rates under this subdivision at least 90 days before the start of the hospital's fiscal year.\nHospitals that are not located within Minnesota or a Minnesota local trade area shall have inpatient hospital rates established at the average of statewide and local trade area rates or, at the commissioner's discretion, at an amount negotiated by the commissioner. Relative values shall not include data from hospitals that have rates established under this subdivision. Payments, including third-party and recipient liability, established under this subdivision may not exceed the charges on a claim specific basis for inpatient services that are covered by medical assistance.\nMedical assistance inpatient payment rates must include the cost incurred by hospitals to pay the Department of Health for metabolic disorder testing of newborns who are medical assistance recipients, if the cost is not recognized by another payment source. This payment increase remains in effect until the increase is fully recognized in the base year cost under subdivision 2b.\n[Repealed, 2014 c 312 art 24 s 48]\n[Repealed, 2014 c 312 art 24 s 48]\n[Repealed, 2014 c 312 art 24 s 48]\n[Repealed, 2015 c 71 art 11 s 65]\n[Repealed, 1995 c 207 art 6 s 124]\n(a) Long-term hospitals shall be paid on a per diem basis.\n(b) For admissions occurring on or after April 1, 1995, a long-term hospital as designated by Medicare that does not have admissions in the base year shall have inpatient rates established at the average of other hospitals with the same designation. For subsequent rate-setting periods in which base years are updated, the hospital's base year shall be the first Medicare cost report filed with the long-term hospital designation and shall remain in effect until it falls within the same period as other hospitals.\n(c) For admissions occurring on or after July 1, 2023, long-term hospitals must be paid the higher of a per diem amount computed using the methodology described in subdivision 2b, paragraph (i), or the per diem rate as of July 1, 2021.\n[Repealed, 2014 c 312 art 24 s 48]\n[Repealed, 2014 c 312 art 24 s 48]\n[Repealed, 2014 c 312 art 24 s 48]\n(a) For admissions occurring on or after July 1, 2010, payment rates shall be adjusted to include the increase to the fee that is effective on July 1, 2010, for the early hearing detection and intervention program recipients under section 144.125, subdivision 1, that is paid by the hospital for public program recipients. This payment increase shall be in effect until the increase is fully recognized in the base year cost under subdivision 2b. This payment shall be included in payments to contracted managed care organizations.\n(b) For admissions occurring on or after July 1, 2013, payment rates shall be adjusted to include the increase to the fee that is effective July 1, 2013, for the early hearing detection and intervention program under section 144.125, subdivision 1, paragraph (d), that is paid by the hospital for medical assistance and MinnesotaCare program enrollees. This payment increase shall be in effect until the increase is fully recognized in the base-year cost under subdivision 2b. This payment shall be included in payments to managed care plans and county-based purchasing plans.\n[Repealed, 2015 c 71 art 11 s 65]\n(a) The commissioner must provide separate reimbursement to hospitals for long-acting reversible contraceptives provided immediately postpartum in the inpatient hospital setting. This payment must be in addition to the diagnostic related group reimbursement for labor and delivery and shall be made consistent with section 256B.0625, subdivision 13e, paragraph (e).\n(b) The commissioner must require managed care and county-based purchasing plans to comply with this subdivision when providing services to medical assistance enrollees. If, for any contract year, federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed the amount equal to any increase in rates that results from this provision. This paragraph expires if federal approval is not received for this paragraph at any time.\n(a) Effective July 1, 2025, and upon necessary federal approval of documentation required to enter into a value-based arrangement under section 256B.0625, subdivision 13k, the commissioner may provide separate reimbursement to hospitals for biological products provided in the inpatient hospital setting as part of cell or gene therapy to treat rare diseases, as defined in United States Code, title 21, section 360bb, if the drug manufacturer enters into a value-based arrangement with the commissioner.\n(b) The commissioner shall establish the separate reimbursement rate for biological products provided under paragraph (a) based on the methodology used for drugs administered in an outpatient setting under section 256B.0625, subdivision 13e, paragraph (e).\n[See Note.]",
	"repealed": false
}