{
	"id": "168A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.10",
	"title": "168A.10 TRANSFER OF INTEREST BY OWNER.",
	"text": "If an owner transfers interest in a vehicle other than by the creation of a security interest, the owner shall at the time of the delivery of the vehicle execute an assignment and warranty of title to the transferee and shall state the actual selling price in the space provided on the certificate. Within ten days of the date of sale, other than a sale by or to a licensed motor vehicle dealer, the owner shall: (1) complete, detach, and return to the department the form on the certificate entitled \"Notice of Sale,\" if one is provided, including the transferee's name, address, and driver's license number, if any, and the date of sale; or (2) transmit this information electronically in a form acceptable to the commissioner. With respect to motor vehicles subject to the provisions of section 325E.15, the transferor shall also, in the space provided therefor on the certificate, state the true cumulative mileage registered on the odometer or that the actual mileage is unknown if the odometer reading is known by the transferor to be different from the true mileage. The transferor shall cause the certificate and assignment to be delivered to the transferee immediately.\nExcept as provided in section 168A.11, the transferee must, within 20 calendar days after assignment to the transferee of the vehicle title certificate, execute the application for a new certificate of title in the space provided on the certificate, and cause the certificate of title to be mailed or delivered to the department. Failure of the transferee to comply with this subdivision results in the suspension of the vehicle's registration under section 168.17.\nMS 1988 [Repealed by amendment, 1989 c 148 s 7]\nIf a security interest is reserved or created at the time of the transfer, a notification of security interest shall be delivered or mailed to the person who becomes the secured party.\nExcept as provided in section 168A.11 and as between the parties, a transfer by an owner is not effective until the provisions of this section have been complied with; however, an owner who has delivered possession of the vehicle to the transferee and has complied, or within 48 hours after such delivery does comply, with the provisions of this section requiring action by the owner is not liable as owner for any damages resulting from operation of the vehicle after the delivery of the vehicle to the transferee. An owner is not liable who has complied with the provisions of this section except for completing and returning the Notice of Sale or transmitting the required information electronically under subdivision 1.\nMS 1996 [Repealed, 1997 c 135 s 4]",
	"repealed": false
}