{
	"id": "462.397",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.397",
	"title": "462.397 BORROWING MONEY; CERTIFICATES OF INDEBTEDNESS.",
	"text": "At any time after a tax has been levied by the commission and certified to the county auditors to be spread on the next tax roll for collection, the commission may borrow money and in evidence thereof issue and sell its certificates of indebtedness in anticipation of the collection of such levy.\nThe aggregate principal amount of such certificates then remaining outstanding, issued in anticipation of any levies whatsoever, plus the then unpaid accrued interest and interest to accrue to maturity on all such certificates, shall not exceed 50 percent of all taxes certified to the county auditors to be spread and collected which are not delinquent, less the amount thereof received by the commission before the latest certificates were issued.\nAll certificates shall mature not later than April 1 following the close of the year of collection of the taxes in anticipation of which they were issued, and may be made subject to redemption before maturity.\nThe commission shall, by the resolution authorizing each issue of certificates, fix the amount, date, maturity or maturities, prepayment provisions, form, denominations, interest rate or rates, and other details of the certificates, and also pledge the full faith and credit of the commission for the payment thereof. In and by such resolution, the commission shall also irrevocably appropriate to a special fund such amount, stated in dollars, of the levy anticipated as will be required to pay the principal of and interest on the certificates when due.\nIf, due to delinquencies in collection thereof, the levy is not received at the times and in the amounts sufficient to meet principal of and interest on certificates payable therefrom, the commission may levy and cause to be extended, assessed and collected upon all taxable property within the region, such ad valorem taxes as may be required to pay such principal and interest and to restore to other funds advances made for that purpose.\nAll such certificates may be negotiated and sold in such manner as may be determined by the commission.",
	"repealed": false
}