{
	"id": "53C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.03",
	"title": "53C.03 SUSPENSION OR REVOCATION OF VEHICLE SALES FINANCE COMPANY LICENSE; APPEAL.",
	"text": "(a) A license may be suspended or revoked by the commissioner on the following grounds:\n(1) material misstatement in application for license;\n(2) intentional failure to comply with any provision of sections 53C.01 to 53C.14 relating to retail installment contract;\n(3) defrauding any retail buyer to the buyer's damage;\n(4) fraudulent misrepresentation, circumvention or concealment by the licensee through whatever subterfuge or device of any of the material particulars or the nature thereof required to be stated or furnished to the retail buyer under sections 53C.01 to 53C.14.\n(b) If a licensee is a firm, association or corporation, it shall be sufficient cause for the suspension or revocation of a license that any officer, director or trustee of a licensed firm, association or corporation, or any member of a licensed partnership, has so acted or failed to act as would be cause for suspending or revoking a license to such part as an individual. Each licensee shall be responsible for the acts of any or all of the licensee's employees while acting as the licensee's agent, if the licensee after actual knowledge of that employee's act retained the benefits, proceeds, profits or advantages accruing from the acts or otherwise ratified the acts.\n(c) No license shall be suspended or revoked except after hearing. The commissioner shall give the licensee at least ten days' written notice, in the form of an order to show cause, of the time and place of the hearing by certified mail addressed to the principal place of business in this state of the licensee. The notice shall contain the grounds of complaint against the licensee. Any order suspending or revoking the license shall recite the grounds upon which it is based. The order shall be entered upon the records of the commissioner and shall not be effective until after 30 days' written notice thereof given after such entry forwarded by certified mail to the licensee at such principal place of business. No revocation, suspension or surrender of any license shall impair or affect the obligation of any lawful retail installment contract acquired previously thereto by the licensee.\n(d) Within 30 days after the service of notice of any order of suspension or revocation of a license, the licensee aggrieved may appeal from the order to the district court for the county in which the principal place of business of the licensee in this state is located, by service of a written notice of appeal upon the commissioner, and filing it with proof of service with the court administrator of the court to which the appeal is taken, within five days. The district court has jurisdiction over the appeal. It shall be entered upon the records of the court and tried according to the Rules of Civil Procedure in so far as they are applicable. Upon receiving service of a notice of appeal, the commissioner shall file with the court administrator of the district court to which the appeal is taken a certified copy of the order appealed from and of the order to show cause upon which it was based. Unless otherwise ordered by the court, the documents filed shall frame the issues to be determined upon the appeal. The court shall determine, de novo, all questions, both of fact and of law, touching upon the legality and reasonableness of the determination of the commissioner, and shall render such judgment as shall be lawful and just. Pending final judgment on the appeal, the order appealed from shall be stayed. Upon motion of the licensee or the commissioner, the appeal shall be tried ahead of all other actions pending before the court except criminal cases. Appeals may be taken as in other civil cases.",
	"repealed": false
}