{
	"id": "353.0162",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.0162",
	"title": "353.0162 SALARY CREDIT PURCHASE FOR PERIODS OF REDUCED SALARY.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them, unless the context clearly indicates another meaning is intended.\n(b) \"Differential salary credit\" is the difference between the salary received by the member during a period of reduced salary as described in subdivision 2 and the salary of the member, excluding overtime, on which contributions to the applicable plan would have been made during the period based on the member's normal employment period, measured in hours or otherwise, as applicable, and rate of pay.\n(c) \"Reporting period\" means a school year, for school year employees, or a calendar year, for all other employees, during which a member has a period of reduced salary.\nA member may purchase differential salary credit for a period of reduced salary.\nThe period of reduced salary must be a period occurring entirely within one school year, for school year employees, or one calendar year, for all other employees, during which the member receives no salary or a reduced salary from the employer while the member is:\n(1) receiving workers' compensation payments related to the member's service to the public employer;\n(2) on an authorized leave of absence;\n(3) on an authorized leave of absence as a result of a budgetary or salary savings program offered or mandated by a governmental subdivision, if certified to the executive director by the governmental subdivision; or\n(4) on a periodic, repetitive leave that is offered to all employees of a governmental subdivision where the leave program is certified by the employer to the association as one that does not exceed 208 hours during the school year or calendar year, as applicable.\n(a) To receive differential salary credit, the member shall pay the plan, by delivering payment to the executive director, an amount equal to:\n(1) the applicable employee contribution rate under section 353.27, subdivision 2; 353.65, subdivision 2; or 353E.03, subdivision 1, as applicable, multiplied by the differential salary amount;\n(2) plus an employer equivalent payment equal to the applicable employer contribution rate in section 353.27, subdivision 3; 353.65, subdivision 3; or 353E.03, subdivision 2, as applicable, multiplied by the differential salary amount;\n(3) plus, if applicable, an equivalent employer additional amount equal to the additional employer contribution rate in section 353.27, subdivision 3a, multiplied by the differential salary amount.\n(b) The employer, by appropriate action of its governing body and documented in its official records, may pay on behalf of the member the amounts determined under paragraph (a), clauses (2) and (3), as applicable, plus interest under paragraph (c). However, if the period of reduced salary is a periodic, repetitive leave under subdivision 2, clause (4), then the employer must pay on behalf of the member the amount determined under paragraph (a), clauses (2) and (3), as applicable, plus interest under paragraph (c).\n(c) Payment under this section must include interest on the contribution amount or amounts, whichever applies, at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually, prorated for the number of months, if less than 12 months, from the end of the school year or calendar year, as applicable, until full payment is received by the executive director.\nPayment under this section must be completed no later than one year after the end of each reporting period.",
	"repealed": false
}