{
	"id": "273.032",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.032",
	"title": "273.032 MARKET VALUE DEFINITION.",
	"text": "(a) Unless otherwise provided, for the purpose of determining any property tax levy limitation based on market value or any limit on net debt, the issuance of bonds, certificates of indebtedness, or capital notes based on market value, any qualification to receive state aid based on market value, or any state aid amount based on market value, the terms \"market value,\" \"estimated market value,\" and \"market valuation,\" whether equalized or unequalized, mean the estimated market value of taxable property within the local unit of government before any of the following or similar adjustments for:\n(1) the market value exclusions under:\n(i) section 273.11, subdivisions 14a and 14c (vacant platted land);\n(ii) section 273.11, subdivisions 19 and 20 (certain improvements to business properties);\n(iii) section 273.11, subdivision 21 (homestead property damaged by mold);\n(iv) section 273.13, subdivision 34 (homestead of a veteran with a disability or family caregiver); or\n(v) section 273.13, subdivision 35 (homestead market value exclusion); or\n(2) the deferment of value under:\n(i) the Minnesota Agricultural Property Tax Law, section 273.111;\n(ii) the Aggregate Resource Preservation Law, section 273.1115;\n(iii) the Minnesota Open Space Property Tax Law, section 273.112;\n(iv) the rural preserves property tax program, section 273.114; or\n(v) the Metropolitan Agricultural Preserves Act, section 473H.10; or\n(3) the adjustments to tax capacity for:\n(i) tax increment financing under sections 469.174 to 469.1794;\n(ii) fiscal disparities under chapter 276A or 473F; or\n(iii) powerline credit under section 273.425.\n(b) Estimated market value under paragraph (a) also includes the market value of tax-exempt property if the applicable law specifically provides that the limitation, qualification, or aid calculation includes tax-exempt property.\n(c) Unless otherwise provided, \"market value,\" \"estimated market value,\" and \"market valuation\" for purposes of property tax levy limitations and calculation of state aid, refer to the estimated market value for the previous assessment year and for purposes of limits on net debt, the issuance of bonds, certificates of indebtedness, or capital notes refer to the estimated market value as last finally equalized.\n(d) For purposes of a provision of a home rule charter or of any special law that is not codified in the statutes and that imposes a levy limitation based on market value or any limit on debt, the issuance of bonds, certificates of indebtedness, or capital notes based on market value, the terms \"market value,\" \"taxable market value,\" and \"market valuation,\" whether equalized or unequalized, mean \"estimated market value\" as defined in paragraph (a).",
	"repealed": false
}