{
	"id": "256.976",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.976",
	"title": "256.976 FOSTER GRANDPARENTS PROGRAM.",
	"text": "There is established a foster grandparents program which will engage the services of low-income persons aged 60 or over to provide supportive person to person assistance in health, education, welfare, and related fields to persons receiving care in resident group homes for dependent and neglected persons, day care centers or other public or private nonprofit institutions or agencies providing care for neglected and disadvantaged persons who lack close personal relationships.\nPersons employed as foster grandparents shall be compensated for no more than 20 hours per week and at an hourly rate not to exceed the federal minimum wage by more than 20 percent. In addition to such compensation foster grandparents shall be eligible for protective clothing, including replacement of glasses; transportation assistance, not to exceed mileage payments for 20 miles per day or chartered transportation service, for travel between residence and place of employment; workers' compensation; annual physical examinations; food services during employment, generally provided by the employing agency or institution; and such other assistance as the Minnesota Board on Aging may prescribe. No person employed as a foster grandparent shall be terminated because of redefinition of income standards, or a change of income, marital status, or number of dependents.\nThe Minnesota Board on Aging, hereinafter called the board, may make grants-in-aid for the employment of foster grandparents to qualified resident group homes for dependent and neglected persons, day care centers and other public or nonprofit private institutions and agencies providing care for neglected and disadvantaged persons who lack close personal relationships. Agencies and institutions seeking aid shall apply on a form prescribed by the board. Priority shall be given to agencies and institutions providing care for children with developmental disabilities. Grants shall not be made to local public or nonprofit agencies until 40 percent of the recognized need for foster grandparents within state institutions has been met. Grants shall be for a period of 12 months or less, and grants to local public and nonprofit agencies or institutions shall be based on 90 percent state, and ten percent local sharing of program expenditures authorized by the board. Grants shall not be used to match other state funds nor shall any person paid from grant funds be used to replace any staff member of the grantee. Grants may be used to match federal funds. Each grantee shall file a semiannual report with the board at the time and containing such information as the board shall prescribe.\nThe board is authorized, subject to the provisions of chapter 14, to make rules necessary to the operation of the foster grandparent program and to employ assistance in performing its administrative duties. In adopting rules the board shall give consideration to applicable federal guidelines.",
	"repealed": false
}