{
	"id": "473.303",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.303",
	"title": "473.303 METROPOLITAN PARKS AND OPEN SPACE COMMISSION.",
	"text": "A Metropolitan Parks and Open Space Commission is established as an agency of the council and shall be organized and structured as provided in this section.\n(a) The agency consists of eight members, plus a chair appointed as provided in subdivision 3. The Metropolitan Council shall appoint the eight members on a nonpartisan basis after consultation with the members of the legislature from the district for which the member is to be appointed. The consultation with legislators in the affected district must include informing each legislator of the name, address, and background of each candidate for appointment and soliciting and reporting to the appointments committee the recommendation of each legislator on the appointment.\n(b) In addition to the notice required in section 15.0597, subdivision 4, notice of vacancies and expiration of terms must be published in newspapers of general circulation in the metropolitan area and the appropriate districts. The council shall notify in writing the governing bodies of the statutory and home rule charter cities, counties, and towns having territory in the district for which the member is to be appointed. The notices must describe the appointment process and invite participation and recommendations on the appointment.\n(c) The council shall establish an appointments committee, composed of members of the council, to screen and review candidates. Following the submission of member applications to the Metropolitan Council as provided under section 15.0597, subdivision 5, the appointments committee shall conduct public meetings, following appropriate notice, to accept statements from or on behalf of persons who have applied or been nominated for appointment and to allow consultation with and secure the advice of the public and local elected officials. The committee shall hold the meeting on each appointment in the district or in a reasonably convenient and accessible location in the part of the metropolitan area in which the district is located. The committee may consolidate meetings. Following the meetings, the committee shall submit to the council a written report that lists the persons who have applied or been nominated or recommended for the position, along with a description of the background and qualifications of each. In making its recommendation, the committee specifically shall consider evidence of the candidate's commitment to regularly communicate on issues before the agency with Metropolitan Council members, legislators and local elected officials in the district, and the committee shall report its findings on this subject in its written report to the council.\n(d) One member shall be appointed from each of the following agency districts:\n(1) district A, consisting of council districts 1 and 2;\n(2) district B, consisting of council districts 3 and 4;\n(3) district C, consisting of council districts 5 and 6;\n(4) district D, consisting of council districts 7 and 8;\n(5) district E, consisting of council districts 9 and 10;\n(6) district F, consisting of council districts 11 and 12;\n(7) district G, consisting of council districts 13 and 14; and\n(8) district H, consisting of council districts 15 and 16.\nThe chair of the commission shall be appointed by the council and shall be the ninth member of the commission and shall meet all qualifications established for members, except the chair need only reside within the metropolitan area. The chair shall preside at all meetings of the commission, if present, and shall perform all other duties and functions assigned by the commission or by law. The commission may appoint from among its members a vice-chair to act for the chair during temporary absence or disability.\nEach member shall communicate regularly with Metropolitan Council members, legislators, and local government officials in the district the member represents.\nEach member shall be a resident of the commission district for which appointed and shall not during terms of office as a commission member hold the office of Metropolitan Council member, or be a member of any metropolitan agency or hold any judicial office.\nFollowing each apportionment of Metropolitan Council districts, as provided under section 473.123, subdivision 3a, the Metropolitan Council shall appoint a chair and eight commission members from newly drawn districts. The terms of members and chairs are as follows: members representing commission districts A, B, C, and D, and the chair of the commission, for terms ending the first Monday in January of the year ending in the numeral \"7\"; members representing commission districts E, F, G, and H, for terms ending the first Monday in January of the year ending in the numeral \"5.\" Thereafter the term of each member and the chair is four years, with terms ending the first Monday in January, except that all terms expire on the effective date of the next apportionment. The chair shall continue to serve until a successor is appointed and qualified. A member shall continue to serve the commission district until a successor is appointed and qualified; except that, following each apportionment, the member shall continue to serve at large until the Metropolitan Council appoints eight commission members as provided under subdivision 2, to serve terms as provided under this subdivision. The appointments to the commission must be made by the first Monday in May of the year in which the term ends.\nIf the office of any commission member or the chair becomes vacant, the vacancy shall be filled by appointment in the same manner the original appointment was made. Members, other than the chair, may be removed by the council only for cause. The chair may be removed at the pleasure of the council.\nMembers and the chair shall serve without compensation but shall be reimbursed for all actual and necessary expenses incurred in the performance of duties as determined by the Metropolitan Council.",
	"repealed": false
}