{
	"id": "356.96",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.96",
	"title": "356.96 PENSION PLAN APPEAL PROCEDURES.",
	"text": "(a) Unless the language or context clearly indicates that a different meaning is intended, for the purpose of this section, the terms in this subdivision have the meanings given them.\n(b) \"Executive director\" means the executive director of a covered pension plan or the executive director's designee or representative.\n(c) \"Covered pension plan\" means a plan enumerated in section 356.20, subdivision 2, clauses (1) to (4), (8), and (11) to (14), but does not mean the deferred compensation plan administered under sections 352.965 and 352.97 or to the postretirement health care savings plan administered under section 352.98.\n(d) \"Governing board\" means the Board of Trustees of the Public Employees Retirement Association, the Board of Trustees of the Teachers Retirement Association, or the Board of Directors of the Minnesota State Retirement System.\n(e) \"Person\" means an active, retired, deferred, or nonvested inactive participant in a covered pension plan or a beneficiary of a participant, or an individual who has applied to be a participant or who is or may be a survivor of a participant, or the representative of a state agency or other governmental unit that employs active participants in a covered pension plan.\n(f) \"Petitioner\" means a person who has filed a petition for review of an executive director's determination under this section.\nA person may appeal a decision by the staff of a covered pension plan regarding the person's eligibility, benefits, or other rights under the plan to the executive director of the plan. The appeal must be in writing and be delivered to the executive director no later than 60 days after the date of the written notice of the staff decision. The executive director may overturn, modify, or affirm the staff's decision. The executive director's determination is subject to review under this section.\nThe executive director shall issue a written notice of determination to the person who files an appeal under subdivision 2. The notice of determination must be delivered by certified mail to the address to which the most recent benefit payment was sent or, if that address is that of a financial institution, to the last known address of the person. The notice of determination shall include the following:\n(1) a statement of the reasons for the determination;\n(2) a statement that the person may petition the governing board of the covered pension plan for a review of the determination and that a person's petition for review must be filed in the administrative office of the covered pension plan no later than 60 days after the date of the written notice of determination;\n(3) a statement indicating that a failure to petition for review within 60 days precludes the person from any further administrative or judicial review of the executive director's determination;\n(4) a statement indicating that all relevant materials, documents, affidavits, and other records that the person wishes to be reviewed in support of the petition and a list of any witnesses who will testify before the governing board, along with a summary of the witness' testimony, must be filed with the administrative office of the covered pension plan at least 15 days before the date of the hearing under subdivision 10 or as directed by the administrative law judge who conducts a fact-finding conference under subdivision 7, paragraph (b), or a contested case hearing under subdivision 12, paragraph (b);\n(5) a summary of this section, including all filing requirements and deadlines; and\n(6) the statement required under subdivision 4, paragraph (a), if applicable.\n(a) If the executive director's determination will terminate a benefit that is being paid to a person, the notice of determination must also state that the person has the opportunity to explain, in writing, in person, by telephone, or by email, the reasons that the benefit should not be terminated.\n(b) If the notice of determination is returned as undeliverable and the person cannot be reached by any other reasonable means of communication and the executive director determines that a failure to terminate the benefit will result in unauthorized payment by a covered pension plan, the executive director may terminate the benefit immediately.\n(a) Upon receipt of the notice of determination required in subdivision 3, a person may petition the governing board of the covered pension plan for a review of the executive director's determination.\n(b) The petitioner must file the petition for review with the administrative office of the covered pension plan no later than 60 days after the date of the notice of determination required by subdivision 3. Filing of the petition is effective upon mailing or personal delivery. The petition must include the petitioner's statement of the reason or reasons that the determination of the executive director should be reversed or modified.\nIf a timely petition for review under subdivision 5 is not filed with the administrative office of the covered pension plan, the executive director's determination is final and is not subject to further administrative or judicial review.\n(a) After receiving a petition, the executive director must schedule a hearing to review the petition before the governing board of the covered pension plan or the executive director may defer the scheduling of a hearing until after a fact-finding conference under paragraph (b).\n(b) The executive director may direct the petitioner to participate in a fact-finding conference conducted by an administrative law judge assigned by the Office of Administrative Hearings. The fact-finding conference is an informal proceeding not subject to Minnesota Rules, chapter 1400, except that Minnesota Rules, part 1400.7300, shall govern the admissibility of evidence and Minnesota Rules, part 1400.8603, shall govern how the fact-finding conference is conducted. The administrative law judge must issue a report and a recommendation to the governing board.\n(c) If the petitioner's claim relates to disability benefits, the executive director may direct the petitioner to participate in a vocational assessment conducted by a qualified rehabilitation counselor under contract with the covered pension plan. The counselor must issue a report regarding the assessment to the governing board.\n(d) Not less than 30 calendar days before the date scheduled for the hearing before the governing board, the executive director must notify the petitioner of the time and place of the meeting at which the governing board is scheduled to conduct the hearing. If there has been no fact-finding conference under paragraph (b), not less than 15 days before the date scheduled for the hearing, the petitioner and the executive director must provide to the governing board and the other party copies of all documentary evidence that will be presented and a list of witnesses who will testify, along with a summary of their testimony.\n(e) The petitioner may request a postponement of the date scheduled for the hearing before the governing board within a reasonable time, but no later than ten calendar days before the scheduled hearing date. A petitioner shall be granted only one postponement unless the applicable covered pension plan agrees to additional postponements.\n(a) All evidence, including all records, documents, and affidavits in the possession of the covered pension plan of which the covered pension plan desires to avail itself and be considered by the governing board, and all evidence which the petitioner wishes to present to the governing board, including any evidence which would otherwise be classified by law as \"private,\" must be made part of the hearing record.\n(b) The executive director must provide a copy of the record to each member of the governing board at least five days before the scheduled hearing date.\n(c) If a fact-finding conference under subdivision 7, paragraph (b), is not conducted, the record is limited to those materials provided to the petitioner in accordance with subdivision 7, paragraph (d), those filed by the petitioner with the covered pension plan in a timely manner in accordance with subdivision 7, paragraph (e), any vocational assessment report under subdivision 7, paragraph (c), and any testimony at the hearing before the governing board. Any additional evidence may be placed in the record pursuant to subdivision 10, paragraph (b).\n(d) If a fact-finding conference under subdivision 7, paragraph (b), or a contested case hearing under subdivision 12, paragraph (b), is conducted, the record before the governing board must be limited to the following:\n(1) the record from the Office of Administrative Hearings;\n(2) seven-page submissions by the petitioner and a representative of the covered pension plan commenting on the administrative law judge's recommendation; and\n(3) any vocational assessment report under subdivision 7, paragraph (c).\nAt any time before the hearing before the governing board, for good cause shown and made part of the records of the plan, the executive director may reverse, alter, amend, or modify the prior decision which is subject to review under this section by issuing an amended determination to the petitioner. Upon doing so, the executive director may cancel the governing board's scheduled review of the person's petition and notify the petitioner.\n(a) The governing board shall hold a timely hearing on a petition for review as part of a regularly scheduled board meeting, or as part of a special meeting if so scheduled. All governing board members who participate in the decision-making process must be familiar with the record. The governing board shall make its decision on a petition solely on the record as submitted and on the proceedings of the hearing.\n(b) At the hearing, the petitioner, the petitioner's representative, if any, the executive director, and a representative of the covered pension plan who does not also serve as the governing board's legal advisor during the board's decision-making process may state and discuss with the governing board their positions with respect to the petition. If no fact-finding conference under subdivision 7, paragraph (b), or contested case hearing under subdivision 12, paragraph (b), was conducted, additional evidence may be received in the form of testimony from previously disclosed witnesses. The governing board may allow further documentation to be placed in the record at the board meeting only with the agreement of both the executive director and the petitioner. The executive director may not otherwise participate in the board's decision-making process.\n(c) If a petitioner who received timely notice of a scheduled hearing fails to appear, the governing board may nevertheless hear the petition and issue a decision.\n(d) The governing board's decision shall be made upon a motion by a board member and approval by a majority of the governing board. The governing board must issue its decision as a written order containing findings of fact, conclusions of law, and the board's decision no later than 30 days after the hearing. If the decision is contrary to the petitioner's desired outcome, the notice must inform the petitioner of the appeal rights set forth in subdivision 13.\nIf the petitioner seeks to reverse or modify a determination by the executive director that there was insufficient medical data to support an application for disability benefits, the governing board may reverse that determination only if there is medical evidence supporting the application. The governing board has the discretion to resubmit a disability benefit application at any time to a medical advisor for reconsideration, and the resubmission may include an instruction that further medical examinations be obtained.\n(a) A fact-finding conference under subdivision 7, paragraph (b), must be conducted exclusively under the procedures set forth in this section and not as a contested case under chapter 14.\n(b) A governing board, in its sole discretion, may refer a petition brought under this section to the Office of Administrative Hearings for a contested case hearing under sections 14.57 to 14.69.\nNo later than 60 days after the date of the mailing of the notice of the governing board's decision, the petitioner may appeal the decision by filing a writ of certiorari with the court of appeals under section 606.01 and Rule 115 of the Minnesota Rules of Civil Appellate Procedure. Failure by a person to appeal to the court of appeals within the 60-day period precludes the person from later raising, in any subsequent administrative hearing or court proceeding, those substantive and procedural issues that reasonably should have been raised upon a timely appeal.\nMS 2016 [Repealed, 2018 c 211 art 13 s 21]\nMS 2016 [Repealed, 2018 c 211 art 13 s 21]",
	"repealed": false
}