{
	"id": "299F.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.035",
	"title": "299F.035 FIRE DEPARTMENT USE OF CRIMINAL HISTORY DATA.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Minnesota criminal history\" means adult convictions and juvenile adjudications.\n(c) \"Fire department\" has the meaning given in section 299N.01, subdivision 2.\n(d) \"Private data\" has the meaning given in section 13.02, subdivision 12.\n(a) A background check must be conducted on all applicants for employment and may be conducted on current employees at a fire department. The fire chief must conduct a Minnesota criminal history record check. For applicants for employment who have lived in Minnesota for less than five years, or on the request of the fire chief, a national criminal history record check must also be conducted.\n(b) For a Minnesota criminal history record check, the fire chief must either (1) submit the signed informed consent of the applicant or employee and the required fee to the superintendent, or (2) submit the signed informed consent to the chief of police. The superintendent or chief must retrieve Minnesota criminal history data and provide the data to the fire chief for review.\n(c) For a national criminal history record check, the fire chief must submit the signed informed consent and fingerprints of the applicant or employee, and the required fee, to the superintendent. The superintendent may exchange the fingerprints with the Federal Bureau of Investigation to obtain the individual's national criminal history record information. The superintendent must return the results of the national criminal history record check to the fire chief for the purpose of determining if the applicant is qualified to be employed or if a current employee is able to retain the employee's position.\nCriminal history data may be used in assessing fire department job applicants or employees only if the criminal history data are directly related to the position of employment sought or currently held.\nIn determining if criminal history data are directly related to the position of employment, the hiring or employing authority may consider:\n(1) the nature and seriousness of the criminal history data on the job applicant or employee;\n(2) the relationship of the criminal history data to the purposes of regulating the position of employment; and\n(3) the relationship of the criminal history data to the ability, capacity, and fitness required to perform the duties and discharge the responsibilities of the position of employment.\nA fire department hiring or employing authority that obtains access to criminal history data under this section must use uniform access procedures that apply to all applicants or employees. With respect to current employees, a hiring or employing authority may request private data only if at least one year has elapsed since access to the data was previously requested.",
	"repealed": false
}