{
	"id": "287.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/287.08",
	"title": "287.08 TAX, HOW PAYABLE; RECEIPTS.",
	"text": "(a) The tax imposed by sections 287.01 to 287.12 must be paid to the treasurer of any county in this state in which the real property or some part is located at or before the time of filing the mortgage for record. The treasurer shall endorse receipt on the mortgage and the receipt is conclusive proof that the tax has been paid in the amount stated and authorizes any county recorder or registrar of titles to record the mortgage. Its form, in substance, shall be \"registration tax hereon of ..................... dollars paid.\" If the mortgage is exempt from taxation the endorsement shall, in substance, be \"exempt from registration tax.\" In either case the receipt must be signed by the treasurer. In case the treasurer is unable to determine whether a claim of exemption should be allowed, the tax must be paid as in the case of a taxable mortgage. For documents submitted electronically, the endorsements and tax amount shall be affixed electronically and no signature by the treasurer will be required. The actual payment method must be arranged in advance between the submitter and the receiving county.\n(b) The county treasurer may refund in whole or in part any mortgage registry tax overpayment if a written application by the taxpayer is submitted to the county treasurer within 3-1/2 years from the date of the overpayment. If the county has not issued a denial of the application, the taxpayer may bring an action in Tax Court in the county in which the tax was paid at any time after the expiration of six months from the time that the application was submitted. A denial of refund may be appealed within 60 days from the date of the denial by bringing an action in Tax Court in the county in which the tax was paid. The action is commenced by the serving of a petition for relief on the county treasurer, and by filing a copy with the court. The county attorney shall defend the action. The county treasurer shall notify the treasurer of each county that has or would receive a portion of the tax as paid.\n(c) If the county treasurer determines a refund should be paid, or if a refund is ordered by the court, the county treasurer of each county that actually received a portion of the tax shall immediately pay a proportionate share of three percent of the refund using any available county funds. The county treasurer of each county that received, or would have received, a portion of the tax shall also pay their county's proportionate share of the remaining 97 percent of the court-ordered refund on or before the 20th day of the following month using solely the mortgage registry tax funds that would be paid to the commissioner of revenue on that date under section 287.12. If the funds on hand under this procedure are insufficient to fully fund 97 percent of the court-ordered refund, the county treasurer of the county in which the action was brought shall file a claim with the commissioner of revenue under section 16A.48 for the remaining portion of 97 percent of the refund, and shall pay over the remaining portion upon receipt of a payment from the state issued pursuant to the claim.\n(d) When any mortgage covers real property located in more than one county in this state the total tax must be paid to the treasurer of the county where the mortgage is first presented for recording, and the payment must be receipted as provided in paragraph (a). If the principal debt or obligation secured by such a multiple county mortgage exceeds $10,000,000, the nonstate portion of the tax must be remitted by the county treasurer receiving the tax to the commissioner of revenue with the state tax due under section 287.12. The commissioner shall determine the nonstate portion of the tax owed to each county in the ratio that the estimated market value of the real property covered by the mortgage in each county bears to the estimated market value of all the real property in this state described in the mortgage. The commissioner shall pay each county within 60 days of receiving the tax from the county that collected the tax. In making the division and payment the commissioner of revenue shall send a statement giving the description of the real property described in the mortgage and the estimated market value of the part located in each county. For this purpose, the commissioner of revenue may require the treasurer of any county to certify to the former the estimated market value of any tract of real property in any mortgage in the county.\n(e) The mortgagor must pay the tax imposed by sections 287.01 to 287.12. The mortgagee may undertake to collect and remit the tax on behalf of the mortgagor. If the mortgagee collects money from the mortgagor to remit the tax on behalf of the mortgagor, the mortgagee has a fiduciary duty to remit the tax on behalf of the mortgagor as to the amount of the tax collected for that purpose and the mortgagor is relieved of any further obligation to pay the tax as to the amount collected by the mortgagee for this purpose.",
	"repealed": false
}