{
	"id": "296A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.22",
	"title": "296A.22 NONPAYMENT OF TAX; CIVIL PENALTIES.",
	"text": "Upon the failure of any person to pay any tax or fee when due, a penalty of one percent per day for the first ten days of delinquency shall accrue, and thereafter the tax, fees, and penalty shall bear interest at the rate specified in section 270C.40 until paid.\nUpon such a failure to pay any tax or fees within the time provided by this chapter, all taxes and fees imposed by this chapter shall become immediately due and payable, and may be collected as provided in chapter 270C.\nIf any person operates as a distributor, special fuel dealer, bulk purchaser, or motor carrier without first securing the license required under this chapter, any tax or fee imposed by this chapter shall become immediately due and payable. A penalty of 25 percent is imposed upon the tax and fee due. The tax and fees shall bear interest at the rate specified in section 270C.40. The penalty imposed in this subdivision shall bear interest from the date provided in section 270C.40, subdivision 3, to the date of payment of the penalty.\n(a) If any dyed fuel is sold or held for sale by a person for any use which the person knows or has reason to know is not a nontaxable use of the fuel; or if any dyed fuel is held for use or used in a licensed motor vehicle or for any other use by a person for a use other than a nontaxable use and the person knew, or had reason to know, that the fuel was so dyed; or if a person willfully alters, or attempts to alter, the strength or composition of any dye or marking in any dyed fuel, then the person shall pay a penalty in addition to the tax, if any.\n(b) Except as provided in paragraph (c), the amount of penalty under paragraph (a) for each act is the greater of $1,000, or $10 for each gallon of dyed fuel involved.\n(c) With regard to a multiple violation under paragraph (a), the penalty shall be applied by increasing the amount in paragraph (b) by the product of (1) such amount, and (2) the number of prior penalties, if any, imposed by this section on the person, or a related person, or any predecessor of the person or related person.\n(d) If a penalty is imposed under this subdivision on a business entity, each officer, employee, or agent of the entity who willfully participated in any act giving rise to the penalty is jointly and severally liable with the entity for the penalty.\nIn the event a suit is instituted as provided in subdivision 2, the court shall, upon application, appoint a receiver of the property and business of the delinquent defendant for the purpose of impounding the same as security for any judgment which has been or may be recovered.\nNo petroleum product shall be unloaded or sold by any person or distributor whose tax and fees are the basis for collection action under subdivision 2.\nThe penalties imposed by this section are collected and paid in the same manner as taxes.\nThe civil penalties imposed by this section are in addition to the criminal penalties imposed by this chapter.\n(a) The commissioner may by written order abate any penalty imposed under this section, if in the commissioner's opinion there is reasonable cause to do so.\n(b) A request for abatement of penalty must be filed with the commissioner within 60 days of the notice date of the penalty. For purposes of this section, \"notice date\" means the notice date designated by the commissioner on the order or other notice that a penalty has been imposed.\n(c) If the commissioner issues an order denying a request for abatement of penalty, the taxpayer may file an administrative appeal as provided in section 270C.35 or appeal to Tax Court as provided in section 271.06. If the commissioner does not issue an order on the abatement request within 60 days from the date the request is received, the taxpayer may appeal to Tax Court as provided in section 271.06.",
	"repealed": false
}