{
	"id": "289A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.31",
	"title": "289A.31 LIABILITY FOR PAYMENT OF TAX.",
	"text": "(a) Individual income, fiduciary income, mining company, and corporate franchise taxes, and interest and penalties, must be paid by the taxpayer upon whom the tax is imposed, except in the following cases:\n(1) the tax due from a decedent for that part of the taxable year in which the decedent died during which the decedent was alive and the taxes, interest, and penalty due for the prior years must be paid by the decedent's personal representative, if any. If there is no personal representative, the taxes, interest, and penalty must be paid by the transferees, as defined in section 270C.58, subdivision 3, to the extent they receive property from the decedent;\n(2) the tax due from an infant or other incompetent person must be paid by the person's guardian or other person authorized or permitted by law to act for the person;\n(3) the tax due from the estate of a decedent must be paid by the estate's personal representative;\n(4) the tax due from a trust, including those within the definition of a corporation, as defined in section 290.01, subdivision 4, must be paid by a trustee; and\n(5) the tax due from a taxpayer whose business or property is in charge of a receiver, trustee in bankruptcy, assignee, or other conservator, must be paid by the person in charge of the business or property so far as the tax is due to the income from the business or property.\n(b) Entertainment taxes are the joint and several liability of the entertainer and the entertainment entity. The payor is liable to the state for the payment of the tax required to be deducted and withheld under section 290.9201, subdivision 7, and is not liable to the entertainer for the amount of the payment.\n(c) The taxes imposed under sections 289A.35, paragraph (b), 289A.382, subdivision 3, and 290.0922 on partnerships are the joint and several liability of the partnership and the general partners.\n(a) If a joint income tax return is made by spouses, the liability for the tax is joint and several. A spouse who qualifies for relief from a liability attributable to an underpayment under section 6015 subsection (b) of the Internal Revenue Code, or determined by the commissioner of internal revenue for relief under section 6015 subsection (f) of the Internal Revenue Code, is relieved of the state income tax liability on the underpayment.\n(b) In the case of individuals who were married as determined in section 7703 of the Internal Revenue Code prior to the dissolution of their marriage or their legal separation, or prior to the death of one of the individuals, for tax liabilities reported on a joint or combined return, the liability of each person is limited to the proportion of the tax due on the return that equals that person's proportion of the total tax due if each spouse filed separate returns for the taxable year. This provision is effective only when the commissioner receives written notice of the marriage dissolution, legal separation, or death of a spouse from the surviving spouse. No refund may be claimed by an ex-spouse, legally separated or widowed spouse for any taxes paid more than 60 days before receipt by the commissioner of the written notice.\n(c) The commissioner is not required to calculate separate liability pursuant to paragraph (b) if the remaining unpaid liability for which recalculation is requested is $100 or less.\n[Repealed, 2005 c 151 art 1 s 117]\n[Repealed, 2005 c 151 art 1 s 117]\n(a) Except as provided in paragraph (b), an employer or person withholding tax under section 290.92 or 290.923, subdivision 2, who fails to pay to or deposit with the commissioner a sum or sums required by those sections to be deducted, withheld, and paid, is personally and individually liable to the state for the sum or sums, and added penalties and interest, and is not liable to another person for that payment or payments. The sum or sums deducted and withheld under section 290.92, subdivision 2a or 3, or 290.923, subdivision 2, must be held as a special fund in trust for the state of Minnesota.\n(b) If the employer or person withholding tax under section 290.92 or 290.923, subdivision 2, fails to deduct and withhold the tax in violation of those sections, and later the taxes against which the tax may be credited are paid, the tax required to be deducted and withheld will not be collected from the employer. This does not, however, relieve the employer from liability for any penalties and interest otherwise applicable for failure to deduct and withhold. This paragraph does not apply to an employer subject to paragraph (g).\n(c) Liability for payment of withholding taxes includes a responsible person or entity described in the personal liability provisions of section 270C.56.\n(d) Liability for payment of withholding taxes includes a third-party lender or surety described in section 270C.59.\n(e) A partnership or S corporation required to withhold and remit tax under section 290.92, subdivisions 4b and 4c, is liable for payment of the tax to the commissioner, and a person having control of or responsibility for the withholding of the tax or the filing of returns due in connection with the tax is personally liable for the tax due.\n(f) A payor of sums required to be withheld under section 290.9705, subdivision 1, is liable to the state for the amount required to be deducted, and is not liable to an out-of-state contractor for the amount of the payment.\n(g) If an employer fails to withhold tax from the wages of an employee when required to do so under section 290.92, subdivision 2a, by reason of treating such employee as not being an employee, then the liability for tax is equal to three percent of the wages paid to the employee. The liability for tax of an employee is not affected by the assessment or collection of tax under this paragraph. The employer is not entitled to recover from the employee any tax determined under this paragraph.\n[Repealed, 2005 c 151 art 1 s 117]\n(a) The sales and use tax required to be collected by the retailer under chapter 297A constitutes a debt owed by the retailer to Minnesota, and the sums collected must be held as a special fund in trust for the state of Minnesota.\nA retailer who does not maintain a place of business within this state as defined by section 297A.66, subdivision 1, shall not be indebted to Minnesota for amounts of tax that it was required to collect but did not collect unless the retailer knew or had been advised by the commissioner of its obligation to collect the tax.\n(b) The use tax required to be paid by a purchaser is a debt owed by the purchaser to Minnesota.\n(c) The tax imposed by chapter 297A, and interest and penalties, is a personal debt of the individual required to file a return from the time the liability arises, irrespective of when the time for payment of that liability occurs. The debt is, in the case of the executor or administrator of the estate of a decedent and in the case of a fiduciary, that of the individual in an official or fiduciary capacity unless the individual has voluntarily distributed the assets held in that capacity without reserving sufficient assets to pay the tax, interest, and penalties, in which case the individual is personally liable for the deficiency.\n(d) Liability for payment of sales and use taxes includes any responsible person or entity described in the personal liability provisions of section 270C.56.\n(e) Any amounts collected, even if erroneously or illegally collected, from a purchaser under a representation that they are taxes imposed under chapter 297A are state funds from the time of collection and must be reported on a return filed with the commissioner.\nIf an individual income tax refund resulting from claiming an education credit under section 290.0674 is paid by means of directly depositing the proceeds of the refund into a bank account controlled by the vendor of the product or service upon which the education credit is based, and the commissioner subsequently disallows the credit, the commissioner may seek repayment of the refund from the vendor. The amount of the repayment must be assessed and collected in the same time and manner as an erroneous refund under section 289A.37, subdivision 2.",
	"repealed": false
}