{
	"id": "383B.914",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.914",
	"title": "383B.914 STATUS OF PRESENT EMPLOYEES; BARGAINING UNITS; RETIREMENT COVERAGE.",
	"text": "Persons employed at the corporation created shall be subject to a human resources system that is designed to offer appropriate benefits to workers employed in a health care setting. This human resources system shall replace the general county human resources system prescribed in sections 383B.26 to 383B.42, and any rules related to it. The corporation shall have the authority to establish all personnel policies and practices, negotiate applicable labor agreements, and set all levels of compensation and benefits which are considered appropriate by the board except as limited in this section. The human resources system is subject to the following human resources requirements:\n(1) determine compensation according to the pay equity requirements under sections 471.991 to 471.999;\n(2) provide preferences for veterans according to the Veterans Preference Act under sections 197.455, 197.46, and 375.63; and\n(3) provide an appeals process for an individual who is discharged, demoted, or suspended.\nAll persons employed by the county whose employment is accounted for in the county enterprise fund for HCMC, on the effective date, shall be transferred to the corporation as specified in the lease and other transactional documents referenced in section 383B.913. The transfer of employees to the corporation under this subdivision does not constitute severance or termination of employment or a layoff entitling transferred employees to severance pay, termination benefits, a retirement plan refund, or any other right that may be applicable in the case of severance, termination, or layoff.\nEach person employed by the county who is transferred to the corporation on the effective date shall retain employment and accrued benefits, including participation in deferred compensation programs, and will be recorded by most recent date of employment with Hennepin County upon transfer to the corporation created in section 383B.901.\nThe corporation shall recognize existing bargaining units organized by employees of HCMC and the exclusive representatives of those bargaining units as of the effective date. The corporation shall adopt all current labor agreements as of the effective date for the term of those agreements, except for countywide references, countywide provisions, and countywide human resources rules.\n(a) Except as provided in paragraph (b), employees of the corporation, other than paramedics, emergency medical technicians and the supervisors and managers of such employees, and protection officers and supervisors of such employees, are \"public employees\" under chapter 353 and are members of the general employees retirement plan of the Public Employees Retirement Association, including employees transferred to the corporation under subdivision 2 and employees hired by the corporation after the effective date.\n(b) Notwithstanding sections 356.24 and 356.25, the corporation has the authority to create alternative retirement plans that are not defined benefit pension plans for the following classes of employees: supervisors, managers, physicians, and independent health practitioners who bill independently for their time, provided the value of the aggregate benefits are substantially comparable to the general employee retirement plan of the Public Employees Retirement Association. These classes of employees are eligible to participate in the general retirement plan of the Public Employees Retirement Association until and unless the corporation creates alternative retirement plans. Only those employees who are within the designated class and who are hired after the date of creation of the alternative plan may be enrolled in the alternative retirement plan in lieu of participation in the general employees retirement plan of the Public Employees Retirement Association. Any alternative retirement benefit plan established by the corporation must comply with the financial reporting requirements for public pension plans under section 356.20 and the investment performance reporting requirements for public pension plans under section 356.219.\nNotwithstanding subdivision 5, both existing and future employees of the corporation in the positions of paramedic and emergency medical technician, including supervisors and managers of such employees, as provided in section 353.64, subdivision 10, are members of the public employees police and fire retirement plan under sections 353.63 to 353.68 and in the position of protection officer, including supervisors of such employees, as provided in section 353E.02, subdivision 2a, are members of the local government correctional retirement plan under chapter 353E.\n(a) Existing employees of the corporation, at the election of the corporation, if otherwise qualified, are eligible to participate in the Hennepin County supplemental retirement plan under sections 383B.46 and 383B.52.\n(b) Existing and future employees of the corporation, at the election of the corporation, are eligible to participate in the Minnesota state deferred compensation plan under section 352.965, the postretirement health care savings plan under section 352.98, and all other deferred compensation arrangements for which all persons employed by the county whose employment is accounted for in the county enterprise fund for HCMC were eligible.\nAny subsidiary created by the corporation shall be subject to the same human resources requirements as those that apply to the corporation under subdivision 1.",
	"repealed": false
}