{
	"id": "144E.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.103",
	"title": "144E.103 EQUIPMENT.",
	"text": "Every ambulance in service for patient care shall carry, at a minimum:\n(1) oxygen;\n(2) airway maintenance equipment in various sizes to accommodate all age groups;\n(3) splinting equipment in various sizes to accommodate all age groups;\n(4) dressings, bandages, commercially manufactured tourniquets, and bandaging equipment;\n(5) an emergency obstetric kit;\n(6) equipment to determine vital signs in various sizes to accommodate all age groups;\n(7) a stretcher;\n(8) a defibrillator;\n(9) a fire extinguisher; and\n(10) opiate antagonists.\nIn addition to the requirements in subdivision 1, an ambulance used in providing advanced life support must carry drugs and drug administration equipment and supplies as approved by the licensee's medical director.\nEquipment carried on every ambulance in service for patient care must be maintained in full operating condition. Patient care equipment, supplies, and drugs must be stored and maintained within manufacturer's recommendations and:\n(1) all equipment and supplies must be maintained in full operating condition and in good repair;\n(2) all equipment, supplies, and containers used for storage of equipment or supplies must be kept clean so as to be free from dirt, grease, and other offensive matter;\n(3) sheets and pillowcases must be changed after each use;\n(4) single-service equipment and supplies must be wrapped, stored, and handled so as to prevent contamination and must be disposed of after use;\n(5) reusable equipment and supplies must be cleaned after each use so as to be free from dirt, grease, and other offensive matter;\n(6) equipment and supplies, soiled or otherwise not free from dirt, grease, and other offensive matter, must be kept in plastic bags or securely covered containers until disposed of or prepared for reuse; and\n(7) procedures for the periodic performance testing of mechanical equipment must be developed, maintained, and followed, and records of performance testing must be kept in the licensee's files. Testing must occur within the manufacturer's recommendations.\nAll equipment carried in an ambulance must be securely stored.\nAn ambulance must be equipped with safety straps, including shoulder harnesses, for the stretcher and seat belts in the patient compartment for the patient and ambulance personnel.\nAn ambulance must be equipped with a two-way radio that is programmed and operating according to the most recent version of the statewide radio board shared radio and communication plan or its equivalent as determined by the director.",
	"repealed": false
}