{
	"id": "515A.4-110",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.4-110",
	"title": "515A.4-110 CONVERSION CONDOMINIUMS.",
	"text": "(a) A declarant of a conversion condominium shall give each of the tenants and any subtenant in possession of buildings subject to sections 515A.1-101 to 515A.4-117 notice of the conversion or the intent to convert no later than 120 days before the declarant will require them to vacate. The notice shall set forth generally the rights conferred by this section and shall have attached thereto a form of purchase agreement setting forth the terms of sale contemplated by subsection (b) and a statement of any significant restrictions on the use and occupancy of the unit to be imposed by the declarant and shall be hand delivered or mailed by postage prepaid United States mail to the tenant and subtenant at the address of the unit. The notice shall further state that the tenants or subtenants in possession of a residential unit may demand to be given 60 additional days before being required to vacate, if any of them, or any person residing with them, is 62 years of age or older, disabled as defined in section 268A.01, or a minor child on the date the notice is given. This demand must be in writing, contain reasonable proof of qualification, and be given to the declarant within 30 days after the notice of condominium conversion is delivered or mailed. The notice shall be contained in an envelope upon which the following words shall be boldly printed: \"Notice of Condominium Conversion.\" No tenant or subtenant may be required by the declarant to vacate upon less than 120 days' notice, except by reason of nonpayment of rent, waste, or conduct which disturbs other tenants' peaceful enjoyment of the premises, and the terms of the tenancy may not be altered during that period, except that a tenant or subtenant in possession of a residential unit may vacate upon 30 days' written notice to the declarant. Nothing in this section prevents the declarant and the tenant or subtenant in possession of the unit from agreeing to an extension of the tenancy on a month to month basis beyond the 120-day notice period. No repair work or remodeling may be commenced or undertaken in the occupied units or common areas of the building during the notice period, unless reasonable precautions are taken to ensure the safety and security of the tenants or subtenants in possession of the premises. Failure of a declarant to give notice as required by this section constitutes a defense to an action for possession.\n(b) For 60 days after delivery or mailing of the notice described in subsection (a), the holder of the lessee's interest for each unit on the date the notice is delivered or mailed shall have an option to purchase that unit on the terms set forth in the purchase agreement attached to the notice. The purchase agreement shall contain no terms or conditions preventing the purchase of the unit by the holder because of the age of the holder or of persons residing with the holder. If the holder fails to exercise the option during that 60-day period, the declarant may not offer to dispose of an interest in that unit during the following 180 days at a price or on terms more favorable to the offeree than the price or terms offered to the holder. This subsection does not apply to any unit in a conversion condominium if that unit will be restricted exclusively to nonresidential use or if the boundaries of the converted unit do not substantially conform to the dimensions of the residential unit before conversion.\n(c) If a declarant, in violation of subsection (b), conveys a unit to a purchaser for value who has no knowledge of the violation, delivery of the deed conveying the unit extinguishes any right which a holder of a lessee's interest not in possession may have under subsection (b) to purchase that unit, but does not affect the right of the holder to recover damages from the declarant for a violation of subsection (b).\n(d) Nothing in this section permits termination of a lease by a declarant in violation of its terms.",
	"repealed": false
}