{
	"id": "326B.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.36",
	"title": "326B.36 INSPECTION.",
	"text": "Except where any political subdivision has by ordinance provided for electrical inspection similar to that herein provided, every new electrical installation in any construction, remodeling, replacement, or repair, except minor repair work as the same is defined by rule, shall be inspected by the commissioner for compliance with accepted standards of construction for safety to life and property.\n(a) The installation of the technology circuits or systems described in paragraph (b), except:\n(1) minor work performed by a contractor;\n(2) work performed by a heating, ventilating, or air conditioning contractor as described in section 326B.38; and\n(3) work performed by cable company employees when installing cable communications systems or telephone company employees when installing telephone systems,\nmust be inspected as provided in this section for compliance with the applicable provisions of the National Electrical Code and the applicable provisions of the National Electrical Safety Code, as those codes were approved by the American National Standards Institute.\n(b) The inspection requirements in paragraph (a) apply to:\n(1) class 2 or class 3 remote control circuits that control circuits or systems other than class 2 or class 3, except circuits that interconnect these systems exempted by section 326B.33, subdivision 21, paragraph (b), other than fire alarm; class 2 or class 3 circuits in electrical cabinets, enclosures, or devices containing physically unprotected circuits other than class 2 or class 3; or technology circuits and systems in hazardous classified locations as covered by the National Electrical Code;\n(2) fire alarm systems, other than in one- or two-family dwellings, as defined in the National Electrical Code;\n(3) technology circuits and systems contained within critical care areas of health care facilities as defined by the safety standards identified in section 326B.35, including, but not limited to, anesthesia and resuscitative alarm and alerting systems, medical monitoring, and nurse call systems; and\n(4) physical security systems within detention facilities.\n(c) For the purposes of this subdivision \"minor work\" means the adjustment or repair and replacement of worn or defective parts of a technology circuit or system. Minor work may be inspected under this section at the request of the owner of the property or the person doing the work.\n(d) Notwithstanding this subdivision, if an electrical inspector observes that a contractor, employer, or owner has not complied with accepted standards when the work was performed, as provided in the most recent editions of the National Electrical Code and the National Electrical Safety Code as approved by the American National Standards Institute, the inspector may order the contractor, employer, or owner who has performed the work to file an electrical permit, pay an inspection fee, and make any necessary repairs to comply with applicable standards and require that the work be inspected.\nAll inspectors shall hold licenses as master or journeyworker electricians under this chapter. All inspectors under contract with the department to provide electrical inspection services shall give bond in the amount of $1,000, conditioned upon the faithful performance of their duties.\n(a) At or before commencement of any installation required to be inspected by the commissioner, the contractor, installer, special electrician, or owner making the installation shall submit to the commissioner a request for inspection, in a form prescribed by the commissioner, together with the fees required for the installation.\n(b) The fees required are a handling fee and an inspection fee. The handling fee shall be set by the commissioner in an amount sufficient to pay the cost of printing and handling the form requesting an inspection. The inspection fee shall be set by the commissioner in an amount sufficient to pay the actual costs of the inspection and the commissioner's costs in administering the inspection. All fees shall be set pursuant to the procedure of sections 14.001 to 14.69.\n(c) If the inspector finds that the installation is not in compliance with accepted standards of construction for safety to life and property as required by section 326B.35, the inspector shall by written order condemn the installation or noncomplying portion thereof, or order service to the installation disconnected, and shall send a copy of the order to the commissioner. If the installation or the noncomplying part will seriously and proximately endanger human life and property, the order of the inspector, when approved by the inspector's superior, shall require immediate condemnation or disconnection. In all other cases, the order of the inspector shall permit a reasonable opportunity for the installation to be brought into compliance with accepted standards of construction for safety to life and property prior to the effective time established for condemnation or disconnection.\n(d) Copies of each condemnation or disconnection order shall be served personally or by mail upon the property owner, and the contractor, installer, or special electrician making the installation, and other persons as the commissioner by rule may direct. An aggrieved party may appeal any condemnation or disconnection order by filing with the commissioner a notice of appeal within ten days after (1) service upon the aggrieved party of the condemnation or disconnection order, if this service is required, or (2) filing of the order with the commissioner, whichever is later. The appeal shall proceed and the order of the inspector shall have the effect the order, by its terms, and the rules of the commissioner provides. The commissioner shall adopt rules providing procedures for the conduct of appeals, including provisions for the stay of enforcement of the order of the inspector pending such appeal when justified by the circumstances.\nNo electrical installation subject to inspection by the commissioner shall be newly connected or reconnected for use until there is filed with the electrical utility supplying power a certificate of the property owner or licensed electrician, directing the work that inspection has been requested and that the conditions of the installation are safe for energization, provided further, that in all cases where an order of condemnation or disconnection has been issued against the installation or any part thereof, prior to connection or reconnection there shall also first be filed with the electrical utility supplying the power a copy of an order of the inspector or the commissioner dismissing such prior order of condemnation or disconnection or approving the installation as being in compliance with accepted standards of construction for safety to life and property. With respect to transient projects, the aforesaid certificate shall also contain a certification that the request for inspection has been or will be filed with the commissioner so as to be received by it at least five days prior to the date and time energization of the installation by the utility is to occur, and that the request for inspection states such date and time, and it shall be the responsibility of the commissioner to have inspection of such transient project occur prior to the date and time at which the request states energization is to occur.\nAny political subdivision or the University of Minnesota may make provision for inspection of electrical installations within its jurisdiction, in which case it shall keep on file with the commissioner copies of its current inspection ordinances and codes. No political subdivision or the University of Minnesota shall require any individual, partnership, corporation or other business association holding a license from the commissioner under sections 326B.31 to 326B.399 to pay any license or registration fee, provided however, that any such political subdivision or the University of Minnesota may provide by ordinance a requirement that each individual, partnership, corporation or other business association doing electrical work within the jurisdiction of such political subdivision or the University of Minnesota have on file with said political subdivision a copy of the current license issued by the commissioner or such other evidence of such license as may be provided by the commissioner.\nEach electrical inspector of any political subdivision or the University of Minnesota shall be a licensed master or journeyworker electrician under section 326B.33, subdivision 1, paragraph (1), or 2, paragraph (b), and shall not otherwise engage or be employed in the sale, installing, altering, or repairing of electrical wiring, apparatus, or equipment for light, heat, power, and other purposes and shall have no financial interest in any concern engaged in any such business.\nInstallations, materials, or equipment shall not be subject to inspection under sections 326B.31 to 326B.399:\n(1) when owned or leased, operated and maintained by any employer whose maintenance electricians are exempt from licensing under sections 326B.31 to 326B.399, while performing electrical maintenance work only as defined by rule;\n(2) when owned or leased, and operated and maintained by any electrical, communications, or railway utility, cable communications company as defined in section 238.02, or telephone company as defined under section 237.01, in the exercise of its utility, antenna, or telephone function; and\n(i) are used exclusively for the generations, transformation, distribution, transmission, load control, or metering of electric current, or the operation of railway signals, or the transmission of intelligence, and do not have as a principal function the consumption or use of electric current by or for the benefit of any person other than such utility, cable communications company, or telephone company; and\n(ii) are generally accessible only to employees of such utility, cable communications company, or telephone company or persons acting under its control or direction; and\n(iii) are not on the load side of the service point or point of entrance for communication systems;\n(3) when used in the street lighting operations of an electrical utility;\n(4) when used as outdoor area lights which are owned and operated by an electrical utility and which are connected directly to its distribution system and located upon the utility's distribution poles, and which are generally accessible only to employees of such utility or persons acting under its control or direction;\n(5) when the installation, material, and equipment are in facilities subject to the jurisdiction of the federal Mine Safety and Health Act; or\n(6) when the installation, material, and equipment is part of an elevator installation for which the elevator contractor, licensed under section 326B.164, is required to obtain a permit from the authority having jurisdiction as provided by section 326B.184, and the inspection has been or will be performed by an elevator inspector certified and licensed by the department. This exemption shall apply only to installations, material, and equipment permitted or required to be connected on the load side of the disconnecting means required for elevator equipment under the National Electrical Code, and elevator communications and alarm systems within the machine room, car, hoistway, or elevator lobby.\nFor exemptions to inspections exclusively for load control allowed for electrical utilities under subdivision 7, clause (2), item (i), the exempted work must be:\n(1) performed by a licensed electrician employed by a class A electrical contractor licensed under section 326B.33;\n(2) for replacement or repair of existing equipment for an electric utility other than a public utility as defined in section 216B.02, subdivision 4, only; and\n(3) completed on or before December 31, 2028.",
	"repealed": false
}