{
	"id": "474A.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/474A.045",
	"title": "474A.045 SCORING; ENTERPRISE ZONE FACILITY, MANUFACTURING PROJECT.",
	"text": "The following criteria must be used in determining the allocation of enterprise zone facility bonds and small issue bonds for manufacturing projects. The issuer must prepare and submit to the commissioner a public purpose scoring worksheet that presents the data and methods used in determining the total score under this section. The total score is the sum of the following:\n(1) the number of direct new jobs in the state generated by the proposed project for the next two years per $100,000 of proposed allocation multiplied by 15;\n(2) the number of direct existing jobs in the state multiplied by .625 due to the proposed project for the next two years per $100,000 of proposed allocation multiplied by 15;\n(3) the average hourly wage paid to employees by the proposed project for the next two years, exclusive of benefits mandated by law, based on the following scale:\nFor purposes of this section, the seven-county metropolitan area includes Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington Counties;\n(4) the quotient of the estimated total net increase in property taxes generated in the state by the project in the first full year of operation divided by the proposed bond allocation, multiplied by 500;\n(5) the seasonally unadjusted unemployment rate in the community where the proposed project is located measured as a percent of the state's unemployment rate, multiplied by ten.\nThe community seasonally unadjusted unemployment rate used in determining the points under clause (5) must be the most recent rate for the city or county in which the proposed project is located, as provided by the commissioner of employment and economic development;\n(6) 20 points for projects that locate in an incorporated area or a planned urban growth area as defined by section 462.352, subdivision 18;\n(7) 20 points for brownfield projects located in a state or federal Superfund site, a voluntary investigation and cleanup site, or a brownfield site, all as defined by the Minnesota Pollution Control Agency; and\n(8) 20 points for projects with favorable environmental citizenship as evidenced by no nonforgivable or combination administrative penalty orders, stipulation agreements, consent decrees, or other enforcement orders containing a monetary penalty by the Minnesota Pollution Control Agency over the past three years or pending at the time of application.",
	"repealed": false
}