{
	"id": "375A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.10",
	"title": "375A.10 OPTIONS RELATING TO CERTAIN COUNTY OFFICES.",
	"text": "Notwithstanding the provisions of any other law to the contrary and in addition to the other options provided by sections 375A.01 to 375A.13, any county may adopt one or more of the options provided for in this section. Until the adoption of any one or more of the options herein enumerated, each county shall operate under the plan of county government relating to the county offices enumerated in this section which was in effect for that county on July 1, 1973.\nIn addition to the other options provided by sections 375A.01 to 375A.13, any county may institute one or more of the following options; except that a county which has adopted the auditor-administrator plan may not provide for the appointment of the auditor or the consolidation of the offices of auditor and treasurer while the auditor-administrator plan is in force:\n(a) provide for the appointment of one or more of the following offices if they have not been abolished by the adoption of other options: County auditor, county treasurer, sheriff, or county recorder;\n(b) provide for the office of county civil counsel;\n(c) consolidation of the offices of county auditor and treasurer.\nIn any county exercising the option provided in subdivision 2, clause (a), relating to the offices of county auditor, county treasurer, sheriff, or county recorder, the offices shall be filled by appointment by the board of county commissioners unless the office is hereafter abolished or terminated as provided by law or pursuant to a reorganization or consolidation. The duties, functions and responsibilities which have been heretofore and which shall be hereafter required by statute to be performed by the elected officials whose offices are to be made appointive shall be vested in and performed by the board of county commissioners of that county through department heads appointed by the board for that purpose. In effecting this option, the board of county commissioners shall have the authority to initiate and direct any reorganization, consolidation, reallocation or delegation of such duties, functions or responsibilities for the purpose of promoting efficiency in county government and make such other administrative changes including abolishing or terminating the offices or the transfer of personnel, as are deemed necessary for this purpose without diminishing, prohibiting, or avoiding those specific duties required by statute to be performed by those officials. The officer elected to the respective office at the time of the adoption of this option shall serve as the head of any department created by the board of county commissioners to perform the functions formerly performed by the office and shall serve until the term of office expires.\nIn any county exercising the option provided in subdivision 2, clause (b), the county board is authorized to establish the office of county civil counsel and may by resolution appoint an attorney at law to the office; provided that if a county adopts either the elected executive or the county manager plan, the county civil counsel shall be appointed and removed by the elected executive or county manager, subject to the approval of the county board. The county board shall determine the compensation for the county counsel. If a county counsel is appointed, the county attorney shall continue to exercise all duties relating to the prosecution of crimes as provided by law. The county counsel shall be the legal advisor to the county board and county officials involving any official act of a civil nature. The county counsel shall prosecute and defend all civil actions and proceedings in which the county or any officer is concerned in official capacity or is a party. County counsel shall perform such additional and related duties as may be prescribed by law and directed by the county board. The county counsel and the county attorney may apply for and shall receive opinions from the attorney general on matters of public importance as provided in section 8.07.\nIn any county exercising the option provided in subdivision 2, clause (c), the office shall be known thereafter as the office of auditor-treasurer, if the office is to remain elective. If the board chooses to make the office of auditor-treasurer elective, and not require a referendum, it must act with the concurrence of at least 80 percent of its members.\nIn the exercise of this option, the county board shall direct which of the offices of auditor or treasurer shall be terminated for the purpose of providing for the election to the single office of auditor-treasurer. The duties, functions and responsibilities which have been heretofore and which shall hereafter be required by statute to be performed by the county auditor and the county treasurer shall be vested in and performed by the auditor-treasurer without diminishing, prohibiting or avoiding those specific duties required by statute to be performed by the county auditor and the county treasurer.\nNothing in this subdivision shall preclude the county from exercising the option to make the combined office of auditor-treasurer appointive as if it had been specifically enumerated in subdivision 2. If the combined office is to be appointive, a referendum under section 375A.12 shall be necessary, except as provided by section 375A.1205.\nIf the combined office is to be elective, a referendum under section 375A.12 shall be necessary if:\n(a) the county board requires a referendum; or\n(b) a referendum is required by a petition of a number of voters equal to ten percent of those voting in the county at the last general election that is received by the county auditor within 30 days after the second publication of the board resolution that orders the combination.\nThe persons last elected to the positions of auditor and treasurer before adoption of the resolution shall serve in those offices and perform the duties of those offices until the completion of the terms to which they were elected.\nWhen any of the offices referred to in this section are combined or consolidated, the person filling the combined office shall take the oath of each office and shall give the bond required by the county board provided that if one of the offices combined is the office of county treasurer, the bond shall be in an amount not less than that required of a county treasurer in that county.",
	"repealed": false
}