{
	"id": "179A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.12",
	"title": "179A.12 EXCLUSIVE REPRESENTATION; ELECTIONS; DECERTIFICATION.",
	"text": "(a) Any employee organization holding formal recognition by order of the commissioner or by employer voluntary recognition on the effective date of Extra Session Laws 1971, chapter 33, under any law that is repealed by Extra Session Laws 1971, chapter 33, is certified as the exclusive representative until it is decertified or another representative is certified in its place.\n(b) Any teacher organization as defined by Minnesota Statutes 1969, section 125.20, subdivision 3, which on the effective date of Extra Session Laws 1971, chapter 33, has a majority of its members on a teacher's council in a school district as provided in Minnesota Statutes 1969, section 125.22 is certified as the exclusive representative of all teachers of that school district until the organization is decertified or another organization is certified in its place.\nAny employee organization may obtain a certification election upon petition to the commissioner stating that at least 30 percent of the employees of a proposed appropriate unit wish to be represented by the petitioner. Any employee organization may obtain a representation election upon petition to the commissioner stating that the currently certified representative no longer represents the majority of employees in an established unit and that at least 30 percent of the employees in the established unit wish to be represented by the petitioner rather than by the currently certified representative. An individual employee or group of employees in a unit may obtain a decertification election upon petition to the commissioner stating the certified representative no longer represents the majority of the employees in an established unit and that at least 30 percent of the employees wish to be unrepresented.\nMS 2022 [Repealed, 2023 c 53 art 11 s 59]\n(a) An employee organization may file a petition with the commissioner requesting certification as the exclusive representative of a proposed appropriate unit for which there is no currently certified exclusive representative. The petition must include over 50 percent of the employees in the proposed appropriate unit who wish to be represented by the organization.\n(b) If the commissioner determines that over 50 percent of the employees in the appropriate unit have provided authorization signatures designating the petitioning employee organization as their exclusive representative, the commissioner must certify the employee organization as the employees' exclusive representative without ordering an election under this section.\n[Renumbered 179A.12, subd 1a]\nThe commissioner shall not consider a petition for a decertification election during the term of a contract covering employees of the executive or judicial branches of the state of Minnesota except for a period from not more than 270 to not less than 210 days before its date of termination.\nUpon receiving a petition under subdivision 1a or 2a, the commissioner must:\n(1) investigate to determine if sufficient evidence of a question of representation exists; and\n(2) hold hearings necessary to determine the appropriate unit and other matters necessary to determine the representation rights of the affected employees and employer.\n(a) When determining the numerical status of an employee organization for purposes of this section, the commissioner must require a dated representation authorization signature of each affected employee as verification of the statements contained in the petition.\n(b) An authorization signature is privileged and confidential information available to the commissioner only. An electronic signature, as defined in section 325L.02, paragraph (h), is valid as an authorization signature.\n(c) An authorization signature is valid for one year following the signature date.\nThe commissioner shall issue an order providing for a secret ballot election by the employees in a designated appropriate unit. The election must be held on one or more sites where those voting are employed or by a mail ballot, as determined by the commissioner. In making this determination, the commissioner shall strive for an election process that provides for maximum participation by the affected employees. The parties affected by this determination may request reconsideration of it by the commissioner under bureau rules.\nThe ballot in a certification election may contain as many names of representative candidates as have demonstrated that 30 percent of the employees in the unit desire them as their exclusive representative. The ballots shall contain a space for employees to indicate that no representation is desired. The commissioner shall provide and count absentee ballots in all elections.\nIf no choice on the ballot receives a majority of those votes cast in the unit, the commissioner shall conduct a runoff election between the two choices receiving the most votes.\nUpon a representative candidate receiving a majority of those votes cast in an appropriate unit, the commissioner shall certify that candidate as the exclusive representative of all employees in the unit.\nThe commissioner may void the result of an election or majority verification procedure and order a new election or procedure if the commissioner finds one of the following:\n(1) there was an unfair labor practice that:\n(i) was committed by an employer, a representative candidate, an employee, or a group of employees; and\n(ii) affected the result of the election or the majority verification procedure; or\n(2) procedural or other irregularities in the conduct of the election or majority verification procedure may have substantially affected the results.\nWhen the commissioner certifies an exclusive representative, the commissioner shall not consider the question again for a period of one year, unless the exclusive representative is decertified by a court of competent jurisdiction, or by the commissioner.",
	"repealed": false
}