{
	"id": "352B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/352B.02",
	"title": "352B.02 STATE PATROL RETIREMENT FUND.",
	"text": "A State Patrol retirement fund is established. Its membership consists of all persons defined in section 352B.011, subdivision 10.\n(a) The member contribution is the following percentage of the member's salary:\n(b) These contributions must be made by deduction from salary as provided in section 352.04, subdivision 4.\n(c) Contribution increases under paragraph (a) must be paid starting the first day of the first full pay period after the effective date of the increase.\nMember contribution amounts must be deducted each pay period by the department head, who shall have the total amount of the deductions paid to the commissioner of management and budget for deposit in the State Patrol retirement fund, and have a detailed report of all deductions made each pay period to the executive director of the Minnesota State Retirement System.\n(a) In addition to member contributions, department heads shall pay a sum equal to the specified percentage of the salary upon which deductions were made, which constitutes the employer contribution to the fund as follows:\n(b) Department contributions must be paid out of money appropriated to departments for this purpose.\n(c) Contribution increases under paragraph (a) must be paid starting the first day of the first full pay period after the effective date of the increase.\n(d) Effective July 1, 2018, department heads shall pay a supplemental employer contribution. The supplemental contribution is 1.75 percent of the salary upon which deductions are made from July 1, 2018, through June 30, 2019; three percent of the salary upon which deductions are made from July 1, 2019, through June 30, 2020; five percent of the salary which deductions are made from July 1, 2020, through June 30, 2021; and seven percent of the salary upon which deductions are made thereafter. The supplemental contribution must be paid starting the first day of the first full pay period after June 30, 2018. The supplemental contribution rate of seven percent remains in effect until, for three consecutive years, the market value of the assets of the State Patrol retirement plan of the Minnesota State Retirement System equals or exceeds the actuarial accrued liability of the plan as determined by the actuary retained under section 356.214. The expiration of the supplemental employer contribution is effective the first day of the first full pay period of the fiscal year immediately following the issuance of the third actuarial valuation upon which the expiration is based.\nThe amounts provided for in this section must be credited to the State Patrol retirement fund. All money received must be deposited by the commissioner of management and budget in the State Patrol retirement fund. The fund must be used to pay the administrative expenses of the retirement fund, and the benefits and annuities provided in this chapter.\n(a) The legislative auditor shall audit the fund.\n(b) Any actuarial valuation of the fund required under section 356.215 must be prepared by the actuary retained under section 356.214.\n(c) Any approved actuary retained by the executive director under section 352.03, subdivision 6, may perform actuarial valuations and experience studies to supplement those performed by the actuary retained under section 356.214. Any supplemental actuarial valuation or experience studies must be filed with the executive director of the Legislative Commission on Pensions and Retirement.\n[Repealed, 1983 c 128 s 36]\nIf erroneous employee deductions and employer contributions are caused by an error in plan coverage involving the State Patrol retirement plan and any other plan specified in section 356.637, that section applies.",
	"repealed": false
}