{
	"id": "171.0701",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.0701",
	"title": "171.0701 DRIVER EDUCATION CONTENT.",
	"text": "(a) The commissioner shall adopt rules requiring a minimum of 30 minutes of instruction relating to organ and tissue donations and the provisions of section 171.07, subdivision 5, for persons enrolled in driver education programs offered at public schools, private schools, and commercial driver training schools.\n(b) The commissioner shall adopt rules for persons enrolled in driver education programs offered at public schools, private schools, and commercial driver training schools, requiring inclusion in the course of instruction a section on awareness and safe interaction with commercial motor vehicle traffic. The rules must require classroom instruction and behind-the-wheel training that includes, but is not limited to, truck stopping distances, proper distances for following trucks, identification of truck blind spots, and avoidance of driving in truck blind spots.\n(c) The commissioner shall adopt rules for persons enrolled in driver education programs offered at public schools, private schools, and commercial driver training schools, requiring inclusion in the course of instruction of a section on carbon monoxide poisoning. The instruction must include but is not limited to (1) a description of the characteristics of carbon monoxide, (2) a review of the risks and potential speed of death from carbon monoxide poisoning, and (3) specific suggestions regarding vehicle idling practices.\n(a) For purposes of this subdivision, \"driver education instructor\" means an instructor as defined under section 171.33, subdivision 2, or a person licensed by the Professional Educator Licensing and Standards Board for driver training as required under section 122A.26, subdivision 2.\n(b) The commissioner shall establish optional supplemental parental curriculum to provide instruction and information to primary driving supervisors in conjunction with persons enrolled in driver education programs at public schools, private schools, and commercial driver training schools. Each school must establish a schedule or procedure for providing the supplemental parental curriculum to any primary driving supervisor who chooses to receive it.\n(c) At a minimum, the supplemental parental curriculum must:\n(1) be at least 90 minutes in length;\n(2) be provided by or in the presence of a driver education instructor; and\n(3) provide information concerning graduated driver licensing, safety risks associated with novice drivers, potential influence of adults on driving behavior of novice drivers, and additional resources.\nThe commissioner must adopt rules for persons enrolled in driver education programs offered at public schools, private schools, and commercial driver training schools to require inclusion of a section on vulnerable road users in the course of instruction. The instruction must include information on:\n(1) the rights and responsibilities of vulnerable road users, as defined in section 169.011, subdivision 92b;\n(2) the specific duties of a driver when encountering a bicycle, other nonmotorized vehicles, or a pedestrian;\n(3) safety risks for vulnerable road users and motorcyclists or other operators of two- or three-wheeled vehicles; and\n(4) best practices to minimize dangers and avoid collisions with vulnerable road users and motorcyclists or other operators of two- or three-wheeled vehicles.\nThe rules adopted by the commissioner under this section are exempt from the rulemaking provisions of chapter 14. The rules are subject to section 14.386, except that notwithstanding paragraph (b) of section 14.386, the rules continue in effect until repealed or superseded by other law or rule.",
	"repealed": false
}