{
	"id": "103B.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.331",
	"title": "103B.331 AUTHORITY UNDER APPROVED LOCAL WATER MANAGEMENT PLANS.",
	"text": "When an approved local water management plan is adopted, the county has the authority specified in this section.\nThe county may regulate the use and development of water and related land resources within incorporated areas when one or more of the following conditions exists:\n(1) the municipality does not have a local water and related land resources plan or official controls consistent with the local water management plan;\n(2) a municipal action granting a variance or conditional use would result in an action inconsistent with the local water management plan;\n(3) the municipality has authorized the county to require permits for the use and development of water and related land resources; or\n(4) a state agency has delegated the administration of a state permit program to the county.\nA county may:\n(1) acquire in the name of the county, by condemnation under chapter 117, real and personal property found by the county board to be necessary for the implementation of an approved local water management plan;\n(2) assess the costs of projects necessary to implement the local water management plan undertaken under sections 103B.301 to 103B.355 upon the property benefited within the county in the manner provided for municipalities by chapter 429;\n(3) charge users for services provided by the county necessary to implement the local water management plan; and\n(4) establish one or more special taxing districts within the county and issue bonds for the purpose of financing capital improvements under sections 103B.301 to 103B.355.\n(a) A tax district authorized under subdivision 3, clause (4), must be established by resolution adopted by the county board after a hearing. Notice of the time, place, and purpose of the hearing must be published for two successive weeks in the official newspaper of the county, ending at least seven days before the day of the hearing. The resolution must describe with particularity the territory or area to be included in the tax district. After adoption, the resolution must be filed with the county auditor and county recorder. The district may be dissolved by following the procedures prescribed for the establishment of the district.\n(b) After adoption of the resolution under paragraph (a), a county may annually levy a tax on all taxable property in the district for the purposes for which the tax district was established. The proceeds of the tax must be paid into a fund reserved for these purposes. Any proceeds remaining in the reserve fund at the time the tax is terminated or the district is dissolved must be transferred and irrevocably pledged to the debt service fund of the county to be used only to reduce tax levies for bonded indebtedness of taxable property in the district.\n(c) After adoption of the resolution under paragraph (a), and after a contract for the construction of all or part of an improvement has been entered into or the work has been ordered to be done by hired labor, the county may issue obligations in the amount determined by the county board to be necessary to pay in whole or in part the capital cost incurred and estimated to be incurred in making the improvement. The obligations are payable out of the proceeds of the tax levied under this subdivision. The county board may, by resolution adopted prior to the sale of obligations, pledge the full faith, credit, and taxing power of the county to assure payment of the principal and interest in the event the proceeds of the tax levy in the district are insufficient to pay principal and interest. The amount of any taxes that are required to be levied outside of the territory of the tax district or taken from the general funds of the county to pay principal and interest on the obligations must be reimbursed to the county from taxes levied within the territory of the tax district. Obligations must be issued in accordance with chapter 475, except that an election is not required and the amount of any obligations must not be included in determining the net indebtedness of the county under the provisions of any law or charter limiting indebtedness.",
	"repealed": false
}