{
	"id": "79.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.52",
	"title": "79.52 DEFINITIONS.",
	"text": "The following words or phrases shall have the meanings ascribed to them for the purposes of this chapter, unless the context clearly indicates that a different meaning is intended.\n\"Market\" means any reasonable grouping or classification of employers.\n\"Data service organization\" means any entity which has ten or more members or is controlled directly or indirectly by ten or more insurers and is engaged in collecting data for use in insurance ratemaking or other activities permitted by this chapter. Affiliated members or insurers shall be counted as a single unit for the purpose of this definition. The Workers' Compensation Insurers Rating Association of Minnesota shall be considered a data service organization.\n\"Classification plan\" or \"classification\" means the plan, system, or arrangement for rating insurance policyholders.\n\"Rates\" means the cost of insurance per exposure base unit.\n\"Base premium\" means the amount of premium which an employer would pay for insurance derived by applying rates to an exposure base prior to the application of any merit rating or discount factors.\n\"Premium\" means the price charged to an insured for insurance for a specified period of time, regardless of the timing of actual payments.\n\"Discount factor\" means any factor which is applied to the base premium and which is based upon insurer expenses or other factors not related to the risk of loss.\n\"Merit rating\" means a system or form of rating by which base premium is modified on the basis of loss experience or other factors which are reasonably related to loss or risk of loss and which may be reasonably affected by the action or activities of the insured. The sensitivity of a merit rating system to loss experience may vary by the size of risk. Merit rating shall include both prospective and retrospective methods for modifying base premium.\n\"Loss development factors\" means factors applied to recorded incurred losses to estimate the amount of ultimate loss payments that will have been made for losses during the applicable period when all claims are paid.\n\"Trend\" or \"trending\" means any procedure employing data for the purpose of projecting or forecasting the future value of that data or other data, or the factors resulting from such a procedure.\n\"Interested party\" means any person, or association acting on behalf of its members, directly affected by a change in the schedule of rates and includes the staff of the Department of Commerce.\n\"Insurer\" means any insurer licensed to transact the business of workers' compensation insurance in this state.\n\"Insurance\" means workers' compensation insurance.\n\"Rating plan\" means every manual, and every other rule including discount factors and merit rating necessary for the calculation of an insured's premium from an insurer's rates. An insurer may choose to adopt for use the rating plan of the data service organization in which it maintains membership.\nNo loss adjustment expense used to pay attorney fees or other costs in defense of a workers' compensation claim shall be charged to an insured in a merit rating plan or to a plan under section 79.251, subdivision 2.\n\"Association\" or \"rating association\" means the Minnesota Workers' Compensation Insurers Association, Inc.\n\"Rate Oversight Commission\" means the Workers' Compensation Advisory Council established in chapter 175.",
	"repealed": false
}