{
	"id": "144G.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.191",
	"title": "144G.191 ASSISTED LIVING FACILITY LICENSING IMPLEMENTATION; TRANSITION PERIOD FOR CURRENT PROVIDERS.",
	"text": "(a) Beginning June 1, 2021, no initial housing with services establishment registration applications shall be accepted under chapter 144D.\n(b) Beginning June 1, 2021, no temporary comprehensive home care provider license applications shall be accepted for providers that do not intend to provide home care services under sections 144A.43 to 144A.484 on or after August 1, 2021.\n(a) All prospective assisted living facility license applicants seeking a license and having new construction who have submitted a complete building permit application to the appropriate building code jurisdiction on or before July 31, 2021, may meet construction requirements in effect when the building permit application was submitted.\n(b) All prospective assisted living facility license applicants seeking a license for new construction who submit a complete building permit application to the appropriate building code jurisdiction on or after August 1, 2021, must meet the requirements of section 144G.45.\n(c) For the purposes of paragraph (a), in areas of jurisdiction where there is no building code authority, a complete application for an electrical or plumbing permit is acceptable in lieu of the building permit application.\n(d) For the purposes of paragraph (a), in jurisdictions where building plan review applications are separated from building permit applications, a submitted complete application for plan review is acceptable in lieu of the building permit application.\n(a) Comprehensive home care providers that do not intend to provide home care services under chapter 144A on or after August 1, 2021, shall be issued a comprehensive home care license for a prorated license period upon renewal, effective for license renewals beginning on or after September 1, 2020. The prorated license period shall be effective from the provider's current comprehensive home care license renewal date through July 31, 2021.\n(b) Comprehensive home care providers with prorated license periods shall pay a prorated fee based on the number of months the comprehensive home care license is in effect.\n(c) A comprehensive home care provider using the prorated license period in paragraph (a), or who otherwise does not intend to provide home care services under chapter 144A on or after August 1, 2021, must notify the recipients of changes to their home care services in writing at least 60 days before the expiration of the provider's comprehensive home care license, or no later than May 31, 2021, whichever is earlier. The notice must:\n(1) state that the provider will no longer be providing home care services under chapter 144A;\n(2) include the date when the provider will no longer be providing these services;\n(3) include the name, email address, and phone number of the individual associated with the comprehensive home care provider that the recipient of home care services may contact to discuss the notice;\n(4) include the contact information consisting of the phone number, email address, mailing address, and website for the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities; and\n(5) for recipients of home care services who receive home and community-based waiver services under section 256B.49 and chapter 256S, also be provided to the resident's case manager at the same time that it is provided to the resident.\n(d) A comprehensive home care provider that obtains an assisted living facility license but does so under a different business name as a result of reincorporation, and continues to provide services to the recipient, is not subject to the 60-day notice required under paragraph (c). However, the provider must otherwise provide notice to the recipient as required under sections 144A.44, 144A.441, and 144A.442, as applicable, and section 144A.4791.\n(a) Housing with services establishments registered under chapter 144D, providing home care services according to chapter 144A to at least one resident, and intending to provide assisted living services on or after August 1, 2021, must submit an application for an assisted living facility license in accordance with section 144G.12 no later than June 1, 2021. The commissioner shall consider the application in accordance with section 144G.15.\n(b) Notwithstanding the housing with services contract requirements identified in section 144D.04, any existing housing with services establishment registered under chapter 144D that does not intend to convert its registration to an assisted living facility license under this chapter must provide written notice to its residents at least 60 days before the expiration of its registration, or no later than May 31, 2021, whichever is earlier. The notice must:\n(1) state that the housing with services establishment does not intend to convert to an assisted living facility;\n(2) include the date when the housing with services establishment will no longer provide housing with services;\n(3) include the name, email address, and phone number of the individual associated with the housing with services establishment that the recipient of home care services may contact to discuss the notice;\n(4) include the contact information consisting of the phone number, email address, mailing address, and website for the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities; and\n(5) for residents who receive home and community-based waiver services under section 256B.49 and chapter 256S, also be provided to the resident's case manager at the same time that it is provided to the resident.\n(c) A housing with services registrant that obtains an assisted living facility license, but does so under a different business name as a result of reincorporation, and continues to provide services to the recipient, is not subject to the 60-day notice required under paragraph (b). However, the provider must otherwise provide notice to the recipient as required under sections 144D.04 and 144D.045, as applicable, and section 144D.09.\n(d) All registered housing with services establishments providing assisted living under sections 144G.01 to 144G.07 prior to August 1, 2021, must have an assisted living facility license under this chapter.\n(e) Effective August 1, 2021, any housing with services establishment registered under chapter 144D that has not converted its registration to an assisted living facility license under this chapter is prohibited from providing assisted living services.\n(a) All assisted living facility licenses and assisted living facility with dementia care licenses with an initial effective date in August 2021, shall be valid through July 31, 2022. These licenses must be initially renewed on August 1, 2022.\n(b) Notices for renewal shall be issued by the department to all licensees by May 1, 2022. The notice shall include:\n(1) instructions for how to complete the renewal process, including completion of the renewal application and payment of the annual license fee in accordance with section 144G.17;\n(2) a new randomly assigned license renewal period that will apply for all future license renewals;\n(3) instructions for licensees to request a change to the randomly assigned renewal period based on financial hardship; and\n(4) instructions for licensees with more than one assisted living facility license to request that all license renewal dates occur in the same month or in different months throughout a 12-month period.\n(c) License fees for the first license renewal shall be prorated based on the randomly assigned license renewal period starting from August 1, 2022, as follows:\n(d) All prorated license fees shall be established by the commissioner based on the licensee's annual fee in the fees schedule in section 144.122, paragraph (d).\n(e) The amount of the annual fee shall be divided by 12 to establish the monthly equivalent of that fee, and that amount shall be multiplied by the number of months in the assigned prorated renewal period. This amount must be paid by the date in the renewal instructions to the licensee in order to renew the license.",
	"repealed": false
}