{
	"id": "169.829",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.829",
	"title": "169.829 WEIGHT LIMITS NOT APPLICABLE TO CERTAIN VEHICLES.",
	"text": "(a) The provisions of sections 169.823 to 169.828 do not apply to vehicles operated exclusively in any city in this state which has in effect an ordinance regulating the gross weight of vehicles operated within that city.\n(b) This subdivision does not apply to trunk highways.\nMS 2022 [Repealed, 2023 c 68 art 4 s 129]\nSections 169.823 to 169.828 do not apply to a utility vehicle that does not exceed a weight of 20,000 pounds per axle and is owned by:\n(1) a public utility, as defined in section 216B.02;\n(2) a municipality or municipal utility that operates that vehicle for its municipal electric, gas, or water system; and\n(3) a cooperative electric association organized under chapter 308A.\n(a) The provisions of sections 169.80 to 169.88 governing size, weight, and load do not apply to a fire apparatus, a law enforcement special response vehicle, or a licensed land emergency ambulance service vehicle.\n(b) Emergency vehicles designed to transport personnel and equipment to support the suppression of fires and to mitigate other hazardous situations are subject to the following weight limitations when operated on an interstate highway: (1) 24,000 pounds on a single steering axle; (2) 33,500 pounds on a single drive axle; (3) 52,000 pounds on a tandem rear drive steer axle; and (4) 62,000 pounds on a tandem axle. The gross weight of an emergency vehicle operating on an interstate highway must not exceed 86,000 pounds.\n(a) For the purposes of this subdivision, \"emergency pumping services\" means a sewage septic tank truck's response to:\n(1) uncontrolled and unintended seepage of the contents of a septic system into the ground, around a structure, or into a body of surface water;\n(2) damage or malfunction to a septic system that requires removal of the contents of the septic system for repair or maintenance; or\n(3) a condition that creates an immediate hazard to the health, welfare, or safety of a person.\n(b) When a sewage septic tank truck used exclusively to transport sewage from septic or holding tanks is performing emergency pumping services, sections 169.823 and 169.826 to 169.828 do not apply, and the weight limitations under section 169.824 are increased by ten percent when transporting sewage from a single point of service to the point of unloading.\n(c) Notwithstanding section 169.824, subdivision 1, paragraph (d); 169.826, subdivision 3; or any other law to the contrary, a permit is not required to operate a vehicle under this subdivision.\n(d) The seasonal weight increases under section 169.826, subdivision 1, do not apply to a vehicle operated under this subdivision.\n(e) A vehicle operated under this subdivision is subject to bridge load limits posted under section 169.84.\n(f) A vehicle operated under this subdivision must not be operated with a load that exceeds the tire manufacturer's recommended load, the manufacturer's gross vehicle weight rating as affixed to the vehicle, or other certification of gross vehicle weight rating under Code of Federal Regulations, title 49, sections 567.4 to 567.7.\n(g) The exceptions under this subdivision do not apply to a sewage septic tank truck's operation on an interstate highway.",
	"repealed": false
}