{
	"id": "343.235",
	"url": "https://www.revisor.mn.gov/statutes/cite/343.235",
	"title": "343.235 DISPOSITION OF SEIZED ANIMALS.",
	"text": "An animal taken into custody under section 343.12, 343.22, 343.29, or 343.31 may be humanely disposed of at the discretion of the jurisdiction having custody of the animal ten days after the animal is taken into custody, provided that the procedures in subdivision 3 are followed. An animal raised for food or fiber products may not be seized or disposed of without prior examination by a licensed veterinarian pursuant to a warrant issued by a judge.\nA person claiming an interest in an animal in custody under subdivision 1 may prevent disposition of the animal by posting security in an amount sufficient to provide for the animal's actual costs of care and keeping. The security must be posted within ten days of the seizure inclusive of the date of the seizure.\n(a) The authority taking custody of an animal under section 343.12, 343.22, 343.29, or 343.31 shall give notice of this section by delivering or mailing it to a person claiming an interest in the animal or by posting a copy of it at the place where the animal is taken into custody or by delivering it to a person residing on the property, and telephoning, if possible. The notice must include:\n(1) a description of the animal seized; the authority and purpose for the seizure; the time, place, and circumstances under which the animal was seized; and the location, address, telephone number, and contact person where the animal is kept;\n(2) a statement that a person claiming an interest in the animal may post security to prevent disposition of the animal and may request a hearing concerning the seizure or impoundment and that failure to do so within ten days of the date of the notice will result in disposition of the animal; and\n(3) a statement that all actual costs of the care, keeping, and disposal of the animal are the responsibility of the person claiming an interest in the animal, except to the extent that a court or hearing officer finds that the seizure or impoundment was not substantially justified by law.\nThe notice must also include a form that can be used by a person claiming an interest in the animal for requesting a hearing under this subdivision.\n(b) Upon request of a person claiming an interest in the animal, which request must be made within ten days of the date of seizure, a hearing must be held within five business days of the request, to determine the validity of the seizure and impoundment. If the seizure was done pursuant to a warrant under section 343.22, the hearing must be conducted by the judge who issued the warrant. If the seizure was done under section 343.12, 343.29, or 343.31, the municipality taking custody of the animal or, in the case of a humane society, the municipality from which the animal was seized, may either (1) authorize a licensed veterinarian with no financial interest in the matter or professional association with either party or (2) use the services of a hearing officer to conduct the hearing. A person claiming an interest in the animal who is aggrieved by a decision of a hearing officer under this subdivision may seek a court order governing the seizure or impoundment within five days of notice of the order.\n(c) The judge or hearing officer may authorize the return of the animal, if the judge or hearing officer finds that:\n(1) the animal is physically fit; and\n(2) the person claiming an interest in the animal can and will provide the care required by law for the animal.\n(d) The person claiming an interest in the animal is liable for all actual costs of care, keeping, and disposal of the animal, except to the extent that a court or hearing officer finds that the seizure or impoundment was not substantially justified by law. The costs must be paid in full or a mutually satisfactory arrangement for payment must be made between the municipality and the person claiming an interest in the animal before return of the animal to the person.",
	"repealed": false
}