{
	"id": "317A.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.161",
	"title": "317A.161 POWERS.",
	"text": "A corporation has the powers in this section, subject to limitations provided in applicable federal or state law or in its articles or bylaws.\nA corporation has perpetual duration.\nA corporation may sue and be sued, and participate in a legal, administrative, or arbitration proceeding, in its corporate name.\nA corporation may buy, lease, acquire, own, hold, improve, use, and deal in and with, real or personal property, or an interest in property, wherever located.\nA corporation may sell, convey, mortgage, create a security interest in, lease, exchange, transfer, or dispose of all or a part of its real or personal property, or an interest in property, wherever located.\nA corporation may buy, subscribe for, acquire, own, hold, vote, use, employ, sell, exchange, mortgage, lend, create a security interest in, dispose of, use, and deal in and with, securities or other interests in, or obligations of, a person or direct or indirect obligations of a domestic or foreign government or instrumentality.\nA corporation may make contracts and incur liabilities, borrow money, issue its securities, and secure its obligations by mortgage of or creation of a security interest in its property, franchises, and income.\nA corporation may invest and reinvest its funds.\nA corporation may take and hold real and personal property, whether or not of a kind sold or otherwise dealt in by the corporation, as security for the payment of money loaned, advanced, or invested.\nA corporation may conduct its business, carry on its operations, have offices, and exercise the powers granted by this chapter anywhere in the universe.\nA corporation may make donations for religious, scientific, educational, or charitable purposes, and for other purposes consistent with law, that further the corporate interest.\nA corporation may pay pensions, retirement allowances, and compensation for past services and establish employee or incentive benefit plans, trusts, and provisions for the benefit of its officers, directors, employees, and agents and their families, dependents, and beneficiaries. It may indemnify and buy insurance for a fiduciary of an employee benefit and incentive plan, trust, or provision.\n(a) A corporation may participate in the promotion, organization, management, and operation of an organization or in a transaction, undertaking, or arrangement that the participating corporation would have power to conduct by itself, whether or not the participation involves sharing or delegation of control.\n(b) A corporation may participate with others in a corporation, partnership, limited partnership, joint venture, trust, or other association of any kind that the participating corporation would have power to conduct by itself, whether or not the participation involves sharing or delegation of control.\nA corporation may provide for its benefit life insurance and other insurance with respect to the services of its officers, directors, employees, and agents.\nA corporation may have, alter at pleasure, and use a corporate seal as provided in section 317A.163.\nA corporation may adopt, amend, and repeal bylaws relating to the management of the business or the regulation of the affairs of the corporation as provided in section 317A.181.\nA corporation may establish committees of the board of directors, elect or appoint persons to the committees, define their duties, and fix their compensation as provided in section 317A.241.\nA corporation may elect or appoint officers, employees, and agents of the corporation, define their duties, and fix their compensation as provided in sections 317A.301 to 317A.361.\nA corporation may lend money to, guarantee an obligation of, become a surety for, or otherwise financially assist persons as provided in section 317A.501.\nA corporation may make advances to its directors, officers, and employees and those of its subsidiaries as provided in section 317A.505.\nA corporation shall indemnify those persons identified in section 317A.521 against certain expenses and liabilities only as provided in section 317A.521 and may indemnify other persons.\nA corporation may conduct all or part of its business under one or more assumed names as provided in sections 333.001 to 333.06.\nA corporation may take, receive, and hold real and personal property, including the principal and interest of money or other fund, that is given, conveyed, bequeathed, devised to, or vested in the corporation in trust where the corporation or a related organization has a vested or contingent interest in the trust.\nExcept where the trust instrument prescribes otherwise, a corporation may invest trust property or its proceeds in accordance with section 501C.0901.\nA corporation may be a member of another foreign or domestic nonprofit corporation.\nA corporation may dissolve and wind up.\nA corporation may merge and consolidate with other domestic or foreign nonprofit corporations organized for related purposes.\nA corporation has other powers necessary or convenient to effect a lawful purpose for which the corporation is incorporated.",
	"repealed": false
}