{
	"id": "216C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.02",
	"title": "216C.02 POWERS AND DUTIES OF COMMISSIONER; RULES.",
	"text": "(a) The commissioner may:\n(1) apply for, receive, and spend money received from federal, municipal, county, regional, and other government agencies and private sources;\n(2) apply for, accept, and disburse grants and other aids from public and private sources;\n(3) contract for professional services if work or services required or authorized to be carried out by the commissioner cannot be satisfactorily performed by employees of the department or by another state agency;\n(4) enter into interstate compacts to carry out research and planning jointly with other states or the federal government when appropriate;\n(5) upon reasonable request, distribute informational material at no cost to the public; and\n(6) enter into contracts for the performance of the commissioner's duties with federal, state, regional, metropolitan, local, and other agencies or units of government and educational institutions, including the University of Minnesota, without regard to the competitive bidding requirements of chapters 16A and 16C.\n(b) The commissioner shall collect information on conservation and other energy-related programs carried on by other agencies, by public utilities, by cooperative electric associations, by municipal power agencies, by other fuel suppliers, by political subdivisions, and by private organizations. Other agencies, cooperative electric associations, municipal power agencies, and political subdivisions shall cooperate with the commissioner by providing information requested by the commissioner. The commissioner may by rule require the submission of information by other program operators. The commissioner shall make the information available to other agencies and to the public and, as necessary, shall recommend to the legislature changes in the laws governing conservation and other energy-related programs to ensure that:\n(1) expenditures on the programs are adequate to meet identified needs;\n(2) the needs of low-income energy users are being adequately addressed;\n(3) duplication of effort is avoided or eliminated;\n(4) a program that is ineffective is improved or eliminated; and\n(5) voluntary efforts are encouraged through incentives for their operators.\n(c) By January 15 of each year, the commissioner shall report to the legislature on the projected amount of federal money likely to be available to the state during the next fiscal year, including grant money and money received by the state as a result of litigation or settlements of alleged violations of federal petroleum-pricing regulations. The report must also estimate the amount of money projected as needed during the next fiscal year to finance a level of conservation and other energy-related programs adequate to meet projected needs, particularly the needs of low-income persons and households, and must recommend the amount of state appropriations needed to cover the difference between the projected availability of federal money and the projected needs.\nMoney received by the commissioner under this section must be deposited in the state treasury and is appropriated to the commissioner for the purpose for which the money has been received. The money appropriated by this subdivision does not cancel and is available until expended. This appropriation does not apply to money resulting from litigation or settlements of alleged violations of federal petroleum-pricing regulations.\nThe commissioner may adopt rules under chapter 14 to carry out the commissioner's duties and responsibilities under this section and those sections renumbered by Laws 1987, chapter 312, article 1, section 10.",
	"repealed": false
}