{
	"id": "59D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/59D.06",
	"title": "59D.06 DISCLOSURES.",
	"text": "(a) Guaranteed asset protection waivers must disclose, as applicable, in writing and in clear, understandable language that is easy to read, the following:\n(1) the name and address of the initial creditor and the borrower at the time of sale, and the identity of any administrator if different from the creditor;\n(2) the purchase price and the terms of the GAP waiver, including without limitation, the requirements for protection, conditions, or exclusions associated with the GAP waiver;\n(3) that the borrower may cancel the GAP waiver within a free-look period as specified in the waiver, and will be entitled to a full refund of the purchase price, so long as no benefits have been provided;\n(4) the procedure the borrower must follow, if any, to obtain GAP waiver benefits under the terms and conditions of the waiver, including a telephone number and address where the borrower may apply for waiver benefits;\n(5) whether or not the GAP waiver is cancelable after the free-look period and the conditions under which it may be canceled or terminated including the procedures for requesting a refund due;\n(6) that in order to receive a refund due in the event of a borrower's cancellation of the GAP waiver agreement or early termination of the finance agreement after the free-look period of the GAP waiver, the borrower, in accordance with the terms of the waiver, must provide a written cancellation request to the creditor, administrator, or other party. If such a request is being made because of the termination of the finance agreement, notice must be provided to the creditor, administrator, or other party within 90 days of the occurrence of the event terminating the finance agreement;\n(7) the methodology for calculating a refund of the unearned purchase price of the GAP waiver due in the event of cancellation of the GAP waiver or early termination of the finance agreement; and\n(8) that the extension of credit, the terms of the credit, or the terms and conditions of the related motor vehicle sale or lease are not conditioned upon the purchase of the GAP waiver.\n(b) The creditor or any person offering a GAP waiver must provide the following verbatim disclosure in bold, 14-point type, either in a separate writing or as part of the agreement: \"THE GAP WAIVER IS OPTIONAL. YOU DO NOT HAVE TO PURCHASE THIS PRODUCT IN ORDER TO BUY [OR LEASE] THIS MOTOR VEHICLE. YOU ALSO HAVE A LIMITED RIGHT TO CANCEL.\"",
	"repealed": false
}