{
	"id": "45.026",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.026",
	"title": "45.026 REGULATION OF BUSINESS OF FINANCIAL PLANNING.",
	"text": "For the purposes of this section, the following terms have the meanings given them:\n(a) \"Person\" means an individual, corporation, partnership, joint venture, joint stock association, trust, or unincorporated association.\n(b) \"Financial planner\" means a person who, on advertisements, cards, signs, circulars, letterheads, or in another manner, indicates that the person is a \"financial planner,\" \"financial counselor,\" \"financial adviser,\" \"investment counselor,\" \"investment adviser,\" \"financial consultant,\" or other similar designation, title, or combination is considered to be representing that the person is engaged in the business of financial planning.\n(c) \"Advertisement\" includes:\n(1) printed or published material, audiovisual material, and descriptive literature of a financial planner used in direct mail, newspapers, magazines, other periodicals, radio scripts, television scripts, billboards, and other similar displays, excluding advertisements prepared for the sole purpose of obtaining employees, agents, or agencies;\n(2) descriptive literature and sales ads of all kinds issued by a financial planner for presentation to members of the public, including but not limited to, circulars, leaflets, booklets, depictions, illustrations, and form letters;\n(3) prepared sales talks, presentations, and materials for use by a financial planner and any representations made by a financial planner in accordance with these talks, presentations, and materials; and\n(4) statements, written or oral, by a financial planner.\nPersons who represent that they are financial planners have a fiduciary duty to persons for whom services are performed for compensation. In an action for breach of fiduciary duty, a person may recover actual damages resulting from the breach, together with costs and disbursements.\nA financial planner is subject to section 45.027, subdivision 5.",
	"repealed": false
}