{
	"id": "84.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.085",
	"title": "84.085 ACCEPTANCE OF GIFTS.",
	"text": "(a) The commissioner of natural resources may accept for and on behalf of the state any gift, bequest, devise, or grants of lands or interest in lands or personal property of any kind or of money tendered to the state for any purpose pertaining to the activities of the department or any of its divisions. Any money so received is hereby appropriated and dedicated for the purpose for which it is granted. Lands and interests in lands so received may be sold or exchanged as provided in chapter 94. The deed conveying land or an interest in land to the state under this paragraph must clearly indicate whether the state may resell the donated land or interest in land.\n(b) When the commissioner of natural resources accepts lands or interests in land, the commissioner may reimburse the donor for costs incurred to obtain an appraisal needed for tax reporting purposes. If the state pays the donor for a portion of the value of the lands or interests in lands that are donated, the reimbursement for appraisal costs shall not exceed $1,500. If the donor receives no payment from the state for the lands or interests in lands that are donated, the reimbursement for appraisal costs shall not exceed $5,000.\n(c) The commissioner of natural resources, on behalf of the state, may accept and use grants of money or property from the United States or other grantors for conservation purposes not inconsistent with the laws of this state. Any money or property so received is hereby appropriated and dedicated for the purposes for which it is granted, and shall be expended or used solely for such purposes in accordance with the federal laws and regulations pertaining thereto, subject to applicable state laws and rules as to manner of expenditure or use providing that the commissioner may make subgrants of any money received to other agencies, units of local government, private individuals, private organizations, and private nonprofit corporations. Appropriate funds and accounts shall be maintained by the commissioner of management and budget to secure compliance with this section.\n(d) The commissioner may accept for and on behalf of the permanent school fund a donation of lands, interest in lands, or improvements on lands. A donation so received shall become state property, be classified as school trust land as defined in section 92.025, and be managed consistent with section 127A.31. When the commissioner proposes to accept a donation of land or an interest in land, the commissioner must notify the landowner of the option to express in the deed whether the state may resell the land.\nThe commissioner of natural resources must accept a gift, bequest, devise, or grant of wetlands, as defined in section 103G.005, subdivision 19, or public waters wetlands, as defined in section 103G.005, subdivision 15a, unless:\n(1) the commissioner determines that the value of the wetland for water quality, floodwater retention, public recreation, wildlife habitat, or other public benefits is minimal;\n(2) the wetland has been degraded by activities conducted without a required permit by the person offering the wetland and the person has not taken actions determined by the commissioner to be necessary to restore the wetland;\n(3) the commissioner determines that the wetland has been contaminated by a hazardous substance as defined in section 115B.02, subdivision 8, a pollutant or contaminant as defined in section 115B.02, subdivision 13, or petroleum as defined in section 115C.02, subdivision 10, and the contamination has not been remedied as required under chapter 115B or 115C;\n(4) the wetland is subject to a lien or other encumbrance; or\n(5) the commissioner, after reasonable effort, has been unable to obtain an access to the wetland.",
	"repealed": false
}