{
	"id": "116J.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.415",
	"title": "116J.415 CHALLENGE GRANT PROGRAM.",
	"text": "The commissioner shall make challenge grants to regional organizations, for the purpose of providing financial assistance to encourage private investment, to provide jobs or job enhancement for low-income persons, and to promote economic development in the rural areas of the state.\nThe commissioner shall divide the state outside of the metropolitan area as defined in section 473.121, subdivision 2, into six regions. A region's boundaries must be coterminous with the boundaries of one or more of the development regions established under section 462.385. The commissioner shall allocate all funds remaining in each regional subaccount of the rural rehabilitation account, as established under section 116J.955, to each respective regional organization. The money designated to each region must be used for assistance authorized in this section.\nThe commissioner shall select at least one organization for each region to receive the challenge grants and shall enter into grant agreements with the organizations. An organization must be a nonprofit corporation and must demonstrate that:\n(1) its board of directors includes citizens experienced in rural development, representatives of the regional development commissions, and representatives from all geographic areas in the region;\n(2) it has the technical skills to analyze projects;\n(3) it is familiar with other available public and private funding sources and economic development programs;\n(4) it can initiate and implement economic development projects; and\n(5) it can establish and administer a revolving loan account.\nA regional organization shall establish a commissioner certified revolving fund to promote economic development in rural Minnesota. Funds may be used to provide loans, loan guarantees, interest buy-downs, and other forms of participation with private sources of financing, provided that the financial assistance must be for a principal amount that does not exceed one-half of the cost of the project for which financing is sought.\nProjects supported through the challenge grant program must be used principally to benefit low-income persons by:\n(1) creating new jobs, job enhancement, or retaining existing jobs;\n(2) increasing the local tax base;\n(3) demonstrating that investment of public dollars induces private funds;\n(4) providing higher wage levels to the community or adding value to current workforce skills;\n(5) retaining existing business; or\n(6) attracting out-of-state business.\n[Repealed, 2003 c 128 art 13 s 40]\nRepayment amounts must be deposited in the regional revolving fund for further distribution by the regional organization, consistent with the loan criteria specified in subdivisions 4 and 5.\nThe commissioner shall adopt rules to implement the duties specified in this section.\n[Repealed, 2003 c 128 art 13 s 40]\n[Repealed, 2003 c 128 art 13 s 40]\nAn organization that receives a challenge grant shall:\n(1) submit an annual report to the commissioner by August 30 for the preceding fiscal year that includes an account of loans made, written off, and fully paid during the calendar year, the source and amount of money collected and distributed by the regional revolving fund, and the funds' cash balance and loans receivable; and\n(2) provide for an independent annual audit to be performed in accordance with generally accepted accounting practices and auditing standards and submit a copy of each annual audit report to the commissioner.",
	"repealed": false
}