{
	"id": "171.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.165",
	"title": "171.165 COMMERCIAL DRIVER'S LICENSE, DISQUALIFICATION.",
	"text": "Subject to section 171.166, the commissioner shall disqualify a person from operating commercial motor vehicles in accordance with the driver disqualifications and penalties in Code of Federal Regulations, title 49, part 383, subpart D and Code of Federal Regulations, title 49, section 384.219.\nThe commissioner shall disqualify a person from operating commercial motor vehicles for a revocation under section 169A.52 or 171.177 or a statute or ordinance from another state or jurisdiction in conformity with it, for a period that is equivalent in duration under the driver disqualifications and penalties in Code of Federal Regulations, title 49, part 383, subpart D, that pertain to a conviction of being under the influence of alcohol or refusal to be tested.\n[Repealed, 1Sp2005 c 6 art 3 s 108]\n[Repealed, 1Sp2005 c 6 art 3 s 108]\n[Repealed, 1Sp2005 c 6 art 3 s 108]\n[Repealed, 1Sp2005 c 6 art 3 s 108]\nThe commissioner shall adopt rules to administer this section. The rules must include procedures for issuing class D licenses to persons who have been disqualified from operating commercial motor vehicles but whose drivers' licenses have not otherwise been revoked, suspended, canceled, or denied.\n(a) A disqualification shall not be imposed under this section on a recreational vehicle operator, farmer, or authorized emergency vehicle operator operating a commercial motor vehicle within the scope of section 171.02, subdivision 2, paragraph (c).\n(b) A conviction for a violation that occurred before August 1, 2005, while operating a vehicle that is not a commercial motor vehicle shall not be counted as a first or subsequent violation for purposes of determining the period for which a driver must be disqualified under this section.\nThis section applies to offenses committed, and revocations imposed for incidents occurring, on or after January 1, 1990.",
	"repealed": false
}