{
	"id": "82B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.08",
	"title": "82B.08 LICENSING REQUIREMENTS.",
	"text": "The commissioner shall issue a license as a real estate appraiser to a person who qualifies for the license under the terms of this chapter.\nAn applicant must be at least 18 years of age when making application.\n(a) An applicant for an initial license must:\n(1) consent to a criminal history record check;\n(2) submit a fingerprint card in a form acceptable to the commissioner; and\n(3) pay the fee required to perform criminal history record checks with the Minnesota Bureau of Criminal Apprehension and the Federal Bureau of Investigation.\n(b) The commissioner may contract for the collection and transmission of fingerprints required under this chapter and may order the fee for collecting and transmitting fingerprints to be payable directly to the contractor by the applicant. The commissioner may agree to a reasonable fingerprinting fee to be charged by the contractor.\n(c) The commissioner shall submit the applicant's fingerprints, consent, and the required fee to the superintendent of the Bureau of Criminal Apprehension. The superintendent shall perform a check of the state criminal history repository and is authorized to exchange the applicant's fingerprints with the Federal Bureau of Investigation to obtain the national criminal history record. The superintendent shall return the results of the state and national criminal history records checks to the commissioner.\n(d) An applicant for a renewal of a license must disclose, in a form acceptable to the commissioner, any crimes involving moral turpitude or that are substantially related to the qualifications, functions, or duties of the profession of real estate appraiser that the applicant has been convicted of or pled guilty or nolo contendere to, as provided in this paragraph. An applicant renewing a license is only required to disclose events that occurred since the license was issued if this is the applicant's first license renewal or, since the license was renewed, if this is a subsequent renewal.\n(a) An applicant for a license must apply in writing upon forms prescribed by the commissioner. Each application must be signed and sworn to by the applicant and must be accompanied by the license fee required by this chapter.\n(b) An application must contain information required by the commissioner consistent with the provisions and purposes of this chapter.\n(c) An application must give the applicant's name, age, residence address, and the name and place of business.\n(d) The commissioner may require additional information the commissioner considers appropriate to administer this chapter.\n(e) When filing an initial application or application for renewal for a license, the applicant shall state that the person agrees to comply with the standards set forth in this chapter and that the person understands the types of misconduct for which disciplinary proceedings may be started against a licensed real estate appraiser.\n(f) The application for original licensing, renewal licensing, and examination must specify the classification of licensing being applied for and previously granted.\nThe initial application for licensing of a trainee real property appraiser must identify the name and address of the supervisory appraiser or appraisers. Trainee real property appraisers licensed prior to the effective date of this provision must identify the name and address of their supervisory appraiser or appraisers at the time of license renewal. A trainee must notify the commissioner in writing within ten days of terminating or changing the trainee's relationship with any supervisory appraiser.\nThe initial application for licensing of a certified residential real property appraiser and certified general real property appraiser who intends to act in the capacity of a supervisory appraiser must identify the name and address of the trainee real property appraiser or appraisers the supervisory appraiser intends to supervise. A certified residential real property appraiser and certified general real property appraiser licensed and acting in the capacity of a supervisory appraiser prior to the effective date of this provision must, at the time of license renewal, identify the name and address of any trainee real property appraiser or appraisers under supervision.\nInitial licenses issued under this chapter are valid for a period not to exceed two years. The commissioner shall assign an expiration date to each initial license so that approximately one-half of all licenses expire each year. Each initial license must expire on August 31 of the expiration year assigned by the commissioner.\n(a) Licenses renewed under this chapter are valid for a period of 24 months. Persons whose applications have been properly and timely filed who have not received notice of denial of renewal are considered to have been approved for renewal and may continue to transact business as a real estate appraiser whether or not the renewed license has been received on or before September 1 of the renewal year. Application for renewal of a license is considered to have been timely filed if received by the commissioner by, or mailed with proper postage and postmarked by, August 1 of the renewal year. Applications for renewal are considered properly filed if made upon forms duly executed and sworn to, accompanied by fees prescribed by this chapter and containing information the commissioner requires.\n(b) Persons who have failed to make a timely application for renewal of a license and who have not received the renewal license as of September 1 of the renewal year are unlicensed until the time the license has been issued by the commissioner and is received.\nNotice in writing must be given to the commissioner by each licensee of any change in personal name, trade name, address or business location not later than ten days after the change. The commissioner shall issue a new license if required for the unexpired period.\nA nonresident of Minnesota may be licensed as a real estate appraiser upon compliance with all provisions of this chapter.\nA real estate appraiser's license must be canceled by the commissioner for failure of a licensee to complete continuing education requirements. In this case, the license must be returned to the commissioner within ten days of receipt of notice of cancellation.\nWithin two years of a license cancellation, a person who was previously licensed may reinstate the license without examination by completing the required application, paying the required fee for a new license application, and reporting successful completion of all outstanding continuing education requirements for the period during which the license was canceled. The license must be reinstated without reexamination by completing the required instruction, filing an application, and paying the fee for the license within two years of the cancellation date.\nA licensee or license applicant may at any time file with the commissioner a request to withdraw from the status of licensee or to withdraw a pending license application. Withdrawal from the status of licensee or withdrawal of the license application becomes effective upon receipt by the commissioner unless a revocation, suspension, or denial proceeding is pending when the request to withdraw is filed or a proceeding to revoke, suspend, deny, or impose condition upon the withdrawal is instituted within 30 days after the request to withdraw is filed. If a proceeding is pending or instituted, withdrawal becomes effective at the time and upon the conditions the commissioner by order determines. If no proceeding is pending or instituted and withdrawal automatically becomes effective, the commissioner must institute a revocation or suspension proceeding within one year after withdrawal became effective and enter a revocation or suspension order as of the last date on which the license was in effect.\nIf a license lapses or becomes ineffective due to the licensee's failure to timely file a renewal application and the licensee continues to conduct business for which a license is required, the commissioner must institute a revocation or suspension proceeding within two years after the license was last effective and enter a revocation or suspension order as of the last date on which the license was in effect.",
	"repealed": false
}