{
	"id": "142B.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.71",
	"title": "142B.71 FAMILY CHILD CARE HEALTH AND SAFETY REQUIREMENTS.",
	"text": "(a) Before admitting a child for care, the license holder must obtain information about any known allergy from the child's parent or legal guardian. The license holder must maintain current allergy information in each child's record. The allergy information must include a description of the allergy, specific triggers, avoidance techniques, symptoms of an allergic reaction, and procedures for responding to an allergic reaction, including medication, dosages, and a doctor's contact information.\n(b) The child's allergy information must be documented on a form approved by the commissioner, readily available to all caregivers, and reviewed annually by the license holder and each caregiver.\nThe licensed family child care provider must comply with the following procedures for safely handling and disposing of bodily fluids:\n(1) surfaces that come in contact with potentially infectious bodily fluids, including blood and vomit, must be cleaned and disinfected as described in section 142B.76;\n(2) blood-contaminated material must be disposed of in a plastic bag with a secure tie;\n(3) sharp items used for a child with special care needs must be disposed of in a \"sharps container.\" The sharps container must be stored out of reach of a child; and\n(4) the license holder must have the following bodily fluid disposal supplies available: disposable gloves, disposal bags, and eye protection.\n(a) A licensed family child care provider must have a written emergency preparedness plan for emergencies that require evacuation, sheltering, or other protection of children, such as fire, natural disaster, intruder, or other threatening situation that may pose a health or safety hazard to children. The plan must be written on a form developed by the commissioner and updated at least annually. The plan must include:\n(1) procedures for an evacuation, relocation, shelter-in-place, or lockdown;\n(2) a designated relocation site and evacuation route;\n(3) procedures for notifying a child's parent or legal guardian of the evacuation, shelter-in-place, or lockdown, including procedures for reunification with families;\n(4) accommodations for a child with a disability or a chronic medical condition;\n(5) procedures for storing a child's medically necessary medicine that facilitate easy removal during an evacuation or relocation;\n(6) procedures for continuing operations in the period during and after a crisis;\n(7) procedures for communicating with local emergency management officials, law enforcement officials, or other appropriate state or local authorities; and\n(8) accommodations for infants and toddlers.\n(b) The license holder must train caregivers before the caregiver provides care and at least annually on the emergency preparedness plan and document completion of this training.\n(c) The license holder must conduct drills according to the requirements in Minnesota Rules, part 9502.0435, subpart 8. The date and time of the drills must be documented.\n(d) The license holder must have the emergency preparedness plan available for review.\nA license holder must ensure compliance with all seat belt and child passenger restraint system requirements under section 169.685.\nNotwithstanding Minnesota Rules, part 9502.0435, subpart 8, item B, a license holder is not required to post a list of emergency numbers. A license holder may use a cellular telephone to meet the requirements of Minnesota Rules, part 9502.0435, subpart 8, if the cellular telephone is sufficiently charged for use at all times.",
	"repealed": false
}