{
	"id": "144.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.051",
	"title": "144.051 DATA RELATING TO LICENSED AND REGISTERED PERSONS.",
	"text": "The legislature finds that accurate information pertaining to the numbers, distribution and characteristics of health-related personnel is required in order that there exist an adequate information resource at the state level for purposes of making decisions pertaining to health personnel.\nThe commissioner of health shall establish a system for the collection, analysis and reporting of data on individuals licensed or registered by the commissioner or the health-related licensing boards as defined in section 214.01, subdivision 2. Individuals licensed or registered by the commissioner or the health-related licensing boards shall provide information to the commissioner of health that the commissioner may, pursuant to section 144.052, require. The commissioner shall publish at least biennially, a report which indicates the type of information available and methods for requesting the information.\nFor providers regulated pursuant to sections 144A.43 to 144A.482 and chapter 144G, the following data collected, created, or maintained by the commissioner are classified as private data on individuals as defined in section 13.02, subdivision 12:\n(1) data submitted by or on behalf of applicants for licenses prior to issuance of the license;\n(2) the identity of complainants who have made reports concerning licensees or applicants unless the complainant consents to the disclosure;\n(3) the identity of individuals who provide information as part of surveys and investigations;\n(4) Social Security numbers; and\n(5) health record data.\nFor providers regulated pursuant to sections 144A.43 to 144A.482 and chapter 144G, the following data collected, created, or maintained by the commissioner are classified as public data as defined in section 13.02, subdivision 15:\n(1) all application data on licensees, license numbers, and license status;\n(2) licensing information about licenses previously held under this chapter;\n(3) correction orders, including information about compliance with the order and whether the fine was paid;\n(4) final enforcement actions pursuant to chapter 14;\n(5) orders for hearing, findings of fact, and conclusions of law; and\n(6) when the licensee and department agree to resolve the matter without a hearing, the agreement and specific reasons for the agreement are public data.\nFor providers regulated pursuant to sections 144A.43 to 144A.482 and chapter 144G, the following data collected, created, or maintained by the Department of Health are classified as confidential data on individuals as defined in section 13.02, subdivision 3: active investigative data relating to the investigation of potential violations of law by a licensee including data from the survey process before the correction order is issued by the department.\nFor providers regulated pursuant to sections 144A.43 to 144A.482 and chapter 144G, the department may release private or confidential data, except Social Security numbers, to the appropriate state, federal, or local agency and law enforcement office to enhance investigative or enforcement efforts or further a public health protective process. Types of offices include Adult Protective Services, Office of the Ombudsman for Long-Term Care and Office of the Ombudsman for Mental Health and Developmental Disabilities, the health licensing boards, Department of Human Services, county or city attorney's offices, police, and local or county public health offices.",
	"repealed": false
}