{
	"id": "317A.461",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.461",
	"title": "317A.461 BOOKS AND RECORDS; FINANCIAL STATEMENT.",
	"text": "A corporation shall keep at its registered office correct and complete copies of its articles and bylaws, accounting records, voting agreements, and minutes of meetings of members, board of directors, and committees having any of the authority of the board of directors for the last six years.\nA member or a director, or the agent or attorney of a member or a director, may inspect all documents referred to in subdivision 1 or 3 for any proper purpose at any reasonable time. A proper purpose is one reasonably related to the person's interest as a member or director of the corporation.\nUpon request, a corporation shall give the member or the director a statement showing the financial result of all operations and transactions affecting income and surplus during its last annual accounting period and a balance sheet containing a summary of its assets and liabilities as of the closing date of the accounting period.\nA member or director who has gained access under this section to any corporate record may not use or furnish to another for use the corporate record or a portion of the contents for any purpose other than a proper purpose. Upon application of the corporation, a court may issue a protective order or order other relief as may be necessary to enforce the provisions of this subdivision.\nThe corporation may charge the requesting party a reasonable fee to cover the expenses of providing copies of documents under this section.\nThe records maintained by a corporation may use any information storage technique, even though the technique makes them illegible visually, if the records can be converted accurately and within a reasonable time into a form that is legible visually and whose contents are assembled by related subject matter to permit convenient use by people in the normal course of business. A corporation shall convert any of the records referred to in subdivision 1 or 3 upon the request of a person entitled to inspect them, and the expense of the conversion must be borne by the person who bears the expense of copying under subdivision 5. A copy of the conversion is admissible in evidence, and must be accepted for all other purposes, to the same extent as the existing or original records would be if they were legible visually.\nA member or a director who is wrongfully denied access to or copies of documents under this section may bring an action for injunctive relief, damages, and costs and reasonable attorney fees.",
	"repealed": false
}