{
	"id": "144.0755",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0755",
	"title": "144.0755 AFRICAN AMERICAN HEALTH STATE ADVISORY COUNCIL.",
	"text": "(a) The commissioner of health shall establish and administer the African American Health State Advisory Council. The African American Health State Advisory Council shall include no fewer than 12 or more than 20 members from any of the following groups:\n(1) representatives of community-based organizations serving or advocating for African American citizens;\n(2) at-large community leaders or elders, as nominated by other council members;\n(3) African American individuals who provide and receive health care services;\n(4) African American secondary or college students;\n(5) health or human service professionals serving African American communities or clients;\n(6) representatives with research or academic expertise in racial equity; and\n(7) other members that the commissioner deems appropriate to facilitate the goals and duties of the council.\n(b) The commissioner shall make recommendations for council membership and, after considering recommendations from the council, shall appoint a chair or chairs of the council. Council members shall be appointed by the governor.\nA term shall be for two years and appointees may be reappointed to serve two additional terms. The commissioner shall recommend appointments to replace members vacating their positions in a timely manner, no more than three months after the council reviews panel recommendations.\nThe commissioner or commissioner's designee shall:\n(1) maintain and actively engage with the council established in this section;\n(2) based on recommendations of the council, review identified department or other related policies or practices that maintain health inequities and disparities that particularly affect African Americans in Minnesota;\n(3) in partnership with the council, recommend or implement action plans and resources necessary to address identified disparities and advance African American health equity;\n(4) support interagency collaboration to advance African American health equity; and\n(5) support member participation in the council, including participation in educational and community engagement events across Minnesota that specifically address African American health equity.\nThe council shall:\n(1) identify health disparities found in African American communities and contributing factors;\n(2) recommend to the commissioner for review any statutes, rules, or administrative policies or practices that would address African American health disparities;\n(3) recommend policies and strategies to the commissioner of health to address disparities specifically affecting African American health;\n(4) form work groups of council members who are persons who provide and receive services and representatives of advocacy groups;\n(5) provide the work groups with clear guidelines, standardized parameters, and tasks for the work groups to accomplish; and\n(6) annually submit to the commissioner a report that summarizes the activities of the council, identifies disparities specially affecting the health of African American Minnesotans, and makes recommendations to address identified disparities.\nThe members of the council shall:\n(1) attend scheduled meetings with no more than three absences per year, participate in scheduled meetings, and prepare for meetings by reviewing meeting notes;\n(2) maintain open communication channels with respective constituencies;\n(3) identify and communicate issues and risks that may impact the timely completion of tasks;\n(4) participate in any activities the council or commissioner deems appropriate and necessary to facilitate the goals and duties of the council; and\n(5) participate in work groups to carry out council duties.\nThe commissioner shall provide the advisory council with staff support, office space, and access to office equipment and services.\nCompensation and reimbursement for travel and expenses incurred for council activities are governed by section 15.059, subdivision 3.",
	"repealed": false
}