{
	"id": "241.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.065",
	"title": "241.065 CONDITIONAL RELEASE DATA SYSTEM.",
	"text": "As used in this section, \"conditional release\" means probation, conditional release, and supervised release.\n(a) The Department of Corrections shall administer and maintain a computerized data system for the purpose of assisting criminal justice agencies in conducting official duties and in monitoring and enforcing the conditions of conditional release imposed on criminal offenders by a sentencing court or the commissioner of corrections.\n(b) The adult data and juvenile data, as defined in section 260B.171, in the statewide supervision system are private data on individuals, as defined in section 13.02, subdivision 12. Subject to paragraph (c), the data are accessible to:\n(1) criminal justice agencies as defined in section 13.02, subdivision 3a;\n(2) the Minnesota Sex Offender Program as provided in section 246B.04, subdivision 3;\n(3) public defenders as provided in section 611.272;\n(4) all trial courts and appellate courts; and\n(5) criminal justice agencies in other states.\n(c) Case planning data in the statewide supervision system are private data on individuals, as defined in section 13.02, subdivision 12. Case planning data are accessible to state prison facility staff, correction staff in community corrections act counties and county probation counties, and Department of Corrections field services staff for purposes of monitoring and enforcing conditions of conditional release. A finalized case plan may be provided to community service providers for the purposes described under paragraph (a).\n(d) Adult data in the statewide supervision system are accessible to the secretary of state for the purposes described in section 201.145.\nOnly criminal justice agencies may submit data to the statewide supervision system and only persons who are authorized users under subdivision 2 may obtain data from the system. The commissioner of corrections may require that any or all information be submitted to the statewide supervision system. A consent to the release of data in the statewide supervision system from the individual who is the subject of the data is not effective.\n(a) The Department of Corrections shall adopt procedures to provide for the orderly collection, entry, retrieval, and deletion of data contained in the statewide supervision system.\n(b) The Department of Corrections shall establish and implement audit requirements to ensure that authorized users comply with applicable data practices laws governing access to and use of the data.",
	"repealed": false
}