{
	"id": "268.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.115",
	"title": "268.115 EXTENDED UNEMPLOYMENT BENEFITS.",
	"text": "The terms in this subdivision have, for purposes of the Minnesota Unemployment Insurance Law, the following meanings:\n(1) \"Extended unemployment benefit period\" means a period that lasts for a minimum of 13 weeks and that:\n(i) begins with the third week after there is a state \"on\" indicator; and\n(ii) ends with the third week after there is a state \"off\" indicator.\nNo extended unemployment benefit period may begin before the 14th week following the end of a prior extended unemployment benefit period.\n(2) There is a \"state 'on' indicator\" for a week if:\n(i) for that week and the prior 12 weeks, the rate of insured unemployment:\n(a) equaled or exceeded 120 percent of the average of the rates for the corresponding 13-week period ending in each of the prior two calendar years, and was five percent or more; or\n(b) equaled or exceeded six percent; or\n(ii) The United States Secretary of Labor determines that the average rate of seasonally adjusted total unemployment in Minnesota for the most recent three months for which data is published equals or exceeds 6.5 percent and this rate equals or exceeds 110 percent of the rate of the corresponding three-month period in either of the prior two calendar years.\n(3) There is a \"state 'off' indicator\" for a week if under clause (2) the requirements for a \"state 'on' indicator\" are not satisfied.\n(4) \"Rate of insured unemployment,\" means the percentage derived by dividing the average weekly number of applicants filing continued requests for regular unemployment benefits in the most recent 13-week period by the average monthly covered employment for the first four of the most recent six completed calendar quarters before the end of that 13-week period.\n(5) \"Regular unemployment benefits\" means unemployment benefits available to an applicant other than extended unemployment benefits and additional unemployment benefits.\n(6) \"Eligibility period\" for an applicant means the period consisting of the weeks remaining in the applicant's benefit year within the extended unemployment benefit period and, if the benefit year ends within the extended unemployment benefit period, any weeks in the extended unemployment benefit period.\n(7) \"Exhaustee\" means an applicant who, in the eligibility period:\n(i) the benefit year having not expired has received the maximum amount of regular unemployment benefits that were available under section 268.07;\n(ii) the benefit year having expired, has insufficient wage credits to establish a new benefit account; or\n(iii) has no right to any type of unemployment benefits under any other state or federal laws and is not receiving unemployment benefits under the law of Canada.\n[Repealed by amendment, 1999 c 107 s 48]\nIf an extended unemployment benefit period is in effect, an applicant is paid extended unemployment benefits from the trust fund for any week in the applicant's eligibility period if the applicant:\n(1) is an \"exhaustee\";\n(2) has satisfied the same requirements as those for regular unemployment benefits under section 268.069;\n(3) has wage credits of not less than 40 times the weekly unemployment benefit amount; and\n(4) is not subject to a denial of extended unemployment benefits under subdivision 9.\nThe weekly extended unemployment benefit amount is the same as the weekly unemployment benefit amount of regular unemployment benefits.\nThe maximum amount of extended unemployment benefits available to an applicant is 50 percent of the maximum amount of regular unemployment benefits available in the benefit year. If the total rate of unemployment computed under subdivision 1, clause (2)(ii), equaled or exceeded eight percent, the maximum amount of extended unemployment benefits available is 80 percent of the maximum amount of regular unemployment benefits available in the benefit year.\nWhenever an extended unemployment benefit period is to begin as a result of a state \"on\" indicator, or an extended unemployment benefit period is to end as a result of a state \"off\" indicator the commissioner must make an appropriate public announcement.\nThis section is enacted to conform to the requirements of United States Code, title 26, section 3304, the Federal-State Extended Unemployment Compensation Act of 1970 as amended and the applicable federal regulations.\nAn applicant residing in a state other than Minnesota is eligible for only the first two weeks of extended unemployment benefits if the applicant's benefit account was established under the interstate benefit payment plan and no extended unemployment benefit period is in effect for the week in that state.\n(a) An applicant is denied extended unemployment benefits for any week in the applicant's eligibility period if during that week the applicant failed to accept any offer of suitable employment, failed to apply for any suitable employment that the applicant was referred to by the commissioner, or failed to actively seek suitable employment.\nThe denial continues until the applicant has been employed in covered employment in each of four subsequent weeks, whether or not consecutive, and had earnings from that covered employment of not less than four times the applicant's weekly unemployment benefit amount.\n(b) For the purpose of this subdivision \"suitable employment\" means any employment that is within the applicant's capabilities and that has a gross average weekly wage that exceeds the applicant's weekly unemployment benefit amount. The employment must pay wages not less than the higher of the federal minimum wage without regard to any exemption, or the applicable state minimum wage.\n(c) No applicant may be denied extended unemployment benefits for failure to accept an offer of or apply for any suitable employment if:\n(1) the position was not offered to the applicant in writing;\n(2) the position was not listed with the job service; or\n(3) the applicant furnishes satisfactory evidence that prospects for obtaining employment in the applicant's customary occupation within a reasonably short period are good. If the evidence is satisfactory, the determination of whether any employment is suitable is made in accordance with the definition of suitable employment in section 268.035, subdivision 23a.\n(d) For the purpose of this subdivision an applicant is \"actively seeking suitable employment\" only if the applicant has engaged in a systematic and sustained effort to obtain employment, and the applicant furnishes tangible evidence of that effort.\nThe job service must refer any applicant who is filing continued requests for extended unemployment benefits to any employment that is suitable under subdivision 9.",
	"repealed": false
}