{
	"id": "123B.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.95",
	"title": "123B.95 BOARDS OF COMMON SCHOOL DISTRICTS.",
	"text": "The care, management and control of a common district is vested in a board of three members to be known as the school board. The term of office of a member shall be three years, and until a successor qualifies. The board of each common district must consist of a chair, a treasurer, and a clerk. The board may by resolution establish a time and place for regular meeting and no notice of such meeting need be sent to any members of the board.\nThe board must submit to the annual meeting an estimate of the expenses of the district for the coming year for a school term as determined by the board and for such other specified purposes as the board may deem proper. If the annual meeting fails to vote a sufficient tax to maintain the district for such time, the board must levy such tax pursuant to and within the limitations of sections 124D.22, 126C.40 to 126C.45, and 126C.48; but no board shall expend any money or incur any liability for any purpose beyond the sum appropriated by vote of the district for such purpose, or levied by the board pursuant to this subdivision, or on hand and applicable thereto.\nThe board must visit each school at least once every three months.\nAt its first meeting following July 1 each year, the board must designate, by resolution, as the official newspaper of the district, some legal newspaper of general circulation within the district, and contract with such newspaper for its publications. If there is more than one such newspaper, the board must enter a contract with the lowest responsible bidder at the earliest practicable date. All notices and proceedings required by law to be published by the board must be published in the official newspaper so designated. The fees for such publication must not exceed the fees for publication of legal notices as prescribed by Minnesota Statutes.",
	"repealed": false
}