{
	"id": "270.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.83",
	"title": "270.83 EXAMINATIONS AND INVESTIGATIONS.",
	"text": "The commissioner shall have the power to examine or cause to be examined any books, papers, records, or memoranda relevant to the determination of the valuation of operating property as herein provided. The commissioner shall have the further power to require the attendance of any person having knowledge or information in the premises, to compel the production of books, papers, records, or memoranda by persons so required to attend, to take testimony on matters material to such determination and administer oaths or affirmations.\nFor the purpose of making such examinations, the commissioner may appoint such persons as the commissioner may deem necessary. Such persons shall have the rights and powers of the examining of books, papers, records or memoranda, and of subpoenaing witnesses, administering oaths and affirmations, and taking of testimony, which are conferred upon the commissioner hereby. The court administrator of any court of record, upon demand of any such person, shall issue a subpoena for the attendance of any witness or the production of any books, papers, records, or memoranda before such person. The commissioner may also issue subpoenas for the appearance of witnesses before the commissioner or before such persons. Disobedience of subpoenas so issued shall be punished by the district court of the district in which the subpoena is issued for a contempt of the district court.\nIf any railroad company shall refuse or neglect to make the report required by this section to the commissioner, or shall refuse or neglect to permit an inspection and examination of its property, records, books, accounts or other papers when requested by the commissioner, or shall refuse or neglect to appear before the commissioner or a person appointed under subdivision 2 when required so to do, the commissioner shall make the valuation provided for by sections 270.80 to 270.87 against the railroad company according to the commissioner's best judgment on available information.",
	"repealed": false
}