{
	"id": "62K.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62K.15",
	"title": "62K.15 ANNUAL OPEN ENROLLMENT PERIODS; SPECIAL ENROLLMENT PERIODS.",
	"text": "(a) Health carriers offering individual health plans must limit annual enrollment in the individual market to the annual open enrollment periods for MNsure. Nothing in this section limits the application of special or limited open enrollment periods as defined under the Affordable Care Act.\n(b) Health carriers offering individual health plans must inform all applicants at the time of application and enrollees at least annually of the open and special enrollment periods as defined under the Affordable Care Act.\n(c) Health carriers offering individual health plans must provide a special enrollment period for enrollment in the individual market by employees of a small employer that offers a qualified small employer health reimbursement arrangement in accordance with United States Code, title 26, section 9831(d). The special enrollment period must be available only to employees newly hired by a small employer offering a qualified small employer health reimbursement arrangement, and to employees employed by the small employer at the time the small employer initially offers a qualified small employer health reimbursement arrangement. For employees newly hired by the small employer, the special enrollment period shall last for 30 days after the employee's first day of employment. For employees employed by the small employer at the time the small employer initially offers a qualified small employer health reimbursement arrangement, the special enrollment period shall last for 30 days after the date the arrangement is initially offered to employees.\n(d) The commissioner of commerce shall enforce this section.\n(e) Health carriers offering individual health plans through MNsure must provide a special enrollment period as required under the easy enrollment health insurance outreach program under section 62V.13.",
	"repealed": false
}