{
	"id": "123B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.10",
	"title": "123B.10 PUBLICATION OF FINANCIAL INFORMATION.",
	"text": "(a) Every board must publish revenue and expenditure budgets for the current year and the actual revenues, expenditures, fund balances for the prior year and projected fund balances for the current year in a form prescribed by the commissioner within one week of the acceptance of the final audit by the board, or November 30, whichever is earlier. The forms prescribed must be designed so that year to year comparisons of revenue, expenditures and fund balances can be made.\n(b) A school board annually must notify the public of its revenue, expenditures, fund balances, and other relevant budget information. The board must post the materials in a conspicuous place on the district's official website, including a link to the district's school report card on the Department of Education's website, and publish a summary of the information and the address of the district's official website where the information can be found in a qualified newspaper of general circulation in the district.\nThe board must also publish at the same time a summary of bonds outstanding, paid, and sold; a summary of orders not paid for want of funds; certificates of indebtedness for the year ending June 30; the statutory operating debt of the district as defined and certified pursuant to section 123B.81; and the balance amount of the reserved fund balance reserve account for purposes of statutory operating debt reduction established pursuant to sections 126C.40 to 126C.45, 126C.48, and 124D.22.\nA statement must be included in the publication that the complete budget in detail may be inspected by any resident of the district upon request to the chief school administrator.\nThe board must also publish at the same time the average cost per pupil in average daily membership educated in that district in the preceding year. This computation must be made exclusive of debt service or capital outlay costs.",
	"repealed": false
}