{
	"id": "103E.335",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.335",
	"title": "103E.335 PROCEEDINGS AT FINAL HEARING.",
	"text": "At the time and location for the final hearing specified in the notice, or after the hearing adjourns, the drainage authority shall consider the petition for the drainage project, with all matters pertaining to the detailed survey report, the viewers' report, and the commissioner's final advisory report. The drainage authority shall hear and consider the testimony presented by all interested parties. The engineer or the engineer's assistant and at least one viewer shall be present. The director may appear and be heard. If the director does not appear personally, the final advisory report shall be read during the hearing. The final hearing may be adjourned and reconvened as is necessary.\nIf the drainage authority determines that the general plan reported by the engineer may be improved by changes, or that the viewers have made an inequitable assessment of benefits or damages to any property, the drainage authority may amend the detailed survey report or the viewers' report, and make necessary and proper findings in relation to the reports. The drainage authority may resubmit matters to the engineer or to the viewers for immediate consideration. The engineer or viewers shall proceed promptly to reconsider the resubmitted matters and shall make and file the amended findings and reports. The amended reports are a part of the original reports.\nIf the drainage authority determines that property not included in the notice should be included and assessed or that the engineer or viewers, or both, should reexamine the proposed drainage project or the property benefited or damaged by the system, the drainage authority may resubmit the reports to the engineer and viewers. If a report is resubmitted, the final hearing may be continued as is necessary to make the reexamination and reexamination report. If the reexamination report includes property not included in the original report, the drainage authority may, by order, adjourn the hearing and direct the auditor to serve or publish, post, and mail a final hearing notice with reference to all property not included in the previous notice. The jurisdiction of the drainage authority continues in the property given proper notice, and new or additional notice is not required for that property.",
	"repealed": false
}