{
	"id": "10A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.09",
	"title": "10A.09 STATEMENTS OF ECONOMIC INTEREST.",
	"text": "An individual must file a statement of economic interest:\n(1) within 60 days of accepting employment as a public official or a local official in a metropolitan governmental unit;\n(2) within 60 days of assuming office as a district court judge, appeals court judge, supreme court justice, or county commissioner;\n(3) within 14 days after filing an affidavit of candidacy or petition to appear on the ballot for an elective state constitutional or legislative office or an elective local office in a metropolitan governmental unit other than county commissioner;\n(4) in the case of a public official requiring the advice and consent of the senate, within 14 days after undertaking the duties of office; or\n(5) in the case of members of the Minnesota Racing Commission, the director of the Minnesota Racing Commission, chief of security, medical officer, inspector of pari-mutuels, and stewards employed or approved by the commission or persons who fulfill those duties under contract, within 60 days of accepting or assuming duties.\nNotwithstanding subdivision 1, a retired judge or justice appointed to serve as a judge or justice under section 2.724 is not required to comply with the provisions of this section.\nThe secretary of state or the appropriate county auditor, upon receiving an affidavit of candidacy or petition to appear on the ballot from an individual required by this section to file a statement of economic interest, and any official who nominates or employs a public official required by this section to file a statement of economic interest, must notify the board of the name of the individual required to file a statement and the date of the affidavit, petition, or nomination.\nThe board must notify the presiding officer of the house that will approve or disapprove the nomination, of the name of an individual who has filed a statement of economic interest with the board, a copy of the statement, and the date on which the statement was filed.\n[Repealed, 1978 c 463 s 109]\n(a) A statement of economic interest required by this section must be on a form prescribed by the board. Except as provided in subdivision 5b, the individual filing must provide the following information:\n(1) the individual's name, address, occupation, and principal place of business;\n(2) a listing of the name of each associated business and the nature of that association;\n(3) a listing of all real property within the state, excluding homestead property, in which the individual or the individual's spouse holds: (i) a fee simple interest, a mortgage, a contract for deed as buyer or seller, or an option to buy, whether direct or indirect, if the interest is valued in excess of $2,500; or (ii) an option to buy, if the property has a fair market value of more than $50,000;\n(4) a listing of all real property within the state in which a partnership of which the individual or the individual's spouse is a member holds: (i) a fee simple interest, a mortgage, a contract for deed as buyer or seller, or an option to buy, whether direct or indirect, if the individual's share of the partnership interest is valued in excess of $2,500; or (ii) an option to buy, if the property has a fair market value of more than $50,000. A listing under this clause or clause (3) must indicate the street address and the municipality or the section, township, range and approximate acreage, whichever applies, and the county in which the property is located;\n(5) a listing of any investments, ownership, or interests in property connected with pari-mutuel horse racing in the United States and Canada, including a racehorse, in which the individual directly or indirectly holds a partial or full interest or an immediate family member holds a partial or full interest;\n(6) a listing of the principal business or professional activity category of each business from which the individual or the individual's spouse receives more than $250 in any month during the reporting period as an employee, if the individual or the individual's spouse has an ownership interest of 25 percent or more in the business;\n(7) a listing of each principal business or professional activity category from which the individual or the individual's spouse received compensation of more than $2,500 in the past 12 months as an independent contractor;\n(8) a listing of the full name of each security with a value of more than $10,000 owned in part or in full by the individual or the individual's spouse, at any time during the reporting period; and\n(9) a listing of any contract, professional license, lease, or franchise that:\n(i) is held by the individual or the individual's spouse or any business in which the individual has an ownership interest of 25 percent or more; and\n(ii) is entered into with, or issued by, the government agency on which the individual serves as a public or local official.\n(b) The business or professional categories for purposes of paragraph (a), clauses (6) and (7), must be the general topic headings used by the federal Internal Revenue Service for purposes of reporting self-employment income on Schedule C. This paragraph does not require an individual to report any specific code number from that schedule. Any additional principal business or professional activity category may only be adopted if the category is enacted by law.\n(c) For the purpose of calculating the amount of compensation received from any single source in a single month, the amount shall include the total amount received from the source during the month, whether or not the amount covers compensation for more than one month.\n(d) For the purpose of determining the value of an individual's interest in real property, the value of the property is the market value shown on the property tax statement.\n(e) For the purpose of this section, \"date of appointment\" means the effective date of appointment to a position.\n(f) For the purpose of this section, \"accepting employment as a public official\" means the effective date of the appointment to the position, as stated in the appointing authority's notice to the board.\n(g) The listings required in paragraph (a), clauses (3) to (9), must not identify whether the individual or the individual's spouse is associated with or owns the listed item.\n(a) An original statement of economic interest required under subdivision 1, clause (1), must cover the calendar month before the month in which the individual accepted employment as a public official or a local official in a metropolitan governmental unit.\n(b) An original statement of economic interest required under subdivision 1, clauses (2), (4), and (5), must cover the calendar month before the month in which the individual assumed or undertook the duties of office.\n(c) An original statement of economic interest required under subdivision 1, clause (3), must cover the calendar month before the month in which the candidate filed the affidavit of candidacy.\n(a) This subdivision applies to the following individuals:\n(1) a supervisor of a soil and water conservation district;\n(2) a manager of a watershed district; and\n(3) a member of a watershed management organization as defined under section 103B.205, subdivision 13.\n(b) Notwithstanding subdivision 5, paragraph (a), an individual listed in paragraph (a), must provide only the information listed below on a statement of economic interest:\n(1) the individual's name, address, occupation, and principal place of business;\n(2) a listing of any association, corporation, partnership, limited liability company, limited liability partnership, or other organized legal entity from which the individual receives compensation in excess of $250, except for actual and reasonable expenses, in any month during the reporting period as a director, officer, owner, member, partner, employer, or employee;\n(3) a listing of all real property within the state, excluding homestead property, in which the individual or the individual's spouse holds:\n(i) a fee simple interest, a mortgage, a contract for deed as buyer or seller, or an option to buy, whether direct or indirect, if the interest is valued in excess of $2,500; or\n(ii) an option to buy, if the property has a fair market value of more than $50,000;\n(4) a listing of all real property within the state in which a partnership of which the individual or the individual's spouse is a member holds:\n(i) a fee simple interest, a mortgage, a contract for deed as buyer or seller, or an option to buy, whether direct or indirect, if the individual's share of the partnership interest is valued in excess of $2,500; or\n(ii) an option to buy, if the property has a fair market value of more than $50,000. A listing under this clause or clause (3) must indicate the street address and the municipality or the section, township, range and approximate acreage, whichever applies, and the county in which the property is located; and\n(5) a listing of any contract, professional license, lease, or franchise that meets the following criteria:\n(i) it is held by the individual or the individual's spouse or any business in which the individual has an ownership interest of 25 percent or more; and\n(ii) it is entered into with, or issued by, the government agency on which the individual serves as a public or local official.\n(c) The listings required in paragraph (b), clauses (3) to (5), must not identify whether the individual or the individual's spouse is associated with or owns the listed item.\n(d) If an individual listed in paragraph (a) also holds a public official position that is not listed in paragraph (a), the individual must file a statement of economic interest that includes the information specified in subdivision 5, paragraph (a).\n(a) Each individual who is required to file a statement of economic interest must also file an annual statement by the last Monday in January of each year that the individual remains in office. The annual statement must cover the period through December 31 of the year prior to the year when the statement is due. The annual statement must include the amount of each honorarium in excess of $250 received since the previous statement and the name and address of the source of the honorarium. The board must maintain each annual statement of economic interest submitted by an officeholder in the same file with the statement submitted as a candidate.\n(b) An individual must file the annual statement of economic interest required by this subdivision to cover the period for which the individual served as a public official even though at the time the statement was filed, the individual is no longer holding that office as a public official.\nA public official required to file a statement under this section must file it with the board. A local official required to file a statement under this section must file it with the governing body of the official's political subdivision. The governing body must maintain statements filed with it under this subdivision as public data. If an official position is defined as both a public official and as a local official of a metropolitan governmental unit under this chapter, the official must file the statement with the board.\nIf an individual fails to file a statement of economic interest required by this section within ten business days after the statement was due, the board may impose a late filing fee of $5 per day, not to exceed $100, commencing on the 11th day after the statement was due. The board must send notice by certified mail to any individual who fails to file a statement within ten business days after the statement was due that the individual may be subject to a civil penalty for failure to file a statement. An individual who fails to file a statement within seven days after the certified mail notice was sent by the board is subject to a civil penalty imposed by the board up to $1,000.\n[Repealed, 2014 c 309 s 25]\nUpon written request and for good cause shown, the board may waive the requirement that an official disclose the address of real property that constitutes a secondary residence of the official.\n[Renumbered 10A.022, subd 6]",
	"repealed": false
}