{
	"id": "138.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.665",
	"title": "138.665 DUTIES OF STATE IN REGARD TO HISTORIC PROPERTIES.",
	"text": "The state, state departments, agencies, and political subdivisions, including the Board of Regents of the University of Minnesota, are by sections 138.661 to 138.664 and by this section notified of the existence of the state historic site network, state register of historic places, and the National Register of Historic Places.\nThe state, state departments, agencies, and political subdivisions, including the Board of Regents of the University of Minnesota, have a responsibility to protect the physical features and historic character of properties designated in sections 138.662 and 138.664 or listed on the National Register of Historic Places created by Public Law 89-665. Before carrying out any undertaking that will affect designated or listed properties, or funding or licensing an undertaking by other parties, the state department or agency shall consult with the State Historic Preservation Office pursuant to the State Historic Preservation Office's established procedures to determine appropriate treatments and to seek ways to avoid and mitigate any adverse effects on designated or listed properties. If the state department or agency and the State Historic Preservation Office agree in writing on a suitable course of action, the project may proceed. If the parties cannot agree, any one of the parties may request that the governor appoint and convene a mediation task force consisting of five members, two appointed by the governor, the chair of the State Review Board of the State Historic Preservation Office, the commissioner of administration or the commissioner's designee, and one member appointed by the director of the Minnesota Historical Society. The two appointees of the governor and of the director of the society shall be qualified by training or experience in one or more of the following disciplines: (1) history; (2) archaeology; and (3) architectural history. The mediation task force is not subject to the conditions of section 15.059. This subdivision does not apply to section 138.662, subdivision 24, and section 138.664, subdivisions 8 and 111.\nIf the state or a governmental subdivision acquires any of the property in section 138.664, it is the duty of the officer in charge of the acquisition to notify in writing, as promptly as possible, the State Historic Preservation Office of the acquisition.\nNeither the state, nor a unit of metropolitan government, nor a political subdivision of the state may take any action that may diminish the flow of water to or from Camp Coldwater Springs. All projects must be reviewed under the Minnesota Historic Sites Act and the Minnesota Field Archaeology Act with regard to the flow of water to or from Camp Coldwater Springs.",
	"repealed": false
}