{
	"id": "462A.209",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.209",
	"title": "462A.209 HOMEOWNERSHIP EDUCATION, COUNSELING, AND TRAINING PROGRAM.",
	"text": "The homeownership education, counseling, and training program shall be used to provide funding to community-based nonprofit organizations and political subdivisions to assist them in building the capacity to provide and providing full cycle homeownership services to low and moderate income home buyers and homeowners, including seniors. The purpose of the program is to encourage private investment in affordable housing and collaboration of nonprofit organizations and political subdivisions with each other and private lenders in providing full cycle homeownership services.\n\"Full cycle homeownership services\" means supporting eligible home buyers and home owners through all phases of purchasing and keeping a home, by providing prepurchase home buyer education; prepurchase counseling and credit repair; prepurchase and postpurchase property inspection and technical and financial assistance to buyers in rehabilitating the home; postpurchase counseling, including home equity conversion loan counseling, mortgage default counseling, postpurchase assistance with home maintenance, entry cost assistance; foreclosure prevention and assistance; and access to flexible loan products.\nThe agency shall establish eligibility criteria for nonprofit organizations and political subdivisions to receive funding under this section. The eligibility criteria must require the nonprofit organization or political subdivision to provide, to build capacity to provide, or support full cycle homeownership services for eligible home buyers. The agency may fund a nonprofit organization or political subdivision that will provide full cycle homeownership services by coordinating with one or more other organizations that will provide specific components of full cycle homeownership services. The agency may make exceptions to providing all components of full cycle lending if justified by the application. If there are more applicants requesting funding than there are funds available, the agency shall award the funds on a competitive basis and also assure an equitable geographic distribution of the available funds. The eligibility criteria must require the nonprofit organization or political subdivision to have a demonstrated involvement in the local community and to target the housing affordability needs of the local community or to have demonstrated experience with counseling older persons on housing, or both. The eligibility criteria may include a requirement for specific training provided by designated state or national entities. The agency may also include an eligibility criteria that requires counselor certification or organizational accreditation by specified organizations which provide certification or accreditation services. Partnerships and collaboration with innovative, grass roots, or community-based initiatives shall be encouraged. The agency shall give priority to nonprofit organizations and political subdivisions that have funding from other sources for full cycle homeownership services. Applicants for funds under section 462A.057 may also apply funds under this program.\nMS 2000 [Repealed, 1Sp2001 c 4 art 5 s 10]\nThe agency shall take the following criteria into consideration when determining whether to award funds to an eligible organization:\n(1) the extent to which there is an equitable geographic distribution of funds among program applicants;\n(2) the prior experience and documented familiarity of the organization, as may be applicable, in establishing, administering, and maintaining some or all of the components of full cycle homeownership services;\n(3) the reasonableness of the proposed budget in meeting the program objectives, a demonstrated ability to leverage program money with other sources of funding, and the extent of the leveraging of other sources of funding;\n(4) the extent to which efforts are targeted towards households with incomes that do not exceed 80 percent of the state or area median income or underserved segments of the local population; and\n(5) the extent to which program funding does not duplicate other efforts currently available in the local area and will enable, expand, or enhance existing activities.\nA program administrator must designate specific areas, communities, or neighborhoods within which the program is proposed to be operated for the purpose of focusing resources.\n(a) Program assistance and counseling to prevent mortgage foreclosures or cancellations of contract for deeds includes general information, screening, assessment, referral services, case management, advocacy, and financial assistance to borrowers who are delinquent on mortgage or contract for deed payments.\n(b) Not more than one-half of funds awarded for foreclosure prevention and assistance activities may be used for mortgage or financial counseling services.\n(c) Financial assistance consists of payments for delinquent mortgage or contract for deed payments, future mortgage or contract for deed payments for a period of up to six months, property taxes, assessments, utilities, insurance, home improvement repairs, future rent payments for a period of up to six months, and relocation costs if necessary, or other costs necessary to prevent foreclosure.\n(d) The maximum amount of financial assistance an individual or family may receive to prevent a mortgage foreclosure or the cancellation of a contract for deed is 110 percent of the greater of state or applicable metropolitan statistical area median monthly owner cost of owner-occupied housing, as estimated by the United States Census Bureau using data collected in the most recent American Community Survey, multiplied by six.\n(e) The agency may require the recipient of financial assistance to enter into an agreement with the agency for repayment. The repayment agreement for mortgages or contract for deed buyers must provide that in the event the property is sold, transferred, or otherwise conveyed, or ceases to be the recipient's principal place of residence, the recipient shall repay all or a portion of the financial assistance. The agency may take into consideration financial hardship in determining repayment requirements. The repayment agreement may be secured by a lien on the property for the benefit of the agency.\nMS 2022 [Repealed, 2024 c 127 art 15 s 54]",
	"repealed": false
}