{
	"id": "256.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.042",
	"title": "256.042 OPIATE EPIDEMIC RESPONSE ADVISORY COUNCIL.",
	"text": "(a) The Opiate Epidemic Response Advisory Council is established to develop and implement a comprehensive and effective statewide effort to address the opioid addiction and overdose epidemic in Minnesota. The council shall focus on:\n(1) prevention and education, including public education and awareness for adults and youth, prescriber education, the development and sustainability of opioid overdose prevention and education programs, the role of adult protective services in prevention and response, and providing financial support to local law enforcement agencies for opiate antagonist programs;\n(2) training on the treatment of opioid addiction, including the use of all Food and Drug Administration approved opioid addiction medications, detoxification, relapse prevention, patient assessment, individual treatment planning, counseling, recovery supports, diversion control, and other best practices;\n(3) the expansion and enhancement of a continuum of care for opioid-related substance use disorders, including primary prevention, early intervention, treatment, recovery, and aftercare services; and\n(4) the development of measures to assess and protect the ability of cancer patients and survivors, persons battling life-threatening illnesses, persons suffering from severe chronic pain, and persons at the end stages of life, who legitimately need prescription pain medications, to maintain their quality of life by accessing these pain medications without facing unnecessary barriers. The measures must also address the needs of individuals described in this clause who are elderly or who reside in underserved or rural areas of the state.\n(b) The council shall:\n(1) review local, state, and federal initiatives and activities related to education, prevention, treatment, and services for individuals and families experiencing and affected by opioid use disorder;\n(2) establish priorities to address the state's opioid epidemic, for the purpose of recommending initiatives to fund;\n(3) recommend to the commissioner of human services specific projects and initiatives to be funded;\n(4) ensure that available funding is allocated to align with other state and federal funding, to achieve the greatest impact and ensure a coordinated state effort;\n(5) consult with the commissioners of human services, health, and management and budget to develop measurable outcomes to determine the effectiveness of funds allocated;\n(6) develop recommendations for an administrative and organizational framework for the allocation, on a sustainable and ongoing basis, of any money deposited into the separate account under section 16A.151, subdivision 2, paragraph (f), in order to address the opioid abuse and overdose epidemic in Minnesota and the areas of focus specified in paragraph (a);\n(7) review reports, data, and performance measures submitted by municipalities under subdivision 5;\n(8) consult with relevant stakeholders, including lead agencies and municipalities, to review and provide recommendations for necessary revisions to the reporting requirements under subdivision 5 to ensure that the required reporting accurately measures progress in addressing the harms of the opioid epidemic; and\n(9) meet with each of the 11 federally recognized Minnesota Tribal Nations individually on an annual basis in order to collaborate and communicate on shared issues and priorities.\n(c) The council, in consultation with the commissioner of management and budget, and within available appropriations, shall select from projects awarded grants under section 256.043, subdivisions 3 and 3a, and municipality projects funded by direct payments received as part of a statewide opioid settlement agreement, that include promising practices or theory-based activities for which the commissioner of management and budget shall conduct evaluations using experimental or quasi-experimental design. Grant proposals and municipality projects that include promising practices or theory-based activities and are selected for an evaluation shall be administered to support the experimental or quasi-experimental evaluation. Grantees and municipalities shall collect and report information that is needed to complete the evaluation. The commissioner of management and budget, under section 15.08, may obtain additional relevant data to support the experimental or quasi-experimental evaluation studies.\n(d) The council, in consultation with the commissioners of human services, health, public safety, and management and budget, shall establish goals related to addressing the opioid epidemic and determine a baseline against which progress shall be monitored and set measurable outcomes, including benchmarks. The goals established must include goals for prevention and public health, access to treatment, and multigenerational impacts. The council shall use existing measures and data collection systems to determine baseline data against which progress shall be measured. The council shall include the proposed goals, the measurable outcomes, and proposed benchmarks to meet these goals in its initial report to the legislature under subdivision 5, paragraph (a), due January 31, 2021.\n(a) The council shall consist of the following 20 voting members, appointed by the commissioner of human services except as otherwise specified, and three nonvoting members:\n(1) two members of the house of representatives, appointed in the following sequence: the first from the majority party appointed by the speaker of the house and the second from the minority party appointed by the minority leader. Of these two members, one member must represent a district outside of the seven-county metropolitan area, and one member must represent a district that includes the seven-county metropolitan area. The appointment by the minority leader must ensure that this requirement for geographic diversity in appointments is met;\n(2) two members of the senate, appointed in the following sequence: the first from the majority party appointed by the senate majority leader and the second from the minority party appointed by the senate minority leader. Of these two members, one member must represent a district outside of the seven-county metropolitan area and one member must represent a district that includes the seven-county metropolitan area. The appointment by the minority leader must ensure that this requirement for geographic diversity in appointments is met;\n(3) one member appointed by the Board of Pharmacy;\n(4) one member who is a physician appointed by the Minnesota Medical Association;\n(5) one member representing opioid treatment programs, sober living programs, or substance use disorder programs licensed under chapter 245G;\n(6) one member appointed by the Minnesota Society of Addiction Medicine who is an addiction psychiatrist;\n(7) one member representing professionals providing alternative pain management therapies, including, but not limited to, acupuncture, chiropractic, or massage therapy;\n(8) one member representing nonprofit organizations conducting initiatives to address the opioid epidemic, with the commissioner's initial appointment being a member representing the Steve Rummler Hope Network, and subsequent appointments representing this or other organizations;\n(9) one member appointed by the Minnesota Ambulance Association who is serving with an ambulance service as an emergency medical technician, advanced emergency medical technician, or paramedic;\n(10) one member representing the Minnesota courts who is a judge or law enforcement officer;\n(11) one public member who is a Minnesota resident and who is in opioid addiction recovery;\n(12) two members representing Indian tribes, one representing the Ojibwe tribes and one representing the Dakota tribes;\n(13) one member representing an urban American Indian community;\n(14) one public member who is a Minnesota resident and who is suffering from chronic pain, intractable pain, or a rare disease or condition;\n(15) one mental health advocate representing persons with mental illness;\n(16) one member appointed by the Minnesota Hospital Association;\n(17) one member representing a local health department; and\n(18) the commissioners of human services, health, and corrections, or their designees, who shall be ex officio nonvoting members of the council.\n(b) The commissioner of human services shall coordinate the commissioner's appointments to provide geographic, racial, and gender diversity, and shall ensure that at least one-third of council members appointed by the commissioner reside outside of the seven-county metropolitan area. Of the members appointed by the commissioner, to the extent practicable, at least one member must represent a community of color disproportionately affected by the opioid epidemic.\n(c) The council is governed by section 15.059, except that members of the council shall serve three-year terms and shall receive no compensation other than reimbursement for expenses. Notwithstanding section 15.059, subdivision 6, the council shall not expire.\n(d) The chair shall convene the council at least quarterly, and may convene other meetings as necessary. The chair shall convene meetings at different locations in the state to provide geographic access, and shall ensure that at least one-half of the meetings are held at locations outside of the seven-county metropolitan area.\n(e) The commissioner of human services shall provide staff and administrative services for the advisory council.\n(f) The council is subject to chapter 13D.\nAdvisory council members must disclose to the council, refrain from participating in discussions, and recuse themselves from voting on any matter before the council if the member has a conflict of interest. A conflict of interest means a financial association that has the potential to bias or have the appearance of biasing a council member's decision related to the opiate epidemic response grant decision process or other council activities under this section.\n(a) The commissioner of human services shall submit a report of the grants proposed by the advisory council to be awarded for the upcoming calendar year to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance, by December 1 of each year, beginning December 1, 2022. This paragraph expires upon the expiration of the advisory council.\n(b) The grants shall be awarded to proposals selected by the advisory council that address the priorities in subdivision 1, paragraph (a), clauses (1) to (4), unless otherwise appropriated by the legislature. The advisory council shall determine grant awards and funding amounts based on the funds appropriated to the commissioner under section 256.043, subdivision 3, paragraph (n), and subdivision 3a, paragraph (d). The commissioner shall award the grants from the opiate epidemic response fund and administer the grants in compliance with section 16B.97. No more than ten percent of the grant amount may be used by a grantee for administration.\n(a) The advisory council shall report annually to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance by January 31 of each year. The report shall include information about the individual projects that receive grants, the municipality projects funded by direct payments received as part of a statewide opioid settlement agreement, and the overall role of the project in addressing the opioid addiction and overdose epidemic in Minnesota. The report must describe the grantees and municipalities and the activities implemented, along with measurable outcomes as determined by the council in consultation with the commissioner of human services and the commissioner of management and budget. At a minimum, the report must include information about the number of individuals who received information or treatment, the outcomes the individuals achieved, and demographic information about the individuals participating in the project; an assessment of the progress toward achieving statewide access to qualified providers and comprehensive treatment and recovery services; and an update on the evaluations implemented by the commissioner of management and budget for the promising practices and theory-based projects that receive funding.\n(b) The commissioner of management and budget, in consultation with the Opiate Epidemic Response Advisory Council, shall report to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance when an evaluation study described in subdivision 1, paragraph (c), is complete on the promising practices or theory-based projects that are selected for evaluation activities. The report shall include demographic information; outcome information for the individuals in the program; the results for the program in promoting recovery, employment, family reunification, and reducing involvement with the criminal justice system; and other relevant outcomes determined by the commissioner of management and budget that are specific to the projects that are evaluated. The report shall include information about the ability of grant programs to be scaled to achieve the statewide results that the grant project demonstrated.\n(c) The advisory council, in its annual report to the legislature under paragraph (a) due by January 31, 2024, shall include recommendations on whether the appropriations to the specified entities under Laws 2019, chapter 63, should be continued, adjusted, or discontinued; whether funding should be appropriated for other purposes related to opioid abuse prevention, education, and treatment; and on the appropriate level of funding for existing and new uses.\n(d) Municipalities receiving direct payments from a statewide opioid settlement agreement must report annually to the commissioner of human services on how the payments were used on opioid remediation. The report must be submitted in a format prescribed by the commissioner. The report must include data and measurable outcomes on expenditures funded with direct payments from a statewide opioid settlement agreement, including details on services listed in the categories of approved uses, as identified in agreements between the state of Minnesota, the Association of Minnesota Counties, and the League of Minnesota Cities. Reporting requirements must include, at a minimum:\n(1) contact information;\n(2) information on funded services and programs; and\n(3) target populations for each funded service and program.\n(e) In reporting data and outcomes under paragraph (d), municipalities must include, to the extent feasible, information on the use of evidence-based and culturally relevant services.\n(f) For municipal projects using $25,000 or more of statewide opioid settlement agreement payments in a calendar year, municipalities must also include in the report required under paragraph (d):\n(1) a brief qualitative description of successes or challenges; and\n(2) results using process and quality measures.\n(g) This subdivision expires upon the expiration of the advisory council.\n(a) For purposes of this section, the following definitions apply.\n(b) \"Municipality\" has the meaning provided in section 466.01, subdivision 1.\n(c) \"Statewide opioid settlement agreement\" means an agreement as defined in section 3.757, subdivision 1, paragraph (f), involving a settling defendant as defined in section 3.757, subdivision 1, paragraph (e).",
	"repealed": false
}