{
	"id": "325E.068",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.068",
	"title": "325E.068 DEFINITIONS.",
	"text": "For the purposes of sections 325E.068 to 325E.0684, the terms defined in this section have the meanings given them.\n\"Heavy and utility equipment,\" \"heavy equipment,\" or \"equipment\" means equipment and parts for equipment including but not limited to:\n(1) excavators, crawler tractors, wheel loaders, compactors, pavers, backhoes, hydraulic hammers, cranes, fork lifts, compressors, generators, attachments and repair parts for them, and other equipment, including attachments and repair parts, used in all types of construction of buildings, highways, airports, dams, or other earthen structures or in moving, stock piling, or distribution of materials used in such construction;\n(2) trucks and truck parts; or\n(3) equipment used for, or adapted for use in, mining or forestry applications.\n\"Heavy and utility equipment manufacturer,\" \"heavy equipment manufacturer,\" or \"equipment manufacturer\" means a person, partnership, corporation, association, or other form of business enterprise engaged in the manufacturing, assembly, or wholesale distribution of heavy and utility equipment as defined in subdivision 2. The term also includes a successor in interest of the heavy and utility equipment manufacturer, including a purchaser of assets or stock, a surviving corporation resulting from a merger or liquidation, a receiver or assignee, or a trustee of the original equipment manufacturer.\n\"Heavy and utility equipment dealer\" or \"heavy and utility equipment dealership\" means a person, partnership, corporation, association, or other form of business enterprise engaged in the business of acquiring heavy and utility equipment from a manufacturer and reselling the heavy and utility equipment at wholesale or retail.\n\"Dealership agreement\" means an oral or written agreement of definite or indefinite duration between an equipment manufacturer and an equipment dealer that enables the dealer to purchase heavy and utility equipment from the manufacturer and provides for the rights and obligations of the parties with respect to the purchase or sale of heavy and utility equipment.\n\"Truck\" means a motor vehicle designed and used for carrying things other than passengers, a truck-tractor as defined in section 168.002, subdivision 38, and a semitrailer as defined in section 168.002, subdivision 30. \"Truck\" does not include a pickup truck or van with a manufacturer's nominal rated carrying capacity of three-fourths ton or less.\n\"Truck parts\" means all parts of a truck, including body parts.",
	"repealed": false
}