{
	"id": "62S.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.05",
	"title": "62S.05 PREEXISTING CONDITION.",
	"text": "A long-term care insurance policy or certificate, other than a policy or certificate issued to a group as defined in section 62S.01, subdivision 15, clause (1), may not use a definition of preexisting condition that is more restrictive than the definition in this subdivision. \"Preexisting condition\" means a condition for which medical advice or treatment was recommended by, or received from a provider of health care services, within six months before the effective date of coverage of an insured person.\nA long-term care insurance policy or certificate, other than a policy or certificate issued to a group as defined in section 62S.01, subdivision 15, clause (1), may not exclude coverage for a loss or confinement that is the result of a preexisting condition more than six months following the effective date of coverage of an insured person.\nThe definition of preexisting condition does not prohibit an insurer from using an application form designed to elicit the complete health history of an applicant and, on the basis of the answers on that application, from underwriting according to that insurer's established underwriting standards. Unless otherwise provided in the policy or certificate, a preexisting condition, regardless of whether it is disclosed on the application, need not be covered until the waiting period described in subdivision 2 expires. A long-term care insurance policy or certificate may not exclude or use waivers of any kind to exclude, limit, or reduce coverage or benefits for specifically named or described preexisting diseases or physical conditions beyond the waiting period described in subdivision 2.\nThe commissioner may extend the limitation periods set forth in subdivisions 1 and 2 as to specific age group categories in specific policy forms upon finding that the extension is in the best interest of the public.",
	"repealed": false
}