{
	"id": "352.931",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.931",
	"title": "352.931 SURVIVOR BENEFITS.",
	"text": "(a) If the correctional employee was at least age 50, was vested under section 352.925, and dies before an annuity or disability benefit has become payable, notwithstanding any designation of beneficiary to the contrary, the surviving spouse of the employee may elect to receive, in lieu of the refund under section 352.12, subdivision 1, an annuity for life equal to the joint and 100 percent survivor annuity which the employee could have qualified for had the employee terminated service on the date of death. The election may be made at any time after the date of death of the employee. The surviving spouse benefit begins to accrue as of the first of the month next following the date on which the application for the benefit was filed.\n(b) If the employee was under age 50, dies, and was vested under section 352.925, but did not yet qualify for retirement, the surviving spouse may elect to receive a 100 percent joint and survivor annuity based on the age of the employee and surviving spouse at the time of death. The annuity is payable using the early retirement reduction under section 352.93, subdivision 2a, to age 50, and one-half of the early retirement reduction from age 50 to the age payment begins. The surviving spouse eligible for surviving spouse benefits under this paragraph may apply for the annuity at any time after the employee's death. Sections 352.22, subdivision 3, and 352.72, subdivision 2, apply to a deferred annuity or surviving spouse benefit payable under this subdivision.\n(c) The annuity must cease with the last payment received by the surviving spouse in the lifetime of the surviving spouse. Any employee may request in writing, with the signed consent of the spouse, that this subdivision not apply and that payment be made only to a designated beneficiary as otherwise provided by this chapter.\nIn lieu of the 100 percent optional annuity under subdivision 1, the surviving spouse of a deceased employee may elect to receive survivor coverage in a term certain of ten, 15, or 20 years. The monthly term certain annuity must be actuarially equivalent to the 100 percent optional annuity under subdivision 1 and must be approved by the actuary retained under section 356.214. The optional annuity ceases upon the expiration of the term certain period. If a survivor elects a term certain annuity and dies before the expiration of the specified term certain period, the commuted value of the remaining annuity payments must be paid in a lump sum to the survivor's estate.\nIf there is no surviving spouse eligible for benefits under subdivision 1, a dependent child as defined in section 352.01, subdivision 26, is eligible for a dependent child survivor benefit. Benefits to a dependent child must be paid from the date of the employee's death to the date the dependent child attains age 20 if the child is under age 15 on the date of death. If the child is 15 years or older on the date of death, the benefit is payable for five years. The payment to a dependent child is an amount actuarially equivalent to the value of a 100 percent joint and survivor optional annuity using the age of the employee and age of the dependent child at the date of death in lieu of the age of the surviving spouse. If there is more than one dependent child, each dependent child shall receive a proportionate share of the actuarial value of the employee's account, with the amount of the benefit payable to each child to be determined based on the portion of the total eligibility period that each child is eligible. The process for calculating the dependent child survivor benefit must be approved by the actuary retained under section 356.214.\nAn amount equal to the excess, if any, of the accumulated contributions credited to the account of the deceased employee in excess of the total of the benefits paid to the surviving spouse and surviving child or children must be paid to the deceased employee's last designated beneficiary or, if none, as specified under section 352.12, subdivision 1.\nThe benefit elections under this section must be made on an application form prescribed by the executive director and must be filed with the executive director.\nA survivor benefit under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}