{
	"id": "97C.376",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.376",
	"title": "97C.376 BOW FISHING.",
	"text": "(a) The regular bow-fishing season for residents and nonresidents is from May 1 through the last day in February at any time of the day.\n(b) The early bow-fishing season for residents and nonresidents is open only south of State Highway 210 from March 1 through the last day in April at any time of the day. During the early season, a person may bow fish:\n(1) only from a boat; and\n(2) only while on a lake or on the Mississippi, Minnesota, or St. Croix River.\nA person may possess bows and arrows for the purposes of bow fishing on or within 100 feet of waters at any time from the last Saturday in April to the last Sunday in February and at other times on lakes and rivers south of State Highway 210 as specified in subdivision 1, paragraph (b), subject to local ordinances. A person must take reasonable measures to retrieve arrows and wounded fish.\n(a) From sunset to sunrise, the noise limits for total noise while bow fishing must not exceed a noise level of 65 decibels on the A scale measured at a distance of 50 feet from the motorboat or equivalent noise levels at other distances as specified by the commissioner in a pass-by test.\n(b) The noise limits under paragraph (a) shall be determined under a test procedure approved by the commissioner under section 86B.321, subdivision 2.\n(c) The noise limits in paragraph (a) do not preclude enforcement of other laws relating to motorboat noise.\n(d) The noise levels under section 86B.321 apply to persons traveling to and from bow-fishing sites from sunset to sunrise.\nA person shall not discharge an arrow while bow fishing within 150 feet of an occupied structure or within 300 feet of a campsite from sunset to sunrise.\nNative rough fish and common carp taken by bow fishing must not be returned to the water, and native rough fish and common carp may not be left on the banks of any water of the state.",
	"repealed": false
}