{
	"id": "168.1255",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1255",
	"title": "168.1255 \"PROUD TO BE A VETERAN\" PLATE.",
	"text": "The commissioner shall issue special veteran contribution plates or a single motorcycle plate to an applicant who:\n(1) is a veteran, as defined in section 197.447;\n(2) is a registered owner of a passenger automobile as defined in section 168.002, subdivision 24, recreational vehicle as defined in section 168.002, subdivision 27, one-ton pickup truck as defined in section 168.002, subdivision 21b, or motorcycle as defined in section 168.002, subdivision 19;\n(3) pays a fee in the amount specified for special plates under section 168.12, subdivision 5;\n(4) pays the registration tax required under section 168.013;\n(5) pays the fees required under this chapter;\n(6) pays an additional onetime World War II memorial contribution of $30, which the department shall retain until all start-up costs associated with the development and issuing of the plates have been recovered, after which the commissioner shall deposit contributions in the World War II donation match account; and\n(7) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\nA motorcycle plate issued under this section must be the same size as a regular motorcycle plate.\nThe commissioner of veterans affairs shall design an emblem for the special plates, subject to the approval of the commissioner of public safety, that satisfies the requirements in this subdivision:\n(1) the special veteran contribution plates must bear the inscription \"PROUD TO BE A VETERAN\" on the bottom of the plate; and\n(2) the flag of the United States of America must appear on the left side of the plate just preceding the first letter or numeral of the special plate number.\nDespite section 168.12, subdivision 1, on payment of a transfer fee of $5, plates issued under this section may be transferred to another passenger automobile registered to the individual to whom the veteran contribution plates were issued, or a single motorcycle plate may be transferred to another motorcycle registered to the individual to whom the plate was issued.\nFees collected under this section do not include the contributions collected for the World War II memorial donation match account.\nThe commissioner shall maintain a record of the number of special plates issued under this section.\nMoney remaining in the World War II memorial donation match account after the state share of the construction costs of the World War II memorial has been paid in full is appropriated to the commissioner of veterans affairs for services and programs for veterans and their families.",
	"repealed": false
}