{
	"id": "89.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.66",
	"title": "89.66 FORESTRY RESEARCH AND EXTENSION.",
	"text": "(a) The director of the state agricultural experiment station at the University of Minnesota is authorized to conduct, support and cooperate in research activities deemed necessary to obtain scientific information about forest resources. Activities conducted under this section shall include, but not be limited to, the following:\n(1) forest resources management research, including activities related to managing, reproducing and growing forest vegetation for forest resources purposes;\n(2) forest environmental research, including activities related to management of watersheds, controlling erosion, improving wildlife habitats, reducing water and air pollution and related purposes;\n(3) forest protection research, including activities related to protection of forest vegetation from fire, insects, diseases, animals, noxious plants, and air pollutants;\n(4) forest utilization research, including activities related to harvesting, transportation, marketing, and utilization of wood; and\n(5) forest resource assessment research, including activities required to inventory and survey the type and extent of forest resources.\n(b) To ensure efficient and effective accomplishment of forest research goals and objectives, the director of the state agricultural experiment station shall cooperate with other public and with private forestry organizations seeking scientific forestry information through research, and provide to the commissioner appropriate forest research results in the development and implementation of the forest resources management policy and plan.\n(a) The director of the Agricultural Extension Service at the University of Minnesota is authorized to conduct, support, and cooperate in forestry extension activities including, but not limited to, the following:\n(1) providing educational programs that will enable individuals to recognize and capture opportunities for managing forests for purposes of recreation, timber, water, wildlife, forage, and other purposes;\n(2) using educational programs to disseminate the results of forestry research;\n(3) providing for the forestry educational needs of the private, nonindustrial forest landowner;\n(4) assisting in providing continuing education programs for professionally trained resource managers;\n(5) providing educational programs that will enhance in harvesting, processing, and marketing of wood;\n(6) assisting in the identification of topics in need of forestry research.\n(b) In implementing this subdivision, all appropriate educational methods may be used.\n(c) To ensure efficient and effective accomplishment of forestry extension goals and objectives, the director of the state extension service shall cooperate with the commissioner in the development and implementation of the forest resources management policy and plan, and shall encourage close cooperation between forestry extension staffs in county, state, and federal service, and between personnel involved in forestry research and land management in all public and private agencies.",
	"repealed": false
}