{
	"id": "356.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.215",
	"title": "356.215 ACTUARIAL VALUATIONS AND EXPERIENCE STUDIES.",
	"text": "(a) For the purposes of sections 3.85 and 356.20 to 356.23, each of the terms in the following paragraphs has the meaning given.\n(b) \"Actuarial valuation\" means a set of calculations prepared by an actuary retained under section 356.214 if so required under section 3.85, or otherwise, by an approved actuary, to determine the normal cost and the accrued actuarial liabilities of a benefit plan, according to the entry age actuarial cost method and based upon stated assumptions including, but not limited to rates of interest, mortality, salary increase, disability, withdrawal, and retirement and to determine the payment necessary to amortize over a stated period any unfunded accrued actuarial liability disclosed as a result of the actuarial valuation of the benefit plan.\n(c) \"Approved actuary\" means:\n(1) a person who is regularly engaged in the business of providing actuarial services and who is a fellow in the Society of Actuaries; or\n(2) a firm that retains a person described in clause (1) on its staff.\n(d) \"Entry age actuarial cost method\" means an actuarial cost method under which the actuarial present value of the projected benefits of each individual currently covered by the benefit plan and included in the actuarial valuation is allocated on a level basis over the service of the individual, if the benefit plan is governed by section 424A.093, or over the earnings of the individual, if the benefit plan is governed by any other law, between the entry age and the assumed exit age, with the portion of the actuarial present value which is allocated to the valuation year to be the normal cost and the portion of the actuarial present value not provided for at the valuation date by the actuarial present value of future normal costs to be the actuarial accrued liability, with aggregation in the calculation process to be the sum of the calculated result for each covered individual and with recognition given to any different benefit formulas which may apply to various periods of service.\n(e) \"Experience study\" means a report providing experience data and an actuarial analysis of the adequacy of the actuarial assumptions on which actuarial valuations are based.\n(f) \"Actuarial value of assets\" means the market value of all assets as of the preceding June 30, reduced by:\n(1) 20 percent of the difference between the actual net change in the market value of total assets between the June 30 that occurred three years earlier and the June 30 that occurred four years earlier and the computed increase in the market value of total assets over that fiscal year period if the assets had earned a rate of return on assets equal to the annual percentage investment return assumption used in the actuarial valuation for the July 1 that occurred four years earlier;\n(2) 40 percent of the difference between the actual net change in the market value of total assets between the June 30 that occurred two years earlier and the June 30 that occurred three years earlier and the computed increase in the market value of total assets over that fiscal year period if the assets had earned a rate of return on assets equal to the annual percentage investment return assumption used in the actuarial valuation for the July 1 that occurred three years earlier;\n(3) 60 percent of the difference between the actual net change in the market value of total assets between the June 30 that occurred one year earlier and the June 30 that occurred two years earlier and the computed increase in the market value of total assets over that fiscal year period if the assets had earned a rate of return on assets equal to the annual percentage investment return assumption used in the actuarial valuation for the July 1 that occurred two years earlier; and\n(4) 80 percent of the difference between the actual net change in the market value of total assets between the most recent June 30 and the June 30 that occurred one year earlier and the computed increase in the market value of total assets over that fiscal year period if the assets had earned a rate of return on assets equal to the annual percentage investment return assumption used in the actuarial valuation for the July 1 that occurred one year earlier.\n(g) \"Unfunded actuarial accrued liability\" means the total current and expected future benefit obligations, reduced by the sum of the actuarial value of assets and the present value of future normal costs.\n(h) \"Pension benefit obligation\" means the actuarial present value of credited projected benefits, determined as the actuarial present value of benefits estimated to be payable in the future as a result of employee service attributing an equal benefit amount, including the effect of projected salary increases and any step rate benefit accrual rate differences, to each year of credited and expected future employee service.\n(a) It is the policy of the legislature that it is necessary and appropriate to determine annually the financial status of tax-supported retirement and pension plans for public employees. To achieve this goal, the actuary retained under section 356.214 shall prepare annual actuarial valuations, as of the beginning of each fiscal year, of the retirement plans enumerated in section 356.214, subdivision 1, paragraph (b), and quadrennial experience studies of the retirement plans enumerated in section 356.214, subdivision 1, paragraph (b), clauses (1), (2), and (6).\n(b) The governing board or executive director of each public pension and retirement plan enumerated in section 356.20, subdivision 2, clauses (7), (9), and (10), shall have prepared by an approved actuary annual actuarial valuations of their respective funds as provided in this section. This requirement also applies to any plan that is the successor to any organization enumerated in section 356.20, subdivision 2, or to the governing board or chief administrative officer of any newly formed retirement fund, plan, or association operating under the control or supervision of any public employee group, governmental unit, or institution receiving a portion of its support through legislative appropriations, and any local police or fire relief association to which section 356.216 applies.\n[Repealed, 2008 c 349 art 10 s 18]\n(a) The governing board or executive director of each public pension plan required to prepare an annual valuation under subdivision 2 must deliver the annual valuation to the executive director of the Legislative Commission on Pensions and Retirement, the commissioner of management and budget, and the Legislative Reference Library no later than the last day of the sixth month occurring after the end of the previous fiscal year. The annual valuation may be delivered by email.\n(b) The governing board or executive director of each public pension plan required to prepare a quadrennial experience study under subdivision 2 must deliver the quadrennial experience study to the executive director of the Legislative Commission on Pensions and Retirement, the commissioner of management and budget, and the Legislative Reference Library, no later than the last day of the 12th month occurring after the end of the last fiscal year of the four-year period covered by the experience study. The quadrennial experience study may be delivered by email.\n(a) The actuarial valuation must be made in conformity with the requirements of the definition contained in subdivision 1 and the most recent standards for actuarial work adopted by the Legislative Commission on Pensions and Retirement.\n(b) The actuarial valuation must measure all aspects of the benefit plan of the fund in accordance with changes in benefit plans, if any, and salaries reasonably anticipated to be in force during the ensuing fiscal year. The actuarial valuation must be prepared in accordance with the entry age actuarial cost method. The actuarial valuation required under this section must include the information required in subdivisions 5 to 15.\n[Renumbered subd 5]\n[Renumbered subd 6]\n[Renumbered subd 7]\n[Renumbered subd 8]\n[Renumbered subd 9]\n[Renumbered subd 10]\n[Renumbered subd 11]\n[Renumbered subd 12]\n[Renumbered subd 13]\n[Renumbered subd 14]\n[Renumbered subd 15]\nMS 2000 [Renumbered subd 16]\nFor a fund providing benefits in whole or in part under a defined benefit plan, the actuarial valuation must indicate the level normal cost of the benefits provided under the laws governing the fund as of the date of the valuation, calculated in accordance with the entry age actuarial cost method. The normal cost must be expressed as a level percentage of the present value of future payrolls of the active participants of the fund as of the date of the valuation.\nMS 2000 [Renumbered subd 17]\nFor a fund providing benefits under a defined benefit plan, the actuarial valuation must contain an exhibit indicating the actuarial accrued liabilities of the fund. This figure is the present value of future benefits reduced by the present value of future normal costs, calculated in accordance with the entry age actuarial cost method.\nMS 2000 [Renumbered subd 18]\nFor each fund providing benefits under a money purchase or defined contribution plan, the actuarial valuation must contain an exhibit indicating the member contributions accumulated at interest, as apportioned to members accounts, to the date of the valuation. These accumulations must be separately tabulated in a manner which properly reflects any differences in money purchase or defined contribution annuity rates which may apply.\n(a) The actuarial valuation must use the applicable following investment return assumption:\n(b) The actuarial valuation for each of the covered retirement plans listed in section 356.415, subdivision 2, and the St. Paul Teachers Retirement Fund Association must take into account the postretirement adjustment rate or rates applicable to the plan as specified in section 354A.29, subdivision 7, or 356.415, whichever applies.\n(c) The actuarial valuation must use the applicable salary increase and payroll growth assumptions found in the appendix to the standards for actuarial work adopted by the Legislative Commission on Pensions and Retirement pursuant to section 3.85, subdivision 10. The appendix must be updated whenever new assumptions have been approved or deemed approved under subdivision 18.\n(d) The assumptions set forth in the appendix to the standards for actuarial work continue to apply, unless a different salary assumption or a different payroll increase assumption:\n(1) has been proposed by the governing board of the applicable retirement plan;\n(2) is accompanied by the concurring recommendation of the actuary retained under section 356.214, subdivision 1, if applicable, or by the approved actuary preparing the most recent actuarial valuation report if section 356.214 does not apply; and\n(3) has been approved or deemed approved under subdivision 18.\n(a) Each plan's actuarial valuation must use assumptions concerning base mortality rates, disability, retirement, withdrawal, retirement age, and any other relevant demographic or economic factor. These assumptions must be set at levels consistent with those determined in the most recent quadrennial experience study completed under subdivision 16, if required, or as recommended by the plan's approved actuary, if a quadrennial experience study is not required.\n(b) The actuarial valuation may use an assumption concerning future mortality improvement. This assumption may be set at levels consistent with those determined in the most recent mortality improvement scale published by the Society of Actuaries or as otherwise recommended by the plan's approved actuary.\n(c) The actuarial valuation must contain an exhibit indicating the actuarial assumptions used in preparing the valuation report.\nThe actuarial valuation must contain those actuarial calculations that are necessary to allow the retirement plan administration or participating employing units to prepare the pension-related portions of annual financial reporting that meet generally accepted accounting principles for the public sector.\n(a) In addition to the exhibit indicating the level normal cost, the actuarial valuation of the retirement plan must contain an exhibit for financial reporting purposes indicating the additional annual contribution sufficient to amortize the unfunded actuarial accrued liability and must contain an exhibit indicating the additional contribution sufficient to amortize the unfunded actuarial accrued liability. For the retirement plans listed in subdivision 8, paragraph (a), but excluding the legislators retirement plan, the Bloomington Fire Department Relief Association, and the local monthly benefit volunteer firefighter relief associations, the additional contribution must be calculated on a level percentage of covered payroll basis by the established date for full funding in effect when the valuation is prepared, assuming annual payroll growth at the applicable percentage rate set forth in the appendix described in subdivision 8, paragraph (c). For the legislators retirement plan, the additional annual contribution must be calculated on a level annual dollar amount basis.\n(b) This paragraph applies only if the calculation under this paragraph for a retirement plan results in an established date for full funding that is earlier than the established date for full funding applicable to the retirement plan under paragraph (c). For any retirement plan, if there has been a change in any or all of the actuarial assumptions used for calculating the actuarial accrued liability of the fund, a change in the benefit plan governing annuities and benefits payable from the fund, a change in the actuarial cost method used in calculating the actuarial accrued liability of all or a portion of the fund, or a combination of the three, and the change or changes, by itself or by themselves and without inclusion of any other items of increase or decrease, produce a net increase in the unfunded actuarial accrued liability in the fund, the established date for full funding must be determined using the following procedure:\n(i) the unfunded actuarial accrued liability of the fund must be determined in accordance with the plan provisions governing annuities and retirement benefits and the actuarial assumptions in effect before an applicable change;\n(ii) the level annual dollar contribution or level percentage, whichever is applicable, needed to amortize the unfunded actuarial accrued liability amount determined under item (i) by the established date for full funding in effect before the change must be calculated using the investment return assumption specified in subdivision 8 in effect before the change;\n(iii) the unfunded actuarial accrued liability of the fund must be determined in accordance with any new plan provisions governing annuities and benefits payable from the fund and any new actuarial assumptions and the remaining plan provisions governing annuities and benefits payable from the fund and actuarial assumptions in effect before the change;\n(iv) the level annual dollar contribution or level percentage, whichever is applicable, needed to amortize the difference between the unfunded actuarial accrued liability amount calculated under item (i) and the unfunded actuarial accrued liability amount calculated under item (iii) over a period of 30 years from the end of the plan year in which the applicable change is effective must be calculated using the applicable investment return assumption specified in subdivision 8 in effect after any applicable change;\n(v) the level annual dollar or level percentage amortization contribution under item (iv) must be added to the level annual dollar amortization contribution or level percentage calculated under item (ii);\n(vi) the period in which the unfunded actuarial accrued liability amount determined in item (iii) is amortized by the total level annual dollar or level percentage amortization contribution computed under item (v) must be calculated using the investment return assumption specified in subdivision 8 in effect after any applicable change, rounded to the nearest integral number of years, but not to exceed 30 years from the end of the plan year in which the determination of the established date for full funding using the procedure set forth in this clause is made and not to be less than the period of years beginning in the plan year in which the determination of the established date for full funding using the procedure set forth in this clause is made and ending by the date for full funding in effect before the change; and\n(vii) the period determined under item (vi) must be added to the date as of which the actuarial valuation was prepared and the date obtained is the new established date for full funding.\n(c) The established date for full funding is the date provided for each of the following plans:\n(i) for the general employees retirement plan of the Public Employees Retirement Association, the established date for full funding is June 30, 2048;\n(ii) for the Teachers Retirement Association, the established date for full funding is June 30, 2048;\n(iii) for the correctional state employees retirement plan and the State Patrol retirement plan of the Minnesota State Retirement System, the established date for full funding is June 30, 2048;\n(iv) for the judges retirement plan, the established date for full funding is June 30, 2048;\n(v) for the local government correctional service retirement plan and the public employees police and fire retirement plan, the established date for full funding is June 30, 2048;\n(vi) for the St. Paul Teachers Retirement Fund Association, the established date for full funding is June 30, 2048; and\n(vii) for the general state employees retirement plan of the Minnesota State Retirement System, the established date for full funding is June 30, 2048.\n(d) For the retirement plans for which the annual actuarial valuation indicates an excess of valuation assets over the actuarial accrued liability, the valuation assets in excess of the actuarial accrued liability must be recognized as a reduction in the current contribution requirements by an amount equal to the amortization of the excess expressed as a level percentage of pay over a 30-year period beginning anew with each annual actuarial valuation of the plan.\nThe actuarial valuation must contain an exhibit consisting of an analysis by the actuary explaining the net increase or decrease in the unfunded actuarial accrued liability since the last valuation. The explanation must subdivide the net increase or decrease in the unfunded actuarial accrued liability into at least the following parts:\n(1) increases or decreases in the unfunded actuarial accrued liability because of changes in benefits;\n(2) increases and decreases in the unfunded actuarial accrued liability because of changes in actuarial assumptions;\n(3) increases or decreases in the unfunded actuarial accrued liability attributable to actuarial gains or losses resulting from any experience deviations from the assumptions on which the valuation is based, as follows:\n(i) actual investment earnings;\n(ii) actual postretirement mortality rates;\n(iii) actual salary increase rates; and\n(iv) the remainder of the increase or decrease not attributable to any separate source;\n(4) increases or decreases in unfunded actuarial accrued liability because of other reasons, including the effect of any amortization contribution paid or additional amortization contribution previously calculated but unpaid; and\n(5) increases or decreases in unfunded actuarial accrued liability because of changes in eligibility requirements or groups included in the membership of the fund.\n(a) The actuarial valuation must contain a tabulation of active membership and annuitants in the fund. If the membership of a fund is under more than one general benefit program, a separate tabulation must be made for each general benefit program.\n(b) The tabulations must be prepared by the administration of the pension fund and must contain the following information:\n(c) The tabulation required under paragraph (b), clause (2), must be made separately for each of the following classes of benefit recipients:\n(1) service retirement annuitants;\n(2) disability benefit recipients;\n(3) survivor benefit recipients; and\n(4) deferred annuitants.\n(a) The actuarial valuation must indicate the administrative expenses of the fund, expressed both in dollars and as a percentage of covered payroll.\n(b) Administrative expenses are the costs incurred by the retirement plans in the course of operating the plan, excluding investment expenses. Investment expenses include all expenses incurred for the retention of professional external investment managers and professional investment consultants, custodian bank fees, investment transaction costs, and the costs incurred by the retirement plans to manage investment portfolios or assets internally. Investment expenses must be deducted from the investment return used in the actuarial valuation, and must not be included in administrative expenses when calculating the allowance for expenses.\nThe actuarial valuation must contain a summary of the principal provisions of the benefit plan upon which the valuation is based.\nA quadrennial experience study, if required, must contain an analysis by the approved actuary of the experience of the fund and a comparison of the experience with the actuarial assumptions on which the most recent actuarial valuation of the retirement fund was based.\n(a) The actuarial valuation or quadrennial experience study must be made and any actuarial consulting services for a retirement fund or plan must be provided by an approved actuary. The actuarial valuation or quadrennial experience study must include a signed written declaration that it has been prepared according to sections 356.20 to 356.23 and according to the most recent standards for actuarial work adopted by the Legislative Commission on Pensions and Retirement.\n(b) Actuarial valuations or experience studies prepared by an approved actuary retained by a retirement fund or plan must be submitted to the Legislative Commission on Pensions and Retirement within ten days of the submission of the document to the retirement fund or plan.\n(a) The actuarial assumptions used for the preparation of actuarial valuations under this section that are other than the interest rate may be changed only with the approval of the Legislative Commission on Pensions and Retirement or after a period of one year has elapsed since the date on which the proposed assumption change or changes were received by the Legislative Commission on Pensions and Retirement without commission action.\n(b) A change in the applicable actuarial assumptions may be proposed by the governing board of the applicable pension fund or relief association, by an actuary retained under section 356.214 or by the actuary retained by a local relief association governed by sections 424A.091 to 424A.096 or by Laws 2013, chapter 111, article 5, sections 31 to 42, if one is retained.",
	"repealed": false
}