{
	"id": "611A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.08",
	"title": "611A.08 BARRING PERPETRATORS OF CRIMES FROM RECOVERING FOR INJURIES SUSTAINED DURING CRIMINAL CONDUCT.",
	"text": "As used in this section:\n(1) \"perpetrator\" means a person who has engaged in criminal conduct and includes a person convicted of a crime;\n(2) \"victim\" means a person who was the object of another's criminal conduct and includes a person at the scene of an emergency who gives reasonable assistance to another person who is exposed to or has suffered grave physical harm;\n(3) \"course of criminal conduct\" includes the acts or omissions of a victim in resisting criminal conduct; and\n(4) \"convicted\" includes a finding of guilt, whether or not the adjudication of guilt is stayed or executed, an unwithdrawn judicial admission of guilt or guilty plea, a no contest plea, a judgment of conviction, an adjudication as a delinquent child, an admission to a juvenile delinquency petition, or a disposition as an extended jurisdiction juvenile.\nA perpetrator assumes the risk of loss, injury, or death resulting from or arising out of a course of criminal conduct involving a violent crime, as defined in this section, engaged in by the perpetrator or an accomplice, as defined in section 609.05, and the crime victim is immune from and not liable for any civil damages as a result of acts or omissions of the victim if the victim used reasonable force as authorized in section 609.06 or 609.065.\nNotwithstanding other evidence which the victim may adduce relating to the perpetrator's conviction of the violent crime involving the parties to the civil action, a certified copy of: a guilty plea; a court judgment of guilt; a court record of conviction as specified in section 599.24, 599.25, or 609.041; an adjudication as a delinquent child; or a disposition as an extended jurisdiction juvenile pursuant to section 260B.130 is conclusive proof of the perpetrator's assumption of the risk.\nIf the perpetrator does not prevail in a civil action that is subject to this section, the court may award reasonable expenses, including attorney's fees and disbursements, to the victim.\nExcept to the extent needed to preserve evidence, any civil action in which the defense set forth in subdivision 1 or 2 is raised shall be stayed by the court on the motion of the defendant during the pendency of any criminal action against the plaintiff based on the alleged violent crime.\nFor purposes of this section, \"violent crime\" means an offense named in sections 609.185; 609.19; 609.195; 609.20; 609.205; 609.221; 609.222; 609.223; 609.2231; 609.24; 609.245; 609.247; 609.25; 609.255; 609.342; 609.343; 609.344; 609.345; 609.3458; 609.561; 609.562; 609.563; and 609.582, or an attempt to commit any of these offenses. \"Violent crime\" includes crimes in other states or jurisdictions which would have been within the definition set forth in this subdivision if they had been committed in this state.",
	"repealed": false
}