{
	"id": "325F.721",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.721",
	"title": "325F.721 PROVISION OF \"I'M OKAY\" CHECK SERVICES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Covered setting\" means an unlicensed setting providing sleeping accommodations to one or more adult residents, at least 80 percent of which are 55 years of age or older, and offering or providing, for a fee, supportive services. For the purposes of this section, covered setting does not mean:\n(1) emergency shelter, transitional housing, or any other residential units serving exclusively or primarily homeless individuals, as defined under section 116L.361;\n(2) a nursing home licensed under chapter 144A;\n(3) a hospital, certified boarding care, or supervised living facility licensed under sections 144.50 to 144.56;\n(4) a lodging establishment licensed under chapter 157 and Minnesota Rules, parts 9520.0500 to 9520.0670, or under chapter 245D, 245G, or 245I;\n(5) services and residential settings licensed under chapter 245A, including adult foster care and services and settings governed under the standards in chapter 245D;\n(6) private homes in which the residents are related by kinship, law, or affinity with the providers of services;\n(7) a duly organized condominium, cooperative, and common interest community, or owners' association of the condominium, cooperative, and common interest community where at least 80 percent of the units that comprise the condominium, cooperative, or common interest community are occupied by individuals who are the owners, members, or shareholders of the units;\n(8) temporary family health care dwellings as defined in sections 394.307 and 462.3593;\n(9) settings offering services conducted by and for the adherents of any recognized church or religious denomination for its members exclusively through spiritual means or by prayer for healing;\n(10) housing financed pursuant to sections 462A.37 and 462A.375, units financed with low-income housing tax credits pursuant to United States Code, title 26, section 42, and units financed by the Minnesota Housing Finance Agency that are intended to serve individuals with disabilities or individuals who are homeless, except for those developments that market or hold themselves out as assisted living facilities and provide assisted living services;\n(11) rental housing developed under United States Code, title 42, section 1437, or United States Code, title 12, section 1701q;\n(12) rental housing designated for occupancy by only elderly or elderly and disabled residents under United States Code, title 42, section 1437e, or rental housing for qualifying families under Code of Federal Regulations, title 24, section 983.56;\n(13) rental housing funded under United States Code, title 42, chapter 89, or United States Code, title 42, section 8011; or\n(14) an assisted living facility licensed under chapter 144G.\n(c) \"'I'm okay' check services\" means providing a service to, by any means, check on the safety of a resident.\n(d) \"Resident\" means a person entering into written contract for housing and services with a covered setting.\n(e) \"Supportive services\" means:\n(1) assistance with laundry, shopping, and household chores;\n(2) housekeeping services;\n(3) provision of meals or assistance with meals or food preparation;\n(4) help with arranging, or arranging transportation to, medical, social, recreational, personal, or social services appointments; or\n(5) provision of social or recreational services.\nArranging for services does not include making referrals or contacting a service provider in an emergency.\n[See Note.]\n(a) A covered setting must prominently disclose in a written contract whether or not the setting itself or through a provider with which the setting has a business agreement offers \"I'm okay\" check services.\n(b) If the resident contracts for \"I'm okay\" check services, the written contract must detail the nature, extent, and frequency of the provision of these services.\n(c) A covered setting must disclose to prospective residents that the facility is not licensed as an assisted living facility under chapter 144G and, notwithstanding any contract for \"I'm okay\" check services, is not permitted to provide assisted living services, as defined in section 144G.08, subdivision 9, either directly or through a provider under a business relationship or other affiliation with the covered setting.",
	"repealed": false
}