{
	"id": "97B.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.045",
	"title": "97B.045 TRANSPORTING FIREARMS.",
	"text": "A person may not transport a firearm in a motor vehicle unless the firearm is:\n(1) unloaded and in a gun case expressly made to contain a firearm, and the case fully encloses the firearm by being zipped, snapped, buckled, tied, or otherwise fastened, and without any portion of the firearm exposed;\n(2) unloaded and in the closed trunk of a motor vehicle; or\n(3) a handgun carried in compliance with sections 624.714 and 624.715.\nThe restrictions in subdivision 1 do not apply to a disabled person if:\n(1) the person possesses a permit under section 97B.055, subdivision 3; and\n(2) the firearm is not loaded in the chamber until the vehicle is stationary, or is a hinge action firearm with the action open until the vehicle is stationary.\n(a) Notwithstanding provisions to the contrary under this chapter, a person may transport an unloaded, uncased firearm, excluding a pistol as defined in paragraph (b), in a motor vehicle while at a shooting range, as defined under section 87A.01, subdivision 3, where the person has received permission from the lawful owner or possessor to discharge firearms; lawfully hunting on private or public land; or traveling to or from a site the person intends to hunt lawfully that day or has hunted lawfully that day, unless:\n(1) within Anoka, Hennepin, or Ramsey County;\n(2) within the boundaries of a home rule charter or statutory city with a population of 2,500 or more;\n(3) on school grounds; or\n(4) otherwise restricted under section 97A.091, 97B.081, or 97B.086.\n(b) For the purposes of this section, a \"pistol\" includes a weapon designed to be fired by the use of a single hand and with an overall length less than 26 inches, or having a barrel or barrels of a length less than 18 inches in the case of a shotgun or having a barrel of a length less than 16 inches in the case of a rifle:\n(1) from which may be fired or ejected one or more solid projectiles by means of a cartridge or shell or by the action of an explosive or the igniting of flammable or explosive substances; or\n(2) for which the propelling force is a spring, elastic band, carbon dioxide, air or other gas, or vapor.\nPistol does not include a device firing or ejecting a shot measuring .18 of an inch, or less, in diameter and commonly known as a \"BB gun,\" a scuba gun, a stud gun or nail gun used in the construction industry, or children's pop guns or toys.",
	"repealed": false
}