{
	"id": "62Q.526",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.526",
	"title": "62Q.526 COVERAGE FOR PARTICIPATION IN APPROVED CLINICAL TRIALS.",
	"text": "(a) As used in this section, the following definitions apply:\n(b) \"Approved clinical trial\" means a phase I, phase II, phase III, or phase IV clinical trial that is conducted in relation to the prevention, detection, or treatment of cancer or a life-threatening condition and is not designed exclusively to test toxicity or disease pathophysiology and must be:\n(1) conducted under an investigational new drug application reviewed by the United States Food and Drug Administration (FDA);\n(2) exempt from obtaining an investigational new drug application; or\n(3) approved or funded by:\n(i) the National Institutes of Health (NIH), the Centers for Disease Control and Prevention, the Agency for Health Care Research and Quality, the Centers for Medicare and Medicaid Services, or a cooperating group or center of any of the entities described in this item;\n(ii) a cooperative group or center of the United States Department of Defense or the United States Department of Veterans Affairs;\n(iii) a qualified nongovernmental research entity identified in the guidelines issued by the NIH for center support grants; or\n(iv) the United States Departments of Veterans Affairs, Defense, or Energy if the trial has been reviewed or approved through a system of peer review determined by the secretary to:\n(A) be comparable to the system of peer review of studies and investigations used by the NIH; and\n(B) provide an unbiased scientific review by qualified individuals who have no interest in the outcome of the review.\n(c) \"Qualified individual\" means an individual with health plan coverage who is eligible to participate in an approved clinical trial according to the trial protocol for the treatment of cancer or a life-threatening condition because:\n(1) the referring health care professional is participating in the trial and has concluded that the individual's participation in the trial would be appropriate; or\n(2) the individual provides medical and scientific information establishing that the individual's participation in the trial is appropriate because the individual meets the conditions described in the trial protocol.\n(d)(1) \"Routine patient costs\" includes all items and services covered by the health benefit plan of individual market health insurance coverage when the items or services are typically covered for an enrollee who is not a qualified individual enrolled in an approved clinical trial.\n(2) Routine patient costs does not include:\n(i) an investigational item, device, or service that is part of the trial;\n(ii) an item or service provided solely to satisfy data collection and analysis needs for the trial if the item or service is not used in the direct clinical management of the patient;\n(iii) a service that is clearly inconsistent with widely accepted and established standards of care for the individual's diagnosis; or\n(iv) an item or service customarily provided and paid for by the sponsor of a trial.\nA health plan company that offers a health plan to a Minnesota resident may not:\n(1) deny participation by a qualified individual in an approved clinical trial;\n(2) deny, limit, or impose additional conditions on the coverage of routine patient costs for items or services furnished in connection with participation in the trial; or\n(3) discriminate against an individual on the basis of an individual's participation in an approved clinical trial.\nA health plan company that designates a network or networks of contracted providers may require a qualified individual who wishes to participate in an approved clinical trial to participate in a trial that is offered through a health care provider who is part of the plan's network if the provider is participating in the trial and the provider accepts the individual as a participant in the trial.\nThis section applies to a qualified individual residing in this state who participates in an approved clinical trial that is conducted outside of this state.\n(a) This section shall not be construed to require a health plan company offering health plan coverage through a network or networks of contracted providers to provide benefits for routine patient costs if the services are provided outside of the plan's network unless the out-of-network benefits are otherwise provided under the coverage.\n(b) This section shall not be construed to limit a health plan company's coverage with respect to clinical trials.\n(c) This section shall apply to all health plan companies offering a health plan to a Minnesota resident, unless otherwise amended by federal regulations under the Affordable Care Act.",
	"repealed": false
}