{
	"id": "175.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/175.46",
	"title": "175.46 YOUTH SKILLS TRAINING PROGRAM.",
	"text": "The commissioner shall approve youth skills training programs established for the purpose of providing work-based skills training for student learners ages 16 and older. The commissioner shall award grants to local partnerships for the implementation and coordination of local youth skills training programs as provided in this section.\n(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"School district\" means a school district or charter school.\n(c) \"Local partnership\" means a school district, nonpublic school, intermediate school district, or postsecondary institution, in partnership with other school districts, nonpublic schools, intermediate school districts, postsecondary institutions, workforce development authorities, economic development authorities, nonprofit organizations, labor unions, or individuals who have an agreement with one or more local employers to be responsible for implementing and coordinating a local youth skills training program.\n(d) \"Student learner\" means a student who is both enrolled in a course of study at a public or nonpublic school to obtain related instruction for academic credit and is employed under a written agreement to obtain on-the-job skills training under a youth skills training program approved under this section.\n(e) \"Commissioner\" means the commissioner of labor and industry.\n(a) The commissioner shall:\n(1) approve youth skills training programs that train student learners for careers in high-growth, high-demand occupations that provide:\n(i) that the work of the student learner in the occupations declared particularly hazardous shall be incidental to the training;\n(ii) that the work shall be intermittent and for short periods of time, and under the direct and close supervision of a qualified and experienced person;\n(iii) that safety instruction shall be provided to the student learner and may be given by the school and correlated by the employer with on-the-job training;\n(iv) a schedule of organized and progressive work processes to be performed on the job;\n(v) a schedule of wage rates in compliance with section 177.24; and\n(vi) whether the student learner will obtain secondary school academic credit, postsecondary credit, or both, for the training program;\n(2) approve occupations and maintain a list of approved occupations for programs under this section;\n(3) issue requests for proposals for grants;\n(4) work with individuals representing industry and labor to develop new youth skills training programs;\n(5) develop model program guides;\n(6) monitor youth skills training programs;\n(7) provide technical assistance to local partnership grantees;\n(8) work with providers to identify paths for receiving postsecondary credit for participation in the youth skills training program; and\n(9) approve other activities as necessary to implement the program.\n(b) The commissioner shall collaborate with stakeholders, including, but not limited to, representatives of secondary school institutions, career and technical education instructors, postsecondary institutions, businesses, and labor, in developing youth skills training programs, and identifying and approving occupations and competencies for youth skills training programs.\nEach student learner shall sign a written training agreement on a form prescribed by the commissioner. Each agreement shall contain the name of the student learner, and be signed by the employer, the school coordinator or administrator, and the student learner, or if the student learner is a minor, by the student's parent or legal guardian. Copies of each agreement shall be kept on file by both the school and the employer.\nThe commissioner may grant exemptions from the provisions of chapter 181A for student learners participating in youth skills training programs approved by the commissioner under this section. The approval of a youth skills training program will be reviewed annually. The approval of a youth skills training program may be revoked at any time if the commissioner finds that:\n(1) all provisions of subdivision 3 have not been met in the previous year; or\n(2) reasonable precautions have not been observed for the safety of minors.\nThe commissioner shall maintain and annually update a list of occupations and tasks suitable for student learners in compliance with federal law.\n(a) For the purpose of computing state aids for the enrolling school district, the hours a student learner participates in a youth skills training program under this section must be counted in the student's hours of average daily membership under section 126C.05.\n(b) Educational expenses for a participating student learner must be included in the enrolling district's career and technical revenue as provided under section 124D.4531.\nA school district may grant academic credit to student learners participating in youth skills training programs under this section in accordance with local requirements.\nA postsecondary institution may award postsecondary credit to a student learner who successfully completes a youth skills training program.\nA youth skills training program shall qualify as a work-based learning program if it meets requirements for a career and technical education program and is supervised by a qualified teacher with appropriate licensure for a work-based learning teacher-coordinator.\nUnless otherwise required for a work-based learning program, a youth skills training program may be supervised by a qualified teacher or by an administrator as determined by the school district.\n(a) This section shall not affect programs under section 124D.47.\n(b) A registered apprenticeship program governed by chapter 178 may grant credit toward the completion of a registered apprenticeship for the successful completion of a youth skills training program under this section.\n(a) Applications for grants must be made to the commissioner on a form provided by the commissioner.\n(b) A local partnership may apply for a grant and shall include in its grant application:\n(1) the identity of each school district, public agency, nonprofit organization, or individual who is a participant in the local partnership;\n(2) the identity of each employer who is a participant in the local partnership and the amount of matching funds provided by each employer, if any;\n(3) a plan to accomplish the implementation and coordination of activities specified in this subdivision; and\n(4) the identity of a fiscal agent responsible for receiving, managing, and accounting for the grant.\n(a) The commissioner shall award grants to local partnerships for youth skills training programs that train student learners for careers in high-growth, high-demand occupations. Grant awards may not exceed $100,000 per local partnership grant.\n(b) A local partnership awarded a grant under this section must use the grant award for any of the following implementation and coordination activities:\n(1) recruiting additional employers to provide on-the-job training and supervision for student learners and providing technical assistance to those employers;\n(2) recruiting students to participate in the local youth skills training program, monitoring the progress of student learners participating in the program, and monitoring program outcomes;\n(3) coordinating youth skills training activities within participating school districts and among participating school districts, postsecondary institutions, and employers;\n(4) coordinating academic, vocational and occupational learning, school-based and work-based learning, and secondary and postsecondary education for participants in the local youth skills training program;\n(5) coordinating transportation for student learners participating in the local youth skills training program; and\n(6) any other implementation or coordination activity that the commissioner may direct or permit the local partnership to perform.\n(c) Grant awards may not be used to directly or indirectly pay the wages of a student learner.\nThe following outcomes are expected of a local youth skills training program:\n(1) at least 80 percent of the student learners who participate in a youth skills training program receive a high school diploma when eligible upon completion of the training program; and\n(2) at least 60 percent of the student learners who participate in a youth skills training program receive a recognized credential upon completion of the training program.\n(a) By February 1, 2019, and annually thereafter, the commissioner shall report on the activity and outcomes of the program for the preceding fiscal year to the chairs of the legislative committees with jurisdiction over jobs and economic growth policy and finance. At a minimum, the report must include:\n(1) the number of student learners who commenced the training program and the number who completed the training program; and\n(2) recommendations, if any, for changes to the program.\n(b) The initial report shall include a detailed description of the differences between the state and federal systems in child safety standards.",
	"repealed": false
}