{
	"id": "609.771",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.771",
	"title": "609.771 USE OF DEEP FAKE TECHNOLOGY TO INFLUENCE ELECTION.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Candidate\" means an individual who seeks nomination or election to a federal, statewide, legislative, judicial, or local office including special districts, school districts, towns, home rule charter and statutory cities, and counties.\n(c) \"Deep fake\" means any video recording, motion-picture film, sound recording, electronic image, or photograph, or any technological representation of speech or conduct substantially derivative thereof:\n(1) that is so realistic that a reasonable person would believe it depicts speech or conduct of an individual who did not in fact engage in such speech or conduct; and\n(2) the production of which was substantially dependent upon technical means, rather than the ability of another individual to physically or verbally impersonate such individual.\n(d) \"Depicted individual\" means an individual in a deep fake who appears to be engaging in speech or conduct in which the individual did not engage.\n(a) A person who disseminates a deep fake or enters into a contract or other agreement to disseminate a deep fake is guilty of a crime and may be sentenced as provided in subdivision 3 if the person knows or acts with reckless disregard about whether the item being disseminated is a deep fake and dissemination:\n(1) is made without the consent of the depicted individual;\n(2) is made with the intent to injure a candidate or influence the result of an election; and\n(3) takes place either:\n(i) within 90 days before a political party nominating convention; or\n(ii) after the start of the absentee voting period prior to a presidential nomination primary, or a regular or special state or local primary or general election.\n(b) This subdivision does not apply to a broadcaster or cable television system that disseminates a deep fake produced by a candidate if the broadcaster's or cable television system's dissemination is required by federal law.\n(a) A person convicted of violating subdivision 2 may be sentenced as follows:\n(1) if the person commits the violation within five years of one or more prior convictions under this section, to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both;\n(2) if the person commits the violation with the intent to cause violence or bodily harm, to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both; or\n(3) in other cases, to imprisonment for not more than 90 days or to payment of a fine of not more than $1,000, or both.\n(b) In the case of a candidate for state or local office convicted of violating subdivision 2, the court must enter a supplemental judgment declaring that the candidate has forfeited the nomination or office in accordance with section 211B.17.\n(c) A candidate for state or local office or other individual convicted of violating subdivision 2 is disqualified from being appointed to that office or any other office for which the legislature may establish qualifications under the Minnesota Constitution, article XII, section 3, in accordance with section 211B.18.\nA cause of action for injunctive or equitable relief may be maintained against any person who is reasonably believed to be about to violate or who is in the course of violating this section by:\n(1) the attorney general;\n(2) a county attorney or city attorney;\n(3) the depicted individual; or\n(4) a candidate for nomination or election to a public office who is injured or likely to be injured by dissemination.",
	"repealed": false
}