{
	"id": "120B.307",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.307",
	"title": "120B.307 COLLEGE AND CAREER READINESS.",
	"text": "For purposes of statewide accountability, \"career and college ready\" means a high school graduate has the knowledge, skills, and competencies to successfully pursue a career pathway, including postsecondary credit leading to a degree, diploma, certificate, or industry-recognized credential and employment. Students who are career and college ready are able to successfully complete credit-bearing coursework at a two- or four-year college or university or other credit-bearing postsecondary program without need for remediation.\nExpectations of schools, districts, and the state for career or college readiness under this subdivision must be comparable in rigor, clarity of purpose, and rates of student completion.\nThe commissioner and the chancellor of the Minnesota State Colleges and Universities must collaborate in aligning instruction and assessments for adult basic education students and English learners to provide the students with diagnostic information about any targeted interventions, accommodations, modifications, and supports they need so that assessments and other performance measures are accessible to them and they may seek postsecondary education or employment without need for postsecondary remediation. When administering formative or summative assessments used to measure the academic progress, including the oral academic development, of English learners and inform their instruction, schools must ensure that the assessments are accessible to the students and students have the modifications and supports they need to sufficiently understand the assessments.\n(a) Districts and schools, on an annual basis, must use career exploration elements to help students, beginning no later than grade 9, and their families explore and plan for postsecondary education or careers based on the students' interests, aptitudes, and aspirations. Districts and schools must use timely regional labor market information and partnerships, among other resources, to help students and their families successfully develop, pursue, review, and revise an individualized plan for postsecondary education or a career. This process must help increase students' engagement in and connection to school, improve students' knowledge and skills, and deepen students' understanding of career pathways as a sequence of academic and career courses that lead to an industry-recognized credential, an associate's degree, or a bachelor's degree and are available to all students, whatever their interests and career goals.\n(b) A student who demonstrates attainment of required state academic standards, which include career and college readiness benchmarks, on high school assessments under subdivision 1a is academically ready for a career or college and is encouraged to participate in courses awarding college credit to high school students. Such courses and programs may include sequential courses of study within broad career areas and technical skill assessments that extend beyond course grades.\n(c) In developing, supporting, and improving students' academic readiness for a career or college, schools, districts, and the state must have a continuum of empirically derived, clearly defined benchmarks focused on students' attainment of knowledge and skills so that students, their parents, and teachers know how well students must perform to have a reasonable chance to succeed in a career or college without need for postsecondary remediation. The commissioner, in consultation with local school officials and educators, and Minnesota's public postsecondary institutions must ensure that the foundational knowledge and skills for students' successful performance in postsecondary employment or education and an articulated series of possible targeted interventions are clearly identified and satisfy Minnesota's postsecondary admissions requirements.\n(d) For students in grade 8 in the 2012-2013 school year and later, a school, district, or charter school must record on the high school transcript a student's progress toward career and college readiness, and for other students as soon as practicable.\n(e) The school board granting students their diplomas may formally decide to include a notation of high achievement on the high school diplomas of those graduating seniors who, according to established school board criteria, demonstrate exemplary academic achievement during high school.",
	"repealed": false
}