{
	"id": "62Q.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.73",
	"title": "62Q.73 EXTERNAL REVIEW OF ADVERSE DETERMINATIONS.",
	"text": "For purposes of this section, \"adverse determination\" means:\n(1) for individual health plans, a complaint decision relating to a health care service or claim that is partially or wholly adverse to the complainant;\n(2) an individual health plan that is grandfathered plan coverage may instead apply the definition of adverse determination for group coverage in clause (3);\n(3) for group health plans, a complaint decision relating to a health care service or claim that has been appealed in accordance with section 62Q.70 and the appeal decision is partially or wholly adverse to the complainant;\n(4) any adverse determination, as defined in section 62M.02, subdivision 1a, that has been appealed in accordance with section 62M.06 and the appeal did not reverse the adverse determination;\n(5) a decision relating to a health care service made by a health plan company licensed under chapter 60A that denies the service on the basis that the service was not medically necessary;\n(6) the enrollee has met the requirements of subdivision 6, paragraph (e); or\n(7) a decision relating to a health plan's coverage of nonparticipating provider services as described in and subject to section 62Q.556, subdivision 1, paragraph (a).\nAn adverse determination does not include complaints relating to fraudulent marketing practices or agent misrepresentation.\n(a) This section does not apply to governmental programs except as permitted under paragraph (b). For purposes of this subdivision, \"governmental programs\" means the prepaid medical assistance program; effective January 1, 2026, the medical assistance fee-for-service program; the MinnesotaCare program; the demonstration project for people with disabilities; and the federal Medicare program.\n(b) In the course of a recipient's appeal of a medical determination to the commissioner of human services under section 256.045, the recipient may request an expert medical opinion be arranged by the external review entity under contract to provide independent external reviews under this section. If such a request is made, the cost of the review shall be paid by the commissioner of human services. Any medical opinion obtained under this paragraph shall only be used by a state human services judge as evidence in the recipient's appeal to the commissioner of human services under section 256.045.\n(c) Nothing in this subdivision shall be construed to limit or restrict the appeal rights provided in section 256.045 for governmental program recipients.\n(a) Any enrollee or anyone acting on behalf of an enrollee who has received an adverse determination may submit a written request for an external review of the adverse determination, if applicable under section 62Q.68, subdivision 1, or 62M.06, to the commissioner of health if the request involves a health plan company regulated by that commissioner or to the commissioner of commerce if the request involves a health plan company regulated by that commissioner. Notification of the enrollee's right to external review must accompany the denial issued by the insurer.\n(b) Nothing in this section requires the commissioner of health or commerce to independently investigate an adverse determination referred for independent external review.\n(c) If an enrollee requests an external review, the health plan company must participate in the external review. The cost of the external review must be borne by the health plan company.\n(d) The enrollee must request external review within six months from the date of the adverse determination.\nPursuant to a request for proposal, the commissioner of administration, in consultation with the commissioners of health and commerce, shall contract with at least three organizations or business entities to provide independent external reviews of all adverse determinations submitted for external review. The contract shall ensure that the fees for services rendered in connection with the reviews are reasonable.\nThe request for proposal must require that the entity demonstrate:\n(1) no conflicts of interest in that it is not owned, a subsidiary of, or affiliated with a health plan company, utilization review organization, or a trade organization of health care providers;\n(2) an expertise in dispute resolution;\n(3) an expertise in health-related law;\n(4) an ability to conduct reviews using a variety of alternative dispute resolution procedures depending upon the nature of the dispute;\n(5) an ability to maintain written records, for at least three years, regarding reviews conducted and provide data to the commissioners of health and commerce upon request on reviews conducted;\n(6) an ability to ensure confidentiality of medical records and other enrollee information;\n(7) accreditation by nationally recognized private accrediting organization; and\n(8) the ability to provide an expedited external review process.\n(a) Upon receiving a request for an external review, the commissioner shall assign an external review entity on a random basis. The assigned external review entity must provide immediate notice of the review to the enrollee and to the health plan company. Within ten business days of receiving notice of the review, the health plan company and the enrollee must provide the assigned external review entity with any information that they wish to be considered. Each party shall be provided an opportunity to present its version of the facts and arguments. The assigned external review entity must furnish to the health plan company any additional information submitted by the enrollee within one business day of receipt. An enrollee may be assisted or represented by a person of the enrollee's choice.\n(b) As part of the external review process, any aspect of an external review involving a medical determination must be performed by a health care professional with expertise in the medical issue being reviewed.\n(c) An external review shall be made as soon as practical but in no case later than 45 days after receiving the request for an external review and must promptly send written notice of the decision and the reasons for it to the enrollee, the health plan company, and the commissioner who is responsible for regulating the health plan company.\n(d) The external review entity and the clinical reviewer assigned must not have a material professional, familial, or financial conflict of interest with:\n(1) the health plan company that is the subject of the external review;\n(2) the enrollee, or any parties related to the enrollee, whose treatment is the subject of the external review;\n(3) any officer, director, or management employee of the health plan company;\n(4) a plan administrator, plan fiduciaries, or plan employees;\n(5) the health care provider, the health care provider's group, or practice association recommending treatment that is the subject of the external review;\n(6) the facility at which the recommended treatment would be provided; or\n(7) the developer or manufacturer of the principal drug, device, procedure, or other therapy being recommended.\n(e)(1) An expedited external review must be provided if the enrollee requests it after receiving:\n(i) an adverse determination that involves a medical condition for which the time frame for completion of an expedited internal appeal would seriously jeopardize the life or health of the enrollee or would jeopardize the enrollee's ability to regain maximum function and the enrollee has simultaneously requested an expedited internal appeal;\n(ii) an adverse determination that concerns an admission, availability of care, continued stay, or health care service for which the enrollee received emergency services but has not been discharged from a facility; or\n(iii) an adverse determination that involves a medical condition for which the standard external review time would seriously jeopardize the life or health of the enrollee or jeopardize the enrollee's ability to regain maximum function.\n(2) The external review entity must make its expedited determination to uphold or reverse the adverse determination as expeditiously as possible but within no more than 72 hours after the receipt of the request for expedited review and notify the enrollee and the health plan company of the determination.\n(3) If the external review entity's notification is not in writing, the external review entity must provide written confirmation of the determination within 48 hours of the notification.\n(a) For an external review of any issue in an adverse determination that does not require a medical necessity determination, the external review must be based on whether the adverse determination was in compliance with the enrollee's health benefit plan or section 62Q.556, subdivision 1, paragraph (a).\n(b) For an external review of any issue in an adverse determination by a health plan company licensed under chapter 62D that requires a medical necessity determination, the external review must determine whether the adverse determination was consistent with the definition of medically necessary care in Minnesota Rules, part 4685.0100, subpart 9b.\n(c) For an external review of any issue in an adverse determination by a health plan company, other than a health plan company licensed under chapter 62D, that requires a medical necessity determination, the external review must determine whether the adverse determination was consistent with the definition of medically necessary care in section 62Q.53, subdivision 2.\n(d) For an external review of an adverse determination involving experimental or investigational treatment, the external review entity must base its decision on all documents submitted by the health plan company and enrollee, including:\n(1) medical records;\n(2) the recommendation of the attending physician, advanced practice registered nurse, physician assistant, or health care professional;\n(3) consulting reports from health care professionals;\n(4) the terms of coverage;\n(5) federal Food and Drug Administration approval; and\n(6) medical or scientific evidence or evidence-based standards.\nA decision rendered under this section shall be nonbinding on the enrollee and binding on the health plan company. The health plan company may seek judicial review of the decision on the grounds that the decision was arbitrary and capricious or involved an abuse of discretion.\nA person who participates in an external review by investigating, reviewing materials, providing technical expertise, or rendering a decision shall not be civilly liable for any action that is taken in good faith, that is within the scope of the person's duties, and that does not constitute willful or reckless misconduct.\nThe commissioners shall make available to the public, upon request, summary data on the decisions rendered under this section, including the number of reviews heard and decided and the final outcomes. Any data released to the public must not individually identify the enrollee initiating the request for external review.",
	"repealed": false
}