{
	"id": "161.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.14",
	"title": "161.14 NAMES AND DESIGNATIONS OF CERTAIN HIGHWAYS.",
	"text": "The following route between the city of St. Paul and the south boundary of the state of Minnesota is hereby named and designated \"The Capitol Highway\":\nBeginning at the intersection of University Avenue and Highway No. 62 in Anoka County, thence southerly along University Avenue through Minneapolis, and thence southerly along University Avenue and Robert Street through St. Paul, thence southerly along South Robert Street through West St. Paul, to a point at or near the northeast quarter-corner of section 19, township 27, range 22, thence southeasterly and southerly to a point at or near the southeast corner of section 35, township 113, range 19, thence southerly traversing in part the line between Rice and Goodhue Counties, to Trunk Highway No. 21, thence southeasterly on such highway to Trunk Highway No. 56, thence southerly on Trunk Highway No. 56 through Dodge Center to Constitutional Route No. 9, now marked Trunk Highway 16, thence east on Constitutional Route No. 9, now marked Trunk Highway 16, to the northeast corner of section 2, township 102, range 17, thence in a southerly direction along County State-Aid Highway 19 to the junction of Statutory Route No. 81, now marked Trunk Highway 56, thence southeasterly along Statutory Route No. 81, now marked Trunk Highway 56, to the junction of County State-Aid Highway 12, thence southerly along County State-Aid Highway 12 to a point on the Iowa state line near the south quarter line of section 34, township 101, range 14.\nThe following described highway shall be known as \"The Colvill Memorial Highway\":\nBeginning at Gaylord and running thence in an easterly direction through Lonsdale, Northfield and Cannon Falls, terminating at the city of Red Wing.\nThe following described highway shall be known as the \"Floyd B. Olson Memorial Highway\":\nRoute No. 55, when permanently established, shall thereafter be known as the \"Floyd B. Olson Memorial Highway\" in addition to its statutory number.\nThe following route in the vicinity of Dawson is named and designated \"The Theodore Christianson Memorial Drive\" in memory of the late Governor Theodore Christianson of Dawson, Minnesota, to-wit:\nBeginning at a point on Constitutional Route No. 26, now marked Trunk Highway 12, at its intersection with Constitutional Route No. 66, now marked Trunk Highway 119, northerly of Appleton; thence extending in a southerly direction along Constitutional Route No. 66 to its intersection with Statutory Route No. 144, now marked Trunk Highway 119, at or near the south corporate limits of Appleton; thence extending southwesterly and southerly along said Statutory Route No. 144 to a point approximately six miles east of Madison; thence continuing southerly along present County State-Aid Highway 25 to its intersection with Constitutional Route No. 12, now marked Trunk Highway 212, at or near the westerly limits of Dawson; thence easterly along Constitutional Route No. 12 to its intersection with present County State-Aid Highway 23 in Dawson; thence continuing southerly along present County State-Aid Highways 23 and 11 to a point on Constitutional Route No. 48, now marked Trunk Highway 67.\nBeginning at a point near the present junction of state Trunk Highway No. 40 and County State-Aid Highway 13 in Lac qui Parle County; thence extending in a general easterly direction along Statutory Route No. 276, now marked Trunk Highway 40 and County State-Aid Highway 20 in said county to a point at or near the city of Lac qui Parle; thence continuing in a general easterly and northerly direction to County State-Aid Highway 33; thence continuing easterly across the Minnesota River and Dam to its intersection with state Trunk Highway No. 59; thence extending in a general easterly direction along state Trunk Highway No. 59 to the junction of state Trunk Highway No. 7 in the city of Montevideo; thence extending in a general easterly direction on state Trunk Highway No. 7 to a point at or near the city of Minneapolis and there terminating.\nThat portion of Constitutional Route No. 19, known as Trunk Highway 371, in Cass County from its south junction of Constitutional Route No. 34 to Walker is hereby named and designated as the \"P. H. McGarry Memorial Drive.\"\n(a) That portion of Road No. 185, known as Trunk Highway 23 in St. Louis, Pine, and Carlton Counties, is hereby named and designated \"Veterans' Evergreen Memorial Drive\" in memory of veterans of St. Louis, Pine, and Carlton Counties.\n(b) The commissioner shall install a bronze plaque with an inscription to read, \"In grateful memory of all men and women from Carlton, Pine, and St. Louis Counties who served in World War I, World War II, Korea, Vietnam, and all future conflicts.\"\nNo advertisement or sign shall be displayed within a distance of 300 feet from the center of the traveled part of the Evergreen Memorial Drive, but this provision shall not apply within a municipality nor to any sign erected by public authority for the regulation of traffic nor to any advertisement or sign upon the wall of a building in which the goods advertised are offered for sale or the business advertised is conducted.\nThe commissioner shall remove or cause to be removed any advertisement or sign prohibited under this section.\nThe highway now marked and known as Trunk Highway 212 from the Wisconsin state line to the South Dakota state line is hereby named and designated as the \"Yellowstone Trail,\" and the commissioner of transportation shall adopt a suitable marking design with which the commissioner shall mark or blaze said highway to carry out the purposes of this subdivision.\n(a) The following route is named and designated the \"Sioux Trail\":\nBeginning at a point in Mendota at or near the Mendota Bridge over the Mississippi River; thence extending southwesterly along Legislative Route No. 117 to its junction with Legislative Route No. 187; thence extending westerly along Legislative Route No. 187 to its junction with Constitutional Route No. 5 in Shakopee; thence extending southwesterly along Constitutional Route No. 5 to Mankato; thence extending southwesterly along Constitutional Route No. 5 to its junction with Legislative Route No. 83; thence extending northwesterly along Legislative Route No. 83 to its junction with Constitutional Route No. 15; thence extending northerly along Constitutional Route No. 15 across the Minnesota River to its junction with Nicollet County State-Aid Highway 21; thence extending northwesterly along Nicollet County State-Aid Highway 21 to Nicollet County State-Aid Highway 29 near Fort Ridgely State Memorial Park; thence extending northwesterly along Nicollet County State-Aid Highway 29 to Renville County State-Aid Highway 5 at the Renville County line; thence extending northwesterly along Renville County State-Aid Highway 5 to Renville County Highway 51 at or near Franklin; thence extending northwesterly along Renville County Highway 51 to Constitutional Route No. 14 easterly of Morton; thence extending along Constitutional Route No. 14 to its junction with Constitutional Route No. 4 at Morton; thence extending northwesterly along Constitutional Route No. 4 at its junction with Renville County State-Aid Highway 15; thence extending northwesterly along Renville County State-Aid Highway 15 to its junction with Renville County State-Aid Highway 10; thence extending northerly along Renville County State-Aid Highway 10 to its junction with Renville County Highway 52; thence extending along Renville County Highway 52 to Chippewa County Highway 40 at the Chippewa County line; thence extending northwesterly along Chippewa County Highway 40 to its junction with Constitutional Route No. 12 at Granite Falls; thence extending northwesterly along Constitutional Route No. 12 to its junction with Constitutional Route No. 66 at Montevideo; thence extending northwesterly along Constitutional Route No. 66 to its junction with Legislative Route No. 147 at or near Appleton; thence extending northwesterly along Legislative Route No. 147 to it junction with Constitutional Route No. 6; thence extending northwesterly along Constitutional Route No. 6 to Ortonville.\n(b) The commissioner of transportation shall adopt a suitable marking design with which the commissioner shall mark or blaze the specified portions of the trunk highway routes heretofore described over which the Sioux Trail is located, and the counties of Nicollet, Renville, and Chippewa shall mark or blaze their respective highways heretofore described with the same marking design adopted by the commissioner of transportation.\nThat portion of Constitutional Route No. 1, known as Trunk Highway 61, from Lester Park in Duluth to Two Harbors, as the same is relocated and to be constructed on new alignment, is hereby named and designated as the \"Arthur V. Rohweder Memorial Highway.\"\n(a) The following route is named and designated the \"Hiawatha Pioneer Trail\":\nBeginning at Trunk Highway No. 61 on the boundary line between the states of Minnesota and Wisconsin; thence northwesterly on Trunk Highway No. 61 to junction with Trunk Highway No. 12 in St. Paul; thence westerly and southwesterly on Trunk Highways No. 12 and No. 5 to Fort Snelling; thence southwesterly on Trunk Highway No. 3 to Faribault; thence westerly on Trunk Highway No. 99 to St. Peter; thence southerly on Trunk Highway No. 22 to Mankato; thence westerly on Trunk Highway No. 68 to Sleepy Eye; thence northerly on Trunk Highway No. 4 to Fairfax; thence westerly on Trunk Highway No. 19 to junction with Trunk Highway No. 67; thence northerly on Trunk Highway No. 67 to Granite Falls; thence southwesterly on Trunk Highway No. 23 to junction with Trunk Highway No. 14; thence westerly on Trunk Highway No. 14 to Lake Benton; thence southerly on Trunk Highway No. 75 to Pipestone; thence easterly on Trunk Highway No. 30 to Slayton; thence southerly on Trunk Highway No. 59 to Worthington; thence easterly on Trunk Highway No. 16 to Jackson; thence southerly on Trunk Highway No. 71 to the boundary line between the states of Minnesota and Iowa.\n(b) The route of the \"Hiawatha Pioneer Trail\" designated in paragraph (a) of this subdivision is the main route of the trail. The following routes are named and designated as the alternate southern route and the alternate northern route of the \"Hiawatha Pioneer Trail.\"\n(c) The alternate southern route is described as follows:\nCommencing at the junction of Trunk Highway No. 61, on the main route, and Trunk Highway No. 14, north and west of Winona, thence westerly on Trunk Highway No. 14 to Owatonna; thence northerly on Trunk Highway No. 3 to Faribault, and connecting to the main route.\n(d) The alternate northern route is described as follows:\nCommencing at the junction of Trunk Highway No. 12, on the main route, and Trunk Highway No. 10 in the city of St. Paul; thence northerly on Trunk Highway No. 10 to Little Falls, to junction Trunk Highway No. 371; thence northerly on Trunk Highway No. 371 to Brainerd and junction with Trunk Highway No. 18; thence easterly on Trunk Highway No. 18 to Garrison and junction with Trunk Highway No. 169; thence southerly on Trunk Highway No. 169 to junction with Trunk Highway No. 65; thence northerly on Trunk Highway No. 65 to Jacobsen, and junction with Trunk Highway No. 34; thence easterly on Trunk Highway No. 34 to junction with Trunk Highway No. 2; thence easterly and southerly on Trunk Highway No. 2 to Duluth and junction with Trunk Highway No. 23; thence southerly and westerly on Trunk Highway No. 23 to Sandstone and junction of Trunk Highway No. 61, thence southerly on Trunk Highway No. 61 to North Branch and junction with Trunk Highway No. 95; thence easterly and southerly on Trunk Highway No. 95 to Stillwater and junction with Trunk Highway No. 212; thence southerly and westerly to Trunk Highway No. 12 on the main route in the city of St. Paul.\n(e) The commissioner of transportation shall adopt a suitable marking design with which the commissioner shall mark or blaze the highways heretofore described over which the \"Hiawatha Pioneer Trail\" is located.\nThe following route is designated as an alternate route of the \"Hiawatha Pioneer Trail\":\nCommencing at the junction of Trunk Highway No. 61, on the main route, and Trunk Highway No. 58, at Red Wing, thence southwesterly on Trunk Highway No. 58, to its junction with Trunk Highway No. 52, at Zumbrota. The commissioner shall mark the route as provided in subdivision 12.\nTrunk Highway Routes Numbered 390, 392, 394, and 395, as described in section 161.12, are hereby named and designated as the \"Blue Star Memorial Highway.\"\nSubject to the approval of the commissioner of transportation, the Blue Star Memorial marker may be placed in roadside rest areas, waysides, or parking areas within the right-of-way of the routes described in the first paragraph of this subdivision.\nThat portion of Trunk Highway marked 5 commencing in the city of St. Paul, to Interstate Highway marked 494, and that portion of Trunk Highway marked 169 from the intersection of Interstate Highway marked 494 to the city of St. Peter is hereby named and designated as the \"John A. Johnson Memorial Highway.\"\n(a) The following route is named and designated the \"Glacial Ridge Trail\":\nBeginning at the junction of Trunk Highway No. 71, at its intersection with Trunk Highway No. 12, in Willmar; thence extending north and northeasterly along Trunk Highway No. 71 to its intersection with Kandiyohi County Highway 90; thence extending east along said Highway 90 to its junction with Kandiyohi County State-Aid Highway (SAH) 9; thence extending north and northeasterly along said Highway 9 to its junction with Kandiyohi SAH 26; thence extending east along said Highway 26 to its junction with Kandiyohi SAH 8; thence extending north along said Highway 8 to its junction with Kandiyohi SAH 10, south of Green Lake; thence northerly along said Highway 10 to its junction with Kandiyohi SAH 30 in Spicer; thence extending northerly and easterly along said Highway 30 to its junction with Kandiyohi County SAH 2; thence extending northerly on said Highway 2 to a highway easterly of Long Lake and on the north side of Irving Township; thence westerly and southerly on the township road through Sections 4 and 5 of Irving Township to Kandiyohi County Highway 103 to its junction with a township road running south through Sections 6, 7, and 18 of Irving Township to its junction with Kandiyohi SAH 40; thence west on said Highway 40, across Trunk Highway No. 23 to the junction of SAH 40 and SAH 9 in the city of New London; thence via city streets to Trunk Highway No. 9 in New London; thence extending westerly on said Highway No. 9, to its junction with Trunk Highway No. 71; thence southerly on said Highway No. 71 to Kandiyohi County SAH 48; thence westerly through Sibley State Park and northerly, across Trunk Highway No. 9, to Colfax Township road running westerly through Sections 27, 22, 21, 20, and 19, of said township, and Section 24 of Norway Lake Township to Kandiyohi County Road 1, thence north to the township road on the south side of Sections 13 and 14 of Norway Lake Township to Kandiyohi County Road 115 to its junction with Kandiyohi County SAH 36 and west on said Highway 36 to a Norway Lake Township Road running northerly through Section No. 5 to the Pope County line and there joining a township road in Section 32 of Lake Johanna Township; thence northerly and westerly through Sections 32 and 31 to Trunk Highway No. 104; thence northerly on said Highway No. 104 to a township road; running westerly through Sections 24 and 23 of Gilchrist Township to Pope County Highway 84; thence westerly on said Highway 84 to the west side of Section No. 15; thence northerly and westerly on a township road through Sections 16 and 17 to Pope County SAH 8; thence north on said Highway 8, in Section No. 8, to a township road; thence in a general northwesterly direction on township roads to Trunk Highway No. 104.\nAnd beginning in the Community of Terrace, in Section No. 33 of Chippewa Falls Township, Pope County, Minnesota; thence northwesterly on Pope County SAH 21 to a township road; thence westerly on said township road to Trunk Highway No. 104; thence along said Highway No. 104 in a westerly and northerly direction to Pope County SAH 18; thence westerly on said Highway 18 to Pope County SAH 17; thence northerly on said Highway 17 to its junction with Trunk Highway No. 104; thence northerly to Trunk Highway No. 28 in Glenwood; thence easterly on said Highway No. 28 to its junction with Pope County SAH 25; thence northerly and easterly to the city of Villard; thence to Trunk Highway No. 28 and easterly to its junction with Trunk Highway No. 71; thence northerly on said Highway No. 71 to the city of Sauk Centre.\nAnd beginning in the city of Villard on Pope County SAH 28; thence westerly on said SAH 28 to its junction with Trunk Highway No. 29.\nAnd beginning at the south limits of the city of Alexandria on Trunk Highway No. 29; thence southerly to its junction with Trunk Highway No. 55; thence southeasterly to 14th Avenue Northeast and the adjacent Mount Lookout Rest Area in the city of Glenwood; thence westerly on said 14th Avenue NE to its junction with Trunk Highway No. 29; thence southerly on said Highway No. 29 to its junction with Trunk Highway No. 104 in the city of Glenwood.\nAnd beginning in the city of Glenwood at the junction of Trunk Highway No. 104 and Lakeshore Drive; thence westerly on Lakeshore Drive into the city of Long Beach to Golf Course Road; thence on Golf Course Road to Trunk Highway No. 29; thence on said Highway No. 29 to Pope County SAH 24; thence westerly on said SAH 24 to the Pelican Lake Road; thence southerly on said road to Trunk Highway No. 29; thence southerly and westerly on said Highway No. 29 through the city of Starbuck to Pope County SAH 41; thence southerly on said SAH 41 to Glacial Lakes State Park.\nAnd beginning on Pope County SAH 41 at its junction with Pope County Highway 74; thence easterly on said County Highway 74 to its junction with Pope County SAH 13; thence southerly on said SAH 13 to its junction with a township road on the north side of Section 5 of Rolling Forks Township; thence easterly on said township road through Sections 5, 4, and 3 of Rolling Forks Township; said road continuing as the township road through Sections 34, 35, and 36 of Barsness Township to its junction with Pope County SAH 19.\nAnd beginning at the junction of Trunk Highway No. 104 and Pope County SAH 19; thence southerly on said SAH 19 to the Swift County line where it becomes Swift County SAH 25; thence on said SAH 25 to the Swift Falls Community Park.\nAnd beginning at the junction of Swift County SAH 25 and Swift County Highway 87; thence southerly and easterly on said Highway 87 to its junction with a township road in Section 12 of Camp Lake Township; thence easterly and northerly on township roads through Sections 12 and 1 of Camp Lake Township to a junction with a township road in Section No. 6 of Kerkhoven Township; thence easterly and southerly on township roads through Sections No. 6, 5, 4, 3, 2, and 11 to its junction with Swift SAH 28; thence easterly on said SAH 28 to its junction with Swift County Highway 95; thence southerly on said Highway 95 through Monson Lake Memorial Park to its junction with Swift County SAH 18; thence easterly on said SAH 18 to the Kandiyohi county line where it becomes Kandiyohi County SAH 40; thence on said SAH 40 to Trunk Highway No. 104.\nAnd beginning at the junction of Kandiyohi County SAH 36 and a township road in Section No. 8 of Norway Lake Township; thence southerly on said SAH 36 to its junction with Trunk Highway No. 9; thence on said Highway No. 9 to its junction with Trunk Highway No. 104; thence south on said Highway No. 104, through the city of Sunburg to the junction of said Highway No. 104 and Kandiyohi County SAH 40; thence easterly on said SAH 40 to its junction with Kandiyohi SAH 5.\nAnd beginning at the junction of Kandiyohi County SAH 48 and SAH 38; thence southerly on said SAH 38 to Kandiyohi County SAH 40; thence westerly on said SAH 40 to its junction with Kandiyohi SAH 5; thence southerly on said SAH 5 to its junction with a township road in Section No. 9 of Dovre Township; thence easterly on said township road through Sections No. 9, 10, and 11 to its intersection with Kandiyohi County SAH 27; thence easterly on said SAH 27 to its junction with a township road in Section No. 13 of Dovre Township; thence on said township road through Sections No. 13, 14, 23, 25, and 36 of Dovre Township to its junction with Trunk Highway No. 71.\n(b) The respective road authorities of the highways over which the route described in this subdivision is located shall place and maintain the \"Glacial Ridge Trail\" emblem, an arrowhead design with red, black, and white colors, on the highways under their jurisdiction to adequately mark the highways as \"Glacial Ridge Trail.\"\n(c) The state Transportation Department shall make sufficient additional markers to enable the counties to mark those portions of the trail not maintained by the state.\nThe bridge over the Mississippi River at the city of Red Wing, being part of Legislative Route No. 161, is designated as the \"Eisenhower Bridge of Valor.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this bridge and erect appropriate signs.\n(a) The following described route is named and designated the \"Hiawatha-Appleblossom Scenic Drive.\"\nBeginning at a point in LaCrescent on Houston County State-Aid Highway 29; thence extending northerly along Houston County State-Aid Highway 29 to the Winona County line; thence extending northerly and westerly along Winona County State-Aid Highway 1 to its junction with Winona County State-Aid Highway 12; thence easterly along Winona County State-Aid Highway 12 to its intersection with Trunk Highway marked 61 in Dakota and there terminating. Also from the junction of Winona County State-Aid Highway 1 and Winona County State-Aid Highway 12; thence westerly and northerly along Winona County State-Aid Highway 12 to its intersection with Winona County State-Aid Highway 3; thence easterly and northerly along Winona County State-Aid Highway 3 to its intersection with Trunk Highway marked 61 and there terminating.\n(b) The respective road authorities having jurisdiction of the highways over which the route described in paragraph (a) is located shall adopt and place suitable marking signs on their respective highways to adequately mark the route as \"Hiawatha-Appleblossom Scenic Drive.\"\nThe following route is named and designated the \"Voyageur Highway\":\n(a) Beginning at a point on Trunk Highway No. 26 on the boundary line between the states of Minnesota and Iowa; thence northerly along Trunk Highway No. 26 to its junction with Trunk Highway No. 61; thence northwesterly along Trunk Highway No. 61 to its junction with Trunk Highway No. 10 in the city of St. Paul; thence extending in a general northwesterly direction along Trunk Highway No. 10 to its junction with Trunk Highway No. 371 at Little Falls; thence extending in a general northerly direction along Trunk Highway No. 371 to its junction with Trunk Highway No. 210 at Brainerd; thence northeasterly along Trunk Highway No. 210 to its junction with Trunk Highway No. 169 at Aitkin; thence in a general northerly direction along Trunk Highway No. 169 to its junction with Trunk Highway No. 2 at Grand Rapids, except that portion that is designated as the Jim Oberstar Causeway; thence northwesterly along Trunk Highway No. 2 to its junction with Trunk Highway No. 71 at Bemidji; thence northeasterly along Trunk Highway No. 71 to its junction with Trunk Highway No. 11 at Pelland; thence northeasterly along Trunk Highway No. 11 to its junction with Trunk Highway No. 53 at International Falls. Beginning at a point on Trunk Highway No. 61 at its junction with Interstate Highway 35 and thence northeasterly along Trunk Highway No. 61 to the boundary line between the state of Minnesota and the province of Ontario, Canada.\n(b) The route of the Voyageur Highway designated and described in clause (a) is supplemented by legs or alternative routes described as follows:\nBeginning at a point on Trunk Highway No. 1 at its junction with Trunk Highway No. 61 northerly of Silver Bay; thence northwesterly along Trunk Highway No. 1 to Ely; thence southwesterly along Trunk Highway No. 1 to its junction with Trunk Highway No. 169; thence southerly and westerly along Trunk Highway No. 169 to its junction with Trunk Highway No. 53, and there terminating.\nBeginning at a point on Trunk Highway No. 11 at its junction with Trunk Highway No. 53 at International Falls; thence easterly along Trunk Highway No. 11 to its easterly terminus near Island View.\nBeginning at a point on Trunk Highway No. 33 at its junction with Interstate Highway marked I-35 southerly of Cloquet, thence northerly along Trunk Highway No. 33 to its junction with Trunk Highway No. 53.\n(c) The commissioner of transportation shall:\n(1) adopt a suitable marking design of signs or informational plaques;\n(2) effect the installation of such signs or plaques in public waysides or other public areas as approved and designated by the commissioner.\nThe following route is named and designated the \"Viking Trail\":\n(a) Beginning on Clay County State-Aid Highway (SAH) 36 on the boundary line between the states of Minnesota and North Dakota; thence easterly on said SAH 36 to Clay County Highway 100; thence southerly through the city of Georgetown to U.S. Trunk Highway 75; thence southerly on said Trunk Highway to its intersection with U.S. Trunk Highway 10; thence easterly on said Trunk Highway 10 to its junction with Becker County SAH 5; thence southerly on said SAH 5 to Becker County SAH 6; thence easterly on said SAH 6 to Becker County SAH 11; thence southerly on said SAH 11 to Becker County SAH 5; thence southerly on said SAH 5 to the Otter Tail County line where the highway becomes Otter Tail County SAH 9; thence southerly on said SAH 9 to Otter Tail County SAH 20; thence easterly on said SAH 20 to Otter Tail County SAH 31; thence southerly on said SAH 31, across U.S. Trunk Highway 59, to the junction of said SAH 31 and Otter Tail County SAH 4; thence westerly on said SAH 4 to its junction with U.S. Trunk Highway 59; thence southerly on said Trunk Highway 59 through the cities of Pelican Rapids, Erhard, and Elizabeth to its junction with Minnesota Trunk Highway No. 52; thence west on said Trunk Highway No. 52 to its junction with Otter Tail County Highway 116; thence southerly on said County Highway 116 to its junction with Minnesota Trunk Highway No. 210; thence easterly on said Trunk Highway No. 210 through the cities of Fergus Falls and Underwood to its junction with Minnesota Trunk Highway No. 78; thence northerly on said Trunk Highway No. 78 to its junction with Otter Tail County SAH 83 in the city of Battle Lake; thence westerly on said SAH 83 to its junction with Otter Tail County Highway 122; thence westerly on said County Highway 122 to its junction with Otter Tail County SAH 35 in the city of Underwood; thence southerly, across Minnesota Trunk Highway No. 210, through the city of Dalton and across Interstate Highway 94 to the junction of said SAH 35 with U.S. Trunk Highway 59; thence southerly on said Trunk Highway 59 into Grant County to its junction with Grant County Highway 50; thence easterly on said County Highway 50 to its junction with Grant County SAH 4; thence easterly on said SAH 4 to its junction with Grant County SAH 21; thence southerly on said SAH 21 to its junction with Minnesota Trunk Highway No. 79.\nBeginning in the city of Elbow Lake on Minnesota Trunk Highway No. 79; thence easterly on said Trunk Highway No. 79 to its junction with Grant County SAH 21; thence southerly on said SAH 21 to Grant County Highway 36; thence easterly on said County Highway 36 to its junction with Grant County SAH 10; thence southerly on said SAH 10 to its junction with Grant County SAH 2.\nBeginning in the city of Barrett on Grant County SAH 2; thence easterly on said SAH 2 to its junction with Grant County SAH 5; thence southerly on said SAH 5 through the city of Hoffman to Minnesota Trunk Highway No. 55; thence southeasterly on said Trunk Highway No. 55 to its junction with Douglas County SAH 1 in the city of Kensington; thence northerly on said SAH 1 to the Solem Township road on the south side of Section 15 of Solem township (T. 127 N., R. 40 W.); thence easterly and northeasterly on Solem Township roads through Sections 15, 14, and 11 to their junction with Minnesota Trunk Highway No. 27; thence easterly on said Trunk Highway No. 27 to its junction with Minnesota Trunk Highway No. 114; thence northerly on said Trunk Highway No. 114, under Interstate Highway 94, to the junction of said Trunk Highway No. 114 with Douglas County SAH 8; thence easterly on said SAH 8 to its junction with Douglas County SAH 82; thence southerly and easterly on said SAH 82 to its junction with Minnesota Trunk Highway No. 29 in the city of Alexandria; thence northerly on said Trunk Highway No. 29 to its junction with Douglas County SAH 42 in the city of Alexandria; thence northerly on said SAH 42 to its junction with Minnesota Trunk Highway No. 29; thence easterly across said Trunk Highway No. 29 to Douglas County SAH 13 and continuing easterly on said SAH 13 through the city of Carlos to the junction of said SAH 13 with Douglas County SAH 3 in the community known as Belle River; thence easterly on said SAH 3 to the Belle River Township Road in Section 14 of Belle River Township (T. 129 N., R. 36 W.); thence easterly on said township Road through Sections 14 and 13 of Belle River Township to the Douglas-Todd County Line, where it becomes a Leslie Township Road in Section No. 18 of Leslie Township (T. 129 N. R. 35 W.); thence easterly on said Leslie Township Road through Sections No. 18 and 17 to the Todd County SAH 1; thence southerly on said SAH 1 to its junction with Todd County SAH 36; thence easterly on said SAH 36 to its junction with Leslie Township Road in Section No. 22 of said Leslie Township; thence southerly on said Township Road through Sections No. 22, 27, and 28 of said Leslie Township to Todd County SAH 10; thence easterly on said SAH 10 to its junction with Todd County SAH 37; thence southerly on said SAH 37 to its junction with Minnesota Trunk Highway No. 27; thence southerly on said Trunk Highway No. 27 to the city of Osakis.\nBeginning at the junction of Minnesota Trunk Highway No. 27 and Todd County SAH 4; thence easterly on said SAH 4 to its junction with Todd County SAH 11; thence southerly on said SAH 11 to its junction with Todd County Highway 96; thence easterly on said County Highway 96 to its junction with Todd County SAH 50 at the community of Little Sauk; thence southerly on said SAH 50 to its junction with U.S. Trunk Highway 71; thence southerly on said Trunk Highway 71 to its junction with Todd County SAH 2; thence easterly on said SAH 2 to its junctions with Todd County SAH 15; thence southerly on said SAH 15 to the Todd-Stearns County line and its junction with Stearns County SAH 24; thence southerly on said SAH 24 to Minnesota Trunk Highway No. 28; thence southwesterly on said Trunk Highway No. 28 to its junction with U.S. Trunk Highway 71; thence southerly on said Trunk Highway 71 through the city of Sauk Centre to its junction with the Interstate Highway 94 and there terminating.\n(b) The respective road authorities, of the highways over which the route described in this subdivision is located, may erect and maintain the \"Viking Trail\" emblem on the highways under their jurisdiction to adequately mark the route as the \"Viking Trail.\" The commissioner of transportation shall approve an emblem which shall consist of the lettering \"Viking Trail\" with the bow section of a Viking ship on a body of water; the colors being blue on white.\nThe bridge over the Minnesota River between the cities of Mankato and North Mankato, being a part of Legislative Route No. 256, is named and designated the \"Veterans Memorial Bridge.\" Plaques or signs memorializing this bridge must be furnished by other than the Minnesota Department of Transportation and approved by the commissioner.\nThat segment of marked Trunk Highway 60 from Mankato to Brewster is named and designated the \"George Mann Memorial Highway.\" The commissioner shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs.\nLegislative Route No. 299, as described in section 161.115, is named and designated \"Olof Hanson Drive.\" The commissioner shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs.\nTrunk Highway No. 391, described in section 161.12 and marked as Interstate Highway I-90, is named and designated as the \"American Veterans Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect appropriate signs.\nThat portion of Constitutional Route No. 46, known as U.S. Route No. 8, that is located within Chisago County is named and designated \"Moberg Trail.\" The commissioner shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs.\nThat portion of Trunk Highway marked 2 from its intersection with Trunk Highway marked 371 in Cass Lake to Bemidji, is named and designated the \"Paul Bunyan Expressway.\" The commissioner shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs.\nThat portion of Constitutional Route No. 3, known as Trunk Highway 61, from the easterly limits of the city of St. Paul to the boundary line between the states of Minnesota and Wisconsin is designated the \"Disabled American Veterans Highway.\" The roadside rest area on Trunk Highway 61 at Lake City is designated the Disabled American Veterans rest area. The commissioner of transportation shall adopt a suitable marking design to mark this highway and rest area and shall erect the appropriate signs.\nThat segment of Constitutional Route No. 4 from its intersection with marked County State-Aid Highway 34 in Jackson County to its intersection with North Highway in the city of Jackson, is designated the \"B. E. Grottum Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect appropriate signs.\nLegislative Route No. 330, as described in section 161.115, is named and designated \"Wally Nelson Highway.\" The commissioner shall adopt a suitable marking design to mark this highway and shall erect appropriate signs.\nMarked Trunk Highway 14, from its intersection with the Minnesota-South Dakota border easterly to its intersection with Olmsted County Road 22 and then southerly and easterly along that county road to its intersection with marked Trunk Highway 14 and then easterly to its intersection with marked U.S. Highway 63 in or near Rochester and then northerly and southerly along marked U.S. Highway 63, as follows:\n(1) northerly along marked U.S. Highway 63 to its intersection with marked U.S. Highway 61 in or near Lake City and then southeasterly along U.S. Highway 61 to its intersection with marked Trunk Highway 60 in or near the city of Wabasha and then northeasterly along marked Trunk Highway 60 to its intersection with the Minnesota-Wisconsin border; and\n(2) southerly along marked U.S. Highway 63 to its intersection with marked Trunk Highway 16 and then easterly along marked Trunk Highway 16 to its intersection with marked U.S. Highway 52 in or near the city of Preston and then southerly and easterly along marked U.S. Highway 52 to the Minnesota-Iowa border,\nis designated the \"Laura Ingalls Wilder Historic Highway.\"\nPursuant to section 161.139, the commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect appropriate signs. The people of the communities, having resolved to support and financially back the marking of these routes, shall reimburse the department for costs incurred in marking and memorializing this highway.\nTrunk Highway marked 212 is designated the \"Minnesota Veterans Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs.\nThe bridge over the Mississippi River at or near St. Cloud, Minnesota, being a part of Trunk Highway marked 15, is named and designated the \"Bridge of Hope.\" The commissioner shall adopt a suitable marking design to mark the bridge and shall provide and erect the appropriate signs or plaques. The people of the community, having resolved to support and financially back the marking of this bridge, shall reimburse the department for costs incurred in marking and memorializing this bridge.\nThe bridge over the Mississippi River in or near the city of Elk River connecting Trunk Highway marked 101 in Wright County with Trunk Highway marked 169 in Sherburne County is named and designated \"Betty Adkins Bridge.\" The commissioner of transportation shall furnish and erect plaques or signs to mark and memorialize this bridge. The people of the community, having resolved to support and financially back the marking of this bridge, shall reimburse the department for costs incurred in marking and memorializing this bridge.\nTrunk Highway marked 169 from its intersection with Trunk Highway marked 10 in or near the city of Elk River to its intersection with State Highway marked 18 in or near the city of Garrison and State Highway marked 18 from its intersection with Trunk Highway marked 169 in or near Garrison to its intersection with Trunk Highway marked 371 in or near the city of Brainerd is designated the \"POW/MIA Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nLegislative Route No. 131, marked as Trunk Highway 115, is designated the \"Veterans Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nMarked Trunk Highway 52, from its intersection with marked Trunk Highway 44 near the city of Prosper to its intersection with marked Trunk Highway 16 east of the city of Preston, is designated the \"Amish Buggy Byway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nThat portion of Trunk Highway marked 13 between the city of New Prague and the city of Montgomery is designated the \"Czech Heritage Highway\" or another name reflecting the area's Czech heritage that is agreed on by the city councils of New Prague and Montgomery. The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nMarked Trunk Highway 22, from its intersection with marked Trunk Highways 14 and 60 in the city of Mankato to its intersection with marked Trunk Highway 30 in the city of Mapleton, is designated \"Victory Drive.\" The commissioner of transportation shall adopt a suitable design for marking this highway and shall erect appropriate signs at locations the commissioner determines. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nMarked Trunk Highway 15, from its intersection with marked Trunk Highway 60 to its intersection with the Iowa border, is designated \"Veterans Memorial Highway.\" The commissioner of transportation shall adopt a suitable design for marking this highway and shall erect appropriate signs at locations the commissioner determines. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nThat segment of marked Trunk Highway 210 located within Aitkin County is designated \"Dale Wayrynen Memorial Highway.\" The commissioner of transportation shall erect appropriate signs after adopting a marking design for the signs, which suitably commemorates Dale Wayrynen, posthumous recipient of the Congressional Medal of Honor, for heroism displayed during the Vietnam War. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nMarked Trunk Highway 5 from the westerly side of the intersection with marked Trunk Highway 41, known as Hazeltine Boulevard, in Chanhassen southwesterly to its intersection with marked Trunk Highway 19 in or near Gaylord is designated \"Augie Mueller Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and erect appropriate signs. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nThat segment of marked Trunk Highway 60 from Brewster to Worthington is designated \"Don Rickers Memorial Highway.\" The commissioner of transportation shall adopt a suitable design for marking this highway and shall erect appropriate signs at locations determined by the commissioner. The people of the community, having resolved to support and financially back the marking of this highway, shall reimburse the department for costs incurred in marking and memorializing this highway.\nThe north frontage road just off Olson Memorial Highway, from its intersection with Logan Avenue North and Morgan Avenue North in the city of Minneapolis, is designated \"Ruby L. Hughes Boulevard\" subject to section 161.139. The commissioner of transportation shall adopt a suitable marking design to mark this road and erect appropriate signs. The people of the community, having resolved to support and financially back the marking of this road, shall reimburse the department for costs incurred in marking and memorializing this road.\nMarked Trunk Highway 95, from its intersection with marked Trunk Highway 65 in Cambridge to its intersection with marked Interstate Highway 35 near North Branch, is named and designated \"State Trooper Timothy J. Bowe Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs, subject to section 161.139.\nThat portion of marked Trunk Highway 59 from its intersection with Otter Tail County Highway 3 to its intersection with Otter Tail County Highway 4, is designated \"Otter Tail Veterans Memorial Drive.\" The commissioner shall adopt a suitable marking design to mark this highway and erect appropriate signs, subject to the provisions of section 161.139.\n(a) That portion of marked Trunk Highway 371 from its intersection with Design Drive in Baxter to the unincorporated community of Barrows, known as the Brainerd bypass, is named and designated the \"C. Elmer Anderson Memorial Highway.\" Subject to the provisions of section 161.139, the commissioner shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs.\n(b) No advertising device as defined in section 173.02, subdivision 16, other than advertising devices described in section 173.08, subdivision 1, clauses (1) to (7), (9), and (10), may be erected or maintained in the area adjacent to the right-of-way of the C. Elmer Anderson Memorial Highway. The commissioner may remove any advertising device erected or maintained in violation of this paragraph.\nTrunk Highway 390, described in section 161.12 and marked as Interstate Highway I-35, is named and designated as the \"34th Infantry (Red Bull) Division Highway.\" Subject to the provisions of section 161.139, the commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect appropriate signs.\nMarked Trunk Highway 4, from the north city limits of Sleepy Eye to its intersection with marked Trunk Highway 60 in St. James, is designated the \"Richard J. Mathiowetz Memorial Highway.\" The commissioner shall adopt a suitable marking design to mark this highway and erect appropriate signs, subject to section 161.139.\nThe bridge located on marked Trunk Highway 55 over the Soo Line Railroad right-of-way in Maine Prairie township in Stearns County is named and designated \"Old St. Anne's Pass.\" The commissioner shall adopt a suitable marking design to mark this bridge and erect appropriate signs, subject to section 161.139.\nMarked Interstate Highway 90, from its intersection with marked Trunk Highway 74 in Winona County to the Wisconsin border, is named and designated \"State Trooper Theodore \"Ted\" Foss Memorial Highway.\" The commissioner of transportation shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs, subject to section 161.139.\n(a) The following described route, signed as Trunk Highway 75 on July 1, 2001, is designated the \"King of Trails\": Constitutional Route No. 6 from its intersection with the Minnesota-Canada border southerly to its intersection with Legislative Route No. 175 at or near the city of Crookston, then Legislative Route No. 175 southwesterly and southerly to its intersection with Constitutional Route No. 6 between the cities of Halstad and Hendrum, then Constitutional Route No. 6 southerly to its intersection with the Minnesota-Iowa border.\n(b) The commissioner shall adopt a suitable marking design to mark the highway and erect appropriate signs, subject to section 161.139.\nThe bridge that is part of marked Trunk Highway 6 where it crosses over the narrows of Lake Roosevelt in or near the town of Outing in Cass County is named and designated \"Bradley Waage Memorial Bridge.\" The commissioner of transportation shall adopt a suitable marking design that includes the words \"Bradley Waage Memorial Bridge\" and/or \"aka 'Brainerd Brad'\" to mark this bridge and shall erect the appropriate signs, subject to section 161.139.\nThe interstate bridge on marked Trunk Highway 10 connecting the city of Moorhead with the city of Fargo, North Dakota, is named and designated as the \"Veterans Memorial Bridge.\" The commissioner of transportation shall adopt a suitable marking design to mark this bridge and erect appropriate signs, subject to section 161.139.\n(a) Except for that portion designated under subdivision 45, the route signed as Trunk Highway 371 on July 15, 2005, from its intersection with U. S. Highway 10 near the city of Little Falls to its intersection with U. S. Highway 2 in the city of Cass Lake, is named and designated the \"Purple Heart Memorial Highway.\"\n(b) Subject to the provisions of section 161.139, the commissioner shall adopt a suitable marking design to mark the highway and shall erect the appropriate signs.\nThe bridge over the St. Louis River that is part of Legislative Route No. 185, marked as Trunk Highway 23 on July 15, 2005, is named and designated \"Biauswah Bridge In Honor of Native American Veterans.\" After consulting with the Fond du Lac Band of Lake Superior Chippewa, the commissioner of transportation shall adopt a suitable marking design to memorialize this bridge and shall erect the appropriate signs, subject to section 161.139.\nAnoka County SAH/County Road 7, from its intersection with Grant Street in the city of Anoka, to its intersection with Anoka County SAH 24 in the city of St. Francis, is designated the \"POW/MIA Memorial Highway.\"\n(a) Marked Interstate Highway 35 from its intersection with Broadway Street in Forest Lake to the point where the highway divides into marked Interstate Highways 35E and 35W, and marked Interstate Highway 35W from the point where it divides from marked Interstate Highway 35E to Lake Drive in Lino Lakes, are designated as the \"Shawn Silvera Memorial Highway.\"\n(b) The commissioner of transportation shall adopt a suitable marking design to memorialize this highway, in consultation with and approval by the Shawn Silvera Foundation, that conforms to the Manual on Uniform Traffic Control Devices adopted by the commissioner of transportation pursuant to section 169.06, except for the following requirements:\n(1) be a height of at least 60 inches, and a width of at least 48 inches; and\n(2) have a background color of blue, and have white lettering.\n(c) The commissioner of transportation shall erect suitable signs as close as practicable to the following locations, subject to section 161.139:\n(1) one sign on southbound marked Interstate Highway 35 at its intersection with Washington County Highway 2;\n(2) one sign on northbound marked Interstate Highway 35W within 300 feet of the location at which Officer Silvera was killed in the line of duty on September 6, 2005;\n(3) one sign on northbound marked Interstate Highway 35 between the point where it divides into marked Interstate Highways 35E and 35W and marked Trunk Highway 97; and\n(4) one sign on southbound marked Interstate Highway 35 south of its intersection with marked Trunk Highway 97.\nStatutory Route No. 392, described in section 161.12 and marked on July 1, 2008, as Interstate Highway 94, is designated in its entirety within Minnesota as the \"Purple Heart Trail.\" Subject to section 161.139, the commissioner shall adopt a suitable marking design to mark this highway and erect appropriate signs at each safety rest area located on the highway.\nThat portion of Legislative Route No. 2, signed as Trunk Highway 210 on July 1, 2008, from the city of Motley to the city of Staples, is designated as the \"Dallas Sams Memorial Highway.\" The commissioner of transportation shall adopt a suitable design to mark this highway and erect appropriate signs, subject to section 161.139.\nTrunk Highway marked 53 from its intersection with Superior Street to its intersection with Central Entrance in the city of Duluth, as signed on July 1, 2008, is designated \"Walter F. Mondale Drive.\" Subject to section 161.139, the commissioner of transportation shall adopt a suitable marking design to mark this highway and erect appropriate signs.\nThe causeway over Pokegama Lake on Trunk Highway 169 is designated the \"Jim Oberstar Causeway.\" The commissioner of transportation shall adopt a suitable design to mark this highway and erect appropriate signs, subject to section 161.139.\nThe bridge over Margaret Street on marked Trunk Highway 36 in North St. Paul is designated the \"Mayor William \"Bill\" Sandberg Memorial Bridge.\" The commissioner of transportation shall adopt a suitable design to mark this highway and erect appropriate signs, subject to section 161.139.\n(a) The following described route is designated the \"Clearwater County Veterans Memorial Highway\": that portion of Legislative Route No. 168, marked on August 1, 2009, as Trunk Highway 200, from its intersection with Clearwater County State-Aid Highway 39 to its intersection with Legislative Route No. 169, marked on August 1, 2009, as Trunk Highway 92; and that portion of Route No. 169 to its intersection with Clearwater County State-Aid Highway 5.\n(b) The commissioner shall adopt a suitable marking design to mark this highway and erect appropriate signs, subject to section 161.139.\nThat portion of Route No. 11 known as Trunk Highway 53 on August 1, 2009, from the junction of the northern city limits of Virginia to the intersection with marked Trunk Highway 11 in the city of International Falls, is designated the \"Speaker Irvin N. Anderson Memorial Highway.\" The commissioner of transportation shall adopt a suitable design to mark this highway and erect suitable signs, subject to section 161.139.\nThat portion of marked Trunk Highway 95 from the intersection of marked Interstate Highway 35 to the eastern boundary of the city of North Branch is designated as \"Corporal Johnathan Benson Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable marking design to memorialize the highway and shall erect the appropriate signs.\nThe bridge over marked Interstate Highway 35 that is part of marked Trunk Highway 95 is designated as \"Veterans Memorial Bridge.\" Subject to section 161.139, the commissioner shall adopt a suitable marking design to memorialize the bridge and shall erect the appropriate signs.\nTrunk Highway marked 200 as of July 1, 2010, from the border with North Dakota to the city of Mahnomen, is designated as the \"Veterans Memorial Highway.\" The commissioner shall adopt a suitable design to mark this highway and erect appropriate signs, subject to section 161.139.\nMarked Trunk Highway 34, from its intersection with Washington Avenue in Detroit Lakes to its intersection with County State-Aid Highway 39; and marked Trunk Highway 87, from its intersection with County State-Aid Highway 33 to its intersection with County State-Aid Highway 39, is named and designated the \"Becker County Veterans Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable marking design to mark this highway and erect appropriate signs.\nThe bridge over the Mississippi River on marked Trunk Highway 23 in St. Cloud is designated \"Granite City Crossing.\" The commissioner of transportation shall adopt a suitable design to mark this bridge and erect appropriate signs, subject to section 161.139.\nMarked Trunk Highway 59 from the city of Karlstad to the border with Canada is designated as the \"Veterans Memorial Highway.\" The commissioner shall adopt a suitable design to mark this highway and erect appropriate signs, subject to section 161.139.\nTrunk Highway signed 14 as of August 1, 2012, from the border with South Dakota to the border with Wisconsin, is designated as the \"Black and Yellow Trail.\" The commissioner shall adopt a suitable design to mark this highway and erect appropriate signs, subject to section 161.139.\nThe pedestrian bridge over Route No. 7, signed as Trunk Highway 14 on August 1, 2012, located in the city of Rochester west of Route No. 20, signed as U.S. Highway 52 on August 1, 2012, is designated as \"Arianna Celeste Macnamara Memorial Bridge.\" Subject to section 161.139, the commissioner shall adopt a suitable marking design to memorialize the bridge and shall erect the appropriate signs as close as practicable to the bridge.\n(a) That segment of Route No. 390, signed as Interstate Highway 35 on August 1, 2012, and located in Rice County, is designated as \"Deputy John W. Liebenstein Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable marking design to mark this highway and shall erect the appropriate signs as provided in paragraph (b).\n(b) The commissioner of transportation shall erect suitable signs on marked Interstate Highway 35 as close as practicable to the following locations:\n(1) one sign on the southbound entrance ramp of the interchange with Rice County State-Aid Highway 1; and\n(2) one sign on the northbound entrance ramp of the interchange with Rice County State-Aid Highway 1.\nThat segment of marked Trunk Highway 23 from the east border of the township of Wakefield to the west border of the city of Richmond is designated as \"Officer Tom Decker Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked Trunk Highway 36 located within the city limits of North St. Paul shall be designated as the \"Officer Richard Crittenden, Sr., Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs directly adjacent to the marked Trunk Highway 36 roadway, excluding entrance and exit ramps.\nThat segment of Route No. 46, signed as U.S. Highway 8, on August 1, 2014, from the southwestern border of Chisago City to the eastern border of Center City, is designated as \"Nicholas Patrick Spehar Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThe bridge over the Mississippi River on marked Trunk Highway 60 at the city of Wabasha is designated \"Michael Duane Clickner Memorial Bridge.\" The commissioner of transportation shall adopt a suitable design to mark this bridge and erect appropriate signs, subject to section 161.139.\nMinnesota state bridge number 3145, the Camelback bridge over the Minnesota River overflowage (referred to as Long Meadow Lake) constructed in 1920, is designated and named the \"Old Cedar Avenue Bridge.\" This designation and name also applies to any renovation or reconstruction of the bridge and must be used in any publicly financed signage that refers to the bridge.\nThat segment of signed U.S. Highway 61 from the intersection with signed U.S. Highway 8 in Forest Lake to the intersection with 260th Street in Wyoming is designated as \"Trooper Glen Skalman Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs in the vicinity of the location where Trooper Skalman died.\nThat segment of marked Trunk Highway 36 located within the city limits of Maplewood is designated as \"Sergeant Joseph Bergeron Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\n(a) That segment of signed Trunk Highway 149, known as Dodd Road, from the interchange with signed Interstate Highway 494 to the intersection with Smith Avenue in West St. Paul is designated as \"Officer Scott Patrick Memorial Highway.\"\n(b) The commissioner shall, in consultation with interested groups, adopt a suitable design to mark this highway that conforms to the Manual on Uniform Traffic Control Devices adopted by the commissioner under section 169.06.\n(c) Subject to section 161.139, the commissioner shall erect appropriate signs.\nThat segment of marked Trunk Highway 7 located within the county of McLeod is designated as \"Patrol Officer Michael Alan Hogan Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked Trunk Highway 28 located between the city of Beardsley and the city of Graceville is designated as \"Staff Sergeant Kevin Witte Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked Trunk Highway 23 within the city of Paynesville and the town of Paynesville is designated as \"Medal of Honor recipient Kenneth L. Olson Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThe bridge on Dakota County State-Aid Highway 46, known as Brandel Drive within the city of Coates, over marked U.S. Highway 52 is designated as \"Corporal Benjamin S. Kopp Bridge.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked Trunk Highway 65 from Isanti County State-Aid Highway 19, known as 305th Avenue NE, to the northerly limit of Cambridge Township is designated as \"Chip A. Imker Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked U.S. Highway 52 located within Dakota County is designated as \"Senator Jim Metzen Memorial Highway.\" Notwithstanding section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked U.S. Highway 12 within the city limits of Wayzata is designated as \"Officer Bill Mathews Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked Trunk Highway 95 in West Lakeland Township, Bayport, and Oak Park Heights from the intersection with signed Interstate Highway 94 to the intersection with marked Trunk Highway 36 is designated \"Corrections Officer Joseph Gomm Memorial Highway.\" Subject to section 161.139, the commissioner shall adopt a suitable design to mark this highway and erect appropriate signs.\nThat segment of marked Trunk Highway 25 from marked Trunk Highway 7 to Carver County State-Aid Highway 30 is designated as \"Captain Jeffrey Vollmer Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\n(a) The following route between the city of Jordan and marked U.S. Highway 61 is designated as the \"Richard J. Ames Memorial Highway\":\nBeginning at a point at the eastern city limits of Jordan; thence extending easterly along marked Trunk Highway 282 to its junction with marked Trunk Highway 13; thence extending northerly along marked Trunk Highway 13 to its junction with Eagle Creek Avenue in the city limits of Prior Lake; thence extending easterly along Eagle Creek Avenue and 185th Street East to its junction with Kenwood Trail and Dakota County State-Aid Highway 50; thence extending easterly and southerly along Kenwood Trail and Dakota County State-Aid Highway 50 to its junction with marked Trunk Highway 3 in the city limits of Farmington; thence extending southerly along marked Trunk Highway 3 to its junction with marked Trunk Highway 50; thence extending easterly along marked Trunk Highway 50 to its terminus at its junction with marked Trunk Highway 20 and marked U.S. Highway 61 near Miesville.\n(b) Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs on the trunk highway portions of the route, and the local road authorities must erect appropriate signs on the local roadway portions of the route, with the cost of the signs to be paid by nonpublic sources of funds.\nThat segment of marked Trunk Highway 23 in Kandiyohi County between New London and Spicer is designated as \"Ryane Clark Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\nThe bridge on marked U.S. Highway 53 over a mining area easterly of 2nd Avenue West in the city of Virginia is designated as \"Tom Rukavina Memorial Bridge.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this bridge and erect appropriate signs.\nThat segment of marked Interstate Highway 94 from Sauk Centre to Alexandria is designated as \"Kenneth E. Sellon and Eugene B. Schlotfeldt Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\nThe bridge on marked U.S. Highway 53 over marked Trunk Highway 37 in the city of Eveleth is designated as \"Specialist Noah Pierce Bridge.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this bridge and erect appropriate signs.\nThat segment of marked Trunk Highway 210 within Cass County is designated as \"State Trooper Ray Krueger Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs in the vicinity of the location where Trooper Krueger died.\nThe bridge on marked U.S. Highway 52 over Dakota County State-Aid Highway 42, known as 145th Street within the city of Rosemount, is designated as \"Warrant Officer Dennis A. Groth Memorial Bridge.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark the bridge and erect appropriate signs.\nThat segment of marked Trunk Highway 13 in Waseca County from the southern border of New Richland Township to the northern border of Blooming Grove Township is designated as \"Corporal Caleb L. Erickson Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\nThe segment of marked U.S. Highway 12 within the city limits of Howard Lake is designated as \"Chief Daryl \"Taddy\" Drusch Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\nThe bridge on marked U.S. Highway 52 over Dakota County State-Aid Highway 8, known as Wentworth Avenue, in the city of West Saint Paul, is designated as \"Private Joseph Marthaler Memorial Bridge.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark the bridge and erect appropriate signs.\nThe segment of marked Trunk Highway 11 from Roseau to Warroad is designated as \"Patrol Inspector Robert H. Lobdell Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\nThe segment of marked Trunk Highway 310 from Roseau to the border with Canada is designated as \"Deputy Richard K. Magnuson Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\nThe segment of marked Trunk Highway 5 from Hennepin County State-Aid Highway 60, known as Mitchell Road, in Eden Prairie, to the westerly side of the intersection with marked Trunk Highway 41, known as Hazeltine Boulevard, in Chanhassen is designated \"Prince Rogers Nelson Memorial Highway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs. The signs must be purple in color.\nThe overpass at the junction of marked Trunk Highway 29 and marked Trunk Highway 55 in Pope County is designated as \"Deputy Josh Owen Memorial Overpass.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark the overpass and erect appropriate signs.\nThe bridge over marked U.S. Highway 169 on Hennepin County State-Aid Highway 9, known as Rockford Road, in the city of Plymouth, is designated as \"Michael Gau Memorial Bridge.\" Notwithstanding section 161.139, the commissioner must adopt a suitable design to mark the bridge and erect appropriate signs.\nThat segment of marked U.S. Highway 169 from Itasca County State-Aid Highway 69 in the city of Marble to Saint Louis County State-Aid Highway 7 in the city of Mountain Iron is designated as \"Senator David J. Tomassoni Memorial Cross Range Expressway.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark this highway and erect appropriate signs.\nThe bridge on marked U.S. Highway 212 over the Minnesota River in the city of Granite Falls is designated as \"Mayor Dave Smiglewski Memorial Bridge.\" Subject to section 161.139, the commissioner must adopt a suitable design to mark the bridge and erect appropriate signs.\n(a) The bridge on marked Trunk Highway 55 and marked Trunk Highway 62 over the Minnesota River, commonly known as the Mendota Bridge, is designated as \"Gopher Gunners Memorial Bridge.\" Notwithstanding section 161.139, the commissioner must adopt a suitable design to mark the bridge and erect appropriate signs.\n(b) The adjutant general of the Department of Military Affairs must reimburse the commissioner of transportation for costs incurred under this subdivision.",
	"repealed": false
}