{
	"id": "62C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62C.02",
	"title": "62C.02 DEFINITIONS.",
	"text": "For the purposes of sections 62C.01 to 62C.23 the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of commerce or a person duly designated to act in the commissioner's place.\n\"Health service\" means any service or class of services, supply, drug, or equipment provided to an individual for diagnosis, relief, or treatment of an injury, ailment, or bodily condition.\n\"Subscriber\" means a person covered under a subscriber contract for health services to the extent therein described.\n\"Provider\" means an institution, organization, or person that furnishes health services either directly or pursuant to a prescription or directive from a person licensed by the state to make such a prescription or directive.\n\"Service plan corporation\" means a foreign or domestic nonprofit corporation which contracts for health service or payment therefor for subscribers pursuant to a service plan, in exchange for periodic prepayments by or on behalf of subscribers. An \"existing corporation\" means a service plan association or corporation legally in existence on August 1, 1971, and authorized to do business in this state on that date.\n\"Service plan\" means any program or other method whereby a service plan corporation, for a consideration, contracts for provision of health service to subscribers by providers who have entered service agreements with the service plan corporation or which provides for reimbursement to the subscriber for health service provided by providers who have not entered service agreements with the service plan corporation.\n\"Service agreement\" means an agreement, contract or other arrangement between a service plan corporation and a provider under which the provider agrees that when health services are provided for a subscriber the provider shall not make a direct charge against the subscriber for those services or parts of services which are covered by the subscriber's contract, but shall look to the service plan corporation for the payment for covered services, to the extent they are covered.\n\"Subscriber contract\" means a contract, agreement, or other arrangement between a service plan corporation and its subscriber under the terms and conditions of which health service or reimbursement therefor is provided to the subscriber.\n\"Participating provider\" means a provider who is party to a service agreement with a service plan corporation.",
	"repealed": false
}