{
	"id": "41B.049",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.049",
	"title": "41B.049 METHANE DIGESTER LOAN PROGRAM.",
	"text": "The authority shall establish and implement a methane digester loan program to help finance the purchase of necessary equipment and the construction or improvement of a system that utilizes manure to produce electricity.\nAll repayments of financial assistance granted under subdivision 1, including principal and interest, must be deposited into the revolving loan account established in section 41B.06.\nNotwithstanding section 41B.03, to be eligible for a loan under this section a borrower must:\n(1) locate the projects and utilize the equipment and practices on land located in Minnesota;\n(2) provide evidence of financial stability;\n(3) demonstrate an ability to repay the loan; and\n(4) provide evidence that the practices implemented and capital assets purchased will be properly managed and maintained.\n(a) The authority may make a direct loan or participate in a loan with an eligible lender to a farmer who is eligible under subdivision 3. Repayment terms of the authority's participation interest may differ from repayment terms of the lender's retained portion of the loan. Loans made under this section must be no-interest loans.\n(b) Application for a direct loan or a loan participation must be made on forms prescribed by the authority.\n(c) Standards for loan amortization shall be set by the Rural Finance Authority not to exceed ten years.\n(d) Security for the loans must be a personal note executed by the borrower and whatever other security is required by the eligible lender or the authority.\n(e) No loan proceeds may be used to refinance a debt existing prior to application.\n(f) The authority may impose a reasonable nonrefundable application fee for each application for a direct loan or a loan participation. The authority may review the application fees annually and make adjustments as necessary. The application fee is initially set at $100 for a loan under subdivision 1. The fees received by the authority must be deposited in the Rural Finance Authority administrative account established in section 41B.03.\n(a) To be eligible, a borrower must be a resident of Minnesota or an entity that is not prohibited from owning agricultural land under section 500.24.\n(b) State participation in a participation loan is limited to 45 percent of the principal amount of the loan. A direct loan or loan participation may not exceed $250,000.\n(c) Loans under this program may be used as a match for federal loans or grants.\n(d) A borrower who has previously received a loan under subdivision 1 may receive another methane digester loan under subdivision 1 if the previous loan has been repaid in full.",
	"repealed": false
}