{
	"id": "518A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.26",
	"title": "518A.26 DEFINITIONS.",
	"text": "For the purposes of this chapter and chapter 518, the terms defined in this section shall have the meanings respectively ascribed to them.\n\"Apportioned veterans' benefits\" means the amount the Veterans Administration deducts from the veteran's award and disburses to the child or the child's representative payee. The apportionment of veterans' benefits shall be that determined by the Veterans Administration and governed by Code of Federal Regulations, title 38, sections 3.450 to 3.458.\nArrears are amounts that accrue pursuant to an obligor's failure to comply with a support order. Past support and pregnancy and confinement expenses contained in a support order are arrears if the court order does not contain repayment terms. Arrears also arise by the obligor's failure to comply with the terms of a court order for repayment of past support or pregnancy and confinement expenses. An obligor's failure to comply with the terms for repayment of amounts owed for past support or pregnancy and confinement turns the entire amount owed into arrears.\n\"Basic support\" means the basic support obligation computed under section 518A.34. Basic support includes the dollar amount ordered for a child's housing, food, clothing, transportation, and education costs, and other expenses relating to the child's care. Basic support does not include monetary contributions for a child's child care expenses and medical and dental expenses.\n\"Child\" means an individual under 18 years of age, an individual under age 20 who is still attending secondary school, or an individual who, by reason of physical or mental condition, is incapable of self-support.\n\"Commissioner\" means the commissioner of children, youth, and families.\n\"Deposit account\" means funds deposited with a financial institution in the form of a savings account, checking account, NOW account, or demand deposit account.\n\"Financial institution\" means a savings association, bank, trust company, credit union, industrial loan and thrift company, bank and trust company, or savings association, and includes a branch or detached facility of a financial institution.\n\"Gross income\" means the gross income of the parent calculated under section 518A.29.\n\"Income withholding only services\" means the services provided by the public authority to collect payments pursuant to a support order but does not include other enforcement services provided by the public authority for IV-D cases. Notices required for income withholding under this section shall be initiated by the applicant for services. An obligation for spousal maintenance under subdivision 21, paragraph (a), clause (3), is only eligible for income withholding only services.\n\"IV-D case\" means a case where a party has assigned to the state rights to child support because of the receipt of public assistance as defined in section 518A.81 or has applied for child support services under title IV-D of the Social Security Act, United States Code, title 42, section 654(4). An obligation for spousal maintenance under subdivision 21, paragraph (a), clause (3), is not an IV-D case.\n\"Joint child\" means the dependent child who is the child of both parents in the support proceeding. In cases where support is sought from only one parent of a child, a joint child is the child for whom support is sought.\n\"Nonjoint child\" means the legal child of one, but not both of the parents in the support proceeding. Nonjoint child does not include stepchildren.\n\"Obligee\" means a person to whom payments for maintenance or support are owed.\n\"Obligor\" means a person obligated to pay maintenance or support. For purposes of ordering medical support under section 518A.41, a parent who has primary physical custody of a child may be an obligor subject to a payment agreement under section 518A.69. If a parent has more than 55 percent court-ordered parenting time, there is a rebuttable presumption that the parent has a zero dollar basic support obligation. A party seeking to overcome this presumption must show, and the court must consider, the following:\n(1) a significant income disparity, which may include potential income determined under section 518A.32;\n(2) the benefit and detriment to the child and the ability of each parent to meet the needs of the child; and\n(3) whether the application of the presumption would have an unjust or inappropriate result.\nThe presumption of a zero dollar basic support obligation does not eliminate a parent's obligation to pay child support arrears under section 518A.60. The presumption of a zero dollar basic support obligation does not apply to an action under section 518A.82, subdivision 1 or 1a.\n\"Parental income for determining child support,\" or \"PICS,\" means gross income minus deductions for nonjoint children allowed under section 518A.33.\n\"Payor of funds\" means a person or entity that provides funds to an obligor, including an employer as defined under chapter 24, section 3401(d), of the Internal Revenue Code, an independent contractor, payor of workers' compensation benefits or unemployment insurance benefits, or a financial institution as defined in section 13B.06.\nThe parent having \"primary physical custody\" means the parent who provides the primary residence for a child and is responsible for the majority of the day-to-day decisions concerning a child.\n\"Public authority\" means the local unit of government, acting on behalf of the state, that is responsible for child support enforcement or the Department of Children, Youth, and Families, Child Support Enforcement Division.\n\"Social Security benefits\" means the monthly retirement, survivors, or disability insurance benefits that the Social Security Administration provides to a parent for that parent's own benefit or for the benefit of a joint child. Social Security benefits do not include Supplemental Security Income benefits that the Social Security Administration provides to a parent for the parent's own benefit or to a parent due to the disability of a child.\n\"Support money\" or \"child support\" means an amount for basic support, child care support, and medical support pursuant to:\n(1) an award in a dissolution, legal separation, annulment, or parentage proceeding for the care, support and education of any child of the marriage or of the parties to the proceeding;\n(2) a contribution by parents ordered under section 518A.82; or\n(3) support ordered under chapter 518B or 518C.\n(a) \"Support order\" means a judgment, decree, or order, whether temporary, final, or subject to modification, issued by a court or administrative agency of competent jurisdiction:\n(1) for the support and maintenance of a child, including a child who has attained the age of majority under the law of the issuing state;\n(2) for a child and the parent with whom the child is living, that provides for monetary support, child care, medical support including expenses for confinement and pregnancy, arrearages, or reimbursement; or\n(3) for the maintenance of a spouse or former spouse.\n(b) The support order may include related costs and fees, interest and penalties, income withholding, and other relief. This definition applies to orders issued under this chapter and chapters 256, 257, 518, and 518C.\n\"Survivors' and dependents' educational assistance\" are funds disbursed by the Veterans Administration under United States Code, title 38, chapter 35, to the child or the child's representative payee.",
	"repealed": false
}