{
	"id": "116J.3951",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.3951",
	"title": "116J.3951 BROADBAND LINE EXTENSION PROGRAM.",
	"text": "A broadband line extension grant program is established in the Department of Employment and Economic Development. The purpose of the broadband line extension grant program is to award grants to eligible applicants in order to extend existing broadband infrastructure to unserved locations.\nNo later than November 1, 2022, the department must develop and implement a portal on the department's website that allows a person to report (1) that broadband service is unavailable at the physical address of the person's residence or business, and (2) any additional information that the department deems necessary to ensure that the broadband line extension grant program functions effectively. The department must develop a form that allows the information identified in this subdivision to be submitted on paper.\n(a) Beginning no later than six months after the date that the portal is implemented and every six months thereafter, the department must send to each broadband service provider serving Minnesota customers: (1) a list of addresses submitted to the portal under subdivision 2 during the previous six months; and (2) any additional information that the department deems necessary to ensure that the broadband line extension grant program functions effectively. The department must send the information required under this section via email.\n(b) No later than ten days after the date that the list in paragraph (a) is provided, a broadband service provider may notify the department of any posted address at which the broadband service provider's broadband service is available. The department must provide persons residing or doing business at those addresses with contact information for:\n(1) the broadband service provider with broadband service available at that address; and\n(2) programs administered by government agencies, nonprofit organizations, or the applicable broadband service provider that reduce the cost of broadband service and for which the persons may be eligible.\n(a) No later than ten days after the date that the notice requirement in subdivision 3, paragraph (b), expires, the department must notify each broadband service provider that the broadband service provider may participate in the reverse auction process under this subdivision. Within 60 days of the date that the notification is received, a broadband service provider may submit a bid to the department to extend the broadband service provider's existing broadband infrastructure to a location where broadband service is currently unavailable.\n(b) A bid submitted under this subdivision must include:\n(1) a proposal to extend broadband infrastructure to one or more of the addresses on the list sent by the department to the broadband service provider under subdivision 3, paragraph (a), at which broadband service is unavailable;\n(2) the amount of the broadband infrastructure extension's total cost that the broadband service provider proposes to pay;\n(3) the amount of the broadband infrastructure extension's total cost that the broadband service provider proposes that the department is responsible for paying; and\n(4) any additional information required by the department.\n(c) Financial assistance that the department provides under this section must be in the form of a grant issued to the broadband service provider. A grant issued under this section must not exceed $25,000 per line extension.\n(d) Within 60 days of the date that the bidding period closes, the department must review the bids submitted and select the broadband service provider bids that request the least amount of financial support from the state, provided that the department determines that the selected bids represent a cost-effective expenditure of state resources.\nThe department must enter into a line extension agreement with each winning bidder identified under subdivision 4, except that the department may not enter into a line extension agreement to serve any customer located within an area that will be served by a grant already awarded by the department under section 116J.395.\nA line extension agreement under subdivision 5 must contain the following terms:\n(1) the broadband service provider agrees to extend broadband infrastructure to support broadband service scalable to speeds of at least 100 megabits per second download and 100 megabits per second upload to each address included in the broadband service provider's winning bid;\n(2) the department agrees to pay the state's portion of the line extension cost in a grant issued to the broadband service provider upon the completion of the broadband infrastructure extension to each address in the broadband service provider's winning bid; and\n(3) the winning bidder has an exclusive right to apply the grant to the cost of the broadband infrastructure extension for a period of one year after the date that the agreement is executed.",
	"repealed": false
}