{
	"id": "342.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.30",
	"title": "342.30 CANNABIS CULTIVATOR LICENSING AND OPERATIONS.",
	"text": "A cannabis cultivator license entitles the license holder to grow cannabis plants within the approved amount of space from seed or immature plant to mature plant, harvest cannabis flower from a mature plant, package and label immature cannabis plants and seedlings and cannabis flower for sale to other cannabis businesses, transport cannabis flower to a cannabis manufacturer located on the same premises, and perform other actions approved by the office.\n(a) A cannabis cultivator that cultivates cannabis at an indoor facility may cultivate up to 30,000 square feet of plant canopy. The office may adjust plant canopy limits upward to meet market demand consistent with the goals identified in section 342.02, subdivision 1.\n(b) A cannabis cultivator that cultivates cannabis at an outdoor location may cultivate up to two acres of mature, flowering plants unless the office increases that limit. The office may increase the limit to no more than four acres if the office determines that expansion is consistent with the goals identified in section 342.02, subdivision 1.\nIn addition to the information required to be submitted under section 342.14, subdivision 1, and rules adopted pursuant to that section, a person, cooperative, or business seeking a cannabis cultivator license must submit the following information in a form approved by the office:\n(1) an operating plan demonstrating the proposed size and layout of the cultivation facility; plans for wastewater and waste disposal for the cultivation facility; plans for providing electricity, water, and other utilities necessary for the normal operation of the cultivation facility; and plans for compliance with the applicable building code and federal and state environmental and workplace safety requirements;\n(2) a cultivation plan demonstrating the proposed size and layout of the cultivation facility that will be used exclusively for cultivation including the total amount of plant canopy; and\n(3) evidence that the business will comply with the applicable operation requirements for the license being sought.\n(a) A person, cooperative, or business holding a cannabis cultivator license may also hold a cannabis manufacturing license, license to grow industrial hemp, and cannabis event organizer license.\n(b) Except as provided in paragraph (a), no person, cooperative, or business holding a cannabis cultivator license may own or operate any other cannabis business or hemp business. This prohibition does not prevent the transportation of cannabis flower from a cannabis cultivator to a cannabis manufacturer licensed to the same person, cooperative, or business and located on the same premises.\n(c) The office by rule may limit the number of cannabis cultivator licenses a person, cooperative, or business may hold.\n(d) For purposes of this subdivision, a restriction on the number or type of license a business may hold applies to every cooperative member or every director, manager, and general partner of a cannabis business.\nA cannabis cultivator must comply with the requirements in section 342.25.",
	"repealed": false
}