{
	"id": "248.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/248.07",
	"title": "248.07 COMMISSIONER OF EMPLOYMENT AND ECONOMIC DEVELOPMENT, DUTIES.",
	"text": "It shall be the duty of the commissioner of employment and economic development, referred to in this section and sections 248.10 and 248.11 as the commissioner, to develop and administer programs serving the needs of persons with a visual disability or persons who are blind and to cooperate with state and local boards and agencies both public and private. The commissioner shall create a division that is a distinct organizational unit to be known as State Services for the Blind, separate from the Vocational Rehabilitation Unit and with its own activity budget, within the Department of Employment and Economic Development to provide and coordinate services to the blind.\nThe commissioner shall collect statistics concerning blind persons including medical ophthalmological data, causes of blindness, opportunities for education, rehabilitation, training for employment, and any other information necessary to carry out the commissioner's duties and responsibilities with respect to persons with a visual disability or persons who are blind.\nThe commissioner shall give special attention to the cases of youth with a disability who are eligible to attend the Minnesota State Academy for the Blind, the Minnesota State Academy for the Deaf, or the public school classes for children with a disability, but are not in attendance there, or are not receiving adequate instruction elsewhere. The commissioner shall report all such cases to the school district of the individual's residence and to the commissioner of education.\nThe commissioner shall either provide or assist persons with a visual disability or who are blind in obtaining vocational training and employment and shall aid such persons in obtaining services and benefits to which they may be entitled from public and private agencies. Any person who shall be entitled to training under this subdivision shall have the right to choose from available programs such training as in the opinion of the person would be suitable and practical in accordance with rules adopted by the commissioner under subdivision 14a.\nThe commissioner shall further be empowered to aid persons who are blind or persons who are visually disabled: (1) by home instruction and training; (2) by assisting them in securing tools, appliances, and supplies; (3) by any other practicable means of improving their social, economic, or educational condition; (4) by providing to eligible persons, or purchasing for sale at cost plus handling charges, special materials and supplies needed by persons who are blind or persons with a visual disability that are difficult to obtain elsewhere; and (5) by promoting literacy and access to print materials through production for persons who are blind or persons with a visual disability or others of alternative reading formats such as Braille, audio tapes, radio signals, newspaper reading services, and other services originating from the division's Communication Center. Equipment may be leased or sold under written rehabilitation plans at cost plus handling charges to persons who wish to lease or purchase them. Receipts under this subdivision, as well as gifts to aid the blind, are subject to section 116J.035, subdivision 6.\nMS 1945 [Repealed, 1949 c 22 s 1]\n(a) Notwithstanding any other law, for the rehabilitation of blind persons the commissioner shall have exclusive authority to establish and to operate vending stands and vending machines in all buildings and properties owned or rented exclusively by the Minnesota State Colleges and Universities at a state university, a community college, a consolidated community technical college, or a technical college served by the commissioner before January 1, 1996, or by any department or agency of the state of Minnesota except the Department of Natural Resources properties operated directly by the Division of State Parks and not subject to private leasing. Vending stands and machines authorized under this subdivision may dispense nonalcoholic beverages, food, candies, tobacco, souvenirs, notions, and related items and must be operated on the same basis as other vending stands for the blind established and supervised by the commissioner under federal law. The commissioner shall waive this authority to displace any present private individual concessionaire in any state-owned or rented building or property who is operating under a contract with a specific renewal or termination date, until the renewal or termination date. With the consent of the governing body of a governmental subdivision of the state, the commissioner may establish and supervise vending stands and vending machines for the blind in any building or property exclusively owned or rented by the governmental subdivision.\n(b) The Department of Employment and Economic Development is not liable under chapter 176 for any injury sustained by a blind vendor's employee or agent. The Department of Employment and Economic Development, its officers, and its agents are not liable for the acts or omissions of a blind vendor or of a blind vendor's employee or agent that may result in the blind vendor's liability to third parties. The Department of Employment and Economic Development, its officers, and its agents are not liable for negligence based on any theory of liability for claims arising from the relationship created under this subdivision with the blind vendor.\n(a) The revolving fund created by Laws 1947, chapter 535, section 5, is continued as provided in this subdivision and shall be known as the revolving fund for vocational rehabilitation of the blind. It shall be used for the purchase of equipment and supplies for establishing and operating of vending stands by blind persons. All income, receipts, earnings, and federal vending machine income due to the operation of vending stands operated under this subdivision shall also be paid into the fund. All interest earned on money accrued in the fund must be credited to the fund by the commissioner of management and budget. All equipment, supplies, and expenses for setting up these stands shall be paid for from the fund.\n(b) The commissioner is authorized to use the money available in the revolving fund that originated as operational charges to individuals licensed under this subdivision for the establishment, operation, and supervision of vending stands by blind persons for the following purposes:\n(1) purchase, upkeep and replacement of equipment;\n(2) expenses incidental to the setting up of new stands and improvement of old stands;\n(3) reimbursement under section 15.059 to individual blind vending operators for reasonable expenses incurred in attending supervisory meetings as called by the commissioner and other expenditures for management services consistent with federal law; and\n(4) purchase of fringe benefits for blind vending operators and their employees such as group health insurance, retirement program, vacation or sick leave assistance provided that the purchase of any fringe benefit is approved by a majority vote of blind vending operators licensed pursuant to this subdivision after the commissioner provides to each blind vending operator information on all matters relevant to the fringe benefits. \"Majority vote\" means a majority of blind vending operators voting. Fringe benefits shall be paid only from assessments of operators for specific benefits, gifts to the fund for fringe benefit purposes, and vending income which is not assignable to an individual stand.\n(c) Money originally deposited as merchandise and supplies repayments by individuals licensed under this subdivision may be expended for initial and replacement stocks of supplies and merchandise. Money originally deposited from vending income on federal property must be spent consistent with federal law.\n(d) All other deposits may be used for the purchase of general liability insurance or any other expense related to the operation and supervision of vending stands.\n(e) The commissioner shall issue each license for the operation of a vending stand or vending machine for an indefinite period but may terminate any license in the manner provided. In granting licenses for new or vacated stands preference on the basis of seniority of experience in operating stands under the control of the commissioner shall be given to capable operators who are deemed competent to handle the enterprise under consideration. Application of this preference shall not prohibit the commissioner from selecting an operator from the community in which the stand is located.\nEach applicant selected by the commissioner for a license to operate a vending stand or vending machine shall be given training in the operation and conduct of such vending stand or vending machine.\nThe commissioner shall not revoke any license except for good cause shown. An opportunity for a fair hearing shall be afforded any operator within 30 days after revocation of license.\nAny major changes in policies made by the commissioner in the conduct of this program will be preceded by a public hearing. Each operator shall be given 30 days' notice of such hearing.\nThe commissioner shall obtain reimbursement from other states for the estimated cost of providing radio signals, programming, and radio receivers for the blind and for production and handling of Braille books, audio tapes, and related services for the blind distributed by the Department of Employment and Economic Development to users in such other states and may contract with the appropriate authorities of such states to effect such reimbursement. All money received hereunder shall be paid to the commissioner of management and budget and placed in the special revenue fund and is appropriated to the commissioner of employment and economic development for the purposes of this subdivision.\nFrom the funds appropriated for vocational rehabilitation of the blind and matching federal funds available for the purpose, the commissioner may make grants, upon such terms as the commissioner may determine, to public or nonprofit organizations for the establishment, maintenance or improvement of community rehabilitation programs.\nFrom funds provided by the state or the United States for the rehabilitation of blind persons, the commissioner may make provision for:\n(1) specialized supplementary training of professional workers employed by services for the blind, which shall consist of selected courses of study designed to improve worker techniques in providing assistance with adjustment to blindness, guidance, training and vocational placement services to blind children and adults;\n(2) the employment of student trainees enrolled in school programs. Such trainees to be employed on a part-time basis during the regular school term and on a full-time basis during the extra school term. Student trainees shall not be counted against the regular staff complement.\nThe commissioner shall adopt rules to set standards for the provision of rehabilitative services to persons with a visual disability or who are blind. The rules shall, at a minimum, contain program definitions and set standards for basic eligibility, including financial need eligibility and definitions of legal blindness.\nThe rules shall provide for the development of formal rehabilitation plans for eligible clients and shall govern the provision of direct rehabilitative services to clients, including placement in training programs, and providing tools and equipment. In addition, the rules shall set standards for appeals filed under subdivision 15 and include specific requirements for timely responses by the agency.\n(a) No person shall provide rehabilitation counseling services for the blind or hold themselves out as a qualified rehabilitation counselor for the blind unless the person is certified as a rehabilitation counselor by the director of State Services for the Blind.\n(b) A rehabilitation counselor for the blind is not a mental health practitioner.\n(c) A certified rehabilitation counselor for the blind shall have, in addition to any necessary education background for rehabilitation counselors in Minnesota, the following qualifications:\n(1) successful completion of a minimum of six weeks of intensive training under sleep shades from an adjustment-to-blindness center set forth by State Services for the Blind in the contracting process; and\n(2) completion of additional appropriate training as approved by the director of State Services for the Blind.\n(d) Each certified rehabilitation counselor for the blind shall, in the period since the counselor's certificate was issued or last renewed, complete continuing competency requirements as set forth by the director of State Services for the Blind.\nAn applicant for or recipient of rehabilitation service who is dissatisfied with an agency's action with regard to the furnishing or denial of services may file a request for administrative review and fair hearing in accordance with rules adopted under subdivision 14a.\n(a) The commissioner of employment and economic development shall enter into contracts or agreements to provide comprehensive adjustment-to-blindness training services to persons with a visual disability or who are blind. Services available must include, but not be limited to, instruction in Braille reading and writing, the use of the long white cane for independent travel, home management and self management, typing and computer technology, career exploration, and seminars on positive adjustment to blindness. In entering into contracts or agreements to provide adjustment-to-blindness services, the commissioner shall, when in the best interests of the client, utilize services available from qualified nonprofit agencies or organizations who:\n(1) are administered by a governing board composed of a majority of individuals who are blind;\n(2) substantially involve individuals who are blind in policy direction and management; and\n(3) employ individuals who are blind at all levels of operation.\n(b) This subdivision does not limit the commissioner's authority to enter into contracts or agreements for any service with other qualified agencies or organizations.",
	"repealed": false
}