{
	"id": "326.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.73",
	"title": "326.73 ASBESTOS CERTIFICATIONS.",
	"text": "Before an individual performs asbestos-related work, the individual shall first obtain a certificate from the commissioner certifying that the individual is qualified to perform the work. No certificate shall be issued unless the individual has shown evidence of training or experience in the general commercial construction trades, has taken a course of training in asbestos control and removal, passed an examination in those subjects, and demonstrated to the commissioner the ability to perform asbestos-related work safely in accordance with the current state-of-the-art technology. The commissioner shall specify the course of training necessary. The certificate issued by the commissioner shall be in writing, be dated when issued, contain an expiration date, be signed by the commissioner, and contain the name and address of the individual to whom it is issued. The certificate shall be carried by the individual and be readily available for inspection by the commissioner, other public officials charged with the health, safety, and welfare of the state's citizens, and the contracting entity.\nBefore an individual performs an asbestos inspection, the individual shall first obtain a certificate from the commissioner. The commissioner shall issue an asbestos inspector certificate to an individual who has shown evidence of completion of training on asbestos inspection specified by the commissioner in rule, passed an examination in that subject, and has shown evidence of experience as required by rule. The certificate issued by the commissioner shall be in writing, be dated when issued, contain an expiration date, be signed by the commissioner, and contain the name and address of the individual to whom it is issued.\nBefore an individual develops an asbestos management plan, the individual shall first obtain a certificate from the commissioner. The commissioner shall issue an asbestos management planner certificate to an individual who has shown evidence of completion of training on asbestos management plan development specified by the commissioner in rule, passed an examination in that subject, and has shown evidence of experience as required by rule. The certificate issued by the commissioner shall be in writing, be dated when issued, contain an expiration date, be signed by the commissioner, and contain the name and address of the individual to whom it is issued.\nBefore an individual designs an asbestos-related work project, the individual shall first obtain a certificate from the commissioner. The commissioner shall issue an asbestos project designer certificate to an individual who has shown evidence of completion of training on asbestos project design specified by the commissioner in rule, passed an examination in that subject, and has shown evidence of experience as required by rule. The certificate issued by the commissioner shall be in writing, be dated when issued, contain an expiration date, be signed by the commissioner, and contain the name and address of the individual to whom it is issued.",
	"repealed": false
}