{
	"id": "216B.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.27",
	"title": "216B.27 REHEARING; CONDITION PRECEDENT TO JUDICIAL REVIEW.",
	"text": "Within 20 days after the service by the commission of any decision constituting an order or determination, any party to the proceeding and any other person, aggrieved by the decision and directly affected thereby, may apply to the commission for a rehearing in respect to any matters determined in the decision. The commission may grant and hold a rehearing on the matters, or upon any of them as it may specify in the order granting the rehearing, if in its judgment sufficient reason therefor exists.\nThe application for a rehearing shall set forth specifically the grounds on which the applicant contends the decision is unlawful or unreasonable. No cause of action arising out of any decision constituting an order or determination of the commission or any proceeding for the judicial review thereof shall accrue in any court to any person or corporation unless the plaintiff or petitioner in the action or proceeding within 20 days after the service of the decision, shall have made application to the commission for a rehearing in the proceeding in which the decision was made. No person or corporation shall in any court urge or rely on any ground not so set forth in the application for rehearing.\nApplications for rehearing shall be governed by general rules which the commission may establish. In case a rehearing is granted the proceedings shall conform as nearly as may be to the proceedings in an original hearing, except as the commission may otherwise direct. If in the commission's judgment, after the rehearing, it shall appear that the original decision, order, or determination is in any respect unlawful or unreasonable, the commission may reverse, change, modify, or suspend the original action accordingly. Any decision, order, or determination made after the rehearing reversing, changing, modifying, or suspending the original determination shall have the same force and effect as an original decision, order, or determination. Only one rehearing shall be granted by the commission; but this shall not be construed to prevent any party from filing a new application or complaint. No order of the commission shall become effective while an application for a rehearing or a rehearing is pending and until ten days after the application for a rehearing is either denied, expressly or by implication, or the commission has announced its final determination on rehearing.\nAny application for a rehearing not granted within 60 days from the date of filing thereof, shall be deemed denied.\nIt is hereby declared that the legislative powers of the state, insofar as they are involved in the issuance of orders and decisions by the commission, have not been completely exercised until the commission has acted upon an application for rehearing, as provided for by this section and by the rules of the commission, or until the application for rehearing has been denied by implication, as above provided for.",
	"repealed": false
}