{
	"id": "161.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.45",
	"title": "161.45 UTILITY ON HIGHWAY RIGHT-OF-WAY; RELOCATION.",
	"text": "(a) Electric transmission, telephone, or telegraph lines; pole lines; community antenna television lines; railways; ditches; sewers; water, heat, or gas mains; gas and other pipelines; flumes; or other structures which, under the laws of this state or the ordinance of any city, may be constructed, placed, or maintained across or along any trunk highway, or the roadway thereof, by any person, persons, corporation, or any subdivision of the state, may be so maintained or hereafter constructed only in accordance with such rules as may be prescribed by the commissioner who shall have power to prescribe and enforce reasonable rules with reference to the placing and maintaining along, across, or in any such trunk highway of any of the utilities hereinbefore set forth.\n(b) Except as necessary to protect public safety or ensure the proper function of the trunk highway, including future expansions, the rules prescribed by the commissioner under paragraph (a) must not prohibit an entity from placing and maintaining electric transmission lines along, across, or in any trunk highway if the entity:\n(1) has a right to use the public road right-of-way pursuant to section 222.37, subdivision 1;\n(2) has a power purchase agreement or an agreement to transfer ownership with a Minnesota utility that directly, or through its members and agents, provides retail electric service in the state; and\n(3) obtains a permit from the commissioner.\n(c) The commissioner must decide whether to issue a permit to an entity within 60 days of receiving the entity's request.\n(d) Nothing herein shall restrict the actions of public authorities in extraordinary emergencies nor restrict the power and authority of the commissioner of commerce as provided for in other provisions of law. Provided, however, that in the event any local subdivision of government has enacted ordinances relating to the method of installation or requiring underground installation of such community antenna television lines, the permit granted by the commissioner of transportation shall require compliance with such local ordinance.\nWhenever the relocation of any utility facility is necessitated by the construction of a project on a trunk highway route, the relocation work may be made a part of the state highway construction contract or let as a separate contract as provided by law if the owner or operator of the facility requests the commissioner to act as its agent for the purpose of relocating the facilities and if the commissioner determines that such action is in the best interests of the state. Payment by the utility owner or operator to the state shall be in accordance with applicable statutes and the rules for utilities on trunk highways.\nIn proceedings to vacate, transfer, turn back, or otherwise convey an interest in real property owned or controlled by the department, when the property is owned in fee by the state, the commissioner may specify that the conveyance of the department's interest does not affect a prior, existing utility easement in the property or use of the property granted to a utility under permit issued by the department. In addition, the commissioner may convey interests in real property, including an easement, subject to the right of a utility to enter upon the right-of-way to maintain, repair, replace, reconstruct, improve, remove, or otherwise attend to its equipment. Where the utility had no preexisting easement over the real property, this subdivision does not prohibit a political subdivision, government agency, or private entity from negotiating or contracting with a utility with regard to the utility's easement or other interest in the property, but the utility shall continue to hold the interest in the property and the right of reasonable entry unless and until the utility agrees in writing to relinquish its interests.\n(a) For purposes of this subdivision and subdivisions 5 to 7, \"high voltage transmission line\" has the meaning given in section 216E.01, subdivision 4.\n(b) Notwithstanding subdivision 1, paragraph (a), high voltage transmission lines under the laws of this state or the ordinance of any city or county may be constructed, placed, or maintained across or along any trunk highway, including an interstate highway and a trunk highway that is an expressway or a freeway, except as deemed necessary by the commissioner of transportation to protect public safety or ensure the proper function of the trunk highway system.\n(c) If the commissioner denies a high voltage electric line colocation request, the reasons for the denial must be submitted for review within 90 days of the commissioner's denial to the chairs and ranking minority members of the legislative committees with jurisdiction over energy and transportation, the Public Utilities Commission executive secretary, and the commissioner of commerce.\nUpon written request, the commissioner must engage in coordination activities with a utility or transmission line developer to review requested highway corridors for potential permitted locations for transmission lines. The commissioner must assign a project coordinator within 30 days of receiving the written request. The commissioner must share all known plans with affected utilities or transmission line developers on potential future projects in the highway corridor if the potential highway project impacts the placement or siting of high voltage transmission lines.\n(a) If the commissioner and a utility or transmission line developer identify a permittable route along a trunk highway corridor for possible colocation of transmission lines, a constructability report must be prepared by the utility or transmission line developer in consultation with the commissioner. A constructability report developed under this subdivision must be used by both parties to plan and approve colocation projects.\n(b) A constructability report developed under this section between the commissioner and the parties seeking colocation must include terms and conditions for building the colocation project. Notwithstanding the requirements in subdivision 1, the report must be approved by the commissioner and the party or parties seeking colocation prior to the commissioner approving and issuing a permit for use of the trunk highway right-of-way.\n(c) A constructability report must include an agreed upon time frame for which there may not be a request from the commissioner for relocation of the transmission line. If the commissioner determines that relocation of a transmission line in the trunk highway right-of-way is necessary, the commissioner, as much as practicable, must give a four-year advance notice.\n(d) Notwithstanding the requirements of subdivision 7 and section 161.46, subdivision 2, if the commissioner requires the relocation of a transmission line in the interstate highway right-of-way earlier than the agreed upon time frame in paragraph (c) in the constructability report or provides less than a four-year notice of relocation in the agreed upon constructability report, the commissioner is responsible for 75 percent of the relocation costs.\n(a) A high voltage transmission line that receives a route permit under chapter 216E on or after July 1, 2024, is not eligible for relocation reimbursement under section 161.46, subdivision 2.\n(b) If the commissioner orders relocation of a high voltage transmission line that is subject to paragraph (a):\n(1) a public utility, as defined in section 216B.02, subdivision 4, may recover its portion of costs of relocating the line that the Public Utilities Commission deems prudently incurred as a transmission cost adjustment pursuant to section 216B.16, subdivision 7b; and\n(2) a consumer-owned utility, as defined in section 216B.2402, subdivision 2, may recover its portion of costs of relocating the line in any manner approved by its governing board.",
	"repealed": false
}