{
	"id": "355.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/355.07",
	"title": "355.07 DECLARATION OF POLICY.",
	"text": "(a) In order to extend to employees of the state, its political subdivisions, and its other governmental employers, and to the dependents and survivors of the employees of those employing units, the basic protection accorded to others by the old age, survivors, and disability insurance system embodied in the Social Security Act, it is hereby declared to be the policy of the legislature, subject to the limitations of this chapter, that these steps are taken to provide protection to employees of the state and its political subdivisions on as broad a basis as may be authorized by the legislature and is permitted under the Social Security Act.\n(b) It is also the policy of the legislature that the protection afforded employees in positions covered by a retirement system on the date an agreement under this chapter is made applicable to service performed in those positions, or receiving periodic benefits under the retirement system at that time, will not be impaired as a result of making the agreement so applicable or as a result of legislative enactment in anticipation thereof when combined with the benefits accorded the employee by the Social Security Act.\n(c) To this end, the agreement referred to in section 355.02 must not be made applicable to any service performed in any position covered by a retirement system unless a referendum is first held by secret ballot in which a majority of \"eligible employees,\" as defined in section 218(d)(3) of the Social Security Act, vote in favor thereof, or unless a retirement system is divided in two divisions or parts, one of which is composed of positions of members of the system who desire coverage and one of which is composed of positions of members of the system who do not desire coverage under section 218(d)(3) of the Social Security Act, in accordance with subsections (6) and (7) thereof. The cost of the referendum must be borne by the affected governmental subdivision or subdivisions, which are required to elect a voting method.\n(d) If a retirement system is divided as described in paragraph (c), any member of the division of members that did not desire coverage may be transferred to the division of members who did desire coverage as provided in section 218(d)(6)(f) of the Social Security Act so long as the individual files a written request for such a transfer with the director.\n(e) Nothing in any provision of this chapter authorizes the extension of the insurance system established by this chapter, to service in any police officer's or firefighter's position as covered by a retirement system in section 356.30, subdivision 3, clauses (4) and (7).",
	"repealed": false
}