{
	"id": "85.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.013",
	"title": "85.013 STATE RECREATION AREAS AND WAYSIDES.",
	"text": "(a) Designated recreation reserves and waysides heretofore established and hereby confirmed as state recreation areas and state waysides together with the counties in which they are situated are listed in this section and shall hereafter be named as indicated in this section.\n(b) Any land that now is or hereafter becomes tax-forfeited land and is located within the described boundaries of a state recreation area as defined by session laws is hereby withdrawn from sale and is transferred from the custody, control, and supervision of the county board of the county to the commissioner of natural resources, free from any trust in favor of the interested taxing districts. The commissioner shall execute a certificate of acceptance of the lands on behalf of the state for such purposes and transmit the same to the county auditor of the county for record as provided by law in the case of tax-forfeited land transferred to the commissioner by resolution of the county board for conservation purposes.\n1969 c 524 s 3; 1Sp2003 c 13 s 2; 2008 c 357 s 16\n[Repealed, 1975 c 353 s 41]\nBelle Plaine State Wayside, Carver, Scott and Sibley Counties.\n1969 c 879 s 2 subd 2(d)\n[Repealed, 2011 c 107 s 108]\nBig Bog State Recreation Area, Beltrami County.\n2000 c 488 art 3 s 20; 2000 c 492 art 1 s 37; 2001 c 182 s 4 subd 1, s 5; 2002 c 366 s 10 subd 1; 1Sp2003 c 13 s 9 subd 1\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1975 c 353 s 41]\nCaribou Falls State Wayside, Lake County, which is hereby renamed from Caribou Falls State Park.\n1947 c 179 s 1; 1969 c 524 s 3\nCarver Rapids State Wayside, Scott County.\n1969 c 879 s 2 subd 2(b)\n[Repealed, 1975 c 353 s 41]\nCuyuna Country State Recreation Area, Crow Wing County.\n1993 c 172 s 34; 2002 c 366 s 10 subd 2, s 11; 2004 c 262 art 2 s 12\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1999 c 157 s 7]\nDevils Track Falls State Wayside, Cook County, which is hereby renamed from Devils Track Falls State Park.\nEx1961 c 60 s 4; 1969 c 524 s 3\nFlood Bay State Wayside, Lake County, which is hereby renamed from Flood Bay Wayside Park.\n1965 c 566 s 1; 1969 c 524 s 3; 1984 c 599 s 3; 1986 c 432 s 3\n[Repealed, 1975 c 353 s 41]\nGarden Island State Recreation Area; Lake of the Woods County.\n1998 c 391 s 3; 2001 c 182 s 4 subd 2; 2008 c 368 art 1 s 22\nGreenleaf Lake State Recreation Area, Meeker County, which is hereby renamed from Greenleaf Lake State Park.\n1Sp2003 c 13 s 6; 2004 c 262 art 2 s 10; 2007 c 57 art 1 s 39,167,170; 2011 c 98 s 6 subd 1; 2012 c 236 s 7 subd 1; 2014 c 217 s 5\nInspiration Peak State Wayside, Otter Tail County, which is hereby renamed from Inspiration Peak Park.\n1931 c 395 s 7(15); 1969 c 524 s 3\nIron Range Off-Highway Vehicle Recreation Area, St. Louis County.\n1996 c 407 s 32; 1997 c 192 s 2; 1999 c 231 s 99 subd 1; 2000 c 393 s 1; 1Sp2003 c 13 s 9 subd 2; 2006 c 236 art 1 s 8 subd 1; 2011 c 98 s 6 subd 2; 2012 c 236 s 7 subd 2, s 8; 1Sp2021 c 6 art 2 s 111\n[Repealed, 1995 c 215 s 3]\nJoseph R. Brown State Wayside, Renville County, which is hereby renamed from Joseph R. Brown Memorial Park.\nEx1937 c 87 s 1; 1969 c 524 s 3\nKodonce River State Wayside, Cook County, which is hereby renamed from Kodonce River State Park.\n1947 c 180 s 1; 1969 c 524 s 3\nLa Salle Lake State Recreation Area, Hubbard County.\n1Sp2011 c 6 art 3 s 6,8,9\n[Repealed, 1994 c 448 s 4]\nLawrence State Wayside, Scott County.\n1969 c 879 s 2 subd 2(c)\n[Repealed, 1975 c 353 s 41]\nMinnesota Valley State Recreation Area, Hennepin, Dakota, Scott, Carver, Sibley, and Le Sueur Counties.\n1994 c 448 s 2; 2003 c 24 s 1; 2006 c 236 art 1 s 8 subd 2\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1994 c 448 s 4]\n[Repealed, 1987 c 128 s 4]\n[Repealed, 1995 c 215 s 3]\nRed River State Recreation Area, Polk County.\n2000 c 488 art 3 s 21; 2000 c 492 art 1 s 38\nRay Berglund State Wayside, Cook County, which is hereby renamed from Ray Berglund State Scenic Memorial Wayside.\n1951 c 207; 1967 c 787 s 3 subd 20; 1969 c 524 s 3; 1969 c 879 s 1 subd 10\n[Repealed, 1987 c 128 s 5]\n[Repealed, 2008 c 357 s 40]\nSaint Croix Boom Site Wayside, Washington County.\n2016 c 154 s 1,12\nSaint Croix Islands Recreation Area, Washington County, which is hereby renamed from Saint Croix Islands Scenic Reserve.\n1935 c 340 s 1; 1969 c 524 s 3; 1994 c 448 s 2\nSam Brown Memorial State Wayside, Traverse County, which is hereby renamed from Sam Brown State Park.\n1929 c 357 s 1; 1969 c 524 s 3\n[Repealed, 1994 c 448 s 1]\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1994 c 448 s 1]\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1994 c 448 s 1]",
	"repealed": false
}