{
	"id": "16C.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.06",
	"title": "16C.06 PROCUREMENT REQUIREMENTS.",
	"text": "Unless otherwise required by law, public notice of solicitations is required for all purchases for goods and general services, professional and technical services contracts, and construction estimated to be more than $25,000, or $100,000 in the case of the Department of Transportation. To the extent practical, this must include posting on a state website. The manner of publication shall be designated by the commissioner. Notice requirements for procurement transactions $25,000 and under shall be determined by the commissioner.\n(a) A formal solicitation must be used to acquire all goods, service contracts, and utilities estimated at or more than $50,000, or in the case of a Department of Transportation solicitation, at or more than $100,000, unless otherwise provided for. Formal responses must be authenticated by the responder in a manner specified by the commissioner.\n(b) An informal solicitation may be used to acquire all goods, service contracts, and utilities that are estimated at less than $50,000, or in the case of a Department of Transportation solicitation, at or less than $100,000. The number of vendors required to receive solicitations may be determined by the commissioner. Informal responses must be authenticated by the responder in a manner specified by the commissioner.\n[Repealed, 2001 c 202 s 21]\n[Repealed by amendment, 2014 c 196 art 2 s 6]\n(a) For goods, general services, and building construction, the combined contract and amendments must not exceed five years without specific, written approval by the commissioner according to established policy, procedures, and standards, or unless otherwise provided for by law. The term of the original contract must not exceed two years unless the commissioner determines that a longer duration is in the best interest of the state.\n(b) For professional or technical services, the combined contract and amendments must not exceed five years, unless otherwise provided for by law. The term of the original contract must not exceed two years unless the commissioner determines that a longer duration is in the best interest of the state.\n(c) The term of a contract may be extended for a time longer than the time specified in this section, up to a total term of ten years, if the commissioner, in consultation with the commissioner of management and budget, determines that the contractor will incur upfront costs under the contract that cannot be recovered within a two-year period and that will provide cost savings to the state and that these costs will be amortized over the life of the contract.\n(d) The commissioner is authorized to enter into or approve a written agreement not to exceed 31 years with a district heating or cooling utility that will specify, but not be limited to, the appropriate terms and conditions for the interchange of district heating or cooling services.\nThe commissioner may award a contract to more than one vendor if, in the opinion of the commissioner, it is in the best interest of the state.\n[Repealed by amendment, 2014 c 196 art 2 s 6]\n(a) Contract awards shall be made utilizing requests for bids, requests for proposals, reverse auctions as provided in section 16C.10, subdivision 7, or other methods provided by law, unless a section of law requires a particular method of acquisition to be used. The determination of the acquisition method and all decisions involved in the acquisition process, unless otherwise provided for by law, shall be determined by the commissioner. The commissioner is authorized to utilize tools, including but not limited to contract consolidation, product standardization, and mandatory-use enterprise contracts to the extent determined to be in the best interest of the state.\n(b) Awards based on competitive proposals must include an evaluation of price and other considerations, such as environmental considerations, quality, and vendor performance. The solicitation document used to obtain competitive proposals must state the relative importance of price and the other factors.\n(c) Awards based on a low bid process must be made to the lowest responsive and responsible bidder, taking into consideration conformity with the specifications, terms of delivery, the purpose for which the contract or purchase is intended, the status and capability of the vendor, and other considerations imposed in the request for bids. The commissioner may decide which is the lowest responsible bidder for all purchases and may use the principles of life-cycle costing, where appropriate, in determining the lowest overall bid.\nAcquisition of goods and services must be awarded according to the provisions of this chapter except that a resident vendor shall be allowed a preference over a nonresident vendor from a state that gives or requires a preference to vendors from that state. The preference shall be equal to the preference given or required by the state of the nonresident vendor.\nSubdivision 7 does not apply to a contract for any project in which federal funds are expended.\nAt the discretion of the commissioner, any or all responses may be rejected if it is determined to be in the best interest of the state.\nThe preferences provided for under subdivision 7 and sections 16C.0725 and 16C.16 are not cumulative. The total percentage of preference granted on a contract may not exceed the highest percentage of preference allowed for that contract under any one of these statutory sections.\nAgencies are encouraged to contract with small targeted group businesses designated under section 16C.16 when entering into contracts that are not subject to competitive bidding procedures.\nThe commissioner shall require that the terms of any contract include a certification of the vendor's compliance with all requirements of this chapter in entering and executing the contract.",
	"repealed": false
}