{
	"id": "354.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.70",
	"title": "354.70 CONSOLIDATION OF MINNEAPOLIS TEACHERS RETIREMENT FUND ASSOCIATION.",
	"text": "All active, inactive, and retired members of the Minneapolis Teachers Retirement Fund Association are transferred to the Teachers Retirement Association and are no longer members of the Minneapolis Teachers Retirement Fund Association as of July 1, 2006.\nA person first hired as a teacher by Special School District No. 1, Minneapolis, after June 30, 2006, and who is a teacher as defined in section 354.05, subdivision 2, is a member of the Teachers Retirement Association for the person's teaching service.\nAll allowable service and salary credit of the members and other individuals transferred under subdivision 1 as specified in the records of the Minneapolis Teachers Retirement Fund Association on the transfer date is allowable service credit under section 354.05, subdivision 13, formula service credit under section 354.05, subdivision 25, and salary credit under section 354.05, subdivision 35, for the Teachers Retirement Association.\nOn or before June 30, 2006, the chief administrative officer of the Minneapolis Teachers Retirement Fund Association shall transfer all records and documents relating to the funds and the benefit plans of the association to the executive director of the Teachers Retirement Association. To the extent possible, original copies of all records and documents must be transferred.\n(a) On or before June 30, 2006, the chief administrative officer of the Minneapolis Teachers Retirement Fund Association shall transfer to the Teachers Retirement Association the entire assets of the special retirement fund of the Minneapolis Teachers Retirement Fund Association. The transfer of the assets of the Minneapolis Teachers Retirement Fund Association special retirement fund must include any accounts receivable that are determined by the executive director of the State Board of Investment as reasonably capable of being collected. Legal title to account receivables that are determined by the executive director of the State Board of Investment as not reasonably capable of being collected transfers to Special School District No. 1, Minneapolis, as of the date of the determination of the executive director of the State Board of Investment. If the account receivables transferred to Special School District No. 1, Minneapolis, are subsequently recovered by the school district, the superintendent of Special School District No. 1, Minneapolis, shall transfer the recovered amount to the executive director of the Teachers Retirement Association, in cash, for deposit in the teachers retirement fund, less the reasonable expenses of the school district related to the recovery.\n(b) As of June 30, 2006, assets of the special retirement fund of the Minneapolis Teachers Retirement Fund Association are assets of the Teachers Retirement Association to be invested by the State Board of Investment pursuant to the provisions of section 354.07, subdivision 4. The Teachers Retirement Association is the successor in interest to all claims which the Minneapolis Teachers Retirement Fund Association may have or may assert against any person and is the successor in interest to all claims which could have been asserted against the former Minneapolis Teachers Retirement Fund Association, subject to the following exceptions and qualifications:\n(1) the Teachers Retirement Association is not liable for any claim against the Minneapolis Teachers Retirement Fund Association, its former board or board members, which is founded upon a claim of breach of fiduciary duty, where the act or acts constituting the claimed breach were not done in good faith;\n(2) the Teachers Retirement Association may assert any applicable defense to any claim in any judicial or administrative proceeding that the former Minneapolis Teachers Retirement Fund Association or its board would otherwise have been entitled to assert;\n(3) the Teachers Retirement Association may assert any applicable defense that the Teachers Retirement Association may assert in its capacity as a statewide agency; and\n(4) the Teachers Retirement Association shall indemnify any former fiduciary of the Minneapolis Teachers Retirement Fund Association consistent with the provisions of the Public Pension Fiduciary Responsibility Act, in section 356A.11.\n(c) From the assets of the former Minneapolis Teachers Retirement Fund Association transferred to the Teachers Retirement Association, an amount equal to the percentage figure that represents the ratio between the market value of the Minnesota postretirement investment fund as of June 30, 2006, and the required reserves of the Minnesota postretirement investment fund as of June 30, 2006, applied to the present value of future benefits payable to annuitants of the former Minneapolis Teachers Retirement Fund Association as of June 30, 2006, including any postretirement adjustment from the Minnesota postretirement investment fund expected to be payable on January 1, 2007, must be transferred to the Minnesota postretirement investment fund. The executive director of the State Board of Investment shall estimate this ratio at the time of the transfer. By January 1, 2007, after all necessary financial information becomes available to determine the actual funded ratio of the Minnesota postretirement investment fund, the postretirement investment fund must refund to the Teachers Retirement Association any excess assets or the Teachers Retirement Association must contribute any deficiency to the Minnesota postretirement investment fund with interest under Minnesota Statutes 2008, section 11A.18, subdivision 6. The balance of the assets of the former Minneapolis Teachers Retirement Fund Association after the transfer to the Minnesota postretirement investment fund must be credited to the Teachers Retirement Association.\n(d) If the assets transferred by the Minneapolis Teachers Retirement Fund Association to the Teachers Retirement Association are insufficient to meet its obligation to the Minnesota postretirement investment fund, additional assets must be transferred by the executive director of the Teachers Retirement Association to meet the amount required.\n(a) For every deferred, inactive, disabled, and retired member of the Minneapolis Teachers Retirement Fund Association transferred under subdivision 1, and the survivors of these members, annuities or benefits earned before the date of the transfer, other than future postretirement adjustments, must be calculated and paid by the Teachers Retirement Association under the laws, articles of incorporation, and bylaws of the former Minneapolis Teachers Retirement Fund Association that were in effect relative to the person on the date of the person's termination of active service covered by the former Minneapolis Teachers Retirement Fund Association.\n(b) Former Minneapolis Teachers Retirement Fund Association members who retired before July 1, 2006, must receive postretirement adjustments after December 31, 2006, only as provided in Minnesota Statutes 2008, section 11A.18 or section 356.415. All other benefit recipients of the former Minneapolis Teachers Retirement Fund Association must receive postretirement adjustments after December 31, 2006, only as provided in section 356.415.\n(c) This consolidation does not impair or diminish benefits for an active, deferred, or retired member or a survivor of an active, deferred, or retired member under the former Minneapolis Teachers Retirement Fund Association in existence at the time of the consolidation, except that any future guaranteed or investment-related postretirement adjustments must be paid after July 1, 2006, in accordance with paragraph (b), and all benefits based on service on or after July 1, 2006, must be determined only by laws governing the Teachers Retirement Association.\n(a) As of June 30, 2006, the Minneapolis Teachers Retirement Fund Association ceases to exist.\n(b) Contracts, records, and obligations of the Minneapolis Teachers Retirement Fund Association special retirement fund existing at the time of consolidation with the Teachers Retirement Association are transferred to the Teachers Retirement Association pursuant to the provisions of section 15.039, subdivisions 5 and 5a, except that contracts, records, and obligations of the Minneapolis Teachers Retirement Fund Association special retirement fund related to investment and safekeeping of assets are transferred to the State Board of Investment pursuant to the provisions of section 15.039, subdivisions 5 and 5a. The State Board of Investment has the authority to pay the investment-related liabilities and obligations from the assets transferred from the Minneapolis Teachers Retirement Fund Association incurred by the Teachers Retirement Association. The audit or examination of the Minneapolis Teachers Retirement Fund Association for year-end June 30, 2006, must be performed by either the state auditor or the legislative auditor under an agreement with the Teachers Retirement Association. The costs of the audit or examination must be paid by the Teachers Retirement Association. Between May 27, 2006, and June 30, 2006, the Minneapolis Teachers Retirement Fund Association cannot incur a new or additional enforceable contractual liability or obligation without approval of the Teachers Retirement Association.",
	"repealed": false
}