{
	"id": "47.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.58",
	"title": "47.58 REVERSE MORTGAGE LOANS.",
	"text": "For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Reverse mortgage loan\" means a loan:\n(1) made to a borrower wherein the committed principal amount is paid to the borrower in equal or unequal installments over a period of months or years, interest is assessed, and authorized closing costs are incurred as specified in the loan agreement;\n(2) which is secured by a mortgage on residential property owned solely by the borrower; and\n(3) which is due upon the death of the last surviving borrower, or upon the borrower terminating use of the property as principal residence so as to disqualify the property from the homestead credit refund given in chapter 290A.\n(b) \"Lender\" means any bank subject to chapter 48, credit union subject to chapter 52, savings bank organized and operated pursuant to chapter 50, savings association subject to chapter 51A, any residential mortgage originator subject to chapter 58, or any insurance company as defined in section 60A.02, subdivision 4. Lender includes any federally chartered bank supervised by the comptroller of the currency or federally chartered credit union supervised by the National Credit Union Administration, to the extent permitted by federal law.\n(c) \"Borrower\" includes any natural person holding an interest in severalty or as joint tenant or tenant-in-common in the property securing a reverse mortgage loan.\n(d) \"Outstanding loan balance\" means the current net amount of money owed by the borrower to the lender whether or not that sum is suspended pursuant to the terms of the reverse mortgage loan agreement or is immediately due and payable. The outstanding loan balance is calculated by adding the current totals of the items described in clauses (1) to (5) and subtracting the current totals of the item described in clause (6):\n(1) The sum of all payments made by the lender which are necessary to clear the property securing the loan of any outstanding mortgage encumbrance or mechanics or material supplier's lien.\n(2) The total disbursements made by the lender to date pursuant to the loan agreement as formulated in accordance with subdivision 3.\n(3) All taxes, assessments, insurance premiums and other similar charges paid to date by the lender pursuant to subdivision 6, which charges were not reimbursed by the borrower within 60 days.\n(4) All actual closing costs which the borrower has deferred, if a deferral provision is contained in the loan agreement as authorized by subdivision 7.\n(5) The total accrued interest to date, as authorized by subdivision 5.\n(6) All payments made by the borrower pursuant to subdivision 4.\n(e) \"Actual closing costs\" mean reasonable charges or sums ordinarily paid at the time of closing for the following, whether or not retained by the lender:\n(1) Any insurance premiums on policies covering the mortgaged property including but not limited to premiums for title insurance, fire and extended coverage insurance, flood insurance, and private mortgage insurance.\n(2) Abstracting, title examination and search, and examination of public records related to the mortgaged property.\n(3) The preparation and recording of any or all documents required by law or custom for closing a reverse mortgage loan agreement.\n(4) Appraisal and survey of real property securing a reverse mortgage loan.\n(5) A single service charge, which service charge shall include any consideration, not otherwise specified in this section as an \"actual closing cost,\" paid by the borrower to the lender for or in relation to the acquisition, making, refinancing or modification of a reverse mortgage loan, and shall also include any consideration received by the lender for making a commitment for a reverse mortgage loan, whether or not an actual loan follows the commitment. The service charge shall not exceed one percent of the bona fide committed principal amount of the reverse mortgage loan.\n(6) Charges and fees necessary for or related to the transfer of real property securing a reverse mortgage loan or the closing of a reverse mortgage loan agreement paid by the borrower and received by any party other than the lender.\n(f) \"Reverse mortgage loan servicer\" or \"servicer\" means a person who performs servicing for a reverse mortgage loan.\n(g) \"Servicing\" has the meaning given in section 58.02, subdivision 22. For purposes of this section, servicing includes disbursing loan proceeds to a borrower and determining whether a borrower continues to occupy the secured property as the borrower's primary residence.\n(h) \"Third-party designee\" means an individual whom the borrower designates in the reverse mortgage loan agreement to receive the communications described in subdivision 6a from a servicer.\nPursuant to rules which the commissioner of commerce may find to be necessary and proper, if any, and subject to federal laws and regulations, lenders may make investments in reverse mortgage loans and purchases of obligations representing reverse mortgage loans, provided the aggregate total of committed principal of the investment in reverse mortgage loans by any bank, savings bank, or savings association, does not exceed five percent of that lender's total deposits and savings accounts. This limitation shall be determined at each June 30 and December 31 for the following six-month period. Any decline in the total of deposits and savings accounts subsequent to a determination may be disregarded. Security for loans made under this section shall be a first lien on residential property (a) which the borrower occupies as principal residence and which qualifies for homestead classification pursuant to section 273.13, and (b) to which the borrower alone has title.\nThe committed principal amount of a reverse mortgage loan shall be paid to the borrower over the period of months or years as specified in the loan agreement. The borrower and lender may, by written agreement, amend the loan agreement from time to time. Pursuant to the terms of the contract the borrower shall make repayment to the lender upon the occurrence of any of the events specified in clauses (1) to (4);\n(1) upon sale of the property securing the loan;\n(2) upon the death of the last surviving borrower;\n(3) upon the borrower terminating use of the property as principal residence so as to disqualify the property from homestead classification under section 273.13; or\n(4) upon renegotiation of the terms of the reverse mortgage loan agreement, unless the parties agree in writing to postpone repayment.\nExcept as otherwise provided in this subdivision, the outstanding loan balance as projected by the lender to the anticipated time of payment to the borrower of the final installment of committed principal shall not exceed 80 percent of the appraised value of the property at inception of the loan. If upon reappraisal of the property made at any time during the term of the loan, the projected outstanding loan balance does not exceed 70 percent of the reappraised value of the property, the schedule of the lender's installment payments may be extended and the amount of the committed principal amount increased, provided the revised outstanding loan balance at payment of the lender's final installment of committed principal does not exceed 80 percent of the reappraised value of the property.\nThe installments may be extended by written agreement of the parties and repayment or partial repayment of the outstanding loan balance may be made at any time without penalty, except that partial repayment may be made not more often than once per year and in no amount less than $1,000. The borrower may cancel the reverse mortgage loan at any time without penalty by payment of the outstanding loan balance.\nNotwithstanding the provisions of section 334.01, subdivision 1, lenders may make reverse mortgage loans and purchases of obligations representing reverse mortgage loans, at an interest rate or loan yield not in excess of the maximum lawful interest rate prescribed for conventional loans by section 47.20, subdivision 4a. If section 47.20, subdivision 4a expires, the interest rate last published pursuant to the provisions of section 47.20, subdivision 4a shall be the maximum lawful interest rate for reverse mortgage loans. A contract rate within the maximum lawful interest rate applicable to a reverse mortgage loan at the time the loan is made shall be the maximum lawful interest rate for the term of the reverse mortgage loan.\nNotwithstanding the provisions of section 334.01, subdivision 1, a reverse mortgage loan agreement may provide that interest will be added to the outstanding loan balance monthly as it accrues, with interest accruing on the outstanding loan balance at a rate not to exceed the rate of interest permitted under this subdivision at the time of the signing of the original loan agreement or any subsequent extension agreement.\nThe borrower shall pay real estate taxes, assessments and insurance premiums on the property securing the loan, and the lender may require the borrower to provide evidence of payment. Mortgage registry tax required under sections 287.01 to 287.12 must be paid at the time of the recording or registering of the original reverse mortgage. If the borrower does not make timely payment the lender may pay taxes, assessments, insurance premiums and other similar charges for the protection of the property securing its loan and may add these payments to the outstanding loan balance if not repaid by the borrower within 60 days after the borrower receives notice that the lender has made the payment.\n(a) The reverse mortgage loan servicer must send by first-class mail copies of unanswered written communications and all subsequent written communications from the servicer to the borrower regarding delinquencies, defaults, and unfulfilled obligations that may result in foreclosure under a reverse mortgage loan agreement to a third-party designee at the address listed on the authorization form described in subdivision 8.\n(b) The servicer may:\n(1) mail the communications required under paragraph (a) to the third-party designee at the same time the communications are mailed to the borrower; or\n(2) communicate with the third-party designee regarding the borrower's failure to respond to the communications described in paragraph (a) by email at the email address listed on the authorization form described in subdivision 8.\n(c) The authorization form described in subdivision 8 is considered sufficient authorization for the servicer to communicate with a third-party designee who initiates communication with the servicer via telephone, email, or United States mail.\n(d) Compliance with this subdivision may be established by recording with the county recorder or registrar of titles, as appropriate, an affidavit, executed by a person having knowledge of the facts, that includes the reverse mortgage document recording number and a statement affirming compliance with the requirements under paragraph (a). The affidavit is prima facie evidence of the facts stated in the affidavit and recordation is prima facie evidence of compliance with this subdivision.\n(e) A borrower has a cause of action under section 582.043, subdivision 7, if the servicer fails to comply with paragraph (a), provided that the action is taken before the redemption period specified under section 580.23 expires. There is a rebuttable presumption that the servicer failed to communicate with a third-party designee absent a recorded affidavit, as described in paragraph (d).\n(a) If a reverse mortgage loan servicer must take the actions required under subdivision 6a, paragraph (a), and the borrower has consented on the form provided under subdivision 8, the servicer must mail a copy of unanswered written communications and copies of subsequent written communications from the servicer regarding delinquencies, defaults, and unfulfilled obligations that may result in foreclosure under a reverse mortgage loan agreement to the independent counseling agency identified in the loan agreement.\n(b) The servicer may mail the communications described in paragraph (a) to the independent counseling agency at the same time the communications are mailed to the borrower and third-party designee.\nThe lender may require the borrower to pay no more than actual closing costs incurred in connection with the making, closing, disbursing or extending of a reverse mortgage loan. A reverse mortgage loan agreement or extension agreement may provide for deferral of payment of any portion of actual closing costs. Deferred closing costs shall be added to the outstanding loan balance as provided in subdivision 1, paragraph (e). Unless the agreement provides for deferral, actual closing costs shall be paid by the borrower at the time of signing the agreement.\nUpon signing a reverse mortgage loan agreement or extension agreement the lender shall furnish to the borrower:\n(a) a schedule showing the projected pattern of the outstanding loan balance over the period of the agreement;\n(b) a statement indicating in detail the charges and fees the borrower has paid or is obligated to pay to the lender or to any other person in connection with the loan; and\n(c) any other information required by state or federal law.\nPrior to accepting a final and complete application for a reverse mortgage loan or assessing any fees, a lender must:\n(a) refer the prospective borrower to an independent housing counseling agency for reverse mortgage counseling. The lender shall provide the prospective borrower with a list of at least three independent housing counseling agencies. The lender shall positively promote the benefits of reverse mortgage counseling to the potential borrower; and\n(b) receive a certification from the applicant or the applicant's authorized representative that the applicant has received counseling as defined in this subdivision from an independent housing counseling agency. The certification must be signed by the applicant and the counselor from the independent agency and must include the date of the counseling, and the name, address, and telephone number of both the counselor from the independent agency and the applicant. The lender shall maintain the certification in an accurate, reproducible, and accessible format for the term of the reverse mortgage. A failure by the lender to comply with this subdivision results in a $1,000 civil penalty payable to the borrower.\nFor the purposes of this subdivision:\n(1) \"independent counseling agency\" means an agency approved by the United States Department of Housing and Urban Development, domiciled in Minnesota, to provide loan counseling that has no business relationship with the lender and, except for an authorized foreclosure prevention counseling agency, as defined in section 580.021, subdivision 2, neither makes loans nor refers borrowers to any person or entity that makes loans; and\n(2) \"counseling\" means that during a session, which must be no less than 60 minutes, the following services are provided to the borrower:\n(i) a review of the advantages and disadvantages of a reverse mortgage loan;\n(ii) a discussion of the borrower's finances, assets, liabilities, expenses, and income needs and a review of options other than a reverse mortgage loan that are available to the borrower, including other housing, social services, health, and financial options;\n(iii) a review of other home equity conversion or other loan options that are or may become available to the borrower;\n(iv) an explanation of the financial implication of entering into a reverse mortgage loan, including the costs of the loan;\n(v) an explanation that a reverse mortgage loan may have tax consequences, affect eligibility for assistance under federal and state programs, and have an impact on the estate and heirs of the borrower;\n(vi) an explanation of the lending process;\n(vii) an opportunity for the borrower to ask questions of the counselor;\n(viii) an explanation that:\n(A) the lender may not condition a reverse mortgage loan on the purchase of an annuity, investment, life insurance, or long-term care insurance product; and\n(B) a reverse mortgage loan cannot obligate the borrower to purchase an annuity, investment, life insurance, or long-term care insurance product;\n(ix) notification to the borrower that, following the receipt of a written commitment to make a reverse mortgage loan and prior to the expiration of the seven-day cooling off period provided under subdivision 10, the borrower may seek additional information and an analysis of the commitment from the counselor; and\n(x) an explanation of the borrower's right, before executing the reverse mortgage loan agreement, to name a third-party designee to receive communications regarding delinquencies, defaults, and unfulfilled obligations that may result in foreclosure under a reverse mortgage loan agreement. The counselor must provide the borrower with the following blank form, which must be in at least 14-point type, for the borrower to complete if desired and present to the lender when entering into the loan agreement:\nAuthorization Form\n1. Authorization for Third-Party Designee to Receive/Initiate Communications\nI, (name of borrower), authorize my lender or servicer to send copies of any written communications from the servicer regarding delinquencies, defaults, and unfulfilled obligations that could result in foreclosure under a reverse mortgage loan agreement, as provided under Minnesota Statutes, section 47.58, subdivisions 6a and 6b, to the individual designated below.\nI further authorize the person designated below to communicate with my lender or servicer.\nDesignee Contact Information:\nName: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nAddress: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nTelephone Number(s): ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nEmail Address: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n2. Authorization for Reverse Mortgage Counseling Agency to Receive Communications\nPlease indicate below if you authorize your servicer to also send copies of any written communications that will be sent to the third-party designee to the independent counseling agency that provided you with reverse mortgage loan counseling.\n(Check one)\nName of Borrower (print name): ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nSignature of Borrower: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nDate: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nA lender who fails to make loan advances as required in the loan documents, and fails to cure an actual default after notice as specified in the loan documents, shall forfeit any right to repayment of the outstanding loan balance with respect to a mortgage that is not federally insured. Any mortgage that is not federally insured securing a reverse mortgage loan agreement in which a forfeiture has occurred pursuant to this subdivision may be declared null and void by a court of competent jurisdiction.\n(a) A borrower shall not be bound for seven days after the borrower's acceptance, in writing, of the lender's written commitment to make the reverse mortgage loan, and cannot be required to close or proceed with the loan during that time period. The lender shall provide the borrower with written notice of the seven-day cooling off period, which must be on a separate sheet of paper and in at least ten-point type. A borrower may not waive the provisions of this paragraph.\n(b) The borrower may rescind any reverse mortgage loan within three days of execution, as provided in Code of Federal Regulations, Regulation Z.\nNo lender, mortgage broker, or residential mortgage originator may:\n(1) require the purchase of an annuity, investment, life insurance, or long-term care insurance product as a condition of obtaining a reverse mortgage loan;\n(2) enter into any agreement to make a reverse mortgage loan that obligates the borrower to purchase an annuity, investment, life insurance, or long-term care insurance product; or\n(3) receive compensation for providing the borrower with information relating to an annuity, investment, life insurance, or long-term care insurance product.\nFor the purposes of this subdivision, \"mortgage broker\" has the meaning given in section 58.02, subdivision 13, and \"residential mortgage originator\" has the meaning given in section 58.02, subdivision 19.",
	"repealed": false
}