{
	"id": "383B.126",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.126",
	"title": "383B.126 BOARD MAY LEASE SPACE OUT TO RUN FACTORY.",
	"text": "Notwithstanding the provisions of any law to the contrary, the board, upon the recommendations of the administrator and the superintendent may lease space in any of the buildings of the corrections facility together with real estate needed for reasonable access to the leased building to a private person, firm or corporation for the purpose of establishing and operating a factory under written contract for the manufacture and processing of goods, wares, or merchandise, in a manner and upon terms determined by the board to be consistent with the proper training and employment of inmates of the corrections facility and in the best fiscal interests of the county.\nThe private person, firm, or corporation operating a factory or other business or commercial enterprise under this section shall:\n(1) select the inmates to be employed, subject to the approval of the superintendent, consistent with the superintendent's responsibility for security, control, and public safety;\n(2) provide coverage for workers' compensation benefits as provided in chapter 176;\n(3) pay wages and benefits to the inmates employed at the prevailing minimum wages and benefits for work of a similar nature performed by employees with similar skills in the county;\n(4) withhold from the wages of the inmates employed and pay all amounts in the manner required by law for state and federal income taxes and FICA taxes and keep and maintain records required by state and federal law in that connection; and\n(5) be solely liable for and indemnify and save the county, its officers, agents, and employees harmless from all claims of every type, nature, or description that arise out of or are connected with the conduct of a factory, business, or commercial enterprise under this section. This provision shall be a part of all leases and contracts entered into hereunder irrespective of any references thereto in a lease and contract.\nThe authority of the superintendent over the corrections facility and its inmates shall not be diminished by this section.\nThe rents and costs to be paid by any person, firm, or corporation employing inmates under this section shall be fixed and determined by the board upon the recommendations of the administrator and the superintendent and shall be in an amount the board determines to be in the best interests of the county and consistent with the operations and programs of the corrections facility.",
	"repealed": false
}