{
	"id": "46.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.08",
	"title": "46.08 EMPLOYEES.",
	"text": "The commissioner of commerce may appoint an assistant commissioner and such examiners, assistant examiners, stenographers, and such other employees as may be necessary to carry out the duties and responsibilities entrusted, subject to such rules as may be established by civil service with regard to qualifications and general fitness. During the absence or disability of the commissioner of commerce said assistant commissioner shall have charge of the office and administer its affairs. Such examiners shall confine their work to those institutions which are subject to the supervision of the commissioner of commerce and may be transferred from one supervisory district to another at the option of said commissioner when it shall appear that the interest of the Department of Commerce shall be better served by so doing.\nThe commissioner of commerce may appoint an examiner in charge of liquidation and such special deputy examiners and other employees as are needed in the liquidation of banks. The certificates of appointment of the examiner in charge of liquidation, and of such special deputy examiners shall be filed in the office of the commissioner of commerce and a certified copy thereof shall be filed in the Office of the Secretary of State and in the office of the court administrator of the district court of the county in which the principal office of the bank concerned was located. The qualifications of such examiner in charge of liquidation and special deputy examiners shall be the same as prescribed in subdivision 1 for examiners. The commissioner of commerce may from time to time authorize any such special deputy examiner to perform such duties connected with such liquidation and distribution as the commissioner may deem proper. The commissioner of commerce shall require from the examiner in charge of liquidation and each special deputy examiner such bond for the faithful discharge of duties as the commissioner may deem proper. The commissioner of commerce may procure such expert assistance as may be necessary in the liquidation and distribution of the assets of such bank and may retain such of its officers or employees as the commissioner may deem necessary.\nNo examiner shall have the right to examine any bank, savings bank or other financial corporation in which the examiner may have an interest, either directly or indirectly.",
	"repealed": false
}