{
	"id": "342.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.25",
	"title": "342.25 CULTIVATION OF CANNABIS; GENERAL REQUIREMENTS.",
	"text": "Every cannabis business with a license or endorsement authorizing the cultivation of cannabis must comply with the requirements of this section.\nA business licensed or authorized to cultivate cannabis must prepare a cultivation record for each batch of cannabis plants and cannabis flower in the form required by the office and must maintain each record for at least five years. The cultivation record must include the quantity and timing, where applicable, of each pesticide, fertilizer, soil amendment, or plant amendment used to cultivate the batch, as well as any other information required by the office in rule. The cannabis business must present cultivation records to the office, the commissioner of agriculture, or the commissioner of health upon request.\nA business licensed or authorized to cultivate cannabis is subject to rules promulgated by the office in consultation with the commissioner of agriculture, subject to subdivision 5, governing the use of pesticides, fertilizers, soil amendments, plant amendments, and other inputs to cultivate cannabis.\nA business licensed or authorized to cultivate cannabis must prepare, maintain, and execute an operating plan and a cultivation plan as directed by the office in rule, which must include but is not limited to:\n(1) water usage;\n(2) recycling;\n(3) solid waste disposal; and\n(4) a pest management protocol that incorporates integrated pest management principles to control or prevent the introduction of pests to the cultivation site.\n(a) A business licensed or authorized to cultivate cannabis must comply with chapters 18B, 18C, 18D, and any other pesticide, fertilizer, soil amendment, and plant amendment laws and rules enforced by the commissioner of agriculture.\n(b) A business licensed or authorized to cultivate cannabis must not apply pesticides when pollinators are present or allow pesticides to drift to flowering plants that are attractive to pollinators.\nA business licensed or authorized to cultivate cannabis must not treat or otherwise adulterate cannabis plants or cannabis flower with any substance or compound that has the effect or intent of altering the color, appearance, weight, potency, or odor of the cannabis.\nA business licensed or authorized to cultivate cannabis may cultivate cannabis plants indoors or outdoors, subject to the security, fencing, lighting, and any other requirements imposed by the office in rule.\nNothing in this section applies to the cultivation of hemp plants.",
	"repealed": false
}