{
	"id": "144.147",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.147",
	"title": "144.147 RURAL HOSPITAL PLANNING AND TRANSITION GRANT PROGRAM.",
	"text": "\"Eligible rural hospital\" means any nonfederal, general acute care hospital that:\n(1) is either located in a rural area, as defined in the federal Medicare regulations, Code of Federal Regulations, title 42, section 405.1041, or located in a community with a population of less than 15,000, according to United States Census Bureau statistics, outside the seven-county metropolitan area;\n(2) has 50 or fewer beds; and\n(3) is not for profit.\n(a) The commissioner shall establish a program of grants to assist eligible rural hospitals. The commissioner shall award grants to hospitals and communities for the purposes set forth in paragraphs (b) and (c).\n(b) Grants may be used by hospitals and their communities to develop strategic plans for preserving or enhancing access to health services. At a minimum, a strategic plan must consist of:\n(1) a needs assessment to determine what health services are needed and desired by the community. The assessment must include interviews with or surveys of area health professionals, local community leaders, and public hearings;\n(2) an assessment of the feasibility of providing needed health services that identifies priorities and timeliness for potential changes; and\n(3) an implementation plan.\nThe strategic plan must be developed by a committee that includes representatives from the hospital, local public health agencies, other health providers, and consumers from the community.\n(c) The grants may also be used by eligible rural hospitals that have developed strategic plans to implement transition projects to modify the type and extent of services provided, in order to reflect the needs of that plan. Grants may be used by hospitals under this paragraph to develop hospital-based physician practices that integrate hospital and existing medical practice facilities that agree to transfer their practices, equipment, staffing, and administration to the hospital. The grants may also be used by the hospital to establish a health provider cooperative, a telehealth system, an electronic health records system, or a rural health care system or to cover expenses associated with being designated as a critical access hospital for the Medicare rural hospital flexibility program. Not more than one-third of any grant shall be used to offset losses incurred by physicians agreeing to transfer their practices to hospitals.\nIn determining which hospitals will receive grants under this section, the commissioner shall take into account:\n(1) improving community access to hospital or health services;\n(2) changes in service populations;\n(3) availability and upgrading of ambulatory and emergency services;\n(4) the extent that the health needs of the community are not currently being met by other providers in the service area;\n(5) the need to recruit and retain health professionals;\n(6) the extent of community support;\n(7) the integration of health care services and the coordination with local community organizations, such as community development and public health agencies; and\n(8) the financial condition of the hospital.\n(a) Eligible hospitals must apply to the commissioner no later than September 1 of each fiscal year for grants awarded for that fiscal year. A grant may be awarded upon signing of a grant contract.\n(b) The commissioner must make a final decision on the funding of each application within 60 days of the deadline for receiving applications.\n(c) Each relevant community health board has 30 days in which to review and comment to the commissioner on grant applications from hospitals in their community health service area.\n(d) In determining which hospitals will receive grants under this section, the commissioner shall consider the following factors:\n(1) Description of the problem, description of the project, and the likelihood of successful outcome of the project. The applicant must explain clearly the nature of the health services problems in their service area, how the grant funds will be used, what will be accomplished, and the results expected. The applicant should describe achievable objectives, a timetable, and roles and capabilities of responsible individuals and organizations.\n(2) The extent of community support for the hospital and this proposed project. The applicant should demonstrate support for the hospital and for the proposed project from other local health service providers and from local community and government leaders. Evidence of such support may include past commitments of financial support from local individuals, organizations, or government entities; and commitment of financial support, in-kind services or cash, for this project.\n(3) The comments, if any, resulting from a review of the application by the community health board in whose community health service area the hospital is located.\n(e) In evaluating applications, the commissioner shall score each application on a 100 point scale, assigning the maximum of 70 points for an applicant's understanding of the problem, description of the project, and likelihood of successful outcome of the project; and a maximum of 30 points for the extent of community support for the hospital and this project. The commissioner may also take into account other relevant factors.\n(f) Any single grant to a hospital, including hospitals that submit applications as consortia, may not exceed $50,000 a year and may not exceed a term of two years. Prior to the receipt of any grant, the hospital must certify to the commissioner that at least one-half of the amount of the total cost of the planning or transition project, which may include in-kind services, is available for the same purposes from nonstate sources. A hospital receiving a grant under this section may use the grant for any expenses incurred in the development of strategic plans or the implementation of transition projects with respect to which the grant is made. Project grants may not be used to retire debt incurred with respect to any capital expenditure made prior to the date on which the project is initiated. Hospitals may apply to the program each year they are eligible.\n(g) The commissioner may adopt rules to implement this section.\nThe commissioner shall evaluate the overall effectiveness of the grant program. The commissioner may collect, from the hospital, and communities receiving grants, quarterly progress reports to evaluate the grant program. Information related to the financial condition of individual hospitals shall be classified as nonpublic data.",
	"repealed": false
}