{
	"id": "260D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/260D.02",
	"title": "260D.02 DEFINITIONS.",
	"text": "The definitions in this section supplement the definitions in section 260C.007. The definitions in section 260C.007 apply to this chapter and have the same meaning for purposes of this chapter as for chapter 260C.\n\"Agency\" means the responsible social services agency or a licensed child-placing agency.\n\"Case plan\" means any plan for the delivery of services to a child and parent, or when reunification is not required, the child alone, that is developed according to the requirements of sections 245.4871, subdivision 19 or 21; 245.492, subdivision 16; 256B.092; and 260C.212, subdivision 1; and Minnesota Rules, parts 9525.0004 to 9525.0016.\n\"Child\" means an individual under 18 years of age.\n\"Child in voluntary foster care for treatment\" means a child with emotional disturbance or developmental disability, or who has a related condition and is in foster care under a voluntary foster care agreement between the child's parent and the agency due to concurrence between the agency and the parent when it is determined that foster care is medically necessary:\n(1) due to a determination by the agency's screening team based on its review of the diagnostic and functional assessment under section 245.4885; or\n(2) due to a determination by the agency's screening team under section 256B.092 and Minnesota Rules, parts 9525.0004 to 9525.0016.\nA child is not in voluntary foster care for treatment under this chapter when there is a current determination under chapter 260E that the child requires child protective services or when the child is in foster care for any reason other than the child's emotional or developmental disability or related condition.\n\"Compelling reasons\" has the same meaning given in section 260C.007, subdivision 8. The agency may determine compelling reasons when the child is in foster care for treatment and no grounds to terminate parental rights exist because the child must be in placement to access treatment, the child's individual treatment needs cannot be met in the child's home or through community-based care, and the parent continues to be responsible for planning together with the agency for the child's needs and maintains appropriate contact with the child.\n\"Court\" means juvenile court unless otherwise specified in this section.\n\"Developmental disability\" means developmental disability as defined in United States Code, title 42, section 6001(8).\n\"Emotional disturbance\" means emotional disturbance as described in section 245.4871, subdivision 15.\n\"Foster care\" means 24-hour substitute care for children placed away from their parents and for whom an agency has placement and care responsibility. Foster care includes, but is not limited to, placement in foster family homes, foster homes of relatives, group homes, emergency shelters, residential facilities not excluded in this subdivision, child care institutions, and preadoptive homes. A child is in foster care under this definition, regardless of whether the facility is licensed and payments are made for the cost of care. Nothing in this definition creates any authority to place a child in a home or facility that is required to be licensed that is not licensed. Foster care does not include placement in any of the following facilities: hospitals, inpatient chemical dependency treatment facilities, facilities that are primarily for delinquent children, any corrections facility or program within a particular corrections facility not meeting requirements for Title IV-E facilities as determined by the commissioner, facilities to which a child is committed under the provision of chapter 253B, forestry camps, or jails.\n\"Legal authority to place the child\" means the agency has legal responsibility for the care and control of the child while the child is in foster care. The agency may acquire legal authority to place a child through a voluntary placement agreement between the agency and the child's parent under this chapter. Legal authority to place the child does not mean the agency has authority to make major life decisions regarding the child, including major medical decisions. A parent with legal custody of the child continues to have legal authority to make major life decisions regarding the child, including major medical decisions.\n\"Minor\" means an individual under 18 years of age.\n\"Parent\" means the birth or adoptive parent of a minor. Parent also means the child's legal guardian or any individual who has legal authority to make decisions and plans for the child. For an Indian child, parent includes any Indian person who has adopted a child by tribal law or custom, as provided in section 260.755, subdivision 14.\n\"Reasonable efforts to finalize a permanent plan for the child\" has the same meaning under this chapter as provided in section 260.012, paragraph (e).",
	"repealed": false
}