{
	"id": "260C.452",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.452",
	"title": "260C.452 SUCCESSFUL TRANSITION TO ADULTHOOD.",
	"text": "(a) For purposes of this section, \"youth\" means a person who is at least 14 years of age and under 23 years of age.\n(b) This section pertains to a youth who:\n(1) is in foster care and is 14 years of age or older, including a youth who is under the guardianship of the commissioner of children, youth, and families;\n(2) has a permanency disposition of permanent custody to the agency;\n(3) will leave foster care when the youth is 18 years of age or older and under 21 years of age;\n(4) has left foster care due to adoption when the youth was 16 years of age or older;\n(5) has left foster care due to a transfer of permanent legal and physical custody to a relative, or Tribal equivalent, when the youth was 16 years of age or older; or\n(6) was reunified with the youth's primary caretaker when the youth was 14 years of age or older and under 18 years of age.\n(c) The purpose of this section is to provide support to each youth who is transitioning to adulthood by providing services to the youth in the areas of:\n(1) education;\n(2) employment;\n(3) daily living skills such as financial literacy training and driving instruction, preventive health activities including promoting abstinence from substance use and smoking, and nutrition education and pregnancy prevention;\n(4) forming meaningful, permanent connections with caring adults;\n(5) engaging in age-appropriate and developmentally appropriate activities under section 260C.212, subdivision 14, and positive youth development;\n(6) financial, housing, counseling, and other services to assist a youth over 18 years of age in achieving self-sufficiency and accepting personal responsibility for the transition from adolescence to adulthood; and\n(7) making vouchers available for education and training.\n(d) The responsible social services agency may provide support and case management services to a youth as defined in paragraph (a) until the youth reaches 23 years of age. According to section 260C.451, a youth's placement in a foster care setting will end when the youth reaches 21 years of age.\nCase management services include the responsibility for planning, coordinating, authorizing, monitoring, and evaluating services for a youth and shall be provided to a youth by the responsible social services agency or the contracted agency. Case management services include the out-of-home placement plan under section 260C.212, subdivision 1, when the youth is in out-of-home placement.\nWhen the youth is 14 years of age or older and is receiving support from the responsible social services agency under this section, the responsible social services agency, in consultation with the youth, shall complete the youth's independent living plan according to section 260C.212, subdivision 1, paragraph (c), clause (12), regardless of the youth's current placement status.\nMS 2020 [Repealed by amendment, 2021 c 30 art 10 s 36]\n(a) When the youth is 14 years of age or older, the court, in consultation with the youth, shall review the youth's independent living plan according to section 260C.203, paragraph (d).\n(b) The responsible social services agency shall file a copy of the notification of foster care benefits for a youth who is 18 years of age or older according to section 260C.451, subdivision 1, with the court. If the responsible social services agency does not file the notice by the time the youth is 17-1/2 years of age, the court shall require the responsible social services agency to file the notice.\n(c) When a youth is 18 years of age or older, the court shall ensure that the responsible social services agency assists the youth in obtaining the following documents before the youth leaves foster care: a Social Security card; an official or certified copy of the youth's birth certificate; a state identification card or driver's license, tribal enrollment identification card, green card, or school visa; health insurance information; the youth's school, medical, and dental records; a contact list of the youth's medical, dental, and mental health providers; and contact information for the youth's siblings, if the siblings are in foster care.\n(d) For a youth who will be discharged from foster care at 18 years of age or older because the youth is not eligible for extended foster care benefits or chooses to leave foster care, the responsible social services agency must develop a personalized transition plan as directed by the youth during the 180-day period immediately prior to the expected date of discharge. The transition plan must be as detailed as the youth elects and include specific options, including but not limited to:\n(1) affordable housing with necessary supports that does not include a homeless shelter;\n(2) health insurance, including eligibility for medical assistance as defined in section 256B.055, subdivision 17;\n(3) education, including application to the Education and Training Voucher Program;\n(4) local opportunities for mentors and continuing support services;\n(5) workforce supports and employment services;\n(6) a copy of the youth's consumer credit report as defined in section 13C.001 and assistance in interpreting and resolving any inaccuracies in the report, at no cost to the youth;\n(7) information on executing a health care directive under chapter 145C and on the importance of designating another individual to make health care decisions on behalf of the youth if the youth becomes unable to participate in decisions;\n(8) appropriate contact information through 21 years of age if the youth needs information or help dealing with a crisis situation; and\n(9) official documentation that the youth was previously in foster care.\n(a) Before a youth who is 18 years of age or older leaves foster care, the responsible social services agency shall give the youth written notice that foster care shall terminate 30 days from the date that the notice is sent by the agency according to section 260C.451, subdivision 8.\n(b) Before case management services will end for a youth who is at least 18 years of age and under 23 years of age, the responsible social services agency shall give the youth: (1) written notice that case management services for the youth shall terminate; and (2) written notice that the youth has the right to appeal the termination of case management services under section 142A.20, subdivision 2, by responding in writing within ten days of the date that the agency mailed the notice. The termination notice must include information about services for which the youth is eligible and how to access the services.",
	"repealed": false
}