{
	"id": "82.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.61",
	"title": "82.61 LICENSING: CONTINUING EDUCATION AND INSTRUCTION.",
	"text": "(a) All real estate salespersons and all real estate brokers shall be required to successfully complete 30 hours of real estate continuing education, either as a student or a lecturer, in courses of study approved by the commissioner, during the initial license period and during each succeeding 24-month license period. At least 15 of the 30 credit hours must be completed during the first 12 months of the 24-month licensing period. Licensees may not claim credit for continuing education not actually completed.\n(b) The commissioner may adopt rules defining the standards for course and instructor approval, and may adopt rules for the proper administration of prelicense instruction as required under section 82.59, subdivision 8, and continuing education as required under this section and sections 82.58, subdivision 5; 82.59; 82.62, subdivisions 1 and 5 to 7; and 82.64. The commissioner may not approve a course which can be completed by the student at home or outside the classroom without the supervision of an instructor except accredited courses using new delivery technology, including interactive technology, and the Internet. The commissioner may approve courses of study in the real estate field offered in educational institutions of higher learning in this state or courses of study in the real estate field developed by and offered under the auspices of the National Association of Realtors, its affiliates, or private real estate schools. Courses in motivation, salesmanship, psychology, or time management shall not be approved by the commissioner for continuing education credit. The commissioner may approve courses in any other subjects, including, but not limited to, communication, marketing, negotiation, and technology for continuing education credit.\n(c) As part of the continuing education requirements of this section and sections 82.58, subdivisions 5 and 6; 82.59; 82.62, subdivisions 1 and 5 to 7; and 82.64, the commissioner shall require that all real estate brokers and salespersons receive:\n(1) at least one hour of training during each license period in courses in laws or regulations on agency representation and disclosure; and\n(2) at least one hour of training during each license period in courses in state and federal fair housing laws, regulations, and rules, other antidiscrimination laws, or courses designed to help licensees to meet the housing needs of immigrant and other underserved populations.\nClauses (1) and (2) do not apply to real estate salespersons and real estate brokers engaged solely in the commercial real estate business who file with the commissioner a verification of this status.\n(d) The commissioner is authorized to establish a procedure for renewal of course accreditation.\n(e) Approved continuing education courses may be sponsored or offered by a broker of a real estate company and may be held on the premises of a company licensed under this chapter. All continuing education course offerings must be open to any interested individuals. Access may be restricted by the education provider based on class size only. Courses must not be approved if attendance is restricted to any particular group of people. A broker must comply with all continuing education rules prescribed by the commissioner. The commissioner shall not approve any prelicense instruction courses offered by, sponsored by, or affiliated with any person or company licensed to engage in the real estate business.\n(f) Credit may not be earned if the licensee has previously obtained credit for the same course as either a student or instructor during the same licensing period.\n(g) An approved prelicense 30-hour broker course may be used for continuing education credit by a real estate salesperson or broker if the course is completed during the appropriate licensing period.\n(h) As part of the continuing education requirements of this section and section 82.64, the commissioner shall require that all real estate brokers and salespersons receive either 3.75 or 7.5 hours of module training every license year within the 30 hours of continuing education required during each two-year license period. For each license year, the commissioner shall determine what modules are required. The modules must cover topics in real estate that are significant and are of current interest in the real estate market and profession. The commissioner shall determine the specific topics to be covered by modules for each license year and the number of credit hours allocated to each module. In determining the topics and number of credit hours, the commissioner shall consult with a statewide real estate trade association and a statewide private continuing education provider. When the commissioner has created a module, the commissioner must publicize to licensees and to real estate continuing education providers an outline of the topics covered by the module, and the credits associated with it, no later than April 1 of each year. The commissioner may delegate the module and test development, subject to the commissioner's approval, to a statewide real estate trade association. Credit for each module must be contingent upon the licensee's successful completion of it, established by testing of the licensee's knowledge of the content covered by the module, based upon written test questions approved by the commissioner as described in paragraph (k). Modules determined under this paragraph may be offered by any person permitted to offer real estate continuing education in this state. Notwithstanding paragraph (c), the commissioner has discretion to determine that the requirements of the module satisfy, in whole or in part, the requirements of paragraph (c) for a licensing period in which the module will be offered.\n(i) The 30 hours of continuing education per license period for real estate brokers must include a module, designed under the procedure provided in paragraph (i), of at least one hour each license year specifically designed to address issues relevant to brokers.\n(j) The written test for successful completion of a module offered by a continuing education provider must be comprised of questions selected by that provider from a pool of test questions designed and approved by the commissioner. The test must be a written test, in paper or electronic form, taken by the licensee at the conclusion of the module as a part of the credit hours devoted to the module, but the test must not be allocated credit of more than one-sixth of the time allocated to the module. The provider must prepare, administer, score, and pay any costs related to the tests. The commissioner shall determine the number of questions that must be included in a test and the percentage of questions that must be answered correctly. The provider may contract with a third party for scoring of the test. A licensee must be allowed to remain as long as reasonably necessary to complete the test.\n(k) Paragraphs (h), (i), and (j) do not apply to commercial salespersons and commercial brokers engaged solely in the commercial real estate business and who file with the commissioner a verification of this status.\n(l) Determinations made by the commissioner under paragraphs (h), (i), and (j) are not rules for purposes of chapter 14.",
	"repealed": false
}