{
	"id": "12.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.331",
	"title": "12.331 LOCAL ASSISTANCE BETWEEN POLITICAL SUBDIVISIONS.",
	"text": "When the public interest requires it because of an emergency, a political subdivision may request the assistance of another political subdivision. Upon receiving such a request, a political subdivision, called the \"sending political subdivision,\" may go to the assistance of the requesting political subdivision, called the \"receiving political subdivision.\" The receiving political subdivision may accept and use the personnel, equipment, and supplies of the sending political subdivision as agreed upon by both political subdivisions.\n(a) Unless there is a written agreement between the political subdivisions establishing the rules for conducting these activities, the provisions of paragraphs (b) to (e) shall apply while the political subdivisions are engaged in the activities described in subdivision 1.\n(b) For the purposes of worker's compensation insurance, the employees, officers, and members of the sending political subdivision have the same powers, duties, rights, privileges, and immunities as if they were performing similar services in the sending political subdivision and are considered to be acting within the scope of and in the course of their regular employment, as employees of the sending political subdivision.\n(c) For the purposes of chapter 466, the employees and officers of the sending political subdivision are deemed to be employees, as defined in section 466.01, subdivision 6, of the receiving political subdivision.\n(d) The sending political subdivision shall be responsible for any damages to its equipment.\n(e) The receiving political subdivision shall reimburse the sending political subdivision for the supplies used and the compensation paid to the officers and members of the forces furnished, during the time when the rendition of aid prevents them from performing their duties in the sending political subdivision, and for the actual travel and maintenance expenses of the officers and members while so engaged. A claim for loss, damage, or expense in using equipment or supplies or for additional expenses incurred in operating or maintaining them must not be allowed unless within 90 days after the loss, damage, or expense is sustained or incurred, an itemized notice of it, verified by an officer or employee of the municipality having knowledge of the facts, is filed with the clerk of the receiving political subdivision.\nNotwithstanding other laws this section is effective retroactive to March 29, 1998.",
	"repealed": false
}