{
	"id": "201.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.13",
	"title": "201.13 REPORT OF DECEASED VOTERS; CHANGES TO VOTER RECORDS.",
	"text": "Pursuant to the Help America Vote Act of 2002, Public Law 107-252, the commissioner of health shall report monthly by electronic means to the secretary of state the name, address, date of birth, and county of residence of each individual 18 years of age or older who has died while maintaining residence in Minnesota since the last previous report. The secretary of state shall determine if any of the persons listed in the report are registered to vote and shall prepare a list of those registrants for each county auditor. Within 60 days after receiving the list from the secretary of state, the county auditor shall change the status of those registrants to \"deceased\" in the statewide voter registration system.\nThe secretary of state must determine if any of the persons listed on the Social Security Death Index or reported as deceased by the vital records department of another state are registered to vote and prepare a list of those registrants for each county auditor. The county auditor shall change the status of those registrants to \"deceased\" in the statewide voter registration system.\nAfter receiving notice of death of a voter who has died outside the county, the county auditor shall change the voter's status to \"deceased.\" Notice must be in the form of a printed obituary or a written statement signed by a registered Minnesota voter.\n(a) At least once each month the secretary of state shall obtain a list of individuals registered to vote in this state who have filed with the United States Postal Service a change of their permanent address. The secretary of state may also periodically obtain a list of individuals with driver's licenses or state identification cards to identify those who are registered to vote who have applied to the Department of Public Safety for a replacement driver's license or state identification card with a different address, and a list of individuals for whom the Department of Public Safety received notification of a driver's license or state identification card cancellation due to a change of residency out of state. However, the secretary of state shall not load data derived from these lists into the statewide voter registration system within the 47 days before the state primary or 47 days before a November general election.\n(b) If the address is changed to another address in this state, the secretary of state shall locate the precinct in which the voter maintains residence, if possible. If the secretary of state is able to locate the precinct in which the voter maintains residence, the secretary must transmit the information about the changed address by electronic means to the county auditor of the county in which the new address is located. For addresses for which the secretary of state is unable to determine the precinct, the secretary may forward information to the appropriate county auditors for individual review. If the voter has not voted or submitted a voter registration application since the address change, upon receipt of the information, the county auditor shall update the voter's address in the statewide voter registration system. The county auditor shall mail to the voter a notice stating the voter's name, address, precinct, and polling place, unless the voter's record is challenged due to a felony conviction, noncitizenship, name change, incompetence, or a court's revocation of voting rights of individuals under guardianship, in which case the auditor must not mail the notice. The notice must advise the voter that the voter's voting address has been changed and that the voter must notify the county auditor within 21 days if the new address is not the voter's address of residence. The notice must state that it must be returned if it is not deliverable to the voter at the named address.\n(c) If the change of permanent address is to an address outside this state, the secretary of state shall notify by electronic means the auditor of the county where the voter formerly maintained residence that the voter has moved to another state. If the voter has not voted or submitted a voter registration application since the address change, the county auditor shall promptly mail to the voter at the voter's new address a notice advising the voter that the voter's status in the statewide voter registration system will be changed to \"inactive\" unless the voter notifies the county auditor within 21 days that the voter is retaining the former address as the voter's address of residence, except that if the voter's record is challenged due to a felony conviction, noncitizenship, name change, incompetence, or a court's revocation of voting rights of individuals under guardianship, the auditor must not mail the notice. If the notice is not received by the deadline, the county auditor shall change the voter's status to \"inactive\" in the statewide voter registration system.\n(d) If, in order to maintain voter registration records, the secretary of state enters an agreement to share information or data with an organization governed exclusively by a group of states, the secretary must first determine that the data security protocols are sufficient to safeguard the information or data shared. If required by such an agreement, the secretary of state may share the following data from the statewide voter registration system and data released to the secretary of state under section 171.12, subdivision 7a:\n(1) name;\n(2) date of birth;\n(3) address;\n(4) driver's license or state identification card number;\n(5) the last four digits of an individual's Social Security number; and\n(6) the date that an individual's record was last updated.\nIf the secretary of state enters into such an agreement, the secretary and county auditors must process changes to voter records based upon that data in accordance with this section. Except as otherwise provided in this subdivision, when data is shared with the secretary of state by another state, the secretary of state must maintain the same data classification that the data had while it was in the possession of the state providing the data.\nIf a voter makes a written request for removal of the voter's record, the county auditor shall inactivate the record of the voter in the statewide voter registration system.",
	"repealed": false
}