{
	"id": "473.755",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.755",
	"title": "473.755 MINNESOTA BALLPARK AUTHORITY.",
	"text": "To achieve the purposes of Laws 2006, chapter 257, the Minnesota Ballpark Authority is established as a public body, corporate and politic, and political subdivision of the state. The authority is not a joint powers entity or an agency or instrumentality of the county.\n(a) The Minnesota Ballpark Authority shall be governed by a commission consisting of:\n(1) two members appointed by the governor;\n(2) two members, including the chair, appointed by the county board; and\n(3) one member appointed by the governing body of the city of Minneapolis.\n(b) All members serve at the pleasure of the appointing authority.\n(c) Compensation of members appointed under paragraph (a) is governed by section 15.0575.\n(d) One member appointed under paragraph (a), clause (1), must be a resident of a county other than Hennepin. All other members appointed under paragraph (a) must be residents of Hennepin County.\n(e) No member of the Minnesota Ballpark Authority may have served as an elected official of the city of Minneapolis or Hennepin County for a period of two years prior to appointment to the authority.\n(f) The legislature intends that the ballpark be constructed to be operational for the team and the public no later than the opening of the 2010 season. Accordingly, the appointing authorities must make their appointments to the authority within 30 days of May 27, 2006, and if the governing bodies of the city of Minneapolis or the county should fail to do so, the governor may appoint an interim member to serve until the authorized appointment is made. The first meeting of the members shall take place at the direction of the chair within 45 days of May 27, 2006. Further, the authority must proceed with due speed in all of its official organizing activities and in making decisions with respect to the development agreement and lease or use agreement authorized by Laws 2006, chapter 257, or any other agreements or matters as necessary to meet the timetables set forth in Laws 2006, chapter 257. Any three members shall constitute a quorum for the conduct of business and action may be taken upon the vote of a majority of members present at a meeting duly called and held.\nThe chair shall preside at all meetings of the authority, if present, and shall perform all other assigned duties and functions. The authority may appoint from among its members a vice-chair to act for the chair during the temporary absence or disability of the chair.\nThe authority shall adopt bylaws to establish rules of procedure, the powers and duties of its officers, and other matters relating to the governance of the authority and the exercise of its powers. Except as provided in this section, the bylaws adopted under this subdivision shall be similar in form and substance to bylaws adopted by the Metropolitan Sports Facilities Commission pursuant to section 473.553.\nThe authority shall appoint an executive director to serve as the chief executive officer of the authority, which appointment shall be made within 30 days of the first meeting of the members.\nThe authority shall establish a website for purposes of providing information to the public concerning all actions taken by the authority. At a minimum, the website must contain a current version of the authority's bylaws, notices of upcoming meetings, minutes of the authority's meetings, and contact telephone and facsimile numbers for public comments.",
	"repealed": false
}