{
	"id": "518.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.11",
	"title": "518.11 SERVICE; ALTERNATE SERVICE; PUBLICATION.",
	"text": "(a) Unless a proceeding is brought by both parties, copies of the summons and petition shall be served on the respondent personally.\n(b) When service is made out of this state and within the United States, it may be proved by the affidavit of the person making the same. When service is made without the United States it may be proved by the affidavit of the person making the same, taken before and certified by any United States minister, charge d'affaires, commissioner, consul or commercial agent, or other consular or diplomatic officer of the United States appointed to reside in such country, including all deputies or other representatives of such officer authorized to perform their duties; or before an officer authorized to administer an oath with the certificate of an officer of a court of record of the country wherein such affidavit is taken as to the identity and authority of the officer taking the same.\n(c) If personal service cannot be made, the court may order service of the summons by alternate means. The application for alternate service must include the last known location of the respondent; the petitioner's most recent contacts with the respondent; the last known location of the respondent's employment; the names and locations of the respondent's parents, siblings, children, and other close relatives; the names and locations of other persons who are likely to know the respondent's whereabouts; and a description of efforts to locate those persons.\nThe court shall consider the length of time the respondent's location has been unknown, the likelihood that the respondent's location will become known, the nature of the relief sought, and the nature of efforts made to locate the respondent. The court shall order service by first class mail, forwarding address requested, to any addresses where there is a reasonable possibility that mail or information will be forwarded or communicated to the respondent or, if no address so qualifies, then to the respondent's last known address.\nIf the petitioner seeks disposition of real estate located within the state of Minnesota, the court shall order that the summons, which shall contain the legal description of the real estate, be published in the county where the real estate is located. The court may also order publication, within or without the state, but only if it might reasonably succeed in notifying the respondent of the proceeding. Also, the court may require the petitioner to make efforts to locate the respondent by telephone calls to appropriate persons. Service shall be deemed complete 21 days after mailing or 21 days after court-ordered publication.",
	"repealed": false
}