{
	"id": "157.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/157.22",
	"title": "157.22 EXEMPTIONS.",
	"text": "This chapter does not apply to:\n(1) interstate carriers under the supervision of the United States Department of Health and Human Services;\n(2) weddings, fellowship meals, or funerals conducted by a faith-based organization using any building constructed and primarily used for religious worship or education;\n(3) any building owned, operated, and used by a college or university in accordance with health regulations promulgated by the college or university under chapter 14;\n(4) any person, firm, or corporation whose principal mode of business is licensed under sections 28A.04 and 28A.05, is exempt at that premises from licensure as a food or beverage establishment; provided that the holding of any license pursuant to sections 28A.04 and 28A.05 shall not exempt any person, firm, or corporation from the applicable provisions of this chapter or the rules of the state commissioner of health relating to food and beverage service establishments;\n(5) family day care homes and group family day care homes governed by sections 142B.01 to 142B.79;\n(6) nonprofit senior citizen centers for the sale of home-baked goods;\n(7) fraternal, sportsman, or patriotic organizations that are tax exempt under section 501(c)(3), 501(c)(4), 501(c)(6), 501(c)(7), 501(c)(10), or 501(c)(19) of the Internal Revenue Code of 1986, or organizations related to, affiliated with, or supported by such fraternal, sportsman, or patriotic organizations for events held in the building or on the grounds of the organization and at which home-prepared food is donated by organization members for sale at the events, provided:\n(i) the event is not a circus, carnival, or fair;\n(ii) the organization controls the admission of persons to the event, the event agenda, or both; and\n(iii) the organization's licensed kitchen is not used in any manner for the event;\n(8) food not prepared at an establishment and brought in by individuals attending a potluck event for consumption at the potluck event. An organization sponsoring a potluck event under this clause may advertise the potluck event to the public through any means. Individuals who are not members of an organization sponsoring a potluck event under this clause may attend the potluck event and consume the food at the event. Licensed food establishments other than schools cannot be sponsors of potluck events. A school may sponsor and hold potluck events in areas of the school other than the school's kitchen, provided that the school's kitchen is not used in any manner for the potluck event. For purposes of this clause, \"school\" means a public school as defined in section 120A.05, subdivisions 9, 11, 13, and 17, or a nonpublic school, church, or religious organization at which a child is provided with instruction in compliance with sections 120A.22 and 120A.24. Potluck event food shall not be brought into a licensed food establishment kitchen;\n(9) a home school in which a child is provided instruction at home;\n(10) school concession stands serving commercially prepared, nonpotentially hazardous foods, as defined in Minnesota Rules, chapter 4626;\n(11) group residential facilities of ten or fewer beds licensed by the commissioner of human services under Minnesota Rules, chapter 2960, provided the facility employs or contracts with a certified food manager under Minnesota Rules, part 4626.2015;\n(12) food served at fundraisers, community events or fellowship meals conducted in the building or on the grounds of a faith-based organization, provided that a certified food manager or volunteer trained in a food safety course, trains the food preparation workers in safe food handling practices. Food prepared during these events is allowed to be made available for curbside pickup or delivered to members of the faith-based organization or the community in which the faith-based organization serves. This exemption does not apply to faith-based organizations at the state agricultural society or county fairs or to faith-based organizations that choose to apply for a license;\n(13) food service events conducted following a disaster for purposes of feeding disaster relief staff and volunteers serving commercially prepared, nonpotentially hazardous foods, as defined in Minnesota Rules, chapter 4626;\n(14) chili or soup served at a chili or soup cook-off fundraiser conducted by a community-based nonprofit organization, provided:\n(i) the municipality where the event is located approves the event;\n(ii) the sponsoring organization must develop food safety rules and ensure that participants follow these rules; and\n(iii) if the food is not prepared in a kitchen that is licensed or inspected, a visible sign or placard must be posted that states: \"These products are homemade and not subject to state inspection.\"\nFoods exempt under this clause must be labeled to accurately reflect the name and address of the person preparing the foods; and\n(15) a special event food stand or a seasonal temporary food stand provided:\n(i) the stand is located on private property with the permission of the property owner;\n(ii) the stand has gross receipts or contributions of $1,000 or less in a calendar year; and\n(iii) the operator of the stand posts a sign or placard at the site that states \"The products sold at this stand are not subject to state inspection or regulation.\" if the stand offers for sale potentially hazardous food as defined in Minnesota Rules, part 4626.0020, subpart 62.",
	"repealed": false
}