{
	"id": "148B.5901",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.5901",
	"title": "148B.5901 TEMPORARY SUSPENSION OF LICENSE.",
	"text": "(a) In addition to any other remedy provided by law, the board may issue an order to temporarily suspend the credentials of a licensee after conducting a preliminary inquiry to determine if the board reasonably believes that the licensee has violated a statute or rule that the board is empowered to enforce and whether continued practice by the licensee would create an imminent risk of harm to others.\n(b) The order may prohibit the licensee from engaging in the practice of licensed professional counseling in whole or in part and may condition the end of a suspension on the licensee's compliance with a statute, rule, or order that the board has issued or is empowered to enforce.\n(c) The order shall give notice of the right to a hearing according to this subdivision and shall state the reasons for the entry of the order.\n(d) Service of the order is effective when the order is served on the licensee personally or by certified mail, which is complete upon receipt, refusal, or return for nondelivery to the most recent address provided to the board for the licensee.\n(e) At the time the board issues a temporary suspension order, the board shall schedule a hearing to be held before its own members. The hearing shall begin no later than 60 days after issuance of the temporary suspension order or within 15 working days of the date of the board's receipt of a request for hearing by a licensee, on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. The hearing is not subject to chapter 14. Evidence presented by the board or the licensee shall be in affidavit form only. The licensee or counsel of record may appear for oral argument.\n(f) Within five working days of the hearing, the board shall issue its order and, if the suspension is continued, schedule a contested case hearing within 30 days of the issuance of the order. Notwithstanding chapter 14, the administrative law judge shall issue a report within 30 days after closing the contested case hearing record. The board shall issue a final order within 30 days of receipt of the administrative law judge's report.",
	"repealed": false
}