{
	"id": "142D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.07",
	"title": "142D.07 SCHOOL READINESS PLUS PROGRAM.",
	"text": "A district, a charter school, or a group of districts and charter schools may establish a school readiness plus program for children age four to kindergarten entrance. The purpose of a school readiness plus program is to prepare children for success as they enter kindergarten in the following year.\nA school readiness plus program provider must:\n(1) assess each child's cognitive and language skills with a comprehensive child assessment instrument when the child enters and again before the child leaves the program to improve program planning and implementation, communicate with parents, and promote kindergarten readiness;\n(2) provide comprehensive program content and intentional instructional practice aligned with the state early childhood learning guidelines and kindergarten standards and based on early childhood research and professional practice that is focused on children's cognitive, social, emotional, and physical skills and development and prepares children for the transition to kindergarten, including early literacy and language skills;\n(3) coordinate appropriate kindergarten transition with parents and kindergarten teachers;\n(4) involve parents in program planning and decision making;\n(5) coordinate with relevant community-based services;\n(6) cooperate with adult basic education programs and other adult literacy programs;\n(7) ensure staff-to-child ratios of one to ten and a maximum group size of 20 children with at least one licensed teacher;\n(8) have teachers knowledgeable in early childhood curriculum content, assessment, native and English language development programs, and instruction; and\n(9) provide instructional content and activities that are of sufficient length and intensity to address learning needs, including offering a program with at least 350 hours of instruction per school year.\nA district or charter school may contract with a charter school, Head Start or child care center, family child care program licensed under section 142B.03, or a community-based organization to provide eligible children with developmentally appropriate services that meet the program requirements in subdivision 2.\n(a) A child who is four years of age as of September 1 in the calendar year in which the school year commences and has one or more of the risk factors under paragraph (b) is eligible to participate in a school readiness plus program free of charge. A child who is four years of age as of September 1 in the calendar year in which the school year commences and does not have one or more of the risk factors under paragraph (b) may participate on a fee-for-service basis. A district must adopt a sliding fee schedule based on a family's income but must waive a fee for a participant unable to pay. School districts and charter schools must use school readiness plus aid for eligible children. Each eligible child must complete a health and developmental screening within 90 days of program enrollment under sections 142D.09 to 142D.093 and provide documentation of required immunizations under section 121A.15.\n(b) An at-risk four-year-old child may participate in the school readiness plus program free of charge if the child:\n(1) qualifies for free or reduced-price lunch;\n(2) is an English language learner;\n(3) is homeless;\n(4) has an individualized education program, or individual interagency intervention plan;\n(5) is identified through health and developmental screening under sections 142D.09 to 142D.093, with a potential risk factor that may influence learning; or\n(6) is in foster care.\n(a) For 2017-2018 school year, a school district or charter school that did not apply to participate in a voluntary prekindergarten program under section 142D.08, may apply to the commissioner by July 1, 2017, to participate in a school readiness plus program in the form and manner specified by the commissioner. By June 15, 2017, the commissioner must notify districts and charter schools of the availability of additional money for voluntary prekindergarten and school readiness plus programs. A school district or charter school that previously applied to participate in a voluntary prekindergarten program may amend its application by July 1, 2017, to apply instead for school readiness plus. The commissioner must review all applications for school readiness plus and notify applicant districts and charter schools by August 1, 2017, whether they have been selected for participation.\n(b) For the 2018-2019 school year, a school district or charter school may apply to the commissioner by January 30, 2018, to participate in school readiness plus in the form and manner specified by the commissioner.\n(c) A district or charter school submitting an application under this section must include: (1) a description of the proposed program, including the number of hours per week the program will be offered at each school site or mixed-delivery location; (2) an estimate of the number of eligible children to be served in the program at each school site or mixed-delivery location; (3) the number of children being served that will be new to the program; and (4) a statement of assurances signed by the superintendent or charter school director that the proposed program meets the requirements of subdivision 2.\n(d) The commissioner must award funding for school readiness plus programs across school districts and charter schools in the same manner as for the voluntary prekindergarten program.\n(e) A school site or mixed-delivery site approved for aid under this subdivision remains eligible for aid if the site continues to meet program requirements, regardless of changes in the concentration of students eligible for free or reduced-price lunches.\nFor a site first qualifying in fiscal year 2018 or 2019, mixed delivery revenue, including voluntary prekindergarten and school readiness plus program revenue, must be used to supplement not supplant existing state, federal, and local revenue for prekindergarten activities.\nThe commissioner and the commissioner of education shall enter into an agreement under which the commissioner of education shall distribute funds appropriated for programs under this section.",
	"repealed": false
}