{
	"id": "86B.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.005",
	"title": "86B.005 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"City\" means a home rule charter or statutory city.\n\"Commissioner\" means the commissioner of natural resources.\n\"Dealer\" means a person:\n(1) engaged in the business of manufacturing or selling new or used watercraft;\n(2) having an established place of business for the sale, trade, and display of the watercraft; and\n(3) having in possession watercraft for the purpose of sale or trade.\n\"Enclosed accommodation compartment\" means one contiguous space surrounded by boat structure that contains all of the following:\n(1) designated sleeping accommodations;\n(2) a galley area with sink; and\n(3) a head compartment.\n\"Enclosed occupancy compartment\" means one contiguous enclosed space surrounded by boat structure that may be occupied by a person.\n\"Horsepower\" means the power rating established for a motor by the manufacturer or, if a rating is not established, the power rating established by the commissioner.\n\"Length\" of a watercraft means the straight-line distance from the foremost part of the craft to the aftermost part of the craft, measured parallel to the centerline, excluding sheer. Bowsprits, outboard motor brackets, rudders, and other attachments are not included in the length measurement.\n\"License\" means the authentic document used to designate the numbers assigned a watercraft and to renew the designation.\n\"License agent\" means the commissioner of natural resources, the commissioner of public safety, and deputy registrars of motor vehicles acting under section 168.33.\n\"Marine carbon monoxide detection system\" means a device or system for detecting carbon monoxide that is certified by a nationally recognized testing laboratory to conform to current UL Standards for use on recreational boats.\n\"Motorboat\" means a watercraft propelled in any manner by machinery, including watercraft temporarily equipped with detachable motors.\n\"Operate\" means to navigate or otherwise use a watercraft.\n\"Operator\" means the person who operates or controls the navigation or use of a watercraft.\n\"Other commercial operation\" means use of a watercraft for work, rather than recreation, to transport equipment, goods, and materials on public waters.\n\"Owner\" means a person having a property right or title to a watercraft other than a security interest. Owner includes a person entitled to the use or possession of a watercraft, subject to an interest in another person, reserved or created by agreement that secures payment or performance of an obligation, but owner does not include a lessee under a lease not intended as security.\n\"Paddleboat\" means a nonmotorized watercraft 19 feet in length or less that is propelled solely by a paddle wheel peddled by an operator or passenger.\n\"Person\" means an individual, partnership, corporation, the state and its agencies and subdivisions, and any other legal entity.\n\"Personal watercraft\" means a motorboat that:\n(1) is powered by an inboard motor powering a water jet pump or by an outboard or propeller-driven motor; and\n(2) is designed to be operated by a person or persons sitting, standing, or kneeling on the craft, rather than in the conventional manner of sitting or standing inside a motorboat.\n\"Rent\" watercraft means to make a watercraft available for the use of others in connection with a business.\n\"Rice boat\" means a nonmotorized watercraft being used for harvesting wild rice.\n\"Sailboard\" means a single passenger, nonmotorized watercraft using a surfboard type hull and a free sail system which, without capsizing, allows the sail to lie flat in the water when not being supported by the operator.\n\"Slow-no wake\" means operation of a watercraft at the slowest possible speed necessary to maintain steerage, but in no case greater than five miles per hour.\n\"Underway or in use\" means a watercraft in operation or use unless it is securely fastened to a dock or other permanent mooring.\n\"Watercraft\" means any contrivance used or designed for navigation on water, except:\n(1) a waterfowl boat during the waterfowl-hunting seasons;\n(2) a rice boat during the harvest season; or\n(3) a seaplane.\n\"Waterfowl boat\" means a watercraft being used while hunting waterfowl.\n\"Waters of this state\" means waters capable of substantial beneficial public use and waters to which the public has access that are within the territorial limits of this state, including boundary waters.",
	"repealed": false
}