{
	"id": "116.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.195",
	"title": "116.195 BENEFICIAL USE OF WASTEWATER AND STORMWATER; CAPITAL GRANTS FOR DEMONSTRATION PROJECTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Agency\" means the Pollution Control Agency.\n(c) \"Beneficial use of wastewater or stormwater\" means:\n(1) use of the effluent from a wastewater treatment plant that replaces use of groundwater; or\n(2) use of stormwater that replaces the use of groundwater.\n(d) \"Capital project\" means the acquisition or betterment of public land, buildings, and other public improvements of a capital nature for the treatment of wastewater intended for beneficial use or for the use of stormwater to replace groundwater use. Capital project includes projects to retrofit, expand, or construct new treatment facilities.\nThe agency shall make grant awards to political subdivisions for up to 50 percent of the costs to predesign and design capital projects that demonstrate the beneficial use of wastewater or stormwater. The grant agreement must provide that the predesign and design work being funded is public information and available to anyone without charge. The agency must make the predesign and design work available on its website.\n(a) The agency shall make grant awards to political subdivisions for up to 50 percent of the costs to acquire, construct, install, furnish, and equip capital projects that demonstrate the beneficial use of wastewater or stormwater. The political subdivision must submit design plans and specifications to the agency as part of the application.\n(b) The agency must consult with the Public Facilities Authority and the commissioner of natural resources in reviewing and ranking applications for grants under this section.\n(c) The application must identify the uses of the treated wastewater or stormwater and greater weight will be given to applications that include a binding commitment to participate by the user or users.\n(d) The agency must give preference to projects that will reduce use of the greatest volume of groundwater from aquifers with the slowest rate of recharge.\nThe agency shall develop an application form and procedures.\n[Repealed, 2014 c 248 s 19]",
	"repealed": false
}