{
	"id": "299F.850",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.850",
	"title": "299F.850 CIGARETTE FIRE SAFETY DEFINITIONS.",
	"text": "The terms used in sections 299F.850 to 299F.859 have the meanings given them in this section.\n\"Agent\" means any person licensed by the commissioner of revenue to purchase and affix adhesive or meter stamps on packages of cigarettes.\n\"Cigarette\" means any roll for smoking made wholly or in part of tobacco, the wrapper or cover of which is made of paper or any other substance or material except tobacco.\n\"Manufacturer\" means:\n(1) any entity that manufactures or otherwise produces cigarettes or causes cigarettes to be manufactured or produced anywhere that the manufacturer intends to be sold in the state, including cigarettes intended to be sold in the United States through an importer;\n(2) the first purchaser anywhere that intends to resell in the United States cigarettes manufactured anywhere that the original manufacturer or maker does not intend to be sold in the United States; or\n(3) any entity that becomes a successor of an entity described in clause (1) or (2).\n\"Quality control and quality assurance program\" means the laboratory procedures implemented to ensure that operator bias, systematic and nonsystematic methodological errors, and equipment-related problems do not affect the results of the testing. This program ensures that the testing repeatability remains within the required repeatability values stated in section 299F.851, subdivision 1, paragraph (g), for all test trials used to certify cigarettes in accordance with sections 299F.850 to 299F.859.\n\"Repeatability\" means the range of values within which the repeat results of cigarette test trials from a single laboratory will fall 95 percent of the time.\n\"Retail dealer\" means any person, other than a wholesale dealer, engaged in selling cigarettes or tobacco products.\n\"Sale\" means any transfer of title or possession or both, exchange or barter, conditional or otherwise, in any manner or by any means whatever or any agreement therefore. In addition to cash and credit sales, the giving of cigarettes as samples, prizes, or gifts and the exchanging of cigarettes for any consideration other than money, are considered sales.\n\"Sell\" means to make a sale or to offer or agree to make a sale.\n\"Wholesale dealer\" means any person who (1) sells cigarettes or tobacco products to retail dealers or other persons for purposes of resale or (2) owns, operates, or maintains one or more cigarette or tobacco product vending machines in, at, or upon premises owned or occupied by any other person.",
	"repealed": false
}