{
	"id": "609.668",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.668",
	"title": "609.668 EXPLOSIVE AND INCENDIARY DEVICES.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"Explosive device\" means a device so articulated that an ignition by fire, friction, concussion, chemical reaction, or detonation of any part of the device may cause such sudden generation of highly heated gases that the resultant gaseous pressures are capable of producing destructive effects. Explosive devices include, but are not limited to, bombs, grenades, rockets having a propellant charge of more than four ounces, mines, and fireworks modified for other than their intended purpose. The term includes devices that produce a chemical reaction that produces gas capable of bursting its container and producing destructive effects. The term does not include firearms ammunition.\n(b) \"Incendiary device\" means a device so articulated that an ignition by fire, friction, concussion, detonation, or other method may produce destructive effects primarily through combustion rather than explosion. The term does not include a manufactured device or article in common use by the general public that is designed to produce combustion for a lawful purpose, including but not limited to matches, lighters, flares, or devices commercially manufactured primarily for the purpose of illumination, heating, or cooking. The term does not include firearms ammunition.\n(c) \"Crime of violence\" has the meaning given in section 624.712, subdivision 5, and also includes a domestic assault conviction when committed within the last three years or while an order for protection is active against the person, whichever period is longer.\nThe following persons are prohibited from possessing or reporting an explosive device or incendiary device:\n(a) a person under the age of 18 years;\n(b) a person who has been convicted in this state or elsewhere of a crime of violence unless ten years have elapsed since the person's civil rights have been restored or the sentence has expired, whichever occurs first, and during that time the person has not been convicted of any other crime of violence. For purposes of this section, crime of violence includes crimes in other states or jurisdictions that would have been crimes of violence if they had been committed in this state;\n(c) a person who is or has ever been confined or committed in Minnesota or elsewhere as a person who is mentally ill, developmentally disabled, or mentally ill and dangerous to the public, as defined in section 253B.02, to a treatment facility, unless the person possesses a certificate of a medical doctor or psychiatrist licensed in Minnesota, or other satisfactory proof, that the person is no longer suffering from this disability;\n(d) a person who has been convicted in Minnesota or elsewhere for the unlawful use, possession, or sale of a controlled substance other than conviction for possession of a small amount of marijuana, as defined in section 152.01, subdivision 16, or who is or has ever been hospitalized or committed for treatment for the habitual use of a controlled substance or marijuana, as defined in sections 152.01 and 152.02, unless the person possesses a certificate of a medical doctor or psychiatrist licensed in Minnesota, or other satisfactory proof, that the person has not abused a controlled substance or marijuana during the previous two years;\n(e) a person who has been confined or committed to a treatment facility in Minnesota or elsewhere as chemically dependent, as defined in section 253B.02, unless the person has completed treatment; and\n(f) a peace officer who is informally admitted to a treatment facility under section 253B.04 for chemical dependency, unless the officer possesses a certificate from the head of the treatment facility discharging or provisionally discharging the officer from the treatment facility.\nA person who in good faith issues a certificate to a person described in this subdivision to possess or use an incendiary or explosive device is not liable for damages resulting or arising from the actions or misconduct with an explosive or incendiary device committed by the individual who is the subject of the certificate.\n(a) The following persons may own or possess an explosive device or incendiary device provided that subdivision 4 is complied with:\n(1) law enforcement officers for use in the course of their duties;\n(2) fire department personnel for use in the course of their duties;\n(3) corrections officers and other personnel at correctional facilities or institutions when used for the retention of persons convicted or accused of crime;\n(4) persons possessing explosive devices or incendiary devices that although designed as devices have been determined by the commissioner of public safety or the commissioner's delegate, by reason of the date of manufacture, value, design, or other characteristics, to be a collector's item, relic, museum piece, or specifically used in a particular vocation or employment, such as the entertainment industry; and\n(5) dealers and manufacturers who are federally licensed or registered.\n(b) Persons listed in paragraph (a) shall also comply with the federal requirements for the registration and licensing of destructive devices.\n(a) Before owning or possessing an explosive device or incendiary device as authorized by subdivision 3, a person shall file a written report with the Department of Public Safety showing the person's name and address; the person's title, position, and type of employment; a description of the explosive device or incendiary device sufficient to enable identification of the device; the purpose for which the device will be owned or possessed; the federal license or registration number, if appropriate; and other information as the department may require.\n(b) Before owning or possessing an explosive device or incendiary device, a dealer or manufacturer shall file a written report with the Department of Public Safety showing the name and address of the dealer or manufacturer; the federal license or registration number, if appropriate; the general type and disposition of the device; and other information as the department may require.\nThis section does not apply to:\n(1) members of the armed forces of either the United States or the state of Minnesota when for use in the course of duties;\n(2) educational institutions when the devices are manufactured or used in conjunction with an official education course or program;\n(3) propellant-actuated devices, or propellant-actuated industrial tools manufactured, imported, or distributed for their intended purpose;\n(4) items that are neither designed or redesigned for use as explosive devices or incendiary devices;\n(5) governmental organizations using explosive devices or incendiary devices for agricultural purposes or control of wildlife;\n(6) governmental organizations using explosive devices or incendiary devices for official training purposes or as items retained as evidence; or\n(7) arsenals, navy yards, depots, or other establishments owned by, or operated by or on behalf of, the United States.\n(a) Except as otherwise provided in this section, whoever possesses, manufactures, transports, or stores an explosive device or incendiary device in violation of this section may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(b) Whoever legally possesses, manufactures, transports, or stores an explosive device or incendiary device, with intent to use the device to damage property or cause injury, may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(c) Whoever, acting with gross disregard for human life or property, negligently causes an explosive device or incendiary device to be discharged, may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $100,000, or both.\n[Repealed, 2003 c 2 art 1 s 45]",
	"repealed": false
}