{
	"id": "272.0211",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.0211",
	"title": "272.0211 SLIDING SCALE MARKET VALUE EXCLUSION FOR ELECTRIC POWER GENERATION EFFICIENCY.",
	"text": "An owner or operator of a new or existing electric power generation facility, excluding wind energy conversion systems, may apply to the commissioner of revenue for a market value exclusion on the property as provided for in this section. This exclusion shall apply only to the market value of the equipment of the facility, and shall not apply to the structures and the land upon which the facility is located. The commissioner of revenue shall prescribe the content, format, manner, and procedures for this application pursuant to section 270C.30, except that a \"law administered by the commissioner\" includes the property tax laws. If an application is made by electronic means, the taxpayer's signature is defined pursuant to section 270C.304, except that a \"law administered by the commissioner\" includes the property tax laws. Upon receiving the application, the commissioner of revenue shall: (1) request the commissioner of commerce to make a determination of the efficiency of the applicant's electric power generation facility; and (2) shall develop an electronic means to notify interested parties when electric power generation facilities have filed an application. The commissioner of commerce shall calculate efficiency as the ratio of useful energy outputs to energy inputs, expressed as a percentage, based on the performance of the facility's equipment during normal full load operation. The commissioner must include in this formula the energy used in any on-site preparation of materials necessary to convert the materials into the fuel used to generate electricity, such as a process to gasify petroleum coke. The commissioner shall use the Higher Heating Value (HHV) for all substances in the commissioner's efficiency calculations, except for wood for fuel in a biomass-eligible project under section 216B.2424; for these instances, the commissioner shall adjust the heating value to allow for energy consumed for evaporation of the moisture in the wood. The applicant shall provide the commissioner of commerce with whatever information the commissioner deems necessary to make the determination. Within 30 days of the receipt of the necessary information, the commissioner of commerce shall certify the findings of the efficiency determination to the commissioner of revenue and to the applicant. The commissioner of commerce shall determine the efficiency of the facility and certify the findings of that determination to the commissioner of revenue every two years thereafter from the date of the original certification.\nBased upon the efficiency determination provided by the commissioner of commerce as described in subdivision 1, the commissioner of revenue shall subtract eight percent of the taxable market value of the qualifying property for each percentage point that the efficiency of the specific facility, as determined by the commissioner of commerce, is above 40 percent. The reduction in taxable market value shall be reflected in the taxable market value of the facility beginning with the assessment year immediately following the determination. The commissioner shall develop an electronic means to notify interested parties of the qualifying facilities and their respective exclusion percentages after the efficiency determination is made by the Department of Commerce. For a facility that is assessed by the county in which the facility is located, the commissioner of revenue shall certify to the assessor of that county the percentage of the taxable market value of the facility to be excluded.\n(a) The commissioner of revenue shall revoke the market value reduction under this section, if:\n(1) the applicant exercises its right under federal law to require an electric utility to purchase power generated by the facility; and\n(2) the electric utility notifies the commissioner that the applicant has exercised its right to require purchase of power.\nThe revocation is effective beginning the first assessment year after notification of the commissioner.\n(b) For purposes of this subdivision, the following terms mean:\n(1) \"Federal law\" is the federal Public Utility Regulatory Policies Act, United States Code, title 16, section 824a-3, and regulations promulgated under that section, including Code of Federal Regulations, title 18, sections 929.303 and 929.304.\n(2) \"Electric utility\" means an electric utility as defined in federal law described in clause (1).\nAn owner or operator of a new or existing electric power generation facility who offers electric power generated by the facility for sale is eligible for an exclusion under this section only if:\n(1) the owner or operator has received a certificate of need under section 216B.243, if required under that section;\n(2) the public utilities commission finds that an agreement exists or a good faith offer has been made to sell the majority of the net power generated by the facility to an electric utility which has a demonstrated need for the power. A right of first refusal satisfies the good faith offer requirement. The commission shall have 90 days from the date the commission receives notice of the application under subdivision 1 to make this determination;\n(3) the electric utility has agreed in advance not to offer the electric power for resale to a retail customer located outside of the utility's assigned service area, or, if the utility is a generation and transmission cooperative electric association, the assigned service area of its members, unless otherwise permitted by law; and\n(4) for any facility that was not certified as eligible for an exclusion under subdivision 2 for property taxes payable in 2015, the facility must be converted from coal to an alternative fuel and must have a nameplate capacity prior to conversion of less than 75 megawatts.\nFor the purposes of this subdivision, \"electric utility\" means an entity whose primary business function is to operate, maintain, or control equipment or facilities for providing electric service at retail or wholesale, and includes distribution cooperative electric associations, generation and transmission cooperative electric associations, municipal utilities, and public utilities as defined in section 216B.02, subdivision 4.",
	"repealed": false
}