{
	"id": "471.425",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.425",
	"title": "471.425 PROMPT PAYMENT OF LOCAL GOVERNMENT BILLS.",
	"text": "For the purposes of this section, the following terms have the meanings here given them.\n(a) \"Contract\" means any written legal document or documents signed by both parties in which the terms and conditions of any interest or other penalty for late payments are clearly stated.\n(b) \"Date of receipt\" means the completed delivery of the goods or services or the satisfactory installation, assembly or specified portion thereof, or the receipt of the invoice for the delivery of the goods or services, whichever is later.\n(c) \"Governing board\" means the elected or appointed board of the municipality and includes, but is not limited to, city councils, town boards and county boards.\n(d) \"Municipality\" means any home rule charter or statutory city, county, town, school district, political subdivision or agency of local government. \"Municipality\" means the Metropolitan Council or any board or agency created under chapter 473.\nA municipality must pay each vendor obligation according to the terms of the contract or, if no contract terms apply, within the standard payment period unless the municipality in good faith disputes the obligation. Standard payment period is defined as follows:\n(a) For municipalities who have governing boards which have regularly scheduled meetings at least once a month, the standard payment period is defined as within 35 days of the date of receipt.\n(b) For municipalities whose governing boards do not regularly meet at least once a month, the standard payment period is defined as 45 days after receipt of the goods or services or the invoice for the goods or services, whichever is later.\n(c) For joint powers organizations organized under section 471.59, the standard payment period is within 45 days of the date of receipt.\nIf an invoice is incorrect, defective or otherwise improper, the municipality must notify the vendor within ten days of the date of receipt. Upon receiving a corrected invoice from the vendor, the municipality must pay the obligation within the standard payment period defined in subdivision 2.\n(a) Except otherwise provided in this section, a municipality shall calculate and pay interest to a vendor if the municipality has not paid the obligation according to the terms of the contract or, if no contract terms apply, within the standard payment period as defined in subdivision 2. The standard payment period for a negotiated contract or agreement between a vendor and a municipality which requires an audit by the municipality before acceptance and payment of the vendor's invoice shall not be begun until the completion of the audit by the municipality.\n(b) The rate of interest calculated and paid by the municipality on the outstanding balance of the obligation not paid according to the terms of the contract or during the standard payment period shall be 1-1/2 percent per month or part of a month.\n(c) No interest penalties may accrue against a purchaser who delays payment of a vendor obligation due to a good faith dispute with the vendor regarding the fitness of the product or service, contract compliance, or any defect, error or omission related thereto. If such delay undertaken by the municipality is not in good faith, the vendor may recover costs and attorney's fees.\n(d) The minimum monthly interest penalty payment that a municipality shall calculate and pay a vendor for the unpaid balance for any one overdue bill of $100 or more is $10. For unpaid balances of less than $100, the municipality shall calculate and pay the actual interest penalty due the vendor.\nEach contract of a municipality must require the prime contractor to pay any subcontractor within ten days of the prime contractor's receipt of payment from the municipality for undisputed services provided by the subcontractor. The contract must require the prime contractor to pay interest of 1-1/2 percent per month or any part of a month to the subcontractor on any undisputed amount not paid on time to the subcontractor. The minimum monthly interest penalty payment for an unpaid balance of $100 or more is $10. For an unpaid balance of less than $100, the prime contractor shall pay the actual penalty due to the subcontractor. A subcontractor who prevails in a civil action to collect interest penalties from a prime contractor must be awarded its costs and disbursements, including attorney's fees, incurred in bringing the action.\nThis section applies to all goods, leases and rents, and contracts for services, construction, repair and remodeling. Purchases from or contracts for service with a public utility as defined in section 216B.02 or a telephone company as defined in section 237.01 that has on file with the public utilities commission an approved practice regarding late fees are not subject to this section.",
	"repealed": false
}