{
	"id": "15.0599",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.0599",
	"title": "15.0599 REGISTRATION OF MULTIMEMBER AGENCIES.",
	"text": "(a) For purposes of this section, \"agency\" means:\n(1) a state board, commission, council, committee, authority, task force, including an advisory task force established under section 15.014 or 15.0593, other multimember agency, however designated, established by statute or order and having statewide jurisdiction;\n(2) the Metropolitan Council established by section 473.123, a metropolitan agency as defined in section 473.121, subdivision 5a, or a multimember body, however designated, appointed by the Metropolitan Council or a metropolitan agency if the membership includes at least one person who is not a member of the council or the agency;\n(3) a multimember body whose members are appointed by the legislature if the body has at least one nonlegislative member; and\n(4) any other multimember body established by law with at least one appointed member, without regard to the appointing authority.\n(b) \"Secretary\" means the secretary of state.\nWithin 30 days after the appointment of members to a new agency, the appointing authority shall register the agency with the secretary, providing the information required in subdivision 4, paragraph (a).\nUnless an agency has submitted its initial registration under subdivision 2 within the last 90 days, the chair of an existing agency shall register the agency with the secretary by July 15 of each year, providing the information required in subdivision 4, paragraph (b), and updating, if necessary, any of the information previously provided in accordance with subdivision 4, paragraph (a).\n(a) The appointing authority of a newly established agency or the authority's designee shall provide the secretary with the following information:\n(1) the name, mailing address, electronic mail address, and telephone number of the agency;\n(2) the legal authority for the establishment of the agency and the name and the title of the person or persons appointing agency members;\n(3) the powers and duties of the agency and whether the agency, however designated, is best described by section 15.012, paragraph (a), (b), (c), (e), or (f);\n(4) the number of authorized members, together with any prescribed restrictions on eligibility;\n(5) the roster of current members, including mailing addresses, electronic mail addresses, and telephone numbers;\n(6) a breakdown of the membership showing distribution by county, legislative district, and congressional district and compliance with any restrictions listed in accordance with clause (4);\n(7) if any members have voluntarily provided the information, the sex, age, political preference or lack of preference, status with regard to disability, race, veteran status, and national origin of those members;\n(8) the dates of commencement and expiration of membership terms and the expiration date of the agency, if any;\n(9) the compensation of members and appropriations or other money available to the agency;\n(10) the name of the state agency or other entity, if any, required to provide staff or administrative support to the agency;\n(11) the regular meeting schedule, if any, and the approximate number of hours a month of meetings or other activities required of members; and\n(12) a brief statement of the goal or purpose of the agency, along with a summary of what an existing agency has done, or what a newly established agency plans to do to achieve its goal or purpose.\nThe publication requirement under clause (5) may be met by publishing a member's home or business address and telephone number, the address and telephone number of the agency to which the member is appointed, the member's electronic mail address, or any other information that would enable the public to communicate with the member.\n(b) The chair of an existing agency or the chair's designee shall provide information, covering the fiscal year in which it is registering, on the number of meetings it has held, its expenses, and the number of staff hours, if any, devoted to its support. The chair or designee shall also, if necessary, update any of the information previously provided in accordance with paragraph (a).\n(c) The secretary shall provide electronic forms for the reporting of information required by this subdivision and may require reporting by electronic means.\nThe members of an agency that submits all the information required by this section by the prescribed deadlines are eligible to receive compensation, but no compensation, including reimbursement for expenses, may be paid to members of an agency not in compliance with this section. If an agency has not submitted all required information by its applicable deadline, the secretary shall notify the agency that it is not in compliance and that it has 30 days from the date of the notice to achieve compliance. If the agency is out of compliance at the end of the 30-day period, the secretary shall notify the commissioner of management and budget that members of the agency are not entitled to compensation. If the agency subsequently complies with this section, the secretary shall notify the commissioner that the agency's members are eligible for compensation from the date of compliance. No retroactive compensation may be paid, however, for any period during which the agency was out of compliance.\nBy October 15 of each year, the secretary shall furnish copies and a summary of the information collected under subdivision 4 to the Legislative Reference Library.\nAny material that under sections 15.0597 to 15.0599 is required to be published in the State Register may instead be published on the World Wide Web.\nIf that option is used, the secretary of state shall publish notice of that fact in the State Register at least once a year and shall send the same notice by United States mail to all persons who have registered with the secretary for the purpose of receiving notice of the secretary's listings.",
	"repealed": false
}