{
	"id": "241.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.021",
	"title": "241.021 LICENSING AND SUPERVISION OF FACILITIES.",
	"text": "(a) Except as provided in paragraph (b), the commissioner of corrections shall inspect and license all correctional facilities throughout the state, whether public or private, established and operated for the detention and confinement of persons confined or incarcerated therein according to law except to the extent that they are inspected or licensed by other state regulating agencies. The commissioner shall promulgate pursuant to chapter 14, rules establishing minimum standards for these facilities with respect to their management, operation, physical condition, and the security, safety, health, treatment, and discipline of persons confined or incarcerated therein. These minimum standards shall include but are not limited to specific guidance pertaining to:\n(1) screening, appraisal, assessment, and treatment for persons confined or incarcerated in correctional facilities with mental illness or substance use disorders;\n(2) a policy on the involuntary administration of medications;\n(3) suicide prevention plans and training;\n(4) verification of medications in a timely manner;\n(5) well-being checks;\n(6) discharge planning, including providing prescribed medications to persons confined or incarcerated in correctional facilities upon release;\n(7) a policy on referrals or transfers to medical or mental health care in a noncorrectional institution;\n(8) use of segregation and mental health checks;\n(9) critical incident debriefings;\n(10) clinical management of substance use disorders and opioid overdose emergency procedures;\n(11) a policy regarding identification of persons with special needs confined or incarcerated in correctional facilities;\n(12) a policy regarding the use of telehealth;\n(13) self-auditing of compliance with minimum standards;\n(14) information sharing with medical personnel and when medical assessment must be facilitated;\n(15) a code of conduct policy for facility staff and annual training;\n(16) a policy on death review of all circumstances surrounding the death of an individual committed to the custody of the facility; and\n(17) dissemination of a rights statement made available to persons confined or incarcerated in licensed correctional facilities.\nNo individual, corporation, partnership, voluntary association, or other private organization legally responsible for the operation of a correctional facility may operate the facility unless it possesses a current license from the commissioner of corrections. Private adult correctional facilities shall have the authority of section 624.714, subdivision 13, if the Department of Corrections licenses the facility with the authority and the facility meets requirements of section 243.52.\nThe commissioner shall review the correctional facilities described in this subdivision at least once every two years, except as otherwise provided, to determine compliance with the minimum standards established according to this subdivision or other Minnesota statute related to minimum standards and conditions of confinement.\nThe commissioner shall grant a license to any facility found to conform to minimum standards or to any facility which, in the commissioner's judgment, is making satisfactory progress toward substantial conformity and the standards not being met do not impact the interests and well-being of the persons confined or incarcerated in the facility. A limited license under subdivision 1a may be issued for purposes of effectuating a facility closure. The commissioner may grant licensure up to two years. Unless otherwise specified by statute, all licenses issued under this chapter expire at 12:01 a.m. on the day after the expiration date stated on the license.\nThe commissioner shall have access to the buildings, grounds, books, records, staff, and to persons confined or incarcerated in these facilities. The commissioner may require the officers in charge of these facilities to furnish all information and statistics the commissioner deems necessary, at a time and place designated by the commissioner. Notwithstanding chapter 13 or any other state law classifying or restricting access to data, the officers in charge of these facilities must furnish all data available to the facility that the commissioner deems necessary to conduct a review of any emergency or unusual occurrence at the facility. Failure to provide or grant access to relevant information or statistics necessary to fulfill inspection or emergency or unusual occurrence reviews, as requested by the commissioner, may be grounds for the commissioner to take action against a correctional facility's license under subdivision 1a, 1b, or 1c.\nAll facility administrators of correctional facilities are required to report all deaths of individuals who died while committed to the custody of the facility, regardless of whether the death occurred at the facility or after removal from the facility for medical care stemming from an incident or need for medical care at the correctional facility, as soon as practicable, but no later than 24 hours of receiving knowledge of the death, including any demographic information as required by the commissioner.\nAll facility administrators of correctional facilities are required to report all other emergency or unusual occurrences as defined by rule, including uses of force by facility staff that result in substantial bodily harm or suicide attempts, to the commissioner of corrections within ten days from the occurrence, including any demographic information as required by the commissioner. The commissioner of corrections shall consult with the Minnesota Sheriffs' Association and a representative from the Minnesota Association of Community Corrections Act Counties who is responsible for the operations of an adult correctional facility to define \"use of force\" that results in substantial bodily harm for reporting purposes.\nThe commissioner may require that any or all such information be provided through the Department of Corrections detention information system. The commissioner shall post each inspection report publicly and on the department's website within 30 days of completing the inspection. The education program offered in a correctional facility for the confinement or incarceration of juvenile offenders must be approved by the commissioner of education before the commissioner of corrections may grant a license to the facility.\n(b) For juvenile facilities licensed by the commissioner of human services, the commissioner may inspect and certify programs based on certification standards set forth in Minnesota Rules. For the purpose of this paragraph, \"certification\" has the meaning given it in section 245A.02.\n(c) Any state agency which regulates, inspects, or licenses certain aspects of correctional facilities shall, insofar as is possible, ensure that the minimum standards it requires are substantially the same as those required by other state agencies which regulate, inspect, or license the same aspects of similar types of correctional facilities, although at different correctional facilities.\n(d) Nothing in this section shall be construed to limit the commissioner of corrections' authority to promulgate rules establishing standards of eligibility for counties to receive funds under chapter 401, or to require counties to comply with operating standards the commissioner establishes as a condition precedent for counties to receive that funding.\n(e) The department's inspection unit must report directly to a division head outside of the correctional institutions division.\n(a) When the commissioner finds that any facility described in subdivision 1, except foster care facilities for delinquent children and youth as provided in subdivision 2, does not substantially conform to the minimum standards established by the commissioner and is not making satisfactory progress toward substantial conformance and the nonconformance does not present an imminent risk of life-threatening harm or serious physical injury to the persons confined or incarcerated in the facility, the commissioner shall promptly notify the facility administrator and the governing board of the facility of the deficiencies and must issue a correction order or a conditional license order that the deficiencies be remedied within a reasonable and specified period of time.\nThe conditional license order may restrict the use of any facility which does not substantially conform to minimum standards, including imposition of conditions limiting operation of the facility or parts of the facility, reducing facility capacity, limiting intake, limiting length of detention for individuals, or imposing detention limitations based on the needs of the individuals being confined or incarcerated therein.\nThe correction order or conditional license order must clearly state the following:\n(1) the specific minimum standards violated, noting the implicated rule or law;\n(2) the findings that constitute a violation of minimum standards;\n(3) the corrective action needed;\n(4) time allowed to correct each violation; and\n(5) if a license is made conditional, the length and terms of the conditional license, any conditions limiting operation of the facility, and the reasons for making the license conditional.\n(b) The facility administrator may request review of the findings noted in the conditional license order on the grounds that satisfactory progress toward substantial compliance with minimum standards has been made, supported by evidence of correction, and, if appropriate, may include a written schedule for compliance. The commissioner shall review the evidence of correction and the progress made toward substantial compliance with minimum standards within a reasonable period of time, not to exceed ten business days. When the commissioner has assurance that satisfactory progress toward substantial compliance with minimum standards is being made, the commissioner shall lift any conditions limiting operation of the facility or parts of the facility or remove the conditional license order.\n(c) Nothing in this section prohibits the commissioner from ordering a revocation under subdivision 1b prior to issuing a correction order or conditional license order.\n(a) When, after due notice to the facility administrator of the commissioner's intent to issue a revocation order, the commissioner finds that any facility described in this subdivision, except county jails and lockups subject to active condemnation proceedings or orders as provided in sections 641.26, 642.10, and 642.11, does not conform to minimum standards, or is not making satisfactory progress toward substantial compliance with minimum standards, and the nonconformance does not present an imminent risk of life-threatening harm or serious physical injury to the persons confined or incarcerated in the facility, the commissioner may issue an order revoking the license of that facility.\nThe notice of intent to issue a revocation order shall include:\n(1) the citation to minimum standards that have been violated;\n(2) the nature and severity of each violation;\n(3) whether the violation is recurring or nonrecurring;\n(4) the effect of the violation on persons confined or incarcerated in the correctional facility;\n(5) an evaluation of the risk of harm to persons confined or incarcerated in the correctional facility;\n(6) relevant facts, conditions, and circumstances concerning the operation of the licensed facility, including at a minimum:\n(i) specific facility deficiencies that endanger the health or safety of persons confined or incarcerated in the correctional facility;\n(ii) substantiated complaints relating to the correctional facility; or\n(iii) any other evidence that the correctional facility is not in compliance with minimum standards.\n(b) The facility administrator must submit a written response within 30 days of receipt of the notice of intent to issue a revocation order with any information related to errors in the notice, ability to conform to minimum standards within a set period of time including but not limited to a written schedule for compliance, and any other information the facility administrator deems relevant for consideration by the commissioner. The written response must also include a written plan indicating how the correctional facility will ensure the transfer of confined or incarcerated individuals and records if the correctional facility closes. Plans must specify arrangements the correctional facility will make to transfer confined or incarcerated individuals to another licensed correctional facility for continuation of detention.\n(c) When revoking a license, the commissioner shall consider the nature, chronicity, or severity of the violation of law or rule and the effect of the violation on the health, safety, or rights of persons confined or incarcerated in the correctional facility.\n(d) If the facility administrator does not respond within 30 days to the notice of intent to issue a revocation order or if the commissioner does not have assurance that satisfactory progress toward substantial compliance with minimum standards will be made, the commissioner shall issue a revocation order. The revocation order must be sent to the facility administrator and the governing board of the facility, clearly stating:\n(1) the specific minimum standards violated, noting the implicated rule or law;\n(2) the findings that constitute a violation of minimum standards and the nature, chronicity, or severity of those violations;\n(3) the corrective action needed;\n(4) any prior correction or conditional license orders issued to correct violations; and\n(5) the date at which the license revocation shall take place.\nA revocation order may authorize use until a certain date, not to exceed the duration of the current license, unless a limited license is issued by the commissioner for purposes of effectuating a facility closure and continued operation does not present an imminent risk of life-threatening harm or is not likely to result in serious physical injury to the persons confined or incarcerated in the facility.\n(e) After revocation of the facility's licensure, that facility shall not be used until the license is renewed. When the commissioner is satisfied that satisfactory progress toward substantial compliance with minimum standards is being made, the commissioner may, at the request of the facility administrator supported by a written schedule for compliance, reinstate the license.\nThe commissioner shall act immediately to temporarily suspend a license issued under this chapter if:\n(1) the correctional facility's failure to comply with applicable minimum standards or the conditions in the correctional facility pose an imminent risk of life-threatening harm or serious physical injury to persons confined or incarcerated in the facility, staff, law enforcement, visitors, or the public; and\n(i) if the imminent risk of life-threatening harm or serious physical injury cannot be promptly corrected through a different type of order under this section; and\n(ii) the correctional facility cannot or has not corrected the violation giving rise to the imminent risk of life-threatening harm or serious physical injury; or\n(2) while the correctional facility continues to operate pending due notice and opportunity for written response to the commissioner's notice of intent to issue an order of revocation, the commissioner identifies one or more subsequent violations of minimum standards which may adversely affect the health or safety of persons confined or incarcerated in the facility, staff, law enforcement, visitors, or the public.\nA notice stating the reasons for the immediate suspension informing the facility administrator must be delivered by personal service to the correctional facility administrator and the governing board of the facility.\nIf the license of a facility under this section is revoked or suspended, or use of the facility is restricted for any reason under a conditional license order, or a correction order is issued to a facility, the commissioner shall post the facility, the status of the facility's license, and the reason for the correction order, restriction, revocation, or suspension publicly and on the department's website.\n(a) If the facility administrator believes the correction order, conditional license order, or revocation order is in error, the facility administrator may ask the Department of Corrections to reconsider the parts of the order or action that are alleged to be in error. The request for reconsideration must:\n(1) be made in writing;\n(2) be postmarked and sent to the commissioner no later than 30 calendar days after receipt of the correction order, conditional license order, or revocation order;\n(3) specify the parts of the order that are alleged to be in error;\n(4) explain why the correction order, conditional license order, or revocation order is in error; and\n(5) include documentation to support the allegation of error.\nThe commissioner shall issue a disposition within 60 days of receipt of the facility administrator's response to correction, conditional license, or revocation order violations. A request for reconsideration does not stay any provisions or requirements of the order.\n(b) The facility administrator may request reconsideration of an order immediately suspending a license. The request for reconsideration of an order immediately suspending a license must be made in writing and sent by certified mail, personal service, or other means expressly stated in the commissioner's order. If mailed, the request for reconsideration must be postmarked and sent to the commissioner no later than five business days after the facility administrator receives notice that the license has been immediately suspended. If a request is made by personal service, it must be received by the commissioner no later than five business days after the facility administrator received the order. The request for reconsideration must:\n(1) specify the parts of the order that are alleged to be in error;\n(2) explain why they are in error; and\n(3) include documentation to support the allegation of error.\nA facility administrator and the governing board of the facility shall discontinue operation of the correctional facility upon receipt of the commissioner's order to immediately suspend the license.\n(c) Within five business days of receipt of the facility administrator's timely request for reconsideration of a temporary immediate suspension, the commissioner shall review the request for reconsideration. The scope of the review shall be limited solely to the issue of whether the temporary immediate suspension order should remain in effect pending the written response to commissioner's notice of intent to issue a revocation order.\nThe commissioner's disposition of a request for reconsideration of correction, conditional license, temporary immediate suspension, or revocation order is final and subject to appeal. The facility administrator must request reconsideration as required by this section of any correction, conditional license, temporary immediate suspension, or revocation order prior to appeal.\nNo later than 60 days after the postmark date of the mailed notice of the commissioner's decision on a request for reconsideration, the facility administrator may appeal the decision by filing for a writ of certiorari with the court of appeals under section 606.01 and Minnesota Rules of Civil Appellate Procedure, Rule 115.\nBy February 15, 2022, and by February 15 each year thereafter, the commissioner of corrections shall report to the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over public safety and judiciary on the status of the implementation of the provisions in this section over the prior year, particularly the health and safety of individuals confined or incarcerated in a state correctional facility and a facility licensed by the commissioner. This report shall include but not be limited to data regarding:\n(1) the number of confined or incarcerated persons who died while committed to the custody of the facility, regardless of whether the death occurred at the facility or after removal from the facility for medical care stemming from an incident or need for medical care at the correctional facility, including aggregated demographic information and the correctional facilities' most recent inspection reports and any corrective orders or conditional licenses issued;\n(2) the aggregated results of the death reviews by facility as required by subdivision 8, including any implemented policy changes;\n(3) the number of uses of force by facility staff on persons confined or incarcerated in the correctional facility, including but not limited to whether those uses of force were determined to be justified by the facility, for which the commissioner of corrections shall consult with the Minnesota Sheriffs' Association and a representative from the Minnesota Association of Community Corrections Act Counties who is responsible for the operations of an adult correctional facility to develop criteria for reporting and define reportable uses of force;\n(4) the number of suicide attempts, number of people transported to a medical facility, and number of people placed in segregation;\n(5) the number of persons committed to the commissioner of corrections' custody that the commissioner is housing in facilities licensed under subdivision 1, including but not limited to:\n(i) aggregated demographic data of those individuals;\n(ii) length of time spent housed in a licensed correctional facility; and\n(iii) any contracts the Department of Corrections has with correctional facilities to provide housing; and\n(6) summary data from state correctional facilities regarding complaints involving alleged on-duty staff misconduct, including but not limited to the:\n(i) total number of misconduct complaints and investigations;\n(ii) total number of complaints by each category of misconduct, as defined by the commissioner of corrections;\n(iii) number of allegations dismissed as unfounded;\n(iv) number of allegations dismissed on grounds that the allegation was unsubstantiated; and\n(v) number of allegations substantiated, any resulting disciplinary action, and the nature of the discipline.\n(a) Beginning in 2022, the commissioner shall have the department's inspection unit conduct biennial security audits of each state correctional facility using the standards promulgated by the state correctional facilities security audit group. The unit must prepare a report for each assessment and audit and submit the report to the state correctional facilities security audit group within 30 days of completion of the audit.\n(b) Corrections and detention confidential data, as defined in section 13.85, subdivision 3, and nonpublic security information, as defined in section 13.37, subdivision 1, that is contained in reports and records of the group maintain that classification, regardless of the data's classification in the hands of the person who provided the data, and are not subject to discovery or introduction into evidence in a civil or criminal action against the state arising out of the matters the group is reviewing. Information, documents, and records otherwise available from other sources are not immune from discovery or use in a civil or criminal action solely because they were acquired during the group's audit. This section does not limit a person who presented information to the group or who is a member of the group from testifying about matters within the person's knowledge. However, in a civil or criminal proceeding, a person may not be questioned about the person's good faith presentation of information to the group or opinions formed by the person as a result of the group's audits.\n(a) Beginning in fiscal year 2022, the commissioner shall form a state correctional facilities security audit group. The group must consist of the following members:\n(1) a Department of Corrections employee who is not assigned to the correctional institutions division, appointed by the commissioner;\n(2) the ombudsperson for corrections or a designee;\n(3) an elected sheriff or designee nominated by the Minnesota Sheriffs' Association and appointed by the commissioner;\n(4) an individual with expertise in security related to infrastructure and operational logistics of correctional facilities who is not required to reside in Minnesota, appointed by the governor;\n(5) the commissioner of health or a designee;\n(6) the commissioner of administration or a designee;\n(7) two senators, one appointed by the senate majority leader and one appointed by the minority leader; and\n(8) two representatives, one appointed by the speaker of the house and one appointed by the minority leader of the house of representatives.\n(b) The ombudsperson or a designee shall chair the group. The group shall establish security audit standards for state correctional facilities. In developing the standards, the group, or individual members of the group, may gather information from state correctional facilities and state correctional staff and inmates. The security audit group must periodically review the standards and modify them as needed. The group must report the standards to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over public safety policy and finance whenever the standards are updated.\n(c) The group shall meet twice a year to review facility audit reports submitted to the group by the agency's inspection unit. Notwithstanding any law to the contrary, the group is entitled to review the full audit reports including nonpublic security information and corrections and detention confidential data. Within 60 days of meeting to review audit reports from the department's inspection unit, the group must make recommendations to the commissioner. Within 45 days of receiving the group's recommendations, the commissioner must reply in writing to the group's findings and recommendations. The commissioner's response must explain whether the agency will implement the group's recommendations, the timeline for implementation of the changes, and, if not, why the commissioner will not or cannot implement the group's recommendations.\n(d) Beginning in 2023, the commissioner must include a written aggregate of the group's recommendations based on each security audit and assessment of a state correctional facility and the commissioner's responses to the recommendations in the biennial report required under section 241.016, subdivision 1. The commissioner shall not include corrections and detention confidential data, as defined in section 13.85, subdivision 3, and nonpublic security information, as defined in section 13.37, subdivision 1, in the commissioner's report to the legislature.\n(e) The commissioner shall provide staffing and administrative support to the group.\n(f) The state correctional facilities security audit group is not subject to chapter 13D.\n(g) Except as otherwise provided in this paragraph, the terms, compensation, and removal of members of the group are governed by section 15.059. Members of the group serve without compensation but shall receive expense reimbursement. Notwithstanding section 15.059, subdivision 6, the group does not expire.\nAs used in this section, \"correctional facility\" means any facility, including a group home, having a residential component, the primary purpose of which is to serve persons placed in facilities by a court, court services department, parole authority, or other correctional agency having dispositional power over persons charged with, convicted, or adjudicated guilty or delinquent.\nNotwithstanding any provisions in sections 256.01, subdivision 2, paragraph (a), clause (2), 245A.03, and 245A.04, and chapter 245C, to the contrary, but subject to the municipality notification requirements of subdivision 2a, the commissioner of corrections shall review all county, municipal or other publicly established and operated facilities for the detention, care and training of delinquent children and youth at least once every biennium, and if such facility conforms to reasonable standards established by the commissioner or in the commissioner's judgment is making satisfactory progress toward substantial conformity therewith, and the commissioner is satisfied that the interests and well-being of children and youth received therein are protected, the commissioner shall grant a license to the county, municipality or agency thereof operating such facility. The commissioner may grant licensure up to two years. Each such facility shall cooperate with the commissioner to make available all facts regarding its operation and services as the commissioner requires to determine its conformance to standards and its competence to give the services needed and which it purports to give. Every such facility as herein described is subject to visitation and supervision by the commissioner and shall receive from the commissioner consultation as needed to strengthen services to the children and youth received therein.\nThe commissioner must not grant a license without giving 30 calendar days' written notice to any affected municipality or other political subdivision unless the facility has a licensed capacity of six or fewer persons and is occupied by either the licensee or the group foster home parents. The notification must be given before the license is first granted and annually after that time if annual notification is requested in writing by any affected municipality or other political subdivision. State funds must not be made available to or be spent by an agency or department of state, county, or municipal government for payment to a foster care facility licensed under subdivision 2 until the provisions of this subdivision have been complied with in full.\nThe commissioner may not:\n(1) grant a license under this section to operate a correctional facility for the detention or confinement of juvenile offenders if the facility accepts juveniles who reside outside of Minnesota without an agreement with the entity placing the juvenile at the facility that obligates the entity to pay the educational expenses of the juvenile; or\n(2) renew a license under this section to operate a correctional facility for the detention or confinement of juvenile offenders if the facility accepts juveniles who reside outside of Minnesota without an agreement with the entity placing the juvenile at the facility that obligates the entity to pay the educational expenses of the juvenile.\nWhen after due notice and hearing the commissioner of corrections determines that any facility described in subdivision 2 does not substantially conform to the reasonable standards therein provided or is not making satisfactory progress toward substantial compliance therewith, the commissioner may, with the consent of the judge of the district court, issue an order revoking the license of that facility. After revocation of its license, that facility shall not be used for the care and training of delinquent children, or for their detention until its license is renewed.\nThe commissioner of corrections shall provide professional health care to persons confined in institutions under the control of the commissioner of corrections and pay the costs of their care in hospitals and other medical facilities not under the control of the commissioner of corrections. All reimbursements for these health care services shall be deposited in the general fund. The commissioner of corrections is authorized to contract with or reimburse entities, including health care management companies, to provide health care to inmates, at reimbursement rates equal to medical assistance unless otherwise negotiated. With respect to these contracts, these entities shall not be regulated as, or otherwise considered to be, health plan companies as defined in section 62Q.01, subdivision 4.\nAll residential substance use disorder treatment programs operated by the commissioner of corrections to treat adults committed to the commissioner's custody shall comply with the standards mandated in chapter 245G for treatment programs operated by community-based treatment facilities. When the commissioners of corrections and human services agree that these established standards for community-based programs cannot reasonably apply to correctional facilities, alternative equivalent standards shall be developed by the commissioners and established through an interagency agreement.\nThe commissioner of corrections shall establish a health care peer review committee. Sections 145.61 to 145.67 apply to the committee. The committee shall gather, review, and evaluate information relating to the on-site and off-site quality of care and treatment of offenders. The committee shall consist of:\n(1) the department medical director;\n(2) the regional medical director of the contracted health care vendor;\n(3) the department director of nursing or a designee;\n(4) a physician from the contracting hospital provider;\n(5) another physician who provides health care to offenders on site at a correctional facility;\n(6) one or more licensed physicians or nurse practitioners from the community, in person or by telephone, with expertise in the most appropriate clinical area;\n(7) the director of psychiatry of the contracted vendor;\n(8) the pharmacist liaison of the contracted vendor's pharmacy vendor;\n(9) the clinical pharmacist of the contracted vendor;\n(10) in cases of suicide or unanticipated death, a representative from the Office of Special Investigations; and\n(11) other ad hoc members as indicated at the discretion of the Department of Corrections medical director or chief medical officer.\nThe peer review committee under subdivision 4b does not expire.\nFeminine hygiene products, including at a minimum sanitary napkins and tampons, shall be provided at no cost to individuals housed in state correctional facilities used for the general confinement of female inmates. The commissioner of corrections shall develop a written policy to implement a process whereby a reasonable number of feminine hygiene products are available to female inmates.\nThe commissioner of corrections shall take reasonable steps to provide meaningful access to limited English proficient (LEP) individuals incarcerated, detained, or supervised by the Department of Corrections. The commissioner shall develop written policy and annual training to implement language access for LEP individuals.\n[Repealed, 2007 c 54 art 6 s 20]\n(a) The commissioner of corrections is authorized to do background studies on personnel employed by any facility serving children or youth that is licensed under this section. The commissioner of corrections shall contract with the commissioner of human services to conduct background studies of individuals providing services in secure and nonsecure residential facilities and detention facilities who have direct contact, as defined under section 245C.02, subdivision 11, with persons served in the facilities. A disqualification of an individual in this section shall disqualify the individual as provided in chapter 245C.\n(b) A clerk or administrator of any court, the Bureau of Criminal Apprehension, a prosecuting attorney, a county sheriff, or a chief of a local police department, shall assist in these studies by providing to the commissioner of human services, or the commissioner's representative, all criminal conviction data available from local, state, and national criminal history record repositories, including the criminal justice data communications network, pertaining to the following individuals: applicants, operators, all persons living in the household, and all staff of any facility subject to background studies under this subdivision.\n(c) The Department of Human Services shall conduct the background studies required by paragraph (a) in compliance with the provisions of chapter 245C. For the purpose of this subdivision, the term \"secure and nonsecure residential facility and detention facility\" shall include programs licensed or certified under subdivision 2. The Department of Human Services shall provide necessary forms and instructions, shall conduct the necessary background studies of individuals, and shall provide notification of the results of the studies to the facilities, individuals, and the commissioner of corrections. Individuals shall be disqualified under the provisions of chapter 245C.\nIf an individual is disqualified, the Department of Human Services shall notify the facility and the individual and shall inform the individual of the right to request a reconsideration of the disqualification by submitting the request to the Department of Corrections.\n(d) The commissioner of corrections shall review and decide reconsideration requests, including the granting of variances, in accordance with the procedures and criteria contained in chapter 245C. The commissioner's decision shall be provided to the individual and to the Department of Human Services. The commissioner's decision to grant or deny a reconsideration of disqualification is the final administrative agency action.\n(e) Facilities described in paragraph (a) shall be responsible for cooperating with the departments in implementing the provisions of this subdivision. The responsibilities imposed on applicants and licensees under chapters 245A and 245C shall apply to these facilities.\nAll correctional facilities that confine or incarcerate adults are required at intake to provide each person an authorization form to release information related to that person's health or mental health condition and when that information should be shared. This release form shall allow the individual to select if the individual wants to require the correctional facility to make attempts to contact the designated person to facilitate the sharing of health condition information upon incapacitation or if the individual becomes unable to communicate or direct the sharing of this information, so long as contact information was provided and the incapacitated individual or individual who is unable to communicate or direct the sharing of this information is not subject to a court order prohibiting contact with the designated person.\nIn the event a correctional facility receives information of the death of an individual while committed to the custody of the facility, regardless of whether the death occurred at the facility or after removal from the facility for medical care stemming from an incident or need for medical care at the correctional facility, the administrator of the facility, minimally including a medical expert of the facility's choosing who did not provide medical services to the individual, and, if appropriate, a mental health expert, shall review the circumstances of the death and assess for preventable mortality and morbidity, including recommendations for policy or procedure change, within 90 days of death. The investigating law enforcement agency may provide documentation, participate in, or provide documentation and participate in the review in instances where criminal charges were not brought. A preliminary autopsy report must be provided as part of the review and any subsequent autopsy findings as available. The facility administrator shall provide notice to the commissioner of corrections via the Department of Corrections detention information system that the correctional facility has conducted a review and identify any recommendations for changes in policy, procedure, or training that will be implemented. Any report or other documentation created for purposes of a facility death review is confidential as defined in section 13.02, subdivision 3. Nothing in this section relieves the facility administrator from complying with the notice of death to the commissioner as required by subdivision 1, paragraph (a).",
	"repealed": false
}