{
	"id": "272.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.38",
	"title": "272.38 STRUCTURES, STANDING TIMBER, OR MINERALS NOT TO BE REMOVED.",
	"text": "(a) No structures, standing timber, minerals, sand, gravel, peat, subsoil, or topsoil shall be removed from any tract of land until all the taxes assessed against such tract and due and payable shall have been fully paid and discharged. When the commissioner of management and budget or the county auditor has reason to believe that any such structure, timber, minerals, sand, gravel, peat, subsoil, or topsoil will be removed from such tract before such taxes shall have been paid, either may direct the county attorney to bring suit in the name of the state to enjoin any and all persons from removing such structure, timber, minerals, sand, gravel, peat, subsoil, or topsoil therefrom until such taxes are paid. No bond shall be required of plaintiff in such suit.\n(b) If the county auditor determines that the removal of a structure is in the public interest, including the health, safety, and well-being of the surrounding area, and that removal will not impair the collection of property taxes, the county auditor may waive the requirements of this subdivision.\nThe county auditor may enter into an agreement with the taxpayer for the removal of any structures, standing timber, minerals, sand, gravel, peat, subsoil, or topsoil from the property of the taxpayer upon which taxes are due and payable, which agreement shall provide that the entire sale price thereof, or the reasonable market value thereof, whichever is the greater, or if the property is not sold, then the fair market value thereof is to be paid to the county treasurer to be applied upon the taxes on the property, penalties, costs, and interests, in the inverse order to that in which such taxes were levied, to be applied as follows: (1) upon the penalties, costs and interest, (2) upon the taxes levied; and the same procedure shall be followed for each year's taxes until the entire sum so paid shall have been applied; provided, that if the judgment for any such delinquent taxes shall have been partially paid, it shall not affect the right of the state to forfeit the title to such lands in the event of the failure to redeem the same. The contract between the county auditor and the taxpayer shall provide that the contract shall be fully completed prior to the time that the title to the property would otherwise forfeit to the state. The county auditor may, on finding it necessary to protect the state, demand that the taxpayer make, execute, and deliver a bond to the state in such an amount as may be necessary in the opinion of the county auditor to protect the state, to insure the payment to the county treasurer of the purchase price or the reasonable market value of the property removed from the land under the agreements. Nothing herein shall be construed as prohibiting the removal of such sand, gravel, peat, subsoil, or topsoil as may be incidental to the erection of structures on the land or the grading of the land when such removal or grading shall result in enhancing the value thereof; nor shall anything herein be construed as prohibiting the removal of the overburden on mine properties. The removal of any structures, standing timber, minerals, sand, gravel, peat, subsoil, or topsoil under such agreements with the county auditor shall not be construed to be in violation of this section.",
	"repealed": false
}