{
	"id": "142C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/142C.08",
	"title": "142C.08 STAFFING REQUIREMENTS.",
	"text": "(a) Except as provided in paragraph (b), during hours of operation, a certified center must have a director on site who is responsible for overseeing implementation of written policies relating to the management and control of the daily activities of the program, ensuring the health and safety of program participants, and supervising staff and volunteers.\n(b) When the director is absent, a certified center must designate a staff person who is at least 18 years old to fulfill the director's responsibilities under this subdivision to ensure continuity of program oversight. The designee does not have to meet the director qualifications in subdivision 2 but must be aware of their designation and responsibilities under this subdivision.\nThe director must be 18 years of age or older and have completed at least 16 hours of training in any of the following topic areas: child development and learning; developmentally appropriate learning experiences; relationships with families; assessment, evaluation, and individualization; historical and contemporary development of early childhood education; professionalism; and health, safety, and nutrition.\nA staff person must be 16 years of age or older before providing direct, unsupervised care to a child.\n(a) For an infant, the maximum group size is eight children.\n(b) For a toddler, the maximum group size is 14 children.\n(c) For a preschooler, the maximum group size is 20 children.\n(d) For a school-age child, the maximum group size is 30 children.\n(e) The maximum group size applies at all times except during group activity coordination time not exceeding 15 minutes, during a meal, outdoor activity, field trip, nap and rest, and special activity including a film, guest speaker, indoor large muscle activity, or holiday program.\n(a) The minimally acceptable staff-to-child ratios are:\n(b) For mixed-age groups, the ratio for the age group of the youngest child applies.",
	"repealed": false
}