{
	"id": "93.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.22",
	"title": "93.22 DISPOSITION OF PAYMENTS.",
	"text": "(a) All payments under sections 93.14 to 93.285 shall be made to the Department of Natural Resources and shall be credited according to this section.\n(b) Twenty percent of all payments under sections 93.14 to 93.285 shall be credited to the minerals management account in the natural resources fund as costs for the administration and management of state mineral resources by the commissioner of natural resources.\n(c) The remainder of the payments shall be credited as follows:\n(1) if the lands or minerals and mineral rights covered by a lease are held by the state by virtue of an act of Congress, payments made under the lease shall be credited to the permanent fund of the class of land to which the leased premises belong;\n(2) if a lease covers the bed of navigable waters, payments made under the lease shall be credited to the permanent school fund of the state;\n(3) if the lands or minerals and mineral rights covered by a lease are held by the state in trust for the taxing districts, payments made under the lease shall be distributed annually on the first day of September to the respective counties in which the lands lie, to be apportioned among the taxing districts interested therein as follows: county, three-ninths; town or city, two-ninths; and school district, four-ninths;\n(4) if the lands or mineral rights covered by a lease became the absolute property of the state under the provisions of chapter 84A, payments made under the lease shall be distributed as follows: county containing the land from which the income was derived, five-eighths; and general fund of the state, three-eighths; and\n(5) except as provided under this section and except where the disposition of payments may be otherwise directed by law, payments made under a lease shall be paid into the general fund of the state.\n[Repealed, 1Sp2003 c 9 art 5 s 37]",
	"repealed": false
}