{
	"id": "3.979",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.979",
	"title": "3.979 DATA CLASSIFICATION AND DISCLOSURE.",
	"text": "The legislative auditor is subject to the Government Data Practices Act, chapter 13, and shall protect from unlawful disclosure data classified as not public. If data provided by the legislative auditor to the commission is disseminated by the commission or its members or agents in violation of section 13.05, subdivision 4, the commission is subject to liability under section 13.08, subdivisions 1 and 3.\nMembers of the commission have access to not public data that is collected or used by the legislative auditor only as authorized by resolution of the commission. The commission may not authorize its members to have access to private or confidential data on individuals collected or used in connection with the collection of any tax.\n(a) \"Audit\" as used in this subdivision means a financial audit, program evaluation, special review, investigation, or assessment of an allegation or report submitted to the legislative auditor.\n(b) Notwithstanding any other law, data relating to an audit are confidential or protected nonpublic until the final report of the audit has been released by the legislative auditor or the audit is no longer being actively pursued. Upon release of a final audit report by the legislative auditor, data relating to an audit are public except data otherwise classified as not public.\n(c) Unless the data are subject to a more restrictive classification by another law, upon the legislative auditor's decision to no longer actively pursue an audit without the release of a final audit report, data relating to an audit are private or nonpublic except for data: (1) relating to the audit's existence, status, and disposition; and (2) that document the work of the legislative auditor. For any such audit, data identifying individuals or nongovernmental entities are private or nonpublic.\n(d) Data related to an audit but not published in the audit report and that the legislative auditor reasonably believes will be used in litigation are confidential or protected nonpublic until the litigation has been completed or is no longer being actively pursued.\n(e) Data that could reasonably be used to determine the identity of an individual or entity supplying data for an audit are private or nonpublic if the data supplied were needed for an audit and would not have been provided to the legislative auditor without an assurance that the identity of the individual or entity would remain private or nonpublic, or the legislative auditor reasonably believes that the data would not have been provided.\n(f) Data related to an audit that were obtained from a nongovernmental entity have the classification that the data would have if obtained from the governmental entity for which the data were created, collected, or maintained by the nongovernmental entity.\n(g) The legislative auditor may disseminate data of any classification to:\n(1) a governmental entity, other than a law enforcement agency or prosecuting authority, if the dissemination of the data aids a pending audit; or\n(2) a law enforcement agency or prosecuting authority if there is reason to believe that the data are evidence of criminal activity within the agency's or authority's jurisdiction.\n(h) Notwithstanding the classification of data as confidential or protected nonpublic, an individual or entity who supplies information for an audit may authorize the legislative auditor to release data that would identify the individual or entity for the purpose of conducting the audit. Data disseminated pursuant to this paragraph are subject to section 13.03, subdivision 4, paragraph (c).\nIf, before releasing a report, the legislative auditor provides a person with data relating to the audit for the purpose of review and verification of the data, the person must protect the data from unlawful disclosure or be subject to the penalties and liabilities provided in sections 13.08 and 13.09.\n[Repealed, 2006 c 262 s 2]\nThe definitions of terms provided in section 13.02 apply for purposes of this section.",
	"repealed": false
}