{
	"id": "201.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.061",
	"title": "201.061 REGISTRATION ON OR BEFORE ELECTION DAY.",
	"text": "(a) At any time except during the 20 days immediately preceding any regularly scheduled election, an eligible voter or any individual who will be an eligible voter at the time of the next election may register to vote in the precinct in which the voter maintains residence by completing a voter registration application as described in section 201.071, subdivision 1. A completed application may be submitted:\n(1) in person or by mail to the county auditor of that county or to the Secretary of State's Office; or\n(2) electronically through a secure website that shall be maintained by the secretary of state for this purpose, if the applicant has an email address and provides the applicant's verifiable Minnesota driver's license number, Minnesota state identification card number, or the last four digits of the applicant's Social Security number.\n(b) A registration that is received in person or by mail no later than 5:00 p.m. on the 21st day preceding any election, or a registration received electronically through the secretary of state's secure website no later than 11:59 p.m. on the 21st day preceding any election, shall be accepted. An improperly addressed or delivered registration application shall be forwarded within two working days after receipt to the county auditor of the county where the voter maintains residence. A state or local agency or an individual that accepts completed voter registration applications from a voter must submit the completed applications to the secretary of state or the appropriate county auditor within ten calendar days after the applications are dated by the voter.\n(c) An application submitted electronically under paragraph (a), clause (2), may only be transmitted to the county auditor for processing if the secretary of state has verified the application information matches the information in a government database associated with the applicant's driver's license number, state identification card number, or Social Security number. The secretary of state must review all unverifiable voter registration applications submitted electronically for evidence of suspicious activity and must forward any such application to an appropriate law enforcement agency for investigation.\n(d) An individual may not electronically submit a voter registration application on behalf of any other individual, except that the secretary of state may provide features on the secure website established under paragraph (a), clause (2), that allow third parties to connect application programming interfaces that facilitate an individual's submission of voter registration information while interacting with the third party.\n(e) For purposes of this section, mail registration is defined as a voter registration application delivered to the secretary of state, county auditor, or municipal clerk by the United States Postal Service or a commercial carrier.\nIf the county auditor determines that a voter who has submitted a voter registration application by mail has not previously voted in this state for a federal office and has also not presented a document authorized for election day registration in section 201.061, subdivision 3, to the auditor, and the county auditor is unable to verify the voter's driver's license, state identification, or last four digits of the voter's Social Security number as provided by the voter on the voter registration application, then the county auditor must notify the voter that the registration is incomplete and to complete registration by using one of the following methods:\n(1) presenting to the auditor more than 20 days before the election a document authorized for election day registration in section 201.061, subdivision 3;\n(2) registering in person before or on election day;\n(3) if voting by absentee ballot or by mail, following election day registration procedures for absentee voters as described in section 203B.04, subdivision 4; or\n(4) providing proof of residence by any of the methods authorized for election day registration in section 201.061, subdivision 3.\nAn individual who is under the age of 18, but who is at least 16 years of age and meets all requirements for eligibility in section 201.014, except for age, may submit a voter registration application or be automatically registered under section 201.161 at the address in which the voter maintains residence pursuant to subdivision 1. Nothing in this section shall be construed to entitle an individual to appear on a polling place roster or cast a ballot at an election if the individual does not meet all eligibility requirements for voting, including age.\n[Repealed, 1990 c 585 s 34]\n(a) An individual who is eligible to vote may register on election day by appearing in person at the polling place for the precinct in which the individual maintains residence, by completing a registration application, making an oath in the form prescribed by the secretary of state and providing proof of residence. An individual may prove residence for purposes of registering by:\n(1) presenting a driver's license or Minnesota identification card issued pursuant to section 171.07;\n(2) presenting any document approved by the secretary of state as proper identification;\n(3) presenting a current student fee statement that contains the student's valid address in the precinct together with a picture identification card; or\n(4) having a voter who is registered to vote in the precinct, or an employee employed by and working in a residential facility in the precinct and vouching for a resident in the facility, sign an oath in the presence of the election judge vouching that the voter or employee personally knows that the individual is a resident of the precinct. A voter who has been vouched for on election day may not sign a proof of residence oath vouching for any other individual on that election day. A voter who is registered to vote in the precinct may sign up to eight proof-of-residence oaths on any election day. This limitation does not apply to an employee of a residential facility described in this clause. The secretary of state shall provide a form for election judges to use in recording the number of individuals for whom a voter signs proof-of-residence oaths on election day. The form must include space for the maximum number of individuals for whom a voter may sign proof-of-residence oaths. For each proof-of-residence oath, the form must include a statement that the individual: (i) is registered to vote in the precinct or is an employee of a residential facility in the precinct, (ii) personally knows that the voter is a resident of the precinct, and (iii) is making the statement on oath. The form must include a space for the voter's printed name, signature, telephone number, and address.\nThe oath required by this subdivision and Minnesota Rules, part 8200.9939, must be attached to the voter registration application.\n(b) The operator of a residential facility shall prepare a list of the names of its employees currently working in the residential facility and the address of the residential facility. The operator shall certify the list and provide it to the appropriate county auditor no less than 20 days before each election for use in election day registration.\n(c) \"Residential facility\" means transitional housing as defined in section 256K.48, subdivision 1; a supervised living facility licensed by the commissioner of health under section 144.50, subdivision 6; a nursing home as defined in section 144A.01, subdivision 5; an assisted living facility licensed by the commissioner of health under chapter 144G; a veterans home operated by the board of directors of the Minnesota Veterans Homes under chapter 198; a residence licensed by the commissioner of human services to provide a residential program as defined in section 245A.02, subdivision 14; a residential facility for persons with a developmental disability licensed by the commissioner of human services under section 252.28; setting authorized to provide housing support as defined in section 256I.03, subdivision 10a; a shelter for battered women as defined in section 611A.37, subdivision 4; a supervised publicly or privately operated shelter or dwelling designed to provide temporary living accommodations for the homeless; a facility where a provider operates a residential treatment program as defined in section 245.462, subdivision 23; or a facility where a provider operates an adult foster care program as defined in section 245A.02, subdivision 6c.\n(d) For tribal band members, an individual may prove residence for purposes of registering by:\n(1) presenting an identification card issued by the tribal government of a tribe recognized by the Bureau of Indian Affairs, United States Department of the Interior, that contains the name, address, signature, and picture of the individual; or\n(2) presenting an identification card issued by the tribal government of a tribe recognized by the Bureau of Indian Affairs, United States Department of the Interior, that contains the name, signature, and picture of the individual and also presenting one of the documents listed in Minnesota Rules, part 8200.5100, subpart 2, item B.\n(e) A county, school district, or municipality may require that an election judge responsible for election day registration initial each completed registration application.\n(a) If an eligible voter's name; student identification number, if available; and address within the precinct appear on a current residential housing list under section 135A.17 certified to the county auditor by the postsecondary educational institution, the voter may prove residence by presenting a current valid photo identification issued by a postsecondary educational institution in Minnesota; identification authorized in subdivision 3, paragraph (a), clause (1) or (2); or identification authorized in subdivision 3, paragraph (d), clause (1) or (2).\n(b) This additional proof of residence for students must not be allowed unless the postsecondary educational institution submits to the county auditor no later than 60 days prior to the election a written agreement that the postsecondary educational institution will certify for use at the election accurate updated residential housing lists under section 135A.17. A written agreement is effective for the election and all subsequent elections held in that calendar year, including the November general election.\n(c) The additional proof of residence for students must be allowed on an equal basis for voters who reside in housing meeting the requirements of section 135A.17, if the residential housing lists certified by the postsecondary educational institution meet the requirements of this subdivision.\n(d) An updated residential housing list must be certified to the county auditor no later than 20 days prior to each election. The certification must be dated and signed by the chief officer or designee of the postsecondary educational institution and must state that the list is current and accurate and includes only the names of persons residing in the institution's housing and, for students who do not live in the institution's housing, that it reflects the institution's records as of the date of the certification.\n(e) The county auditor shall instruct the election judges of the precinct in procedures for use of the list in conjunction with photo identification. The auditor shall supply a list to the election judges with the election supplies for the precinct.\n(f) The county auditor shall notify all postsecondary educational institutions in the county of the provisions of this subdivision.\nRegistration at the polling place on election day shall be conducted by the election judges. Before registering an individual to vote at the polling place, the election judge must review any list of absentee election day registrants provided by the county auditor or municipal clerk to see if the person has already voted by absentee ballot. If the person's name appears on the list, the election judge must not allow the individual to register or to vote in the polling place. The election judge who registers an individual at the polling place on election day shall not handle that voter's ballots at any time prior to the opening of the ballot box after the voting ends. Registration applications and forms for oaths shall be available at each polling place. If an individual who registers on election day proves residence by oath of a registered voter, the form containing the oath shall be attached to the individual's registration application. Registration applications completed on election day shall be forwarded to the county auditor who shall add the name of each voter to the registration system unless the information forwarded is substantially deficient. A county auditor who finds an election day registration substantially deficient shall give written notice to the individual whose registration is found deficient. An election day registration shall not be found deficient solely because the individual who provided proof of residence was ineligible to do so.\nNo election judge in any precinct in which registration is required may receive the vote at any election of any individual whose name is not registered in a manner specified in section 201.054, subdivision 1 or not recorded under section 203B.19. A violation of this subdivision is a felony.\nExcept as otherwise provided by this subdivision, the county auditor shall provide each precinct with an accurate precinct map or precinct finder to assist the election judges in determining whether an address is located in that precinct. A county auditor may delegate this responsibility as provided in section 201.221, subdivision 4, to a municipal or school district clerk who prepares precinct maps as provided in section 204B.14, subdivision 5.\nThe election judge responsible for election day registration shall attempt to keep a record of the number of individuals who attempt to register on election day but who cannot provide proof of residence as required by this section. The record shall be forwarded to the county auditor with the election returns for that precinct.\n(a) The secretary of state shall maintain a log of each Internet Protocol address used to submit a voter registration application electronically under subdivision 1, paragraph (a), clause (2), and must monitor the log, volume of website use, and other appropriate indicators for suspicious activity. Evidence of suspicious activity that cannot be resolved by the secretary of state must be forwarded to an appropriate law enforcement agency for investigation.\n(b) The electronic registration system must be secure. The website shall maintain the confidentiality of all users and preserve the integrity of the data submitted. The secretary of state shall employ security measures to ensure the accuracy and integrity of voter registration applications submitted electronically pursuant to this section. All data sent and received through the website must be encrypted.\n(c) The secretary of state must provide ongoing testing and monitoring to ensure continued security. The secretary of state must work with the chief information officer as defined in section 16E.01, subdivision 1, or another security expert to annually assess the security of the system. The security assessment must include a certification signed by the secretary of state that states that adequate security measures are in place. The certification must also be signed by the chief information officer or another security expert affirming that the assessment is accurate. The secretary of state must submit the security assessment to the legislative auditor and to the chairs and ranking minority members of the committees in the senate and house of representatives with primary jurisdiction over elections by January 1 of each year, except that the first annual security assessment must be submitted by September 30, 2014, and no report is required for January 1, 2015.\n(d) In developing the electronic voter registration system, the secretary of state must consult with the chief information officer or the chief's designee to ensure the site is secure.",
	"repealed": false
}