{
	"id": "332.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.54",
	"title": "332.54 REGISTRATION.",
	"text": "It is unlawful for any credit services organization to offer, advertise, or execute or cause to be executed by a consumer any contract in this state unless the credit services organization at the time of the offer, advertisement, sale, or execution of a contract has been properly registered with the commissioner.\nThe registration must contain the following information:\n(1) the name and address of the credit services organization;\n(2) the name and address of the registered agent authorized to accept service of process on behalf of the credit services organization;\n(3) the name and address of any person who directly or indirectly owns or controls a ten percent or greater interest in the credit services organization;\n(4) the name and address of the surety company that issued the bond required under section 332.55; and\n(5) full disclosure of any litigation or unresolved complaint filed within the preceding five years with the state, any other state, or the United States relating to the operation of the credit services organization, or a notarized statement that there has been no litigation or unresolved complaint filed within the preceding five years with the state, any other state, or the United States relating to the operation of the credit services organization.\nThe credit services organization must attach to the registration statement a copy of the contract which the credit services organization intends to execute with its consumers and evidence of the required bond.\nThe credit services organization must update the registration statement required under this section not later than 30 days after the date from which a change in the information required in the statement occurs.\nEach credit services organization registering under this section must maintain a copy of the registration statement in its files. The credit services organization must allow a buyer to inspect the registration statement on request.\nRegistration issued or renewed by the commissioner of commerce under sections 332.52 to 332.60 expires on June 30 of each year.\nThe fee for a credit services organization's registration is $1,000 for issuance or renewal for each location of business.\nSection 58A.04, subdivisions 2 and 3, apply to this section.",
	"repealed": false
}