{
	"id": "18.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.78",
	"title": "18.78 NOXIOUS WEEDS CONTROL AND MANAGEMENT.",
	"text": "A person owning land, a person occupying land, or a person responsible for the maintenance of public land must manage all noxious weeds, according to the noxious weed categories under section 18.771, on the land at a time and in a manner ordered by an inspector or county-designated employee.\nAn owner of nonfederal lands underlying public waters or wetlands designated under section 103G.201 is not required to control or eradicate purple loosestrife or nonnative Phragmites below the ordinary high water level of the public water or wetland. The commissioner of natural resources is responsible for control and eradication of purple loosestrife and nonnative Phragmites on public waters and wetlands designated under section 103G.201, except those located upon lands owned in fee title or managed by the United States. The officers, employees, agents, and contractors of the commissioner of natural resources may enter upon public waters and wetlands designated under section 103G.201 and, after providing notification to the occupant or owner of the land, may cross adjacent lands as necessary for the purpose of investigating purple loosestrife or nonnative Phragmites infestations, formulating methods of eradication, and implementing control and eradication of purple loosestrife or nonnative Phragmites. The commissioner of natural resources shall, by June 1 of each year, compile a priority list of purple loosestrife and nonnative Phragmites infestations to be controlled with herbicides in designated public waters. The commissioner of natural resources must distribute the list to county agricultural inspectors, local weed inspectors, and their appointed agents. The commissioner of natural resources shall control listed purple loosestrife and nonnative Phragmites infestations in priority order within the limits of funding allocated for that purpose. This procedure shall supersede the other provisions for control of noxious weeds set forth elsewhere in this chapter. The responsibility of the commissioner of natural resources to control and eradicate purple loosestrife and nonnative Phragmites on public waters and wetlands located on private lands and the authority to enter upon private lands ends ten days after receipt by the commissioner of a written statement from the landowner that the landowner assumes all responsibility for control and eradication of purple loosestrife and nonnative Phragmites under sections 18.78 to 18.88. State officers, employees, agents, and contractors of the commissioner of natural resources are not liable in a civil action for trespass committed in the discharge of their duties under this section and are not liable to anyone for damages, except for damages arising from gross negligence.\nThe commissioner, municipality, or county agricultural inspector or county-designated employee may enter into an agreement with a landowner or noxious weed management site group to establish a mutually agreed-upon noxious weed management plan for up to three years duration, whereby a noxious weed problem will be controlled without additional enforcement action. If a property owner fails to comply with the noxious weed management plan, an individual notice may be served.",
	"repealed": false
}