{
	"id": "97C.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.081",
	"title": "97C.081 FISHING CONTESTS.",
	"text": "A person may not conduct a fishing contest on waters except as provided in this section.\n[Repealed, 1Sp2011 c 2 art 5 s 70]\n(a) Unless subdivision 3a applies, a person must have a permit from the commissioner to conduct a fishing contest if:\n(1) there are more than 25 boats for open-water contests, more than 150 participants for ice-fishing contests, or more than 100 participants for shore-fishing contests;\n(2) entry fees are more than $25 per person; or\n(3) the contest is limited to trout species.\n(b) The commissioner shall charge a fee for the permit that recovers the costs of issuing the permit and of monitoring the activities allowed by the permit. Notwithstanding section 16A.1283, the commissioner may, by written order published in the State Register, establish contest permit fees. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(c) The commissioner may require the applicant to furnish evidence of financial responsibility in the form of a surety bond or bank letter of credit in the amount of $25,000 if entry fees are over $25 per person, or total prizes are valued at more than $25,000, and if the applicant has either:\n(1) not previously conducted a fishing contest requiring a permit under this subdivision; or\n(2) ever failed to make required prize awards in a fishing contest conducted by the applicant.\n(d) The permit fee for any individual contest may not exceed the following amounts:\n(1) $70 for an open-water contest not exceeding 50 boats and without off-site weigh-in;\n(2) $225 for an open-water contest with more than 50 boats and without off-site weigh-in;\n(3) $280 for an open-water contest not exceeding 50 boats with off-site weigh-in;\n(4) $560 for an open-water contest with more than 50 boats with off-site weigh-in;\n(5) $135 for an ice-fishing contest with more than 150 participants; or\n(6) $50 for a contest where all participants are age 18 years or under.\nA person may conduct a fishing contest without a permit from the commissioner if:\n(1) the contest is not limited to specifically named waters;\n(2) the contest is limited to common carp and participants are required to fish with a hook and line; or\n(3) the total prize value is $500 or less.\n(a) The commissioner may by rule establish restrictions on fishing contests to protect fish and fish habitat, to restrict activities during high use periods, to restrict activities that affect research or management work, to restrict the number of boats, and for the safety of contest participants. The commissioner may require mandatory decontamination of boats participating in fishing contests on infested waters.\n(b) By March 1, 2011, the commissioner shall develop a best practices certification program for fishing contest organizers to ensure the proper handling and release of fish.\n[Repealed, 2014 c 290 s 70]\n(a) Beginning August 1 each year, the commissioner shall accept permit applications for fishing contests to be held in the following year.\n(b) If the number of permit applications received by the commissioner from August 1 through the last Friday in September exceeds the limits specified in subdivisions 7 and 8, the commissioner shall notify the affected applicants that their requested locations and time period are subject to a drawing. After notification, the commissioner shall allow the affected applicants a minimum of seven days to change the location or time period requested on their applications, provided that the change is not to a location or time period for which applications are already at or above the limits specified in subdivisions 7 and 8.\n(c) After the applicants have been given at least seven days to change their applications, the commissioner shall conduct a drawing for all locations and time periods for which applications exceed limits. First preference in the drawings shall be given to applicants for established or traditional fishing contests, and second preference to applicants for contests that are not established as traditional fishing contests based on the number of times they have been unsuccessful in previous drawings. Except for applicants of established or traditional fishing contests, an applicant who is successful in a drawing loses all accumulated preference. \"Established or traditional fishing contest\" means a fishing contest that was issued permits in 1999 and 2000 or was issued permits four out of five years from 1996 to 2000 for the same lake and time period. Beginning with 2001, established or traditional fishing contests must continue to be conducted at least four out of five years for the same lake and time period to remain established or traditional.\n(d) The commissioner has until November 7 to approve or deny permit applications that are submitted by 4:30 p.m. on the last Friday in September. The commissioner may approve a permit application that is received after 4:30 p.m. on the last Friday in September if approving the application would not result in exceeding the limits in subdivisions 7 and 8.\n(e) The commissioner shall develop an online web-based fishing contest permit application process.\n(a) On all waters 55,000 acres or less, the commissioner may ensure that each of the state's waters has at least two weekends per month with no permitted fishing contests.\n(b) Unless otherwise authorized by the commissioner, permitted fishing contests that are conducted for more than one day may not include more than one weekend day from Memorial Day weekend through Labor Day weekend.\n(c) The commissioner may not approve permits for fishing contests on a weekend with a fishing season opener if the contest targets a species for which the season is opening.\n(a) The number of permitted fishing contests allowed each month on a water body shall not exceed the following limits:\n(1) Lakes:\nFor boundary water lakes, the limits on the number of permitted fishing contests shall be determined based on the Minnesota acreage.\n(2) Rivers:\n(b) Contest waters identified in the permit for Mississippi River pools are limited to no more than one lockage upstream and one lockage downstream from the pool where the contest access and weigh-in is located.\n(c) Contest waters for Lake St. Croix are bounded by the U.S. Highway 10 bridge at Prescott upstream to the Arcola Bar. Contest waters for the St. Croix River are bounded by the Arcola Bar upstream to the Wisconsin state line.\n(d) For all other rivers, no more than two contest permits, not to exceed four days combined, may be issued for any continuous segment of a river per month. Of the two contests permitted, only one shall be a large permitted fishing contest. Permits issued by the commissioner shall not exceed 60 continuous river miles.\nNotwithstanding the limits in subdivision 8, the commissioner may allow up to five additional permits each year for fishing contests on bodies of water that are 5,000 acres or more in size. No more than one additional contest may be permitted on one body of water in a single year. For additional fishing contests permitted under this subdivision, the fishing contest permit applicant must demonstrate to the commissioner that the contest will:\n(1) provide economic benefits to the local area;\n(2) promote public awareness of fishing and the state's resources; and\n(3) conform to best management practices for the lake.\n(a) The commissioner may require fishing contest permittees to limit prefishing to week days only as a condition of a fishing contest permit. The commissioner may require proof from permittees that prefishing restrictions on the permit are communicated to fishing contest participants and enforced.\n(b) The commissioner may require permit restrictions on the hours that a permitted fishing contest is conducted, including, but not limited to, starting and ending times.\n(c) The commissioner may require permit restrictions on the number of parking spaces that may be used on a state-owned public water-access site. The commissioner may require proof from permittees that parking restrictions on the permit are communicated to fishing contest participants and enforced.\n(d) To prevent undue mortality of released fish, the commissioner may require restrictions for off-site weigh-ins and live releases on a fishing contest permit or may deny permits requesting an off-site weigh-in or live release. The commissioner may allow for live release weigh-ins at public accesses.\n(e) A person may not transfer a fishing contest permit to another person.\n(f) Failure to comply with fishing contest permit restrictions may be considered grounds for denial of future permit applications.\nFor purposes of this section, the following terms have the meanings given:\n(1) \"Permitted fishing contest\" means an open water fishing contest or ice fishing contest that requires a permit from the commissioner under subdivision 3.\n(2) \"Large permitted fishing contest\" means an open water fishing contest with more than 50 boats or more than 100 participants that requires a permit from the commissioner under subdivision 3.\n(3) \"Participant\" means a person who is taking part in a fishing contest.\n(4) \"Permitted fishing contest day\" means a day on a water body where a permitted fishing contest is held. Two permitted fishing contests that are held on the same water body on the same day count as two permitted fishing contest days.\n(5) \"Off-site weigh-in\" means a weigh-in of fish from a fishing contest at a location that is not adjacent to the waters listed on the fishing contest permit.\n(6) \"Prefishing\" means fishing by participants of a permitted fishing contest prior to the scheduled dates of the contest on waters listed on the fishing contest permit.",
	"repealed": false
}