{
	"id": "260A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/260A.06",
	"title": "260A.06 REFERRAL OF TRUANT STUDENTS TO SCHOOL ATTENDANCE REVIEW BOARD.",
	"text": "An attendance officer or other school official may refer a student who is a continuing truant to the school attendance review board. The person making the referral shall provide a written notice by first class mail or other reasonable means to the student and the student's parent or legal guardian. The notice must:\n(1) include the name and address of the board to which the student has been referred and the reason for the referral; and\n(2) indicate that the student, the parent or legal guardian, and the referring person will meet with the board to determine a proper disposition of the referral, unless the board refers the student directly to the county attorney or for other appropriate legal action.\n(a) Except as provided in paragraph (b), the school attendance review board shall schedule the meeting described in subdivision 1 and provide notice of the meeting by first class mail or other reasonable means to the student, parent or guardian, and referring person. If the board determines that available community services may resolve the attendance problems of the truant student, the board shall refer the student or the student's parent or guardian to participate in the community services. The board may develop an agreement with the student and parent or guardian that specifies the actions to be taken. The board shall inform the student and parent or guardian that failure to comply with any agreement or to participate in appropriate community services will result in a referral to the county attorney under subdivision 3. The board may require the student or parent or guardian to provide evidence of participation in available community services or compliance with any agreement.\n(b) A school attendance review board may refer a student directly to the county attorney or for other appropriate legal action under subdivision 3 if it has established procedures and criteria for these referrals.\nIf the school attendance review board determines that available community services cannot resolve the attendance problems of the truant student, if the student or the parent or guardian has failed to comply with any referrals or agreements under subdivision 2 or to otherwise cooperate with the board, or if the board determines that a student should be referred directly under this subdivision, the board may:\n(1) refer the matter to the county attorney under section 260A.07, if the county attorney has elected to participate in the truancy mediation program; or\n(2) if the county attorney has not elected to participate in the truancy mediation program, refer the matter for appropriate legal action against the child or the child's parent or guardian under chapter 260 or section 120A.34.",
	"repealed": false
}