{
	"id": "604.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.17",
	"title": "604.17 CIVIL LIABILITY FOR FRAUDULENT OR OTHERWISE IMPROPER FINANCING STATEMENTS.",
	"text": "For purposes of this section:\n(1) \"financing statement\" has the meaning given in section 336.9-102(a) of the Uniform Commercial Code; and\n(2) \"filing officer\" is defined as Uniform Commercial Code filing officer in each jurisdiction.\n(a) A person shall not knowingly cause to be presented for filing or promote the filing of a financing statement that the person knows:\n(1) is forged;\n(2) is not:\n(i) related to a valid lien or security agreement; or\n(ii) filed pursuant to section 336.9-502(d); and\n(3) is for an improper purpose or purposes, such as to harass, hinder, defraud, or otherwise interfere with any person.\n(b) A person who violates paragraph (a) is liable to each injured person for:\n(1) the greater of:\n(i) nominal damages up to $10,000; or\n(ii) the actual damages caused by the violation;\n(2) court costs;\n(3) reasonable attorney fees;\n(4) related expenses of bringing the action, including investigative expenses; and\n(5) exemplary damages in the amount determined by the court.\n(a) The following persons may bring an action to enjoin violation of this section or to recover damages under this section:\n(1) the obligor, the person named as the debtor, any person who owns an interest in the collateral described or indicated in the financing statement, or any person harmed by the filing of the financing statement;\n(2) the attorney general;\n(3) a county attorney;\n(4) a city attorney; and\n(5) a person who has been damaged as a result of an action taken in reliance on the filed financing statement.\n(b) A filing officer may refer a matter to the attorney general or other appropriate person for filing the legal actions under this section.\nAn action under this section may be brought in any district court in the county in which the financing statement is presented for filing or in a county where any of the persons named in subdivision 3, paragraph (a), clause (1), resides.\n(a) The fee for filing an action under this chapter is $....... The plaintiff must pay the fee to the clerk of the court in which the action is filed. Except as provided by paragraph (b), the plaintiff may not be assessed any other fee, cost, charge, or expense by the clerk of the court or other public official in connection with the action.\n(b) The fee for service of notice of an action under this section charged to the plaintiff may not exceed:\n(1) $....... if the notice is delivered in person; or\n(2) the cost of postage if the service is by registered or certified mail.\n(c) A plaintiff who is unable to pay the filing fee and fee for service of notice may file with the court an affidavit of inability to pay under the Minnesota Rules of Civil Procedure.\n(d) If the fee imposed under paragraph (a) is less than the filing fee the court imposes for filing other similar actions and the plaintiff prevails in the action, the court may order a defendant to pay to the court the differences between the fee paid under paragraph (a) and the filing fee the court imposes for filing other similar actions.\n(a) An obligor, person named as a debtor, owner of collateral, or any other person harmed by the filing of a financing statement in violation of subdivision 2, paragraph (a), also may request specific relief, including, but not limited to, terminating the financing statement and removing the debtor named in the financing statement from the index under the provisions of section 545.05, paragraph (c), such that it will not appear in a search under that debtor name.\n(b) This law is cumulative of other law under which a person may obtain judicial relief with respect to any filed or recorded document.",
	"repealed": false
}