{
	"id": "125A.027",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.027",
	"title": "125A.027 LOCAL AGENCY COORDINATION RESPONSIBILITIES.",
	"text": "(a) It is the joint responsibility of school and county boards to coordinate, provide, and pay for appropriate services and to facilitate payment for services from public and private sources. Appropriate services for children eligible under section 125A.02 and receiving services from two or more public agencies, of which one is the public school, must be determined in consultation with parents, physicians, and other education, medical health, and human services providers. The services provided must conform with a standardized written plan for each eligible child ages three to 21.\n(b) Appropriate services include those services listed on a child's standardized written plan. These services are those that are required to be documented on a plan under federal and state law or rule.\n(c) School and county boards shall coordinate interagency services. Service responsibilities for eligible children, ages three to 21, may be established in interagency agreements or joint powers board agreements. In addition, interagency agreements or joint powers board agreements may be developed to establish agency responsibility that ensures that coordinated interagency services are coordinated, provided, and paid for and that payment is facilitated from public and private sources. School boards must provide, pay for, and facilitate payment for special education services as required under sections 125A.03 and 125A.06. County boards must provide, pay for, and facilitate payment for those programs over which they have service and fiscal responsibility as referenced in section 125A.023, subdivision 3, paragraph (c), clause (1).\nThe school boards and county boards are responsible for developing and implementing interagency policies and procedures to coordinate services at the local level for children with disabilities ages three to 21 under guidelines established by the state interagency committee under section 125A.023, subdivision 4. Consistent with the requirements in this section and section 125A.023, the school boards and county boards may organize as a joint powers board under section 471.59 or enter into an interagency agreement that establishes a governance structure.\n(a) Parents, physicians, other health care professionals including school nurses, and education and human services providers jointly must determine appropriate and necessary services for eligible children with disabilities ages three to 21. The services provided to the child under this section must conform with the child's standardized written plan. The school board or county board must provide those services contained in a child's individualized education program and those services for which a legal obligation exists. Nothing in this section creates an additional right of appeal beyond the rights granted under sections 125A.091, 125A.25, and 256.045.\n(b) Nothing in this section or section 125A.023 increases or decreases the obligation of the state, county, regional agency, local school district, or local agency or organization to pay for education, health care, or social services.\n(c) A health plan may not exclude any medically necessary covered service solely because the service is or could be identified in a child's individual family service plan, individualized education program, a plan established under section 504 of the federal Rehabilitation Act of 1973, or a student's individual health plan. This paragraph reaffirms the obligation of a health plan company to provide or pay for certain medically necessary covered services, and encourages a health plan company to coordinate this care with any other providers of similar services. Also, a health plan company may not exclude from a health plan any medically necessary covered service such as an assessment or physical examination solely because the resulting information may be used for an individualized education program or a standardized written plan.\n[Repealed, 2014 c 272 art 4 s 14]\n[Repealed by amendment, 1Sp2015 c 3 art 5 s 11]",
	"repealed": false
}