{
	"id": "3.8844",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.8844",
	"title": "3.8844 LEGISLATIVE COMMISSION ON DATA PRACTICES.",
	"text": "The Legislative Commission on Data Practices and Personal Data Privacy is created to study issues relating to government data practices and individuals' personal data privacy rights and to review legislation impacting data practices, data security, and personal data privacy. The commission is a continuation of the commission that was established by Laws 2014, chapter 193, as amended, and which expired June 30, 2019.\nThe commission consists of two senators appointed by the senate majority leader, two senators appointed by the minority leader in the senate, two members of the house of representatives appointed by the speaker, and two members of the house of representatives appointed by the minority leader in the house. Two members from each chamber must be from the majority party in that chamber and two members from each chamber must be from the minority party in that chamber. Each appointing authority must make appointments as soon as possible after the beginning of the regular legislative session in the odd-numbered year. The ranking senator from the majority party appointed to the commission must convene the first meeting of a biennium by February 15 in the odd-numbered year. The commission may elect up to four former legislators who have demonstrated an interest in, or have a history of working in, the areas of government data practices and personal data privacy to serve as nonvoting members of the commission. The former legislators must not be registered lobbyists and shall be compensated as provided under section 15.0575, subdivision 3.\nMembers of the commission serve for terms beginning upon appointment and ending at the beginning of the regular legislative session in the next odd-numbered year. The appropriate appointing authority must fill a vacancy for a seat of a current legislator for the remainder of the unexpired term.\nThe commission must elect a chair and may elect other officers as it determines are necessary. The chair alternates between a member of the senate and a member of the house of representatives in January of each odd-numbered year.\nLegislative staff must provide administrative and research assistance to the commission. The Legislative Coordinating Commission may, if funding is available, appoint staff to provide research assistance.\nThe commission shall:\n(1) review and provide the legislature with research and analysis of emerging issues relating to government data practices and security and privacy of personal data;\n(2) review and make recommendations on legislative proposals relating to the Minnesota Government Data Practices Act; and\n(3) review and make recommendations on legislative proposals impacting personal data privacy rights, data security, and other related issues.",
	"repealed": false
}