{
	"id": "471.193",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.193",
	"title": "471.193 MUNICIPAL HERITAGE PRESERVATION.",
	"text": "The legislature finds that the historical, architectural, archaeological, engineering, and cultural heritage of this state is among its most important assets. Therefore, the purpose of this section is to authorize local governing bodies to engage in a comprehensive program of historic preservation, and to promote the use and conservation of historic properties for the education, inspiration, pleasure, and enrichment of the citizens of this state.\nThe governing body of a statutory or home rule charter city, county, or town may establish a heritage preservation commission to preserve and promote its historic resources according to this section.\nThe powers and duties of any commission established pursuant to this section may include any power possessed by the political subdivision creating the commission, but shall be those delegated or assigned by the ordinance establishing the commission. These powers may include:\n(1) the survey and designation of districts, sites, buildings, structures, and objects that are of historical, architectural, archaeological, engineering, or cultural significance;\n(2) the enactment of rules governing construction, alteration, demolition, and use, including the review of building permits, and the adoption of other measures appropriate for the preservation, protection, and perpetuation of designated properties and areas;\n(3) the acquisition by purchase, gift, or bequest, of a fee or lesser interest, including preservation restrictions, in designated properties and adjacent or associated lands which are important for the preservation and use of the designated properties;\n(4) requests to the political subdivision to use its power of eminent domain to maintain or preserve designated properties and adjacent or associated lands;\n(5) the sale or lease of air rights;\n(6) the granting of use variations to a zoning ordinance;\n(7) participation in the conduct of land use, urban renewal, and other planning processes undertaken by the political subdivision creating the commission; and\n(8) the removal of blighting influences, including signs, unsightly structures, and debris, incompatible with the physical well-being of designated properties or areas.\nNo power shall be exercised by a commission which is contrary to state law or denied a political subdivision by its charter or by law. Powers of a commission shall be exercised only in the manner prescribed by ordinance and no action of a commission shall contravene any provision of a municipal zoning or planning ordinance unless expressly authorized by ordinance.\nIf a commission is established by the city of St. Paul, it shall for the purpose of this section exclude any jurisdiction over the Capitol Area as defined in section 15B.03, subdivision 1.\nCommission members must be persons with demonstrated interest and expertise in historic preservation and must reside within the political subdivision regulated by the ordinance establishing the commission. Every commission shall include, if available, a member of a county historical society of a county in which the municipality is located.\nProposed site designations and design guidelines must be sent to the state historic preservation officer at the Department of Administration, who shall review and comment on the proposal within 60 days. By October 31 of each year, each commission shall submit an annual report to the state historic preservation officer. The report must summarize the commission's activities, including designations, reviews, and other activities during the previous 12 months.",
	"repealed": false
}