{
	"id": "327B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/327B.01",
	"title": "327B.01 DEFINITIONS.",
	"text": "As used in sections 327B.01 to 327B.12 the terms defined in this section have the meanings given them.\n\"Affiliate\" of another person means any person directly or indirectly controlling, controlled by, or under common control with the other person.\n\"Borrower\" means a person or persons applying for or obtaining a manufactured home loan.\n\"Broker\" means any person who:\n(a) for another and for commission, fee or other valuable consideration or with the intention or expectation of receiving the same directly or indirectly lists, sells, exchanges, buys or rents, manages, or offers or attempts to negotiate a sale, option, exchange, purchase or rental of an interest in a manufactured home or advertises or holds out as engaged in such activities;\n(b) for another and for commission, fee or other valuable consideration or with the intention or expectation of receiving the same directly or indirectly negotiates or offers or attempts to negotiate a loan, secured or to be secured by a security interest in or other encumbrance on a manufactured home; or\n(c) engages in the business of charging an advance fee or contracting for collection of a fee in connection with any contract to undertake to promote the sale of a manufactured home through its listing in a publication issued primarily for the purpose of promoting the sale of manufactured homes or real estate.\n\"Commissioner\" means the commissioner of labor and industry.\n\"Churning\" means knowingly or intentionally making, providing, or arranging for a manufactured home loan when the new manufactured home loan does not provide a reasonable, tangible net benefit to the borrower considering all of the circumstances, including the terms of both the new and refinanced loans, the cost of the new loan, and the borrower's circumstances.\n\"Consumer customer\" means any individual who, primarily for personal, household or family purposes, buys, sells, or seeks to buy or sell, a manufactured home from, to or through a dealer or manufacturer.\n\"Controlling shareholder\" means a shareholder whose legal, equitable and beneficial holdings, and whose family's such holdings, in a dealership amount to more than ten percent of the outstanding shares.\n\"Dealer\" or \"retailer\" means any person who engages in the business, either exclusively or in addition to any other occupation, of selling or brokering manufactured homes, new or used, or who offers to sell, solicit, broker or advertise the sale of manufactured homes, new or used.\n\"Express warranty\" means a warranty as defined by section 336.2-313.\n\"Implied warranty of fitness for particular purpose\" means a warranty as defined by section 336.2-315.\n\"Implied warranty of merchantability\" means a warranty as defined by section 336.2-314.\n\"Individual\" means a human being.\n\"In park sale\" has the meaning specified in section 327C.015, subdivision 5.\n\"Licensee\" means a person who is licensed as a dealer, limited dealer, or manufacturer by the Department of Labor and Industry.\n\"Limited dealer\" or \"limited retailer\" means any person who is an owner of a manufactured home park authorized, as principal only, to engage in the sale, offering for sale, soliciting, or advertising the sale of used manufactured homes located in the owned manufactured home park, who is the title holder and engages in no more than ten sales annually.\n\"Manufacturer\" means any person who manufactures, assembles or produces manufactured homes.\n\"Manufactured home\" means a structure, not affixed to or part of real estate, transportable in one or more sections, which in the traveling mode, is eight body feet or more in width or 40 body feet or more in length, or, when erected on site, is 320 or more square feet, and which is built on a permanent chassis and designed to be used as a dwelling with or without a permanent foundation when connected to the required utilities, and includes the plumbing, heating, air conditioning, and electrical systems contained in it.\n\"Manufactured home lender\" means a person who makes a manufactured home loan to a borrower, including a person who provides table funding. A manufactured home lender includes an affiliate, subsidiary, or any person acting as an agent of the lender. This definition does not apply to a manufactured home loan originated by a federal or state chartered bank, savings bank, credit union, or a licensed sales finance company as defined under section 53C.01, subdivision 12.\n\"Manufactured home loan\" means a loan made to a person or persons for the purchase, refinancing, improvement, or repair of a manufactured home.\n\"Manufactured home park\" has the meaning specified in section 327C.015, subdivision 8.\n\"Manufacturing facility\" means the physical site where a manufacturer engages in the business of manufacture, assembly, or production of manufactured homes.\n\"Negative amortization\" occurs when the borrower's compliance with any repayment option offered pursuant to the terms of the manufactured home loan is insufficient to satisfy the interest accruing on the loan, resulting in an increase in the loan balance. Negative amortization does not occur when a manufactured home loan is originated, subsidized, or guaranteed by or through a state, tribal, or local government, or nonprofit organization, and bears one or more of the following nonstandard payment terms that substantially benefit the borrower:\n(1) payments vary with income;\n(2) payments of principal and interest are deferred until the maturity date of the loan or the sale of the residence;\n(3) principal or interest is forgivable under specified conditions; or\n(4) where no interest or an annual interest rate of two percent or less is charged in connection with the loan, and excludes existing loan modifications and payment extensions mutually agreed upon by the secured party and debtor.\n\"Net listing agreement\" means any agreement by any dealer to sell, offer for sale, solicit, broker or advertise the sale of a manufactured home on behalf of any person which provides for the dealer to receive any consideration from any person other than a commission based on a single percentage of the price at which the home is actually sold.\n\"New manufactured home\" means a manufactured home which is purchased for the first time other than for purposes of resale.\n\"Owner\" means any person holding title to a manufactured home park or manufactured homes.\n\"Person\" means any individual, limited liability company, corporation, firm, partnership, incorporated and unincorporated association, sole proprietorship, joint stock company, or any other legal or commercial entity.\n\"Sale\" means:\n(a) the passing of title from one person to another for consideration; or\n(b) any agreement to sell under which possession is delivered to the buyer but title is retained in the seller; or\n(c) any agreement in the form of a bailment or lease of goods if the bailee or lessee agrees to pay as compensation for use a sum substantially equivalent to or in excess of the aggregate value of the goods involved and it is agreed that the bailee or lessee will become, or for no other than a nominal consideration has the option to become, the owner of the goods upon full compliance with the bailee's or lessee's obligations under the agreement; or\n(d) any legally binding executory agreement to make a sale.\n\"Salesperson\" means a person who acts on behalf of a dealer in performing any act which sections 327B.01 to 327B.12 authorize or require to be performed by a dealer.\n\"Trust account\" means a demand deposit, share draft or checking account maintained for the purpose of segregating trust funds from other funds.\n\"Trust funds\" means funds received by a broker in a fiduciary capacity as a part of a manufactured home sale transaction, pending the consummation or termination of a transaction, and includes all down payments, earnest money deposits, rents for clients, tax and insurance escrow payments, damage deposits, and any funds received on behalf of any person.",
	"repealed": false
}