{
	"id": "120B.113",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.113",
	"title": "120B.113 CLOSING EDUCATIONAL OPPORTUNITY GAPS GRANTS.",
	"text": "The commissioner of education must establish a grant program to support implementation of comprehensive achievement and civic readiness strategies under section 120B.11, subdivision 2, clauses (4) and (6), and collaborative efforts that address opportunity gaps resulting from curricular, environmental, and structural inequities in schools experienced by students, families, and staff who are of color or who are American Indian.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Antiracist\" has the meaning given in section 120B.11, subdivision 1.\n(c) \"Curricular\" means curriculum resources used and content taught as well as access to levels of coursework or types of learning opportunities.\n(d) \"Environmental\" means relating to the climate and culture of a school.\n(e) \"Equitable\" means fairness by providing curriculum, instruction, support, and other resources for learning based on the needs of individual students and groups of students to succeed at school rather than treating all students the same despite the students having different needs.\n(f) \"Institutional racism\" has the meaning given in section 120B.11, subdivision 1.\n(g) \"Opportunity gap\" means the inequitable distribution of resources that impacts inequitable opportunities that contribute to or perpetuate learning gaps for certain groups of students.\n(h) \"Structural\" means relating to the organization and systems of a school that have been created to manage a school.\nThe commissioner must determine application procedures and deadlines, select districts and charter schools to participate in the grant program, and determine the award amount and payment process of the grants. To the extent that there are sufficient applications, the commissioner must award an approximately equal number of grants between districts in greater Minnesota and those in the Twin Cities metropolitan area. If there are an insufficient number of applications received for either geographic area, then the commissioner may award grants to meet the requests for funds wherever a district is located.\nThe grant program must provide funding that supports collaborative efforts that close opportunity gaps by:\n(1) ensuring school environments and curriculum validate, affirm, embrace, and integrate cultural and community strengths of students, families, and employees from all racial and ethnic backgrounds; and\n(2) addressing institutional racism with equitable school policies, structures, practices, and curricular offerings, consistent with the requirements for long-term plans under section 124D.861, subdivision 2, paragraph (c).\nGrant recipients must annually report to the commissioner by a date and in a form and manner determined by the commissioner on efforts planned and implemented that engaged students, families, educators, and community members of diverse racial and ethnic backgrounds in making improvements to school climate and curriculum. The report must assess the impact of those efforts as perceived by racially and ethnically diverse stakeholders, and must identify any areas needed for further continuous improvement. The commissioner must publish a report for the public summarizing the activities of grant recipients and what was done to promote sharing of effective practices among grant recipients and potential grant applicants.",
	"repealed": false
}