{
	"id": "43A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.10",
	"title": "43A.10 SELECTION PROCESS; ELIGIBILITY TO COMPETE.",
	"text": "Entrance to the classified service shall be through successful competition in a selection process and appointment from a finalist pool except as provided in section 43A.15 or other law and for employees in a bargaining unit as defined in section 179A.10, appointments shall be subject to applicable provisions of collective bargaining agreements.\nAll selection criteria and methods for filling positions in the classified service shall be job related and designed to fairly assess ability to perform the duties of the vacant position for which the selection process is conducted.\n(a) The commissioner shall establish and maintain a database of applicants for state employment. The commissioner shall establish, publicize, and enforce minimum requirements for applications, and shall ensure that:\n(1) all postings shall be written so as to be relevant to the duties of the job and be nondiscriminatory;\n(2) the appointing authority enforces the established minimum requirements for application;\n(3) the 700-hour on-the-job demonstration experience is considered an alternative, noncompetitive hiring process for classified positions for qualified individuals with disabilities; and\n(4) hiring managers and others involved in the selection process are aware of the accommodation fund under section 16B.4805 to ensure that people with disabilities obtain timely and appropriate accommodations within the hiring process and the state agency can request reimbursement.\n(b) The commissioner shall ensure that all online application processes and all digital content relating to the database referenced in paragraph (a) shall be accessible for people with disabilities.\nThe term of eligibility on layoff lists shall be as provided in the collective bargaining agreement or plan established under section 43A.18, under which the layoff list was established. The term of eligibility for all other applicants shall be determined by the commissioner but shall not be less than six months.\n(a) The commissioner, and any applicable appointing authority, must ensure that all hiring for classified positions identified as managerial under section 43A.18, subdivision 3, is conducted through a fair and open process where all candidates who meet the minimum qualifications for the position are considered. For classified management positions filled through a competitive selection process, under no circumstances may:\n(1) the job requirements be altered to fit a particular candidate prior to the posting of a position; or\n(2) internal documents identify a particular candidate as the future holder of a position prior to their official hiring.\n(b) Notice of a vacant position subject to this section must be posted, and applications must be accepted, for a period of no fewer than 21 days before the position is filled. Upon request of an appointing authority, the commissioner may waive the requirements of this paragraph. Notice of a waiver must be published in the State Register no more than 14 days after the waiver is granted. The notice must describe the reason for the waiver.\n(c) This subdivision does not apply to positions subject to more specific appointment procedures under section 43A.15 or other applicable law, and does not restrict the authority of the commissioner to limit or remove an applicant from consideration under subdivision 6a or 6b.\nThe authorities having control of public buildings in political subdivisions of the state and school districts, upon written request of the commissioner, shall furnish convenient facilities for the administration of selection procedures. Upon such request, it shall be the duty of state and local authorities and employees, as it is consistent with their other duties, to aid in carrying out the provisions of this section. Campuses of the Minnesota State Colleges and Universities may charge the commissioner for actual costs incurred in providing facilities for selection procedures, provided that the costs were incurred due solely to the selection procedure.\nThe commissioner or an appointing authority may pay travel expenses incurred by applicants invited for oral examinations or employment interviews in the manner and amounts authorized by the commissioner.\n[Repealed by amendment, 2004 c 207 s 12]\n[Repealed by amendment, 2004 c 207 s 12]\nThe commissioner may limit consideration to only those applicants who have indicated availability for the geographic location, employment condition, travel status, and job grouping of the vacant position and who have indicated possession of the minimum qualifications for the vacant position. In addition, the commissioner may limit consideration to only those applicants who are:\n(1) employees on a layoff list for the job class of the position. The appointing authority shall consider those names as provided in collective bargaining agreements and plans established under section 43A.18;\n(2) current employees of the civil service, the Minnesota State Retirement System, the Public Employees Retirement Association, and the Teacher's Retirement Association, or employees of one or more agencies or organizational units under them;\n(3) former permanent and probationary employees of the job class who separated from the class within the past four years and have indicated availability for reinstatement to the class; or\n(4) current permanent and probationary employees who have indicated availability for transfer or demotion to the job class.\nThe commissioner may remove from consideration any applicant who:\n(1) has been dismissed for cause from the public service;\n(2) has directly or indirectly given or promised to give anything of value to any person in connection with the selection process, appointment, or proposed appointment;\n(3) has made a false statement of any material fact, or practiced or attempted to practice any deception or fraud in the application or selection process or in securing eligibility or appointment; or\n(4) has a prior conviction of a crime directly related to the vacant position provided the refusal is consistent with the requirements and procedures of chapter 364.\nWhen the commissioner refuses to consider an applicant, the commissioner shall, upon request of the applicant, furnish the applicant a statement of the reasons for the refusal. Upon receipt of relevant information, the commissioner shall reconsider the refusal and may restore the applicant to consideration.\nUpon request, the commissioner or appointing authority shall provide reasonable accommodations to a qualified applicant with a disability to ensure full participation in the selection process, including use of the accommodation fund under section 16B.4805 during the selection process. The commissioner must ensure that each agency head is aware of the accommodation fund and its critical function of removing cost considerations from interview selection decisions.\n[Repealed by amendment, 2004 c 207 s 12]",
	"repealed": false
}