{
	"id": "299J.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/299J.12",
	"title": "299J.12 INTERSTATE PIPELINE INSPECTION FEE, ASSESSMENT.",
	"text": "For each quarter following the delegation to the state of the inspection authority described in section 299J.04, the commissioner shall assess and collect from every interstate pipeline operator an inspection fee in an amount calculated under subdivisions 2 and 3. If an operator does not pay the fee within 60 days after the assessment was mailed, the commissioner may impose a delinquency fee of ten percent of the quarterly inspection fee and interest at the rate of 15 percent per year on the portion of the fee not paid. Fees collected by the commissioner under this section must be deposited in the pipeline safety account.\nFor interstate pipelines and LNG facilities subject to the inspection authority granted under sections 299J.01 to 299J.11, the expenses attributable to the inspection of each pipeline facility or LNG facility must be directly charged to the appropriate pipeline operators on a quarterly basis. The expenses must not include expenses that will be reimbursed by the federal government.\nThe commissioner shall calculate the amount of the general support costs of the Office of Pipeline Safety for the preceding quarter that is proportionate to the amount of time spent by the office in implementing sections 299J.01 to 299J.18 and maintaining interstate agent status, including the costs incurred in seeking federal interstate agent status in the first quarter's calculations. The costs incurred in seeking federal interstate agent status must include the costs directly attributable to salaries, training, and other activities and costs related to obtaining interstate agent status, from the time that the request for interstate agent status is submitted by the commissioner to the United States Department of Transportation, to the time that approval of interstate agent status is granted. The calculated support cost must not include expenses that will be reimbursed by the federal government. Each interstate pipeline operator, except LNG facility operators, must be assessed on a quarterly basis a portion of the calculated support costs equal to the percentage of the total miles of pipeline operated by the pipeline operator in Minnesota. LNG facility operators must be assessed on a quarterly basis a portion of the calculated support costs divided equally between the LNG facilities.",
	"repealed": false
}