{
	"id": "88.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.171",
	"title": "88.171 OPEN BURNING PROHIBITIONS.",
	"text": "Open burning prohibitions specified in this section are in effect at all times of the year.\nNo person shall conduct, cause, or permit open burning of rubber, plastics, chemically treated materials, or other materials which produce excessive or noxious smoke including, but not limited to, tires, railroad ties, chemically treated lumber, composite shingles, tar paper, insulation, composition board, sheetrock, wiring, paint, or paint filters. The commissioner may allow burning of prohibited materials when the commissioner of health or the community health board has made a determination that the burning is necessary to abate a public health nuisance. Except as specifically authorized by the commissioner of the Pollution Control Agency as an emergency response to an oil spill, no person shall conduct, cause, or permit open burning of oil.\nNo person shall conduct, cause, or permit open burning of hazardous waste as defined in section 116.06, subdivision 11, and applicable commissioner's rules.\n(a) No person shall conduct, cause, or permit open burning of solid waste generated from an industrial or manufacturing process or from a service or commercial structure.\n(b) The commissioner may allow open burning of raw untreated wood if the commissioner determines that reuse, recycling, or land disposal is not a feasible or prudent alternative.\nNo person shall conduct, cause, or permit open burning of burnable building material generated from demolition of commercial or institutional structures. A farm building is not a commercial structure.\nNo person shall conduct, cause, or permit salvage operations by open burning.\nNo person shall conduct, cause, or permit the processing of motor vehicles by open burning.\n(a) No person shall conduct, cause, or permit open burning of discarded material resulting from the handling, processing, storage, preparation, serving, or consumption of food, unless specifically allowed under section 17.135.\n(b) A county may allow a resident to conduct open burning of material described in paragraph (a) that is generated from the resident's household if the county board by resolution determines that regularly scheduled pickup of the material is not reasonably available to the resident.\nNo person shall conduct, cause, or permit open burning during a burning ban put into effect by a local authority, county, or a state department or agency.\nFires must not be allowed to smolder with no flame present, except when conducted for the purpose of managing forests, prairies, or wildlife habitats.",
	"repealed": false
}