{
	"id": "256L.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.121",
	"title": "256L.121 SERVICE DELIVERY.",
	"text": "The commissioner of human services shall establish a competitive process for entering into contracts with participating entities for the offering of standard health plans through MinnesotaCare. Coverage through standard health plans must be available to enrollees beginning January 1, 2015. Each standard health plan must cover the health services listed in and meet the requirements of section 256L.03. The competitive process must meet the requirements of section 1331 of the Affordable Care Act and be designed to ensure enrollee access to high-quality health care coverage options. The commissioner, to the extent feasible, shall seek to ensure that enrollees have a choice of coverage from more than one participating entity within a geographic area. In counties that were part of a county-based purchasing plan on January 1, 2013, the commissioner shall use the medical assistance competitive procurement process under section 256B.69, under which selection of entities is based on criteria related to provider network access, coordination of health care with other local services, alignment with local public health goals, and other factors.\nThe commissioner shall require participating entities, as a condition of contract, to document to the commissioner:\n(1) the provision of culturally and linguistically appropriate services, including marketing materials, to MinnesotaCare enrollees; and\n(2) the inclusion in provider networks of providers designated as essential community providers under section 62Q.19.\nThe commissioner shall coordinate the administration of the MinnesotaCare program with medical assistance to maximize efficiency and improve the continuity of care. This includes, but is not limited to:\n(1) establishing geographic areas for MinnesotaCare that are consistent with the geographic areas of the medical assistance program, within which participating entities may offer health plans;\n(2) requiring, as a condition of participation in MinnesotaCare, participating entities to also participate in the medical assistance program;\n(3) complying with sections 256B.69, subdivision 3a; 256B.692, subdivision 1; and 256B.694, when contracting with MinnesotaCare participating entities;\n(4) providing MinnesotaCare enrollees, to the extent possible, with the option to remain in the same health plan and provider network, if they later become eligible for medical assistance or coverage through MNsure and if, in the case of becoming eligible for medical assistance, the enrollee's MinnesotaCare health plan is also a medical assistance health plan in the enrollee's county of residence; and\n(5) establishing requirements and criteria for selection that ensure that covered health care services will be coordinated with local public health services, social services, long-term care services, mental health services, and other local services affecting enrollees' health, access, and quality of care.",
	"repealed": false
}