{
	"id": "295.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.57",
	"title": "295.57 COLLECTION AND ENFORCEMENT; REFUNDS; APPLICATION OF OTHER CHAPTERS; ACCESS TO RECORDS; INTEREST ON OVERPAYMENTS.",
	"text": "Unless specifically provided otherwise by sections 295.50 to 295.59, the interest, criminal penalties, and refunds provisions in chapter 289A, the civil penalty provisions applicable to withholding and sales taxes under section 289A.60, and the audit, assessment, appeal, collection, enforcement, and administrative provisions of chapters 270C and 289A, apply to taxes imposed under sections 295.50 to 295.59.\nFor purposes of administering the taxes imposed by sections 295.50 to 295.59, the commissioner may access patients' records that contain billing or other financial information without prior consent from the patients. The data collected is classified as private or nonpublic data.\nInterest must be paid on an overpayment refunded or credited to the taxpayer in the manner provided in section 289A.56, subdivision 2.\nThe commissioner may use statistical or other sampling techniques consistent with generally accepted auditing standards in examining returns or records and making assessments.\nIf a hospital, surgical center, or health care provider cannot determine the actual cost or reimbursement of legend drugs under the exemption provided in section 295.53, subdivision 1, paragraph (b), clause (5), the following method must be used:\nA hospital, surgical center, or health care provider must determine the amount paid for legend drugs used during the month or quarter and multiply that amount by a ratio, the numerator of which is the total amount received for taxable patient services, and the denominator of which is the total amount received for all patient services, including amounts exempt under section 295.53, subdivision 1, paragraph (b). The result represents the allowable exemption for the monthly or quarterly cost of drugs.",
	"repealed": false
}