{
	"id": "290.0675",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0675",
	"title": "290.0675 MARRIAGE PENALTY CREDIT.",
	"text": "(a) For purposes of this section the following terms have the meanings given.\n(b) \"Earned income\" means the sum of the following, to the extent included in Minnesota taxable income:\n(1) earned income as defined in section 290.01, subdivision 33;\n(2) income received from a retirement pension, profit-sharing, stock bonus, or annuity plan; and\n(3) Social Security benefits as defined in section 86(d)(1) of the Internal Revenue Code.\n(c) \"Taxable income\" means net income as defined in section 290.01, subdivision 19.\n(d) \"Earned income of lesser-earning spouse\" means the earned income of the spouse with the lesser amount of earned income as defined in paragraph (b) for the taxable year minus one-half the amount of the standard deduction under section 290.0123, subdivision 1, clause (1).\nA married couple filing a joint return is allowed a credit against the tax imposed under section 290.06.\nThe credit amount is the difference between the tax on the couple's joint Minnesota taxable income under the rates and income levels in section 290.06, subdivision 2c, paragraph (a), as adjusted for the taxable year by section 290.06, subdivision 2d, and the sum of the tax under the rates and income levels of section 290.06, subdivision 2c, paragraph (b), as adjusted for the taxable year by section 290.06, subdivision 2d, on the earned income of the lesser-earning spouse, and the tax under the rates and income levels of section 290.06, subdivision 2c, paragraph (b), as adjusted for the taxable year by section 290.06, subdivision 2d, on the couple's joint Minnesota taxable income, minus the earned income of the lesser-earning spouse.\nThe commissioner of revenue shall prepare and make available to taxpayers a comprehensive table showing the credit under this section at brackets of earnings of the lesser-earning spouse and joint taxable income. The brackets of earnings shall not be more than $2,000.\nFor a nonresident or part-year resident, the credit must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\n[Repealed, 2003 c 127 art 3 s 24]",
	"repealed": false
}