{
	"id": "142A.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.605",
	"title": "142A.605 NORTHSTAR KINSHIP ASSISTANCE ELIGIBILITY.",
	"text": "(a) To be eligible for Northstar kinship assistance under this section, there must be a judicial determination under section 260C.515, subdivision 4, that a transfer of permanent legal and physical custody to a relative who is not the child's parent is in the child's best interest. For a child under jurisdiction of a tribal court, a judicial determination under a similar provision in tribal code indicating that a relative will assume the duty and authority to provide care, control, and protection of a child who is residing in foster care, and to make decisions regarding the child's education, health care, and general welfare until adulthood, and that this is in the child's best interest is considered equivalent. A child whose parent shares legal, physical, or legal and physical custody of the child with a relative custodian is not eligible for Northstar kinship assistance. Additionally, a child must:\n(1) have been removed from the child's home pursuant to a voluntary placement agreement or court order;\n(2)(i) have resided with the prospective relative custodian who has been a licensed child foster parent for at least six consecutive months; or\n(ii) have received from the commissioner an exemption from the requirement in item (i) that the prospective relative custodian has been a licensed child foster parent for at least six consecutive months, based on a determination that:\n(A) an expedited move to permanency is in the child's best interest;\n(B) expedited permanency cannot be completed without provision of Northstar kinship assistance;\n(C) the prospective relative custodian is uniquely qualified to meet the child's needs, as defined in section 260C.212, subdivision 2, on a permanent basis;\n(D) the child and prospective relative custodian meet the eligibility requirements of this section; and\n(E) efforts were made by the legally responsible agency to place the child with the prospective relative custodian as a licensed child foster parent for six consecutive months before permanency, or an explanation why these efforts were not in the child's best interests;\n(3) meet the agency determinations regarding permanency requirements in subdivision 2;\n(4) meet the applicable citizenship and immigration requirements in subdivision 3;\n(5) have been consulted regarding the proposed transfer of permanent legal and physical custody to a relative, if the child is at least 14 years of age or is expected to attain 14 years of age prior to the transfer of permanent legal and physical custody; and\n(6) have a written, binding agreement under section 142A.608 among the caregiver or caregivers, the financially responsible agency, and the commissioner established prior to transfer of permanent legal and physical custody.\n(b) In addition to the requirements in paragraph (a), the child's prospective relative custodian or custodians must meet the applicable background study requirements in subdivision 4.\n(c) To be eligible for title IV-E Northstar kinship assistance, a child must also meet any additional criteria in section 473(d) of the Social Security Act. The sibling of a child who meets the criteria for title IV-E Northstar kinship assistance in section 473(d) of the Social Security Act is eligible for title IV-E Northstar kinship assistance if the child and sibling are placed with the same prospective relative custodian or custodians, and the legally responsible agency, relatives, and commissioner agree on the appropriateness of the arrangement for the sibling. A child who meets all eligibility criteria except those specific to title IV-E Northstar kinship assistance is entitled to Northstar kinship assistance paid through funds other than title IV-E.\n(a) To be eligible for Northstar kinship assistance, the legally responsible agency must complete the following determinations regarding permanency for the child prior to the transfer of permanent legal and physical custody:\n(1) a determination that reunification and adoption are not appropriate permanency options for the child; and\n(2) a determination that the child demonstrates a strong attachment to the prospective relative custodian and the prospective relative custodian has a strong commitment to caring permanently for the child.\n(b) The legally responsible agency shall document the determinations in paragraph (a) and eligibility requirements in this section that comply with United States Code, title 42, sections 673(d) and 675(1)(F). These determinations must be documented in a kinship placement agreement, which must be in the format prescribed by the commissioner and must be signed by the prospective relative custodian and the legally responsible agency. In the case of a Minnesota tribe, the determinations and eligibility requirements in this section may be provided in an alternative format approved by the commissioner. Supporting information for completing each determination must be documented in the legally responsible agency's case file and available for review as requested by the financially responsible agency and the commissioner during the Northstar kinship assistance eligibility determination process.\nA child must be a citizen of the United States or otherwise be eligible for federal public benefits according to the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, as amended, in order to be eligible for Northstar kinship assistance.\n(a) A background study must be completed on each prospective relative custodian and any other adult residing in the home of the prospective relative custodian. The background study must meet the requirements of United States Code, title 42, section 671(a)(20). A study completed under section 245C.33 meets this requirement. A background study on the prospective relative custodian or adult residing in the household previously completed under chapter 245C for the purposes of child foster care licensure under chapter 142B or licensure by a Minnesota tribe, shall be used for the purposes of this section, provided that the background study meets the requirements of this subdivision and the prospective relative custodian is a licensed child foster parent at the time of the application for Northstar kinship assistance.\n(b) If the background study reveals:\n(1) a felony conviction at any time for:\n(i) child abuse or neglect;\n(ii) spousal abuse;\n(iii) a crime against a child, including child pornography; or\n(iv) a crime involving violence, including rape, sexual assault, or homicide, but not including other physical assault or battery; or\n(2) a felony conviction within the past five years for:\n(i) physical assault;\n(ii) battery; or\n(iii) a drug-related offense;\nthe prospective relative custodian is prohibited from receiving Northstar kinship assistance on behalf of an otherwise eligible child.\nThe commissioner shall determine eligibility for:\n(1) a child under the legal custody or responsibility of a Minnesota county social service agency who would otherwise remain in foster care;\n(2) a Minnesota child under tribal court jurisdiction who would otherwise remain in foster care; and\n(3) an Indian child being placed in Minnesota who meets title IV-E eligibility defined in section 473(d) of the Social Security Act. The agency or entity assuming responsibility for the child is responsible for the nonfederal share of the Northstar kinship assistance payment.\n(a) A child with a Northstar kinship assistance agreement under Northstar Care for Children is not eligible for the Minnesota family investment program child-only grant under chapter 142G.\n(b) The commissioner shall not enter into a Northstar kinship assistance agreement with:\n(1) a child's biological parent or stepparent;\n(2) an individual assuming permanent legal and physical custody of a child or the equivalent under tribal code without involvement of the child welfare system; or\n(3) an individual assuming permanent legal and physical custody of a child who was placed in Minnesota by another state or a tribe outside of Minnesota.\nThe financially responsible agency shall prepare a Northstar kinship assistance eligibility determination for review and final approval by the commissioner. The eligibility determination must be completed according to requirements and procedures and on forms prescribed by the commissioner. Supporting documentation for the eligibility determination must be provided to the commissioner. The financially responsible agency and the commissioner must make every effort to establish a child's eligibility for title IV-E Northstar kinship assistance. A child who is determined to be eligible for Northstar kinship assistance must have a Northstar kinship assistance agreement negotiated on the child's behalf according to section 142A.608.\n(a) A Northstar kinship assistance agreement must be terminated in any of the following circumstances:\n(1) the child has attained the age of 18, or up to age 21 when the child meets a condition for extension in subdivision 11;\n(2) the child has not attained the age of 18 years of age, but the commissioner determines the relative custodian is no longer legally responsible for support of the child;\n(3) the commissioner determines the relative custodian is no longer providing financial support to the child up to age 21;\n(4) the death of the child; or\n(5) the relative custodian requests in writing termination of the Northstar kinship assistance agreement.\n(b) A relative custodian is considered no longer legally responsible for support of the child in any of the following circumstances:\n(1) permanent legal and physical custody or guardianship of the child is transferred to another individual;\n(2) the death of the relative custodian under subdivision 9;\n(3) the child enlists in the military;\n(4) the child gets married; or\n(5) the child is determined an emancipated minor through legal action.\nThe Northstar kinship assistance agreement ends upon death or incapacity of the relative custodian or modification of the order for permanent legal and physical custody in which legal or physical custody is removed from the relative custodian. In the case of a relative custodian's death or incapacity, Northstar kinship assistance eligibility may be continued according to subdivision 10.\n(a) In the event of the death or incapacity of the relative custodian, eligibility for Northstar kinship assistance and title IV-E assistance, if applicable, is not affected if the relative custodian is replaced by a successor named in the Northstar kinship assistance benefit agreement. Northstar kinship assistance must be paid to a named successor who is not the child's legal parent, biological parent or stepparent, or other adult living in the home of the legal parent, biological parent, or stepparent.\n(b) In order to receive Northstar kinship assistance, a named successor must:\n(1) meet the background study requirements in subdivision 4;\n(2) renegotiate the agreement consistent with section 142A.608, subdivision 3, including cooperating with an assessment under section 142A.607;\n(3) be ordered by the court to be the child's legal relative custodian in a modification proceeding under section 260C.521, subdivision 2; and\n(4) satisfy the requirements in this paragraph within one year of the relative custodian's death or incapacity unless the commissioner certifies that the named successor made reasonable attempts to satisfy the requirements within one year and failure to satisfy the requirements was not the responsibility of the named successor.\n(c) Payment of Northstar kinship assistance to the successor guardian may be temporarily approved through the policies, procedures, requirements, and deadlines under section 142A.612, subdivision 2. Ongoing payment shall begin in the month when all the requirements in paragraph (b) are satisfied.\n(d) Continued payment of Northstar kinship assistance may occur in the event of the death or incapacity of the relative custodian when:\n(1) no successor has been named in the benefit agreement or a named successor is not able or willing to accept custody or guardianship of the child; and\n(2) the commissioner gives written consent to an individual who is a guardian or custodian appointed by a court for the child upon the death of both relative custodians in the case of assignment of custody to two individuals, or the sole relative custodian in the case of assignment of custody to one individual, unless the child is under the custody of a county, tribal, or child-placing agency.\n(e) Temporary assignment of Northstar kinship assistance may be approved for a maximum of six consecutive months from the death or incapacity of the relative custodian or custodians as provided in paragraph (a) and must adhere to the policies, procedures, requirements, and deadlines under section 142A.612, subdivision 2, that are prescribed by the commissioner. If a court has not appointed a permanent legal guardian or custodian within six months, the Northstar kinship assistance must terminate and must not be resumed.\n(f) Upon assignment of assistance payments under paragraphs (d) and (e), assistance must be provided from funds other than title IV-E.\n(a) Under the circumstances outlined in paragraph (e), a child may qualify for extension of the Northstar kinship assistance agreement beyond the date the child attains age 18, up to the date the child attains the age of 21.\n(b) A request for extension of the Northstar kinship assistance agreement must be completed in writing and submitted, including all supporting documentation, by the relative custodian to the commissioner at least 60 calendar days prior to the date that the current agreement will terminate.\n(c) A signed amendment to the current Northstar kinship assistance agreement must be fully executed between the relative custodian and the commissioner at least ten business days prior to the termination of the current agreement. The request for extension and the fully executed amendment must be made according to requirements and procedures prescribed by the commissioner, including documentation of eligibility, and on forms prescribed by the commissioner.\n(d) If an agency is certifying a child for Northstar kinship assistance and the child will attain the age of 18 within 60 calendar days of submission, the request for extension must be completed in writing and submitted, including all supporting documentation, with the Northstar kinship assistance application.\n(e) A child who has attained the age of 16 prior to the effective date of the Northstar kinship assistance agreement is eligible for extension of the agreement up to the date the child attains age 21 if the child:\n(1) is dependent on the relative custodian for care and financial support; and\n(2) meets at least one of the following conditions:\n(i) is completing a secondary education program or a program leading to an equivalent credential;\n(ii) is enrolled in an institution which provides postsecondary or vocational education;\n(iii) is participating in a program or activity designed to promote or remove barriers to employment;\n(iv) is employed for at least 80 hours per month; or\n(v) is incapable of doing any of the activities described in items (i) to (iv) due to a medical condition where incapability is supported by professional documentation according to the requirements and procedures prescribed by the commissioner.\n(f) A child who has not attained the age of 16 prior to the effective date of the Northstar kinship assistance agreement is eligible for extension of the Northstar kinship assistance agreement up to the date the child attains the age of 21 if the child is:\n(1) dependent on the relative custodian for care and financial support; and\n(2) possesses a physical or mental disability which impairs the capacity for independent living and warrants continuation of financial assistance, as determined by the commissioner.\nEffective November 27, 2014, a child who meets the eligibility criteria for Northstar kinship assistance in subdivision 1 may have a Northstar kinship assistance agreement negotiated on the child's behalf according to section 142A.608. The effective date of the agreement must be January 1, 2015, or the date of the court order transferring permanent legal and physical custody, whichever is later. Except as provided under section 142A.609, subdivision 1, paragraph (c), the rate schedule for an agreement under this subdivision is determined under section 142A.609 based on the age of the child on the date that the prospective relative custodian signs the agreement.\nThe commissioner may execute Northstar kinship assistance agreements for a child with a relative custody agreement under section 142A.65 executed on the child's behalf on or before November 26, 2014, in accordance with the priorities outlined in section 142A.612, subdivision 7, paragraph (b). To facilitate transition into the Northstar kinship assistance program, the commissioner may waive any Northstar kinship assistance eligibility requirements for a child with a relative custody agreement under section 142A.65 executed on the child's behalf on or before November 26, 2014. Agreements negotiated under this subdivision must be done according to the process outlined in section 142A.612, subdivision 7. The maximum rate used in the negotiation process for an agreement under this subdivision must be as outlined in section 142A.612, subdivision 7.",
	"repealed": false
}