{
	"id": "289A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.60",
	"title": "289A.60 CIVIL PENALTIES.",
	"text": "(a) If a corporate franchise, fiduciary income, mining company, estate, partnership, S corporation, or nonresident entertainer tax is not paid within the time specified for payment, a penalty of six percent is added to the unpaid tax, except that if a corporation or mining company meets the requirements of section 289A.19, subdivision 2, the penalty is not imposed.\n(b) For the taxes listed in paragraph (a), in addition to the penalty in that paragraph, whether imposed or not, if a return or amended return is filed after the due date, without regard to extensions, and any tax reported as remaining due is not remitted with the return or amended return, a penalty of five percent of the tax not paid is added to the tax. If the commissioner issues an order assessing additional tax for a tax listed in paragraph (a), and the tax is not paid within 60 days after the mailing of the order or, if appealed, within 60 days after final resolution of the appeal, a penalty of five percent of the unpaid tax is added to the tax.\n(c) If an individual income tax is not paid within the time specified for payment, a penalty of four percent is added to the unpaid tax. There is a presumption of reasonable cause for the late payment if the individual: (i) pays by the due date of the return at least 90 percent of the amount of tax, after credits other than withholding and estimated payments, shown owing on the return; (ii) files the return within six months after the due date; and (iii) pays the remaining balance of the reported tax when the return is filed.\n(d) If the commissioner issues an order assessing additional individual income tax, and the tax is not paid within 60 days after the mailing of the order or, if appealed, within 60 days after final resolution of the appeal, a penalty of four percent of the unpaid tax is added to the tax.\n(e) If a withholding or sales or use tax is not paid within the time specified for payment, a penalty must be added to the amount required to be shown as tax. The penalty is five percent of the tax not paid on or before the date specified for payment of the tax if the failure is for not more than 30 days, with an additional penalty of five percent of the amount of tax remaining unpaid during each additional 30 days or fraction of 30 days during which the failure continues, not exceeding 15 percent in the aggregate.\nIf a taxpayer fails to make and file a tax return within the time prescribed, including an extension, or fails to file an individual income tax return within six months after the due date, a penalty of five percent of the amount of tax not paid by the end of that period is added to the tax.\n(a) If an individual income tax is not paid within 180 days after the date of filing of a return or, in the case of taxes assessed by the commissioner, within 180 days after the assessment date or, if appealed, within 180 days after final resolution of the appeal, an extended delinquency penalty of five percent of the tax remaining unpaid is added to the amount due.\n(b) If a tax return is not filed within 30 days after written demand for the filing of a delinquent return, an extended delinquency penalty of five percent of the tax not paid prior to the demand or $100 is imposed, whichever amount is greater.\n[Repealed, 1Sp2001 c 5 art 11 s 8]\n(a) The commissioner of revenue shall impose a penalty for substantial understatement of any tax payable to the commissioner, except a tax imposed under chapter 297A.\n(b) There must be added to the tax an amount equal to 20 percent of the amount of any underpayment attributable to the understatement. There is a substantial understatement of tax for the period if the amount of the understatement for the period exceeds the greater of:\n(1) ten percent of the tax required to be shown on the return for the period; or\n(2)(i) $10,000 in the case of a mining company or a corporation, other than an S corporation as defined in section 290.9725, when the tax is imposed by chapter 290 or section 298.01 or 298.015, or\n(ii) $5,000 in the case of any other taxpayer, and in the case of a mining company or a corporation any tax not imposed by chapter 290 or section 298.01 or 298.015.\n(c) For a corporation, other than an S corporation, there is also a substantial understatement of tax for any taxable year if the amount of the understatement for the taxable year exceeds the lesser of:\n(1) ten percent of the tax required to be shown on the return for the taxable year (or, if greater, $10,000); or\n(2) $10,000,000.\n(d) The term \"understatement\" means the excess of the amount of the tax required to be shown on the return for the period, over the amount of the tax imposed that is shown on the return. The excess must be determined without regard to items to which subdivision 27 applies. The amount of the understatement shall be reduced by that part of the understatement that is attributable to the tax treatment of any item by the taxpayer if (1) there is or was substantial authority for the treatment, or (2)(i) any item with respect to which the relevant facts affecting the item's tax treatment are adequately disclosed in the return or in a statement attached to the return and (ii) there is a reasonable basis for the tax treatment of the item. The exception for substantial authority under clause (1) does not apply to positions listed by the Secretary of the Treasury under section 6662(d)(3) of the Internal Revenue Code. A corporation does not have a reasonable basis for its tax treatment of an item attributable to a multiple-party financing transaction if the treatment does not clearly reflect the income of the corporation within the meaning of section 6662(d)(2)(B) of the Internal Revenue Code. The special rules in cases involving tax shelters provided in section 6662(d)(2)(C) of the Internal Revenue Code shall apply and shall apply to a tax shelter the principal purpose of which is the avoidance or evasion of state taxes.\n(e) The commissioner may abate all or any part of the addition to the tax provided by this section on a showing by the taxpayer that there was reasonable cause for the understatement, or part of it, and that the taxpayer acted in good faith. The additional tax and penalty shall bear interest as specified in section 270C.40 until paid.\nIf part of an additional assessment is due to negligence or intentional disregard of the provisions of the applicable tax laws or rules of the commissioner, but without intent to defraud, there must be added to the tax an amount equal to ten percent of the additional assessment.\nIf there is a pattern by a person of repeated failures to timely file withholding or sales or use tax returns or timely pay withholding or sales or use taxes, and written notice is given that a penalty will be imposed if such failures continue, a penalty of 25 percent of the amount of tax not timely paid as a result of each such subsequent failure is added to the tax. The penalty can be abated under the abatement authority in section 270C.34.\n(a) If a person, with intent to evade or defeat a tax or payment of tax, fails to file a return, files a false or fraudulent return, or attempts in any other manner to evade or defeat a tax or payment of tax, there is imposed on the person a penalty equal to 50 percent of the tax, less amounts paid by the person on the basis of the false or fraudulent return, if any, due for the period to which the return related.\n(b) If a person files a false or fraudulent return that includes a claim for refund, there is imposed on the person a penalty equal to 50 percent of the portion of any refund claimed that is attributable to fraud. The penalty under this paragraph is in addition to any penalty imposed under paragraph (a).\nIf a taxpayer files what purports to be a tax return or a claim for refund but which does not contain information on which the substantial correctness of the purported return or claim for refund may be judged or contains information that on its face shows that the purported return or claim for refund is substantially incorrect and the conduct is due to a position that is frivolous or a desire that appears on the purported return or claim for refund to delay or impede the administration of Minnesota tax laws, then the taxpayer shall pay a penalty of the greater of $1,000 or 25 percent of the amount of tax required to be shown on the return. In a proceeding involving the issue of whether or not a taxpayer is liable for this penalty, the burden of proof is on the commissioner.\n(a) In the case of a failure to file an informational return required by section 289A.12 with the commissioner on the date prescribed (determined with regard to any extension of time for filing), the person failing to file the return shall pay a penalty of $50 for each failure or in the case of a partnership, S corporation, or fiduciary return, $50 for each partner, shareholder, or beneficiary; but the total amount imposed on the delinquent person for all failures during any calendar year must not exceed $25,000. If a failure to file a return is due to intentional disregard of the filing requirement, then the penalty imposed under the preceding sentence must not be less than an amount equal to:\n(1) in the case of a return not described in clause (2) or (3), ten percent of the aggregate amount of the items required to be reported;\n(2) in the case of a return required to be filed under section 289A.12, subdivision 5, five percent of the gross proceeds required to be reported; and\n(3) in the case of a return required to be filed under section 289A.12, subdivision 9, relating to direct sales, $100 for each failure; however, the total amount imposed on the delinquent person for intentional failures during a calendar year must not exceed $50,000. The penalty must be collected in the same manner as a delinquent income tax.\n(b) If a partnership or S corporation files a partnership or S corporation return with an incorrect tax identification number used for a partner or shareholder after being notified by the commissioner that the identification number is incorrect, the partnership or S corporation must pay a penalty of $50 for each such incorrect number.\n[Repealed, 1996 c 305 art 1 s 64]\nA person who is required by law to: (1) give the person's Social Security account number to another person; or (2) include in a return, statement, or other document made with respect to another person that individual's Social Security account number, who fails to comply with the requirement when prescribed, must pay a penalty of $50 for each failure. The total amount imposed on a person for failures during a calendar year must not exceed $25,000.\n(a) When a person required under section 289A.09, subdivision 2, to give a statement to an employee or payee and a duplicate statement to the commissioner, or to give a reconciliation of the statements and quarterly returns to the commissioner, gives a false or fraudulent statement to an employee or payee or a false or fraudulent duplicate statement or reconciliation of statements and quarterly returns to the commissioner, or fails to give a statement or the reconciliation in the manner, when due, and showing the information required by section 289A.09, subdivision 2, or rules prescribed by the commissioner under that section, that person is liable for a penalty of $50 for an act or failure to act. The total amount imposed on the delinquent person for failures during a calendar year must not exceed $25,000.\n(b) In addition to any other penalty provided by law, an employee who gives a withholding exemption certificate or a residency affidavit to an employer that decreases the amount withheld under section 290.92 and as of the time the certificate or affidavit was given to the employer there was no reasonable basis for the statements in the certificate or affidavit is liable to the commissioner of revenue for a penalty of $500 for each instance.\n(c) In addition to any other penalty provided by law, an employer who fails to submit a copy of a withholding exemption certificate or a residency affidavit required by section 290.92, subdivision 5a, paragraph (a), clause (1) or (2), or (b) is liable to the commissioner of revenue for a penalty of $50 for each instance.\n(d) An employer or payor who fails to file an application for a withholding account number, as required by section 290.92, subdivision 24, is liable to the commissioner for a penalty of $100.\n(a) If it is determined that a property tax refund claim is excessive and was negligently prepared, a claimant is liable for a penalty of ten percent of the disallowed claim. If the claim has been paid, the amount disallowed must be recovered by assessment and collection.\n(b) An owner who without reasonable cause fails to give a certificate of rent paid to a renter, as required by sections 290.0693, subdivision 4, and 290A.19, paragraph (a), is liable to the commissioner for a penalty of $100 for each failure.\n(c) If the owner or managing agent knowingly gives rent certificates that report total rent constituting property taxes in excess of the amount of actual rent constituting property taxes paid on the rented part of a property, the owner or managing agent is liable for a penalty equal to the greater of (1) $100 or (2) 50 percent of the excess that is reported. An overstatement of rent constituting property taxes is presumed to be knowingly made if it exceeds by ten percent or more the actual rent constituting property taxes.\n(a) If an understatement of liability with respect to a return or claim for refund is due to a reckless disregard of laws and rules or willful attempt in any manner to understate the liability for a tax by a person who is a tax preparer with respect to the return or claim, the person shall pay to the commissioner a penalty of $500. If a part of a claim filed under section 290.0677, subdivision 1; 290.0693; or chapter 290A is excessive due to a reckless disregard or willful attempt in any manner to overstate the claim allowed by a person who is a tax preparer, the tax preparer shall pay to the commissioner a penalty of $500 with respect to the claim. These penalties may not be assessed against the employer of a tax preparer unless the employer was actively involved in the reckless disregard or willful attempt to understate the liability for a tax or to overstate the claim for refund. These penalties are income tax liabilities and may be assessed at any time as provided in section 289A.38, subdivision 5.\n(b) A civil action in the name of the state of Minnesota may be commenced to enjoin any person who is a tax preparer doing business in this state as provided in section 270C.447.\n(c) The commissioner may terminate or suspend a tax preparer's authority to transmit returns electronically to the state, if the commissioner determines that the tax preparer has engaged in a pattern and practice of conduct in violation of paragraph (a) of this subdivision or has been convicted under section 289A.63.\n(d) For purposes of this subdivision, the term \"understatement of liability\" means an understatement of the net amount payable with respect to a tax imposed by state tax law, or an overstatement of the net amount creditable or refundable with respect to a tax. The determination of whether or not there is an understatement of liability must be made without regard to any administrative or judicial action involving the taxpayer. For purposes of this subdivision, the amount determined for underpayment of estimated tax under either section 289A.25 or 289A.26 is not considered an understatement of liability.\n(e) For purposes of this subdivision, the term \"overstatement of claim\" means an overstatement of the net amount refundable with respect to a claim filed under section 290.0677, subdivision 1, or chapter 290A. The determination of whether or not there is an overstatement of a claim must be made without regard to administrative or judicial action involving the claimant.\n(f) For purposes of this section, the term \"tax preparer\" or \"preparer\" has the meaning given in section 270C.445, subdivision 2, paragraph (h).\nA person who uses an exemption certificate to buy property or purchase services that will be used for purposes other than the exemption claimed, with the intent to evade payment of sales tax to the seller, is subject to a penalty of $100 for each transaction where that use of an exemption certificate has occurred.\n(a) For payments made after December 31, 2019 and before December 31, 2021, if a vendor is required by law to submit an estimation of June sales tax liabilities and 87.5 percent payment by a certain date, the vendor shall pay a penalty equal to ten percent of the amount of actual June liability required to be paid in June less the amount remitted in June. The penalty must not be imposed, however, if the amount remitted in June equals the lesser of 87.5 percent of the preceding May's liability or 87.5 percent of the average monthly liability for the previous calendar year.\n(b) For payments made after December 31, 2021, the penalty must not be imposed if the amount remitted in June equals the lesser of 84.5 percent, or a reduced percentage as certified by the commissioner under section 16A.152, subdivision 2, paragraph (a), clause (6), of the preceding May's liability or 84.5 percent of the average monthly liability for the previous calendar year.\n(c) This subdivision expires after the percentage of estimated payment is reduced to zero in accordance with section 16A.152, subdivision 2, paragraph (a), clause (6).\nA person who engages in the business of making retail sales after revocation of a permit under section 270C.722 is liable for a penalty of $100 for each day the person continues to make taxable sales.\nA person who fails to comply with the provisions of section 297A.87 is subject to a penalty of $100 for each day of each selling event that the operator fails to obtain evidence that a seller is the holder of a valid seller's permit issued under section 297A.83.\nThe penalties imposed by this section are collected and paid in the same manner as taxes.\nThe civil penalties imposed by this section are in addition to the criminal penalties imposed by this chapter.\n(a) Any person who:\n(1)(i) organizes or assists in the organization of a partnership or other entity, an investment plan or arrangement, or any other plan or arrangement, or (ii) participates in the sale of any interest in an entity or plan or arrangement referred to in clause (i); and\n(2) makes or furnishes in connection with the organization or sale a statement with respect to the allowability of a deduction or credit, the excludability of income, or the securing of any other tax benefit by reason of holding an interest in the entity or participating in the plan or arrangement that the person knows or has reason to know is false or fraudulent concerning any material matter, shall pay a penalty equal to the greater of $1,000 or 20 percent of the gross income derived or to be derived by the person from the activity.\nThe penalty imposed by this subdivision is in addition to any other penalty provided by this section. The penalty must be collected in the same manner as any delinquent income tax. In a proceeding involving the issue of whether or not any person is liable for this penalty, the burden of proof is upon the commissioner.\n(b) If an activity for which a penalty imposed under this subdivision involves a statement that a material advisor, as defined in section 289A.121, has reason to know is false or fraudulent as to any material matter, the amount of the penalty equals the greater of:\n(1) the amount determined under paragraph (a); or\n(2) 50 percent of the gross income derived or to be derived from the activity.\n(a) A penalty in the amount specified under paragraph (b) for each document is imposed on each person who:\n(1) aids or assists in, procures, or advises with respect to, the preparation or presentation of any portion of a return, affidavit, claim, or other document;\n(2) knows or has reason to believe that the portion of a return, affidavit, claim, or other document will be used in connection with any material matter arising under the Minnesota individual income or corporate franchise tax; and\n(3) knows that the portion, if so used, would result in an understatement of the liability for tax of another person.\n(b)(1) Except as provided in clause (2), the amount of the penalty imposed by this subdivision is $1,000.\n(2) If the return, affidavit, claim, or other document relates to the tax liability of a corporation, the amount of the penalty imposed by paragraph (a) is $10,000.\n(3) If any person is subject to a penalty under paragraph (a) for any document relating to any taxpayer for any taxable period or taxable event, the person is not subject to a penalty under paragraph (a) for any other document relating to the taxpayer for the taxable period or event.\n(c) For purposes of this subdivision, \"procures\" includes (1) ordering or otherwise causing any other person to do an act, and (2) knowing of, and not attempting to prevent, participation by any other person in an act.\n(d) In a proceeding involving the issue of whether or not any person is liable for this penalty, the burden of proof is upon the commissioner. The penalty applies whether or not the understatement is with the knowledge or consent of the persons authorized or required to present the return, affidavit, claim, or other document.\n(e) For purposes of paragraph (a), clause (1), a person furnishing typing, reproducing, or other mechanical assistance with respect to a document is not treated as having aided or assisted in the preparation of the document by reason of the assistance.\n(f)(1) Except as provided by clause (2), the penalty imposed by this section is in addition to any other penalty provided by law.\n(2) No penalty applies under subdivision 20 to any person for any document for which a penalty is assessed on the person under this subdivision.\nIn addition to other applicable penalties imposed by this section, after notification from the commissioner to the taxpayer that payments are required to be made by electronic means under section 289A.20, subdivision 2, paragraph (e), or 4, paragraph (c), or 289A.26, subdivision 2a, and the payments are remitted by some other means, there is a penalty in the amount of five percent of each payment that should have been remitted electronically. After the commissioner's initial notification to the taxpayer that payments are required to be made by electronic means, the commissioner is not required to notify the taxpayer in subsequent periods if the initial notification specified the amount of tax liability at which a taxpayer is required to remit payments by electronic means. The penalty can be abated under the abatement procedures prescribed in section 270C.34, subdivision 2, if the failure to remit the payment electronically is due to reasonable cause.\nFor the purposes of the penalties imposed by subdivisions 1 and 2, the payment of a composite tax or filing of a composite return pursuant to section 289A.08, subdivision 7, is considered the payment and filing of a corporate tax.\nFor the purposes of the penalties imposed by subdivisions 1 and 2, the payment of a pass-through entity tax or filing of a pass-through entity tax return pursuant to section 289A.08, subdivision 7a, is considered the payment and filing of a corporate tax.\nFor the purposes of the penalties imposed by subdivisions 1, 2, and 5a, the filing of returns required by section 289A.09, subdivision 1, paragraphs (d) and (e), and the payment of amounts withheld under section 290.92, subdivisions 4b and 4c, are considered filing and payment corporate tax rather than withholding tax.\nIf a person fails to report to the commissioner a change or correction of the person's federal return in the manner and time prescribed in sections 289A.38, subdivision 7, and 289A.382, there must be added to the tax an amount equal to ten percent of the amount of any underpayment of Minnesota tax attributable to the federal change.\nA person who fails to report local taxes required to be reported on a sales and use tax return or who fails to report local taxes on separate tax lines on the sales and use tax return is subject to a penalty of five percent of the amount of tax not properly reported on the return. A person who files a consolidated tax return but fails to report location information is subject to a $500 penalty for each return not containing location information. In addition, the commissioner may revoke the privilege for a taxpayer to file consolidated returns and may require the taxpayer to separately register each location and to file a tax return for each location.\n(a) For purposes of this subdivision, \"material advisor\" has the meaning given it under section 6111(b)(1) of the Internal Revenue Code.\n(b) The penalties in this subdivision apply in connection with the use of tax shelters, as defined under section 289A.121, and the definitions under that section apply for the purposes of this subdivision.\n(c) A material advisor who fails to register a tax shelter, including providing all of the required information under section 289A.121, on or before the date prescribed or who files false or incomplete information with respect to the transaction is subject to a penalty of $50,000. If the tax shelter is a listed transaction, a penalty applies equal to the greater of:\n(1) $200,000;\n(2) 50 percent of the gross income that the material advisor derived from that activity; or\n(3) 75 percent of the gross income that the material advisor derived from that activity if the material advisor intentionally failed to act.\n(d)(1) Any person who fails to include on a return or statement any information with respect to a reportable transaction as required under section 289A.121 is subject to a penalty equal to:\n(i) $10,000 in the case of an individual and $50,000 in any other case; or\n(ii) with respect to a listed transaction, $100,000 in the case of an individual and $200,000 in any other case.\n(2) For a unitary business in which more than one member fails to include information on its return or statement for the same reportable transaction, the penalty under clause (1) for each additional member that fails to include the required information on its return or statement for the reportable transaction is limited to the following amount:\n(i) $500 for each member, subject to a maximum additional penalty of $25,000; and\n(ii) with respect to a listed transaction, $1,000 for each member, subject to a maximum additional penalty of $100,000.\n(e) A material advisor required to maintain or provide a list under section 289A.121, subdivision 6, is subject to a penalty equal to $10,000 for each day after the 20th day that the material advisor failed to make the list available to the commissioner after written request for that list was made. No penalty applies for a failure on any day if the failure is due to reasonable cause.\n(f) The penalty imposed by this subdivision is in addition to any other penalty imposed under this section.\n(g) Notwithstanding section 270C.34, the commissioner may abate all or any portion of any penalty imposed by paragraphs (c) and (d) for any violation, only if all of the following apply:\n(1) the violation is for a reportable transaction, other than a listed transaction; and\n(2) abating the penalty would promote compliance with the requirements of chapter 290.\n(h) Notwithstanding any other law or rule, a determination under paragraph (g) may not be reviewed in any judicial proceeding.\n(a) If a taxpayer has a reportable transaction understatement for any taxable year, an amount equal to 20 percent of the amount of the reportable transaction understatement must be added to the tax.\n(b)(1) For purposes of this subdivision, \"reportable transaction understatement\" means the product of:\n(i) the amount of the increase, if any, in taxable income that results from a difference between the proper tax treatment of an item to which this section applies and the taxpayer's treatment of that item as shown on the taxpayer's tax return; and\n(ii) the highest rate of tax imposed on the taxpayer under section 290.06 determined without regard to the understatement.\n(2) For purposes of clause (1)(i), any reduction of the excess of deductions allowed for the taxable year over gross income for that year, and any reduction in the amount of capital losses which would, without regard to section 1211 of the Internal Revenue Code, be allowed for that year, must be treated as an increase in taxable income.\n(c) This subdivision applies to any item that is attributable to:\n(1) any listed transaction under section 289A.121; and\n(2) any reportable transaction, other than a listed transaction, if a significant purpose of that transaction is the avoidance or evasion of federal income tax liability.\n(d) Paragraph (a) applies by substituting \"30 percent\" for \"20 percent\" with respect to the portion of any reportable transaction understatement with respect to which the disclosure requirements of section 289A.121, subdivision 5, and section 6664(d)(2)(A) of the Internal Revenue Code are not met.\n(e)(1) No penalty applies under this subdivision with respect to any portion of a reportable transaction understatement if the taxpayer shows that there was reasonable cause for the portion and that the taxpayer acted in good faith with respect to the portion. This paragraph applies only if:\n(i) the relevant facts affecting the tax treatment of the item are adequately disclosed as required under section 289A.121;\n(ii) there is or was substantial authority for the treatment; and\n(iii) the taxpayer reasonably believed that the treatment was more likely than not the proper treatment.\n(2) A taxpayer who did not adequately disclose under section 289A.121 meets the requirements of clause (1)(i), if the commissioner abates the penalty imposed by subdivision 26, paragraph (d), under subdivision 26, paragraph (g).\n(3) For purposes of clause (1)(iii), a taxpayer is treated as having a reasonable belief with respect to the tax treatment of an item only if the belief:\n(i) is based on the facts and law that exist when the return of tax which includes the tax treatment is filed; and\n(ii) relates solely to the taxpayer's chances of success on the merits of the treatment and does not take into account the possibility that a return will not be audited, the treatment will not be raised on audit, or the treatment will be resolved through settlement if it is raised.\n(4) An opinion of a tax advisor may not be relied upon to establish the reasonable belief of a taxpayer if:\n(i) the tax advisor:\n(A) is a material advisor, as defined in section 289A.121, and participates in the organization, management, promotion, or sale of the transaction or is related (within the meaning of section 267(b) or 707(b)(1) of the Internal Revenue Code) to any person who so participates;\n(B) is compensated directly or indirectly by a material advisor with respect to the transaction;\n(C) has a fee arrangement with respect to the transaction which is contingent on all or part of the intended tax benefits from the transaction being sustained; or\n(D) has a disqualifying financial interest with respect to the transaction, as determined under United States Treasury regulations prescribed to implement the provisions of section 6664(d)(3)(B)(ii)(IV) of the Internal Revenue Code; or\n(ii) the opinion:\n(A) is based on unreasonable factual or legal assumptions, including assumptions as to future events;\n(B) unreasonably relies on representations, statements, findings, or agreements of the taxpayer or any other person;\n(C) does not identify and consider all relevant facts; or\n(D) fails to meet any other requirement as the Secretary of the Treasury may prescribe under federal law.\n(f) The penalty imposed by this subdivision applies in lieu of the penalty imposed under subdivision 4.\n(a) Each of the following that is prepared by a tax preparer must include the tax preparer's tax identification number:\n(1) a tax return required to be filed under this chapter;\n(2) a claim filed under section 290.0677, subdivision 1, or chapter 290A; and\n(3) a claim for refund of an overpayment.\n(b) A tax preparer is not required to include their preparer tax identification number on a filing if the number is not required in the forms or filing requirements provided by the commissioner.\n(c) A tax preparer who fails to include the preparer tax identification number as required by this section is subject to a penalty of $50 for each failure.\n(d) A tax preparer who fails to include the preparer tax identification number as required by this section, and who is required to have a valid preparer tax identification number issued under section 6109(a)(4) of the Internal Revenue Code, but does not have one, is subject to a $500 penalty for each failure. A tax preparer subject to the penalty in this paragraph is not subject to the penalty in paragraph (c).\n(e) For the purposes of this subdivision, \"tax preparer\" has the meaning given in section 270C.445, subdivision 2, paragraph (h), and \"preparer tax identification number\" means the number the tax preparer is required to use federally under section 6109(a)(4) of the Internal Revenue Code.\nIn the case of a failure to file an informational report required by section 297A.8155 with the commissioner on or before the date prescribed, the person failing to file the report shall pay a penalty of $500 for each failure. If a failure to file a report is intentional, the penalty shall be $1,000 for each failure.\nA purchaser that meets the requirements of section 297A.995, subdivision 11, is relieved from the imposition of penalty.\n[Repealed, 2013 c 143 art 16 s 11]\n(a) A person who:\n(1) sells;\n(2) transfers;\n(3) develops;\n(4) manufactures; or\n(5) possesses with the intent to sell or transfer\nan automated sales suppression device, zapper, phantom-ware, or similar device capable of being used to commit tax fraud or suppress sales is liable for a civil penalty calculated under paragraph (b).\n(b) The amount of the civil penalty equals the greater of (1) $2,000, or (2) the total amount of all taxes and penalties due that are attributable to the use of any automated sales suppression device, zapper, phantom-ware, or similar device facilitated by the sale, transfer, development, or manufacture of the automated sales suppression device, zapper, phantom-ware, or similar device by the person.\n(c) The definitions in section 289A.14 apply to this subdivision.\n(d) This subdivision does not apply to the commissioner, a person acting at the direction of the commissioner, an agent of the commissioner, law enforcement agencies, or postsecondary education institutions that possess an automated sales suppression device, zapper, or phantom-ware for study to combat the evasion of taxes by use of the automated sales suppression devices, zappers, or phantom-ware.",
	"repealed": false
}