{
	"id": "72A.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.201",
	"title": "72A.201 REGULATION OF CLAIMS PRACTICES.",
	"text": "The commissioner may, in accordance with chapter 14, adopt rules to ensure the prompt, fair, and honest processing of claims and complaints. The commissioner may, in accordance with sections 72A.22 to 72A.25, seek and impose appropriate administrative remedies, including fines, for (1) a violation of this section or the rules adopted pursuant to this section; or (2) a violation of section 72A.20, subdivision 12. The commissioner need not show a general business practice in taking an administrative action for these violations.\nNo individual violation constitutes an unfair, discriminatory, or unlawful practice in business, commerce, or trade for purposes of section 8.31.\nThe policy of the Department of Commerce, in interpreting and enforcing this section, will be to take into consideration all pertinent facts and circumstances in determining the severity and appropriateness of the action to be taken in regard to any violation of this section.\nThe magnitude of the harm to the claimant or insured, and any actions by the insured, claimant, or insurer that mitigate or exacerbate the impact of the violation may be considered.\nActions of the claimant or insured which impeded the insurer in processing or settling the claim, and actions of the insurer which increased the detriment to the claimant or insured may also be considered in determining the appropriate administrative action to be taken.\nFor the purposes of this section, the following terms have the meanings given them.\n(1) Adjuster or adjusters. \"Adjuster\" or \"adjusters\" is as defined in section 72B.02.\n(2) Agent. \"Agent\" means insurance agents or insurance agencies licensed pursuant to sections 60K.30 to 60K.56, and representatives of these agents or agencies.\n(3) Claim. \"Claim\" means a request or demand made with an insurer for the payment of funds or the provision of services under the terms of any policy, certificate, contract of insurance, binder, or other contracts of temporary insurance. The term does not include a claim under a health insurance policy made by a participating provider with an insurer in accordance with the participating provider's service agreement with the insurer which has been filed with the commissioner of commerce prior to its use.\n(4) Claim settlement. \"Claim settlement\" means all activities of an insurer related directly or indirectly to the determination of the extent of liabilities due or potentially due under coverages afforded by the policy, and which result in claim payment, claim acceptance, compromise, or other disposition.\n(5) Claimant. \"Claimant\" means any individual, corporation, association, partnership, or other legal entity asserting a claim against any individual, corporation, association, partnership, or other legal entity which is insured under an insurance policy or insurance contract of an insurer.\n(6) Complaint. \"Complaint\" means a communication primarily expressing a grievance.\n(7) Insurance policy. \"Insurance policy\" means any evidence of coverage issued by an insurer including all policies, contracts, certificates, riders, binders, and endorsements which provide or describe coverage. The term includes any contract issuing coverage under a self-insurance plan, group self-insurance plan, or joint self-insurance employee health plans.\n(8) Insured. \"Insured\" means an individual, corporation, association, partnership, or other legal entity asserting a right to payment under their insurance policy or insurance contract arising out of the occurrence of the contingency or loss covered by the policy or contract. The term does not apply to a person who acquires rights under a mortgage.\n(9) Insurer. \"Insurer\" includes any individual, corporation, association, partnership, reciprocal exchange, Lloyds, fraternal benefits society, self-insurer, surplus line insurer, self-insurance administrator, and nonprofit service plans under the jurisdiction of the Department of Commerce.\n(10) Investigation. \"Investigation\" means a reasonable procedure adopted by an insurer to determine whether to accept or reject a claim.\n(11) Notification of claim. \"Notification of claim\" means any communication to an insurer by a claimant or an insured which reasonably apprises the insurer of a claim brought under an insurance contract or policy issued by the insurer. Notification of claim to an agent of the insurer is notice to the insurer.\n(12) Proof of loss. \"Proof of loss\" means the necessary documentation required from the insured to establish entitlement to payment under a policy.\n(13) Self-insurance administrator. \"Self-insurance administrator\" means any vendor of risk management services or entities administering self-insurance plans, licensed pursuant to section 60A.23, subdivision 8.\n(14) Self-insured or self-insurer. \"Self-insured\" or \"self-insurer\" means any entity authorized pursuant to section 65B.48, subdivision 3; chapter 62H; section 176.181, subdivision 2; Laws of Minnesota 1983, chapter 290, section 171; section 471.617; or section 471.981 and includes any entity which, for a fee, employs the services of vendors of risk management services in the administration of a self-insurance plan as defined by section 60A.23, subdivision 8, clause (2), subclauses (a) and (d).\nThe following acts by an insurer, an adjuster, a self-insured, or a self-insurance administrator constitute unfair settlement practices:\n(1) except for claims made under a health insurance policy, after receiving notification of claim from an insured or a claimant, failing to acknowledge receipt of the notification of the claim within ten business days, and failing to promptly provide all necessary claim forms and instructions to process the claim, unless the claim is settled within ten business days. The acknowledgment must include the telephone number of the company representative who can assist the insured or the claimant in providing information and assistance that is reasonable so that the insured or claimant can comply with the policy conditions and the insurer's reasonable requirements. If an acknowledgment is made by means other than writing, an appropriate notation of the acknowledgment must be made in the claim file of the insurer and dated. An appropriate notation must include at least the following information where the acknowledgment is by telephone or oral contact:\n(i) the telephone number called, if any;\n(ii) the name of the person making the telephone call or oral contact;\n(iii) the name of the person who actually received the telephone call or oral contact;\n(iv) the time of the telephone call or oral contact; and\n(v) the date of the telephone call or oral contact;\n(2) failing to reply, within ten business days of receipt, to all other communications about a claim from an insured or a claimant that reasonably indicate a response is requested or needed;\n(3)(i) unless provided otherwise by clause (ii) or (iii), other law, or in the policy, failing to complete its investigation and inform the insured or claimant of acceptance or denial of a claim within 30 business days after receipt of notification of claim unless the investigation cannot be reasonably completed within that time. In the event that the investigation cannot reasonably be completed within that time, the insurer shall notify the insured or claimant within the time period of the reasons why the investigation is not complete and the expected date the investigation will be complete. For claims made under a health policy the notification of claim must be in writing;\n(ii) for claims submitted under a health policy, the insurer must comply with all of the requirements of section 62Q.75;\n(iii) for claims submitted under a health policy that are accepted, the insurer must notify the insured or claimant no less than semiannually of the disposition of claims of the insured or claimant. Notwithstanding the requirements of section 72A.20, subdivision 37, this notification requirement is satisfied if the information related to the acceptance of the claim is made accessible to the insured or claimant on a secured website maintained by the insurer. For purposes of this clause, acceptance of a claim means that there is no additional financial liability for the insured or claimant, either because there is a flat co-payment amount specified in the health plan or because there is no co-payment, deductible, or coinsurance owed;\n(4) where evidence of suspected fraud is present, the requirement to disclose their reasons for failure to complete the investigation within the time period set forth in clause (3) need not be specific. The insurer must make this evidence available to the Department of Commerce if requested;\n(5) failing to notify an insured who has made a notification of claim of all available benefits or coverages which the insured may be eligible to receive under the terms of a policy and of the documentation which the insured must supply in order to ascertain eligibility;\n(6) unless otherwise provided by law or in the policy, requiring an insured to give written notice of loss or proof of loss within a specified time, and thereafter seeking to relieve the insurer of its obligations if the time limit is not complied with, unless the failure to comply with the time limit prejudices the insurer's rights and then only if the insurer gave prior notice to the insured of the potential prejudice;\n(7) advising an insured or a claimant not to obtain the services of an attorney or an adjuster, or representing that payment will be delayed if an attorney or an adjuster is retained by the insured or the claimant;\n(8) failing to advise in writing an insured or claimant who has filed a notification of claim known to be unresolved, and who has not retained an attorney, of the expiration of a statute of limitations at least 60 days prior to that expiration. For the purposes of this clause, any claim on which the insurer has received no communication from the insured or claimant for a period of two years preceding the expiration of the applicable statute of limitations shall not be considered to be known to be unresolved and notice need not be sent pursuant to this clause;\n(9) demanding information which would not affect the settlement of the claim;\n(10) unless expressly permitted by law or the policy, refusing to settle a claim of an insured on the basis that the responsibility should be assumed by others;\n(11) failing, within 60 business days after receipt of a properly executed proof of loss, to advise the insured of the acceptance or denial of the claim by the insurer. No insurer shall deny a claim on the grounds of a specific policy provision, condition, or exclusion unless reference to the provision, condition, or exclusion is included in the denial. The denial must be given to the insured in writing with a copy filed in the claim file;\n(12) denying or reducing a claim on the basis of an application which was altered or falsified by the agent or insurer without the knowledge of the insured;\n(13) failing to notify the insured of the existence of the additional living expense coverage when an insured under a homeowners policy sustains a loss by reason of a covered occurrence and the damage to the dwelling is such that it is not habitable;\n(14) failing to inform an insured or a claimant that the insurer will pay for an estimate of repair if the insurer requested the estimate and the insured or claimant had previously submitted two estimates of repair.\nIf a policy of accident and sickness insurance or a subscriber contract requires preauthorization approval for any nonemergency services or benefits, the decision to approve or disapprove the requested services or benefits must be processed in accordance with section 62M.07.\nThe following acts by an insurer, an adjuster, a self-insured, or a self-insurance administrator constitute unfair settlement practices:\n(1) making any partial or final payment, settlement, or offer of settlement, which does not include an explanation of what the payment, settlement, or offer of settlement is for;\n(2) making an offer to an insured of partial or total settlement of one part of a claim contingent upon agreement to settle another part of the claim;\n(3) refusing to pay one or more elements of a claim by an insured for which there is no good faith dispute;\n(4) threatening cancellation, rescission, or nonrenewal of a policy as an inducement to settlement of a claim;\n(5) notwithstanding any inconsistent provision of section 65A.01, subdivision 3, failing to issue payment for any amount finally agreed upon in settlement of all or part of any claim within five business days from the receipt of the agreement by the insurer or from the date of the performance by the claimant of any conditions set by such agreement, whichever is later;\n(6) failing to inform the insured of the policy provision or provisions under which payment is made;\n(7) settling or attempting to settle a claim or part of a claim with an insured under actual cash value provisions for less than the value of the property immediately preceding the loss, including all applicable taxes and license fees. In no case may an insurer be required to pay an amount greater than the amount of insurance;\n(8) except where limited by policy provisions, settling or offering to settle a claim or part of a claim with an insured under replacement value provisions for less than the sum necessary to replace the damaged item with one of like kind and quality, including all applicable taxes, license, and transfer fees;\n(9) reducing or attempting to reduce for depreciation any settlement or any offer of settlement for items not adversely affected by age, use, or obsolescence;\n(10) reducing or attempting to reduce for betterment any settlement or any offer of settlement unless the resale value of the item has increased over the preloss value by the repair of the damage.\nIn addition to the acts specified in subdivisions 4, 5, 7, 8, and 9, the following acts by an insurer, adjuster, or a self-insured or self-insurance administrator constitute unfair settlement practices:\n(1) if an automobile insurance policy provides for the adjustment and settlement of an automobile total loss on the basis of actual cash value or replacement with like kind and quality and the insured is not an automobile dealer, failing to offer one of the following methods of settlement:\n(a) comparable and available replacement automobile, with all applicable taxes, license fees, at least pro rata for the unexpired term of the replaced automobile's license, and other fees incident to the transfer or evidence of ownership of the automobile paid, at no cost to the insured other than the deductible amount as provided in the policy;\n(b) a cash settlement based upon the actual cost of purchase of a comparable automobile, including all applicable taxes, license fees, at least pro rata for the unexpired term of the replaced automobile's license, and other fees incident to transfer of evidence of ownership, less the deductible amount as provided in the policy. The costs must be determined by:\n(i) the cost of a comparable automobile, adjusted for mileage, condition, and options, in the local market area of the insured, if such an automobile is available in that area; or\n(ii) one of two or more quotations obtained from two or more qualified sources located within the local market area when a comparable automobile is not available in the local market area. The insured shall be provided the information contained in all quotations prior to settlement; or\n(iii) any settlement or offer of settlement which deviates from the procedure above must be documented and justified in detail. The basis for the settlement or offer of settlement must be explained to the insured;\n(2) if an automobile insurance policy provides for the adjustment and settlement of an automobile partial loss on the basis of repair or replacement with like kind and quality and the insured is not an automobile dealer, failing to offer one of the following methods of settlement:\n(a) to assume all costs, including reasonable towing costs, for the satisfactory repair of the motor vehicle. Satisfactory repair includes repair of both obvious and hidden damage as caused by the claim incident. This assumption of cost may be reduced by applicable policy provision; or\n(b) to offer a cash settlement sufficient to pay for satisfactory repair of the vehicle. Satisfactory repair includes repair of obvious and hidden damage caused by the claim incident, and includes reasonable towing costs;\n(3) regardless of whether the loss was total or partial, in the event that a damaged vehicle of an insured cannot be safely driven, failing to exercise the right to inspect automobile damage prior to repair within five business days following receipt of notification of claim. In other cases the inspection must be made in 15 days;\n(4) regardless of whether the loss was total or partial, requiring unreasonable travel of a claimant or insured to inspect a replacement automobile, to obtain a repair estimate, to allow an insurer to inspect a repair estimate, to allow an insurer to inspect repairs made pursuant to policy requirements, or to have the automobile repaired;\n(5) regardless of whether the loss was total or partial, if loss of use coverage exists under the insurance policy, failing to notify an insured at the time of the insurer's acknowledgment of claim, or sooner if inquiry is made, of the fact of the coverage, including the policy terms and conditions affecting the coverage and the manner in which the insured can apply for this coverage;\n(6) regardless of whether the loss was total or partial, failing to include the insured's deductible in the insurer's demands under its subrogation rights. Subrogation recovery must be shared at least on a proportionate basis with the insured, unless the deductible amount has been otherwise recovered by the insured, except that when an insurer is recovering directly from an uninsured third party by means of installments, the insured must receive the full deductible share as soon as that amount is collected and before any part of the total recovery is applied to any other use. No deduction for expenses may be made from the deductible recovery unless an attorney is retained to collect the recovery, in which case deduction may be made only for a pro rata share of the cost of retaining the attorney. An insured is not bound by any settlement of its insurer's subrogation claim with respect to the deductible amount, unless the insured receives, as a result of the subrogation settlement, the full amount of the deductible. Recovery by the insurer and receipt by the insured of less than all of the insured's deductible amount does not affect the insured's rights to recover any unreimbursed portion of the deductible from parties liable for the loss;\n(7) requiring as a condition of payment of a claim that repairs to any damaged vehicle must be made by a particular contractor or repair shop or that parts, other than window glass, must be replaced with parts other than original equipment parts or engaging in any act or practice of intimidation, coercion, threat, incentive, or inducement for or against an insured to use a particular contractor or repair shop. Consumer benefits included within preferred vendor programs must not be considered an incentive or inducement. At the time a claim is reported, the insurer must provide the following advisory to the insured or claimant:\n\"You have the legal right to choose a repair shop to fix your vehicle. Your policy will cover the reasonable costs of repairing your vehicle to its pre-accident condition no matter where you have repairs made. Have you selected a repair shop or would you like a referral?\"\nAfter an insured has indicated that the insured has selected a repair shop, the insurer must cease all efforts to influence the insured's or claimant's choice of repair shop;\n(8) where liability is reasonably clear, failing to inform the claimant in an automobile property damage liability claim that the claimant may have a claim for loss of use of the vehicle;\n(9) failing to make a good faith assignment of comparative negligence percentages in ascertaining the issue of liability;\n(10) failing to pay any interest required by statute on overdue payment for an automobile personal injury protection claim;\n(11) if an automobile insurance policy contains either or both of the time limitation provisions as permitted by section 65B.55, subdivisions 1 and 2, failing to notify the insured in writing of those limitations at least 60 days prior to the expiration of that time limitation;\n(12) if an insurer chooses to have an insured examined as permitted by section 65B.56, subdivision 1, failing to notify the insured of all of the insured's rights and obligations under that statute, including the right to request, in writing, and to receive a copy of the report of the examination;\n(13) failing to provide, to an insured who has submitted a claim for benefits described in section 65B.44, a complete copy of the insurer's claim file on the insured, excluding internal company memoranda, all materials that relate to any insurance fraud investigation, materials that constitute attorney work product or that qualify for the attorney-client privilege, and medical reviews that are subject to section 145.64, within ten business days of receiving a written request from the insured. The insurer may charge the insured a reasonable copying fee. This clause supersedes any inconsistent provisions of sections 72A.49 to 72A.505;\n(14) if an automobile policy provides for the adjustment or settlement of an automobile loss due to damaged window glass, failing to provide payment to the insured's chosen vendor based on a competitive price that is fair and reasonable within the local industry at large.\nWhere facts establish that a different rate in a specific geographic area actually served by the vendor is required by that market, that geographic area must be considered. This clause does not prohibit an insurer from recommending a vendor to the insured or from agreeing with a vendor to perform work at an agreed-upon price, provided, however, that before recommending a vendor, the insurer shall offer its insured the opportunity to choose the vendor. If the insurer recommends a vendor, the insurer must also provide the following advisory:\n\"Minnesota law gives you the right to go to any glass vendor you choose, and prohibits me from pressuring you to choose a particular vendor.\";\n(15) requiring that the repair or replacement of motor vehicle glass and related products and services be made in a particular place or shop or by a particular entity, or by otherwise limiting the ability of the insured to select the place, shop, or entity to repair or replace the motor vehicle glass and related products and services;\n(16) engaging in any act or practice of intimidation, coercion, threat, incentive, or inducement for or against an insured to use a particular company or location to provide the motor vehicle glass repair or replacement services or products. For purposes of this section, a warranty shall not be considered an inducement or incentive; or\n(17) failing to inform an insured making a claim under collision or comprehensive coverage, that includes rental vehicle reimbursement coverage, of the insured's right to select any rental vehicle company. If the insurer recommends a rental vehicle company to the insured, the insurer must also provide the following advisory: \"Minnesota law gives you the right to choose any rental vehicle company, and prohibits me from requiring you to choose a particular vendor.\"\nThe following acts by an insurer, adjuster, or self-insured or self-insurance administrator constitute unfair settlement practices:\n(1) requesting or requiring an insured or a claimant to sign a release that extends beyond the subject matter that gave rise to the claim payment;\n(2) issuing a check or draft in payment of a claim that contains any language or provision that implies or states that acceptance of the check or draft constitutes a final settlement or release of any or all future obligations arising out of the loss.\nThe following acts by an insurer, adjuster, or self-insured, or self-insurance administrator constitute unfair settlement practices:\n(1) denying a claim or any element of a claim on the grounds of a specific policy provision, condition, or exclusion, without informing the insured of the policy provision, condition, or exclusion on which the denial is based;\n(2) denying a claim without having made a reasonable investigation of the claim;\n(3) denying a liability claim because the insured has requested that the claim be denied;\n(4) denying a liability claim because the insured has failed or refused to report the claim, unless an independent evaluation of available information indicates there is no liability;\n(5) denying a claim without including the following information:\n(i) the basis for the denial;\n(ii) the name, address, and telephone number of the insurer's claim service office or the claim representative of the insurer to whom the insured or claimant may take any questions or complaints about the denial;\n(iii) the claim number and the policy number of the insured; and\n(iv) if the denied claim is a fire claim, the insured's right to file with the Department of Commerce a complaint regarding the denial, and the address and telephone number of the Department of Commerce;\n(6) denying a claim because the insured or claimant failed to exhibit the damaged property unless:\n(i) the insurer, within a reasonable time period, made a written demand upon the insured or claimant to exhibit the property; and\n(ii) the demand was reasonable under the circumstances in which it was made;\n(7) denying a claim by an insured or claimant based on the evaluation of a chemical dependency claim reviewer selected by the insurer unless the reviewer meets the qualifications specified under subdivision 8a. An insurer that selects chemical dependency reviewers to conduct claim evaluations must annually file with the commissioner of commerce a report containing the specific evaluation standards and criteria used in these evaluations. The report must be filed at the same time its annual statement is submitted under section 60A.13.\n(a) The personnel file of a chemical dependency claim reviewer must include documentation of the individual's competency in the following areas:\n(1) knowledge of chemical abuse and dependency;\n(2) chemical use assessment, including client interviewing and screening;\n(3) case management, including treatment planning, general knowledge of social services, and appropriate referrals, and record keeping, reporting requirements, and confidentiality rules and regulations that apply to chemical dependency clients; and\n(4) individual and group counseling, including crisis intervention.\n(b) The insurer may accept one of the following as adequate documentation that a chemical dependency claim reviewer is competent in the areas required under paragraph (a):\n(1) the individual has at least a baccalaureate degree with a major or concentration in social work, nursing, sociology, human services, or psychology, is a licensed registered nurse, or is a licensed physician; has successfully completed 30 hours of classroom instruction in each of the areas identified in paragraph (a), clauses (1) and (2); and has successfully completed 480 hours of supervised experience as a chemical dependency counselor, either as a student or as an employee; or\n(2) the individual has documented the successful completion of the following:\n(i) 60 hours of classroom training in the subject area identified in paragraph (a), clause (1);\n(ii) 30 hours of classroom training in the subject area identified in paragraph (a), clause (2);\n(iii) 160 hours of classroom training in the subject areas identified in paragraph (a), clauses (3) and (4); and\n(iv) completion of 480 hours of supervised experience as a chemical dependency counselor, either as a student or as an employee; or\n(3) the individual is certified by the Institute for Chemical Dependency Professionals of Minnesota, Inc., as a chemical dependency counselor or as a chemical dependency counselor reciprocal, through the evaluation process established by the Certification Reciprocity Consortium Alcohol and Other Drug Abuse, Inc., and published in the Case Presentation Method Trainer's Manual, copyright 1986;\n(4) the individual successfully completed three years of supervised work experience as a chemical dependency counselor before January 1, 1988; or\n(5) the individual is a licensed physician, who has 480 hours of experience in a licensed chemical dependency program.\nAfter January 1, 1993, chemical dependency counselors must document that they meet the requirements of clause (1), (2), or (3) in order to comply with this paragraph.\nIn addition to the acts specified elsewhere in this section and section 72A.20, the following acts by an insurer, adjuster, or a self-insured or self-insurance administrator constitute unfair settlement practices:\n(1) failure to respond, within 15 working days after receipt of an inquiry from the commissioner, about a claim, to the commissioner;\n(2) failure, upon request by the commissioner, to make specific claim files available to the commissioner;\n(3) failure to include in the claim file all written communications and transactions emanating from, or received by, the insurer, as well as all notes and work papers relating to the claim. All written communications and notes referring to verbal communications must be dated by the insurer;\n(4) failure to submit to the commissioner, when requested, any summary of complaint data reasonably required;\n(5) failure to compile and maintain a file on all complaints. If the complaint deals with a loss, the file must contain adequate information so as to permit easy retrieval of the entire file. If the complaint alleges that the company, or agent of the company, or any agent producing business written by the company is engaged in any unfair, false, misleading, dishonest, fraudulent, untrustworthy, coercive, or financially irresponsible practice, or has violated any insurance law or rule, the file must indicate what investigation or action was taken by the company. The complaint file must be maintained for at least four years after the date of the complaint.\nFor purposes of clause (1) the term insurer includes an agent of the insurer. The insurer must have been sent a copy of any communication to an agent to be held in violation of this provision.\nThis section does not apply to workers' compensation insurance. Nothing in this section abrogates any policy provisions.\nAn insurer must disclose the coverage and limits of an insurance policy within 30 days after the information is requested in writing by a claimant.\nIf a judgment is entered against an insured, the principal amount of which is within the applicable policy limits, the insurer is responsible for their insured's share of the costs, disbursements, and prejudgment interest, as determined under section 549.09, included in the judgment even if the total amount of the judgment is in excess of the applicable policy limits.\n(a) No insurer or community integrated service network shall intentionally provide a health care provider with an explanation of benefits or similar document claiming a right to a discounted fee, price, or other charge, when the insurer or community integrated service network does not have an agreement with the provider for the discount with respect to the patient involved.\n(b) The insurer or community integrated service network may, notwithstanding paragraph (a), claim the right to a discount based upon a discount agreement between the health care provider and another entity, but only if:\n(1) that agreement expressly permitted the entity to assign its right to receive the discount;\n(2) an assignment to the insurer or community integrated service network of the right to receive the discount complies with any relevant requirements for assignments contained in the discount agreement; and\n(3) the insurer or community integrated service network has complied with any relevant requirements contained in the assignment.\n(c) When an explanation of benefits or similar document claims a discount permitted under paragraph (b), it shall prominently state that the discount claimed is based upon an assignment and shall state the name of the entity from whom the assignment was received. This paragraph does not apply if the entity that issues the explanation of benefits or similar document has a provider agreement with the provider.\n(d) No insurer or community integrated service network that has entered into an agreement with a health care provider that involves discounted fees, prices, or other charges shall disclose the discounts to another entity, with the knowledge or expectation that the disclosure will result in claims for discounts prohibited under paragraphs (a) and (b).\nClaims for medical expenses under a property and casualty insurance policy subject to the uniform electronic transaction standards required by section 62J.536 shall be submitted to an insurer by a health care provider subject to that section pursuant to the uniform electronic transaction standards and rules promulgated under that section. The exchange of information related to such claims pursuant to the electronic transaction standards by an insurer shall not be the sole basis for a finding that the insurer is not in compliance with the requirements of this section, section 72A.20, and any rules promulgated under these sections.",
	"repealed": false
}