{
	"id": "302A.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.241",
	"title": "302A.241 COMMITTEES.",
	"text": "A resolution approved by the affirmative vote of a majority of the directors currently holding office may establish committees having the authority of the board in the management of the business of the corporation only to the extent provided in the resolution. Committees may include a special litigation committee consisting of one or more independent directors or other independent persons to consider legal rights or remedies of the corporation and whether those rights and remedies should be pursued. Committees other than special litigation committees and committees formed pursuant to section 302A.673, subdivision 1, paragraph (d), are subject at all times to the direction and control of the board.\nCommittee members shall be natural persons. Unless the articles or bylaws provide for a different membership or manner of appointment, a committee shall consist of one or more persons, who need not be directors, appointed by affirmative vote of a majority of the directors present.\nUnless otherwise provided in the articles, the bylaws, or the resolution of the board establishing the committee, a committee may create one or more subcommittees, each consisting of one or more members of the committee, and may delegate to a subcommittee any or all of the authority of the committee. In this chapter, unless the language or context clearly indicates that a different meaning is intended, any reference to a committee is deemed to include a subcommittee, and any reference to a committee member is deemed to include a subcommittee member.\n[Repealed, 1982 c 497 s 73]\nSections 302A.231 to 302A.239 apply to committees and members of committees to the same extent as those sections apply to the board and directors.\nMinutes, if any, of committee meetings shall be made available upon request to members of the committee and to any director.\nThe establishment of, delegation of authority to, and action by a committee does not alone constitute compliance by a director with the standard of conduct set forth in section 302A.251.\nCommittee members are deemed to be directors for purposes of sections 302A.251, 302A.255, and 302A.521.",
	"repealed": false
}