{
	"id": "514.945",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.945",
	"title": "514.945 AGRICULTURAL PRODUCER'S LIEN.",
	"text": "(a) A person who produces an agricultural commodity as defined in section 17.90, subdivision 2, except grain as defined in section 232.21, subdivision 7, and raw milk has a lien for the contract price or, if there is no contract the fair market value, of the agricultural commodity produced by the person and delivered to a buyer. The lien attaches to the agricultural commodity and products and proceeds of the agricultural commodity.\n(b) If the agricultural commodity is or becomes commingled with other agricultural commodities or goods, the lien continues in the proportionate share of the other agricultural commodities or goods.\n(c) If an agricultural commodity to which the lien attaches becomes manufactured or processed to become part of another product, the lien continues and attaches to the product manufactured or processed.\n(d) An agricultural producer's lien does not attach to agricultural commodities:\n(1) purchased by a marketing cooperative association; or\n(2) purchased free of a security interest or lien as provided in United States Code, title 7, section 1631, and sections 336A.01 to 336A.16.\nAn agricultural producer's lien is perfected from the time the agricultural commodity is delivered until 20 days after the agricultural commodity is delivered without filing. An agricultural producer's lien may continue to be perfected if a lien statement under subdivision 3 is filed in the appropriate filing office under section 336.9-501 by 20 days after the agricultural commodity is delivered.\n(a) A lien statement must be in writing and verified by the producer and must contain:\n(1) a statement of the amount due for the agricultural commodity after deducting applicable credits and offsets;\n(2) the name of the purchaser to whom the agricultural commodity was delivered;\n(3) a description sufficient to identify the agricultural commodity delivered and subject to the lien;\n(4) the date and location to which the agricultural commodity was delivered; and\n(5) the date when payment was due for the agricultural commodity subject to the lien.\n(b) A lien statement is void and may be removed from the filing system six months after the date of filing. The lien statement may be physically destroyed 30 months after the date of filing.\n(a) An agricultural producer's lien has priority over all other liens and encumbrances in:\n(1) the agricultural commodity;\n(2) proceeds from the agricultural commodity;\n(3) the proportionate share of the agricultural commodities or goods with which the agricultural commodity has been commingled; and\n(4) the products manufactured or processed with the agricultural commodity.\n(b) An agricultural producer's lien that is continuously perfected from the time of delivery has priority over other liens and encumbrances whether they are filed before or after the agricultural producer's lien.\n(c) An agricultural producer's lien that is filed after 20 days after delivery of the agricultural commodity has priority in the order it is filed.\n(d) Priority among perfected agricultural producers' liens is according to the first lien filed.\n(e) An agricultural producer's lien that is not perfected has the priority of an unperfected security interest under sections 336.9-317 and 336.9-322.\nAn agricultural producer's lien is terminated on:\n(1) full payment for the agricultural commodity delivered;\n(2) recovery of the agricultural commodity in kind; or\n(3) the date six months after the agricultural commodity is delivered if an action to enforce the lien has not been commenced.\nThe holder of an agricultural producer's lien may enforce the lien in the manner provided in sections 336.9-601 to 336.9-628, subject to section 550.17. For enforcement of the lien, the lienholder is the secured party and the person receiving the agricultural commodity is the debtor, and each has the respective rights and duties of a secured party and a debtor under sections 336.9-601 to 336.9-628. If a right or duty under sections 336.9-601 to 336.9-628 is contingent upon the existence of express language in a security agreement or may be waived by express language in a security agreement, the requisite language does not exist.\nA lienholder must remove a lien statement from the filing system after the lien is satisfied. If the lienholder does not remove the lien statement, the commissioner shall remove the lien statement upon request of an affected party and providing proof is furnished that the lien has been terminated.\nAn agricultural producer's lien may be brought in district court in a county where the property to which the lien attaches is located or the county where the agricultural commodity was originally delivered. The court shall allow costs including attorney fees to the prevailing party.",
	"repealed": false
}