{
	"id": "30.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/30.49",
	"title": "30.49 WILD RICE LABELING.",
	"text": "Wild rice containing a portion of wild rice that is cultivated and offered for wholesale or retail sale in this state must be plainly and conspicuously labeled as either \"paddy\" or as \"cultivated\" in letters of a size and form prescribed by the commissioner.\n(a)(i) A package containing only 100 percent natural lake or river wild rice that is offered for sale at wholesale or retail sale in this state must be plainly and conspicuously labeled as \"100 percent naturally grown, lake and river wild rice\" in letters of a size and form prescribed by the commissioner. A package of wild rice labeled \"100 percent naturally grown, lake and river wild rice\" must also contain the license number issued under section 84.152 of the last licensed dealer, if any, who handled the wild rice.\n(ii) A package containing only 100 percent natural lake or river wild rice that contains a portion of wild rice grown in Canada and offered for wholesale or retail sale in Minnesota must be plainly and conspicuously labeled as \"Canadian\" wild rice in letters of a size and form prescribed by the commissioner.\n(b) A package that does not contain 100 percent natural lake or river wild rice may not contain a label authorized under paragraph (a).\n(c) A package containing a portion of 100 percent naturally grown lake and river wild rice that is harvested by use of mechanical harvesting devices and that is offered for sale at wholesale or retail in this state must be plainly and conspicuously labeled as \"machine harvested\" in letters of a size and form prescribed by the commissioner. In addition, the letters \"machine harvested\" must be placed near the product's identity on the label. Packages containing 100 percent hand-harvested wild rice may be labeled as \"hand harvested.\"\nA package of cultivated or natural lake or river wild rice offered for sale at wholesale or retail in this state must specify the place of origin of the wild rice by a plain and conspicuous label placed near the product's identity on the label in letters of a size and form prescribed by the commissioner. Only packages containing cultivated or natural lake or river wild rice that is 100 percent grown in Minnesota may be labeled as \"grown in Minnesota.\"\n(a) A person who buys, sells, processes, or markets over 500 pounds of cultivated or natural lake or river wild rice not for use in packaged blended rice and ready-to-eat rice must maintain the following records for a period of three years. A person who buys or sells, processes, or markets cultivated or natural lake or river wild rice not for use in packaged blended rice and ready-to-eat rice shall provide the department, on demand, relevant information from the records required under this section.\n(b) Except for persons who sell or offer cultivated or natural lake or river wild rice for sale at retail, the records must contain:\n(1) the date of each transaction;\n(2) the quantity of wild rice bought or sold;\n(3) an identification of whether the wild rice is cultivated or paddy grown, or, whether it is naturally grown lake and river wild rice and whether it is machine harvested or hand harvested;\n(4) an identification of the place of origin of the wild rice;\n(5) the names and addresses of the parties of the transaction and the Department of Natural Resources license or permit numbers;\n(6) the lot numbers of all the wild rice bought or sold in each transaction; and\n(7) documents that track the rice, by lot number, through processing and the assignment of a final lot number on the finished product offered for distribution or sale in Minnesota.\n(c) The records for persons who sell or offer wild rice for sale at retail must include an invoice indicating:\n(1) the actual name of the product;\n(2) the amount purchased;\n(3) the date of the purchase; and\n(4) the name, address, zip code, and telephone number of the supplier.\nNatural lake and river-harvested wild rice from public waters and cultivated or paddy grown wild rice are separate and distinct ingredients under the fair packaging and labeling provisions of section 31.103.\nFor purposes of this section, the bulk food product module labeling requirements contained in section 31.82 for cultivated or natural lake or river wild rice offered for sale at retail in bulk include the place of origin of the wild rice, and, if the wild rice is 100 percent natural lake or river wild rice and is machine harvested, the letters \"machine harvested.\" The place of origin must be placed near the product's identity in letters of a size and form prescribed by the commissioner. The letters \"machine harvested\" must be placed near the product's identity in letters of a size and form prescribed by the commissioner.\nA wild rice label that implies the wild rice is harvested or processed by Indians is misbranded unless the package contains only 100 percent natural lake or river wild rice harvested by Indians.\nA wild rice label that implies the wild rice is grown within the boundaries of the state of Minnesota is misbranded unless the package contains only 100 percent wild rice grown in Minnesota.\nA package containing a blend of wild rice and at least 40 percent other grains or food products, and ready-to-eat wild rice that is consumed or packaged on the retail premises, are exempt from this section, except subdivisions 3, 5, and 7.\nAny person who sells wild rice at wholesale or retail which is not labeled as required by this section is guilty of a misdemeanor.\nThis section does not apply to cultivated or natural lake or river wild rice sold at wholesale or retail outside this state.",
	"repealed": false
}