{
	"id": "360.068",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.068",
	"title": "360.068 APPEAL OF AIRPORT ZONING DECISION.",
	"text": "Any person aggrieved, or taxpayer affected, by any decision of an administrative agency made in its administration of airport zoning regulations adopted under sections 360.011 to 360.076, or any governing body of a municipality or county, or any joint airport zoning board, which is of the opinion that a decision of such an administrative agency is an improper application of airport zoning regulations of concern to such governing body or board, may appeal to the board of adjustment authorized to hear and decide appeals from the decisions of such administrative agency.\nAll appeals taken under this section must be taken within a reasonable time, as provided by the rules of the board, by filing with the agency from which the appeal is taken and with the board, a notice of appeal specifying the grounds thereof. The agency from which the appeal is taken shall forthwith transmit to the board all the papers constituting the record upon which the action appealed from was taken.\nAn appeal shall stay all proceedings in furtherance of the action appealed from, unless the agency from which the appeal is taken certifies to the board, after the notice of appeal has been filed with it, that by reason of the facts stated in the certificate a stay would, in its opinion, cause imminent peril to life or property. In such cases proceedings shall not be stayed otherwise than by order of the board on notice to the agency from which the appeal is taken and on due cause shown.\nThe board shall fix a reasonable time for the hearing of appeals, give public notice and due notice to the parties in interest, and decide the same within a reasonable time. Upon the hearing any party may appear in person or by agent or by attorney.\nThe board may, in conformity with the provisions of sections 360.011 to 360.076, reverse or affirm wholly or partly, or modify, the order, requirement, decision, or determination appealed from and may make such order, requirement, decision, or determination as ought to be made, and to that end shall have all the powers of the administrative agency from which the appeal is taken.",
	"repealed": false
}