{
	"id": "144A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.01",
	"title": "144A.01 DEFINITIONS.",
	"text": "For the purposes of sections 144A.01 to 144A.27, the terms defined in this section have the meanings given them.\n\"Commissioner of health\" means the state commissioner of health established by section 144.011.\n\"Board of Executives for Long Term Services and Supports\" means the Board of Executives for Long Term Services and Supports established by section 144A.19.\n\"Certified\" means certified for participation as a provider in the Medicare or Medicaid programs under title XVIII or XIX of the Social Security Act.\n(a) \"Controlling person\" means an owner and the following individuals and entities, if applicable:\n(1) each officer of the organization, including the chief executive officer and the chief financial officer;\n(2) the nursing home administrator; and\n(3) any managerial official.\n(b) \"Controlling person\" also means any entity or natural person who has any direct or indirect ownership interest in:\n(1) any corporation, partnership or other business association which is a controlling person;\n(2) the land on which a nursing home is located;\n(3) the structure in which a nursing home is located;\n(4) any entity with at least a five percent mortgage, contract for deed, deed of trust, or other security interest in the land or structure comprising a nursing home; or\n(5) any lease or sublease of the land, structure, or facilities comprising a nursing home.\n(c) \"Controlling person\" does not include:\n(1) a bank, savings bank, trust company, savings association, credit union, industrial loan and thrift company, investment banking firm, or insurance company unless the entity directly or through a subsidiary operates a nursing home;\n(2) government and government-sponsored entities such as the United States Department of Housing and Urban Development, Ginnie Mae, Fannie Mae, Freddie Mac, and the Minnesota Housing Finance Agency which provide loans, financing, and insurance products for housing sites;\n(3) an individual who is a state or federal official, a state or federal employee, or a member or employee of the governing body of a political subdivision of the state or federal government that operates one or more nursing homes, unless the individual is also an officer, owner, or managerial official of the nursing home, receives any remuneration from a nursing home, or who is a controlling person not otherwise excluded in this subdivision;\n(4) a natural person who is a member of a tax-exempt organization under section 290.05, subdivision 2, unless the individual is also a controlling person not otherwise excluded in this subdivision; and\n(5) a natural person who owns less than five percent of the outstanding common shares of a corporation:\n(i) whose securities are exempt by virtue of section 80A.45, clause (6); or\n(ii) whose transactions are exempt by virtue of section 80A.46, clause (7).\n\"Emergency\" means a situation or physical condition that creates or probably will create an immediate and serious threat to a resident's health or safety.\n\"Nursing home\" means a facility or that part of a facility which provides nursing care to five or more persons. \"Nursing home\" does not include a facility or that part of a facility which is a hospital, a hospital with approved swing beds as defined in section 144.562, clinic, doctor's office, diagnostic or treatment center, or a residential program licensed pursuant to sections 245A.01 to 245A.16 or 252.28.\n\"Nursing care\" means health evaluation and treatment of patients and residents who are not in need of an acute care facility but who require nursing supervision on an inpatient basis. The commissioner of health may by rule establish levels of nursing care.\n\"Uncorrected violation\" means a violation of a statute or rule or any other deficiency for which a notice of noncompliance has been issued and fine assessed and allowed to be recovered pursuant to section 144A.10, subdivision 8.\n\"Managerial official\" means an individual who has the decision-making authority related to the operation of the nursing home and the responsibility for either: (1) the ongoing management of the nursing home; or (2) the direction of policies, services, or employees of the nursing home.\n\"Nursing home administrator\" means a person who administers, manages, supervises, or is in general administrative charge of a nursing home, whether or not the individual has an ownership interest in the home, and whether or not the person's functions and duties are shared with one or more individuals, and who is licensed pursuant to section 144A.21.\n\"Repeated violation\" means the issuance of two or more correction orders, within a 12-month period, for a violation of the same provision of a statute or rule.\n\"Change of ownership\" means a change in the licensee.\n\"Direct ownership interest\" means an individual or legal entity with the possession of at least five percent equity in capital, stock, or profits of the licensee or who is a member of a limited liability company of the licensee.\n\"Indirect ownership interest\" means an individual or legal entity with a direct ownership interest in an entity that has a direct or indirect ownership interest of at least five percent in an entity that is a licensee.\n\"Licensee\" means a person or legal entity to whom the commissioner issues a license for a nursing home and who is responsible for the management, control, and operation of the nursing home.\n\"Management agreement\" means a written, executed agreement between a licensee and manager regarding the provision of certain services on behalf of the licensee.\n\"Manager\" means an individual or legal entity designated by the licensee through a management agreement to act on behalf of the licensee in the on-site management of the nursing home.\n\"Owner\" means: (1) an individual or legal entity that has a direct or indirect ownership interest of five percent or more in a licensee; and (2) for purposes of this chapter, owner of a nonprofit corporation means the president and treasurer of the board of directors; and (3) for an entity owned by an employee stock ownership plan, owner means the president and treasurer of the entity. A government entity that is issued a license under this chapter shall be designated the owner.",
	"repealed": false
}