{
	"id": "142A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.13",
	"title": "142A.13 ELECTRONIC BENEFIT TRANSFER CARD.",
	"text": "Cash benefits for the general assistance and Minnesota supplemental aid programs under chapter 256D and programs under chapter 142G must be issued on an EBT card with the name of the head of household printed on the card. The card must include the following statement: \"It is unlawful to use this card to purchase tobacco products or alcoholic beverages.\" This card must be issued within 30 calendar days of an eligibility determination. During the initial 30 calendar days of eligibility, a recipient may have cash benefits issued on an EBT card without a name printed on the card. This card may be the same card on which Supplemental Nutrition Assistance Program (SNAP) benefits are issued and does not need to meet the requirements of this section.\nAn individual with an EBT card issued for one of the programs listed under subdivision 1 is prohibited from using the EBT debit card to purchase tobacco products and alcoholic beverages, as defined in section 340A.101, subdivision 2. Any prohibited purchases made under this subdivision shall constitute unlawful use and result in disqualification of the cardholder from the program as provided in subdivision 4.\nEBT debit cardholders in programs listed under subdivision 1 are prohibited from using the cash portion of the EBT card at vendors and automatic teller machines located outside of Minnesota, Iowa, North Dakota, South Dakota, or Wisconsin. This subdivision does not apply to the food portion.\n(a) Any person found to be guilty of purchasing tobacco products or alcoholic beverages with their EBT debit card by a federal or state court or by an administrative hearing determination, or waiver thereof, through a disqualification consent agreement, or as part of any approved diversion plan under section 401.065, or any court-ordered stay which carries with it any probationary or other conditions, in the: (1) Minnesota family investment program and any affiliated program to include the work participation cash benefit program under chapter 142G; (2) general assistance program under chapter 256D; or (3) Minnesota supplemental aid program under chapter 256D, shall be disqualified from all of the listed programs.\n(b) The needs of the disqualified individual shall not be taken into consideration in determining the grant level for that assistance unit: (1) for one year after the first offense; (2) for two years after the second offense; and (3) permanently after the third or subsequent offense.\n(c) The period of program disqualification shall begin on the date stipulated on the advance notice of disqualification without possibility for postponement for administrative stay or administrative hearing and shall continue through completion unless and until the findings upon which the sanctions were imposed are reversed by a court of competent jurisdiction. The period for which sanctions are imposed is not subject to review.\n[See Note.]\nAny person in whose name an electronic benefit transaction card has been issued shall be presumed to have received the benefit of all transactions involving that card. This presumption applies in all situations unless the card in question has been reported lost or stolen by the cardholder. This presumption may be overcome by a preponderance of evidence indicating that the card was neither used by nor with the consent of the cardholder. Overcoming this presumption does not create any new or additional payment obligation not otherwise established in law, rule, or regulation.\nIf an amount of MFIP assistance is paid to a recipient in excess of the payment due, it shall be recoverable by the county agency. This recovery authority also extends to preexisting claims or newly discovered claims established under the AFDC program in effect on January 1, 1997. The agency shall give written notice to the recipient of its intention to recover the overpayment. County agency efforts and financial contributions shall be maintained at the level in place during fiscal year 1996.\nWhen an overpayment occurs, the county agency shall recover the overpayment from a current recipient by reducing the amount of aid payable to the assistance unit of which the recipient is a member for one or more monthly assistance payments until the overpayment is repaid. All county agencies in the state shall reduce the assistance payment by three percent of the assistance unit's standard of need in nonfraud cases and ten percent where fraud has occurred. For recipients receiving benefits via electronic benefits transfer, if the overpayment is a result of an automated teller machine (ATM) dispensing funds in error to the recipient, the agency may recover the ATM error by immediately withdrawing funds from the recipient's electronic benefit transfer account, up to the amount of the error. In cases where there is both an overpayment and underpayment, the county agency shall offset one against the other in correcting the payment.\nOverpayments may also be voluntarily repaid, in part or in full, by the individual, in addition to the aid reductions in subdivision 7, to include further voluntary reductions in the grant level agreed to in writing by the individual, until the total amount of the overpayment is repaid.\nThe county agency shall make reasonable efforts to recover overpayments to persons no longer on assistance according to standards adopted by rule by the commissioner of children, youth, and families. The county agency need not attempt to recover overpayments of less than $35 paid to an individual no longer on assistance unless the individual has been convicted of fraud under section 256.98.\nThe commissioner of children, youth, and families may charge a cardholder, defined as a person in whose name the transaction card was issued, a $2 fee to replace an electronic benefit transaction card. The fees shall be appropriated to the commissioner and used for electronic benefit purposes.\nThe commissioner may charge transaction fees in accordance with this subdivision up to a maximum of $10 in transaction fees per cardholder per month. In a given month, the first four cash withdrawals made by an individual cardholder are free. For subsequent cash withdrawals, $1 may be charged. No transaction fee can be charged if the card is used to purchase goods or services on a point of sale basis. A transaction fee subsequently set by the federal government may supersede a fee established under this subdivision. The fees shall be appropriated to the commissioner and used for electronic benefit purposes.\nLiquor stores, tobacco stores, gambling establishments, and tattoo parlors must negotiate with their third-party processors to block EBT card cash transactions at their places of business and withdrawals of cash at automatic teller machines located in their places of business.\nThe commissioner of children, youth, and families shall not subsidize retailers for electronic benefit transfer Supplemental Nutrition Assistance Program transactions.\n(a) For purposes of this section, \"gambling establishment\" means a racetrack licensed under section 240.06 or 240.09, a casino operated under a Tribal-state compact under section 3.9221, or any other establishment that receives at least 50 percent of its gross revenue from the conduct of gambling.\n(b) The commissioner shall take all actions necessary to ensure that no person may obtain benefits under chapter 142F, 142G, or 256 through the use of a financial transaction card, as defined in section 609.821, subdivision 1, paragraph (a), at a terminal located in or attached to a gambling establishment, liquor store, tobacco store, or tattoo parlor.\n(c) The commissioner shall take all actions necessary to ensure that warrants issued to pay benefits under chapter 142F or 256 bear a restrictive endorsement that prevents their being cashed in a gambling establishment.",
	"repealed": false
}