{
	"id": "124D.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.90",
	"title": "124D.90 SCHOOL ENRICHMENT PARTNERSHIP PROGRAM.",
	"text": "The school enrichment partnership program is established. The purpose of the program is to encourage districts to expand the involvement of the private sector in the delivery of academic programs. The program will provide matching state funds for those provided by the private sector.\nA district or group of districts is eligible to receive state aid under this program. Districts may enter into joint agreements to provide programs or make expenditures under this section. The limitations under this subdivision apply to these programs or expenditures as if they were operated by a single district. A district may receive $1 of state aid for each $2 raised from the private sector. The private match must be in the form of cash. Specific types of noncash support may be considered for the private match. State aid is limited to the lesser of $75,000 or $10 per pupil unit per district.\nThe use of the state and private funds provided under this section is under the general control of the board. The board may establish, without using state funds or public employees, a separate foundation to directly manage the funds. The private funds must be used to acquire instructional or noninstructional academic materials of a capital nature including, but not limited to, textbooks, globes, maps, and other academic material. The funds shall not be used for salaries or other employee benefits.\nThe commissioner must establish application forms, guidelines, procedures, and timelines for the distribution of state aid. The commissioner may require reporting necessary to evaluate the program. Measures of success will include numbers of partnerships and funds raised; numbers of school foundations formed; and demonstrated linkages of partnerships to improved instructional delivery resulting in increased student learning.\nNotwithstanding section 124E.24, paragraph (b), a results-oriented charter school is eligible to participate in the program under this section as if it were a district.",
	"repealed": false
}