{
	"id": "148E.130",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.130",
	"title": "148E.130 CONTINUING EDUCATION REQUIREMENTS FOR LICENSEES.",
	"text": "(a) A licensee must complete 40 hours of continuing education for each two-year renewal term. At the time of license renewal, a licensee must provide evidence satisfactory to the board that the licensee has completed the required continuing education hours during the previous renewal term. Of the total clock hours required:\n(1) all licensees must complete:\n(i) two hours in social work ethics as defined in section 148E.010; and\n(ii) four hours in cultural responsiveness;\n(2) licensed independent clinical social workers must complete 12 clock hours in one or more of the clinical content areas specified in section 148E.055, subdivision 5, paragraph (a), clause (2);\n(3) licensees providing licensing supervision according to sections 148E.100 to 148E.125, must complete six clock hours in supervision as defined in section 148E.010; and\n(4) no more than half of the required clock hours may be completed via continuing education independent learning as defined in section 148E.010.\n(b) If the licensee's renewal term is prorated to be less or more than 24 months, the total number of required clock hours is prorated proportionately.\n(a) Notwithstanding the requirements in subdivision 8, the clock hours specified in subdivision 1 apply to all new licenses issued effective August 1, 2011, under section 148E.055.\n(b) Any licensee issued a license prior to August 1, 2011, under Minnesota Statutes 2010, section 148D.055, must comply with the increased clock hours in subdivision 1 and must document the clock hours at the first two-year renewal term after August 1, 2011.\n(a) The content clock hours in subdivision 1, paragraph (a), clause (1), item (ii), apply to all new licenses issued effective July 1, 2021, under section 148E.055.\n(b) Any licensee issued a license prior to July 1, 2021, under section 148E.055 must comply with the clock hours in subdivision 1, including the content clock hours in subdivision 1, paragraph (a), clause (1), item (ii), at the first two-year renewal term after July 1, 2021.\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nThe continuing education must:\n(1) promote the standards of practice described in sections 148E.195 to 148E.240; and\n(2) contribute to the practice of social work as defined in section 148E.010.\n(a) A continuing education activity must be one of the following:\n(1) academic coursework at an institution of higher learning. One credit of coursework in a semester-based academic institution is the equivalent of 15 clock hours;\n(2) educational workshops, seminars, conferences, or live webinars;\n(3) staff training from an employer; or\n(4) continuing education independent learning as defined in section 148E.010.\n(b) A continuing education activity automatically meets the requirements of this section if the licensee completes it through:\n(1) a board-approved continuing education provider;\n(2) a continuing education provider or program approved by the Association of Social Work Boards or a similar examination body that the board has designated; or\n(3) a continuing education program approved by the National Association of Social Workers.\n(c) The board does not require providers and programs to be preapproved, but the continuing education activity must meet the requirements specified in this section.\nAt the time of renewal, the board may grant a onetime extension to complete the required clock hours when a licensee is unable to comply with this section.\nFor one year following the expiration date of a license, the licensee must maintain documentation of clock hours earned during the previous renewal term. The documentation must include the following:\n(1) for educational workshops, seminars, conferences, or live webinars, documentation of attendance issued by the presenter or sponsor must include the:\n(i) name of the sponsor;\n(ii) title and date of the activity;\n(iii) number of clock hours; and\n(iv) names of the presenters;\n(2) for academic coursework at an institution of higher learning, a transcript must include the:\n(i) name of the institution;\n(ii) title of the course;\n(iii) dates of the course; and\n(iv) number of credits completed or audited;\n(3) for an employer's staff training, an employer's documentation of attendance must include the:\n(i) name of the employer;\n(ii) title of the training;\n(iii) date of the training; and\n(iv) number of clock hours completed; and\n(4) for continuing education independent learning, a written summary of the activity conducted must include the:\n(i) topics covered;\n(ii) applicability of the activity to the licensee's social work practice;\n(iii) titles and authors or presenters of materials reviewed;\n(iv) dates the licensee conducted the activity; and\n(v) number of clock hours completed.\n(a) The board may audit licensees at the time of license renewal or reactivation to determine the licensee's compliance with the requirements of this section.\n(b) When the board audits a licensee, the licensee must provide the documentation specified in subdivision 11.",
	"repealed": false
}