{
	"id": "134.355",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.355",
	"title": "134.355 BASIC REGIONAL LIBRARY SYSTEM; SUPPORT.",
	"text": "(a) Basic system support aid and regional library telecommunications aid provide the appropriations for the basic regional library system.\n(b) For fiscal year 2026 and later, basic system support aid equals the aid entitlement amount for the previous fiscal year times one plus the percent increase in the basic formula allowance under section 126C.10, subdivision 2, from the previous school year to the current school year.\n[See Note.]\nAny regional public library system which qualifies according to the provisions of section 134.34 may apply for aid for regional library basic system support. Regional public library districts under section 134.201 may not compensate board members using aid funds. The amount of aid for each fiscal year shall be calculated as provided in this section.\nFifty-seven and one-half percent of the available aid funds shall be distributed to provide all qualifying systems an equal amount per capita. Each system's allocation pursuant to this subdivision shall be based on the population it serves.\nTwelve and one-half percent of the available aid funds shall be distributed to provide all qualifying systems an equal amount per square mile. Each system's allocation pursuant to this subdivision shall be based on the area it serves.\nFifteen percent of the available aid funds shall be paid to each system as base aid for basic system services.\nFifteen percent of the available aid funds shall be distributed to regional public library systems based upon the adjusted net tax capacity per capita for each member county or participating portion of a county as calculated for the third year preceding the fiscal year for which aid is provided. Each system's entitlement shall be calculated as follows:\n(1) multiply the adjusted net tax capacity per capita for each county or participating portion of a county by .0082;\n(2) add sufficient aid funds that are available under this subdivision to raise the amount of the county or participating portion of a county with the lowest value calculated according to clause (1) to the amount of the county or participating portion of a county with the next highest value calculated according to clause (1). Multiply the amount of the additional aid funds by the population of the county or participating portion of a county;\n(3) continue the process described in clause (2) by adding sufficient aid funds that are available under this subdivision to the amount of a county or participating portion of a county with the next highest value calculated in clause (1) to raise it and the amount of counties and participating portions of counties with lower values calculated in clause (1) up to the amount of the county or participating portion of a county with the next highest value, until reaching an amount where funds available under this subdivision are no longer sufficient to raise the amount of a county or participating portion of a county and the amount of counties and participating portions of counties with lower values up to the amount of the next highest county or participating portion of a county; and\n(4) if the point is reached using the process in clauses (2) and (3) at which the remaining aid funds under this subdivision are not adequate for raising the amount of a county or participating portion of a county and all counties and participating portions of counties with amounts of lower value to the amount of the county or participating portion of a county with the next highest value, those funds are to be divided on a per capita basis for all counties or participating portions of counties that received aid funds under the calculation in clauses (2) and (3).\nA regional public library system's population must be calculated using the most recent estimate available under section 477A.011, subdivision 3, at the time the aid amounts are calculated, which must be by April 1 in the year the calculation is made.\n(a) A regional public library system may apply for regional library telecommunications aid on behalf of itself and member public libraries.\n(b) The aid must be used for connections and other eligible non-voice-related e-rate program category one services. Aid may be used for e-rate program category two services as identified in the Federal Communication Commission's eligible services list for the current and preceding four funding years, or to improve Internet access and access to technology with items that are not e-rated, including but not limited to digital or online resources, if sufficient funds remain once category one needs are met in each funding year.\n(c) To be eligible, a regional public library system must be officially designated by the commissioner of education as a regional public library system as defined in section 134.34, subdivision 3, and each of its participating cities and counties must meet local support levels defined in section 134.34, subdivision 1. A public library building that receives aid under this section must be open a minimum of 20 hours per week. Exceptions to the minimum open hours requirement may be granted by the Department of Education on request of the regional public library system for the following circumstances: short-term closing for emergency maintenance and repairs following a natural disaster; in response to exceptional economic circumstances; building repair or maintenance that requires public services areas to be closed; or to adjust hours of public service to respond to documented seasonal use patterns.\nAn application for regional library telecommunications aid must, at a minimum, contain information to document the following:\n(1) the connections are adequate and employ an open network architecture that will ensure interconnectivity and interoperability with school districts, postsecondary education, or other governmental agencies;\n(2) that the connection is established through the most cost-effective means and that the regional library has explored and coordinated connections through school districts, postsecondary education, or other governmental agencies;\n(3) that the regional library system and member libraries included in the application have filed or are included in an e-rate application; and\n(4) other information, as determined by the commissioner of education, to ensure that connections are coordinated, efficient, and cost-effective, take advantage of discounts, and meet applicable state standards.\nThe library system may include costs associated with cooperative arrangements with postsecondary institutions, school districts, and other governmental agencies.\nThe commissioner of education shall develop an application and a reporting form and procedures for regional library telecommunications aid. Aid shall be based on actual costs including, but not limited to, connections, as documented in e-rate funding commitment decision letters for category one services and acceptable documentation for category two services and funds available for this purpose. The commissioner shall make payments directly to the regional public library system.",
	"repealed": false
}