{
	"id": "626.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.04",
	"title": "626.04 PROPERTY; SEIZURE, KEEPING, AND DISPOSAL.",
	"text": "(a) When any officer seizes, with or without warrant, any property or thing, it shall be safely kept by direction of the court as long as necessary for the purpose of being produced as evidence on any trial. If the owner of the property makes a written request to the seizing officer's agency for return of the property, and the property has not been returned within 48 hours of the request, excluding Saturday, Sunday, or legal holidays, the person whose property has been seized may file a petition for the return of the property in the district court in the district in which the property was seized. The court administrator shall provide a form for use as a petition under this section. A filing fee, equal to the civil motion filing fee, shall be required for filing the petition. The district court shall send a copy of the petition to the agency acting as custodian of the property with at least ten days' notice of a hearing date. A hearing on the petition shall be held within 30 days of filing unless good cause is shown for an extension of time. The determination of the petition must be without jury trial and by a simple and informal procedure. At the hearing, the court may receive relevant evidence on any issue of fact necessary to the decision on the petition without regard to whether the evidence would be admissible under the Minnesota Rules of Evidence. The court shall allow if requested, or on its own motion may require, the custodian or the custodian's designee to summarize the status and progress of an ongoing investigation that led to the seizure. Any such summary shall be done ex parte and only the custodian, the custodian's designee, and their attorneys may be present with the court and court staff. The court shall seal the ex parte record. After a hearing, the court shall not order the return if it finds that:\n(1) the property is being held in good faith as potential evidence in any matter, charged or uncharged;\n(2) the property may be subject to forfeiture proceedings;\n(3) the property is contraband or may contain contraband; or\n(4) the property is subject to other lawful retention.\n(b) The court shall make findings on each of these issues as part of its order. If the property is ordered returned, the petitioner shall not be liable for any storage costs incurred from the date the petition was filed. If the petition is denied, the court may award reasonable costs and attorney fees. After the trial for which the property was being held as potential evidence, and the expiration date for all associated appeals, the property or thing shall, unless otherwise subject to lawful detention, be returned to its owner or any other person entitled to possess it. Any property or thing seized may be destroyed or otherwise disposed of under the direction of the court. Any money found in gambling devices when seized shall be paid into the county treasury. If the gambling devices are seized by a police officer of a municipality, the money shall be paid into the treasury of the municipality.",
	"repealed": false
}