{
	"id": "216A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/216A.04",
	"title": "216A.04 EXECUTIVE SECRETARY; COMMISSION EMPLOYEES.",
	"text": "The commission shall appoint an executive secretary, not a member, who shall be in the unclassified service of the state and shall serve at the pleasure of the commission. The executive secretary shall take, subscribe, and file an oath similar to that required of the commissioners, and shall be subject to the same disqualifications as commissioners.\nThe executive secretary shall:\n(1) cause to be kept full and correct records of all transactions and proceedings of the commission;\n(2) appoint, subject to chapter 43A and the approval of the commission, all other classified employees of the commission and supervise and direct their activities;\n(3) have custody of the seal of the commission;\n(4) serve as the administrative officer of the commission with responsibility for personnel, budget and other administrative details related to the work of the commission or as required by state law;\n(5) prepare orders, reports, and other materials as assigned by the commission and recommend to the commission such measures as may be appropriate to achieve the objectives of the commission;\n(6) advise the commission of its financial position and recommend a budget for its approval; and\n(7) perform other duties as the commission directs.\nThe commission may designate any responsible employee to serve as acting secretary in the absence of the secretary.\nThe commission may establish other positions in the unclassified service if the positions meet the criteria of section 43A.08, subdivision 1a, clauses (1) to (7). The commission may employ other persons as may be necessary to carry out its functions.\nHearing reporters may provide transcripts of proceedings before the commission to persons requesting transcripts who pay a reasonable charge therefor to the reporter. The amount of the charge shall be fixed by the commission and retained by the reporter, any other law to the contrary notwithstanding.",
	"repealed": false
}