{
	"id": "244.049",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.049",
	"title": "244.049 SUPERVISED RELEASE BOARD.",
	"text": "(a) The Supervised Release Board is established to review eligible cases and make release and final discharge decisions for:\n(1) inmates serving life sentences with the possibility of parole or supervised release under sections 243.05, subdivision 1, and 244.05, subdivision 5;\n(2) inmates serving indeterminate sentences for crimes committed on or before April 30, 1980; and\n(3) inmates eligible for early supervised release under section 244.05, subdivision 4a.\n(b) Beginning July 1, 2024, the authority to grant discretionary release and final discharge previously vested in the commissioner under sections 243.05, subdivisions 1, paragraph (a), and 3; 244.08; and 609.12 is transferred to the board.\n(c) The board consists of the following members:\n(1) four individuals appointed by the governor who meet at least one of the following qualifications:\n(i) a degree from an accredited law school or a bachelor's, master's, or doctorate degree in criminology, corrections, social work, or a related social science;\n(ii) five years of experience in corrections, a criminal justice or community corrections field, rehabilitation programming, behavioral health, or criminal law; or\n(iii) demonstrated knowledge of victim issues and correctional processes;\n(2) two individuals appointed by the governor with an academic degree in neurology, psychology, or a comparable field and who have expertise in the neurological development of juveniles; and\n(3) the commissioner, who serves as chair.\n(d) The majority leader of the senate, minority leader of the senate, speaker of the house, and minority leader of the house shall each recommend two candidates for appointment to the positions described in paragraph (c), clause (1).\n(a) Appointed board members serve four-year staggered terms, but the terms of the initial members are as follows:\n(1) three members must be appointed for terms that expire January 1, 2026; and\n(2) three members must be appointed for terms that expire January 1, 2028.\n(b) An appointed member is eligible for reappointment and a vacancy must be filled according to subdivision 1.\n(c) For appointed members, compensation and removal are as provided in section 15.0575, but the compensation rate is $250 a day or part of the day spent on board activities.\n(a) To make release and final discharge decisions for eligible cases described in subdivision 1, paragraph (a), clause (1), when the inmate was 18 years of age or older at the time of the commission of the offense, and clause (2), the board must comprise a majority of the five members identified in subdivision 1, paragraph (c), clauses (1) and (3). The members described in subdivision 1, paragraph (c), clause (2), are ineligible to vote on those cases.\n(b) To make release and final discharge decisions for eligible cases described in subdivision 1, paragraph (a), clause (1), when the inmate was under 18 years of age at the time of the commission of the offense, and clause (3), the board must comprise a majority of all seven members and include at least one member identified in subdivision 1, paragraph (c), clause (2).\n(c) An appointed board member must visit at least one state correctional facility every 12 months.\n(d) The commissioner must provide the board with personnel, supplies, equipment, office space, and other administrative services necessary and incident to fulfilling the board's functions.\nNothing in this section:\n(1) supersedes the commissioner's authority to set conditions of release or revoke an inmate's release for violating any of the conditions; or\n(2) impairs the power of the Board of Pardons to grant a pardon or commutation in any case.\n(a) Beginning February 15, 2025, and each February 15 thereafter, the board must submit to the chairs and ranking minority members of the legislative committees with jurisdiction over criminal justice policy a written report that:\n(1) details the number of inmates reviewed;\n(2) identifies inmates granted release or final discharge in the preceding year;\n(3) specifies the length of time served by individuals granted release or final discharge in the preceding year before that release or discharge;\n(4) identifies any individual granted release or final discharge in the preceding year who will remain in custody as the result of a consecutive sentence;\n(5) identifies the number of prior reviews of inmates who were granted release or final discharge and inmates who were denied release or final discharge;\n(6) specifies the underlying offense of inmates who were granted release or final discharge and inmates who were denied release or final discharge; and\n(7) provides demographic data of inmates who were granted release or final discharge and inmates who were denied release or final discharge, including whether any of the individuals were under 18 years of age at the time of committing the offense.\n(b) The report must also include the board's recommendations to the commissioner for policy modifications that influence the board's duties.",
	"repealed": false
}