{
	"id": "211B.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.32",
	"title": "211B.32 COMPLAINTS OF UNFAIR CAMPAIGN PRACTICES.",
	"text": "(a) Except as provided in paragraphs (b) and (c), a complaint alleging a violation of chapter 211A or 211B must be filed with the office. The complaint must be finally disposed of by the office before the alleged violation may be prosecuted by a county attorney.\n(b) Complaints arising under those sections and related to those individuals and associations specified in section 10A.022, subdivision 3, must be filed with the Campaign Finance and Public Disclosure Board.\n(c) Violations of sections 211B.075 and 211B.076 may be enforced as provided in those sections.\nThe complaint must be filed with the office within one year after the occurrence of the act or failure to act that is the subject of the complaint, except that if the act or failure to act involves fraud, concealment, or misrepresentation that could not be discovered during that one-year period, the complaint may be filed with the office within one year after the fraud, concealment, or misrepresentation was discovered.\nThe complaint must be in writing, submitted under oath, and detail the factual basis for the claim that a violation of law has occurred. The office may prescribe the form of a complaint.\nThe burden of proving the allegations in the complaint is on the complainant. The standard of proof of a violation of section 211B.06, relating to false statements in paid political advertising or campaign material, is clear and convincing evidence. The standard of proof of any other violation of chapter 211A or 211B is a preponderance of the evidence.\n(a) The complaint must be accompanied by a filing fee of $50, unless filed by a filing officer under section 211A.05, subdivision 2.\n(b) The office may waive the payment of the filing fee, if the individual seeking a waiver of the fee files with the office an affidavit stating that the individual is financially unable to pay the fee.\n(c) The office may refund the filing fee of a complainant who prevails on the merits.\nUpon receipt of the filed complaint, the office must immediately notify the respondent and provide the respondent with a copy of the complaint by the most expeditious means available.",
	"repealed": false
}