{
	"id": "52.063",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.063",
	"title": "52.063 PROCEEDINGS FOLLOWING SUSPENSION, CONTINUATION OF SUSPENSION, OR CONSENT CEASE AND DESIST ORDER; APPOINTMENT OF NATIONAL CREDIT UNION ADMINISTRATION BOARD AS RECEIVER.",
	"text": "Upon receipt of the suspension notice or the notice of the continuation of suspension under section 52.062, subdivision 2 or 3, the credit union shall immediately cease or continue cessation of all operations except those operations specifically authorized by the commissioner of commerce. If the notice is given pursuant to determination by the commissioner of commerce after a hearing, the board of directors shall have 60 days from the receipt of said notice in which to file with the commissioner of commerce a proposed plan of corrective actions or to request that a receiver be appointed for the credit union. The commissioner of commerce shall have 30 days from the receipt of the proposed plan of corrective actions to determine if the proposed corrective actions are sufficient to correct the deficiencies which formed the basis for the suspension. If the commissioner of commerce determines that the proposed corrective actions are sufficient, the suspension shall be lifted and the credit union returned to normal operations under its board of directors. If the commissioner of commerce believes the proposed corrective actions insufficient, or if the board has failed to answer the suspension notice, or has requested that a receiver be appointed, then the commissioner of commerce shall apply to the district court for appointment of a receiver. The credit union shall have the right, within six months of the receipt of any notice of suspension or continuation of suspension pursuant to a determination by the commissioner of commerce after hearing, to appeal to the district court for a ruling as to the validity of such notice.\nIf the commissioner of commerce and the board of directors of the credit union execute a consent cease and desist order in lieu of a suspension under section 52.062, subdivision 4, the board of directors of the credit union may request that the commissioner of commerce seek court appointment of a receiver for the credit union. The consent cease and desist order must state that the credit union has requested that the commissioner seek appointment of a receiver.\nUpon a request by the commissioner of commerce, the court may appoint the National Credit Union Administration Board, created by section 3 of the Federal Credit Union Act, as amended, as receiver of a credit union, without bond, when the deposits of the credit union are to any extent insured by the National Credit Union Administration Board, and the credit union has had its operations suspended or has executed a consent cease and desist order with the commissioner in lieu of a suspension under section 52.062. Notwithstanding any other provisions of law, the commissioner of commerce may, in the event of the suspension or consent cease and desist order, tender to the National Credit Union Administration Board the proposed appointment as receiver of the credit union. If the National Credit Union Administration Board accepts the proposed appointment and the court appoints the National Credit Union Administration Board as receiver upon a request by the commissioner, the National Credit Union Administration Board shall have and possess all the powers and privileges provided by the laws of this state and section 207 of the Federal Credit Union Act, as amended, with respect to a receiver of a credit union, the board of directors of the credit union, and its members.",
	"repealed": false
}