{
	"id": "97A.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.221",
	"title": "97A.221 SEIZURE AND CONFISCATION OF PROPERTY.",
	"text": "(a) An enforcement officer may seize:\n(1) wild animals, wild rice, and other aquatic vegetation taken, bought, sold, transported, or possessed in violation of the game and fish laws or chapter 84 or 84D; and\n(2) firearms, bows and arrows, nets, boats, lines, poles, fishing rods and tackle, lights, lanterns, snares, traps, spears, dark houses, fish houses, and wild rice harvesting equipment that are used with the owner's knowledge to unlawfully take or transport wild animals, wild rice, or other aquatic vegetation and that have a value under $1,000 are subject to this section.\n(b) An item described in paragraph (a), clause (2), that has a value of $1,000 or more is subject to the provisions of section 97A.225.\n(c) An enforcement officer must seize nets and equipment unlawfully possessed within ten miles of Lake of the Woods or Rainy Lake.\nA whole shipment or parcel is contraband if two or more wild animals are shipped or possessed in the same container, vehicle, or room, or in any way commingled, and any of the animals are contraband. Seizure of any part of a shipment includes the entire shipment.\nThe enforcement officer must hold the seized property. The property held may be confiscated when:\n(1) the person from whom the property was seized is convicted, the conviction is not under appeal, and the time period for appeal of the conviction has expired; or\n(2) the property seized is contraband consisting of a wild animal, wild rice, or other aquatic vegetation.\nConfiscated property may be disposed of or retained for use by the commissioner, or sold at the highest price obtainable as prescribed by the commissioner. Upon acquittal or dismissal of the charged violation for which the property was seized:\n(1) all property, other than contraband consisting of a wild animal, wild rice, or other aquatic vegetation, must be returned to the person from whom the property was seized; and\n(2) the commissioner shall reimburse the person for any seized or confiscated property that is sold, lost, or damaged.\nThe appropriate agency and prosecuting authority shall report on forfeitures of firearms, bows, and motor vehicles occurring under this section as described in section 609.5315, subdivision 6.",
	"repealed": false
}