{
	"id": "48.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.89",
	"title": "48.89 CLERICAL SERVICE CORPORATION.",
	"text": "For the purposes of this section the following terms defined in this subdivision have the meanings given them.\n(a) The term \"commissioner\" means the commissioner of commerce.\n(b) The term \"clerical services\" means services such as check and deposit, sorting and posting, computation and posting of interest and other credits and charges, preparation and mailing of checks, statements, notices, and similar items, or any other clerical, bookkeeping, accounting, statistical, or similar functions performed for a bank.\n(c) The term \"clerical service corporation\" means a corporation organized as a business corporation to perform clerical services for two or more banks, each of which owns part of the capital stock of such corporation.\n(d) The term \"invest\" includes any advance of funds to a clerical service corporation, whether by the purchase of stock, the making of a loan, or otherwise, except a payment for rent earned, goods sold and delivered, or services rendered prior to the making of such payment.\n(e) The term \"banks\" is defined as prescribed in section 46.046.\n(a) No limitation or prohibition otherwise imposed by any provision of state law exclusively relating to banks shall prevent any two or more banks from investing not more than ten percent of the paid-in and unimpaired capital and unimpaired surplus of each of them in a clerical service corporation if in stock of such a corporation and 15 percent of unimpaired capital and unimpaired surplus if in the making of a loan or extending credit to such a corporation. In no event shall the aggregate of the investments in stock and loans exceed 15 percent of the unimpaired capital and unimpaired surplus of the investing bank.\n(b) If stock in a clerical service corporation has been held by two banks, and one of such banks ceases to utilize the services of the corporation and ceases to hold stock in it, and leaves the other as the sole stockholding bank, the corporation may nevertheless continue to function as such and the other bank may continue to hold stock in it.\nWhenever a bank, referred to in this section as an \"applying bank,\" applies for a type of clerical services for itself from a clerical service corporation which supplies the same type of clerical services to another bank, and the applying bank is competitive with any bank, referred to in this section as a \"stockholding bank,\" which holds stock in such corporation, the corporation must offer to supply such services by either:\n(1) issuing stock to the applying bank and furnishing clerical services to it on the same basis as to the other banks holding stock in the corporation; or\n(2) furnishing clerical services to the applying bank at rates no higher than necessary to fairly reflect the cost of such services, including the reasonable cost of the capital provided to the corporation by its stockholders,\nat the corporation's option, unless comparable services at competitive overall cost are available to the applying bank from another source, or unless the furnishing of the services sought by the applying bank would be beyond the practical capacity of the corporation. In any action or proceeding to enforce the duty imposed by this section, or for damages for the breach thereof, the burden shall be upon the clerical service corporation to show such availability.\nNo clerical service corporation may engage in any activity other than the performance of clerical services for banks.\nNo bank may cause to be performed, by contract or otherwise, any clerical services for itself from a clerical service corporation or any other person, whether on or off its premises, unless assurances satisfactory to the commissioner are furnished to the commissioner by both the bank and the party performing such services that the performance thereof will be subject to regulation and examination by the commissioner to the same extent as if such services were being performed by the bank itself on its own premises.\nA clerical service corporation shall not be considered a branch of any bank owning shares in such corporation.",
	"repealed": false
}