{
	"id": "16B.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.87",
	"title": "16B.87 AWARD AND REPAYMENT OF STATE BUILDING ENERGY IMPROVEMENT CONSERVATION LOANS.",
	"text": "The State Building Energy Conservation Improvement Loan Committee consists of the commissioners of administration, management and budget, and commerce. The commissioner of administration serves as chair of the committee. The members serve without compensation or reimbursement for expenses.\n(a) An agency shall apply for a loan on a form developed by the commissioner of administration that requires an applicant to submit the following information:\n(1) a description of the proposed project, including existing equipment, structural elements, operating characteristics, and other conditions affecting energy use that the energy conservation improvements financed by the loan modify or replace;\n(2) the total estimated project cost and the loan amount sought;\n(3) a detailed project budget;\n(4) projections of the proposed project's expected energy and monetary savings;\n(5) information demonstrating the agency's ability to repay the loan;\n(6) a description of the energy conservation programs offered by the utility providing service to the state building from which the applicant seeks additional funding for the project; and\n(7) any additional information requested by the commissioner.\n(b) The committee shall review applications for loans and shall award a loan based upon criteria adopted by the committee. A loan made under this section must:\n(1) be at or below the market rate of interest, including a zero interest loan; and\n(2) have a term no longer than ten years.\n(c) In making awards, the committee shall give preference to:\n(1) applicants that have sought funding for the project through energy conservation projects offered by the utility serving the state building that is the subject of the application; and\n(2) to the extent feasible, applications for state buildings located within the electric retail service area of the utility that is subject to section 116C.779.\nAn agency receiving a loan under this section shall repay the loan according to the terms of the loan agreement. The principal and interest must be paid to the commissioner of administration, who shall deposit it in the state building energy conservation improvement revolving loan account. Payments of loan principal and interest must begin no later than one year after the project is completed.\n[Repealed, 1997 c 7 art 2 s 67]",
	"repealed": false
}