{
	"id": "115A.158",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.158",
	"title": "115A.158 REQUESTS FOR PROPOSALS; PROCESSING AND COLLECTION FACILITIES AND SERVICES.",
	"text": "(a) The commissioner shall request proposals for the development and operation of specific types of commercial hazardous waste processing and collection facilities and services, and improved management of waste rendered nonhazardous and industrial waste, that offer the greatest possibility of achieving the policies and objectives of the waste management plan including the goal of reducing to the greatest extent feasible and prudent the need for and practice of disposal. The proposals must contain at least the following information:\n(1) the technical, managerial, and financial qualifications and experience of the proposer in developing and operating facilities and services of the type proposed;\n(2) the technical specifications of the proposed facility or service including the process that will be used, the amount and types of hazardous or industrial waste that can be handled, the types, volume, and proposed disposition of any residuals, and a description of anticipated adverse environmental effects;\n(3) the requirements of the site or sites needed to develop and operate the facility or service and the likelihood that a suitable site or sites will be available for the facility or service;\n(4) projections of the costs and revenues of the facility or service, the types and numbers of generators who will use it, and the fee structure and estimated user charges necessary to make the facility or services economically viable;\n(5) the schedule for developing and commencing operation of the facility or service; and\n(6) the financial, technical, institutional, legal, regulatory, and other constraints that may hinder or prevent the development or operation of the facility or service and the actions that could be taken by state and local governments or by the private sector to overcome those constraints.\n(b) The information provided in the proposal must be based on current and projected market conditions, hazardous or industrial waste streams, legal and institutional arrangements, and other circumstances specific to the state.\n(a) In requesting proposals, the agency shall inform potential developers of the assistance available to them in siting and establishing hazardous waste processing and collection facilities and services in the state and improved industrial waste management in the state, including the availability of sites listed on the agency's inventory of preferred areas for hazardous waste processing facilities, the authority of the agency to acquire sites and order the establishment of facilities in those areas, the policies and objectives of the hazardous waste management plan, and the availability of information developed by the agency on hazardous or industrial waste generation and management in the state.\n(b) The agency shall evaluate the proposals received in response to its request and determine the extent to which the proposals demonstrate the qualifications of the developers, the technical and economic feasibility of the proposed facility or service, and the extent to which the proposed facility or service will contribute in a significant way to the achievement of the policies and objectives of the hazardous waste management plan.\n(c) The agency shall report to the senate and house of representatives committees having jurisdiction over environment and natural resources and environment and natural resources finance on the proposals that it has received and evaluated, and on the legislative, regulatory, and other actions needed to develop and operate the proposed facilities or services.\nThe agency shall issue the first round of requests under this section by June 1, 1984. The first round proposals must be returned to the agency by November 1, 1984. The agency shall submit its report on these proposals to the legislative commission by January 1, 1985. The agency may issue additional requests in 1985 and in future years.",
	"repealed": false
}