{
	"id": "340A.419",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.419",
	"title": "340A.419 TASTINGS CONDUCTED BY EXCLUSIVE LIQUOR STORE.",
	"text": "For purposes of this section, a \"tasting\" is an event of not more than four hours' duration at which persons pay a fee to participate and are allowed to consume wine, malt liquor, or spirits by the glass without paying a separate charge for each glass.\n(a) Notwithstanding any other law, an exclusive liquor store may conduct a wine, malt liquor, or spirits tasting on the premises of a holder of an on-sale intoxicating liquor license that is not a temporary license or on the premises of a holder of a wine license under section 340A.404, subdivision 5, if the exclusive liquor store complies with this section.\n(b) No wine, malt liquor, or spirits authorized for use under this section may be sold for off-premises consumption. A participant in the tasting may fill out a form indicating preferences for wine, malt liquor, or spirits. The form may be held on the premises of the exclusive liquor store to assist the participant in making an off-sale purchase at a later date.\n(c) Notwithstanding any other law, an exclusive liquor store may purchase or otherwise obtain wine or spirits for a tasting conducted under this section from a wholesaler licensed to sell wine or spirits. The wholesaler may sell or give wine or spirits to an exclusive liquor store for a tasting conducted under this section and may provide personnel to assist in the tasting.\n(d) An exclusive liquor store that conducts a tasting under this section must use any fees collected from participants in the tasting only to defray the cost of conducting the tasting.\n(e) Notwithstanding section 340A.409, subdivision 4, the premises on which a tasting is conducted must be insured as required by section 340A.409, subdivision 1.\n(f) Exclusive liquor stores may conduct classes for a fee and allow tastings in the conduct of those classes, provided that the amount served at a class is limited to the amount authorized under section 340A.4041.\nAn exclusive liquor store conducting a malt liquor tasting under this section must also comply with the requirements of section 340A.510, subdivision 2.",
	"repealed": false
}