{
	"id": "62S.291",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.291",
	"title": "62S.291 AVAILABILITY OF NEW SERVICES OR PROVIDERS.",
	"text": "An insurer shall notify policyholders of the availability of a new long-term policy series that provides coverage for new long-term care services or providers material in nature and not previously available through the insurer to the general public. The notice must be provided within 12 months of the date that the new policy series is made available for sale in this state.\n(a) Notwithstanding subdivision 1, notification is not required for any policy issued before August 1, 2008, or to any policyholder or certificate holder who is currently eligible for benefits, within an elimination period or on a claim, or who previously had been in claim status, or who would not be eligible to apply for coverage due to issue age limitations under the new policy. The insurer may require that policyholders meet all eligibility requirements, including underwriting and payment of the required premium to add new services or providers.\n(b) An insurer is not required to notify policyholders of a new proprietary policy series created and filed for use in a limited distribution channel. For purposes of this subdivision, \"limited distribution channel\" means through a discrete entity, such as a financial institution or brokerage, for which specialized products are available that are not available for sale to the general public. Policyholders that purchased a new proprietary policy shall be notified when a new long-term care policy series that provides coverage for new long-term care services or providers material in nature is made available to that limited distribution channel.\nAn insurer shall make the new coverage available in one of the following ways:\n(1) by adding a rider to the existing policy and charging a separate premium for the new rider based on the insured's attained age;\n(2) by exchanging the existing policy or certificate for one with an issue age based on the present age of the insured and recognizing past insured status by granting premium credits toward the premiums for the new policy or certificate. The premium credits must be based on premiums paid or reserves held for the prior policy or certificate;\n(3) by exchanging the existing policy or certificate for a new policy or certificate in which consideration for past insured status is recognized by setting the premium for the new policy or certificate at the issue age of the policy or certificate being exchanged. The cost for the new policy or certificate may recognize the difference in reserves between the new policy or certificate and the original policy or certificate; or\n(4) by an alternative program developed by the insurer that meets the intent of this section if the program is filed with and approved by the commissioner.\nPolicies issued pursuant to this section shall be considered exchanges and not replacements. These exchanges are not subject to sections 62S.24 and 62S.30, and the reporting requirements of section 62S.25, subdivisions 1 to 6.\nWhere the policy is offered through an employer, labor organization, professional, trade, or occupational organization, the required notification in subdivision 1 must be made to the offering entity. However, if the policy is issued to a group defined in section 62S.01, subdivision 15, clause (4), the notification must be made to each certificate holder.\nNothing in this section prohibits an insurer from offering any policy, rider, certificate, or coverage change to any policyholder or certificate holder. However, upon request any policyholder may apply for currently available coverage that includes the new services or providers. The insurer may require that policyholders meet all eligibility requirements, including underwriting and payment of the required premium to add new services or providers.\nThis section does not apply to life insurance policies or riders containing accelerated long-term care benefits.",
	"repealed": false
}