{
	"id": "60A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.16",
	"title": "60A.16 MERGERS AND CONSOLIDATIONS.",
	"text": "(1) Domestic insurance corporations. Any two or more domestic insurance corporations, formed for any of the purposes for which stock, mutual, or stock and mutual insurance corporations, or reciprocal or interinsurance contract exchanges might be formed under the laws of this state, may be:\n(a) merged into one of such domestic insurance corporations, or\n(b) consolidated into a new insurance corporation to be formed under the laws of this state.\n(2) Domestic and foreign insurance corporations. Any such domestic insurance corporations and any foreign insurance corporations formed to carry on any insurance business for the conduct of which an insurance corporation might be organized under the laws of this state, may be:\n(a) merged into one of such domestic insurance corporations, or\n(b) merged into one of such foreign insurance corporations, or\n(c) consolidated into a new insurance corporation to be formed under the laws of the government under which one of such foreign insurance corporations was formed, provided that each of such foreign insurance corporations is authorized by the laws of the government under which it was formed to effect such merger or consolidation.\n(1) Plan of merger. The merger or consolidation of insurance corporations can be effected only as a result of a plan of merger adopted, approved, and filed as follows:\n(a) A resolution containing the plan of merger shall be approved by the affirmative vote of a majority of the directors of the board of each constituent corporation. The plan of merger shall prescribe the terms and conditions of merger or consolidation, and the mode of carrying the same into effect, with such other details and provisions as are deemed necessary. In the case of merging or consolidating stock insurance corporations or stock and mutual insurance corporations, such plan of merger may prescribe that stock of one or more of such corporations shall be converted, in whole or in part, into stock or other securities of a corporation which is not a merging or consolidating corporation or into cash.\n(b) The plan of merger, or a summary of the plan approved by the commissioner, shall be submitted to the respective shareholders or members, as the case may be, of each constituent corporation, for consideration at a regular meeting or at a special meeting duly called for the purpose of considering and acting upon the plan. Written notice of the meeting, which shall state that the purpose of the meeting is to consider the proposed plan of merger, shall be given to each shareholder or member entitled to vote upon the plan of merger not less than 30 nor more than 60 days before the meeting. The plan of merger must be approved by the affirmative vote of the holders of two-thirds of the voting power of the shareholders or members present or represented at the meeting of each constituent corporation; provided, however, that in the case of a merger, except one in which any shares of the surviving insurance corporation are to be converted into shares or other securities of another corporation or into cash, the agreement need not be submitted to the shareholders or members of that one of the insurance corporations into which it has been agreed the others shall be merged. Upon receiving the approval of the shareholders or members of each constituent corporation, articles of merger shall be prepared that contain the plan of merger and a statement that the plan has been approved by each corporation under this section.\n(c) The articles of merger and plan of merger shall be delivered to the commissioner of commerce, who, if the plan of merger is reasonable and if the provisions thereof providing for any transfer of assets and assumption of liabilities are fair and equitable to the claimants and policyholders, shall issue an order approving the merger. Copies of the articles of merger, certified by the commissioner of commerce, shall be delivered to the surviving corporation or its legal representative.\n(2) Articles of incorporation of new company. (a) If the plan of merger is for a consolidation into a new insurance corporation to be formed under any law or laws of this state, articles of incorporation for such new insurance corporation shall be prepared and delivered to the commissioner of commerce together with the articles of merger as provided in clause (1) hereof.\n(b) Such articles shall be prepared, executed, approved, filed and recorded in the form and manner prescribed in, or applicable to, the particular law or laws under which the new insurance corporation is to be formed.\n(3) Abandonment. A proposed merger or consolidation may be abandoned at any time prior to approval by the commissioner under the provision for abandonment, if any, set forth in the plan of merger.\n(4) Mutual insurance holding companies. In the case of a merger of two mutual insurance holding companies under section 66A.40, subdivision 2, paragraph (c), the procedures set forth in subdivisions 1, 2, 3, 4, and 6 shall apply, subject to the following:\n(a) the plan of merger must be fair and reasonable to the members of each constituent corporation;\n(b) no member of either constituent corporation on the effective date of the merger shall lose membership solely on account of the merger;\n(c) membership and voting rights in each respective constituent corporation for purposes of the meeting of the members held to consider the plan of merger shall be determined in accordance with the articles and bylaws of that constituent corporation as of a record date established in the plan of merger; and\n(d) the commissioner may require changes to the plan or require certain undertakings from the surviving corporation to assure compliance with this clause.\n(1) A merger of one or more insurance corporations into a domestic insurance corporation shall be effective when the articles of merger have been approved and filed in the office of the commissioner of commerce, or at a later date specified in the articles of merger.\n(2) A consolidation of insurance corporations into a new domestic insurance corporation shall be effective when the articles of merger and the new articles of incorporation have been approved and filed in the office of the commissioner of commerce, or at a later date as specified in the plan of merger.\n(3) A merger or consolidation of one or more domestic insurance corporations into a foreign insurance corporation shall be effective according to the provisions of law of the jurisdiction in which the foreign insurance corporation was formed, but not until the articles of merger have been filed in accordance with subdivision 2, clause (1).\nUpon the consummation of the merger or consolidation as provided in subdivision 3, the effect of the merger or consolidation shall be:\n(1) That the several corporate parties to the plan of merger shall be one insurance corporation, which shall be:\n(a) in the case of a merger, that one of the constituent insurance corporations into which it has been agreed the others shall be merged and which shall survive the merger for that purpose, or\n(b) in the case of a consolidation, the new insurance corporation into which it has been agreed the others shall be consolidated;\n(2) The separate existence of the constituent insurance corporations shall cease, except that of the surviving insurance corporation in the case of a merger;\n(3) The surviving or new insurance corporation, as the case may be, shall possess all the rights, privileges and franchises possessed by each of the former insurance corporations so merged or consolidated except that such surviving or new corporation shall not thereby acquire authority to engage in any insurance business or exercise any right which an insurance corporation may not be formed under the laws of this state to engage in or exercise;\n(4) All the property, real, personal and mixed, of each of the constituent insurance corporations, and all debts due on whatever account to any of them, including without limitation subscriptions for shares, premiums on existing policies, and other choses in action belonging to any of them, shall be taken and be deemed to be transferred to and invested in such surviving or new insurance corporation, as the case may be, without further act or deed;\n(5) The surviving or new insurance corporation shall be responsible for all the liabilities and obligations of each of the insurance corporations merged or consolidated, in accordance with the terms of the agreement for merger or consolidation; but the rights of the creditors of the constituent insurance corporations, or of any persons dealing with such insurance corporations shall not be impaired by such merger or consolidation, and any claim existing or action or proceeding pending by or against any of the constituent insurance corporations may be prosecuted to judgment as if the merger or consolidation had not taken place, or the surviving or new insurance corporation may be proceeded against or substituted in its place.\n(1) When an insurance corporation having capital stock has become a party to a merger or consolidation agreement, as hereinbefore provided, any shareholder of such an insurance corporation who voted against the merger or consolidation at the meeting at which it was authorized, may, at any time within 20 days after such authorization was given, object thereto in writing and demand payment for the shares held.\n(2) If, after such a demand by a shareholder, the insurance corporation and the shareholder cannot agree upon the value of the shares at the time the merger or consolidation was authorized, such value shall be ascertained by three disinterested persons, one of whom shall be named by the shareholder, another by the insurance corporation and the third by the two thus chosen. The finding of the appraisers shall be final, and if their award is not paid by the insurance corporation within 30 days after it is made, it may be recovered in an action by the shareholder against the insurance corporation. The liability of the insurance corporation to the dissenting shareholder for the value of the shares so agreed upon or awarded shall also be a liability of the surviving or new insurance corporation, as the case may be. Upon payment by the insurance corporation or by the surviving or new corporation to the shareholder of the agreed or awarded price of the shares, the shareholder shall forthwith transfer and assign the shares held at, and in accordance with, the request of the corporation.\n(3) A shareholder shall not be entitled to payment for shares under the provisions of this subdivision unless the value of the corporate assets which would remain after such payment would be at least equal to the aggregate amount of its debts and liabilities including outstanding capital stock.\nAll actual expenses and costs incident to proceedings under the provisions of this section shall be paid by the surviving or new company and an itemized statement of the expenses and costs shall be filed with the commissioner prior to formal approval. No officer of any such company or employee of the Department of Commerce, shall receive any compensation, gratuity or otherwise, directly or indirectly, for in any manner aiding, promoting, or assisting in such consolidation or merger.\nAny officer, director, or stockholder of any company, or any employee of the state, violating, or consenting to the violation of, the provisions of this subdivision shall be punished by a fine of not less than $20,000 and by imprisonment for not less than one year.",
	"repealed": false
}