{
	"id": "501C.0201",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.0201",
	"title": "501C.0201 ROLE OF COURT IN ADMINISTRATION OF TRUST AND NATURE OF JUDICIAL PROCEEDING.",
	"text": "(a) An interested person may petition the district court and invoke its jurisdiction as provided in sections 501C.0201 to 501C.0208 for those matters specified in section 501C.0202.\n(b) As used in sections 501C.0201 to 501C.0208, \"interested person\" includes an acting trustee, any person named as successor trustee under the trust instrument, any person seeking court appointment as trustee whether or not named in the trust instrument, a beneficiary, a creditor, and any other person having a property or other right in or claim against the assets of the trust. Interested person also includes a fiduciary representing an interested person and any other person acting in a representative capacity as provided in sections 501C.0301 to 501C.0305, any person who takes action with respect to a trust in the absence of an acting trustee or otherwise within the meaning of section 501C.0701, an agent to whom a trustee has delegated a duty or power within the meaning of section 501C.0807, and any person with a power to direct the trustee within the meaning of section 501C.0808. The meaning of interested person, as it relates to a particular person, may vary from time to time and must be determined according to the particular purposes of, and matter involved in, any petition.\n(c) The petition shall specify whether the interested person is invoking the jurisdiction of the district court as an in rem proceeding or as an in personam proceeding. If the petition designates an in rem proceeding, the district court's in rem jurisdiction is invoked, and sections 501C.0203, subdivision 1, and 501C.0204, subdivision 1, govern the proceeding. If the petition designates an in personam proceeding, the district court's in personam jurisdiction is invoked, and sections 501C.0203, subdivision 2, and 501C.0204, subdivision 2, govern the proceeding.\n(1) In the absence of a designation of an in rem or an in personam proceeding by the petitioner, the district court's in rem jurisdiction is invoked, and sections 501C.0203, subdivision 1, and 501C.0204, subdivision 1, govern the proceeding.\n(2) If the district court's in rem jurisdiction is invoked, the district court shall retain jurisdiction as a proceeding in rem, until jurisdiction is transferred to another court or terminated by court order.\n(3) If the district court's in personam jurisdiction is invoked, the trust is not subject to continuing jurisdiction unless otherwise ordered by the court.\n(4) Notwithstanding the designation of in personam jurisdiction as set forth in the petition, the district court, on the request of any interested person, may invoke the in rem jurisdiction of the district court and require compliance with the order for hearing and notice provisions set forth in section 501C.0203, subdivision 1.\n(d) A trust is not subject to continuing court supervision as a court-supervised trust except as provided in section 501C.0205 or as otherwise ordered by the court. If the district court assumes court supervision of the trust, all further court proceedings with respect to the trust shall be maintained under the district court's in rem jurisdiction.",
	"repealed": false
}