{
	"id": "353D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/353D.05",
	"title": "353D.05 INVESTMENT OF FUNDS.",
	"text": "As further specified under this section, employing unit contributions, after the deduction of an amount for administrative expenses, and individual participant contributions must be invested in the participant's account or accounts in investment products authorized by the association that are made available for this purpose by the State Board of Investment under section 356.645.\n(a) A plan participant may elect to allocate contributions, made by and on behalf of the participant, in one or more of the investment products authorized by the association to be made available under the plan, by specifying the percentage of the participant's contributions to be used to purchase shares in the authorized products.\n(b) If contributions are received before the participant has made an allocation election, or if the participant fails to specify an allocation, the executive director shall, on behalf of that participant, purchase shares in a default investment alternative. The investment option must be specified by the Public Employees Retirement Association board of trustees from the designated available investment options authorized under this section.\n(c) A participant may revise the investment allocation for subsequent purchase of shares, and a participant or former participant may also change the investment options selected for all or a portion of shares previously purchased.\n(d) Any investment allocation selection authorized under this subdivision, whether relating to subsequent purchases of new shares or reallocating the existing portfolio, must be conducted at times and under procedures prescribed by the executive director.\n[Repealed, 2014 c 296 art 13 s 28]\nThe executive director of the association with the advice and consent of the board shall annually set an amount to recover the costs of the association in administering the public employees defined contribution plan.",
	"repealed": false
}