{
	"id": "299A.785",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.785",
	"title": "299A.785 TRAFFICKING STUDY.",
	"text": "The commissioner shall elicit the cooperation and assistance of government agencies and nongovernmental organizations as appropriate to assist in the collection of trafficking data. The commissioner shall direct the appropriate authorities in each agency and organization to make best efforts to collect information relevant to tracking progress on trafficking. The information to be collected may include, but is not limited to:\n(1) the numbers of arrests, prosecutions, and successful convictions of traffickers and those committing trafficking-related crimes, including, but not limited to, the following offenses: 609.27 (coercion); 609.282 (labor trafficking); 609.283 (unlawful conduct with respect to documents in furtherance of labor or sex trafficking); 609.321 (promotion of prostitution); 609.322 (solicitation of prostitution); 609.324 (other prostitution crimes); 609.33 (disorderly house); 609.352 (solicitation of a child); 617.245 and 617.246 (use of minors in sexual performance); 617.247 (possession of pornographic work involving minors); and 617.293 (harmful materials; dissemination and display to minors prohibited);\n(2) statistics on the number of trafficking victims, including demographics, method of recruitment, and method of discovery;\n(3) trafficking routes and patterns, states or country of origin, and transit states or countries;\n(4) method of transportation, motor vehicles, aircraft, watercraft, or by foot if any transportation took place; and\n(5) social factors, including pornography, that contribute to and foster trafficking, especially trafficking of women and children.\nThe commissioner shall gather and compile annually statistical data on the extent and nature of trafficking in Minnesota. The commissioner shall publish the data every two years. This publication shall be available to the public and include, to the extent possible, the information to be collected in subdivision 1 and any other information the commissioner finds relevant to the issue of trafficking in Minnesota.",
	"repealed": false
}