{
	"id": "245.4874",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4874",
	"title": "245.4874 DUTIES OF COUNTY BOARD.",
	"text": "(a) The county board must:\n(1) develop a system of affordable and locally available children's mental health services according to sections 245.487 to 245.4889;\n(2) consider the assessment of unmet needs in the county as reported by the local children's mental health advisory council under section 245.4875, subdivision 5, paragraph (b), clause (3). The county shall provide, upon request of the local children's mental health advisory council, readily available data to assist in the determination of unmet needs;\n(3) assure that parents and providers in the county receive information about how to gain access to services provided according to sections 245.487 to 245.4889;\n(4) coordinate the delivery of children's mental health services with services provided by social services, education, corrections, health, and vocational agencies to improve the availability of mental health services to children and the cost-effectiveness of their delivery;\n(5) assure that mental health services delivered according to sections 245.487 to 245.4889 are delivered expeditiously and are appropriate to the child's diagnostic assessment and individual treatment plan;\n(6) provide for case management services to each child with severe emotional disturbance according to sections 245.486; 245.4871, subdivisions 3 and 4; and 245.4881, subdivisions 1, 3, and 5;\n(7) provide for screening of each child under section 245.4885 upon admission to a residential treatment facility, acute care hospital inpatient treatment, or informal admission to a regional treatment center;\n(8) prudently administer grants and purchase-of-service contracts that the county board determines are necessary to fulfill its responsibilities under sections 245.487 to 245.4889;\n(9) assure that mental health professionals, mental health practitioners, and case managers employed by or under contract to the county to provide mental health services are qualified under section 245.4871;\n(10) assure that children's mental health services are coordinated with adult mental health services specified in sections 245.461 to 245.486 so that a continuum of mental health services is available to serve persons with mental illness, regardless of the person's age;\n(11) assure that culturally competent mental health consultants are used as necessary to assist the county board in assessing and providing appropriate treatment for children of cultural or racial minority heritage; and\n(12) consistent with section 245.486, arrange for or provide a children's mental health screening for:\n(i) a child receiving child protective services;\n(ii) a child in out-of-home placement;\n(iii) a child for whom parental rights have been terminated;\n(iv) a child found to be delinquent; or\n(v) a child found to have committed a juvenile petty offense for the third or subsequent time.\nA children's mental health screening is not required when a screening or diagnostic assessment has been performed within the previous 180 days, or the child is currently under the care of a mental health professional.\n(b) When a child is receiving protective services or is in out-of-home placement, the court or county agency must notify a parent or guardian whose parental rights have not been terminated of the potential mental health screening and the option to prevent the screening by notifying the court or county agency in writing.\n(c) When a child is found to be delinquent or a child is found to have committed a juvenile petty offense for the third or subsequent time, the court or county agency must obtain written informed consent from the parent or legal guardian before a screening is conducted unless the court, notwithstanding the parent's failure to consent, determines that the screening is in the child's best interest.\n(d) The screening shall be conducted with a screening instrument approved by the commissioner of human services according to criteria that are updated and issued annually to ensure that approved screening instruments are valid and useful for child welfare and juvenile justice populations. Screenings shall be conducted by a mental health practitioner as defined in section 245.4871, subdivision 26, or a probation officer or local social services agency staff person who is trained in the use of the screening instrument. Training in the use of the instrument shall include:\n(1) training in the administration of the instrument;\n(2) the interpretation of its validity given the child's current circumstances;\n(3) the state and federal data practices laws and confidentiality standards;\n(4) the parental consent requirement; and\n(5) providing respect for families and cultural values.\nIf the screen indicates a need for assessment, the child's family, or if the family lacks mental health insurance, the local social services agency, in consultation with the child's family, shall have conducted a diagnostic assessment, including a functional assessment. The administration of the screening shall safeguard the privacy of children receiving the screening and their families and shall comply with the Minnesota Government Data Practices Act, chapter 13, and the federal Health Insurance Portability and Accountability Act of 1996, Public Law 104-191. Screening results are classified as private data on individuals, as defined by section 13.02, subdivision 12. The county board or Tribal nation may provide the commissioner with access to the screening results for the purposes of program evaluation and improvement.\n(e) When the county board refers clients to providers of children's therapeutic services and supports under section 256B.0943, the county board must clearly identify the desired services components not covered under section 256B.0943 and identify the reimbursement source for those requested services, the method of payment, and the payment rate to the provider.\nFor individuals who have health care coverage, the county board is not responsible for providing mental health services which are within the limits of the individual's health care coverage.",
	"repealed": false
}