{
	"id": "192A.343",
	"url": "https://www.revisor.mn.gov/statutes/cite/192A.343",
	"title": "192A.343 ACTION BY CONVENING AUTHORITY.",
	"text": "The findings and sentence of a court-martial shall be reported promptly to the convening authority after the announcement of the sentence.\n(a) The accused may submit to the convening authority matters for consideration by the convening authority with respect to the findings and the sentence. Any such submission shall be in writing. Except in a summary courts-martial case, such a submission shall be made within 21 days after the accused has been given an authenticated record of trial and, if applicable, the recommendation of a judge advocate under subdivision 4. In a summary courts-martial case, a submission shall be made within 14 days after the sentence is announced.\n(b) If the accused shows that additional time is required for the accused to submit the matters, the convening authority or other person taking action under this section, for good cause, may extend the applicable period under paragraph (a).\n(c) In a summary courts-martial case, the accused shall be promptly provided a copy of the record of trial for use in preparing a submission authorized by paragraph (a).\n(d) The accused may waive the right to make a submission to the convening authority under paragraph (a). A waiver must be made in writing and may not be revoked. For the purposes of subdivision 3, paragraph (b), the time within which the accused may make a submission under this subdivision shall be deemed to have expired upon the submission of a waiver to the convening authority.\n(a) The authority under this section to modify the findings and sentence of a court-martial is a matter of command prerogative involving the sole discretion of the convening authority. If it is impractical for the convening authority to act, the convening authority shall forward the case to a person exercising general court-martial jurisdiction who may take action under this section.\n(b) Action on the sentence of a court-martial shall be taken by the convening authority. The action may be taken only after the consideration of any matters submitted by the accused under subdivision 2 or after the time for submitting the matter expires, whichever is earlier. The convening authority, in that person's sole discretion, may approve, disapprove, commute, or suspend the sentence in whole or in part.\n(c) Action on the findings of a court-martial by the convening authority or other person acting on the sentence is not required. However, such person, in the person's sole discretion, may:\n(1) dismiss any charge or specification by setting aside a finding of guilty; or\n(2) change a finding of guilty to a charge or specification to a finding of guilty to an offense that is a lesser included offense of the offense stated in the charge or specification.\n(d) The convening authority or other person acting under this section shall issue a final order at the conclusion of the court-martial proceeding, including any proceeding in revision, rehearing, and reconsideration under subdivision 5. The final order shall be promptly served on the accused.\nBefore acting under this section on any general or special court-martial case in which there is a finding of guilt, the convening authority or other person taking action under this section shall obtain and consider the written recommendation of a judge advocate. The convening authority shall refer the record of trial to the judge advocate, and the judge advocate shall use such record in the preparation of the recommendation. The recommendation of the judge advocate shall include those matters as may be prescribed by regulation and shall be served on the accused, who may submit any matter in response under subdivision 2. Failure to object in the response to the recommendation or to any matter attached to the recommendation waives the right to object to the recommendation.\n(a) The convening authority or other person taking action under this section, in the person's sole discretion, may order a proceeding in revision or a rehearing.\n(b) A proceeding in revision may be ordered if there is an apparent error or omission in the record or if the record shows improper or inconsistent action by a court-martial with respect to the findings or sentence that can be rectified without material prejudice to the substantial rights of the accused. In no case, however, may a proceeding in revision:\n(1) reconsider a finding of not guilty of any specification or a ruling that amounts to a finding of not guilty;\n(2) reconsider a finding of not guilty of any charge, unless there has been a finding of guilty under a specification laid under that charge, which sufficiently alleges a violation of this code; or\n(3) increase the severity of the sentence unless the sentence prescribed for the offense is mandatory.\n(c) A rehearing may be ordered by the convening authority or other person taking action under this section if that person disapproves the findings and sentence and states the reasons for disapproval of the findings. If a person disapproves of the findings and sentence and does not order a rehearing, that person shall dismiss the charges. A rehearing as to the findings may not be ordered where there is a lack of sufficient evidence in the record to support the findings. A rehearing as to the sentence may be ordered if the convening authority or other person taking action under this subdivision disapproves the sentence.",
	"repealed": false
}