{
	"id": "94.343",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.343",
	"title": "94.343 CLASS A LAND EXCHANGED; CONDITIONS.",
	"text": "(a) Any class A land may, with the unanimous approval of the board, be exchanged for any publicly held or privately owned land in the manner and subject to the conditions herein prescribed. Class A land may be exchanged only if it meets the requirements of subdivision 3 or 5.\n(b) The commissioner, with the approval of the board, shall formulate general programs of exchange of class A land designed to serve the best interests of the state in the acquisition, development, and use of lands for purposes within the province of the Department of Natural Resources.\nExcept as herein expressly prohibited, class A land may be exchanged, though devoted to a specific public use, if the use is discretionary and the authority in charge thereof shall approve the exchange, or if the commissioner, with the approval of the board, shall determine that the exchange will not materially curtail the activity or project for which the land is used; provided, that exchanges of land belonging to any state forest, game preserve, conservation area, or other territory designated by law for particular purposes shall be made so as to consolidate or fill out the state's holdings of land therein, and not materially to reduce the same.\nThe commissioner shall cause the state land and the land proposed to be exchanged therefor to be examined and value determined as provided in section 84.0272; provided, that in exchanges with the United States or any agency thereof the examination and value determination may be made in the manner as the Land Exchange Board may direct. The determined values shall not be conclusive, but shall be taken into consideration by the commissioner and the board, together with such other matters as they deem material, in determining the values for the purposes of exchange.\n(a) Except as otherwise provided, class A land shall be exchanged only for land of at least substantially equal value to the state, as determined by the commissioner, with the approval of the board.\n(b) For the purposes of this subdivision, \"substantially equal value\" means:\n(1) where the lands being exchanged are both over 100 acres, their values do not differ by more than ten percent; and\n(2) in other cases, the values of the exchanged lands do not differ by more than 20 percent.\n(c) Other than school trust land, class A land may be exchanged for land of lesser value if the other party to the exchange pays to the state the amount of the difference in value. Money received by the commissioner in such cases shall be credited to the same fund as in the case of sale of the land, if such a fund exists, otherwise to the special fund, if any, from which the cost of the land was paid, otherwise to the general fund.\nThere shall be reserved to the state in all class A land conveyed in exchange all mineral and water power rights and such other rights and easements as the commissioner, with the approval of the board, shall direct. All class A land which at the time of exchange is subject to the provisions of section 103G.545 shall remain subject thereto as a condition of the exchange, and all land received by the state in exchange for class A land within the area to which those provisions apply shall become subject thereto. Land may be received in exchange subject to any mineral reservations or other reservations thereon. All such reservations and conditions shall be taken into consideration in determining the value of the lands exchanged.\nClass A land may be exchanged for land of greater value if the other party to the exchange shall waive payment for the difference or if there is an appropriation available for the acquisition of such land from which the difference may be paid.\n[Repealed, 1Sp2005 c 1 art 2 s 162]\nBefore giving final approval to any exchange of class A land, the commissioner shall hold a public hearing thereon at the capital city or at some place which it may designate in the general area where the lands involved are situated. The commissioner shall furnish to the auditor of each county affected a notice of the hearing signed by the commissioner, together with a list of all the lands proposed to be exchanged and situated in the county, and the county auditor shall post the same in the auditor's office at least two weeks before the hearing. The commissioner shall cause a copy of the notice, referring to the list of lands posted, to be published at least two weeks before the hearing in a legal newspaper published in the county. The cost of publication of the notice shall be paid by the commissioner.\nThe commissioner, with the approval of the board, may submit a proposal for exchange of class A land to any landowner concerned. Any landowner may submit to the commissioner and the board a proposal for exchange in such form as the commissioner may prescribe.\n(a) When a private landowner or governmental unit, except the state, presents to the commissioner an offer to exchange privately or publicly held land for class A land, the private landowner or governmental unit shall pay to the commissioner fees of not less than one-half of the costs incurred by the commissioner for valuation expenses; survey expenses; legal and professional fees; costs of title work, advertising, and public hearings; transactional staff costs; and closing costs.\n(b) Except as provided in paragraph (c), any payment made under paragraph (a) shall be credited to the account from which the expenses are paid and is appropriated for expenditure in the same manner as other money in the account.\n(c) The fees shall be refunded if the land exchange offer is withdrawn by a private landowner or governmental unit before the money is obligated to be spent.\nNo exchange of class A land shall be consummated unless the commissioner determines that the title to the land proposed to be conveyed to the state is good and free from all liens, with all encumbrances identified except reservations herein authorized. The commissioner may use title insurance to aid in the title determination. If required by the commissioner, the landowner must submit an abstract of title and make and file with the commissioner an affidavit as to possession of the land, improvements, liens, and encumbrances thereon, and other matters affecting the title.\nConveyance of class A land given in exchange shall be made by deed executed by the commissioner in the name of the state. All such deeds received by the state shall be recorded or registered in the county in which the lands lie.\nLand received in exchange for class A land shall be subject to the same trust, if any, and shall otherwise have the same status as the state land given in exchange. The commissioner, with the approval of the board, shall determine accordingly the status of each tract of such land received in exchange, and shall make and file a certificate thereof in the office having custody of the state public land records in the Department of Natural Resources.\nWhen an exchange of class A tax-forfeited land, which is subject to sale by county authorities is under consideration, the commissioner may notify the county auditor to withdraw the land from sale. Thereupon the land shall be withdrawn from sale until the proposed exchange is consummated or rejected, of which the commissioner shall notify the county auditor.",
	"repealed": false
}