{
	"id": "79A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.03",
	"title": "79A.03 SELF-INSURANCE APPLICATIONS.",
	"text": "Each employer desiring to self-insure individually shall apply to the commissioner on forms available from the commissioner. The commissioner shall grant or deny the application within 60 days after a complete application is filed. The time limit may be extended for another 30 days upon 15 days' prior notice to the applicant. Any grant of authority to self-insure shall continue in effect until revoked by order of the commissioner or until such time as the employer becomes insured.\nEach application for self-insurance shall be accompanied by a certified financial statement. Certified financial statements for a period ending more than six months prior to the date of the application must be accompanied by an affidavit, signed by a company officer under oath, stating that there has been no material lessening of the net worth nor other adverse changes in its financial condition since the end of the period. The commissioner may require additional financial information necessary to carry out the purpose of this chapter.\nEach individual self-insurer's net worth, as presented on its audited balance sheet filed with the Department of Commerce, shall equal at least ten percent of the entity's total assets and shall equal at least ten times the retention level selected with the Workers' Compensation Reinsurance Association.\n(a) Each individual self-insurer shall have and maintain sufficient assets, net worth, and liquidity to promptly and completely meet all of its obligations that may arise under chapter 176 or this chapter. In determining whether a self-insurer meets this requirement, the commissioner shall consider the self-insurer's current ratio; its long-term and short-term debt to equity ratios; its net worth; financial characteristics of the particular industry in which the self-insurer is involved; any recent changes in the management and ownership of the self-insurer; any excess insurance purchased by the self-insurer from a licensed company or an authorized surplus line carrier, other than excess insurance from the Workers' Compensation Reinsurance Association; any other financial data submitted to the commissioner by the self-insurer; and the self-insurer's workers' compensation experience for the last four years. Notwithstanding any other provision of this chapter, the commissioner may deny an application for self-insurance authority or terminate existing self-insurance authority if the applicant or self-insurer does not have sufficient assets, net worth, and liquidity to promptly and completely meet all of its self-insurance obligations.\n(b) An individual self-insurer must have had positive net income as shown on audited income statements filed with the Department of Commerce during three of the last five years and cumulatively over the five-year period. If the self-insurer has been in existence less than five years, it must have had cumulative net income during the period of existence and in the most recent year.\n(c) An individual self-insurer must have had cash generated from operations as shown on the audited statements of cash flows filed with the Department of Commerce during three of the last five years and cumulatively over the five-year period. If the self-insurer has been in existence less than five years, it shall have had cumulative cash generated from operations during the period of existence and in the most recent year.\n(d) No entity shall be admitted as an individual self-insurer, or be allowed to continue its self-insurance authority, if the audit report for the most recent year includes an explanatory paragraph stating that the auditor has concluded that there is substantial doubt about the entity's ability to continue as a going concern.\nNotwithstanding the requirements of subdivisions 3 and 4, the commissioner, pursuant to a review of an existing self-insurer's financial data, may continue a self-insurer's authority to self-insure for one year if, in the commissioner's judgment based on all factors relevant to the self-insurer's financial status, the self-insurer will be able to meet its obligations under this chapter for the following year. The relevant factors to be considered must include, but must not be limited to, the liquidity ratios, leverage ratios, and profitability ratios of the self-insurer. Where a self-insurer's authority to self-insure is continued under this subdivision, the self-insurer may be required to post security in the amount equal to two times the amount of security required under section 79A.04, subdivision 2.\nWhere an employer seeking to self-insure fails to meet the financial requirements set forth in subdivisions 3 and 4, the commissioner shall grant authority to self-insure provided that an affiliated company, whose financial statement is filed with the commissioner and meets the requirements set forth in subdivisions 3 and 4, provides a written guarantee adopted by resolution of its board of directors that it will pay all workers' compensation claims incurred by its affiliate, and that it will not terminate the guarantee under any circumstances without first giving the commissioner and its affiliate 30 days' written notice. If said guarantee is withdrawn or if the guarantor ceases being an affiliate, the affiliate shall give written notice to the commissioner and the self-insured. The self-insured's authority to self-insure shall automatically terminate upon expiration of the 30-day notice period.\n(a) Two or more employers may apply to the commissioner for the authority to self-insure as a group, using forms available from the commissioner. This initial application shall be accompanied by a copy of the bylaws or plan of operation adopted by the group. Such bylaws or plan of operation shall conform to the conditions prescribed by law or rule. The commissioner shall approve or disapprove the bylaws within 60 days unless a question as to the legality of a specific bylaw or plan provision has been referred to the Attorney General's Office. The commissioner shall make a determination as to the application within 15 days after receipt of the requested response from the Attorney General's Office.\n(b) After the initial application and the bylaws or plan of operation have been approved by the commissioner or at the time of the initial application, the group shall submit the names of employers that will be members of the group; an indemnity agreement providing for joint and several liability for all group members for any and all workers' compensation claims incurred by any member of the group, as set forth in Minnesota Rules, part 2780.9920, signed by an officer of each member; and an accounting review performed by a certified public accountant. A certified financial audit may be filed in lieu of an accounting review.\n(c) When a group has obtained its authority to self-insure, additional applicants who wish to join the group must apply for approval by submitting, at least 45 days before joining the group: (1) an application; (2) an indemnity agreement providing for joint and several liability as set forth in Minnesota Rules, part 2780.9920, signed by an officer of the applicant; and (3) a certified financial audit performed by a certified public accountant. An accounting review performed by a certified public accountant may be filed in lieu of a certified audit.\nNew diminutive applicants to the group, as defined in section 79A.01, subdivision 11, applying for membership in groups in existence longer than one year, who have a combined equity of all group members in excess of 15 times the last retention limit selected by the group with the Workers' Compensation Reinsurance Association, and have posted 125 percent of the group's total estimated future liability, must submit the items in this paragraph at least ten days before joining the group.\nIf the cumulative total of premium added to the group by diminutive new members is greater than 50 percent in a fiscal year of the group, all subsequent new members' applications must be submitted at least 45 days before joining the group.\nIn all cases of new membership, evidence that cash premiums equal to not less than 20 percent of the current year's modified premium of each applicant have been paid into a common claims fund, maintained by the group in a designated depository, must be filed with the department at least ten days before joining the group.\nA self-insurer group shall have and maintain:\n(a) A combined net worth of all of the members of an amount at least equal to the greater of ten times the retention selected with the Workers' Compensation Reinsurance Association or one-third of the current annual modified premium of the members.\n(b) Sufficient assets, net worth, and liquidity to promptly and completely meet all obligations of its members under chapter 176 or this chapter. In determining whether a group is in sound financial condition, consideration shall be given to the combined net worth of the member companies; the consolidated long-term and short-term debt to equity ratios of the member companies; any excess insurance other than reinsurance with the Workers' Compensation Reinsurance Association, purchased by the group from an insurer licensed in Minnesota or from an authorized surplus line carrier; other financial data requested by the commissioner or submitted by the group; and the combined workers' compensation experience of the group for the last four years.\nNo authority to self-insure will be granted unless, over the term of the policy year, at least 65 percent of total revenues from all sources for the year are available for the payment of its claim and assessment obligations, and insurance premiums for stop loss coverage. For purposes of this calculation, claim and assessment obligations include the cost of allocated loss expenses as well as special compensation fund and self-insurers' security fund assessments but exclude the cost of unallocated loss expenses.\nThe commissioner shall grant or deny the group's application to self-insure within 60 days after a complete application has been filed, provided that the time may be extended for an additional 30 days upon 15 days' prior notice to the applicant. The commissioner shall grant approval for self-insurance upon a determination that the financial ability of the self-insurer's group is sufficient to fulfill all joint and several obligations of the member companies that may arise under chapter 176 or this chapter; the gross annual premium of the group members is at least 150 percent of the WCRA minimum retention in effect at the time of the application; the group has established a fund pursuant to Minnesota Rules, parts 2780.4100 to 2780.5000; the group has contracted with a licensed workers' compensation service company to administer its program; and the required securities or surety bond shall be on deposit prior to the effective date of coverage for any member. Approval shall be effective until revoked by order of the commissioner or until the employer members of the group become insured.\n(a) Incurred losses, paid and unpaid, specifying indemnity and medical losses by classification, payroll by classification, and current estimated outstanding liability for workers' compensation shall be reported to the commissioner by each self-insurer on a calendar year basis, in a manner and on forms available from the commissioner. Payroll information must be filed by April 1 of the following year.\n(b) Each self-insurer shall, under oath, attest to the accuracy of each report submitted pursuant to paragraph (a). Upon sufficient cause, the commissioner shall require the self-insurer to submit a certified audit of payroll and claim records conducted by an independent auditor approved by the commissioner, based on generally accepted accounting principles and generally accepted auditing standards, and supported by an actuarial review and opinion of the future contingent liabilities. The basis for sufficient cause shall include the following factors: where the losses reported appear significantly different from similar types of businesses; where major changes in the reports exist from year to year, which are not solely attributable to economic factors; or where the commissioner has reason to believe that the losses and payroll in the report do not accurately reflect the losses and payroll of that employer. If any discrepancy is found, the commissioner shall require changes in the self-insurer's or workers' compensation service company record-keeping practices.\n(c) An annual status report due August 1 by each self-insurer shall be filed in a manner and on forms prescribed by the commissioner.\n(d) Each individual self-insurer shall, within four months after the end of its fiscal year, annually file with the commissioner its latest 10K report required by the Securities and Exchange Commission. If an individual self-insurer does not prepare a 10K report, it shall file an annual certified financial statement, together with such other financial information as the commissioner may require to substantiate data in the financial statement.\n(e) Each member of the group shall, within six months after the end of each fiscal year for that group, submit to a certified public accountant designated by the group, the most recent annual financial statement, reviewed by a certified public accountant in accordance with the Statements on Standards for Accounting and Review Services, Volume 2, the American Institute of Certified Public Accountants Professional Standards, or audited in accordance with generally accepted auditing standards, together with such other financial information the commissioner may require. In addition, the group shall file with the commissioner, within seven months after the end of each fiscal year for that group, combining financial statements of the group members, compiled by a certified public accountant in accordance with the Statements on Standards for Accounting and Review Services, Volume 2, the American Institute of Certified Public Accountants Professional Standards. The combining financial statements shall include, but not be limited to, a balance sheet, income statement, statement of changes in net worth, and statement of cash flow. Each combining financial statement shall include a column for each individual group member along with a total column. Each combined statement shall have a statement from the certified public accountant confirming that each member has submitted the required financial statement as defined in this section. The certified public accountant shall notify the commissioner if any statement is qualified or otherwise conditional. The commissioner may require additional financial information from any group member.\nWhere a group has 50 or more members, the group shall file, in lieu of the combining financial statements, a combined financial statement showing only the total column for the entire group's balance sheet, income statement, statement of changes in net worth, and statement of cash flow. Additionally, the group shall disclose, for each member, the total assets, net worth, revenue, and income for the most recent fiscal year. The combining and combined financial statements may omit all footnote disclosures.\n(f) In addition to the financial statements required by paragraphs (d) and (e), interim financial statements or 10Q reports required by the Securities and Exchange Commission may be required by the commissioner upon an indication that there has been deterioration in the self-insurer's financial condition, including a worsening of current ratio, lessening of net worth, net loss of income, the downgrading of the company's bond rating, or any other significant change that may adversely affect the self-insurer's ability to pay expected losses. Any self-insurer that files an 8K report with the Securities and Exchange Commission shall also file a copy of the report with the commissioner within 30 days of the filing with the Securities and Exchange Commission.\n(a) The accounts and records of the group self-insurer's fund shall be audited annually. Audits shall be made by certified public accountants, based on generally accepted accounting principles and generally accepted auditing standards, and supported by actuarial review and opinion of the future contingent liabilities, in order to determine the solvency of the self-insurer's fund. All audits required by this subdivision shall be filed with the commissioner 90 days after the close of the fiscal year for the group self-insurer. The commissioner may require a special audit to be made at other times if the financial stability of the fund or the adequacy of its monetary reserves is in question.\n(b) One hundred percent of any surplus money for a fund year in excess of 125 percent of the amount necessary to fulfill all obligations under chapter 176 for that fund year may be declared refundable to a member at any time after 18 months following the end of such fund year. There can be no more than one refund in any 12-month period. When all claims of any one fund year have been fully paid, as certified by an actuary, all surplus money from that fund year may be declared refundable.\nAll members of a private self-insurer group shall be jointly and severally liable for the obligations incurred by any member of the same group under chapter 176.\nThe commissioner shall annually review the documents and reports filed by the private self-insurer.\nThe financial requirements set forth in subdivisions 3, 4, 5, and 7 must be met on an annual basis.",
	"repealed": false
}