{
	"id": "103B.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.101",
	"title": "103B.101 BOARD OF WATER AND SOIL RESOURCES.",
	"text": "The Board of Water and Soil Resources is composed of 15 appointed members knowledgeable of water and soil problems and conditions within the state and five ex officio members.\n(a) The members are:\n(1) three county commissioners;\n(2) three soil and water conservation district supervisors;\n(3) three watershed district or watershed management organization representatives;\n(4) three citizens who are not employed by, or the appointed or elected officials of, a state governmental office, board, or agency;\n(5) one township officer;\n(6) two elected city officials, one of whom must be from a city located in the metropolitan area, as defined under section 473.121, subdivision 2;\n(7) the commissioner of agriculture;\n(8) the commissioner of health;\n(9) the commissioner of natural resources;\n(10) the commissioner of the Pollution Control Agency; and\n(11) the director of the University of Minnesota Extension Service.\n(b) Members in paragraph (a), clauses (1) to (6), must be distributed across the state with at least four members but not more than six members from the metropolitan area, as defined by section 473.121, subdivision 2.\n(c) Members in paragraph (a), clauses (1) to (6), are appointed by the governor. In making the appointments, the governor may consider persons recommended by the Association of Minnesota Counties, the Minnesota Association of Townships, the League of Minnesota Cities, the Minnesota Association of Soil and Water Conservation Districts, and the Minnesota Association of Watershed Districts. The list submitted by an association must contain at least three nominees for each position to be filled.\n(d) The membership terms, compensation, removal of members and filling of vacancies on the board for members in paragraph (a), clauses (1) to (6), are as provided in section 15.0575, except that a member may be compensated at the rate of up to $125 a day.\n[Repealed, 1997 c 28 s 4]\nThe board may employ an executive director in the unclassified service and other permanent and temporary employees in accordance with chapter 43A. The board may prescribe the powers and duties of its officers and employees and may authorize its employees and members of the board to act on behalf of the board.\nThe governor shall appoint a chair from among the members of the board in subdivision 2, paragraph (a), clauses (1) to (4), with the advice and consent of the senate. The board shall elect a vice-chair and any other officers that it considers necessary from its membership.\nA majority of the board is a quorum.\nThe board may hold public hearings and adopt rules and orders necessary to execute its duties.\n[Repealed, 1997 c 28 s 4]\nThe board shall adopt bylaws that include provisions to prevent or address conflict of interest.\n(a) In addition to the powers and duties prescribed elsewhere, the board shall:\n(1) coordinate the water and soil resources planning and implementation activities of counties, soil and water conservation districts, watershed districts, watershed management organizations, and any other local units of government through its various authorities for approval of local plans, administration of state grants, contracts and easements, and by other means as may be appropriate;\n(2) facilitate communication and coordination among state agencies in cooperation with the Environmental Quality Board, and between state and local units of government, in order to make the expertise and resources of state agencies involved in water and soil resources management available to the local units of government to the greatest extent possible;\n(3) coordinate state and local interests with respect to the study in southwestern Minnesota under United States Code, title 16, section 1009;\n(4) develop information and education programs designed to increase awareness of local water and soil resources problems and awareness of opportunities for local government involvement in preventing or solving them;\n(5) provide a forum for the discussion of local issues and opportunities relating to water and soil resources management;\n(6) adopt an annual budget and work program that integrate the various functions and responsibilities assigned to it by law; and\n(7) report to the governor and the legislature by October 15 of each even-numbered year with an assessment of board programs and recommendations for any program changes and board membership changes necessary to improve state and local efforts in water and soil resources management.\n(b) The board may accept grants, gifts, donations, or contributions in money, services, materials, or otherwise from the United States, a state agency, or other source to achieve an authorized or delegated purpose. The board may enter into a contract or agreement necessary or appropriate to accomplish the transfer. The board may conduct or participate in local, state, or federal programs or projects that have as one purpose or effect the preservation or enhancement of water and soil resources and may enter into and administer agreements with local governments or landowners or their designated agents as part of those programs or projects. The board may receive and expend money to acquire conservation easements, as defined in chapter 84C, on behalf of the state and federal government consistent with Camp Ripley's Army Compatible Use Buffer Project, Sentinel Landscape program, or related conservation programs. The board may enter into agreements, including grant agreements, with Tribal nations, federal agencies, higher education institutions, local governments, and private sector organizations to carry out programs and other responsibilities prescribed or allowed by statute.\n(c) Any money received is hereby deposited in an account in a fund other than the general fund and appropriated and dedicated for the purpose for which it is granted.\nA committee of the board is established to hear and resolve disputes, appeals, and interventions under sections 103A.301 to 103A.341; 103B.101; 103B.231; 103B.345; 103D.535; 103D.537; and 103G.2242, subdivision 9. The committee is appointed by the board chair. The board shall adopt bylaws governing committee membership and duties.\n[Repealed, 2009 c 172 art 2 s 32; 2009 c 176 art 1 s 52]\n(a) The board may issue an order requiring violations to be corrected and administratively assessing monetary penalties of up to $10,000 per violation for violations of this chapter and chapters 103C, 103D, 103E, 103F, and 103G, any rules adopted under those chapters, and any standards, limitations, or conditions established by the board.\n(b) Administrative penalties issued by the board under paragraph (a) may be appealed according to section 116.072, if the recipient of the penalty requests a hearing by notifying the commissioner in writing within 30 days after receipt of the order. For the purposes of this section, the terms \"commissioner\" and \"agency\" as used in section 116.072 mean the board. If a hearing is not requested within the 30-day period, the order becomes a final order not subject to further review.\n(c) Administrative penalty orders issued under paragraph (a) may be enforced under section 116.072, subdivision 9. Penalty amounts must be remitted within 30 days of issuance of the order.\n(d) If the board determines that sufficient steps have been taken to fully resolve noncompliance, all or part of a penalty issued under this subdivision may be forgiven.\n(a) A county or watershed district with jurisdiction may issue an order requiring violations of the water resources riparian protection requirements under sections 103F.415, 103F.421, and 103F.48 to be corrected and administratively assessing monetary penalties up to $10,000 for noncompliance commencing on day one of the 11th month after the noncompliance notice was issued. The proceeds collected from an administrative penalty order issued under this section must be remitted to the county or watershed district with jurisdiction over the noncompliant site, or otherwise remitted to the Board of Water and Soil Resources.\n(b) Before exercising this authority, the Board of Water and Soil Resources must adopt a plan containing procedures for the issuance of administrative penalty orders by local governments and the board as authorized in this subdivision and subdivision 12. This plan, and any subsequent amendments, is effective 30 days after being published in the State Register.\n(c) Administrative penalties may be reissued and appealed under paragraph (a) according to section 103F.48, subdivision 9.\n(a) The Board of Water and Soil Resources shall work with drainage stakeholders to foster mutual understanding and provide recommendations for drainage system management and related water management, including recommendations for updating the drainage law in chapter 103E, the Minnesota Public Drainage Manual, and other related provisions. The board may convene informal working groups or work teams to develop information, education, and recommendations.\n(b) For the purposes of this subdivision, the Minnesota Public Drainage Manual is a publication that is prepared by and adopted by the board and that includes explanations, procedures, and guidance consistent with and supplementing the provisions of chapter 103E. The manual must include best management practices and be prepared in consultation with drainage stakeholders according to paragraph (a) for use by drainage authorities in carrying out statutory duties.\n(a) The board may adopt resolutions, policies, or orders that allow a comprehensive plan, local water management plan, or watershed management plan, developed or amended, approved and adopted, according to chapter 103B, 103C, or 103D to serve as substitutes for one another or be replaced with a comprehensive watershed management plan. The board may also develop criteria for incorporating or coordinating the elements of metropolitan county groundwater plans in accordance with section 103B.255. The board shall, to the extent practicable, incorporate a watershed approach when adopting the resolutions, policies, or orders, and shall establish a suggested watershed boundary framework for development, approval, adoption, and coordination of plans.\n(b) The board shall work with local government stakeholders and others to foster mutual understanding and develop recommendations for local water management and related state water management policy and programs. The board may convene informal working groups or work teams to develop information, education, and recommendations. Local government units may develop and carry out TMDL implementation plans, or their equivalent, as provided in chapter 114D, as part of the local water management plans and responsibilities under chapters 103B, 103C, and 103D.\n(a) Local government units may either submit a request for a plan boundary determination as part of a plan approval request or apply separately for a plan boundary determination from the board before requesting plan approval. Local government units must provide written documentation of the rationale and justification for the proposed boundary. The board may request additional information needed to make a plan boundary determination.\n(b) Local government units may appeal a board decision to deny approval of a plan or the establishment of a plan boundary. An appeal of a board decision may be taken to the state court of appeals and must be considered an appeal from a contested case decision for purposes of judicial review under sections 14.63 to 14.69. Local government units may request the board's dispute resolution committee or executive director to hear and make recommendations to resolve boundary and plan implementation disputes.\n(a) The board must work with state and federal agencies, Tribal Nations, academic institutions, local governments, practitioners, and stakeholders to foster mutual understanding and provide recommendations for standardized specifications for conservation practices, projects, and systems for:\n(1) erosion or sedimentation control;\n(2) improvements to water quality or water quantity;\n(3) habitat restoration and enhancement;\n(4) energy conservation; and\n(5) climate adaptation, resiliency, or mitigation.\n(b) The board may convene working groups or work teams to develop information, education, and recommendations.\nThe board shall work with wetland stakeholders to foster mutual understanding and provide recommendations for improvements to the management of wetlands and related land and water resources, including recommendations for updating the Wetland Conservation Act, developing an in-lieu fee program as defined in section 103G.005, subdivision 10g, and related provisions. The board may convene informal working groups or work teams to provide information and education and to develop recommendations.\n(a) The board must work with state and federal agencies, Tribal Nations, academic institutions, local governments, practitioners, and stakeholders to foster mutual understanding and to provide recommendations for standardized specifications to establish and enhance native vegetation to provide benefits for:\n(1) water quality;\n(2) soil conservation;\n(3) habitat enhancement;\n(4) energy conservation; and\n(5) climate adaptation, resiliency, or mitigation.\n(b) The board may convene working groups or work teams to develop information, education, and recommendations.\nAn account is created in the special revenue fund to support pollinators. Money may be deposited in the account only as required by law. Money in the account is annually appropriated to the Board of Water and Soil Resources for activities that support pollinator habitat.",
	"repealed": false
}