{
	"id": "85A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/85A.01",
	"title": "85A.01 CREATION; ORGANIZATION.",
	"text": "(a) The Minnesota Zoological Garden is established under the supervision and control of the Minnesota Zoological Board. The board consists of 30 public and private sector members having a background or interest in zoological societies or zoo management or an ability to generate community interest in the Minnesota Zoological Garden. Fifteen members shall be appointed by the board after consideration of a list supplied by board members serving on a nominating committee, and 15 members shall be appointed by the governor. One member of the board must be a resident of Dakota County and shall be appointed by the governor after consideration of the recommendation of the Dakota County Board. Board appointees shall not be subject to the advice and consent of the senate.\n(b) To the extent possible, the board and governor shall appoint members who are residents of the various geographic regions of the state. Terms, compensation, and removal of members are as provided in section 15.0575, except that a member may be compensated at the rate of up to $125 a day. In making appointments, the governor and board shall utilize the appointment process as provided under section 15.0597 and consider, among other factors, the ability of members to garner support for the Minnesota Zoological Garden.\n(c) A member of the board may not be an employee of or have a direct or immediate family financial interest in a business that provides goods or services to the zoo. A member of the board may not be an employee of the zoo.\n[Repealed, 1Sp1985 c 13 s 376 subd 3]\n[Repealed, 1989 c 335 art 1 s 270]\nThe board shall annually elect from among its members a chair and other officers necessary for the performance of its duties.\nThe director, officers and employees are included in the meaning of state employee under the provisions of section 352.01, subdivision 2A.\nThe board shall meet at such times and places as it may determine.\nMembers of the board are not required to file a statement of economic interest with the state Campaign Finance and Public Disclosure Board under section 10A.09.",
	"repealed": false
}