{
	"id": "238.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.43",
	"title": "238.43 REGIONAL CHANNEL.",
	"text": "[Renumbered 238.02, subd 31c]\nThe purpose of this section is to facilitate the activation of a metropolitan area interconnected regional channel, to be uniformly carried on VHF channel 6 on cable communications systems operating in the metropolitan area in order to provide a broad range of informational, educational, and public service programs and materials to metropolitan area cable subscribers.\nFranchises for cable communications systems franchised in whole or in part within the metropolitan area shall contain a provision designating the standard VHF channel 6 for uniform regional channel usage; provided, however, that until the regional channel becomes operational, the designated VHF channel 6 may be utilized by the cable communications system as it deems appropriate. The designated regional channel may be combined with the government access channel until such time as the video programming usage of the government access channel expands to such point as it is in use during 80 percent of the time between 8:00 a.m. and 10:00 p.m. during any consecutive six-week period. Use of time on the regional channel must be made available without charge.\nThe regional channel will provide a broad range of informational, educational, and public service programs and materials to metropolitan area cable subscribers.\nThe Cable Communications Board may designate a regional channel entity prior to July 1, 1985. If the Cable Communications Board does not designate an entity by June 30, 1985, the Metropolitan Council shall appoint the governing body of the regional channel entity which must consist of 15 members appointed to three-year terms. In making the initial appointments the Metropolitan Council shall designate one-third of the appointees to serve one-year terms, one-third to serve two-year terms, and one-third to serve three-year terms. In the case of a vacancy the council shall appoint a person to fill the vacancy for the remainder of the unexpired term. The Metropolitan Council shall name three appointees from the recommendations received from the Association of Metropolitan Municipalities and three from the recommendations received from the cable communications companies operating in the metropolitan area.\nThe regional channel entity may operate the regional channel or designate the operator of the regional channel. In the event the regional channel entity designates the operator of the regional channel, the designation must be for an initial period not exceeding three years. Before the expiration of the three-year period, the regional channel entity shall review its designation and consider renewal for a term not exceeding three years. Nothing in this section creates any right to renewal for the operator designated by the regional channel entity.",
	"repealed": false
}