{
	"id": "259A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/259A.05",
	"title": "259A.05 PROGRAM ADMINISTRATION.",
	"text": "The title IV-E Adoption Assistance Program shall operate according to the requirements of United States Code, title 42, sections 671 and 673, and Code of Federal Regulations, parts 1355 and 1356.\n(a) AFDC relatedness is one eligibility component of title IV-E adoption assistance. The AFDC relatedness determination shall be made by an agency according to policies and procedures prescribed by the commissioner.\n(b) Subject to commissioner approval, the child-placing agency shall certify a child's eligibility for adoption assistance in writing on the forms prescribed by the commissioner according to section 259A.15.\n(c) Children who meet all eligibility criteria, except those specific to title IV-E, shall receive adoption assistance paid through state funds.\n(d) The child-placing agency is responsible for assisting the commissioner with the administration of the adoption assistance program by conducting assessments, reassessments, negotiations, and other activities as specified by the requirements and procedures prescribed by the commissioner.\n(e) The child-placing agency shall notify an adoptive parent of a child's eligibility for Medicaid in the state of residence. In Minnesota, the child-placing agency shall refer the adoptive parent to the appropriate social service agency in the parent's county of residence that administers medical assistance. The child-placing agency shall inform the adoptive parent of the requirement to comply with the rules of the applicable Medicaid program.\nThe commissioner shall specify procedures, requirements, and deadlines for the administration of adoption assistance in accordance with this section.\n(a) Parents who adopt children with special needs must be informed of the adoption tax credit.\n(b) The commissioner shall actively seek ways to promote the adoption assistance program, including informing prospective adoptive parents of eligible children under guardianship of the commissioner and the availability of adoption assistance.\nThe commissioner of children, youth, and families may transfer funds into the adoption assistance account when a deficit in the adoption assistance program occurs.",
	"repealed": false
}