{
	"id": "508.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.73",
	"title": "508.73 EMINENT DOMAIN; REVERSION; VACATION; NEW CERTIFICATE.",
	"text": "If the land of a registered owner, or any right, title, interest, or estate therein is taken by eminent domain, the state or body politic, or other authority which exercises such right, shall file for registration a certified copy of a final certificate or a certified copy of a court order transferring title pursuant to section 117.042 together with an instrument containing a description of the land so taken, together with the name of each owner thereof, and referring to each certificate of title by its number and place of registration in the register of titles, and stating what estate or interest in the land is taken, and for what purpose. A memorial of the right, title, interest, or estate thus taken shall be made upon each certificate of title by the registrar, and if the fee is taken, a new certificate shall be entered in the name of the owner for the land remaining to the owner after such taking. A new certificate may not be entered except by order of the district court or upon the written certification of the examiner of titles as to the legal sufficiency of the final certificate or court order pursuant to section 117.042 and other instruments presented for filing for the purpose of issuance of a new certificate. If the owner has a lien for damages upon the land thus taken, this fact shall be stated in the memorial of registration. All fees on account of any memorial of registration or entry of new certificates for land thus taken shall be paid by the state or body politic or other authority which takes the land. If land which was taken for public use reverts, by operation of law, to the owner or to the owner's heirs or assigns, the district court, upon the application of the person entitled to the benefit of such reversion, and after due notice and hearing, may order the entry of a new certificate of title to the person entitled thereto.\nUpon the filing of a certified copy of a resolution or ordinance by a city vacating an adjoining street or alley that was dedicated to the public in a plat, a registered owner is entitled to have added to the legal description on the certificate of title that part of the vacated street or alley that accrues to it, provided the vacation occurred after the land was originally registered. The vacated street or alley may be added to the certificate of title by order of the district court or by a written directive from the examiner of titles.",
	"repealed": false
}