{
	"id": "297G.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.16",
	"title": "297G.16 STATUTES OF LIMITATIONS.",
	"text": "Except as otherwise provided in this chapter, the amount of any tax due must be assessed within 3-1/2 years after a return is filed.\nFor the purposes of this section, a return filed before the last day prescribed by law for filing is considered filed on the last day.\nWhen a person required to file a return under this chapter files a false or fraudulent return or claim for refund, or fails to file a return, the tax may be assessed, and a proceeding in court for the collection of such tax may be begun at any time.\nIf a person required to file a return omits from the return an amount properly includable in it that is in excess of 25 percent of the amount of tax reported in the return, the tax may be assessed, or a proceeding in court for the collection of the tax may be begun, at any time within 6-1/2 years after the return was filed.\nUnless otherwise provided in this chapter, a claim for a refund of an overpayment of tax must be filed within 3-1/2 years from the date prescribed for filing the return, plus any extension of time granted for filing the return, but only if filed within the extended time, or within one year from the date of an order assessing tax or from the date of a return filed by the commissioner, upon payment in full of the tax, penalties, and interest shown on the order or return made by the commissioner, whichever period expires later.\nClaims for refund under section 297G.12, subdivision 2, must be filed with the commissioner within one year from the date of the breakage or destruction order.\nClaims for refund must be filed with the commissioner within one year of the filing of the taxpayer's income tax return containing the bad debt deduction that is being claimed. Claimants under this subdivision are subject to the notice requirements of sections 289A.38 to 289A.382.\nIf, before the expiration of the time prescribed in this chapter for the assessment of the tax, the commissioner and the person filing the return consent in writing to an extension of time for the assessment of the tax, the tax may be assessed at any time before the expiration of the period agreed upon. The period so agreed upon may be extended by subsequent agreements in writing made before the expiration of the period previously agreed upon.\nThe running of the period during which a tax must be assessed or collection proceedings commenced is suspended during the period from the date of a filing of a petition in bankruptcy until 30 days after either notice to the commissioner that the bankruptcy proceedings have been closed or dismissed, or the automatic stay has been terminated or has expired, whichever occurs first.\nThe suspension of the statute of limitations under this section applies to the person the petition in bankruptcy is filed against and other persons who may also be wholly or partially liable for the tax.",
	"repealed": false
}