{
	"id": "72A.2031",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.2031",
	"title": "72A.2031 DEFINITIONS.",
	"text": "For purposes of sections 72A.203 to 72A.2036, the terms defined in this section have the meanings given them.\n\"Annuity\" means an annuity that is an insurance product under state law that is individually solicited, whether the product is classified as an individual or group annuity.\nMS 2020 [Repealed, 2022 c 84 s 24]\n\"Cash compensation\" means any discount, concession fee, service fee, commission, sales charge, loan, override, or cash benefit received by an insurance producer from an insurer, intermediary, or consumer in connection with recommending or selling an annuity.\n\"Consumer profile information\" means information that is reasonably appropriate to determine whether a recommendation addresses the consumer's financial situation, insurance needs, and financial objectives, including at a minimum the following:\n(1) age;\n(2) annual income and anticipated material changes in annual income;\n(3) financial situation and needs, including debts and other obligations, and anticipated material changes in financial situation and needs;\n(4) financial experience;\n(5) insurance needs;\n(6) financial objectives;\n(7) intended use of the annuity;\n(8) financial time horizon;\n(9) existing assets or financial products, including investment, annuity, and insurance holdings, and anticipated material changes in existing assets;\n(10) liquidity needs and anticipated material changes in liquidity needs;\n(11) liquid net worth and anticipated material changes in liquid net worth;\n(12) risk tolerance, including but not limited to willingness to accept nonguaranteed elements in the annuity;\n(13) financial resources used to fund the annuity;\n(14) tax status; and\n(15) whether or not the consumer has a reverse mortgage.\n\"Continuing education credit\" or \"CE credit\" means one continuing education credit earned pursuant to section 45.30, subdivision 4.\n\"Continuing education provider\" or \"CE provider\" means an approved education provider under chapter 45.\n\"FINRA\" means the Financial Industry Regulatory Authority or a succeeding agency.\n\"Insurer\" means a company required to be licensed under the laws of this state to provide insurance products, including annuities.\n\"Insurance producer\" means a person required to be licensed under the laws of this state to sell, solicit, or negotiate insurance, including annuities. For purposes of sections 72A.203 to 72A.2036, insurance producer includes an insurer where no insurance producer is involved.\n\"Intermediary\" means an entity contracted directly with an insurer or with another entity contracted with an insurer to facilitate the sale of the insurer's annuities by insurance producers.\n\"Material conflict of interest\" means a financial interest of the insurance producer in the sale of an annuity that a reasonable person would expect to influence the impartiality of a recommendation. The payment of compensation, including both cash and noncash compensation, does not in and of itself constitute a material conflict of interest.\n\"Noncash compensation\" means any form of compensation that is not cash compensation, including but not limited to health insurance, office rent, office support, and retirement benefits.\n\"Nonguaranteed elements\" means the premiums and credited interest rates, including any bonus, benefits, values, dividends, noninterest-based credits, charges, or elements of formulas used to determine any of the elements in this subdivision, that are subject to company discretion and are not guaranteed at issue. An element is considered nonguaranteed if any of the underlying nonguaranteed elements are used in the element's calculation.\n\"Recommendation\" means advice provided by an insurance producer to an individual consumer that was intended to result or does result in a purchase, exchange, or replacement of an annuity in accordance with the advice rendered. Recommendation does not include a general communication to the public, generalized customer services, assistance or administrative support, general educational information and tools, prospectuses, or other product and sales material.\nMS 2020 [Repealed, 2022 c 84 s 24]\n\"Replacement\" means a transaction in which a new annuity is to be purchased and it is known or should be known to the proposing insurance producer or the proposing insurer, whether or not an insurance producer is involved, that by reason of the transaction an existing annuity or other insurance policy has been or is to be any of the following:\n(1) lapsed, forfeited, surrendered or partially surrendered, assigned to the replacing insurer, or otherwise terminated;\n(2) converted to reduced paid-up insurance, continued as extended term insurance, or otherwise reduced in value by the use of nonforfeiture benefits or other policy values;\n(3) amended so as to effect either a reduction in benefits or in the term for which coverage would otherwise remain in force or for which benefits would be paid;\n(4) reissued with any reduction in cash value; or\n(5) used in a financed purchase.\nMS 2020 [Repealed, 2022 c 84 s 24]",
	"repealed": false
}