{
	"id": "326B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.02",
	"title": "326B.02 POWERS.",
	"text": "The responsibilities of the commissioner of administration relating to the State Building Code, sections 16B.59 to 16B.76; construction of low-cost manufactured home park storm shelters, section 327.205; manufactured homes, sections 327.31 to 327.36 and 327B.01 to 327B.12; and statutory warranties in connection with the sale of dwellings and home improvement work, chapter 327A, are transferred under section 15.039 to the commissioner of labor and industry as amended and recodified in this chapter. The responsibilities of the commissioner of health relating to the State Plumbing Code and licensing, sections 16B.61, 144.99 to 144.993, and 326.37 to 326.45, and water conditioning contractors and installers, sections 326.57 to 326.65, are transferred under section 15.039 to the commissioner of labor and industry as amended and recodified in this chapter except for responsibilities transferred to the Plumbing Board as expressly provided in this chapter. The responsibilities of the commissioner of commerce relating to residential contractors, residential remodelers, residential roofers, manufactured home installers, and the contractor's recovery fund under sections 45.027 to 45.23 and 326.83 to 326.992 are transferred under section 15.039 to the commissioner of labor and industry as amended and recodified in this chapter. The responsibilities of the Board of Electricity relating to the State Electrical Code and licensing, sections 16B.61 and 326.241 to 326.248, are transferred under section 15.039 to the commissioner of labor and industry as amended and recodified in this chapter except for responsibilities transferred to the Board of Electricity as expressly provided in this chapter.\nThe commissioner of administration may not use the authority under section 16B.37 to modify the transfers of authority to the Plumbing Board, the Board of Electricity, or the Board of High Pressure Piping Systems under this chapter.\nFor purposes of subdivision 1, responsibilities include powers, duties, rights, obligations, and other authority imposed by law.\nThe state fire marshal shall work with the commissioner to improve the delivery of services to the public through the coordination of services and utilization of technology.\nThe commissioner may, under the rulemaking provisions of chapter 14 and as otherwise provided by this chapter, adopt, amend, suspend, and repeal rules relating to the commissioner's responsibilities under this chapter, except for rules for which the rulemaking authority is expressly transferred to the Plumbing Board, the Board of Electricity, or the Board of High Pressure Piping Systems.\nThe commissioner of labor and industry, consistent with the recommendations of the state fire marshal, shall adopt a State Fire Code and make amendments thereto in accordance with the Administrative Procedure Act in chapter 14. The code and its amendments shall conform insofar as practicable to model fire codes generally accepted and in use throughout the United States, with consideration given to existing statewide specialty codes presently in use in the state of Minnesota. Statewide specialty codes and model codes with necessary modifications may be adopted by reference in accordance with section 14.07, subdivision 4.",
	"repealed": false
}