{
	"id": "290.431",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.431",
	"title": "290.431 NONGAME WILDLIFE CHECKOFF.",
	"text": "Every individual who files an income tax return or property tax refund claim form may designate on their original return that $1 or more shall be added to the tax or deducted from the refund that would otherwise be payable by or to that individual and paid into an account to be established for the management of nongame wildlife. The commissioner of revenue shall, on the income tax return and the property tax refund claim form, notify filers of their right to designate that a portion of their tax or refund shall be paid into the nongame wildlife management account. The sum of the amounts so designated to be paid shall be credited to the nongame wildlife management account for use by the nongame program in the Department of Natural Resources. All interest earned on money accrued, gifts to the program, contributions to the program, and reimbursements of expenditures in the nongame wildlife management account shall be credited to the account by the commissioner of management and budget, except that gifts or contributions received directly by the commissioner of natural resources and directed by the contributor for use in specific nongame field projects or geographic areas shall be handled according to section 84.085, subdivision 1.\nThe state pledges and agrees with all contributors to the nongame wildlife management account to use the funds contributed solely for the management of nongame wildlife projects and further agrees that it will not impose additional conditions or restrictions that will limit or otherwise restrict the ability of the commissioner of natural resources to use the available funds for the most efficient and effective management of nongame wildlife. The commissioner may use funds appropriated for nongame wildlife programs for the purpose of developing, preserving, restoring, and maintaining wintering habitat for neotropical migrant birds in Latin America and the Caribbean under agreement or contract with any nonprofit organization dedicated to the construction, maintenance, and repair of such projects that are acceptable to the governmental agency having jurisdiction over the land and water affected by the projects. Under this authority, the commissioner may execute agreements and contracts if the commissioner determines that the use of the funds will benefit neotropical migrant birds that breed in or migrate through the state.",
	"repealed": false
}