{
	"id": "147D.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/147D.17",
	"title": "147D.17 LICENSURE REQUIREMENTS.",
	"text": "To be eligible for licensure, an applicant, with the exception of those seeking licensure by reciprocity under subdivision 2, must:\n(1) submit a completed application on forms provided by the board along with all fees required under section 147D.27 that includes:\n(i) the applicant's name, Social Security number, home address and telephone number, and business address and telephone number;\n(ii) a list of degrees received from educational institutions;\n(iii) a description of the applicant's professional training;\n(iv) a list of registrations, certifications, and licenses held in other jurisdictions;\n(v) a description of any other jurisdiction's refusal to credential the applicant;\n(vi) a description of all professional disciplinary actions initiated against the applicant in any jurisdiction; and\n(vii) any history of drug or alcohol abuse, and any misdemeanor or felony conviction;\n(2) submit a diploma from an approved education program or submit evidence of having completed an apprenticeship;\n(3) submit a verified copy of a valid and current credential, issued by the North American Registry of Midwives or other national organization recommended by the advisory council and approved by the board, as a certified professional midwife;\n(4) submit current certification from the American Heart Association or the American Red Cross for adult and infant cardiopulmonary resuscitation;\n(5) submit a copy of the applicant's medical consultation plan;\n(6) submit documentation verifying that the applicant has the following practical experience through an apprenticeship or other supervisory setting:\n(i) the provision of 75 prenatal examinations, including 20 initial examinations;\n(ii) supervised participation in 20 births, ten of which must be in a home setting;\n(iii) participation as the primary birth attendant under the supervision of a licensed traditional midwife at an additional 20 births, ten of which must have occurred outside a state licensed health care facility;\n(iv) 20 newborn examinations; and\n(v) 40 postpartum examinations;\n(7) submit additional information as requested by the board, including any additional information necessary to ensure that the applicant is able to practice with reasonable skill and safety to the public;\n(8) sign a statement that the information in the application is true and correct to the best of the applicant's knowledge and belief; and\n(9) sign a waiver authorizing the board to obtain access to the applicant's records in this or any other state in which the applicant has completed an approved education program or engaged in the practice of traditional midwifery.\nTo be eligible for licensure by reciprocity, the applicant must be credentialed by the North American Registry of Midwives or other national organization recommended by the advisory council and approved by the board and must:\n(1) submit the application materials and appropriate fees as required under subdivision 1, clauses (1), (3), (4), (5), (6), (7), (8), and (9), and section 147D.27;\n(2) provide a verified copy from the appropriate body of a current and unrestricted credential for the practice of traditional midwifery in another jurisdiction that has initial credentialing requirements equivalent to or higher than the requirements in subdivision 1; and\n(3) provide letters of verification from the appropriate government body in each jurisdiction in which the applicant holds a credential. Each letter must state the applicant's name, date of birth, credential number, date of issuance, a statement regarding disciplinary actions, if any, taken against the applicant, and if the applicant is in good standing in that jurisdiction.\nThe board may issue a temporary permit to practice as a licensed traditional midwife to an applicant eligible for licensure under this section if the application for licensure is complete, all applicable requirements in this section have been met, and a nonrefundable fee set by the board has been paid. The permit remains valid only until the meeting of the board at which a decision is made on the application for licensure.\nMS 2014 [Repealed, 2016 c 125 s 16]\nLicenses issued under this chapter expire annually.\n(a) To be eligible for license renewal, a licensed traditional midwife must:\n(1) complete a renewal application on a form provided by the board;\n(2) submit the renewal fee;\n(3) provide evidence every three years of a total of 30 hours of continuing education approved by the board as described in section 147D.21;\n(4) submit evidence of an annual peer review and update of the licensed traditional midwife's medical consultation plan; and\n(5) submit any additional information requested by the board. The information must be submitted within 30 days after the board's request, or the renewal request is nullified.\n(b) A licensee must maintain a correct mailing address with the board for receiving board communications, notices, and license renewal documents. Placing the license renewal application in first-class United States mail, addressed to the licensee at the licensee's last known address with postage prepaid, constitutes valid service. Failure to receive the renewal documents does not relieve a licensee of the obligation to comply with this section.\n(c) The name of a licensee who does not return a complete license renewal application, annual license fee, or late application fee, as applicable, within the time period required by this section shall be removed from the list of individuals authorized to practice during the current renewal period. If the licensee's license is reinstated, the licensee's name shall be placed on the list of individuals authorized to practice.\nA licensed traditional midwife who changes addresses must inform the board within 30 days, in writing, of the change of address. All notices or other correspondence mailed to or served on a licensed traditional midwife by the board at the licensed traditional midwife's address on file with the board shall be considered as having been received by the licensed traditional midwife.\nAt least 30 days before the license renewal date, the board shall send out a renewal notice to the last known address of the licensed traditional midwife on file. The notice must include a renewal application and a notice of fees required for renewal. It must also inform the licensed traditional midwife that licensure will expire without further action by the board if an application for license renewal is not received before the deadline for renewal. The licensed traditional midwife's failure to receive this notice shall not relieve the licensed traditional midwife of the obligation to meet the deadline and other requirements for license renewal. Failure to receive this notice is not grounds for challenging expiration of licensure status.\nThe renewal application and fee must be postmarked on or before July 1 or as determined by the board. If the postmark is illegible, the application shall be considered timely if received by the third working day after the deadline.\n(a) A license may be placed in inactive status upon application to the board by the licensed traditional midwife and upon payment of an inactive status fee.\n(b) Licensed traditional midwives seeking restoration to active from inactive status must pay the current renewal fees and all unpaid back inactive fees. They must meet the criteria for renewal specified in subdivision 6, including continuing education hours equivalent to one hour for each month of inactive status, prior to submitting an application to regain licensure status. If the inactive status extends beyond five years, a qualifying score on a credentialing examination, or completion of an advisory council-approved eight-week supervised practical experience is required. If the licensed traditional midwife intends to regain active licensure by means of eight weeks of advisory council-approved practical experience, the licensed traditional midwife shall be granted temporary licensure for a period of no longer than six months.\nFor any individual whose licensure status has lapsed for two years or less, to regain licensure status, the individual must:\n(1) apply for license renewal according to subdivision 6;\n(2) document compliance with the continuing education requirements of section 147D.21 since the licensed traditional midwife's initial licensure or last renewal; and\n(3) submit the fees required under section 147D.27 for the period not licensed, including the fee for late renewal.\n(a) A licensee whose license has lapsed under subdivision 11 before January 1, 2020, and who seeks to regain licensed status after January 1, 2020, shall be treated as a first-time licensee only for purposes of establishing a license renewal schedule, and shall not be subject to the license cycle conversion provisions in section 147D.29.\n(b) This subdivision expires July 1, 2022.\nThe board shall not renew, reissue, reinstate, or restore a license that has lapsed and has not been renewed within two licensure renewal cycles starting July 1999. A licensed traditional midwife whose license is canceled for nonrenewal must obtain a new license by applying for licensure and fulfilling all requirements then in existence for initial licensure as a licensed traditional midwife.\n(a) A licensed traditional midwife holding an active license as a licensed traditional midwife in the state may, upon approval of the board, be granted licensure cancellation if the board is not investigating the person as a result of a complaint or information received or if the board has not begun disciplinary proceedings against the licensed traditional midwife. Such action by the board shall be reported as a cancellation of licensure in good standing.\n(b) A licensed traditional midwife who receives board approval for licensure cancellation is not entitled to a refund of any license fees paid for the licensure period in which cancellation of the license occurred.\n(c) To obtain licensure after cancellation, a licensed traditional midwife must obtain a new license by applying for licensure and fulfilling the requirements then in existence for obtaining an initial license as a traditional midwife.",
	"repealed": false
}