{
	"id": "62C.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/62C.17",
	"title": "62C.17 LICENSE FOR SOLICITOR OR AGENT.",
	"text": "No person shall act as a solicitor or agent for solicitation of subscribers on behalf of a service plan corporation, except an officer of the corporation, until that person obtains a license from the commissioner. The license shall be granted to qualified persons only upon request of the service plan corporation. The commissioner may establish by rule reasonable standards of qualification.\nApplications for license shall be submitted to the commissioner on forms provided by the commissioner. Except as provided in subdivision 3, the applicant shall pass a written examination reasonably designed to determine whether the applicant is qualified to be licensed as an agent or solicitor. The examination shall be pertinent to the contracts and coverage furnished by the corporation and shall be comparable to the examination required for a health and accident insurance agent's license. Prior to examination or reexamination, and prior to issuance or renewal of a license, the applicant shall pay to the commissioner the fees required for examination or reexamination for, and issuance or renewal of, an insurance agent's license for one line of insurance. The license shall expire May 31 of each year unless renewed by written request with payment of the renewal fee. The license shall not authorize a person to act as an insurance agent or solicitor.\nThe commissioner shall issue and renew licenses without examination for a person who holds a valid health and accident insurance agent's license of this state or who as of October 1, 1971 has been employed as a solicitor or agent for solicitation of subscribers for not less than two years for the corporation to which the license would apply, is a full-time employee of the corporation, and has never had an insurance agent's license of this state denied, revoked, or suspended.\nThe commissioner may at any time after a hearing pursuant to the contested case provisions of chapter 14, revoke or suspend a license if satisfied that the licensee is not qualified. An application for a new license or for reinstatement may be entertained one year after revocation or suspension, upon filing of a bond in the amount of $5,000 approved by the commissioner for protection of the public for a period of five years, or a lesser amount and period as the commissioner may prescribe. The commissioner shall revoke or suspend a license upon written request by the corporation or agent for which the licensee is licensed to act. Such a request shall include a statement of the specific facts constituting cause for termination. Any such information shall be deemed a confidential and privileged communication, and shall not be admissible, in whole or in part, in any action or proceeding without the corporation's or agent's written consent.\nA person shall not be qualified for a license if upon examination or reexamination it is determined that the person is incompetent to act as a producer, if the person has acted in any manner which would disqualify a person to hold a license as an insurance producer under sections 60K.30 to 60K.56, or if the person fails to produce documents subpoenaed by the commissioner, or fails to appear at a hearing to which the person is a party or has been subpoenaed, if the production of documents or appearance is lawfully required.",
	"repealed": false
}