{
	"id": "442A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.02",
	"title": "442A.02 SANITARY DISTRICTS; PROCEDURES AND AUTHORITY.",
	"text": "The chief administrative law judge shall conduct proceedings, make determinations, and issue orders for the creation of a sanitary district formed under this chapter or the annexation, detachment, or dissolution of a sanitary district previously formed under Minnesota Statutes 2012, sections 115.18 to 115.37.\nThe chief administrative law judge may order the consolidation of separate proceedings in the interest of economy and expedience.\nThe chief administrative law judge may contract with regional, state, county, or local planning commissions and hire expert consultants to provide specialized information and assistance.\nAny person conducting a proceeding under this chapter may administer oaths and affirmations; receive testimony of witnesses and the production of papers, books, and documents; examine witnesses; and receive and report evidence. Upon the written request of a presiding administrative law judge or a party, the chief administrative law judge may issue a subpoena for the attendance of a witness or the production of books, papers, records, or other documents material to any proceeding under this chapter. The subpoena is enforceable through the district court in the district in which the subpoena is issued.\nThe chief administrative law judge may adopt rules that are reasonably necessary to carry out the duties and powers imposed upon the chief administrative law judge under this chapter. The chief administrative law judge may initially adopt rules according to section 14.386. Notwithstanding section 16A.1283, the chief administrative law judge may adopt rules establishing fees.\nThe chief administrative law judge may prescribe by rule a schedule of filing fees for any petitions filed under this chapter.\nAny party may request the chief administrative law judge to cause a transcript of the hearing to be made. Any party requesting a copy of the transcript is responsible for its costs.\n(a) In any proceeding under this chapter, the chief administrative law judge or conductor of the proceeding may at any time in the process require representatives from any petitioner, property owner, or involved city, town, county, political subdivision, or other governmental entity to meet together to discuss resolution of issues raised by the petition or order that confers jurisdiction on the chief administrative law judge and other issues of mutual concern. The chief administrative law judge or conductor of the proceeding may determine which entities are required to participate in these discussions. The chief administrative law judge or conductor of the proceeding may require that the parties meet at least three times during a 60-day period. The parties shall designate a person to report to the chief administrative law judge or conductor of the proceeding on the results of the meetings immediately after the last meeting. The parties may be granted additional time at the discretion of the chief administrative law judge or conductor of the proceedings.\n(b) Any proposed resolution or settlement of contested issues that results in a sanitary district formation, annexation, detachment, or dissolution; places conditions on any future sanitary district formation, annexation, detachment, or dissolution; or results in the withdrawal of an objection to a pending proceeding or the withdrawal of a pending proceeding must be filed with the chief administrative law judge and is subject to the applicable procedures and statutory criteria of this chapter.\nThe chief administrative law judge shall provide information about sanitary district creations, annexations, detachments, and dissolutions to the Minnesota Pollution Control Agency. The Minnesota Pollution Control Agency is responsible for maintaining the official record, including all documentation related to the processes.\nThe chief administrative law judge and the Minnesota Pollution Control Agency shall agree on an amount to be transferred from the Minnesota Pollution Control Agency to the chief administrative law judge to pay for administration of this chapter, including publication and notification costs. Sanitary district fees collected by the chief administrative law judge shall be deposited in the environmental fund.",
	"repealed": false
}