{
	"id": "297G.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.03",
	"title": "297G.03 DISTILLED SPIRITS AND WINE; RATE OF TAX.",
	"text": "The following excise tax is imposed on all distilled spirits and wine manufactured, imported, sold, or possessed in this state:\nIn computing the tax on a package of distilled spirits or wine, a proportional tax at a like rate on all fractional parts of a gallon or liter must be paid, except that the tax on a fractional part of a gallon less than 1/16 of a gallon is the same as for 1/16 of a gallon.\nThe tax on miniatures is 14 cents per bottle.\nThe metric tax is imposed on all products taxable under this section when the net contents are stated in metric units of measure. The commissioner may establish by rule a date and procedure for the conversion of excise tax computation and reporting from rates expressed in gallons to rates expressed in metric volumes. The official conversion factor is one liter equals 0.264172 United States gallons.\nA tax of one cent is imposed on each bottle or container of distilled spirits and wine except as provided in 297G.07, subdivision 3. The wholesaler is responsible for the payment of this tax when the bottles of distilled spirits and wine are removed from inventory for sale, delivery, or shipment.\n(a) A qualified distiller producing distilled spirits is entitled to a tax credit of $1.33 per liter on 100,000 liters sold in any fiscal year beginning July 1. A qualified distiller may take the credit on the 18th day of each month, but the total credit allowed may not exceed in any fiscal year the lesser of:\n(1) the liability for tax; or\n(2) $133,000.\n(b) For purposes of this subdivision, \"qualified distiller\" means a microdistillery qualifying under section 340A.101, subdivision 17a, in the calendar year immediately preceding the calendar year for which the credit under this subdivision is claimed.\n(a) A qualified winery producing wine or cider is entitled to a tax credit equal to the excise tax due under subdivision 1, paragraphs (b) to (g), on the wine or cider sold in any fiscal year beginning July 1. A qualified winery may take the credit on the 18th day of each month, but the total credit allowed may not exceed, in any fiscal year, the lesser of:\n(1) the liability for tax; or\n(2) $136,275.\n(b) For purposes of this subdivision, \"qualified winery\" means a winery, whether or not located in this state, that manufactured fewer than 75,000 gallons of wine and cider in the calendar year immediately preceding the fiscal year for which the credit under this subdivision is claimed.\n(c) By February 15 of each year, beginning in 2019, the commissioner of revenue shall provide a report to the chairs and ranking minority members of the legislative committees having jurisdiction over taxes that includes the following information for the previous fiscal year, regarding the credit authorized under this subdivision:\n(1) the total amount of the tax expenditure for the credit, including the amount of credits claimed by Minnesota small wineries and out-of-state small wineries; and\n(2) the number of claimants for the credit, including the number of Minnesota small wineries and the number of out-of-state small wineries.",
	"repealed": false
}