{
	"id": "136A.675",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.675",
	"title": "136A.675 RISK ANALYSIS.",
	"text": "(a) To screen and detect whether an institution may not be financially or administratively responsible, the office shall develop financial and nonfinancial indicators. The development of financial and nonfinancial indicators shall use industry standards as guidance.\n(b) Annually, the office must provide a copy of the financial and nonfinancial indicators to each registered institution and post a list of reviewed indicators on the office website.\n(c) The office shall use regularly reported data submitted to the federal government or other regulatory or accreditation agencies wherever possible.\n(d) The office must use the indicators in this subdivision to identify institutions at potential risk of being unable to meet the standards established under sections 136A.646; 136A.64, subdivision 3; 136A.65, subdivisions 1a and 4, paragraph (a), clauses (1), (2), (3), and (7); and 136A.685 and thus unlikely to meet its financial obligations or complete its academic terms for the next 18 months.\n(a) In addition to the information required for the indicators in subdivision 1, an institution must notify the office within ten business days if any of the events in paragraphs (b) to (e) occur.\n(b) Related to revenue, debt, and cash flow, notice is required if:\n(1) the institution defaulted on a debt payment or covenant and has not received a waiver of the violation from the financial institution within 60 days;\n(2) for institutions with a federal composite score of less than 1.5, the institution's owner withdraws equity that directly results in a composite score of less than 1.0, unless the withdrawal is a transfer between affiliated entities included in a common composite score;\n(3) the United States Department of Education requires a 25 percent or greater Letter of Credit, except when the Letter of Credit is imposed due to a change of ownership;\n(4) the United States Department of Education requires Heightened Cash Monitoring 2;\n(5) the institution receives written notification that it violated the United States Department of Education's revenue requirement under United States Code, title 20, section 1094(a)(24), as amended; or\n(6) the institution receives written notification by the United States Department of Education that it has fallen below minimum financial standards and that its continued participation in Title IV is conditioned upon satisfying an alternative standard set forth in Code of Federal Regulations, title 34, section 668.175.\n(c) Related to accreditation and licensing, notice is required if:\n(1) the institution receives written notification of probation, warning, show-cause, or loss of institutional accreditation;\n(2) the institution receives written notification that its institutional accreditor lost federal recognition; or\n(3) the institution receives written notification that it has materially violated state authorization or institution licensing requirements in a different state that may lead to or has led to the termination of the institution's ability to continue to provide educational programs or otherwise continue to operate in that state.\n(d) Related to securities, notice is required if:\n(1) the Securities and Exchange Commission (i) issues an order suspending or revoking the registration of the institution's securities, or (ii) suspends trading of the institution's securities on any national securities exchange;\n(2) the national securities exchange on which the institution's securities are traded notifies the institution that it is not in compliance with the exchange's listing requirements and the institution's securities are delisted; or\n(3) the Securities and Exchange Commission is not in timely receipt of a required report and did not issue an extension to file the report.\n(e) Related to criminal and civil investigations, notice is required if:\n(1) the institution receives written notification of a felony criminal indictment or charges of the institution's owner;\n(2) the institution receives written notification of criminal indictment or charges of the institution's officers related to operations of the institution; or\n(3) there has been a criminal, civil, or administrative adjudication of fraud or misrepresentation in Minnesota or in another state or jurisdiction against the institution or its owner, officers, agents, or sponsoring organization.\n(a) The office shall conduct a systematic evaluation under this paragraph and make a preliminary determination as to whether action under paragraph (e) is necessary, if the office: (1) identifies a potential risk under subdivision 1, paragraph (d); (2) receives notification from an institution under subdivision 2; or (3) identifies other exigent circumstances impacting the institution that may deny students a reasonable opportunity to complete their education program at the institution or through an alternate institution with minimal disruption. The systematic evaluation must, to the extent practicable, be a collaboration between the office and the institution. The office must request additional context and information from the institution that demonstrates the administrative and financial responsibility of the institution. If the institution is not financially or administratively responsible, a contingency plan must be implemented either collaboratively or as part of a final determination under paragraph (e), clause (4).\n(b) The office shall provide notice in writing to the institution of the preliminary determination. The notice shall provide the analysis used by the office to make the determination, a request for the institution to provide additional context and information that demonstrates the administrative and financial responsibility of the institution not provided under paragraph (a), any potential action the office may take under paragraph (e), and a deadline for responding to the notice. The institution shall have no fewer than ten business days to respond to the preliminary determination.\n(c) The response from the institution to provide additional context and information must be written and may include a collaborative consultation with the office. In its response, the institution shall provide additional context, financial data, and other information, including but not limited to evidence of sound business practices, institutional financial health, compliance with the requirements of sections 136A.61 to 136A.71, or sufficient and timely plans to cure any noncompliance or to manage financial health and risk.\n(d) If the institution does not respond to the office's notice and request for additional context and information within the time required, the office's preliminary determination shall become final and the office may take any of the actions specified in the notice required by paragraph (e). If the institution responds to the office's notice, the office must reevaluate the preliminary determination. The office shall use the additional context and information provided by the institution to make a final determination and determine which actions under paragraph (e), if any, are necessary to mitigate risk to students and state financial aid under this chapter.\n(e) The office may use a final determination to:\n(1) revoke, suspend, or refuse to renew registration, approval of an institution's degree, or use of a regulated term in its name under section 136A.65, subdivision 8;\n(2) require periodic monitoring and submission of reports on the institution's administrative and financial responsibility to ascertain whether compliance and financial risk improves;\n(3) require periodic collaborative consultations with the institution on noncompliance with sections 136A.61 to 136A.71, or how the institution is managing financial health and risk;\n(4) require the institution to submit contingency plans such as teach-out plans or transfer pathways for students;\n(5) prohibit the institution from accepting tuition and fee payments made through cash, alternative loans, or the equivalent, prior to the add/drop period of the current period of instruction;\n(6) prohibit the institution from enrolling new students;\n(7) initiate alternative processes and communications with students enrolled at the institution;\n(8) require a surety bond under section 136A.646; or\n(9) submit institution closure information under section 136A.645.\n(f) The office shall provide to the institution written notice of the final determination and the actions taken under paragraph (e).\nData under this section shall be classified as financial records under section 136A.64, subdivision 2, except for the following data, which shall be public:\n(1) a final determination that is subject to action under subdivision 3, paragraph (e), clauses (1), (5), (6), and (7), and a summary of the reasons for the determination; and\n(2) data received by the office under subdivision 2, paragraph (b), clauses (2), (4), and (6); paragraph (c), clauses (1) and (2); and paragraphs (d) and (e).",
	"repealed": false
}