{
	"id": "142A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.46",
	"title": "142A.46 EARLY CHILDHOOD LEARNING AND CHILD PROTECTION FACILITIES.",
	"text": "The commissioner may make grants to state agencies and political subdivisions to construct or rehabilitate facilities for early childhood programs, crisis nurseries, or parenting time centers. The following requirements apply:\n(1) The facilities must be owned by the state or a political subdivision, but may be leased under section 16A.695 to organizations that operate the programs. The commissioner must prescribe the terms and conditions of the leases.\n(2) A grant for an individual facility must not exceed $500,000 for each program that is housed in the facility, up to a maximum of $2,000,000 for a facility that houses three programs or more. Programs include Head Start, School Readiness, Early Childhood Family Education, licensed child care, and other early childhood intervention programs.\n(3) State appropriations must be matched on a 50 percent basis with nonstate funds. The matching requirement must apply program wide and not to individual grants.\n(a) The commissioner must give priority to:\n(1) projects in counties or municipalities with the highest percentage of children living in poverty;\n(2) grants that involve collaboration among sponsors of programs under this section; and\n(3) where feasible, grants for programs that utilize Youthbuild under sections 116L.361 to 116L.366 for at least 25 percent of each grant awarded or $50,000 of the labor portion of the construction, whichever is less, if:\n(i) the work is appropriate for Youthbuild, as mutually agreed upon by the grantee and the local Youthbuild program, considering safety and skills needed;\n(ii) it is demonstrated by Youthbuild that using Youthbuild will not increase the overall cost of the project; and\n(iii) eligible programs consult with appropriate labor organizations to deliver education and training.\n(b) The commissioner may give priority to:\n(1) projects that collaborate with child care providers, including all-day and school-age child care programs, special needs care, sick child care, nontraditional hour care, and programs that include services to refugee and immigrant families;\n(2) grants for programs that will increase their child care workers' wages as a result of the grant; and\n(3) projects that will improve the quality of early childhood programs.",
	"repealed": false
}