{
	"id": "124D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.02",
	"title": "124D.02 SCHOOL BOARD POWERS; ENROLLMENT.",
	"text": "The board may establish and maintain one or more kindergartens for the instruction of children and after July 1, 1974, shall provide kindergarten instruction for all eligible children, either in the district or in another district. All children to be eligible for kindergarten must be at least five years of age on September 1 of the calendar year in which the school year commences. In addition all children selected under an early admissions policy established by the school board may be admitted. If established, a board-adopted early admissions policy must describe the process and procedures for comprehensive evaluation in cognitive, social, and emotional developmental domains to help determine the child's ability to meet kindergarten grade expectations and progress to first grade in the subsequent year. The comprehensive evaluation must use valid and reliable instrumentation, be aligned with state kindergarten expectations, and include a parent report and teacher observations of the child's knowledge, skills, and abilities. The early admissions policy must be made available to parents in an accessible format and is subject to review by the commissioner of education. The evaluation is subject to section 127A.41. Nothing in this section shall prohibit a school district from establishing Head Start, prekindergarten, or nursery school classes for children below kindergarten age. Any school board with evidence that providing kindergarten will cause an extraordinary hardship on the school district may apply to the commissioner of education for an exception.\nThe board may permit a person who is over the age of 21 or who has graduated from high school to enroll in a class or program at a secondary school if there is space available. In determining if there is space available, public school students eligible for free enrollment under section 120A.20, subdivision 1, and shared-time students shall be given priority over students seeking enrollment pursuant to this subdivision, and students returning to complete a regular course of study shall be given priority over other students seeking enrollment pursuant to this subdivision. The following are not prerequisites for enrollment:\n(1) residency in the school district;\n(2) United States citizenship; or\n(3) for a person over the age of 21, a high school diploma or equivalency certificate. A person may enroll in a class or program even if that person attends evening school, an adult or continuing education, or a postsecondary educational program or institution.\nA district may not count a person enrolled pursuant to subdivision 2 as a pupil unit or a pupil in average daily membership for the purpose of receiving any state aid.\nNotwithstanding the provisions of sections 120A.20 and 123B.37, a board may charge a student enrolled pursuant to subdivision 2 a reasonable fee for a class or program.",
	"repealed": false
}