{
	"id": "349.172",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.172",
	"title": "349.172 PULL-TABS; INFORMATION REQUIRED TO BE POSTED.",
	"text": "The board may issue an order requiring an organization selling pull-tabs to post major pull-tab prizes and the names of major prize winners if the board has reasonable grounds to believe that the organization, or a person receiving compensation from the organization for participating in the sale of pull-tabs, has been or is providing information to a player or players that provides an unfair advantage related to the potential winnings from pull-tabs. The board must notify the organization at least 14 days before the order becomes effective. The notice to the organization must describe the organization's right to a hearing under subdivision 3.\nThe information required to be posted under subdivision 1 must be posted prominently at the point of sale of the pull-tabs. An easily legible pull-tab flare that lists prizes in the deal for that flare, and on which prizes are marked off as they are awarded, satisfies the requirements of this section that major prizes be posted, provided that a separate flare is posted for each deal of pull-tabs. An organization must post or mark off each major prize and post the name of the prize winner immediately on awarding the prize.\nAn organization to which the board issues an order under subdivision 1 may request a contested case hearing on the order. The hearing must be held within 20 days of the effective date of the order, and the report by the administrative law judge must be issued within 20 days after the close of the hearing record. The board must issue its final decision within 30 days after receipt of the report of the administrative law judge and subsequent exceptions and arguments under section 14.61.\nFor purposes of this section, a \"major prize\" in a deal of pull-tabs is a prize of at least 50 times the face value of any pull-tab in the deal.\nAn organization conducting lawful gambling must post at each point of sale a sign containing the toll-free telephone number established by the commissioner of human services in connection with the compulsive gambling program established under section 245.98. The sign must be kept in easily legible form and repair by the owner, lessee, or person having control thereof, and must either:\n(1) be approved by the commissioner; or\n(2) have lettering at least three-quarters of an inch in height, of block letter design.\nNothing in this section limits the right of an organization voluntarily to post the names of winners of lawful gambling prizes.",
	"repealed": false
}