{
	"id": "223.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/223.24",
	"title": "223.24 GRAIN INDEMNITY ACCOUNT.",
	"text": "The grain indemnity account is established in the agricultural fund. The grain indemnity account shall consist of grain indemnity premiums, money from any other source, and interest.\n(a) Money in the grain indemnity account, including interest, is appropriated to the commissioner to pay valid claims and to administer this section.\n(b) The commissioner shall direct payments from the grain indemnity account only for the following purposes:\n(1) the payment of valid claims;\n(2) the payment of grain indemnity premium refunds;\n(3) the payment of administrative expenses under paragraph (c);\n(4) the payment of legal fees and legal expenses under subdivision 7; or\n(5) the payment of a trustee appointed under subdivision 6.\n(c) The commissioner shall allocate money from the grain indemnity account to a separate administrative expenses account to pay or reimburse the agency for grain indemnity account expenses. Administrative expenses under this paragraph include the actual cost of processing payments and refunds, enforcement, record keeping, ordinary management and investment fees connected with the operation of the grain indemnity account, and legal expenses.\nA producer is eligible to receive a grain indemnity payment from the commissioner if the producer sold grain to a grain buyer as defined in this chapter or stored grain with a public grain warehouse operator under chapter 232 and the producer is damaged by the grain buyer's or public grain warehouse operator's failure to pay for or redeliver grain.\n(a) A producer asserting eligibility under subdivision 3 must file a completed claim with the commissioner. The producer must state the facts constituting the claim and all other information required by the commissioner.\n(b) Upon receiving a claim, the commissioner must promptly determine the validity of the claim and notify the claimant of the commissioner's determination.\n(c) An aggrieved party may appeal the commissioner's determination by requesting, within 15 days, that the commissioner initiate a contested case proceeding under chapter 14.\n(a) For each failure as defined by section 223.16, subdivision 3c, the commissioner must pay the eligible producer:\n(1) the amount equal to the value of the grain sold on cash sale, grain assigned to warehouse receipt, or grain assigned to open storage less than 180 days from the deposit;\n(2) the amount equal to the value of grain sold up to $300,000, or the lesser of $750,000 or 75 percent of the amount owed to the seller for a contract in excess of $300,000 for a deferred or delayed payment contract for which a price has been established when the contract originated within 120 days of the breach of contract;\n(3) the lesser of $750,000 or 75 percent of the amount owed to the seller for a voluntary extension of credit contract for which no price has been established when the contract originated within 180 days of the breach of contract;\n(4) the lesser of $500,000 or 50 percent for an open storage assignment or a voluntary extension of credit contract when the open storage assignment or contract originated between 181 days and 18 months from the failure; or\n(5) the lesser of $250,000 or 25 percent for an open storage assignment or a voluntary extension of credit contract when the open storage assignment or contract originated between 19 months and 36 months from the failure.\n(b) Claims filed more than 36 months from the failure are not eligible for payment.\n(c) For the purposes of this subdivision, multiple breaches of contract with a single entity constitute one failure.\n(d) If a grain buyer holds both a Minnesota grain buyer license, as defined in chapter 223, and a license with the United States Department of Agriculture (USDA) under the United States Warehouse Act, a seller may only file a claim with the grain indemnity account if the seller sold grain as a cash sale or under a voluntary extension of credit contract. The commissioner must deny any claims for stored grain from a seller that holds both a Minnesota grain buyer license and a license with the USDA under the United States Warehouse Act.\n(e) If valid claims exceed the amount of money available in the grain indemnity account, the commissioner must pay claims to producers in the order that the claims were received. When additional money becomes available, the commissioner must resume issuing grain indemnity payments to each eligible producer until each producer receives the maximum amount payable under paragraph (a).\n(f) If the grain indemnity account balance is insufficient to pay refunds under section 223.26 and valid claims exist, once money is deposited into the grain indemnity account, the commissioner must issue pending refunds for grain indemnity premium payments before issuing payments to claimants.\n(a) The commissioner may apply to a district court for an order appointing a trustee or receiver to manage and supervise the operations of a grain buyer or public grain warehouse operator in default. The commissioner may participate in any resulting court proceeding as an interested party.\n(b) The commissioner may recover the cost of the appointed trustee using money appropriated under subdivision 2.\n(a) Money paid by the commissioner to satisfy a valid claim constitutes a debt obligation of the grain buyer or public grain warehouse operator in default. The commissioner may take action against the grain buyer or public grain warehouse operator to recover the amount of any claim payment plus reasonable costs, attorney fees, and interest computed at the rate provided in section 270C.40. The commissioner must deposit any amount recovered under this subdivision in the grain indemnity account.\n(b) As a condition of payment from the commissioner, a producer must subrogate the producer's interest in any claims against the grain buyer or public grain warehouse operator, including any rights to any grain bond claims, to the commissioner in an amount equal to any claim payment or payments that the producer received under this section. The surety for any claims against the grain bond must make payments to the grain indemnity account.\n(c) The commissioner may recover any debt to the grain indemnity account from a member of the board or management who acted negligently or fraudulently.",
	"repealed": false
}