{
	"id": "149A.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.92",
	"title": "149A.92 PREPARATION AND EMBALMING ROOM.",
	"text": "(a) Any room used by a funeral establishment for preparation and embalming must comply with the minimum standards of this section. A funeral establishment where no preparation and embalming is performed, but which conducts viewings, visitations, and services, or which holds human remains while awaiting final disposition, need not comply with the minimum standards of this section.\n(b) Each funeral establishment must have a preparation and embalming room that complies with the minimum standards of this section, except that a funeral establishment that operates branch locations need only have one compliant preparation and embalming room for all locations.\nEvery funeral establishment must have a preparation and embalming room. The room shall be of sufficient size and dimensions to accommodate a preparation or embalming table, an approved flush bowl with water connections, a hand sink with water connections, and an instrument table, cabinet, or shelves.\nThe room shall be properly lit and ventilated with an exhaust fan that provides at least 12 air changes per hour and is located so that air is drawn away from the person performing the preparation.\nAll plumbing fixtures, water supply lines, plumbing vents, and waste drains shall be properly vented and connected pursuant to the Minnesota Plumbing Code. Where a municipal sewerage system is available, the building drainage system shall be discharged into that system. Where a municipal system is not available, the building system must be discharged into an approved private system of waste disposal.\nAll preparation and embalming rooms shall have nonporous flooring, so that a sanitary condition is provided. The walls and ceiling of the preparation and embalming room shall run from floor to ceiling and be covered with tile, or by plaster or sheetrock painted with washable paint, or other appropriate material so that a sanitary condition is provided. The doors, walls, ceiling, and windows shall be constructed to prevent odors from entering any other part of the building. All windows or other openings to the outside must be screened and all windows must be treated in a manner that prevents viewing into the preparation room from the outside.\nThe preparation and embalming room must have a functional aspirator, eye wash, and quick drench shower. Where embalmings are actually performed in the room, the room must be equipped with a preparation and embalming table, a functional method for injection of fluids, and sufficient supplies and instruments for normal operation. The preparation and embalming table shall have a nonporous top of rustproof metal or porcelain, with raised edges around the top of the entire table and a drain opening at the lower end. All supplies must be stored and used in accordance with all applicable state and federal regulations for occupational health and safety.\nThe preparation and embalming room must be private and have no general passageway through it. The room shall, at all times, be secure from the entrance of unauthorized persons. Authorized persons are those persons described in section 149A.91, subdivision 2. Each door allowing ingress or egress shall carry a sign that indicates that the room is private and access is limited. All authorized persons who are present in or enter a preparation and embalming room while a body is being prepared for final disposition must be attired in accordance with all applicable state and federal regulations regarding the control of infectious disease and occupational and workplace health and safety.\nThe preparation and embalming room and all fixtures, equipment, instruments, receptacles, clothing, and other appliances or supplies stored or used in the room must be maintained in a clean and sanitary condition at all times. A preparation and embalming room shall not be used for any other purposes.\nInfectious and pathological waste generated in preparation of the body shall be handled and disposed of according to the Infectious Waste Control Act, sections 116.75 to 116.83, and packaged for disposal in the manner prescribed by rules.\nAll applicable provisions of state and federal regulations regarding exposure to workplace hazards and accidents shall be followed in order to protect the health and safety of all authorized persons who enter the preparation and embalming room.\n[Repealed, 2016 c 189 art 20 s 26]",
	"repealed": false
}