{
	"id": "97C.355",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.355",
	"title": "97C.355 SHELTERS ON ICE; DARK HOUSES AND FISH HOUSES.",
	"text": "All shelters on the ice of state waters, except portable shelters under subdivision 2a but including dark houses and fish houses, must have: (1) the owner's name and address, (2) the owner's driver's license number, or (3) the \"MDNR#\" license identification number issued to the owner legibly displayed on the exterior with characters at least two inches high.\n(a) A person may not place a dark house, fish house, or shelter, except a portable shelter, on the ice unless:\n(1) the house or shelter is licensed by the shelter owner; and\n(2) the owners' information is displayed according to subdivision 1.\n(b) A dark house, fish house, or shelter license is not required of a resident on boundary waters where the adjacent state does not charge a fee for the same activity.\n[See Note.]\n(a) A person using a portable shelter that is not identified under subdivision 1 may not leave the portable shelter unattended between midnight and sunrise and must remain within 200 feet of the shelter while the shelter is on the ice of state waters.\n(b) If a person leaves the portable shelter unattended any time between midnight and one hour before sunrise or is not within 200 feet of the portable shelter, the portable shelter must be licensed as provided under subdivision 2.\nA person may not use a dark house or fish house unless the door is constructed so that it can be opened from the outside when it is in use.\nA person may not erect a dark house, fish house, or shelter within ten feet of an existing dark house, fish house, or shelter.\nA person may not burn a structure on the ice of state waters without permission of the commissioner. The commissioner may allow burning only after determining that the structure cannot be removed from the ice by another reasonable manner. The owner must remove the remains of the burned structure from the ice.\n[Repealed, 2006 c 281 art 2 s 58]\n(a) A shelter, including a fish house or dark house, may not be on the ice unattended between midnight and one hour before sunrise after:\n(1) the first Monday in March, for state waters south of a line starting at the Minnesota-North Dakota border and formed by rights-of-way of U.S. Route No. 10, then east along U.S. Route No. 10 to Trunk Highway No. 34, then east along Trunk Highway No. 34 to Trunk Highway No. 200, then east along Trunk Highway No. 200 to U.S. Route No. 2, then east along U.S. Route No. 2 to the Minnesota-Wisconsin border; and\n(2) the third Monday in March, for other state waters.\nA shelter, including a fish house or dark house, on the ice in violation of this subdivision is subject to the enforcement provisions of paragraph (b). The commissioner may, by rule, change the dates in this paragraph for any part of state waters. Copies of the rule must be conspicuously posted on the shores of the waters as prescribed by the commissioner.\n(b) A conservation officer must confiscate a fish house, dark house, or shelter in violation of paragraph (a). The officer may remove, burn, or destroy the house or shelter. The officer shall seize the contents of the house or shelter and hold them for 60 days. If the seized articles have not been claimed by the owner, they may be retained for the use of the division or sold at the highest price obtainable in a manner prescribed by the commissioner.\nA fish house, dark house, or shelter left on the ice overnight must be marked with reflective material on each side of the structure. The reflective material must measure a total area of no less than two square inches on each side of the structure.\n(a) Structures on the ice in violation of this section may be confiscated and disposed of, retained by the division, or sold at the highest price obtainable, in a manner prescribed by the commissioner.\n(b) In addition to other penalties provided by law, the owner of a structure left on the ice in violation of this section is subject to a civil penalty under section 115A.99.\n(c) This subdivision also applies to structures left on state public access sites for more than 48 hours past the deadlines specified in subdivision 7.\nA person using a fish house, dark house, or other shelter on the ice of state waters is subject to section 97C.363.",
	"repealed": false
}