{
	"id": "156.127",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.127",
	"title": "156.127 FORMS OF DISCIPLINARY ACTION.",
	"text": "When grounds exist under section 156.081, or other statute or rule which the board is authorized to enforce, the board may take one or more of the following disciplinary actions:\n(1) deny an application for a license;\n(2) revoke the regulated person's license;\n(3) suspend the regulated person's license;\n(4) impose limitations on the regulated person's license;\n(5) impose conditions on the regulated person's license;\n(6) censure or reprimand, publicly or privately, the regulated person;\n(7) impose an administrative penalty not exceeding $10,000 for each separate violation, the amount of the penalty to be fixed so as to deprive the person of any economic advantage gained by reason of the violation, to discourage similar violations, or to reimburse the board for the cost of the investigation and proceeding including, but not limited to, fees paid for services provided by the Office of Administrative Hearings, legal and investigative services provided by the Office of the Attorney General, court reporter services, witnesses, reproduction of records, board members' per diem compensation, board staff time, and board and staff expenses; or\n(8) take any other action justified by the facts of the case.\nWhen grounds exist under section 156.081, or other statute or rule which the board is authorized to enforce, the executive director and complaint committee may enter into an agreement with the regulated person for corrective action which may include requiring the regulated person:\n(1) to complete an educational course or activity;\n(2) to submit to the executive director or designated board member a written protocol or reports designed to prevent future violations of the same kind;\n(3) to meet with a board member or board designee to discuss prevention of future violations of the same kind;\n(4) to perform other action justified by the facts; or\n(5) to cease performing specific acts or procedures justified by the facts.\nThe listing of these measures in this subdivision does not preclude a board from including the measures in an order for disciplinary action.\nUpon reinstating a regulated person's license or granting an applicant's license, the board may, at its discretion, impose any disciplinary action, cost, or penalty listed in subdivision 1, as well as any reinstatement fee.\nAt least annually, the board may publish and make available to the public a description of all public disciplinary action taken by the board. The publication must include, for each disciplinary action taken, the name and the business address of the regulated person, and the form of disciplinary action taken by the board.",
	"repealed": false
}