{
	"id": "117.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/117.52",
	"title": "117.52 UNIFORM RELOCATION ASSISTANCE.",
	"text": "In all acquisitions undertaken by any acquiring authority and in all voluntary rehabilitation carried out by a person pursuant to acquisition or as a consequence thereof, in which, due to the lack of federal financial participation, relocation assistance, services, payments and benefits under the Uniform Relocation Assistance and Real Property Acquisition Policies Act of 1970, United States Code, title 42, sections 4601 to 4655, as amended by the Surface Transportation and Uniform Relocation Assistance Act of 1987, Statutes at Large, volume 101, pages 246 to 256 (1987), are not available, the acquiring authority, as a cost of acquisition, shall provide all relocation assistance, services, payments and benefits required by the Uniform Relocation Assistance and Real Property Acquisition Policies Act of 1970, as amended by the Surface Transportation and Uniform Relocation Assistance Act of 1987, and those regulations adopted pursuant thereto, and either (1) in effect as of January 1, 2006, or (2) becoming effective after January 1, 2006, following a public hearing and comment. Comments received by an acquiring authority within 30 days after the public hearing must be reviewed and a written response provided to the individual or organization who initiated the comment. The response and comments may be addressed in another public hearing by the acquiring authority before approval.\nFor purposes of relocation benefits paid by the acquiring authority in accordance with this section, the provisions of Code of Federal Regulations, title 49, part 24, with respect to reimbursement of reestablishment expenses for nonresidential moves are applicable, except that the acquiring authority shall reimburse the displaced business for eligible expenses up to a maximum of $50,000.\nDespite subdivision 1, with respect to acquisitions for highway purposes or acquisitions for which the state Department of Transportation performs relocation assistance services for the Department of Administration, the regulations of the United States Department of Transportation may be applied to all displaced persons who would otherwise be eligible for such relocation assistance, services, payments and benefits thereunder but for the lack of federal financial participation.\nThis section shall not apply in the case where federal financial participation for provision of relocation assistance, services, payments and benefits in connection with an acquisition has been procured or committed pursuant to section 117.51 and has then been withdrawn by the United States, unless the acquiring authority subsequently determines to proceed with the acquisition in question using nonfederal funds.\nNotwithstanding any law or rule to the contrary, if a person entitled to relocation assistance under this section does not accept the acquiring authority's determination of the amount of relocation assistance or if a person does not accept the acquiring authority's denial of relocation assistance, the acquiring authority must initiate contested case proceedings under sections 14.57 to 14.66 for a determination of the eligibility for or amount of relocation assistance that must be provided by the acquiring authority. The administrative law judge's determination of the person's eligibility for or amount of relocation assistance that the acquiring authority must provide constitutes a final decision in the case, as provided in section 14.62, subdivision 4. The acquiring authority must pay all costs of the proceedings. \"Costs\" is defined in section 15.471, subdivision 4, and also includes charges billed by the Office of Administrative Hearings for the proceedings.",
	"repealed": false
}