{
	"id": "223.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/223.17",
	"title": "223.17 LICENSES; BONDING; CLAIMS; DISBURSEMENTS.",
	"text": "An application for a grain buyer's license must be filed with the commissioner and the license issued before any grain may be purchased.\nThe applicant for a grain buyer's license shall identify all grain buying locations owned or controlled by the grain buyer and all vehicles owned or controlled by the grain buyer used to transport purchased grain. Every applicant for a grain buyer's license shall have a permanent established place of business at each licensed location. An \"established place of business\" means a permanent enclosed building, including a house or a farm, either owned by the applicant or leased by the applicant for a period of at least one year, and where the books, records, and files necessary to conduct the business are kept and maintained.\n[Repealed, 1986 c 322 s 4]\nA license must be renewed annually. Beginning July 1, 1984, the commissioner may stagger the renewal dates of licenses issued under this chapter, subject to the policy expressed in section 116J.69, subdivision 2, clause (4). If a person receives more than one license from the commissioner, the licenses shall be issued at the same time, but only after all conditions for each license are met. Multiple licenses should be combined into one license if possible.\n(a) The commissioner shall set the fees for inspections under sections 223.15 to 223.22 at levels necessary to pay the expenses of administering and enforcing sections 223.15 to 223.22. The fee for any license issued or renewed after June 30, 2005, shall be set according to the following schedule:\n(1) $140 plus $110 for each additional location for grain buyers whose gross annual purchases are less than $100,000;\n(2) $275 plus $110 for each additional location for grain buyers whose gross annual purchases are at least $100,000, but not more than $750,000;\n(3) $415 plus $220 for each additional location for grain buyers whose gross annual purchases are more than $750,000 but not more than $1,500,000;\n(4) $550 plus $220 for each additional location for grain buyers whose gross annual purchases are more than $1,500,000 but not more than $3,000,000; and\n(5) $700 plus $220 for each additional location for grain buyers whose gross annual purchases are more than $3,000,000.\n(b) In addition to the license fee required under paragraph (a), a grain buyer must pay to the commissioner an annual examination fee for each licensed location, as follows:\n(c) The fee for any supplemental examination required by the commissioner under section 223.23 is $55 per hour per examiner.\n(d) A licensed grain buyer meeting the annual examination requirements under section 223.23 is exempt from the fees under paragraph (b) if the annual examination is conducted by the Agricultural Marketing Service of the United State Department of Agriculture.\n(e) A penalty amount not to exceed ten percent of the fees due may be imposed by the commissioner for each month for which the fees are delinquent.\n(f) There is created the grain buyers and storage account in the agricultural fund. Money collected pursuant to sections 223.15 to 223.23 shall be paid into the state treasury and credited to the grain buyers and storage account. Money in the account, including interest, is appropriated to the commissioner for the administration and enforcement of sections 223.15 to 223.23.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nFor a cash sale of a shipment of grain, the grain buyer shall tender payment to the seller in cash, by check, or by wiring or mailing payment to the seller's account. The grain buyer must tender payment as required under this subdivision not later than the close of business on the next day after the sale of the shipment, or within 48 hours after the sale of the shipment, whichever is later.\nNo grain buyer may refuse to purchase grain from a producer solely because the producer is not bonded or is not licensed by the commissioner; provided, that any producer who buys grain from other producers shall be licensed and bonded as required by this chapter.\n(a) Except as allowed in paragraph (c), a grain buyer licensed under this chapter must annually submit to the commissioner a financial statement prepared in accordance with generally accepted accounting principles. The annual financial statement required under this subdivision must also:\n(1) include, but not be limited to the following:\n(i) a balance sheet;\n(ii) a statement of income (profit and loss);\n(iii) a statement of retained earnings;\n(iv) a statement of changes in financial position; and\n(v) a statement of the dollar amount of grain purchased in the previous fiscal year of the grain buyer;\n(2) be accompanied by a compilation report of the financial statement that is prepared by a grain commission firm or a management firm approved by the commissioner or by an independent public accountant, in accordance with standards established by the American Institute of Certified Public Accountants;\n(3) be accompanied by a certification by the chief executive officer or the chief executive officer's designee of the licensee, and where applicable, all members of the governing board of directors under penalty of perjury, that the financial statement accurately reflects the financial condition of the licensee for the period specified in the statement;\n(4) for grain buyers purchasing under $7,500,000 of grain annually, be reviewed by a certified public accountant in accordance with standards established by the American Institute of Certified Public Accountants, and must show that the financial statements are free from material misstatements; and\n(5) for grain buyers purchasing $7,500,000 or more of grain annually, be audited by a certified public accountant in accordance with standards established by the American Institute of Certified Public Accountants and must include an opinion statement from the certified public accountant.\n(b) Only one financial statement must be filed for a chain of warehouses owned or operated as a single business entity, unless otherwise required by the commissioner. All financial statements filed with the commissioner are private or nonpublic data as provided in section 13.02.\n(c) A grain buyer who purchases grain immediately upon delivery solely with cash; a certified check; a cashier's check; or a postal, bank, or express money order is exempt from this subdivision if the grain buyer's gross annual purchases are $1,000,000 or less.\n(d) The commissioner shall annually provide information on a person's fiduciary duties to each licensee. To the extent practicable, the commissioner must direct each licensee to provide this information to all persons required to certify the licensee's financial statement under paragraph (a), clause (3).\n(a) If a license applicant or a licensee fails to furnish financial statements the commissioner may refuse to issue or renew the license or may suspend the license.\n(b) The commissioner may refuse to issue or renew a license or may suspend a license upon determining, based upon the financial statement filed under this section or other financial information obtained by the commissioner, that the applicant or licensee is not financially able to properly perform the services and operate the business for which the license is issued.\n(c) When a license is suspended the licensee shall surrender the license to the commissioner. An applicant or licensee may request an administrative hearing subject to chapter 14 within 15 days after the commissioner suspends a license or refuses to issue or renew a license under clause (b) to determine whether the license should be issued, renewed, or revoked. If no request is made within 15 days after suspension, the commissioner shall revoke the license.\nA producer claiming to be damaged by a breach of a contract for the purchase of grain by a grain buyer may file a written claim with the commissioner. The claim must state the facts constituting the claim. If a claim is valid, the commissioner may immediately suspend the license, in which case the licensee shall surrender the license to the commissioner. Within 15 days the licensee may request an administrative hearing subject to chapter 14 to determine whether the license should be revoked. If no request is made within 15 days, the commissioner shall revoke the license.\nFor entities licensed under this chapter and chapter 232, the bond requirements and actions against the bond are governed under section 223.28.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nIt is a violation under this chapter if the commissioner finds, after an investigation is conducted, that a complaint is valid or that a licensee is in violation of the provisions of this chapter.",
	"repealed": false
}