{
	"id": "245D.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.32",
	"title": "245D.32 ALTERNATIVE LICENSING INSPECTIONS.",
	"text": "(a) A license holder providing services licensed under this chapter, with a qualifying accreditation and meeting the eligibility criteria in paragraphs (b) and (c), may request approval for an alternative licensing inspection when all services provided under the license holder's license are accredited. A license holder with a qualifying accreditation and meeting the eligibility criteria in paragraphs (b) and (c) may request approval for an alternative licensing inspection for individual community residential settings or day services facilities licensed under this chapter.\n(b) In order to be eligible for an alternative licensing inspection, the program must have had at least one inspection by the commissioner following issuance of the initial license. For programs operating a day services facility, each facility must have had at least one on-site inspection by the commissioner following issuance of the initial license.\n(c) In order to be eligible for an alternative licensing inspection, the program must have been in substantial and consistent compliance at the time of the last licensing inspection and during the current licensing period. For purposes of this section, \"substantial and consistent compliance\" means:\n(1) the license holder's license was not made conditional, suspended, or revoked;\n(2) there have been no substantiated allegations of maltreatment against the license holder;\n(3) there were no program deficiencies identified that would jeopardize the health, safety, or rights of persons being served; and\n(4) the license holder maintained substantial compliance with the other requirements of chapters 245A and 245C and other applicable laws and rules.\n(d) For the purposes of this section, the license holder's license includes services licensed under this chapter that were previously licensed under chapter 245B until December 31, 2013.\nThe commissioner must accept a three-year accreditation from the Commission on Accreditation of Rehabilitation Facilities (CARF) as a qualifying accreditation.\n(a) A request for an alternative inspection must be made on the forms and in the manner prescribed by the commissioner. When submitting the request, the license holder must submit all documentation issued by the accrediting body verifying that the license holder has obtained and maintained the qualifying accreditation and has complied with recommendations or requirements from the accrediting body during the period of accreditation. Based on the request and the additional required materials, the commissioner may approve an alternative inspection status.\n(b) The commissioner must notify the license holder in writing that the request for an alternative inspection status has been approved. Approval must be granted until the end of the qualifying accreditation period.\n(c) The license holder must submit a written request for approval to be renewed one month before the end of the current approval period according to the requirements in paragraph (a). If the license holder does not submit a request to renew approval as required, the commissioner must conduct a licensing inspection.\n(a) A license holder approved for alternative licensing inspection under this section is required to maintain compliance with all licensing standards according to this chapter.\n(b) A license holder approved for alternative licensing inspection under this section must be deemed to be in compliance with all the requirements of this chapter, and the commissioner must not perform routine licensing inspections.\n(c) Upon receipt of a complaint regarding the services of a license holder approved for alternative licensing inspection under this section, the commissioner must investigate the complaint and may take any action as provided under section 245A.06 or 245A.07.\nNothing in this section changes the commissioner's responsibilities to investigate alleged or suspected maltreatment of a minor under chapter 260E or a vulnerable adult under section 626.557.\nFollowing approval of an alternative licensing inspection, the commissioner may terminate or deny subsequent approval of an alternative licensing inspection if the commissioner determines that:\n(1) the license holder has not maintained the qualifying accreditation;\n(2) the commissioner has substantiated maltreatment for which the license holder or facility is determined to be responsible during the qualifying accreditation period; or\n(3) during the qualifying accreditation period, the license holder has been issued an order for conditional license, fine, suspension, or license revocation that has not been reversed upon appeal.\nThe commissioner's decision that the conditions for approval for an alternative licensing inspection have not been met is final and not subject to appeal under the provisions of chapter 14.\nHome and community-based services licensed under this chapter for which the commissioner is the license holder with a qualifying accreditation are excluded from being approved for an alternative licensing inspection.",
	"repealed": false
}