{
	"id": "204B.146",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.146",
	"title": "204B.146 DUTIES OF SECRETARY OF STATE.",
	"text": "The secretary of state shall conduct conferences with the county auditors, municipal clerks, and school district clerks to instruct them on the procedures for redistricting of election districts and establishment of election precincts in the year ending in one.\nThe secretary of state shall maintain a computer database of precinct and election district boundaries. The secretary of state shall revise the information in the database whenever a precinct or election district boundary is changed. The secretary of state shall prepare maps illustrating precinct and election district boundaries in either paper or electronic formats and make them available to the public at the cost of production.\nThe secretary of state may authorize municipalities and counties to provide updated precinct and election district boundary information in electronic formats.\nThe secretary of state shall provide periodic updates of precinct and election district boundaries to the Legislative Coordinating Commission, the state demographer, and the Minnesota Geospatial Information Office.\nAt the request of the county auditor, the secretary of state shall provide the county auditor with precinct maps. The county auditor shall forward the maps to the appropriate municipal clerks, who shall post the map in the polling place on the day of the state primary and the state general election.\nWhen a municipal boundary has changed and is coterminous with (1) a congressional, legislative, or county commissioner district boundary, or (2) a soil and water conservation district supervisor district boundary elected by district under section 103C.311, subdivision 2, and the affected territory contains 50 or fewer registered voters, the secretary of state may order corrections to move the affected election district boundaries so the boundaries are again coterminous with the municipal boundary. The election district boundary change is effective 28 days after the date that the order is issued. The secretary of state shall immediately notify the municipal clerk and county auditor affected by the boundary change and the Legislative Coordinating Commission. The municipal clerk shall send a nonforwardable notice stating the location of the polling place to every household containing a registered voter affected by the boundary change at least 25 days before the next election.",
	"repealed": false
}