{
	"id": "626.5572",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.5572",
	"title": "626.5572 DEFINITIONS.",
	"text": "For the purpose of section 626.557, the following terms have the meanings given them, unless otherwise specified.\n\"Abuse\" means:\n(a) An act against a vulnerable adult that constitutes a violation of, an attempt to violate, or aiding and abetting a violation of:\n(1) assault in the first through fifth degrees as defined in sections 609.221 to 609.224;\n(2) the use of drugs to injure or facilitate crime as defined in section 609.235;\n(3) the solicitation, inducement, and promotion of prostitution as defined in section 609.322; and\n(4) criminal sexual conduct in the first through fifth degrees as defined in sections 609.342 to 609.3451.\nA violation includes any action that meets the elements of the crime, regardless of whether there is a criminal proceeding or conviction.\n(b) Conduct which is not an accident or therapeutic conduct as defined in this section, which produces or could reasonably be expected to produce physical pain or injury or emotional distress including, but not limited to, the following:\n(1) hitting, slapping, kicking, pinching, biting, or corporal punishment of a vulnerable adult;\n(2) use of repeated or malicious oral, written, or gestured language toward a vulnerable adult or the treatment of a vulnerable adult which would be considered by a reasonable person to be disparaging, derogatory, humiliating, harassing, or threatening; or\n(3) use of any aversive or deprivation procedure, unreasonable confinement, or involuntary seclusion, including the forced separation of the vulnerable adult from other persons against the will of the vulnerable adult or the legal representative of the vulnerable adult unless authorized under applicable licensing requirements or Minnesota Rules, chapter 9544.\n(c) Any sexual contact or penetration as defined in section 609.341, between a facility staff person or a person providing services in the facility and a resident, patient, or client of that facility.\n(d) The act of forcing, compelling, coercing, or enticing a vulnerable adult against the vulnerable adult's will to perform services for the advantage of another.\n(e) For purposes of this section, a vulnerable adult is not abused for the sole reason that the vulnerable adult or a person with authority to make health care decisions for the vulnerable adult under sections 144.651, 144A.44, chapter 145B, 145C or 252A, or section 253B.03 or 524.5-313, refuses consent or withdraws consent, consistent with that authority and within the boundary of reasonable medical practice, to any therapeutic conduct, including any care, service, or procedure to diagnose, maintain, or treat the physical or mental condition of the vulnerable adult or, where permitted under law, to provide nutrition and hydration parenterally or through intubation. This paragraph does not enlarge or diminish rights otherwise held under law by:\n(1) a vulnerable adult or a person acting on behalf of a vulnerable adult, including an involved family member, to consent to or refuse consent for therapeutic conduct; or\n(2) a caregiver to offer or provide or refuse to offer or provide therapeutic conduct.\n(f) For purposes of this section, a vulnerable adult is not abused for the sole reason that the vulnerable adult, a person with authority to make health care decisions for the vulnerable adult, or a caregiver in good faith selects and depends upon spiritual means or prayer for treatment or care of disease or remedial care of the vulnerable adult in lieu of medical care, provided that this is consistent with the prior practice or belief of the vulnerable adult or with the expressed intentions of the vulnerable adult.\n(g) For purposes of this section, a vulnerable adult is not abused for the sole reason that the vulnerable adult, who is not impaired in judgment or capacity by mental or emotional dysfunction or undue influence, engages in consensual sexual contact with:\n(1) a person, including a facility staff person, when a consensual sexual personal relationship existed prior to the caregiving relationship; or\n(2) a personal care attendant, regardless of whether the consensual sexual personal relationship existed prior to the caregiving relationship.\n\"Accident\" means a sudden, unforeseen, and unexpected occurrence or event which:\n(1) is not likely to occur and which could not have been prevented by exercise of due care; and\n(2) if occurring while a vulnerable adult is receiving services from a facility, happens when the facility and the employee or person providing services in the facility are in compliance with the laws and rules relevant to the occurrence or event.\n\"Caregiver\" means an individual or facility who has responsibility for all or a portion of the care of a vulnerable adult voluntarily, by contract, or by agreement. Caregiver does not include an unpaid caregiver who provides incidental care.\n\"Common entry point\" means the entity responsible for receiving reports of alleged or suspected maltreatment of a vulnerable adult under section 626.557.\n(a) \"Facility\" means a hospital or other entity required to be licensed under sections 144.50 to 144.58; a nursing home required to be licensed to serve adults under section 144A.02; a facility or service required to be licensed under chapter 245A; an assisted living facility required to be licensed under chapter 144G; a home care provider licensed or required to be licensed under sections 144A.43 to 144A.482; a hospice provider licensed under sections 144A.75 to 144A.755; or a person or organization that offers, provides, or arranges for personal care assistance services under the medical assistance program as authorized under sections 256B.0625, subdivision 19a, 256B.0651 to 256B.0654, 256B.0659, or 256B.85.\n(b) For services identified in paragraph (a) that are provided in the vulnerable adult's own home or in another unlicensed location, the term \"facility\" refers to the provider, person, or organization that offers, provides, or arranges for personal care services, and does not refer to the vulnerable adult's home or other location at which services are rendered.\n\"False\" means a preponderance of the evidence shows that an act that meets the definition of maltreatment did not occur.\n\"Final disposition\" is the determination of an investigation by a lead investigative agency that a report of maltreatment under Laws 1995, chapter 229, is substantiated, inconclusive, false, or that no determination will be made. When a lead investigative agency determination has substantiated maltreatment, the final disposition also identifies, if known, which individual or individuals were responsible for the substantiated maltreatment, and whether a facility was responsible for the substantiated maltreatment.\n\"Financial exploitation\" means:\n(a) In breach of a fiduciary obligation recognized elsewhere in law, including pertinent regulations, contractual obligations, documented consent by a competent person, or the obligations of a responsible party under section 144.6501, a person:\n(1) engages in unauthorized expenditure of funds entrusted to the actor by the vulnerable adult which results or is likely to result in detriment to the vulnerable adult; or\n(2) fails to use the financial resources of the vulnerable adult to provide food, clothing, shelter, health care, therapeutic conduct or supervision for the vulnerable adult, and the failure results or is likely to result in detriment to the vulnerable adult.\n(b) In the absence of legal authority a person:\n(1) willfully uses, withholds, or disposes of funds or property of a vulnerable adult;\n(2) obtains for the actor or another the performance of services by a third person for the wrongful profit or advantage of the actor or another to the detriment of the vulnerable adult;\n(3) acquires possession or control of, or an interest in, funds or property of a vulnerable adult through the use of undue influence, harassment, duress, deception, or fraud; or\n(4) forces, compels, coerces, or entices a vulnerable adult against the vulnerable adult's will to perform services for the profit or advantage of another.\n(c) Nothing in this definition requires a facility or caregiver to provide financial management or supervise financial management for a vulnerable adult except as otherwise required by law.\n\"Immediately\" means as soon as possible, but no longer than 24 hours from the time initial knowledge that the incident occurred has been received.\n\"Inconclusive\" means there is less than a preponderance of evidence to show that maltreatment did or did not occur.\n\"Initial disposition\" is the lead investigative agency's determination of whether the report will be assigned for further investigation.\n\"Lead investigative agency\" is the primary administrative agency responsible for investigating reports made under section 626.557.\n(a) The Department of Health is the lead investigative agency for facilities or services licensed or required to be licensed as hospitals, home care providers, nursing homes, boarding care homes, hospice providers, residential facilities that are also federally certified as intermediate care facilities that serve people with developmental disabilities, or any other facility or service not listed in this subdivision that is licensed or required to be licensed by the Department of Health for the care of vulnerable adults. \"Home care provider\" has the meaning provided in section 144A.43, subdivision 4, and applies when care or services are delivered in the vulnerable adult's home.\n(b) The Department of Human Services is the lead investigative agency for facilities or services licensed or required to be licensed as adult day care, adult foster care, community residential settings, programs for people with disabilities, family adult day services, mental health programs, mental health clinics, substance use disorder programs, the Minnesota Sex Offender Program, or any other facility or service not listed in this subdivision that is licensed or required to be licensed by the Department of Human Services.\n(c) The county social service agency or its designee is the lead investigative agency for all other reports, including, but not limited to, reports involving vulnerable adults receiving services from a personal care provider organization under section 256B.0659.\n\"Legal authority\" includes, but is not limited to: (1) a fiduciary obligation recognized elsewhere in law, including pertinent regulations; (2) a contractual obligation; or (3) documented consent by a competent person.\n\"Maltreatment\" means abuse as defined in subdivision 2, neglect as defined in subdivision 17, or financial exploitation as defined in subdivision 9.\n\"Mandated reporter\" means a professional or professional's delegate while engaged in: (1) social services; (2) law enforcement; (3) education; (4) the care of vulnerable adults; (5) any of the occupations referred to in section 214.01, subdivision 2; (6) an employee of a rehabilitation facility certified by the commissioner of jobs and training for vocational rehabilitation; (7) an employee or person providing services in a facility as defined in subdivision 6; or (8) a person that performs the duties of the medical examiner or coroner.\n(a) \"Neglect\" means neglect by a caregiver or self-neglect.\n(b) \"Caregiver neglect\" means the failure or omission by a caregiver to supply a vulnerable adult with care or services, including but not limited to, food, clothing, shelter, health care, or supervision which is:\n(1) reasonable and necessary to obtain or maintain the vulnerable adult's physical or mental health or safety, considering the physical and mental capacity or dysfunction of the vulnerable adult; and\n(2) which is not the result of an accident or therapeutic conduct.\n(c) \"Self-neglect\" means neglect by a vulnerable adult of the vulnerable adult's own food, clothing, shelter, health care, or other services that are not the responsibility of a caregiver which a reasonable person would deem essential to obtain or maintain the vulnerable adult's health, safety, or comfort.\n(d) For purposes of this section, a vulnerable adult is not neglected for the sole reason that:\n(1) the vulnerable adult or a person with authority to make health care decisions for the vulnerable adult under sections 144.651, 144A.44, chapter 145B, 145C, or 252A, or sections 253B.03 or 524.5-101 to 524.5-502, refuses consent or withdraws consent, consistent with that authority and within the boundary of reasonable medical practice, to any therapeutic conduct, including any care, service, or procedure to diagnose, maintain, or treat the physical or mental condition of the vulnerable adult, or, where permitted under law, to provide nutrition and hydration parenterally or through intubation; this paragraph does not enlarge or diminish rights otherwise held under law by:\n(i) a vulnerable adult or a person acting on behalf of a vulnerable adult, including an involved family member, to consent to or refuse consent for therapeutic conduct; or\n(ii) a caregiver to offer or provide or refuse to offer or provide therapeutic conduct; or\n(2) the vulnerable adult, a person with authority to make health care decisions for the vulnerable adult, or a caregiver in good faith selects and depends upon spiritual means or prayer for treatment or care of disease or remedial care of the vulnerable adult in lieu of medical care, provided that this is consistent with the prior practice or belief of the vulnerable adult or with the expressed intentions of the vulnerable adult;\n(3) the vulnerable adult, who is not impaired in judgment or capacity by mental or emotional dysfunction or undue influence, engages in consensual sexual contact with:\n(i) a person including a facility staff person when a consensual sexual personal relationship existed prior to the caregiving relationship; or\n(ii) a personal care attendant, regardless of whether the consensual sexual personal relationship existed prior to the caregiving relationship; or\n(4) an individual makes an error in the provision of therapeutic conduct to a vulnerable adult which does not result in injury or harm which reasonably requires medical or mental health care; or\n(5) an individual makes an error in the provision of therapeutic conduct to a vulnerable adult that results in injury or harm, which reasonably requires the care of a physician, and:\n(i) the necessary care is provided in a timely fashion as dictated by the condition of the vulnerable adult;\n(ii) if after receiving care, the health status of the vulnerable adult can be reasonably expected, as determined by the attending physician, to be restored to the vulnerable adult's preexisting condition;\n(iii) the error is not part of a pattern of errors by the individual;\n(iv) if in a facility, the error is immediately reported as required under section 626.557, and recorded internally in the facility;\n(v) if in a facility, the facility identifies and takes corrective action and implements measures designed to reduce the risk of further occurrence of this error and similar errors; and\n(vi) if in a facility, the actions required under items (iv) and (v) are sufficiently documented for review and evaluation by the facility and any applicable licensing, certification, and ombudsman agency.\n(e) Nothing in this definition requires a caregiver, if regulated, to provide services in excess of those required by the caregiver's license, certification, registration, or other regulation.\n(f) If the findings of an investigation by a lead investigative agency result in a determination of substantiated maltreatment for the sole reason that the actions required of a facility under paragraph (d), clause (5), item (iv), (v), or (vi), were not taken, then the facility is subject to a correction order. An individual will not be found to have neglected or maltreated the vulnerable adult based solely on the facility's not having taken the actions required under paragraph (d), clause (5), item (iv), (v), or (vi). This must not alter the lead investigative agency's determination of mitigating factors under section 626.557, subdivision 9c, paragraph (f).\n\"Report\" means a statement concerning all the circumstances surrounding the alleged or suspected maltreatment, as defined in this section, of a vulnerable adult which are known to the reporter at the time the statement is made.\n\"Substantiated\" means a preponderance of the evidence shows that an act that meets the definition of maltreatment occurred.\n\"Therapeutic conduct\" means the provision of program services, health care, or other personal care services done in good faith in the interests of the vulnerable adult by: (1) an individual, facility, or employee or person providing services in a facility under the rights, privileges and responsibilities conferred by state license, certification, or registration; or (2) a caregiver.\n(a) \"Vulnerable adult\" means any person 18 years of age or older who:\n(1) is a resident or inpatient of a facility;\n(2) receives services required to be licensed under chapter 245A, except that a person receiving outpatient services for treatment of substance use disorder or mental illness, or one who is served in the Minnesota Sex Offender Program on a court-hold order for commitment, or is committed as a sexual psychopathic personality or as a sexually dangerous person under chapter 253B, is not considered a vulnerable adult unless the person meets the requirements of clause (4);\n(3) receives services from a home care provider required to be licensed under sections 144A.43 to 144A.482; or from a person or organization that offers, provides, or arranges for personal care assistance services under the medical assistance program as authorized under section 256B.0625, subdivision 19a, 256B.0651, 256B.0653, 256B.0654, 256B.0659, or 256B.85; or\n(4) regardless of residence or whether any type of service is received, possesses a physical or mental infirmity or other physical, mental, or emotional dysfunction:\n(i) that impairs the individual's ability to provide adequately for the individual's own care without assistance, including the provision of food, shelter, clothing, health care, or supervision; and\n(ii) because of the dysfunction or infirmity and the need for care or services, the individual has an impaired ability to protect the individual's self from maltreatment.\n(b) For purposes of this subdivision, \"care or services\" means care or services for the health, safety, welfare, or maintenance of an individual.",
	"repealed": false
}