{
	"id": "48.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.61",
	"title": "48.61 AUTHORIZED INVESTMENTS FOR STATE BANKS AND TRUST COMPANIES.",
	"text": "Any bank or trust company organized under the laws of this state is authorized to invest not to exceed 20 percent of its capital and surplus in the capital stock of any agricultural credit corporation organized under the laws of this state, and entitled to discount privileges with any federal intermediate bank organized under the laws of the United States.\nAny such bank or trust company may invest not to exceed five percent of its capital and surplus in shares of stock in small business investment companies organized under the provisions of the Small Business Investment Act of 1958.\nThe bank or trust company may invest an amount not to exceed ten percent of its capital and surplus in shares of stock in any banks or bank holding companies wherein the stock of the banks or bank holding companies is owned exclusively by bank holding companies or banks.\nAny such bank or trust company may make equity or debt investments in limited partnerships, limited liability companies, corporations, or projects designed primarily to promote community welfare, such as the rehabilitation or development of economically depressed residential, commercial, or industrial areas. A bank or trust company investment in any one limited partnership, limited liability company, corporation, or project shall not exceed five percent of its capital and surplus and its aggregate investment in all such limited partnerships, limited liability companies, corporations, or projects shall not exceed ten percent of its capital and surplus.\nIn the absence of an express provision to the contrary, whenever any statute, rule, charter, trust indenture, authorizing resolution, or other instrument governing the investment of funds of a banking institution, as defined in section 48.01, subdivision 2, directs, requires, authorizes, or permits direct investment in certain obligations, investment in these obligations may be made either directly or in the form of securities of, or other interests in, an investment company registered under the Federal Investment Company Act of 1940, whose shares are registered under the Federal Securities Act of 1933.\nShares of investment companies whose portfolios contain investments which are subject to limits under other state law or rule as direct investments may only be held in an amount not in excess of 20 percent of the banks' capital stock and paid in surplus in each such investment company. These obligations shall be carried at the lower of cost or market on the banks' books and adjusted to market on a quarterly basis.\nAny bank may invest in the voting stock of the Federal Agricultural Mortgage Corporation created pursuant to the Agricultural Credit Act of 1987, Public Law 100-233, in an amount not to exceed the greater of ten percent of the bank's capital and surplus or the amount required by the Federal Agricultural Mortgage Corporation for the bank to qualify for its participation in the corporation's programs.\n(a) A state bank or trust company may organize, acquire, or invest in a subsidiary located in this state for the purposes of engaging in one or more of the following activities, subject to the prior written approval of the commissioner:\n(1) any activity, not including receiving deposits or paying checks, that a state bank is authorized to engage in under state law or rule or under federal law or regulation unless the activity is prohibited by the laws of this state;\n(2) any activity that a bank clerical service corporation is authorized to engage in under section 48.89; and\n(3) any other activity authorized for a national bank, a bank holding company, or a subsidiary of a national bank or bank holding company under federal law or regulation of general applicability, and approved by the commissioner.\n(b) A bank or trust company subsidiary may engage in an activity under this section only upon application together with a filing fee of $250 and with the prior written approval of the commissioner. In approving or denying a proposed activity, the commissioner shall consider the financial and management strength of the bank or trust company, the current written operating plan and policies of the proposed subsidiary corporation, the bank or trust company's community reinvestment record, and whether the proposed activity should be conducted through a subsidiary of the bank or trust company.\n(c) The aggregate amount of funds invested in either an equity or loan capacity in all of the subsidiaries of the bank or trust company authorized under this subdivision shall not exceed 50 percent of the capital stock and paid in surplus of the bank or trust company.\n(d) A subsidiary organized or acquired under this subdivision is subject to the examination and enforcement authority of the commissioner under chapters 45 and 46 to the same extent as a state bank or trust company.\n(e) For the purposes of this section, \"subsidiary\" means a corporation of which at least 20 percent of the voting shares are owned or controlled by the bank or trust company.\nA state bank or trust company may invest in any securities that are authorized investments for national banks on May 27, 1989, subject to the same restrictions as apply to national banks. The commissioner may authorize a state bank or trust company to invest in any securities that become authorized investments for national banks after May 27, 1989, subject to the same restrictions as apply to national banks. This authority is in addition to the investment authority granted to state banks under other provisions of state law.\n(a) Notwithstanding any other law to the contrary, a bank may merge a subsidiary authorized and established according to this section into itself if it owns 100 percent of the outstanding voting stock.\n(b) A merger of a subsidiary authorized by subdivision 1 must conform to the procedures in section 302A.621.\n(c) Before filing the articles of merger with the secretary of state, the merger plan must be filed with and approved in writing by the commissioner who shall determine that:\n(1) the provisions of section 302A.621 are followed; and\n(2) the merger will not have an undue adverse effect on the safety and soundness of the bank.\nA subsidiary may be organized solely for purposes of liquidating assets in a reorganization subject to the following conditions:\n(1) the subsidiary must be a bank holding company whose assets and liabilities and subsidiary bank control have been removed; and\n(2) the operations of the subsidiary must be limited to the time period reasonably related to the completion of the reorganization.",
	"repealed": false
}