{
	"id": "59D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/59D.02",
	"title": "59D.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in subdivisions 2 to 10 have the meanings given them.\n\"Administrator\" means a person, other than an insurer or creditor who performs administrative or operational functions pursuant to guaranteed asset protection waiver programs.\n\"Borrower\" means a debtor, retail buyer, or lessee under a finance agreement.\n\"Creditor\" means:\n(1) the lender in a loan or credit transaction;\n(2) the lessor in a lease transaction;\n(3) a dealer or seller of motor vehicles that provides credit to purchasers of the motor vehicles provided that the entities comply with this section;\n(4) the seller in commercial retail installment transactions; or\n(5) the assignees of any of the forgoing to whom the credit obligation is payable.\n\"Finance agreement\" means a loan, lease, or retail installment sales contract for the purchase or lease of a motor vehicle.\n\"Free-look period\" means the period of time from the effective date of the GAP waiver until the date the borrower may cancel the contract without penalty, fees, or costs to the borrower. This period of time must not be shorter than 30 days.\n\"Guaranteed asset protection waiver\" or \"GAP waiver\" means a contractual agreement wherein a creditor agrees for a separate charge to cancel or waive all or part of amounts due on a borrower's finance agreement in the event of a total physical damage loss or unrecovered theft of the motor vehicle.\n\"Insurer\" means an insurance company licensed, registered, or otherwise authorized to do business under Minnesota law.\n\"Motor vehicle\" means self-propelled or towed vehicles designed for personal or commercial use, including, but not limited to, automobiles; trucks; motorcycles; recreational vehicles; all-terrain vehicles; snowmobiles; campers; boats; personal watercraft; and motorcycle, boat, camper, and personal watercraft trailers. A creditor is prohibited from selling a GAP waiver in conjunction with the sale or lease of any used motor vehicle that is an automobile or truck that is valued at less than $5,000.\n\"Person\" includes an individual, company, association, organization, partnership, business trust, corporation, and every form of legal entity.",
	"repealed": false
}