{
	"id": "260C.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.521",
	"title": "260C.521 COURT REVIEWS AFTER PERMANENCY DISPOSITION ORDER.",
	"text": "(a) Court reviews of an order for permanent custody to the responsible social services agency for placement of the child in foster care must be conducted at least yearly at an in-court appearance hearing.\n(b) The purpose of the review hearing is to ensure:\n(1) the responsible social services agency made intensive, ongoing, and, as of the date of the hearing, unsuccessful efforts to return the child home or secure a placement for the child with a fit and willing relative, custodian, or adoptive parent, and an order for permanent custody to the responsible social services agency for placement of the child in foster care continues to be in the best interests of the child;\n(2) that the responsible social services agency is assisting the child to build connections to the child's family and community;\n(3) that the responsible social services agency is appropriately planning with the child for development of independent living skills for the child and, as appropriate, for the orderly and successful transition to adulthood that may occur if the child continues in foster care without another permanency disposition order;\n(4) the child's foster family home or child care institution is following the reasonable and prudent parenting standards; and\n(5) the child has regular, ongoing opportunities to engage in age or developmentally appropriate activities by consulting with the child in an age-appropriate manner about the opportunities.\n(c) The court must review the child's out-of-home placement plan and the reasonable efforts of the responsible social services agency to finalize an alternative permanent plan for the child including the responsible social services agency's efforts to:\n(1) ensure that permanent custody to the responsible social services agency with placement of the child in foster care continues to be the most appropriate legal arrangement for meeting the child's need for permanency and stability by reviewing the compelling reasons it continues not to be in the best interest of the child to:\n(i) return home;\n(ii) be placed for adoption; or\n(iii) be placed with a fit and willing relative through an order for permanent legal and physical custody under section 260C.515, subdivision 4;\n(2) identify a specific foster home for the child, if one has not already been identified;\n(3) support continued placement of the child in the identified home, if one has been identified;\n(4) ensure appropriate services are provided to address the physical health, mental health, and educational needs of the child during the period of foster care and also ensure appropriate services or assistance to maintain relationships with appropriate family members and the child's community; and\n(5) plan for the child's independence upon the child's leaving foster care living as required under section 260C.212, subdivision 1.\n(d) The court may find that the responsible social services agency has made reasonable efforts to finalize the permanent plan for the child when:\n(1) the responsible social services agency has made reasonable efforts to identify a more legally permanent home for the child than is provided by an order for permanent custody to the agency for placement in foster care;\n(2) the child has been asked about the child's desired permanency outcome; and\n(3) the responsible social services agency's engagement of the child in planning for a successful transition to adulthood is reasonable and appropriate.\n(a) An order for a relative to have permanent legal and physical custody of a child may be modified using standards under sections 518.18 and 518.185.\n(b) When a child is receiving Northstar kinship assistance under sections 142A.60 to 142A.612, if a relative named as permanent legal and physical custodian in an order made under this chapter becomes incapacitated or dies, a successor custodian named in the Northstar Care for Children kinship assistance benefit agreement under section 142A.608 may file a request to modify the order for permanent legal and physical custody to name the successor custodian as the permanent legal and physical custodian of the child. The court may modify the order to name the successor custodian as the permanent legal and physical custodian upon reviewing the background study required under section 245C.33 if the court finds the modification is in the child's best interests.\n(c) The social services agency is a party to the proceeding and must receive notice.\n(a) A parent may seek modification of an order for permanent custody of the child to the responsible social services agency for placement in foster care upon motion and a showing by the parent of a substantial change in the parent's circumstances such that the parent could provide appropriate care for the child and that removal of the child from the permanent custody of the agency and the return to the parent's care would be in the best interests of the child.\n(b) The responsible social services agency may ask the court to vacate an order for permanent custody to the agency upon a petition and hearing pursuant to section 260C.163 establishing the basis for the court to order another permanency disposition under this chapter, including termination of parental rights based on abandonment if the parent has not visited the child, maintained contact with the child, or participated in planning for the child as required under section 260C.515, subdivision 5. The responsible social services agency must establish that the proposed permanency disposition order is in the child's best interests. Upon a hearing where the court determines the petition is proved, the court may vacate the order for permanent custody and enter a different order for a permanent disposition that is in the child's best interests. The court shall not require further reasonable efforts to reunify the child with the parent or guardian as a basis for vacating the order for permanent custody to the agency and ordering a different permanency disposition in the child's best interests. The county attorney must file the petition and give notice as required under the Minnesota Rules of Juvenile Protection Procedure in order to modify an order for permanent custody under this subdivision.\nIf a child is removed from a permanent placement disposition authorized under section 260C.515, subdivision 4, 5, or 6, within one year after the placement was made:\n(1) the child must be returned to the residential facility where the child was placed immediately preceding the permanent placement; or\n(2) the court shall hold a hearing within ten days after the child is removed from the permanent placement to determine where the child is to be placed. A guardian ad litem must be appointed for the child for this hearing.",
	"repealed": false
}