{
	"id": "169A.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.63",
	"title": "169A.63 VEHICLE FORFEITURE.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Appropriate agency\" means a law enforcement agency that has the authority to make an arrest for a violation of a designated offense or to require a test under section 169A.51 (chemical tests for intoxication).\n(c) \"Asserting person\" means a person, other than the driver alleged to have committed a designated offense, claiming an ownership interest in a vehicle that has been seized or restrained under this section.\n(d) \"Claimant\" means an owner of a motor vehicle or a person claiming a leasehold or security interest in a motor vehicle.\n(e) \"Designated license revocation\" includes a license revocation under section 169A.52 (license revocation for test failure or refusal) or 171.177 (revocation; search warrant) or a license disqualification under section 171.165 (commercial driver's license disqualification) resulting from a violation of section 169A.52 or 171.177; within ten years of the first of two or more qualified prior impaired driving incidents.\n(f) \"Designated offense\" includes:\n(1) a violation of section 169A.20 (driving while impaired) under the circumstances described in section 169A.24 (first-degree driving while impaired); or\n(2) a violation of section 169A.20 or an ordinance in conformity with it within ten years of the first of two qualified prior impaired driving incidents.\n(g) \"Family or household member\" means:\n(1) a parent, stepparent, or guardian;\n(2) any of the following persons related by blood, marriage, or adoption: brother, sister, stepbrother, stepsister, first cousin, aunt, uncle, nephew, niece, grandparent, great-grandparent, great-uncle, great-aunt; or\n(3) persons residing together or persons who regularly associate and communicate with one another outside of a workplace setting.\n(h) \"Motor vehicle\" and \"vehicle\" do not include a vehicle which is stolen or taken in violation of the law.\n(i) \"Owner\" means a person legally entitled to possession, use, and control of a motor vehicle, including a lessee of a motor vehicle if the lease agreement has a term of 180 days or more. There is a rebuttable presumption that a person registered as the owner of a motor vehicle according to the records of the Department of Public Safety is the legal owner. For purposes of this section, if a motor vehicle is owned jointly by two or more people, each owner's interest extends to the whole of the vehicle and is not subject to apportionment.\n(j) \"Prosecuting authority\" means the attorney in the jurisdiction in which the designated offense occurred who is responsible for prosecuting violations of a designated offense or a designee. If a state agency initiated the forfeiture, and the attorney responsible for prosecuting the designated offense declines to pursue forfeiture, the Attorney General's Office or its designee may initiate forfeiture under this section.\n(k) \"Security interest\" means a bona fide security interest perfected according to section 168A.17, subdivision 2, based on a loan or other financing that, if a vehicle is required to be registered under chapter 168, is listed on the vehicle's title.\n(a) A motor vehicle subject to forfeiture under this section may be seized by the appropriate agency upon process issued by any court having jurisdiction over the vehicle.\n(b) Property may be seized without process if:\n(1) the seizure is incident to a lawful arrest or a lawful search;\n(2) the vehicle subject to seizure has been the subject of a prior judgment in favor of the state in a criminal injunction or forfeiture proceeding under this section; or\n(3) the appropriate agency has probable cause to believe that the delay occasioned by the necessity to obtain process would result in the removal or destruction of the vehicle. If property is seized without process under this clause, the prosecuting authority must institute a forfeiture action under this section as soon as is reasonably possible by serving a notice of seizure and intent to forfeit at the address of the owner as listed in the records of the Department of Public Safety.\n(c) When a motor vehicle is seized, the officer must provide a receipt to the person found in possession of the motor vehicle; or in the absence of any person, the officer must leave a receipt in the place where the motor vehicle was found, if reasonably possible.\nAll right, title, and interest in a vehicle subject to forfeiture under this section vests in the appropriate agency upon commission of the conduct resulting in the designated offense or designated license revocation giving rise to the forfeiture. Any vehicle seized under this section is not subject to replevin, but is deemed to be in the custody of the appropriate agency subject to the orders and decrees of the court having jurisdiction over the forfeiture proceedings. When a vehicle is seized under this section, the appropriate agency shall use reasonable diligence to secure the property and prevent waste and may do any of the following:\n(1) place the vehicle under seal;\n(2) remove the vehicle to a place designated by it; and\n(3) place a disabling device on the vehicle.\nIf the owner of a vehicle that has been seized under this section seeks possession of the vehicle before the forfeiture action is determined, the owner may give security or post bond payable to the appropriate agency in an amount equal to the retail value of the seized vehicle. On posting the security or bond, the seized vehicle may be returned to the owner only if a disabling device is attached to the vehicle. The forfeiture action must proceed against the security as if it were the seized vehicle. This subdivision does not apply to a vehicle being held for investigatory purposes.\nCertified copies of court records and motor vehicle and driver's license records concerning qualified prior impaired driving incidents are admissible as substantive evidence where necessary to prove the commission of a designated offense or the occurrence of a designated license revocation.\nPrior to the entry of a court order disposing with the forfeiture action, any person who has an interest in forfeited property may file with the prosecuting authority a petition for remission or mitigation of the forfeiture. The prosecuting authority may remit or mitigate the forfeiture upon terms and conditions the prosecuting authority deems reasonable if the prosecuting authority finds that: (1) the forfeiture was incurred without willful negligence or without any intention on the part of the petitioner to violate the law; or (2) extenuating circumstances justify the remission or mitigation of the forfeiture.\n(a) A motor vehicle is subject to forfeiture under this section if it was used in the commission of a designated offense or was used in conduct resulting in a designated license revocation.\n(b) Motorboats subject to seizure and forfeiture under this section also include their trailers.\n(a) A vehicle is presumed subject to forfeiture under this section if:\n(1) the driver is convicted of the designated offense upon which the forfeiture is based; or\n(2) the driver's conduct results in a designated license revocation and the driver fails to seek judicial review of the revocation in a timely manner as required by section 169A.53, subdivision 2, (petition for judicial review), or the license revocation is judicially reviewed and sustained under section 169A.53, subdivision 2.\n(b) A vehicle encumbered by a security interest perfected according to section 168A.17, subdivision 2, or subject to a lease that has a term of 180 days or more, is subject to the interest of the secured party or lessor unless the party or lessor had knowledge of or consented to the act upon which the forfeiture is based. However, when the proceeds of the sale of a seized vehicle do not equal or exceed the outstanding loan balance, the appropriate agency shall remit all proceeds of the sale to the secured party after deducting the agency's costs for the seizure, tow, storage, forfeiture, and sale of the vehicle. If the sale of the vehicle is conducted in a commercially reasonable manner consistent with the provisions of section 336.9-610, the agency is not liable to the secured party for any amount owed on the loan in excess of the sale proceeds. The validity and amount of a nonperfected security interest must be established by its holder by clear and convincing evidence.\n(c) Notwithstanding paragraph (b), the secured party's or lessor's interest in a vehicle is not subject to forfeiture based solely on the secured party's or lessor's knowledge of the act or omission upon which the forfeiture is based if the secured party or lessor demonstrates by clear and convincing evidence that the party or lessor took reasonable steps to terminate use of the vehicle by the offender.\n(a) An asserting person may bring an innocent owner claim by notifying the prosecuting authority in writing and within 60 days of the service of the notice of seizure.\n(b) Upon receipt of notice pursuant to paragraph (a), the prosecuting authority may release the vehicle to the asserting person. If the prosecuting authority proceeds with the forfeiture, the prosecuting authority must, within 30 days, file a separate complaint in the name of the jurisdiction pursuing the forfeiture against the vehicle, describing the vehicle, specifying that the vehicle was used in the commission of a designated offense or was used in conduct resulting in a designated license revocation, and specifying the time and place of the vehicle's unlawful use. The complaint may be filed in district court or conciliation court and the filing fee is waived.\n(c) A complaint filed by the prosecuting authority must be served on the asserting person and on any other registered owners. Service may be made by certified mail at the address listed in the Department of Public Safety's computerized motor vehicle registration records or by any means permitted by court rules.\n(d) The hearing on the complaint shall, to the extent practicable, be held within 30 days of the filing of the petition. The court may consolidate the hearing on the complaint with a hearing on any other complaint involving a claim of an ownership interest in the same vehicle.\n(e) At a hearing held pursuant to this subdivision, the prosecuting authority must:\n(1) prove by a preponderance of the evidence that the seizure was incident to a lawful arrest or a lawful search; and\n(2) certify that the prosecuting authority has filed, or intends to file, charges against the driver for a designated offense or that the driver has a designated license revocation.\n(f) At a hearing held pursuant to this subdivision, the asserting person must prove by a preponderance of the evidence that the asserting person:\n(1) has an actual ownership interest in the vehicle; and\n(2) did not have actual or constructive knowledge that the vehicle would be used or operated in any manner contrary to law or that the asserting person took reasonable steps to prevent use of the vehicle by the alleged offender.\n(g) If the court determines that the state met both burdens under paragraph (e) and the asserting person failed to meet any burden under paragraph (f), the court shall order that the vehicle remains subject to forfeiture under this section.\n(h) The court shall order that the vehicle is not subject to forfeiture under this section and shall order the vehicle returned to the asserting person if it determines that:\n(1) the state failed to meet any burden under paragraph (e);\n(2) the asserting person proved both elements under paragraph (f); or\n(3) clauses (1) and (2) apply.\n(i) If the court determines that the asserting person is an innocent owner and orders the vehicle returned to the innocent owner, an entity in possession of the vehicle is not required to release it until the innocent owner pays:\n(1) the reasonable costs of the towing, seizure, and storage of the vehicle incurred before the innocent owner provided the notice required under paragraph (a); and\n(2) any reasonable costs of storage of the vehicle incurred more than two weeks after an order issued under paragraph (h).\n(a) A motor vehicle used to commit a designated offense or used in conduct resulting in a designated license revocation is subject to administrative forfeiture under this subdivision.\n(b) Within 60 days from when a motor vehicle is seized under subdivision 2, or within a reasonable time after seizure, the appropriate agency shall serve the driver or operator of the vehicle with a notice of the seizure and intent to forfeit the vehicle. Additionally, when a motor vehicle is seized under subdivision 2, or within a reasonable time after that, all persons known to have an ownership, possessory, or security interest in the vehicle must be notified of the seizure and the intent to forfeit the vehicle. For those vehicles required to be registered under chapter 168, the notification to a person known to have a security interest in the vehicle is required only if the vehicle is registered under chapter 168 and the interest is listed on the vehicle's title. Upon motion by the appropriate agency or prosecuting authority, a court may extend the time period for sending notice for a period not to exceed 90 days for good cause shown. Notice mailed by certified mail to the address shown in Department of Public Safety records is sufficient notice to the registered owner of the vehicle. For motor vehicles not required to be registered under chapter 168, notice mailed by certified mail to the address shown in the applicable filing or registration for the vehicle is sufficient notice to a person known to have an ownership, possessory, or security interest in the vehicle. Otherwise, notice may be given in the manner provided by law for service of a summons in a civil action.\n(c) The notice must be in writing and contain:\n(1) a description of the vehicle seized;\n(2) the date of seizure; and\n(3) notice of the right to obtain judicial review of the forfeiture and of the procedure for obtaining that judicial review, printed in English. This requirement does not preclude the appropriate agency from printing the notice in other languages in addition to English.\nSubstantially the following language must appear conspicuously in the notice:\n\"WARNING: If you were the person arrested when the property was seized, you will automatically lose the above-described property and the right to be heard in court if you do not file a lawsuit and serve the prosecuting authority within 60 days. You may file your lawsuit in conciliation court if the property is worth $15,000 or less; otherwise, you must file in district court. You do not have to pay a filing fee for your lawsuit.\nWARNING: If you have an ownership interest in the above-described property and were not the person arrested when the property was seized, you will automatically lose the above-described property and the right to be heard in court if you do not notify the prosecuting authority of your interest in writing within 60 days.\"\n(d) If notice is not sent in accordance with paragraph (b), and no time extension is granted or the extension period has expired, the appropriate agency shall return the vehicle to the owner. An agency's return of property due to lack of proper notice does not restrict the agency's authority to commence a forfeiture proceeding at a later time.\n(e) Within 60 days following service of a notice of seizure and forfeiture under this subdivision, a claimant may file a demand for a judicial determination of the forfeiture. The demand must be in the form of a civil complaint and must be filed with the court administrator in the county in which the seizure occurred, together with proof of service of a copy of the complaint on the prosecuting authority having jurisdiction over the forfeiture. The claimant may serve the complaint by certified mail or any means permitted by court rules. If the value of the seized property is $15,000 or less, the claimant may file an action in conciliation court for recovery of the seized vehicle. A copy of the conciliation court statement of claim may be served personally or as permitted by the Rules of Conciliation Court Procedure on the prosecuting authority having jurisdiction over the forfeiture within 60 days following service of the notice of seizure and forfeiture under this subdivision. The claimant does not have to pay the court filing fee.\nNo responsive pleading is required of the prosecuting authority and no court fees may be charged for the prosecuting authority's appearance in the matter. The prosecuting authority may appear for the appropriate agency. Pleadings, filings, and methods of service are governed by the Rules of Civil Procedure and, where applicable, by the Rules of Conciliation Court Procedure.\n(f) The complaint must be captioned in the name of the claimant as plaintiff and the seized vehicle as defendant, and must state with specificity the grounds on which the claimant alleges the vehicle was improperly seized, the claimant's interest in the vehicle seized, and any affirmative defenses the claimant may have. Notwithstanding any law to the contrary, an action for the return of a vehicle seized under this section may not be maintained by or on behalf of any person who has been served with a notice of seizure and forfeiture unless the person has complied with this subdivision.\n(g) If the claimant makes a timely demand for a judicial determination under this subdivision, the forfeiture proceedings must be conducted as provided under subdivision 9.\n(a) This subdivision governs judicial determinations of the forfeiture of a motor vehicle used to commit a designated offense or used in conduct resulting in a designated license revocation. An action for forfeiture is a civil in rem action and is independent of any criminal prosecution. All proceedings are governed by the Rules of Civil Procedure.\n(b) If no demand for judicial determination of the forfeiture is pending, the prosecuting authority may, in the name of the jurisdiction pursuing the forfeiture, file a separate complaint against the vehicle, describing it, specifying that it was used in the commission of a designated offense or was used in conduct resulting in a designated license revocation, and specifying the time and place of its unlawful use.\n(c) The prosecuting authority may file an answer to a properly served demand for judicial determination, including an affirmative counterclaim for forfeiture. The prosecuting authority is not required to file an answer.\n(d) A judicial determination under this subdivision must be held at the earliest practicable date, and in any event no later than 180 days following the filing of the demand by the claimant. If a related criminal proceeding is pending, the hearing shall not be held until the conclusion of the criminal proceedings. The district court administrator shall schedule the hearing as soon as practicable after the conclusion of the criminal prosecution. The district court administrator shall establish procedures to ensure efficient compliance with this subdivision. The hearing is to the court without a jury.\n(e) There is a presumption that a vehicle seized under this section is subject to forfeiture if the prosecuting authority establishes that the vehicle was used in the commission of a designated offense or designated license revocation. A claimant bears the burden of proving any affirmative defense raised.\n(f) If the forfeiture is based on the commission of a designated offense and the person charged with the designated offense appears in court as required and is not convicted of the offense, the court shall order the property returned to the person legally entitled to it upon that person's compliance with the redemption requirements of section 169A.42. If the forfeiture is based on a designated license revocation, and the license revocation is rescinded under section 169A.53, subdivision 3 (judicial review hearing, issues, order, appeal), the court shall order the property returned to the person legally entitled to it upon that person's compliance with the redemption requirements of section 169A.42.\n(g) If the lawful ownership of the vehicle used in the commission of a designated offense or used in conduct resulting in a designated license revocation can be determined and the owner makes the demonstration required under subdivision 7a, the vehicle must be returned immediately upon the owner's compliance with the redemption requirements of section 169A.42.\n(h) If the court orders the return of a seized vehicle under this subdivision it may order sanctions under section 549.211 (sanctions in civil actions). Any sanctions must be paid from other forfeiture proceeds of the law enforcement agency and prosecuting authority involved and in the same proportion as distributed under subdivision 10, paragraph (b).\n(a) If the vehicle is administratively forfeited under subdivision 8, or if the court finds under subdivision 9 that the vehicle is subject to forfeiture under subdivisions 6 and 7, the appropriate agency shall:\n(1) sell the vehicle and distribute the proceeds under paragraph (b); or\n(2) keep the vehicle for official use. If the agency keeps a forfeited motor vehicle for official use, it shall make reasonable efforts to ensure that the motor vehicle is available for use by the agency's officers who participate in the drug abuse resistance education program.\n(b) The proceeds from the sale of forfeited vehicles, after payment of seizure, towing, storage, forfeiture, and sale expenses, and satisfaction of valid liens against the property, must be distributed as follows:\n(1) 70 percent of the proceeds must be forwarded to the appropriate agency for deposit as a supplement to the state or local agency's operating fund or similar fund for use in DWI-related enforcement, training, education, crime prevention, equipment, or capital expenses; and\n(2) 30 percent of the money or proceeds must be forwarded to the prosecuting authority that handled the forfeiture for deposit as a supplement to its operating fund or similar fund for prosecutorial purposes, training, education, crime prevention, equipment, or capital expenses. For purposes of this subdivision, the prosecuting authority shall not include privately contracted prosecutors of a local political subdivision and, in those events, the forfeiture proceeds shall be forwarded to the political subdivision where the forfeiture was handled for the purposes identified in clause (1).\n(c) If a vehicle is sold under paragraph (a), the appropriate agency shall not sell the vehicle to: (1) an officer or employee of the agency that seized the property or to a person related to the officer or employee by blood or marriage; or (2) the prosecuting authority or any individual working in the same office or a person related to the authority or individual by blood or marriage.\n(d) Sales of forfeited vehicles under this section must be conducted in a commercially reasonable manner.\n(e) If a vehicle is forfeited administratively under this section and no demand for judicial determination is made, the appropriate agency shall provide the prosecuting authority with a copy of the forfeiture or evidence receipt, the notice of seizure and intent to forfeit, a statement of probable cause for forfeiture of the property, and a description of the property and its estimated value. Upon review and certification by the prosecuting authority that (1) the appropriate agency provided a receipt in accordance with subdivision 2, paragraph (c), (2) the appropriate agency served notice in accordance with subdivision 8, and (3) probable cause for forfeiture exists based on the officer's statement, the appropriate agency may dispose of the property in any of the ways listed in this subdivision.\n(a) A financial institution with a valid security interest in or a valid lease covering a forfeited vehicle may choose to dispose of the vehicle under this subdivision, in lieu of the appropriate agency disposing of the vehicle under subdivision 9. A financial institution wishing to dispose of a vehicle under this subdivision shall notify the appropriate agency of its intent, in writing, within 30 days after receiving notice of the seizure and forfeiture. The appropriate agency shall release the vehicle to the financial institution or its agent after the financial institution presents proof of its valid security agreement or of its lease agreement and the financial institution agrees not to sell the vehicle to a member of the violator's household, unless the violator is not convicted of the offense on which the forfeiture is based. The financial institution shall dispose of the vehicle in a commercially reasonable manner as defined in section 336.9-610.\n(b) After disposing of the forfeited vehicle, the financial institution shall reimburse the appropriate agency for its seizure, storage, and forfeiture costs. The financial institution may then apply the proceeds of the sale to its storage costs, to its sale expenses, and to satisfy the lien or the lease on the vehicle. If any proceeds remain, the financial institution shall forward the proceeds to the state treasury, which shall credit the appropriate fund as specified in subdivision 9.\nThe appropriate agency and prosecuting authority shall report on forfeitures occurring under this section as described in section 609.5315, subdivision 6.\n(a) A forfeiture proceeding is stayed and the vehicle must be returned if the driver becomes a program participant in the ignition interlock program under section 171.306 at any time before the motor vehicle is forfeited and any of the following apply:\n(1) the driver committed a designated offense other than a violation of section 169A.20 under the circumstances described in section 169A.24; or\n(2) the driver is accepted into a treatment court dedicated to changing the behavior of alcohol- and other drug-dependent offenders arrested for driving while impaired.\n(b) Notwithstanding paragraph (a), the vehicle whose forfeiture was stayed in paragraph (a) may be seized and the forfeiture action may proceed under this section if the program participant described in paragraph (a):\n(1) subsequently operates a motor vehicle:\n(i) to commit a violation of section 169A.20 (driving while impaired);\n(ii) in a manner that results in a license revocation under section 169A.52 (license revocation for test failure or refusal) or 171.177 (revocation; search warrant) or a license disqualification under section 171.165 (commercial driver's license disqualification) resulting from a violation of section 169A.52 or 171.177;\n(iii) after tampering with, circumventing, or bypassing an ignition interlock device; or\n(iv) without an ignition interlock device at any time when the driver's license requires such device;\n(2) either voluntarily or involuntarily ceases to participate in the program for more than 30 days, or fails to successfully complete it as required by the Department of Public Safety due to:\n(i) two or more occasions of the participant's driving privileges being withdrawn for violating the terms of the program, unless the withdrawal is determined to be caused by an error of the department or the interlock provider; or\n(ii) violating the terms of the contract with the provider as determined by the provider; or\n(3) was the driver, forfeiture was stayed after the driver entered a treatment court, and the driver ceases to be a participant in the treatment court for any reason.\n(c) Paragraph (b) applies only if the described conduct occurs before the participant has been restored to full driving privileges or within three years of the original designated offense or designated license revocation, whichever occurs latest.\n(d) The requirement in subdivision 2, paragraph (b), that device manufacturers provide a discounted rate to indigent program participants applies also to device installation under this subdivision.\n(e) An impound or law enforcement storage lot operator must allow an ignition interlock manufacturer sufficient access to the lot to install an ignition interlock device under this subdivision.\n(f) Notwithstanding paragraph (a), an entity in possession of the vehicle is not required to release it until the reasonable costs of the towing, seizure, and storage of the vehicle have been paid by the vehicle owner.\n(g) At any time prior to the vehicle being forfeited, the appropriate agency may require that the owner or driver of the vehicle surrender the title of the seized vehicle.\n(h) If an event described in paragraph (b) occurs in a jurisdiction other than the one in which the original forfeitable event occurred, and the vehicle is subsequently forfeited, the proceeds shall be divided equally, after payment of seizure, towing, storage, forfeiture, and sale expenses and satisfaction of valid liens against the vehicle, among the appropriate agencies and prosecuting authorities in each jurisdiction.\n(i) Upon successful completion of the program, the stayed forfeiture proceeding is terminated or dismissed and any vehicle, security, or bond held by an agency must be returned to the owner of the vehicle.\n(j) A claimant of a vehicle for which a forfeiture action was stayed under paragraph (a) but which later proceeds under paragraph (b), may file a demand for judicial forfeiture as provided in subdivision 8, in which case the forfeiture proceedings must be conducted as provided in subdivision 9.\nAn appropriate agency or prosecuting authority, including but not limited to any peace officer as defined in section 626.84, subdivision 1, paragraph (c); prosecutor; or employee of an appropriate agency or prosecuting authority who, in good faith and within the course and scope of the official duties of the person or entity, returns a vehicle seized under this chapter to the owner pursuant to this section shall be immune from criminal or civil liability regarding any event arising out of the subsequent unlawful or unauthorized use of the motor vehicle.",
	"repealed": false
}