{
	"id": "187.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/187.05",
	"title": "187.05 SECURE CHOICE RETIREMENT PROGRAM.",
	"text": "(a) The board must operate an employee retirement savings program whereby employee payroll deduction contributions are transmitted on an after-tax or pretax basis by covered employers to individual retirement accounts established under the program.\n(b) The board must establish procedures for opening a Roth IRA, a traditional IRA, or both a Roth IRA and a traditional IRA for each covered employee whose covered employer transmits employee payroll deduction contributions under the program.\n(c) Contributions must be made on an after-tax (Roth) basis, unless the covered employee elects to contribute on a pretax basis.\nThe board must establish and administer each Roth IRA and traditional IRA opened under the program in compliance with section 408 or 408A of the Internal Revenue Code, as applicable, for the benefit of the covered employee for whom the account was opened.\nEach covered employer must transmit employee payroll deduction contributions to an account established for the benefit of the covered employee in a trust established to hold contributions under the program.\n(a) The board must establish default, minimum, and maximum employee contribution rates and an escalation schedule to automatically increase each covered employee's contribution rate annually until the contribution rate is equal to the maximum contribution rate.\n(b) A covered employee must have the right, annually or more frequently as determined by the board, to change the contribution rate, opt out or elect not to contribute, or cease contributions.\nCovered employees are 100 percent vested in their accounts at all times.\nThe board must establish alternatives permitting covered employees to take a withdrawal of all or a portion of the covered employee's account while employed and one or more distributions following termination of employment. Distribution alternatives must include lifetime income options.\n(a) In addition to home and community-based services employees under paragraph (b), the board may allow individuals not employed by a covered employer to open and contribute to an account in the program, in which case the individual must be considered a covered employee for purposes of sections 187.05 to 187.11.\n(b) The board must allow any home and community-based services employee to open and contribute to an account in the program within six months of the opening of the program and must consider a home and community-based services employee a covered employee for purposes of sections 187.05 to 187.11.\n(a) For purposes of this chapter, in the case of a taxpaying employer described in section 268.046 that contracts with an employee leasing company, professional employer organization, or other similar entity to obtain workers for the taxpaying employer from the entity for a fee, the workers covered by the contract must be treated as employed by the taxpaying employer and not by the entity, except that if the entity provides the workers with a retirement savings plan, the taxpaying employer is not a covered employer.\n(b) A covered employer that is a taxpaying employer described in section 268.046 may contract with an employee leasing company, professional employer organization, or other similar entity to assist the taxpaying employer with the performance of some or all of the taxpaying employer's responsibilities under this chapter.",
	"repealed": false
}