{
	"id": "123B.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.14",
	"title": "123B.14 OFFICERS OF INDEPENDENT SCHOOL DISTRICTS.",
	"text": "On the first Monday of January of each year, or as soon thereafter as practicable, the board must meet and organize by selecting a chair, clerk, and a treasurer, who shall hold their offices for one year and until their successors are selected and qualify. The persons who perform the duties of the clerk and treasurer need not be members of the board and the board by resolution may combine the duties of the offices of clerk and treasurer in a single person in the Office of Business Affairs. They may appoint a superintendent who shall be ex officio a member of the board, but not entitled to vote therein.\nThe chair when present shall preside at all meetings of the board, countersign all orders upon the treasurer for claims allowed by the board, represent the district in all actions and perform all the duties usually incumbent on such officer. In case of absence, inability, or refusal of the clerk to draw orders for the payment of money authorized by a vote of the majority of the board to be paid, the orders may be drawn by the chair, and paid by the treasurer. A statement of the orders drawn, with a copy of such orders, shall be delivered to the clerk by the treasurer, or the office of the clerk may be declared vacant by the chair and treasurer and filled by appointment.\n(a) The treasurer shall deposit the funds of the district in the official depository.\n(b) In addition to the authority for deposit of district money pursuant to paragraph (a) or other provisions of this chapter, the treasurer may deposit district money in the official depository in accordance with the following conditions:\n(1) The official depository is authorized by the treasurer to (i) arrange for the redeposit of the money into deposit accounts in one or more banks, savings and loan associations, or credit unions that are located in the United States, and (ii) serve as custodian for the district with respect to the money redeposited into such accounts.\n(2) The full amount of the redeposited district funds, plus accrued interest, if any, must be insured by the Federal Deposit Insurance Corporation or the National Credit Union Share Insurance Fund. Any entity serving as subcustodian for the official depository shall have had at least five years of general custodial experience.\nThe treasurer shall make all reports which may be called for by the board and perform all duties usually incumbent on such officer.\nIn the event that valid orders are presented to the treasurer for payment, and there are insufficient funds on hand to pay them, the treasurer shall receive, endorse and process them in accordance with section 123B.12.\nWhen the duty devolves upon any person employed by a board to receive money and pay it over to the treasurer of the district, the district must require a bond from such person and pay all premiums therefor. The amount of each bond shall be fixed by the board and the bond approved by it. The bond must be not less than $500 conditioned for the faithful performance of the duty and be filed with the clerk. In lieu of individual bonds, the district may prescribe and keep in effect a schedule or position insurance policy or blanket bond in such aggregate amount as the district determines, insuring the fidelity of such persons in the amount of not less than $500 for each such person.\nThe clerk shall keep a record of all meetings of the district and the board in books provided by the district for that purpose. The clerk shall, within three days after an election, notify all persons elected of their election. By September 15 of each year the clerk shall file with the board a report of the revenues, expenditures and balances in each fund for the preceding fiscal year. The report together with vouchers and supporting documents shall subsequently be examined by a public accountant or the state auditor, either of whom shall be paid by the district, as provided in section 123B.77, subdivision 3. The board shall by resolution approve the report or require a further or amended report. By September 15 of each year, the clerk shall make and transmit to the commissioner certified reports, showing:\n(1) the revenues and expenditures in detail, and such other financial information required by law, rule, or as may be called for by the commissioner;\n(2) the length of school term and the enrollment and attendance by grades; and\n(3) such other items of information as may be called for by the commissioner.\nThe clerk shall enter in the clerk's record book copies of all reports and of the teachers' term reports, as they appear in the registers, and of the proceedings of any meeting as furnished by the clerk pro tem, and keep an itemized account of all the expenses of the district. The clerk shall furnish to the auditor of the proper county, by September 30 of each year, an attested copy of the clerk's record, showing the amount of proposed property tax voted by the district or the board for school purposes; draw and sign all orders upon the treasurer for the payment of money for bills allowed by the board for salaries of officers and for teachers' wages and all claims, to be countersigned by the chair. Such orders must state the consideration, payee, and the fund and the clerk shall take a receipt therefor. Teachers' wages shall have preference in the order in which they become due, and no money applicable for teachers' wages shall be used for any other purpose, nor shall teachers' wages be paid from any fund except that raised or apportioned for that purpose.",
	"repealed": false
}