{
	"id": "148B.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.54",
	"title": "148B.54 LICENSE RENEWAL REQUIREMENTS.",
	"text": "Licensees shall renew licenses at the time and in the manner established by the rules of the board.\n(a) At the completion of the first four years of licensure, a licensee must provide evidence satisfactory to the board of completion of 12 additional postgraduate semester credit hours or its equivalent in counseling as determined by the board, except that no licensee shall be required to show evidence of greater than 60 semester hours or its equivalent. In addition to completing the requisite graduate coursework, each licensee shall also complete in the first four years of licensure a minimum of 40 hours of continuing education activities approved by the board under Minnesota Rules, part 2150.2540. Graduate credit hours successfully completed in the first four years of licensure may be applied to both the graduate credit requirement and to the requirement for 40 hours of continuing education activities. A licensee may receive 15 continuing education hours per semester credit hour or ten continuing education hours per quarter credit hour. Thereafter, at the time of renewal, each licensee shall provide evidence satisfactory to the board that the licensee has completed during each two-year period at least the equivalent of 40 clock hours of professional postdegree continuing education in programs approved by the board and continues to be qualified to practice under sections 148B.50 to 148B.593.\n(b) At least four of the required 40 continuing education clock hours must be on increasing the knowledge, understanding, self-awareness, and practice skills that enable a licensed professional counselor and licensed professional clinical counselor to serve clients from diverse socioeconomic and cultural backgrounds. Topics include but are not limited to:\n(1) understanding culture, culture's functions, and strengths that exist in varied cultures;\n(2) understanding clients' cultures and differences among and between cultural groups;\n(3) understanding the nature of social diversity and oppression; and\n(4) understanding cultural humility.\nAn individual whose license was terminated and who can demonstrate completion of the graduate credit requirement in subdivision 2, does not need to comply with the continuing education requirement of Minnesota Rules, part 2150.2520, subpart 4, or with the continuing education requirements for relicensure following termination in Minnesota Rules, part 2150.0130, subpart 2. This section does not apply to an individual whose license has been canceled.",
	"repealed": false
}