{
	"id": "58B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/58B.09",
	"title": "58B.09 DENIAL; SUSPENSION; REVOCATION OF LICENSES.",
	"text": "(a) The commissioner may by order take any or all of the following actions:\n(1) bar a person from engaging in student loan servicing;\n(2) deny, suspend, or revoke a student loan servicer license;\n(3) censure a student loan servicer;\n(4) impose a civil penalty, as provided in section 45.027, subdivision 6;\n(5) order restitution to the borrower, if applicable; or\n(6) revoke an exemption.\n(b) In order to take the action in paragraph (a), the commissioner must find:\n(1) the order is in the public interest; and\n(2) the student loan servicer, applicant, person in control, employee, or agent has:\n(i) violated any provision of this chapter or a rule or order adopted or issued under this chapter;\n(ii) violated a standard of conduct or engaged in a fraudulent, coercive, deceptive, or dishonest act or practice, including but not limited to negligently making a false statement or knowingly omitting a material fact, whether or not the act or practice involves student loan servicing;\n(iii) engaged in an act or practice that demonstrates untrustworthiness, financial irresponsibility, or incompetence, whether or not the act or practice involves student loan servicing;\n(iv) pled guilty or nolo contendere to or been convicted of a felony, gross misdemeanor, or misdemeanor;\n(v) paid a civil penalty or been the subject of a disciplinary action by the commissioner, order of suspension or revocation, cease and desist order, injunction order, or order barring involvement in an industry or profession issued by the commissioner or any other federal, state, or local government agency;\n(vi) been found by a court of competent jurisdiction to have engaged in conduct evidencing gross negligence, fraud, misrepresentation, or deceit;\n(vii) refused to cooperate with an investigation or examination by the commissioner;\n(viii) failed to pay any fee or assessment imposed by the commissioner; or\n(ix) failed to comply with state and federal tax obligations.\nTo begin a proceeding under this section, the commissioner shall issue an order requiring the subject of the proceeding to show cause why action should not be taken against the person according to this section. The order must be calculated to give reasonable notice of the time and place for the hearing and must state the reasons for entry of the order. The commissioner may by order summarily suspend a license or exemption or summarily bar a person from engaging in student loan servicing pending a final determination of an order to show cause. If a license or exemption is summarily suspended or if the person is summarily barred from any involvement in the servicing of student loans pending final determination of an order to show cause, a hearing on the merits must be held within 30 days of the issuance of the order of summary suspension or bar. All hearings must be conducted under chapter 14. After the hearing, the commissioner shall enter an order disposing of the matter as the facts require. If the subject of the order fails to appear at a hearing after having been duly notified, the person is considered in default and the proceeding may be determined against the subject of the order upon consideration of the order to show cause, the allegations of which may be considered to be true.\nIf a license or certificate of exemption lapses; is surrendered, withdrawn, or terminated; or otherwise becomes ineffective, the commissioner may (1) institute a proceeding under this subdivision within two years after the license or certificate of exemption was last effective and enter a revocation or suspension order as of the last date on which the license or certificate of exemption was in effect, and (2) impose a civil penalty as provided for in this section or section 45.027, subdivision 6.\n(a) A borrower who suffers damage as a result of the failure of a student loan servicer to comply with this chapter may bring an action on a borrower's own behalf and on behalf of a similarly situated class of persons against that student loan servicer to recover or obtain:\n(1) actual damages, except that the total award of damages must be at least $500 per plaintiff, per violation;\n(2) an order enjoining the methods, acts, or practices;\n(3) restitution of property;\n(4) punitive damages;\n(5) reasonable attorney fees; and\n(6) any other relief that the court deems proper.\n(b) In addition to any other remedies provided by this subdivision or otherwise provided by law, if a student loan servicer is shown, by a preponderance of the evidence, to have engaged in conduct that substantially interferes with a borrower's right to an alternative payment arrangement; loan forgiveness, cancellation, or discharge; or any other financial benefit established under the terms of a borrower's promissory note or under the Higher Education Act of 1965, United States Code, title 20, section 1070a, et seq., a borrower is entitled to damages of at least $1,500 per plaintiff, per violation.\n(c) At least 45 days before bringing an action for damages or injunctive relief under this chapter, a borrower must:\n(1) provide written notice to the student loan servicer alleged to have violated this chapter regarding the nature of the alleged violations; and\n(2) demand that the student loan servicer correct and remedy the method, act, or practice identified in the notice under clause (1).\n(d) The notice required by this subdivision must be sent by certified or registered mail, return receipt requested, to the student loan servicer's address on file with the Department of Commerce or to the student loan servicer's principal place of business in Minnesota.\n(e) An action for damages or injunctive relief brought by a borrower only on the individual borrower's behalf must not be maintained under paragraph (a) upon a showing by a student loan servicer that an appropriate correction and remedy is given, or is agreed to be given within a reasonable time, to the borrower within 30 days after the notice is received.\n(f) An action for damages brought by a borrower on both the borrower's behalf and on behalf of a similarly situated class of persons must not be maintained under paragraph (a) upon a showing by a student loan servicer alleged to have employed or committed a method, act, or practice declared unlawful if:\n(1) all borrowers similarly situated have been identified or a reasonable effort to identify other borrowers has been made;\n(2) all borrowers identified have been notified that, upon the borrower's request, the student loan servicer must make the appropriate correction and remedy;\n(3) the correction and remedy requested by the borrower has been given or is given within a reasonable amount of time; and\n(4) the student loan servicer has ceased from engaging, or if immediate cessation is impossible or unreasonably expensive under the circumstances, the student loan servicer ceases to engage within a reasonable amount of time, in the method, act, or practice.\n(g) An attempt to comply with a demand described in paragraph (c) by a student loan servicer that receives the demand is construed as an offer to compromise and is inadmissible as evidence under Minnesota Rules of Evidence, rule 408. An attempt to comply with a demand is not an admission of engaging in an act or practice declared unlawful by paragraph (a). Evidence of compliance or attempts to comply with this section may be introduced by a defendant to establish good faith or to show compliance with paragraph (a).\n(h) An award of damages must not be given in an action based on a method, act, or practice in violation of paragraph (a) if the student loan servicer alleged to have employed or committed that method, act, or practice:\n(1) proves by a preponderance of the evidence that the violation was not intentional and resulted from a bona fide error, notwithstanding the use of reasonable procedures adopted to avoid that error; and\n(2) makes an appropriate correction, repair, replacement, or other remedy under paragraphs (e) and (f).",
	"repealed": false
}