{
	"id": "221.0252",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.0252",
	"title": "221.0252 PASSENGER CARRIER; REGISTRATION, EXEMPTIONS.",
	"text": "A person who wishes to operate as a motor carrier of passengers must file with the commissioner a complete and accurate federal motor carrier identification report form MCS-150. In addition, a person must file a vehicle registration form prescribed by the commissioner describing the make, model, number of passengers the vehicle is designed to transport as determined by the vehicle's manufacturer, and license plate and vehicle identification number of each vehicle that the registrant will be using in those operations for which registration is required.\nA form required under this section may be signed only by a corporate officer, general partner, limited liability company board member, or sole proprietor.\n(a) Within 90 days of issuing a new certificate of registration to a carrier under this section, and before issuing an annual renewal of a certificate of registration, the commissioner shall:\n(1) conduct an audit of the carrier's records;\n(2) inspect the vehicles the carrier uses in its motor carrier operation to determine if they comply with the federal regulations incorporated in section 221.0314 or accept for filing proof that a complete vehicle inspection was conducted within the previous one year by a commercial vehicle inspector of the Department of Public Safety or an inspector certified by the commissioner of public safety under section 169.781;\n(3) verify that the carrier has a designated office in Minnesota where the books and files necessary to conduct business and the records required by this chapter are kept and made available for inspection by the commissioner;\n(4) audit the carrier's drivers' criminal background and safety records; and\n(5) verify compliance with the insurance requirements of section 221.141.\n(b) To streamline the audit process and to reduce the regulatory burden on carriers, the commissioner may reduce the number of vehicle inspections and records audited under paragraph (a) if the commissioner has sufficient information from federal and state motor carrier safety data about a carrier's operations to determine a carrier's safety fitness as described in Code of Federal Regulations, title 49, section 385.7. At a minimum, the commissioner must conduct the record audit in paragraph (a) once in four years.\n(c) The commissioner and the commissioner of public safety shall, through an interagency agreement, coordinate vehicle inspection activities to avoid duplication of annual vehicle inspections to minimize the burden of compliance on carriers and to maximize the efficient use of state resources.\n(a) The commissioner shall issue a certificate of registration to a carrier who (1) does not have an unsatisfactory safety rating, (2) has complied with subdivisions 1 and 2, (3) has paid the required fee, (4) in the case of an annual renewal, has been audited and inspected under subdivision 3, and (5) has complied with the financial responsibility requirements in section 221.141.\n(b) A photocopy of the carrier's certificate of registration must be carried in each vehicle operated under the registration and must be made available to the department and other law enforcement officials upon request.\n(c) Registration under this section is not assignable or transferable and is valid until it expires or is suspended, revoked, or canceled, whichever occurs first. A registration is valid for one year from the date issued.\nFollowing the procedures in section 221.185, the commissioner shall immediately suspend the registration of a carrier who receives an unsatisfactory safety rating. The commissioner shall conduct one follow-up compliance audit to determine if the carrier's safety rating should be changed or the suspension rescinded within 30 days of receiving a written request from the carrier. Additional compliance reviews may be conducted at the commissioner's discretion.\nA carrier registered under this section must renew its registration each year on a form prescribed by the commissioner. The commissioner shall develop and implement an expedited renewal process to minimize the burden on motor carriers.\nNotwithstanding any other law, motor carriers of passengers are exempt from sections 221.121; 221.122; 221.161; and 221.171.",
	"repealed": false
}