{
	"id": "82.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.70",
	"title": "82.70 COMPENSATION.",
	"text": "Unless authorized in writing by the real estate broker to whom the licensee is licensed or to whom the licensee was licensed at the time of the transaction, a licensee shall not pay and a licensee shall not accept a commission, compensation, referral fee, BPO fee, or other valuable consideration for the performance of any acts requiring a real estate license from any person except the real estate broker to whom the licensee is licensed or to whom the licensee was licensed at the time of the transaction.\n(a) In connection with a real estate or business opportunity transaction, a real estate broker or real estate salesperson shall not offer, pay, or give, and a person shall not accept, any compensation or other thing of value from a real estate broker or real estate salesperson by way of commission-splitting, rebate, referral fees, finder's fees, or otherwise.\n(b) This subdivision does not apply to transactions:\n(1) between a licensed real estate broker or salesperson and the parties to the transaction;\n(2) among persons licensed as provided in this chapter;\n(3) between a licensed real estate broker or salesperson and persons from other jurisdictions similarly licensed in that jurisdiction;\n(4) involving timeshare or other recreational lands where the amount offered or paid does not exceed $150, and payment is not conditioned upon any sale but is made merely for providing the referral and the person paying the fee is bound by any representations made by the person receiving the fee; and\n(5) involving a person who receives a referral fee from a person or an agent of a person licensed under this section, provided that in any 12-month period, no recipient may earn more than the value of one month's rent, that the recipient is a resident of the property or has lived there within 60 days of the payment of the fee, and that the person paying the fee is bound by any representations made by the recipient of the fee.\nA licensee shall not accept, give, or charge any undisclosed compensation or realize any direct or indirect remuneration that inures to the benefit of the licensee on an expenditure made for a principal.\nThe seller may, in the listing agreement, authorize the seller's broker to disburse part of the broker's compensation to other brokers, including the buyer's brokers solely representing the buyer.\nA licensed real estate broker or salesperson may assign or direct that commissions or other compensation earned in connection with a real estate or business opportunity transaction be paid to a corporation, limited liability company, or sole proprietorship of which the licensed real estate broker or salesperson is the sole owner. \"Sole owner\" in this subdivision means the licensed real estate broker or salesperson and may include the licensed real estate broker's or salesperson's spouse.\nA real estate closing agent may not charge a fee for closing services to a borrower, and a borrower may not be required to pay such a fee at settlement, if the fee was not previously disclosed in writing at least one business day before the settlement. This disclosure requirement is satisfied if a disclosure is made or an estimate given under section 507.45.",
	"repealed": false
}