{
	"id": "403.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.36",
	"title": "403.36 STATEWIDE RADIO BOARD.",
	"text": "(a) The commissioner of public safety shall convene and chair the Statewide Radio Board to develop a project plan for a statewide, shared, trunked public safety radio communication system. The system may be referred to as \"Allied Radio Matrix for Emergency Response,\" or \"ARMER.\"\n(b) The board consists of the following members or their designees:\n(1) the commissioner of public safety;\n(2) the commissioner of transportation;\n(3) the state chief information officer;\n(4) the commissioner of natural resources;\n(5) the chief of the Minnesota State Patrol;\n(6) the chair of the Metropolitan Council;\n(7) two elected city officials, one from the ten-county metropolitan area and one from Greater Minnesota, appointed by the governing body of the League of Minnesota Cities;\n(8) two elected county officials, one from the ten-county metropolitan area and one from Greater Minnesota, appointed by the governing body of the Association of Minnesota Counties;\n(9) two sheriffs, one from the ten-county metropolitan area and one from Greater Minnesota, appointed by the governing body of the Minnesota Sheriffs' Association;\n(10) two chiefs of police, one from the ten-county metropolitan area and one from Greater Minnesota, appointed by the governor after considering recommendations made by the Minnesota Chiefs' of Police Association;\n(11) two fire chiefs, one from the ten-county metropolitan area and one from Greater Minnesota, appointed by the governor after considering recommendations made by the Minnesota Fire Chiefs' Association;\n(12) two representatives of emergency medical service providers, one from the ten-county metropolitan area and one from Greater Minnesota, appointed by the governor after considering recommendations made by the Minnesota Ambulance Association;\n(13) the chair of the Metropolitan Emergency Services Board; and\n(14) a representative of Greater Minnesota elected by those units of government in phase three and any subsequent phase of development as defined in the statewide, shared radio and communication plan, who have submitted a plan to the Statewide Radio Board and where development has been initiated.\n(c) The Statewide Radio Board shall coordinate the appointment of board members representing Greater Minnesota with the appointing authorities and may designate the geographic region or regions from which an appointed board member is selected where necessary to provide representation from throughout the state.\nBoard members have no set term and remain on the board until a successor is appointed as provided in subdivision 1. However, with respect to those board members who, under subdivision 1, must be elected officials, a successor must be appointed as provided in subdivision 1 no later than the date that the member is no longer an elected official, unless the member dies while in office, in which case a successor must be named as soon as practicable.\nCompensation, removal, and filling of vacancies of board members are governed by section 15.0575, except that appointments to the board are not subject to the open appointments process of sections 15.0597 to 15.0599.\nEach member has one vote. The majority of the voting power of the board constitutes a quorum, although a smaller number may adjourn from time to time. Any motion, other than adjournment, must be favored by a majority of the voting power of the board in order to carry.\nThe board shall convene upon the call of the chair or any six members of the board.\nThe Statewide Radio Board has overall responsibility for the statewide, shared radio and communication system project plan. The commissioner of public safety shall implement the plan adopted by the Statewide Radio Board. The commissioner of public safety shall contract with the commissioner of transportation to construct, own, operate, maintain, and enhance the elements of the backbone system defined in the plan. The commissioner of transportation, under appropriate state law, shall contract for, or procure by purchase or lease (including joint purchase and lease agreements), construction, installation of materials, supplies and equipment, and other services as may be needed to build, operate, and maintain the system backbone. The Department of Transportation shall own, operate, and maintain those elements identified in the project plan as the system backbone, including, but not limited to, radio towers and associated structures and equipment related to the system backbone.\nMS 2008 [Repealed, 2009 c 59 art 5 s 25]\n(a) In addition to responsibilities provided for in subdivision 1e, the Statewide Radio Board is designated as Minnesota's State Interoperability Executive Committee.\n(b) As Minnesota's State Interoperability Executive Committee, the Statewide Radio Board shall:\n(1) develop and maintain a statewide plan for local and private public safety communications interoperability that integrates with the Minnesota emergency operation plan;\n(2) develop and adopt guidelines and operational standards for local and private public safety communications interoperability within Minnesota;\n(3) promote coordination and cooperation among local, state, federal, and tribal public safety agencies in addressing statewide public safety communications interoperability within Minnesota;\n(4) advise the commissioner of the Department of Public Safety on public safety communications interoperability and on the allocation and use of funds made available to Minnesota to support public safety communications interoperability;\n(5) to the extent permitted by federal law, Federal Communications Commission regulations, and the National Telecommunications and Information Administration, develop guidelines and standards for the efficient use of interoperability frequencies on all frequency spectrums assigned to public safety users; and\n(6) to the extent permitted by federal law and treaties with Canada, develop guidelines and standards that support interoperability with adjoining states and provinces of Canada along Minnesota's northern border.\n(a) The statewide, shared radio and communication system project plan must include:\n(1) standards, guidelines, and comprehensive design for the system, including use and integration of existing public and private communications infrastructure;\n(2) proposed project implementation schedule, phases, and estimated costs for each phase of the plan;\n(3) recommended statutory changes required for effective implementation and administration of the statewide, shared trunked radio and communication system;\n(4) an interoperability committee to make recommendations on the statewide plan for local and private public safety communications interoperability and on guidelines and operational standards necessary to promote public safety communications interoperability within Minnesota; and\n(5) a policy for the lease of excess space or capacity on systems constructed under the project plan, consistent with section 174.70, subdivision 2, with priority given first to local units of government for public safety communication transmission needs and second to any other communications transmission needs of either the public or private sector.\n(b) The Statewide Radio Board must ensure that generally accepted project management techniques are utilized for each project or phase of the backbone of the statewide, shared radio and communication system consistent with guidelines of the Project Management Office of the Department of Information Technology Services:\n(1) clear sponsorship;\n(2) scope management;\n(3) project planning, control, and execution;\n(4) continuous risk assessment and mitigation;\n(5) cost management;\n(6) quality management reviews;\n(7) communications management; and\n(8) proven methodology.\nA local unit of government that receives state funds for integration with the statewide, shared, trunked radio and communication system must have a plan approved by the Statewide Radio Board and must comply with the standards and guidelines contained in the project plan. The Statewide Radio Board must review and approve all local and regional planning initiatives for connectivity to the system to assure compatibility, interoperability and integration support with the system and plan standards. As part of the review the Statewide Radio Board must require, and a county or local unit of government must provide, a detailed plan including a budget and detailed cost estimates.\nIn conjunction with each biennial budget process, the Statewide Radio Board must submit a status report to the governor and to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over capital investment and criminal justice funding and policy. The report must include a substantive assessment and evaluation of each significant part of the implementation of the statewide public safety radio plan with (1) to the extent possible, an update on risks and mitigation strategies; and (2) quantitative information on the status, progress, costs, benefits, and effects of those efforts.",
	"repealed": false
}