{
	"id": "62K.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62K.10",
	"title": "62K.10 GEOGRAPHIC ACCESSIBILITY; PROVIDER NETWORK ADEQUACY.",
	"text": "(a) This section applies to all health carriers that either require an enrollee to use or that create incentives, including financial incentives, for an enrollee to use, health care providers that are managed, owned, under contract with, or employed by the health carrier. A health carrier that does not manage, own, or contract directly with providers in Minnesota is exempt from this section, unless it is part of a holding company as defined in section 60D.15 that in aggregate exceeds ten percent in either the individual or small group market in Minnesota.\n(b) Health carriers renting provider networks from other entities must submit the rental agreement or contract to the commissioner of health for approval. In reviewing the agreements or contracts, the commissioner shall review the agreement or contract to ensure that the entity contracting with health care providers accepts responsibility to meet the requirements in this section.\nFor those counties in which a health carrier actively markets an individual health plan, the health carrier must offer, in those same counties, at least one individual health plan with a provider network that includes in-network access to more than a single health care provider system. This subdivision is applicable only for the year in which the health carrier actively markets an individual health plan.\nThe maximum travel distance or time shall be the lesser of 30 miles or 30 minutes to the nearest provider of each of the following services: primary care services, mental health services, and general hospital services.\nThe maximum travel distance or time shall be the lesser of 60 miles or 60 minutes to the nearest provider of specialty physician services, ancillary services, specialized hospital services, and all other health services not listed in subdivision 2.\n(a) Each designated provider network must include a sufficient number and type of providers, including providers that specialize in mental health and substance use disorder services, to ensure that covered services are available to all enrollees without unreasonable delay. In determining network adequacy, the commissioner of health shall consider availability of services, including the following:\n(1) primary care physician services are available and accessible 24 hours per day, seven days per week, within the network area;\n(2) a sufficient number of primary care physicians have hospital admitting privileges at one or more participating hospitals within the network area so that necessary admissions are made on a timely basis consistent with generally accepted practice parameters;\n(3) specialty physician service is available through the network or contract arrangement;\n(4) mental health and substance use disorder treatment providers, including but not limited to psychiatric residential treatment facilities, are available and accessible through the network or contract arrangement;\n(5) to the extent that primary care services are provided through primary care providers other than physicians, and to the extent permitted under applicable scope of practice in state law for a given provider, these services shall be available and accessible; and\n(6) the network has available, either directly or through arrangements, appropriate and sufficient personnel, physical resources, and equipment to meet the projected needs of enrollees for covered health care services.\n(b) The commissioner may establish sufficiency by referencing any reasonable criteria, which include but are not limited to:\n(1) ratios of providers to enrollees by specialty;\n(2) ratios of primary care professionals to enrollees;\n(3) geographic accessibility of providers;\n(4) waiting times for an appointment with participating providers;\n(5) hours of operation;\n(6) the ability of the network to meet the needs of enrollees that are:\n(i) low-income persons;\n(ii) children and adults with serious, chronic, or complex health conditions, physical disabilities, or mental illness; or\n(iii) persons with limited English proficiency and persons from underserved communities;\n(7) other health care service delivery system options, including telemedicine or telehealth, mobile clinics, centers of excellence, and other ways of delivering care; and\n(8) the volume of technological and specialty care services available to serve the needs of enrollees that need technologically advanced or specialty care services.\n(a) A health carrier may apply to the commissioner of health for a waiver of the requirements in subdivision 2 or 3 if it is unable to meet the statutory requirements. A waiver application must be submitted on a form provided by the commissioner, must be accompanied by an application fee of $500 for each application to waive the requirements in subdivision 2 or 3 for one or more provider types per county, and must:\n(1) demonstrate with specific data that the requirement of subdivision 2 or 3 is not feasible in a particular service area or part of a service area; and\n(2) include specific information as to the steps that were and will be taken to address the network inadequacy, and, for steps that will be taken prospectively to address network inadequacy, the time frame within which those steps will be taken.\n(b) The commissioner shall establish guidelines for evaluating waiver applications, standards governing approval or denial of a waiver application, and standards for steps that health carriers must take to address the network inadequacy and allow the health carrier to meet network adequacy requirements within a reasonable time period. The commissioner shall review each waiver application using these guidelines and standards and shall approve a waiver application only if:\n(1) the standards for approval established by the commissioner are satisfied; and\n(2) the steps that were and will be taken to address the network inadequacy and the time frame for taking these steps satisfy the standards established by the commissioner.\n(c) If, in its waiver application, a health carrier demonstrates to the commissioner that there are no providers of a specific type or specialty in a county, the commissioner may approve a waiver in which the health carrier is allowed to address network inadequacy in that county by providing for patient access to providers of that type or specialty via telehealth, as defined in section 62A.673, subdivision 2.\n(d) The waiver shall automatically expire after one year. Upon or prior to expiration of a waiver, a health carrier unable to meet the requirements in subdivision 2 or 3 must submit a new waiver application under paragraph (a) and must also submit evidence of steps the carrier took to address the network inadequacy. When the commissioner reviews a waiver application for a network adequacy requirement which has been waived for the carrier for the most recent one-year period, the commissioner shall also examine the steps the carrier took during that one-year period to address network inadequacy, and shall only approve a subsequent waiver application that satisfies the requirements in paragraph (b), demonstrates that the carrier took the steps it proposed to address network inadequacy, and explains why the carrier continues to be unable to satisfy the requirements in subdivision 2 or 3.\n(e) Application fees collected under this subdivision shall be deposited in the state government special revenue fund in the state treasury.\nMS 2017 Supp [Expired, 2017 c 2 art 2 s 11]\nSubdivisions 2 and 3 shall not apply if an enrollee is referred to a referral center for health care services. A referral center is a medical facility that provides highly specialized medical care, including but not limited to organ transplants. A health carrier or preferred provider organization may consider the volume of services provided annually, case mix, and severity adjusted mortality and morbidity rates in designating a referral center.\nEach health carrier must comply with section 62Q.19.\nThe commissioner of health shall enforce this section.",
	"repealed": false
}