{
	"id": "349.1641",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.1641",
	"title": "349.1641 LICENSES; SUMMARY SUSPENSION.",
	"text": "(a) The board may (1) summarily suspend the license of an organization that is more than 45 days late in filing a monthly report required to be submitted to the board under this chapter or board rule or a tax return or in paying a tax required under chapter 297E and may keep the suspension in effect until all required returns are filed and required taxes are paid; (2) summarily suspend for not more than 90 days any license issued by the board or director for what the board determines are actions detrimental to the integrity of lawful gambling in Minnesota; (3) summarily suspend the license of a gambling manager who has failed to receive the training required under section 349.167, subdivision 4, clause (2), and may keep the suspension in effect until the gambling manager passes an examination prepared and administered by the board. The examination does not qualify as continuing education credit for the next calendar year; and (4) summarily suspend the license of an organization that fails to pay the fees required under section 349.16, 349.165, or 349.167, and may keep the suspension in effect until all required fees are paid.\n(b) The board must notify the licensee at least 14 days before suspending the license under this section. If a license is summarily suspended under this section, a contested case hearing on the merits must be held within 20 days of the issuance of the order of suspension, unless the parties agree to a later hearing date. The administrative law judge's report must be issued within 20 days after the close of the hearing record. In all cases involving summary suspension, the board must issue its final decision within 30 days after receipt of the report of the administrative law judge and subsequent exceptions and argument under section 14.61. When an organization's license is suspended under this section, the board shall within three days notify all municipalities in which the organization's gambling premises are located and all licensed distributors in the state.",
	"repealed": false
}