{
	"id": "375.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.17",
	"title": "375.17 PUBLICATION OF FINANCIAL STATEMENTS.",
	"text": "Annually, not later than the first Tuesday after the first Monday in March, the county board shall make a full and accurate statement of the receipts and expenditures of the preceding year, which shall contain a statement of the assets and liabilities, a summary of receipts, disbursements, and balances of all county funds together with a detailed statement of each fund account, under the form and style prescribed by and on file with the state auditor. The prescribed form and any changes or modifications of it shall so far as practical be uniform for all counties. Annually the board shall publish the statement or a summary of the statement in a form as prescribed by the state auditor, for one issue in a duly qualified legal newspaper in the county.\nIf the board elects to publish the full statement, it may refrain from publishing:\n(1) an itemized account of amounts paid out, to whom and for what purpose to the extent that the published proceedings of the county board contain the information, if all disbursements aggregating $5,000 or more to any person are set forth in a schedule of major disbursements showing amounts paid out, to whom and for what purpose and are made a part of, and published with, the financial statement;\n(2) the names and amounts of salaries and expenses paid to employees but shall publish the totals of disbursements for salaries and expenses; and\n(3) the names of persons receiving human services aid and the amounts paid to each, but the totals of the disbursements for those purposes must be published.\nThis subdivision does not apply to a summary published pursuant to subdivision 1.\nIn addition to the publication in the newspaper designated by the board as the official newspaper for publication of the financial statement, the statement shall be published in one other newspaper, if one of general circulation is located in a different municipality in the county than the official newspaper. The county board shall call for separate bids for each publication. If a provision of this section is inconsistent with section 393.07, the provisions of that section shall prevail. The financial statement must be filed with the county auditor for public inspection.",
	"repealed": false
}