{
	"id": "49.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.34",
	"title": "49.34 CONSOLIDATION OR MERGER OF STATE BANKS OR TRUST COMPANIES, PROCEDURE.",
	"text": "Any two or more state banks, operating in the same city, may be consolidated or merged into a consolidated or merged state bank, and any two or more trust companies, operating in the same city, may be consolidated or merged into a consolidated or merged trust company, and any state bank or state banks and any trust company or trust companies, operating in the same city, may be consolidated or merged into a consolidated or merged state bank or consolidated or merged trust company, as the respective boards of directors thereof may determine. The consolidation or merger shall be effected in the manner provided in sections 49.35 to 49.41 and when so organized, the consolidated or merged corporation shall be governed and conducted in all other respects as provided by the statutes relating to the respective classes of financial corporations.\n(a) Notwithstanding the geographic limitations of subdivision 1 and the limitations on number of facilities, distance limitations, and consent requirements contained in section 47.52, a state bank may apply to the commissioner, pursuant to the procedures contained in sections 47.51 to 47.56 and 49.35 to 49.41, to acquire another state bank or national banking association and its detached facilities through merger, consolidation, or purchase of assets and assumption of liabilities and operate them as detached facilities of the successor bank.\n(b) Where the commissioner has determined that a merger, consolidation or purchase of assets and assumption of liabilities is necessary and in the public interest to prevent the probable failure of a state bank, national banking association, or state or federal savings association or savings bank, the limitations on location and number of detached facilities in section 47.52 shall not apply to the establishment of a detached facility directly resulting from such acquisition. The establishment of a detached facility in order to prevent a probable failure as provided in this paragraph shall not require the written consent of banks having a principal office in the municipality in which the resulting detached facility will be located, notwithstanding the provisions of section 47.52.\nThe consolidation or merger under this paragraph of a capital stock savings association or savings bank and a bank shall be effected in the manner provided in sections 49.33 to 49.41. A savings association or savings bank that is a mutual association may be acquired directly under this paragraph through the purchase of assets and assumption of liabilities. A state bank acquiring a savings association or savings bank under this paragraph must, with the approval of the commissioner of commerce, establish a reasonable date by which the bank will cease all activities conducted by the savings association or savings bank that are not authorized activities for the bank.",
	"repealed": false
}