{
	"id": "84.9011",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.9011",
	"title": "84.9011 OFF-HIGHWAY VEHICLE SAFETY AND CONSERVATION PROGRAM.",
	"text": "The commissioner of natural resources shall establish a program to promote the safe and responsible operation of off-highway vehicles in a manner that does not harm the environment.\n(a) The commissioner shall enter into agreements with organizations for volunteer services that promote the safe and responsible operation of off-highway vehicles in a manner that does not harm the environment to maintain, make improvements to, and monitor trails on state forest land and other public lands. The organizations shall promote the operation of off-highway vehicles in a safe and responsible manner that complies with the laws and rules that relate to the operation of off-highway vehicles.\n(b) The organizations may provide assistance to the department in locating, recruiting, and training instructors for off-highway vehicle training programs.\n(c) The commissioner may provide assistance to enhance the comfort and safety of volunteers and to facilitate the implementation and administration of the safety and conservation program.\n(d) The commissioner shall establish standards, train, and certify organizations and individuals participating as volunteers under this section. The training shall include:\n(1) the identification of invasive species;\n(2) correctly reporting the location of invasive species; and\n(3) basic global positioning system operation.\nThe commissioner may not enter into any agreement that has the purpose of or results in the displacement of public employees by volunteers participating in the off-highway safety and conservation program under this section. The commissioner must certify to the appropriate bargaining agent that the work performed by a volunteer will not result in the displacement of currently employed workers or workers on seasonal layoff or layoff from a substantially equivalent position, including partial displacement such as reduction in hours of nonovertime work, wages, or other employment benefits.\nThe commissioner of natural resources shall appoint an Off-Highway Vehicle Safety Advisory Council to advise the commissioner on:\n(1) off-highway vehicle safety; and\n(2) standards and certification for organizations and individuals participating as volunteers under this section.",
	"repealed": false
}