{
	"id": "161.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.081",
	"title": "161.081 HIGHWAY USER TAX, DISTRIBUTION, INVESTMENT.",
	"text": "(a) Pursuant to article 14, section 5, of the constitution, five percent of the net highway user tax distribution fund is set aside, and apportioned to the county state-aid highway fund.\n(b) That apportionment is further distributed as follows:\n(1) 30.5 percent to the town road account created in section 162.081;\n(2) 16 percent to the town bridge account, which is created in the state treasury; and\n(3) 53.5 percent to the flexible highway account created in subdivision 3.\nUpon the request of the commissioner, money in the highway user tax distribution fund shall be invested by the State Board of Investment in those securities authorized for that purpose in section 11A.21. All interest and profits from the investments must be credited to the highway user tax distribution fund. The commissioner of management and budget shall be the custodian of all securities purchased under this section.\n(a) The flexible highway account is created in the state treasury. Money in the account must be allocated as follows:\n(1) 16 percent of the amount available in the flexible highway account for counties in the metropolitan area, as defined in section 473.121, subdivision 4, distributed proportionally based on the most recent estimate of county population excluding the population of any city of the first class; and\n(2) of the amount available in the flexible highway account less the amount under clause (1), as determined by the commissioner under this section for:\n(i) restoration of former trunk highways that have reverted to counties or to statutory or home rule charter cities, or for trunk highways that will be restored and subsequently turned back by agreement between the commissioner and the local road authority;\n(ii) safety improvements on county highways, municipal highways, streets, or town roads; and\n(iii) routes of regional significance.\n(b) For purposes of this subdivision, \"restoration\" means the level of effort required to improve the route that will be turned back to an acceptable condition as determined by agreement made between the commissioner and the county or city before the route is turned back.\n(c) The commissioner shall review the need for funds to restore highways that have been or will be turned back. The commissioner shall determine, on a biennial basis, the percentage of funds in the flexible highway account to be distributed to each district, and within each district the percentage to be used for each of the purposes specified in paragraph (a). Money in the account may be used for safety improvements and routes of regional significance only after money is set aside to restore the identified turnbacks. The commissioner shall make these determinations only after meeting and holding discussions with committees selected by the statewide associations of both county commissioners and municipal officials. The commissioner shall, to the extent feasible, annually allocate 50 percent of the funds in the flexible highway account to the department's metropolitan district, and 50 percent to districts in greater Minnesota.\n(d) Money that will be used for the restoration of trunk highways that have reverted or that will revert to cities must be deposited in the municipal turnback account, which is created in the state treasury.\n(e) Money that will be used for the restoration of trunk highways that have reverted or that will revert to counties must be deposited in the county turnback account, which is created in the state treasury.\n(f) Money that will be used for safety improvements must be deposited in the highway safety improvement account, which is created in the state treasury to be used as grants to statutory or home rule charter cities, towns, and counties to assist in paying the costs of constructing or reconstructing city streets, county highways, or town roads to reduce crashes, deaths, injuries, and property damage.\n(g) Money that will be used for routes of regional significance must be deposited in the routes of regional significance account, which is created in the state treasury, and used as grants to statutory or home rule charter cities, towns, and counties to assist in paying the costs of constructing or reconstructing city streets, county highways, or town roads with statewide or regional significance that have not been fully funded through other state, federal, or local funding sources.\n(h) As part of each biennial budget submission to the legislature, the commissioner must: (1) describe how the money in the flexible highway account will be apportioned among the county turnback account, the municipal turnback account, the trunk highway fund for routes turned back to local governments by agreement, the highway safety improvement account, and the routes of regional significance account; and (2) specify the turnback projects likely to be funded with the amounts available in the county turnback account and municipal turnback account, and provide the cost associated with each project.",
	"repealed": false
}