{
	"id": "260C.157",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.157",
	"title": "260C.157 INVESTIGATION; PHYSICAL AND MENTAL EXAMINATION.",
	"text": "(a) Upon request of the court the responsible social services agency or probation officer shall investigate the personal and family history and environment of any minor coming within the jurisdiction of the court under section 260C.101 and shall report its findings to the court. The court may order any minor coming within its jurisdiction to be examined by a duly qualified physician, psychiatrist, or psychologist appointed by the court.\n(b) Adoption investigations shall be conducted in accordance with the laws relating to adoptions in chapter 259.\nThe court may proceed as described in subdivision 1 only after a petition has been filed.\n(a) The responsible social services agency shall establish a juvenile treatment screening team to conduct screenings under this chapter and chapter 260D, for a child to receive treatment for an emotional disturbance, a developmental disability, or related condition in a residential treatment facility licensed by the commissioner of human services under chapter 245A, or licensed or approved by a tribe. A screening team is not required for a child to be in: (1) a residential facility specializing in prenatal, postpartum, or parenting support; (2) a facility specializing in high-quality residential care and supportive services to children and youth who have been or are at risk of becoming victims of sex trafficking or commercial sexual exploitation; (3) supervised settings for youth who are 18 years of age or older and living independently; or (4) a licensed residential family-based treatment facility for substance abuse consistent with section 260C.190. Screenings are also not required when a child must be placed in a facility due to an emotional crisis or other mental health emergency.\n(b) The responsible social services agency shall conduct screenings within 15 days of a request for a screening, unless the screening is for the purpose of residential treatment and the child is enrolled in a prepaid health program under section 256B.69, in which case the agency shall conduct the screening within ten working days of a request. The responsible social services agency shall convene the juvenile treatment screening team, which may be constituted under section 245.4885, 254B.05, or 256B.092. The team shall consist of social workers; persons with expertise in the treatment of juveniles who are emotionally disturbed, chemically dependent, or have a developmental disability; and the child's parent, guardian, or permanent legal custodian. The team may include the child's relatives as defined in section 260C.007, subdivisions 26b and 27, the child's foster care provider, and professionals who are a resource to the child's family such as teachers, medical or mental health providers, and clergy, as appropriate, consistent with the family and permanency team as defined in section 260C.007, subdivision 16a. Prior to forming the team, the responsible social services agency must consult with the child's parents, the child if the child is age 14 or older, and, if applicable, the child's tribe to obtain recommendations regarding which individuals to include on the team and to ensure that the team is family-centered and will act in the child's best interests. If the child, child's parents, or legal guardians raise concerns about specific relatives or professionals, the team should not include those individuals. This provision does not apply to paragraph (c).\n(c) If the agency provides notice to tribes under section 260.761, and the child screened is an Indian child, the responsible social services agency must make a rigorous and concerted effort to include a designated representative of the Indian child's tribe on the juvenile treatment screening team, unless the child's tribal authority declines to appoint a representative. The Indian child's tribe may delegate its authority to represent the child to any other federally recognized Indian tribe, as defined in section 260.755, subdivision 12. The provisions of the Indian Child Welfare Act of 1978, United States Code, title 25, sections 1901 to 1963, and the Minnesota Indian Family Preservation Act, sections 260.751 to 260.835, apply to this section.\n(d) If the court, prior to, or as part of, a final disposition or other court order, proposes to place a child with an emotional disturbance or developmental disability or related condition in residential treatment, the responsible social services agency must conduct a screening. If the team recommends treating the child in a qualified residential treatment program, the agency must follow the requirements of sections 260C.70 to 260C.714.\nThe court shall ascertain whether the child is an Indian child and shall notify the responsible social services agency and, if the child is an Indian child, shall notify the Indian child's tribe as paragraph (c) requires.\n(e) When the responsible social services agency is responsible for placing and caring for the child and the screening team recommends placing a child in a qualified residential treatment program as defined in section 260C.007, subdivision 26d, the agency must: (1) begin the assessment and processes required in section 260C.704 without delay; and (2) conduct a relative search according to section 260C.221 to assemble the child's family and permanency team under section 260C.706. Prior to notifying relatives regarding the family and permanency team, the responsible social services agency must consult with the child's parent or legal guardian, the child if the child is age 14 or older, and, if applicable, the child's tribe to ensure that the agency is providing notice to individuals who will act in the child's best interests. The child and the child's parents may identify a culturally competent qualified individual to complete the child's assessment. The agency shall make efforts to refer the assessment to the identified qualified individual. The assessment may not be delayed for the purpose of having the assessment completed by a specific qualified individual.\n(f) When a screening team determines that a child does not need treatment in a qualified residential treatment program, the screening team must:\n(1) document the services and supports that will prevent the child's foster care placement and will support the child remaining at home;\n(2) document the services and supports that the agency will arrange to place the child in a family foster home; or\n(3) document the services and supports that the agency has provided in any other setting.\n(g) When the Indian child's tribe or tribal health care services provider or Indian Health Services provider proposes to place a child for the primary purpose of treatment for an emotional disturbance, a developmental disability, or co-occurring emotional disturbance and chemical dependency, the Indian child's tribe or the tribe delegated by the child's tribe shall submit necessary documentation to the county juvenile treatment screening team, which must invite the Indian child's tribe to designate a representative to the screening team.\n(h) The responsible social services agency must conduct and document the screening in a format approved by the commissioner of human services.",
	"repealed": false
}