{
	"id": "383A.411",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.411",
	"title": "383A.411 BONDS OR LEVY FOR WATER SYSTEM FOR COUNTY BUILDINGS.",
	"text": "MS 1982 [Repealed, 1983 c 2 s 6]\nMS 1982 [Repealed, 1983 c 2 s 6]\nMS 1982 [Repealed, 1983 c 2 s 6]\nRamsey County may issue and sell from time to time general obligation bonds of the county in an aggregate principal amount not to exceed $5,000,000 to finance the construction, installation, modification, or improvement of heating, cooling, and domestic hot water systems serving buildings owned in whole or part, operated, or maintained by the county or the Ramsey County Medical Center Commission. The county shall pledge its full faith and credit and taxing powers for the payment of the bonds. Except as provided in this section, the bonds shall be issued in accordance with chapter 475. The bonds may be issued and sold without submitting the question of the issuance of the bonds to a vote by the people. The bonds shall be in a form and bear interest at the rate that the county prescribes and shall be sold by the county to the bidder with the most favorable bid, after notice of the time and place for the receiving of the bids has been published according to law. The bonds shall not be included in computing the net debt of the county under any law, and the taxes required for payment of the bonds and interest on them shall not be subject to any limitation provided by other law.\nIn substitution of, but not in addition to, powers granted to Ramsey County in subdivision 4, Ramsey County may levy and collect a tax on all taxable property in the county to finance the construction, installation, modification, or improvement of heating, cooling, and domestic hot water systems serving buildings owned in whole or part, operated, or maintained by the county or Ramsey County Medical Center Commission.\nThe bonds described in subdivision 4 may not be issued and the tax described in subdivision 5 may not be levied until construction is commenced on a district heating system in St. Paul which is designed for heating or cooling or domestic hot water service to one or more buildings owned in whole or part, operated, or maintained by the county or the Ramsey County Medical Center Commission.",
	"repealed": false
}