{
	"id": "116J.8738",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8738",
	"title": "116J.8738 QUALIFIED EXPANSIONS OF GREATER MINNESOTA BUSINESSES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given unless the context clearly indicates otherwise.\n(b) \"Agricultural processing facility\" means one or more facilities or operations that transform, package, sort, or grade livestock or livestock products, agricultural commodities, or plants or plant products into goods that are used for intermediate or final consumption including goods for nonfood use, and surrounding property.\n(c) \"Business\" means an individual, corporation, partnership, limited liability company, association, or any other entity engaged in operating a trade or business located in greater Minnesota.\n(d) \"City\" means a statutory or home rule charter city.\n(e) \"Greater Minnesota\" means the area of the state that excludes the metropolitan area, as defined in section 473.121, subdivision 2.\n(f) \"Qualified business\" means a business that satisfies the requirements of subdivision 2, has been certified under subdivision 3, and has not been terminated under subdivision 5.\n(a) A business is a qualified business if it satisfies the requirement of this paragraph and is not disqualified under the provisions of paragraph (b). To qualify, the business must:\n(1) have operated its trade or business in a city or cities in greater Minnesota for at least one year before applying under subdivision 3;\n(2) pay or agree to pay in the future each employee compensation, including benefits not mandated by law, that on an annualized basis equal at least 120 percent of the federal poverty level for a family of four;\n(3) plan and agree to expand its employment in one or more cities in greater Minnesota by the minimum number of employees required under subdivision 3, paragraph (c); and\n(4) have received certification from the commissioner under subdivision 3 that it is a qualified business.\n(b) A business is not a qualified business if it is either:\n(1) primarily engaged in making retail sales to purchasers who are physically present at the business's location or locations in greater Minnesota;\n(2) a public utility, as defined in section 336B.01; or\n(3) primarily engaged in lobbying; gambling; entertainment; professional sports; political consulting; leisure; hospitality; or professional services provided by attorneys, accountants, business consultants, physicians, or health care consultants.\n(c) The requirements in paragraph (a) that the business's operations and expansion be located in a city do not apply to an agricultural processing facility or a project designed to qualify under section 41A.20.\n(a) A business may apply to the commissioner for certification as a qualified business under this section. The commissioner shall specify the form of the application, the manner and times for applying, and the information required to be included in the application. The commissioner may impose an application fee in an amount sufficient to defray the commissioner's cost of processing certifications. Application fees are deposited in the greater Minnesota business expansion administration account in the special revenue fund. A business must file a copy of its application with the chief clerical officer of the city at the same time it applies to the commissioner. For an agricultural processing facility or a project designed to qualify under section 41A.20 located outside the boundaries of a city, the business must file a copy of the application with the county auditor.\n(b) The commissioner shall certify each business as a qualified business that:\n(1) satisfies the requirements of subdivision 2;\n(2) the commissioner determines would not expand its operations in greater Minnesota without the tax incentives available under subdivision 4; and\n(3) enters a business subsidy agreement with the commissioner that pledges to satisfy the minimum expansion requirements of paragraph (c) within three years or less following execution of the agreement.\nThe commissioner must act on an application within 90 days after its filing. Failure by the commissioner to take action within the 90-day period is deemed approval of the application.\n(c) The business must increase the number of full-time equivalent employees in greater Minnesota from the time the business subsidy agreement is executed by two employees or ten percent, whichever is greater.\n(d) The city, or a county for an agricultural processing facility or a project designed to qualify under section 41A.20 located outside the boundaries of a city, in which the business proposes to expand its operations may file comments supporting or opposing the application with the commissioner. The comments must be filed within 30 days after receipt by the city or county of the application and may include a notice of any contribution the city or county intends to make to encourage or support the business expansion, such as the use of tax increment financing, property tax abatement, additional city or county services, or other financial assistance.\n(e) Certification of a qualified business is effective for the seven-year period beginning on the first day of the calendar month immediately following the date that the commissioner informs the business of the award of the benefit unless the qualified business is investing at least $200,000,000 over a ten-year period. Certification for a qualified business investing at least $200,000,000 over a ten-year period is effective for the ten-year period beginning on the first day of the calendar month immediately following the date that the commissioner informs the business of the award of the benefit.\nA qualified business is entitled to a sales tax exemption, up to $5,000,000 annually and $40,000,000 during the total period of the agreement, as provided in section 297A.68, subdivision 44, for purchases made during the period the business was certified as a qualified business under this section. The commissioner has discretion to set the maximum amounts of the annual and total sales tax exemption allowed for each qualifying business as part of the business subsidy agreement.\n(a) The commissioner shall put in place a system for monitoring and ensuring that each certified business meets within three years or less the minimum expansion requirement in its business subsidy agreement and continues to satisfy those requirements for the rest of the duration of the certification under subdivision 3. This system must include regular reporting by the business to the commissioner of its baseline and current employment levels and any other information the commissioner determines may be useful to ensure compliance and for legislative evaluation of the effectiveness of the tax incentives.\n(b) A business ceases to be a qualified business and to qualify for the sales tax exemption under section 297A.68, subdivision 44, under this subdivision upon the earlier of the following dates:\n(1) the end of the duration of its designation under subdivision 3, paragraph (e), effective as provided under this subdivision or other provision of law for the tax incentive; or\n(2) the date the commissioner finds that the business has breached its business subsidy agreement and failed to satisfy the minimum expansion required by subdivision 3 and its agreement.\n(c) A business may contest the commissioner's finding that it breached its business subsidy agreement under paragraph (b), clause (2), under the contested case procedures in the Administrative Procedure Act, chapter 14.\n(d) The commissioner, after consulting with the commissioner of revenue, may waive a breach of the business subsidy agreement and permit continued receipt of tax incentives, if the commissioner determines that termination of the tax incentives is not in the best interest of the state or the local government units and the business's breach of the agreement is a result of circumstances beyond its control including, but not limited to:\n(1) a natural disaster;\n(2) unforeseen industry trends;\n(3) a decline in economic activity in the overall or greater Minnesota economy; or\n(4) loss of a major supplier or customer of the business.\nAmounts in the greater Minnesota business expansion administration account in the special revenue fund are appropriated to the commissioner of employment and economic development for costs associated with processing applications under subdivisions 3, 4, and 5, and for personnel and administrative expenses related to administering the greater Minnesota business expansion program.",
	"repealed": false
}