{
	"id": "142E.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.05",
	"title": "142E.05 AT-HOME INFANT CHILD CARE PROGRAM.",
	"text": "A family in which a parent provides care for the family's infant child may receive a subsidy in lieu of assistance if the family is eligible for or is receiving assistance under the basic sliding fee program. An eligible family must meet the eligibility factors under section 142E.10, except as provided in subdivision 4, and the requirements of this section. Subject to federal match and maintenance of effort requirements for the child care and development fund, and up to available appropriations, the commissioner shall provide assistance under the at-home infant child care program and for administrative costs associated with the program. At the end of a fiscal year, the commissioner may carry forward any unspent funds under this section to the next fiscal year within the same biennium for assistance under the basic sliding fee program.\nA family with an infant under the age of one year is eligible for assistance if:\n(1) the family is not receiving MFIP, other cash assistance, or other child care assistance;\n(2) the family has not previously received a lifelong total of 12 months of assistance under this section; and\n(3) the family is participating in the basic sliding fee program or provides verification of participating in an authorized activity at the time of application and meets the program requirements.\nA family is eligible for assistance under this section if one parent cares for the family's infant child. The eligible parent must:\n(1) be over the age of 18;\n(2) care for the infant full time in the infant's home; and\n(3) care for any other children in the family who are eligible for child care assistance under this chapter.\nFor purposes of this section, \"parent\" means birth parent, adoptive parent, or stepparent.\n(a) A family is limited to a lifetime total of 12 months of assistance under subdivision 2. The maximum rate of assistance is equal to 68 percent of the rate established under section 142E.17 for care of infants in licensed family child care in the applicant's county of residence.\n(b) A participating family must report income and other family changes as specified in sections 256P.06 and 256P.07, and the county's plan under section 142E.09, subdivision 3.\n(c) Persons who are admitted to the at-home infant child care program retain their position in any basic sliding fee program. Persons leaving the at-home infant child care program reenter the basic sliding fee program at the position they would have occupied.\n(d) Assistance under this section does not establish an employer-employee relationship between any member of the assisted family and the county or state.\nThe commissioner shall implement the at-home infant child care program under this section through counties that administer the basic sliding fee program under section 142E.04. The commissioner must develop and distribute consumer information on the at-home infant child care program to assist parents of infants or expectant parents in making informed child care decisions.",
	"repealed": false
}