{
	"id": "237.163",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.163",
	"title": "237.163 USE AND REGULATION OF PUBLIC RIGHT-OF-WAY.",
	"text": "The legislature finds, and establishes the principle that, it is in the state's interest that the use and regulation of public rights-of-way be carried on in a fair, efficient, competitively neutral, and substantially uniform manner, while recognizing such regulation must reflect the distinct engineering, construction, operation, maintenance and public and worker safety requirements, and standards applicable to various users of public rights-of-way. Because of the potential for installation by telecommunication companies of multiple and competing facilities within the public rights-of-way, the legislature finds it is necessary to enact the provisions of this section and section 237.162 to specifically authorize local government units to regulate the use of public rights-of-way by telecommunications right-of-way users.\n(a) Subject to this section, a telecommunications right-of-way user authorized to do business under the laws of this state or by license of the Federal Communications Commission may construct, maintain, and operate small wireless facilities, conduit, cable, switches, and related appurtenances and facilities along, across, upon, above, and under any public right-of-way.\n(b) Subject to this section, a local government unit has the authority to manage its public rights-of-way and to recover its rights-of-way management costs. Except as provided in subdivisions 3a, 3b, and 3c, the authority defined in this section may be exercised at the option of the local government unit and is not mandated under this section. A local government unit may, by ordinance:\n(1) require a telecommunications right-of-way user seeking to excavate or obstruct a public right-of-way for the purpose of providing telecommunications services to obtain a right-of-way permit to do so and to impose permit conditions consistent with the local government unit's management of the right-of-way;\n(2) require a telecommunications right-of-way user using, occupying, or seeking to use or occupy a public right-of-way for the purpose of providing telecommunications services to register with the local government unit by providing the local government unit with the following information:\n(i) the applicant's name, gopher state one-call registration number under section 216D.03, address, and telephone and facsimile numbers;\n(ii) the name, address, and telephone and facsimile numbers of the applicant's local representative;\n(iii) proof of adequate insurance; and\n(iv) other information deemed reasonably necessary by the local government unit for the efficient administration of the public right-of-way; and\n(3) require telecommunications right-of-way users to submit to the local government unit plans for construction and major maintenance that provide reasonable notice to the local government unit of projects that the telecommunications right-of-way user expects to undertake that may require excavation and obstruction of public rights-of-way.\n(c) A local government unit may also require a telecommunications right-of-way user that is registered with the local government unit pursuant to paragraph (b), clause (2), to periodically update the information in its registration application.\n(d) Notwithstanding sections 394.34 and 462.355, or any other law, a local government unit must not establish a moratorium with respect to:\n(1) filing, receiving, or processing applications for right-of-way or small wireless facility permits; or\n(2) issuing or approving right-of-way or small wireless facility permits.\n(e) A telecommunications right-of-way user may place a new wireless support structure or collocate small wireless facilities on wireless support structures located within a public right-of-way, subject to the approval procedures under this section and, for collocation on wireless support structures owned by a local government unit, the reasonable terms, conditions, and rates set forth under this section. A local government unit may prohibit, regulate, or charge a fee to install wireless support structures or to collocate small wireless facilities only as provided in this section.\n(f) The placement of small wireless facilities and wireless support structures to accommodate small wireless facilities are a permitted use in a public right-of-way, except that a local government unit may require a person to obtain a special or conditional land use permit to install a new wireless support structure for the siting of a small wireless facility in a right-of-way in a district or area zoned for single-family residential use or within a historic district established by federal or state law or city ordinance as of the date of application for a small wireless facility permit. This paragraph does not apply to areas outside a public right-of-way that are zoned and used exclusively for single-family residential use.\n(a) A telecommunications right-of-way user, after an excavation of a public right-of-way, shall provide for restoration of the right-of-way and surrounding areas, including the pavement and its foundation, in the same condition that existed before the excavation. Local government units that choose to perform their own surface restoration required as a result of the excavation may require telecommunications right-of-way users to reimburse the reasonable costs of that surface restoration. Restoration of the public right-of-way must be completed within the dates specified in the right-of-way permit, unless the permittee obtains a waiver or a new or amended right-of-way permit.\n(b) If a telecommunications right-of-way user elects not to restore the public right-of-way, a local government unit may impose a degradation fee in lieu of restoration to recover costs associated with a decrease in the useful life of the public right-of-way caused by the excavation of the right-of-way by a telecommunications right-of-way user.\n(c) A telecommunications right-of-way user that disturbs uncultivated sod in the excavation or obstruction of a public right-of-way shall plant grasses that are native to Minnesota and, wherever practicable, that are of the local eco-type, as part of the restoration required under this subdivision, unless the owner of the real property over which the public right-of-way traverses objects. In restoring the right-of-way, the telecommunications right-of-way user shall consult with the Department of Natural Resources regarding the species of native grasses that conform to the requirements of this paragraph.\n(a) A local government unit:\n(1) may require a telecommunications right-of-way user to obtain a permit or permits under this section to place a new wireless support structure or collocate a small wireless facility in a public right-of-way managed by the local government unit;\n(2) must not require an applicant for a small wireless facility permit to provide any information that:\n(i) has previously been provided to the local government unit by the applicant in an application for a small wireless permit, which specific reference shall be provided to the local government unit by the applicant; and\n(ii) is not reasonably necessary to review a permit application for compliance with generally applicable and reasonable health, safety, and welfare regulations, and to demonstrate compliance with applicable Federal Communications Commission regulations governing radio frequency exposure, or other information required by this section;\n(3) must ensure that any application for a small wireless facility permit is processed on a nondiscriminatory basis; and\n(4) must specify that the term of a small wireless facility permit is equal to the length of time that the small wireless facility is in use, unless the permit is revoked under this section.\n(b) An applicant may file a consolidated permit application to collocate up to 15 small wireless facilities, or a greater number if agreed to by a local government unit, provided that all the small wireless facilities in the application:\n(1) are located within a two-mile radius;\n(2) consist of substantially similar equipment; and\n(3) are to be placed on similar types of wireless support structures.\nIn rendering a decision on a consolidated permit application, a local government unit may approve a permit for some small wireless facilities and deny a permit for others, but may not use denial of one or more permits as a basis to deny all the small wireless facilities in the application.\n(c) If a local government unit receives applications within a single seven-day period from one or more applicants seeking approval of permits for more than 30 small wireless facilities, the local government unit may extend the 90-day deadline imposed in subdivision 3c by an additional 30 days. If a local government unit elects to invoke this extension, it must inform in writing any applicant to whom the extension will be applied.\n(d) A local government unit is prohibited from requiring a person to pay a small wireless facility permit fee, obtain a small wireless facility permit, or enter into a small wireless facility collocation agreement solely in order to conduct any of the following activities:\n(1) routine maintenance of a small wireless facility;\n(2) replacement of a small wireless facility with a new facility that is substantially similar or smaller in size, weight, height, and wind or structural loading than the small wireless facility being replaced; or\n(3) installation, placement, maintenance, operation, or replacement of micro wireless facilities that are suspended on cables strung between existing utility poles in compliance with national safety codes.\nA local government unit may require advance notification of these activities if the work will obstruct a public right-of-way.\n(e) Nothing in this subdivision affects the need for an entity seeking to place a small wireless facility on a wireless support structure that is not owned by a local government unit to obtain from the owner of the wireless support structure any necessary authority to place the small wireless facility, nor shall any provision of this chapter be deemed to affect the rates, terms, and conditions for access to or placement of a small wireless facility or a wireless support structure not owned by a local government unit. This subdivision does not affect any existing agreement between a local government unit and an entity concerning the placement of small wireless facilities on local government unit-owned wireless support structures.\n(f) No later than six months after May 31, 2017, or three months after receiving a small wireless facility permit application from a wireless service provider, a local government unit that has elected to set forth terms and conditions of collocation in a standard small wireless facility collocation agreement shall develop and make available an agreement that complies with the requirements of this section and section 237.162. A standard small wireless facility collocation agreement shall be substantially complete. Notwithstanding any law to the contrary, the parties to a small wireless facility collocation agreement may incorporate additional terms and conditions mutually agreed upon into a small wireless facility collocation agreement. A small wireless facility collocation agreement between a local government unit and a wireless service provider is considered public data not on individuals and is accessible to the public under section 13.03.\n(g) An approval of a small wireless facility permit under this section authorizes the installation, placement, maintenance, or operation of a small wireless facility to provide wireless service and shall not be construed to confer authorization to (1) provide any service other than a wireless service, or (2) install, place, maintain, or operate a wireline backhaul facility in the right-of-way.\n(h) The terms and conditions of collocation under this subdivision:\n(1) may be set forth in a small wireless facility collocation agreement, if a local government unit elects to utilize such an agreement;\n(2) must be nondiscriminatory, competitively neutral, and commercially reasonable; and\n(3) must comply with this section and section 237.162.\n(a) A local government unit may not require the placement of small wireless facilities on any specific wireless support structure other than the wireless support structure proposed in the permit application.\n(b) A local government unit must not limit the placement of small wireless facilities, either by minimum separation distances between small wireless facilities or maximum height limitations, except that each wireless support structure installed in the right-of-way after May 31, 2017, shall not exceed 50 feet above ground level, unless the local government unit agrees to a greater height, subject to local zoning regulations, and may be subject to separation requirements in relation to other wireless support structures.\n(c) Notwithstanding paragraph (b), a wireless support structure that replaces an existing wireless support structure that is higher than 50 feet above ground level may be placed at the height of the existing wireless support structure, unless the local government unit agrees to a greater height, subject to local zoning regulations.\n(d) Wireless facilities constructed in the right-of-way after May 31, 2017, may not extend more than ten feet above an existing wireless support structure in place as of May 31, 2017.\n(a) Except as provided in subdivision 4, a local government unit shall issue a small wireless facility permit to a telecommunications right-of-way user seeking to install a new or replacement wireless support structure for a small wireless facility, or to collocate a small wireless facility on a wireless support structure in a public right-of-way. In processing and approving a small wireless facility permit, a local government unit may condition its approval on compliance with:\n(1) generally applicable and reasonable health, safety, and welfare regulations consistent with the local government unit's public right-of-way management;\n(2) reasonable accommodations for decorative wireless support structures or signs; and\n(3) any reasonable restocking, replacement, or relocation requirements when a new wireless support structure is placed in a public right-of-way.\n(b) A local government unit has 90 days after the date a small wireless facility permit application is filed to issue or deny the permit, or the permit is automatically issued. To toll the 90-day clock, the local government unit must provide a written notice of incompleteness to the applicant within 30 days of receipt of the application, clearly and specifically delineating all missing documents or information. Information delineated in the notice is limited to documents or information publicly required as of the date of application and reasonably related to a local government unit's determination whether the proposed equipment falls within the definition of a small wireless facility and whether the proposed deployment satisfies all health, safety, and welfare regulations applicable to the small wireless facility permit request. Upon an applicant's submittal of additional documents or information in response to a notice of incompleteness, the local government unit has ten days to notify the applicant in writing of any information requested in the initial notice of incompleteness that is still missing. Second or subsequent notices of incompleteness may not specify documents or information that were not delineated in the original notice of incompleteness. Requests for information not requested in the initial notice of incompleteness do not toll the 90-day clock. Parties can mutually agree in writing to toll the 90-day clock at any time. Section 15.99 does not apply to this paragraph or paragraph (c).\nFor the purposes of this subdivision, \"toll the 90-day clock\" means to halt the progression of days that count towards the 90-day deadline.\n(c) Except as provided in subdivision 3a, paragraph (c), a small wireless facility permit and any associated encroachment or building permit required by a local government unit, are deemed approved if the local government unit fails to approve or deny the application within 90 days after the permit application has been filed, unless the applicant and the local government unit have mutually agreed in writing to extend the 90-day deadline.\n(d) Nothing in this subdivision precludes a local government unit from applying generally applicable and reasonable health, safety, and welfare regulations when evaluating and deciding to approve or deny a small wireless facility permit.\n(a) A local government unit may deny any application for a right-of-way or small wireless facility permit if the telecommunications right-of-way user does not comply with a provision of this section.\n(b) A local government unit may deny an application for a right-of-way permit if the local government unit determines that the denial is necessary to protect the health, safety, and welfare or when necessary to protect the public right-of-way and its current use.\n(c) A local government unit may revoke a right-of-way or small wireless facility permit granted to a telecommunications right-of-way user, with or without fee refund, in the event of a substantial breach of the terms and conditions of statute, ordinance, rule, or regulation or any material condition of the permit. A substantial breach by a permittee includes, but is not limited to, the following:\n(1) a material violation of a provision of the right-of-way or small wireless facility permit;\n(2) an evasion or attempt to evade any material provision of the right-of-way or small wireless facility permit, or the perpetration or attempt to perpetrate any fraud or deceit upon the local government unit or its citizens;\n(3) a material misrepresentation of fact in the right-of-way or small wireless facility permit application;\n(4) a failure to complete work in a timely manner, unless a permit extension is obtained or unless the failure to complete work is due to reasons beyond the permittee's control; and\n(5) a failure to correct, in a timely manner, work that does not conform to applicable standards, conditions, or codes, upon inspection and notification by the local government unit of the faulty condition.\n(d) Subject to this subdivision, a local government unit may not deny an application for a right-of-way or small wireless facility permit for failure to include a project in a plan submitted to the local government unit under subdivision 2, paragraph (b), clause (3), when the telecommunications right-of-way user has used commercially reasonable efforts to anticipate and plan for the project.\n(e) In no event may a local government unit unreasonably withhold approval of an application for a right-of-way or small wireless facility permit, or unreasonably revoke a permit.\n(f) Any denial or revocation of a right-of-way or small wireless facility permit must be made in writing and must document the basis for the denial. The local government unit must notify the telecommunications right-of-way user in writing within three business days of the decision to deny or revoke a permit. If a permit application is denied, the telecommunications right-of-way user may cure the deficiencies identified by the local government unit and resubmit its application. If the telecommunications right-of-way user resubmits the application within 30 days of receiving written notice of the denial, it may not be charged an additional filing or processing fee. The local government unit must approve or deny the revised application within 30 days after the revised application is submitted.\nA telecommunications right-of-way user that: (1) has been denied registration; (2) has been denied a right-of-way permit; (3) has had its right-of-way permit revoked; or (4) believes that the fees imposed on the user by the local government unit do not conform to the requirements of subdivision 6, may have the denial, revocation, or fee imposition reviewed, upon written request, by the governing body of the local government unit. The governing body of the local government unit shall act on a timely written request at its next regularly scheduled meeting. A decision by the governing body affirming the denial, revocation, or fee imposition must be in writing and supported by written findings establishing the reasonableness of the decision.\n(a) A local government unit may recover its right-of-way management costs by imposing a fee for registration, a fee for each right-of-way or small wireless facility permit, or, when appropriate, a fee applicable to a particular telecommunications right-of-way user when that user causes the local government unit to incur costs as a result of actions or inactions of that user. A local government unit may not recover costs from a telecommunications right-of-way user or an owner of a cable communications system awarded a franchise under chapter 238 caused by another entity's activity in the right-of-way.\n(b) Fees, or other right-of-way obligations, imposed by a local government unit on telecommunications right-of-way users under this section must be:\n(1) based on the actual costs incurred by the local government unit in managing the public right-of-way;\n(2) based on an allocation among all users of the public right-of-way, including the local government unit itself, which shall reflect the proportionate costs imposed on the local government unit by each of the various types of uses of the public rights-of-way;\n(3) imposed on a competitively neutral basis; and\n(4) imposed in a manner so that aboveground uses of public rights-of-way do not bear costs incurred by the local government unit to regulate underground uses of public rights-of-way.\n(c) The rights, duties, and obligations regarding the use of the public right-of-way imposed under this section must be applied to all users of the public right-of-way, including the local government unit while recognizing regulation must reflect the distinct engineering, construction, operation, maintenance and public and worker safety requirements, and standards applicable to various users of the public rights-of-way. For users subject to the franchising authority of a local government unit, to the extent those rights, duties, and obligations are addressed in the terms of an applicable franchise agreement, the terms of the franchise shall prevail over any conflicting provision in an ordinance.\n(d) A wireless service provider may collocate small wireless facilities on wireless support structures owned or controlled by a local government unit and located within the public roads or rights-of-way without being required to apply for or enter into any individual license, franchise, or other agreement with the local government unit or any other entity, other than a standard small wireless facility collocation agreement under subdivision 3a, paragraph (f), if the local unit of government elects to utilize such an agreement.\n(e) Any initial engineering survey and preparatory construction work associated with collocation must be paid by the cost causer in the form of a onetime, nonrecurring, commercially reasonable, nondiscriminatory, and competitively neutral charge to recover the costs associated with a proposed attachment.\n(f) Total application fees for a small wireless facility permit must comply with this subdivision with respect to costs related to the permit.\n(g) A local government unit may elect to charge each small wireless facility attached to a wireless support structure owned by the local government unit a fee, in addition to other fees or charges allowed under this subdivision, consisting of:\n(1) up to $150 per year for rent to occupy space on a wireless support structure;\n(2) up to $25 per year for maintenance associated with the space occupied on a wireless support structure; and\n(3) a monthly fee for electricity used to operate a small wireless facility, if not purchased directly from a utility, at the rate of:\n(i) $73 per radio node less than or equal to 100 max watts;\n(ii) $182 per radio node over 100 max watts; or\n(iii) the actual costs of electricity, if the actual costs exceed the amount in item (i) or (ii).\n(a) In managing the public rights-of-way and in imposing fees under this section, no local government unit may:\n(1) unlawfully discriminate among telecommunications right-of-way users;\n(2) grant a preference to any telecommunications right-of-way user;\n(3) create or erect any unreasonable requirement for entry to the public rights-of-way by telecommunications right-of-way users; or\n(4) require a telecommunications right-of-way user to obtain a franchise or pay for the use of the right-of-way.\n(b) A telecommunications right-of-way user need not apply for or obtain right-of-way permits for facilities that are located in public rights-of-way on May 10, 1997, for which the user has obtained the required consent of the local government unit, or that are otherwise lawfully occupying the public right-of-way. However, the telecommunications right-of-way user may be required to register and to obtain a right-of-way permit for an excavation or obstruction of existing facilities within the public right-of-way after May 10, 1997.\n(c) Data and documents exchanged between a local government unit and a telecommunications right-of-way user are subject to the terms of chapter 13. A local government unit not complying with this paragraph is subject to the penalties set forth in section 13.08.\n(d) A local government unit may not collect a fee imposed under this section through the provision of in-kind services by a telecommunications right-of-way user, nor may a local government unit require the provision of in-kind services as a condition of consent to use the local government unit's public right-of-way or to obtain a small wireless facility permit.\n(e) Except as provided in this chapter or required by federal law, a local government unit shall not adopt or enforce any regulation on the placement or operation of communications facilities in the right-of-way where the entity is already authorized to operate in the right-of-way, and shall not regulate or impose or collect fees on communications services except to the extent specifically provided for in the existing authorization, and unless expressly required by state or federal statute.\n(a) To ensure the safe and convenient use of public rights-of-way in the state, the Public Utilities Commission shall develop and adopt by June 1, 1999, statewide construction standards for the purposes of achieving substantial statewide uniformity in construction standards where appropriate, providing competitive neutrality among telecommunications right-of-way users, and permitting efficient use of technology. The standards shall govern:\n(1) the terms and conditions of right-of-way construction, excavation, maintenance, and repair; and\n(2) the terms and conditions under which telecommunications facilities and equipment are placed in the public right-of-way.\n(b) The Public Utilities Commission is authorized to review, upon complaint by an aggrieved telecommunications right-of-way user, a decision or regulation by a local government unit that is alleged to violate a statewide standard.\n(c) A local unit of government may not adopt an ordinance or other regulation that conflicts with a standard adopted by the commission for the purposes described in paragraph (a).\n(a) Nothing in this section precludes a telecommunications right-of-way user from authorizing another entity or individual to act on its behalf to install, construct, maintain, or repair a facility or facilities owned or controlled by the telecommunications right-of-way user.\n(b) A local government unit is prohibited from imposing fees or requirements on an authorized entity or individual for actions on behalf of a telecommunications right-of-way user that are in addition to or different from the fees and requirements it is authorized to impose on the telecommunications right-of-way user under this section.\n(a) Notwithstanding any other provision in this chapter, this section does not apply to a wireless support structure owned, operated, maintained, or served by a municipal electric utility.\n(b) Subdivisions 3a, 3b, 3c, and subdivision 6, paragraphs (d) through (g), and subdivision 7, paragraph (e), do not apply to the collocation or regulation of small wireless facilities issued a permit by a local government unit before May 31, 2017, under an ordinance enacted before May 18, 2017, that regulates the collocation of small wireless facilities.",
	"repealed": false
}