{
	"id": "297A.992",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.992",
	"title": "297A.992 METROPOLITAN TRANSPORTATION AREA SALES TAX.",
	"text": "For purposes of this section, the following terms have the meanings given them:\n(1) \"metropolitan transportation area\" means the counties participating in the joint powers agreement under subdivision 3;\n(2) \"eligible county\" means the county of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington;\n(3) \"committee\" means the Grant Evaluation and Ranking System (GEARS) Committee;\n(4) \"minimum guarantee county\" means any metropolitan county or eligible county that is participating in the joint powers agreement under subdivision 3, whose proportion of the annual sales tax revenue under this section collected within that county is less than or equal to three percent; and\n(5) \"population\" means the population, as defined in section 477A.011, subdivision 3, estimated or established by July 15 of the year prior to the calendar year in which the representatives will serve on the Grant Evaluation and Ranking System Committee established under subdivision 5.\n(a) Notwithstanding section 297A.99, subdivisions 1, 2, and 3, or 477A.016, or any other law, the board of a county participating in a joint powers agreement as specified in this section shall impose by resolution (1) a transportation sales and use tax at a rate of one-quarter of one percent on retail sales and uses taxable under this chapter, and (2) an excise tax of $20 per motor vehicle, as defined in section 297B.01, subdivision 11, purchased or acquired from any person engaged in the business of selling motor vehicles at retail, occurring within the jurisdiction of the taxing authority. The taxes authorized are to fund transportation improvements as specified in this section, including debt service on obligations issued to finance such improvements pursuant to subdivision 7.\n(b) The tax imposed under this section is not included in determining if the total tax on lodging in the city of Minneapolis exceeds the maximum allowed tax under Laws 1986, chapter 396, section 5, as amended by Laws 2001, First Special Session chapter 5, article 12, section 87, or in determining a tax that may be imposed under any other limitations.\nBefore imposing the taxes authorized in subdivision 2, an eligible county must declare by resolution of its county board to be part of the metropolitan transportation area and must enter into a joint powers agreement. The joint powers agreement:\n(1) must form a joint powers board, as specified in subdivision 4;\n(2) must provide a process that allows any eligible county, by resolution of its county board, to join the joint powers board and impose the taxes authorized in subdivision 2;\n(3) may provide for withdrawal of a participating county before final termination of the agreement; and\n(4) may provide for a weighted voting system for joint powers board decisions.\n(a) The joint powers board must consist of one or more commissioners of each county that is in the metropolitan transportation area, appointed by its county board, and the chair of the Metropolitan Council, who must have voting rights, subject to subdivision 3, clause (4). The joint powers board has the powers and duties provided in this section and section 471.59.\n(b) The joint powers board may utilize no more than three-fourths of one percent of the proceeds of the taxes imposed under this section for ordinary administrative expenses incurred in carrying out the provisions of this section. Any additional administrative expenses must be paid by the participating counties.\n(c) The joint powers board may establish a technical advisory group that is separate from the GEARS Committee. The group must consist of representatives of cities, counties, or public agencies, including the Metropolitan Council. The technical advisory group must be used solely for technical consultation purposes.\n(a) The joint powers board shall establish a grant application process and identify the amount of available funding for grant awards. Grant applications must be submitted in a form prescribed by the joint powers board. An applicant must provide, in addition to all other information required by the joint powers board, the estimated cost of the project, the amount of the grant sought, possible sources of funding in addition to the grant sought, and identification of any federal funds that will be utilized if the grant is awarded. A grant application seeking transit capital funding must identify the source of money necessary to operate the transit improvement.\n(b) The joint powers board shall establish a timeline and procedures for the award of grants, and may award grants only to the state and political subdivisions. The board shall define objective criteria for the award of grants, which must include, but not be limited to, consistency with the most recent version of the transportation policy plan adopted by the Metropolitan Council under section 473.146. The joint powers board shall maximize the availability and use of federal funds in projects funded under this section.\n(c) The joint powers board shall establish a GEARS Committee, which must consist of:\n(1) one county commissioner from each county that is in the metropolitan transportation area, appointed by its county board;\n(2) one elected city representative from each county that is in the metropolitan transportation area;\n(3) one additional elected city representative from each county for every additional 400,000 in population, or fraction of 400,000, in the county that is above 400,000 in population; and\n(4) the chair of the Metropolitan Council Transportation Committee.\n(d) Each city representative must be elected at a meeting of cities in the metropolitan transportation area, which must be convened for that purpose by the Association of Metropolitan Municipalities.\n(e) The committee shall evaluate grant applications following objective criteria established by the joint powers board, and must provide to the joint powers board a selection list of transportation projects that includes a priority ranking.\n(f) A grant award for a transit project located within the metropolitan area, as defined in section 473.121, subdivision 2, may be funded only after the Metropolitan Council reviews the project for consistency with the transit portion of the Metropolitan Council policy plan and one of the following occurs:\n(1) the Metropolitan Council finds the project to be consistent;\n(2) the Metropolitan Council initially finds the project to be inconsistent, but after a good faith effort to resolve the inconsistency through negotiations with the joint powers board, agrees that the grant award may be funded; or\n(3) the Metropolitan Council finds the project to be inconsistent, and submits the consistency issue for final determination to a panel, which determines the project to be consistent. The panel is composed of a member appointed by the chair of the Metropolitan Council, a member appointed by the joint powers board, and a member agreed upon by both the chair and the joint powers board.\n(g) Grants must be funded by the proceeds of the taxes imposed under this section, bonds, notes, or other obligations issued by the joint powers board under subdivision 7.\n(h) Notwithstanding the provisions of this section except subdivision 6a, of the revenue collected under this section, the joint powers board shall allocate to the Metropolitan Council, in fiscal years 2012 and 2013, an amount not less than 75 percent of the net cost of operations for those transitways that were receiving metropolitan sales tax funds through an operating grant agreement on June 30, 2011.\n(i) The Metropolitan Council shall expend any funds allocated under paragraph (h) for the operations of the specified transitways solely within those counties that are in the metropolitan transportation area.\n(j) Nothing in paragraph (h) or (i) prevents grant awards to the Metropolitan Council for capital and operating assistance for transitways and park-and-ride facilities.\n(a) The board must allocate grant awards only for the following transit purposes:\n(i) capital improvements to transitways, including, but not limited to, commuter rail rolling stock, light rail vehicles, and transitway buses;\n(ii) capital costs for park-and-ride facilities, as defined in section 174.256, subdivision 2;\n(iii) feasibility studies, planning, alternatives analyses, environmental studies, engineering, property acquisition for transitway purposes, and construction of transitways; and\n(iv) operating assistance for transitways.\n(b) The joint powers board must annually award grants to each minimum guarantee county in an amount no less than the amount of sales tax revenue collected within that county.\n(c) No more than 1.25 percent of the total awards may be annually allocated for planning, studies, design, construction, maintenance, and operation of pedestrian programs and bicycle programs and pathways.\nThe joint powers board shall allocate all revenues from the taxes imposed under this section in conformance with the following priority order:\n(1) payment of debt service necessary for the fiscal year on bonds or other obligations issued prior to January 1, 2011, under subdivision 7; and\n(2) as otherwise authorized under this section.\n(a) The joint powers board or any county, acting under a joint powers agreement as specified in this section, may, by resolution, authorize, issue, and sell its bonds, notes, or other obligations for the purpose of funding grants under subdivision 6. The joint powers board or county may also, by resolution, issue bonds to refund the bonds issued pursuant to this subdivision.\n(b) The bonds of the joint powers board must be limited obligations, payable solely from or secured by taxes levied under this section.\n(c) The bonds of any county may be limited obligations, payable solely from or secured by taxes levied under this section. A county may also pledge its full faith, credit, and taxing power as additional security for the bonds.\n(d) Bonds may be issued in one or more series and sold without an election. The bonds shall be secured, bear the interest rate or rates or a variable rate, have the rank or priority, be executed in the manner, be payable in the manner, mature, and be subject to the defaults, redemptions, repurchases, tender options, or other terms, and shall be sold in such manner as the joint powers board, the regional railroad authority, or the county may determine.\n(e) The joint powers board or any regional railroad authority or any county may enter into and perform all contracts deemed necessary or desirable by it to issue and secure the bonds, including an indenture of trust with a trustee within or without the state.\n(f) Except as otherwise provided in this subdivision, the bonds must be issued and sold in the manner provided under chapter 475.\n(g) The joint powers board or any regional railroad authority wholly within the metropolitan transportation area also may authorize, issue, and sell its bonds, notes, or other obligations for the purposes, and in accordance with the procedures, set forth in section 398A.07 to fund grants as provided in subdivision 6. The bonds of any regional railroad authority may be limited obligations, payable solely from or secured by taxes levied under this section. A regional railroad authority may also pledge its taxing powers as additional security for the bonds.\nAfter the deductions allowed in section 297A.99, subdivision 11, the commissioner of revenue shall remit the proceeds of the taxes imposed under this section on a monthly basis, as directed by the joint powers board under this section.\nExcept as otherwise provided in this section, the provisions of section 297A.99, subdivisions 4 and 6 to 12a, govern the administration, collection, and enforcement of the tax authorized under this section.\n(a) The taxes imposed under section 297A.99, subdivision 1, by a county that withdraws from the joint powers agreement pursuant to subdivision 3, clause (3), shall terminate when the county has satisfied its portion, as defined in the joint powers agreement, of all outstanding bonds or obligations entered into while the county was a member of the agreement.\n(b) If the joint powers agreement under subdivision 3 is terminated, the taxes imposed under section 297A.99, subdivision 1, at the time of the agreement termination will terminate when all outstanding bonds or obligations are satisfied. The auditors of the counties in which the taxes are imposed shall see to the administration of this paragraph.\nIf the joint powers agreement under subdivision 3 is terminated, funds received by a county in association with the termination may be used for any of the purposes specified in section 297A.993, subdivision 2.\nThe joint powers board shall report annually by February 1 to the house of representatives and senate committees having jurisdiction over transportation policy and finance concerning the revenues received and grants awarded.\nAny grant award under this section made to the Metropolitan Council must supplement, and must not supplant, operating and capital assistance provided by the state.",
	"repealed": false
}