{
	"id": "216C.385",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.385",
	"title": "216C.385 CLEAN ENERGY RESOURCE TEAMS.",
	"text": "The legislature finds that community-based energy programs are an effective means of implementing improved energy practices including conservation, greater efficiency in energy use, and the production and use of renewable resources such as wind, solar, biomass, and biofuels. Further, community-based energy programs are found to be a public purpose for which public money may be spent.\nThe clean energy resource teams (CERT's) project is an innovative state, university, and nonprofit partnership that serves as a catalyst for community energy planning and projects. The mission of CERT's is to give citizens a voice in the energy planning process by connecting them with the necessary technical resources to identify and implement community-scale renewable energy and energy efficiency projects. In 2003, the Department of Commerce designated the CERT's project as a statewide collaborative venture and recognized six regional teams based on their geography: Central, Northeast, Northwest, Southeast, Southwest, and West-Central. Membership of CERT's may include but is not limited to representatives of utilities; federal, state, and local governments; small business; labor; senior citizens; academia; and other interested parties. The Department of Commerce may certify additional clean energy resource teams by regional geography, including teams in the Twin Cities metropolitan area.\nIn order to develop and implement community-based energy programs, a clean energy resource team may:\n(1) analyze social and economic impacts caused by energy expenditures;\n(2) analyze regional renewable and energy efficiency resources and opportunities;\n(3) link community members and community energy projects to the knowledge and capabilities of the University of Minnesota, the State Energy Office, nonprofit organizations, and regional community members, among others;\n(4) plan, set priorities for, provide technical assistance to, and catalyze local energy efficiency and renewable energy projects that help to meet state energy policy goals and maximize local economic development opportunities;\n(5) provide a broad-based resource and communications network that links local, county, and regional energy efficiency and renewable energy project efforts around the state (both interregional and intraregional);\n(6) seek, accept, and disburse grants and other aids from public or private sources for purposes authorized in this subdivision;\n(7) provide a convening and networking function within CERT's regions to facilitate education, knowledge formation, and project replication; and\n(8) exercise other powers and duties imposed on it by statute, charter, or ordinance.\nThe commissioner, via the clean energy resource teams, may provide professional, technical, organizational, and financial assistance to regions and communities to develop and implement community energy programs and projects, within available resources.",
	"repealed": false
}