{
	"id": "13.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.03",
	"title": "13.03 ACCESS TO GOVERNMENT DATA.",
	"text": "All government data collected, created, received, maintained or disseminated by a government entity shall be public unless classified by statute, or temporary classification pursuant to section 13.06, or federal law, as nonpublic or protected nonpublic, or with respect to data on individuals, as private or confidential. The responsible authority in every government entity shall keep records containing government data in such an arrangement and condition as to make them easily accessible for convenient use. Photographic, photostatic, microphotographic, or microfilmed records shall be considered as accessible for convenient use regardless of the size of such records.\n(a) The responsible authority in every government entity shall establish procedures, consistent with this chapter, to insure that requests for government data are received and complied with in an appropriate and prompt manner.\n(b) Full convenience and comprehensive accessibility shall be allowed to researchers including historians, genealogists and other scholars to carry out extensive research and complete copying of all records containing government data except as otherwise expressly provided by law.\nA responsible authority may designate one or more designees.\n(a) Upon request to a responsible authority or designee, a person shall be permitted to inspect and copy public government data at reasonable times and places, and, upon request, shall be informed of the data's meaning. If a person requests access for the purpose of inspection, the responsible authority may not assess a charge or require the requesting person to pay a fee to inspect data.\n(b) For purposes of this section, \"inspection\" includes, but is not limited to, the visual inspection of paper and similar types of government data. Inspection does not include printing copies by the government entity, unless printing a copy is the only method to provide for inspection of the data. In the case of data stored in electronic form and made available in electronic form on a remote access basis to the public by the government entity, inspection includes remote access to the data by the public and the ability to print copies of or download the data on the public's own computer equipment. Nothing in this section prohibits a government entity from charging a reasonable fee for remote access to data under a specific statutory grant of authority. A government entity may charge a fee for remote access to data where either the data or the access is enhanced at the request of the person seeking access.\n(c) The responsible authority or designee shall provide copies of public data upon request. If a person requests copies or electronic transmittal of the data to the person, the responsible authority may require the requesting person to pay the actual costs of searching for and retrieving government data, including the cost of employee time, and for making, certifying, and electronically transmitting the copies of the data or the data, but may not charge for separating public from not public data. However, if 100 or fewer pages of black and white, letter or legal size paper copies are requested, actual costs shall not be used, and instead, the responsible authority may charge no more than 25 cents for each page copied. If the responsible authority or designee is not able to provide copies at the time a request is made, copies shall be supplied as soon as reasonably possible.\n(d) When a request under this subdivision involves any person's receipt of copies of public government data that has commercial value and is a substantial and discrete portion of or an entire formula, pattern, compilation, program, device, method, technique, process, database, or system developed with a significant expenditure of public funds by the government entity, the responsible authority may charge a reasonable fee for the information in addition to the costs of making and certifying the copies. Any fee charged must be clearly demonstrated by the government entity to relate to the actual development costs of the information. The responsible authority, upon the request of any person, shall provide sufficient documentation to explain and justify the fee being charged.\n(e) The responsible authority of a government entity that maintains public government data in a computer storage medium shall provide to any person making a request under this section a copy of any public data contained in that medium, in electronic form, if the government entity can reasonably make the copy or have a copy made. This does not require a government entity to provide the data in an electronic format or program that is different from the format or program in which the data are maintained by the government entity. The entity may require the requesting person to pay the actual cost of providing the copy.\n(f) If the responsible authority or designee determines that the requested data is classified so as to deny the requesting person access, the responsible authority or designee shall inform the requesting person of the determination either orally at the time of the request, or in writing as soon after that time as possible, and shall cite the specific statutory section, temporary classification, or specific provision of federal law on which the determination is based. Upon the request of any person denied access to data, the responsible authority or designee shall certify in writing that the request has been denied and cite the specific statutory section, temporary classification, or specific provision of federal law upon which the denial was based.\n(a) The classification of a government entity's data shall change if it is required to do so to comply with either judicial or administrative rules pertaining to the conduct of legal actions or with a specific statute applicable to the data in the possession of the disseminating or receiving entity.\n(b) If data on individuals are classified as both private and confidential by this chapter, or any other statute or federal law, the data are private.\n(c) To the extent that government data are disseminated to a government entity by another government entity, the data disseminated shall have the same classification at the entity receiving them as they had at the entity providing them.\n(d) If a government entity disseminates data to another government entity, a classification provided for by law at the entity receiving the data does not affect the classification of the data at the entity that disseminates the data.\n(e) To the extent that judicial branch data are disseminated to government entities by the judicial branch, the data disseminated shall have the same level of accessibility at the government entity receiving them as they had at the judicial branch entity providing them. If the data have a specific classification in state statute or federal law, the government entity must maintain the data according to the specific classification.\nA government entity may enforce a copyright or acquire a patent for a computer software program or components of a program created by that government entity without statutory authority. In the event that a government entity acquires a patent to a computer software program or component of a program, the data shall be treated as trade secret information pursuant to section 13.37.\nIf a government entity opposes discovery of government data or release of data pursuant to court order on the grounds that the data are classified as not public, the party that seeks access to the data may bring before the appropriate presiding judicial officer, arbitrator, or administrative law judge an action to compel discovery or an action in the nature of an action to compel discovery.\nThe presiding officer shall first decide whether the data are discoverable or releasable pursuant to the rules of evidence and of criminal, civil, or administrative procedure appropriate to the action.\nIf the data are discoverable the presiding officer shall decide whether the benefit to the party seeking access to the data outweighs any harm to the confidentiality interests of the entity maintaining the data, or of any person who has provided the data or who is the subject of the data, or to the privacy interest of an individual identified in the data. In making the decision, the presiding officer shall consider whether notice to the subject of the data is warranted and, if warranted, what type of notice must be given. The presiding officer may fashion and issue any protective orders necessary to assure proper handling of the data by the parties. If the data are a videotape of a child victim or alleged victim alleging, explaining, denying, or describing an act of physical or sexual abuse, the presiding officer shall consider the provisions of section 611A.90, subdivision 2, paragraph (b). If the data are data subject to the protections under chapter 5B or section 13.045, the presiding officer shall consider the provisions of section 5B.11.\nWhen government data that is classified as not public by this chapter or any other statute, including private data on decedents and confidential data on decedents, is physically transferred to the state archives, the data shall no longer be classified as not public and access to and use of the data shall be governed by section 138.17.\nExcept for security information, nonpublic and protected nonpublic data shall become public either ten years after the creation of the data by the government entity or ten years after the data was received or collected by any governmental entity unless the responsible authority for the originating or custodial entity for the data reasonably determines that, if the data were made available to the public or to the data subject, the harm to the public or to a data subject would outweigh the benefit to the public or to the data subject. If the responsible authority denies access to the data, the person denied access may challenge the denial by bringing an action in district court seeking release of the data. The action shall be brought in the district court located in the county where the data are being maintained, or, in the case of data maintained by a state agency, in any county. The data in dispute shall be examined by the court in camera. In deciding whether or not to release the data, the court shall consider the benefits and harms in the same manner as set forth above. The court shall make a written statement of findings in support of its decision.\nUnless otherwise expressly provided by a particular statute, the classification of data is determined by the law applicable to the data at the time a request for access to the data is made, regardless of the data's classification at the time it was collected, created, or received.\nMoney may be collected by a responsible authority in a state agency for the actual cost to the agency of providing copies or electronic transmittal of government data. When money collected for purposes of this section is of a magnitude sufficient to warrant a separate account in the state treasury, that money must be deposited in a fund other than the general fund and is appropriated to the agency.\nNot public data may be discussed at a meeting open to the public to the extent provided in section 13D.05.\nPleadings, as defined by court rule, served by or on a government entity, are public data to the same extent that the data would be public if filed with the court.",
	"repealed": false
}