{
	"id": "256R.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.52",
	"title": "256R.52 NURSING FACILITY RECEIVERSHIP FEES.",
	"text": "(a) When the commissioner of health notifies the commissioner of human services that a nursing facility is subject to the receivership provisions under section 144A.15 and provides a recommendation in accordance with section 144A.154, the commissioner in consultation with the commissioner of health may establish a receivership fee that is added to a nursing facility payment. The commissioner shall reduce the requested amount by any amounts the commissioner determines are included in the nursing facility's payment rate and that are not specifically required to be paid for expenditures of the nursing facility.\nA receivership fee shall be set according to paragraphs (b) and (c) and payment shall be according to paragraphs (d) to (f).\n(b) The receivership fee per day shall be determined and revised as necessary by dividing the estimated amount of needed additional funding or actual additional costs of the receivership by the estimated resident days for the projected duration of the receivership.\n(c) The receivership fee per day shall be added to the nursing facility's payment rate.\n(d) Notification of the payment rate increase must meet the requirements of section 256R.06, subdivision 5.\n(e) The payment rate in paragraph (c) for a nursing facility is effective the first day of the receivership.\n(f) The commissioner may elect to make a lump-sum payment of a portion of the receivership fee to the receiver or managing agent. In this case, the commissioner and the receiver or managing agent shall agree to a repayment plan. Regardless of whether the commissioner makes a lump-sum payment under this paragraph, the provisions of paragraphs (b) to (e) apply.\n(a) Upon the subsequent sale or transfer of a nursing facility in receivership, the commissioner shall seek to recover from the prior licensee any amounts paid through payment rate adjustments under subdivision 1. The prior licensee shall repay this amount to the commissioner within 60 days after the commissioner notifies the prior licensee of the obligation to repay.\n(b) The commissioner may recover amounts paid through the receivership fee by means of withholding from the prior licensee payments related to any other medical assistance provider of the prior licensee in Minnesota. The prior licensee must also repay private-pay residents the amount the private-pay resident paid for the receivership fee.\n(c) If a nursing facility with payment rates determined under subdivision 1 is later sold while the nursing facility is in receivership, the payment rates in effect prior to the receivership shall be the new owner's payment rates. The commissioner shall apply to these rates any rate adjustment provided to other nursing facilities for which the facility is qualified.\n(d) The commissioner may adjust, reclassify, or disallow costs reported for a facility that was in receivership for periods of a reporting period during which the receivership was in effect and for the prior year.",
	"repealed": false
}