{
	"id": "473.675",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.675",
	"title": "473.675 LEGAL PROCEEDINGS.",
	"text": "A review of any order of the commission may be had upon certiorari in the District Court of Ramsey County upon petition of any party to the proceedings before the commission. The court may, in its discretion, stay the operation of the order sought to be reviewed for such time and on such terms as it deems advisable.\nWhen any action or proceeding at law or in equity has been or shall hereafter be commenced questioning the right, power, or authority of a public corporation created and operating under sections 473.601 to 473.679 to make or perform any contract for the development or improvement of an airport under its control and operation or the structures or facilities thereon or contemplated therefor, or to issue, sell, or deliver the corporations' bonds to pay therefor, the corporation may, if it deems that the pendency of such litigation might, directly or indirectly, delay the completion of such improvement or bond issue or otherwise be injurious to the public interests and taxpayers, move the court in which the litigation is pending to require the party or parties who instituted the same to give a surety bond in accordance with subdivisions 2 to 5.\nIf the corporation is not a party to the litigation, it may appear specially for the purpose of making and being heard on such a motion. Three days' notice of hearing on the motion shall be given. If the court determines that loss or damage to the public or taxpayers may result from the pendency of the action or proceeding, the court may require the party or parties who instituted the same to give a surety bond, approved by the court or judge, in a penal sum to be determined by the court to protect against such loss or damage, whether or not a temporary injunction or restraining order against the corporation shall have been demanded or ordered. If the bond so ordered be not filed within the reasonable time allowed therefor by the court, the action or proceeding shall be dismissed with prejudice. Such bond shall be executed by the party who instituted the litigation, or some person for the party, as principal and conditioned for the payment to the corporation of such damage as the public and taxpayers shall sustain by reason of the litigation, if the court finally decides that the party or parties were not entitled to the relief sought. The amount of damages may be ascertained by a reference or otherwise as the court shall direct, in which case the sureties shall be concluded as to the amount but the damages shall be recoverable only in an action on the bond. If the party or parties by or for whom such bond is furnished prevails in the litigation, the premium paid on the bond shall be repaid by or taxed against the corporation. During the pendency of the litigation, the court, on motion, may require additional security if found necessary, and upon failure to furnish the same shall dismiss the action or proceeding with prejudice. The court may likewise, on motion, reduce the amount of a bond theretofore required or release the bond upon being shown that the amount is excessive or the bond no longer required.\nIn litigation where a bond has been required and given under subdivision 3 or the court has denied a motion to require a bond, the court shall advance the case on its calendar for trial at the earliest feasible date. An appeal from an appealable order made, or from a judgment entered, in a district court may be taken only within 30 days after entry of judgment or after written notice of the order from the adverse party.\nNothing contained in this section shall affect the rights of any aggrieved person to bring a suit for civil damages. No bond shall be required therein except as otherwise provided by law.",
	"repealed": false
}