{
	"id": "85A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/85A.05",
	"title": "85A.05 MINNESOTA ZOOLOGICAL GARDEN BONDS.",
	"text": "For the purpose of providing money appropriated to the Minnesota Zoological Board from the Minnesota Zoological Garden building account for the acquisition and betterment of public land, buildings, and improvements of a capital nature, when authorized by law and requested by the board, the commissioner of management and budget shall sell and issue bonds of the state of Minnesota for the prompt and full payment of which, with interest thereon, the full faith, credit, and taxing powers of the state are irrevocably pledged. The proceeds of such bonds shall be credited to the building account, except that accrued interest and any premium received on sale of the bonds shall be credited to the state bond fund account referred to in subdivision 4, together with any additional sum directed to be so credited by any law authorizing an issue of such bonds. Bonds shall be issued pursuant to this section only as authorized by subdivision 6 or by another law in accordance with the provisions of the constitution, article XI, section 7. Any law authorizing the issuance of bonds in the manner provided in this section shall, together with this section, constitute complete authority for such issue, and such bonds shall not be subject to restrictions or limitations contained in any other law.\nUpon request by resolution of the Minnesota Zoological Board and upon authorization as provided in subdivision 1, the commissioner of management and budget shall sell and issue Minnesota Zoological Garden bonds in the aggregate amount requested, upon sealed bids and upon such notice, at such price, in such form and denominations, bearing interest at such rate or rates, maturing in such amounts and on such dates, without option of prepayment or subject to prepayment upon such notice and at such times and prices, payable at such bank or banks within or outside the state, with such provisions for registration, conversion, and exchange and for the issuance of notes in anticipation of the sale or delivery of definitive bonds, and in accordance with such further rules, as the commissioner of management and budget shall determine, subject to the approval of the attorney general, but not subject to chapter 14, including section 14.386. The bonds shall be executed by the commissioner of management and budget under official seal. The signature on the bonds and any appurtenant interest coupons and the seal may be printed, lithographed, engraved, or stamped thereon, except that each bond shall be authenticated by the manual signature on its face of the commissioner of management and budget or of an officer of a bank designated by them as authenticating agent. The commissioner of management and budget shall ascertain and certify to the purchasers of the bonds the performance and existence of all acts, conditions, and things necessary to make them valid and binding general obligations of the state of Minnesota, subject to the approval of the attorney general.\nAll expenses incidental to the sale, execution, delivery, and other expenses of bonds pursuant to this section, including but not limited to actual and necessary travel and subsistence expenses of state officers and employees for such purposes, shall be paid from the Minnesota Zoological Garden building account, and the amounts necessary therefor are appropriated from that account; provided that if any amount is specifically appropriated for this purpose in an act authorizing the issuance of bonds pursuant to this section, such expenses shall be limited to the amount so appropriated.\nThe commissioner of management and budget shall maintain in the state bond fund a separate bookkeeping account, which shall be designated as the state zoological garden bond account, to record receipts and disbursements of money transferred to the fund to pay Minnesota Zoological Garden bonds and income from the investment of such money, which income shall be credited to the account in each fiscal year. The legislature may appropriate to the bond account any money in the state treasury not otherwise appropriated. On November 1 of each year there shall be transferred to the bond account all of the money then available under any such appropriation or such lesser sum as will be sufficient, with all money previously transferred to the account and all income from the investment of such money, to pay all principal and interest then and theretofore due and all principal and interest to become due to and including July 1 in the second ensuing year on Minnesota Zoological Garden bonds. All money so transferred and all income from the investment thereof shall be available for the payment of such bonds and interest thereon, and so much thereof as may be necessary is appropriated for such payments. The state auditor and commissioner of management and budget are directed to make the appropriate entries in the accounts of the respective funds.\nOn or before December 1, in each year, the state auditor shall levy on all taxable property within the state whatever tax may be necessary to produce an amount sufficient, with all money then and theretofore credited to the Minnesota Zoological Garden bond account, to pay the entire amount of principal and interest then and theretofore due and principal and interest to become due on or before July 1 in the second year thereafter on Minnesota Zoological Garden bonds. This tax shall be subject to no limitation of rate or amount until all such bonds and interest thereon are fully paid. The proceeds of this tax are appropriated and shall be credited to the state bond fund, and the principal of and interest on the bonds are payable from such proceeds, and the whole thereof, or so much as may be necessary, is appropriated for such payments. If at any time there is insufficient money from the proceeds of such taxes to pay the principal and interest when due on Minnesota Zoological Garden bonds, such principal and interest shall be paid out of the general fund in the state treasury, and the amount necessary therefor is hereby appropriated, with such sums from tax levies and the general fund subject to future reimbursement to the bond fund by the Minnesota Zoological Garden bond account.\nFor the purpose of providing money for the acquisition and betterment of public land, buildings, and improvements of a capital nature needed for the Minnesota Zoological Garden in accordance with the comprehensive plan of the Minnesota Zoological Board adopted in accordance with section 85A.02, subdivision 2, the commissioner of management and budget is directed to sell and issue Minnesota Zoological Garden bonds in the amount of $23,025,000 in the manner and upon the conditions provided in subdivisions 1 to 5. The commissioner of management and budget may sell or issue an additional $2,350,000 of bonds, but no part thereof shall be expended unless equally matched by other than state appropriations. Any gifts, grants, or contributions accepted pursuant to section 85A.02, subdivision 5, other than contribution of lands by governmental entities, for the establishment or operation of the Minnesota Zoological Garden, whether in cash or in kind, shall be considered as matching funds. Noncash items shall be tangible real or personal property and shall be attributed as matching funds according to their fair market value at the time of receipt. The bonds may include a sum representing interest to accrue on the bonds from and after its date of issue through the anticipated period of construction and development of the zoological garden, which sum is needed for the payment and security of the interest payments during that period, but in no event shall the bonds exceed the maximum amount stated above. The bonds shall be sold, issued, and secured as provided in subdivisions 1 to 5 and in article XI, section 7, of the constitution, except that none of the bonds of any series issued pursuant to this authorization shall mature earlier than one year after the date of completion of the Minnesota Zoological Garden and related facilities as estimated by the Minnesota Zoological Board at the time of the issuance of such series. The proceeds of the bonds, except premium and accrued interest, are appropriated for expenditure by the Minnesota Zoological Board for the purpose for which the bonds are authorized in accordance with the provisions of Minnesota Statutes 1988, section 85A.04, subdivision 2. In order to reduce the amount of taxes otherwise required by the constitution to be levied for the payment of interest and principal on the bonds, there is also appropriated annually to the Minnesota state zoological bond account in the state bond fund from the general fund a sum of money sufficient in amount, when added to the balance on hand on November 1 in each year in the bond account, to pay all principal and interest due and to become due on the bonds to and including July 1 in the second ensuing year. The money received and on hand pursuant to this annual appropriation is available in the state bond fund prior to the levy of the tax in any year required by the constitution and by subdivision 5 and shall be used to reduce the amount of the tax otherwise required to be levied.",
	"repealed": false
}