{
	"id": "176.136",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.136",
	"title": "176.136 MEDICAL FEE REVIEW.",
	"text": "(a) The commissioner shall by rule establish procedures for determining whether or not the charge for a health service is excessive. In order to accomplish this purpose, the commissioner shall consult with insurers, associations and organizations representing the medical and other providers of treatment services and other appropriate groups.\n(b) The procedures established by the commissioner must limit, in accordance with subdivisions 1a, 1b, and 1c, the charges allowable for medical, chiropractic, podiatric, surgical, hospital and other health care provider treatment or services, as defined and compensable under section 176.135. The procedures established by the commissioner for determining whether or not the charge for a health service is excessive must be structured to encourage providers to develop and deliver services for rehabilitation of injured workers. The procedures must incorporate the provisions of sections 144.701, 144.702, and 144.703 to the extent that the commissioner finds that these provisions effectively accomplish the intent of this section or are otherwise necessary to ensure that quality hospital care is available to injured employees.\n(a) The liability of an employer for services included in the medical fee schedule is limited to the maximum fee allowed by the schedule in effect on the date of the medical service, or the provider's actual fee, whichever is lower. The commissioner shall adopt permanent rules regulating fees allowable for medical, chiropractic, podiatric, surgical, and other health care provider treatment or service, including those provided to hospital outpatients, by implementing a relative value fee schedule. The commissioner may adopt by reference, according to the procedures in paragraph (d), clause (2), the relative value fee schedule tables adopted for the federal Medicare program. The relative value fee schedule must contain reasonable classifications including, but not limited to, classifications that differentiate among health care provider disciplines. The conversion factors for the original relative value fee schedule must reasonably reflect a 15 percent overall reduction from the medical fee schedule most recently in effect. The reduction need not be applied equally to all treatment or services, but must represent a gross 15 percent reduction.\n(b) Effective October 1, 2005, the commissioner shall remove all scaling factors from the relative value units and establish four separate conversion factors for each of the following parts of Minnesota Rules:\n(1) medical/surgical services in Minnesota Rules, part 5221.4030, as defined in part 5221.0700, subpart 3, item C, subitem (2);\n(2) pathology and laboratory services in Minnesota Rules, part 5221.4040, as defined in part 5221.0700, subpart 3, item C, subitem (3);\n(3) physical medicine and rehabilitation services in Minnesota Rules, part 5221.4050, as defined in part 5221.0700, subpart 3, item C, subitem (4); and\n(4) chiropractic services in Minnesota Rules, part 5221.4060, as defined in part 5221.0700, subpart 3, item C, subitem (5).\n(c) The conversion factors shall be adjusted as follows:\n(1) After permanent rules have been adopted to implement this section, the conversion factors must be adjusted annually on October 1 by no more than the percentage change computed under section 176.645, but without the annual cap provided by that section.\n(2) Each time the workers' compensation relative value fee schedule tables are updated under paragraph (d), the commissioner shall adjust the conversion factors so that, for services in both fee schedules, there is no difference between the overall payment in each category of service listed in paragraph (b) under the new schedule and the overall payment for that category under the workers' compensation fee schedule most recently in effect. This adjustment must be made before making any additional adjustment under clause (1).\n(d) The commissioner shall give notice of the adjusted conversion factors and updates to the relative value fee schedule as follows:\n(1) The commissioner shall annually give notice in the State Register of the adjusted conversion factors and any amendments to rules to implement Medicare relative value tables incorporated by reference under this subdivision. The notices of the adjusted conversion factors and amended rules to implement the relative value tables are subject to the requirements of section 14.386, paragraph (a). The annual adjustments to the conversion factors and the medical fee schedules adopted under this section, including all previous fee schedules, are not subject to expiration under section 14.386, paragraph (b).\n(2) The commissioner shall periodically, but at least once every three years, update the workers' compensation relative value tables by incorporating by reference the relative value tables in the national physician fee schedule relative value file established by the Centers for Medicare and Medicaid Services. The commissioner shall publish the notices of the incorporation by reference in the State Register at least 60 days before the tables are to become effective for purposes of payment under this section. Each notice of incorporation must state the date the incorporated tables will become effective and must include information on how the Medicare relative value tables may be obtained. The published notices of incorporation by reference and the incorporated tables are not rules subject to section 14.386 or other provisions of chapter 14, but have the force and effect of law as of the date specified in the notices.\n(a) The liability of the employer for treatment, articles, and supplies provided to an employee while an inpatient or outpatient at a Critical Access Hospital certified by the Centers for Medicare and Medicaid Services shall be the hospital's usual and customary charge, unless the charge is determined by the commissioner or a compensation judge to be unreasonably excessive.\n(b) The liability of the employer for the treatment, articles, and supplies that are not limited by paragraph (a), subdivision 1a or 1c, section 176.1362, 176.1363, or 176.1364, shall be limited to 85 percent of the provider's usual and customary charge, or 85 percent of the prevailing charges for similar treatment, articles, and supplies furnished to an injured person when paid for by the injured person, whichever is lower, except as provided in paragraph (e). On this basis, the commissioner or compensation judge may determine the reasonable value of all treatment, services, and supplies, and the liability of the employer is limited to that amount. The commissioner may by rule establish the reasonable value of a service, article, or supply in lieu of the 85 percent limitation in this paragraph. A prevailing charge established under Minnesota Rules, part 5221.0500, subpart 2, must be based on no more than two years of billing data immediately preceding the date of the service.\n(c) The limitation of liability for charges provided by paragraph (b) does not apply to a nursing home that participates in the medical assistance program and whose rates are established by the commissioner of human services.\n(d) An employer's liability for treatment, articles, and supplies provided under this chapter by a health care provider located outside of Minnesota is limited to the payment that the health care provider would receive if the treatment, article, or supply were paid under the workers' compensation law of the jurisdiction in which the treatment was provided.\n(e) The limitation of the employer's liability based on 85 percent of prevailing charge does not apply to charges by an ambulatory surgical center as defined in section 176.1363, subdivision 1, paragraph (b), or a hospital as defined in section 176.1364, subdivision 1, paragraph (e).\n(f) For purposes of this chapter, \"inpatient\" means a patient that has been admitted to a hospital by an order from a physician or dentist. If there is no inpatient admission order, the patient is deemed an outpatient. The hospital must provide documentation of an inpatient order upon the request of the employer.\nThe commissioner shall adopt rules that reasonably limit amounts which may be charged for, or in connection with, independent or adverse medical examinations requested by any party, including the amount that may be charged for depositions, witness fees, or other expenses. No party may pay fees above the amount in the schedule.\nIf the employer or insurer determines that the charge for a health service or medical service is excessive, no payment in excess of the reasonable charge for that service shall be made under this chapter nor may the provider collect or attempt to collect from the injured employee or any other insurer or government amounts in excess of the amount payable under this chapter unless the commissioner, compensation judge, or court of appeals determines otherwise. In such a case, the health care provider may initiate an action under this chapter for recovery of the amounts deemed excessive by the employer or insurer. A charge for a health service or medical service is excessive if it:\n(1) exceeds the maximum permissible charge pursuant to subdivision 1, 1a, 1b, or 1c;\n(2) is for a service provided at a level, duration, or frequency that is excessive, based upon accepted medical standards for quality health care and accepted rehabilitation standards;\n(3) is for a service that is outside the scope of practice of the particular provider or is not generally recognized within the particular profession of the provider as of therapeutic value for the specific injury or condition treated; or\n(4) is otherwise deemed excessive or inappropriate pursuant to rules adopted pursuant to this chapter.\n(a) The commissioner may assess penalties, costs, and expenses against a health care provider who collects or attempts to collect payment from an employee in violation of subdivision 2; section 176.135, subdivision 7; or 176.83, subdivision 5, paragraph (c), as provided in this subdivision. For purposes of paragraphs (b) and (c):\n(1) A violation occurs only if the health care provider or the provider's representative was informed that the treatment or service was for a claimed workers' compensation injury or that the bill should be submitted to a workers' compensation insurer.\n(2) Once the health care provider has been provided the information described in clause (1), a violation occurs each time the health care provider, or any person acting on the provider's behalf or direction, collects or attempts to collect payment from the employee for charges on a bill for medical treatment or services. An attempt to collect payment from an employee includes:\n(i) each contact made in person or by United States mail, telephone, text, email, or any other type of contact seeking payment;\n(ii) engaging a collection agency or other third party to collect from the employee;\n(iii) filing a claim in conciliation court;\n(iv) attaching the employee's tax refund; or\n(v) submitting a report to a credit agency.\n(b) The penalty assessed against a health care provider for each violation shall be $1,000, payable to the assigned risk safety account, except that:\n(1) the penalty shall be $2,000, payable to the assigned risk safety account, for each violation if the employee paid the health care provider as a result of the violation, or for the violations described in paragraph (a), clause (2), items (ii) to (v); and\n(2) the commissioner shall not assess a penalty under this paragraph unless the commissioner has documentation that the health care provider or the health care provider's representative has been provided with written notice that the attempted collection or collection from an employee is prohibited by workers' compensation law and that penalties may be assessed for a violation of the law. The notice required by this clause may be provided by any agency or person, including an employee, self-insured employer, insurer, third-party administrator, or attorney. The written notice required by this clause must only be provided once and once provided, the commissioner may assess penalties under this paragraph for a health care provider's or the health care provider's representative's improper collection or attempts to collect payment for medical services from any employee without provision of written notice required by this paragraph. Written notice provided before August 1, 2021, satisfies the notice requirement. The commissioner shall post on the department's website a model notice. The model notice is presumed to provide sufficient notice for purposes of this clause when provided to a health care provider's billing office by any agency or person.\n(c) In addition to any penalty assessed under paragraph (b), the commissioner has the authority to order the health care provider to pay the employee the following amounts as reasonable reimbursement of costs and expenses incurred by the employee as a result of one or more violations, as provided in clauses (1) and (2), and to take all reasonable action to restore the employee's credit rating if it has been damaged as a result of the violation:\n(1) the health care provider must reimburse the employee all amounts that the employee paid to the health care provider as a result of a violation, with interest, as specified in section 176.221, subdivision 7; and\n(2) for violations described in paragraph (a), clause (2), items (ii) to (v), the health care provider must reimburse the employee a minimum lump-sum payment of $500 for which no supporting documentation is required to be provided, in addition to costs or expenses documented by the employee over that amount.\nNonexclusive examples of costs and expenses incurred as a result of a violation include attorney fees, lost wages, filing fees, court costs, courier fees, photocopying or facsimile charges, telephone and postage charges, computer or research costs, witness fees, records, and travel expenses. Costs and expenses incurred by the employee as a result of a violation are payable whether or not the health care provider has been provided with the notice described in paragraph (b), clause (2).\n[Repealed, 2014 c 182 s 8]\n[Repealed, 1987 c 332 s 117]\n[Repealed, 1992 c 510 art 4 s 26]",
	"repealed": false
}