{
	"id": "515A.4-106",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.4-106",
	"title": "515A.4-106 PURCHASER'S RIGHT TO CANCEL.",
	"text": "(a) Unless delivery of a disclosure statement is not required under section 515A.4-101(b), a declarant shall provide at least one of the purchasers of a unit with a copy of a disclosure statement not later than the date of any purchase agreement. Unless a purchaser is given the disclosure statement more than 15 days prior to execution of a purchase agreement for the unit, the purchaser may, prior to the conveyance, cancel the agreement within 15 days after receiving the disclosure statement.\nIf the conveyance occurs within 15 days after the date of the execution of the purchase agreement by the purchaser, any purchaser may waive in writing all rights to receive a disclosure statement under this section.\n(b) A purchaser who elects to cancel a purchase agreement pursuant to subsection (a), may do so by hand delivering notice thereof to the declarant or by mailing notice thereof by postage prepaid United States mail to the declarant or to the declarant's agent for service of process. Cancellation is without penalty, and all payments made by the purchaser pursuant to the purchase agreement shall be refunded promptly.\n(c) If a declarant fails to provide a purchaser to whom a unit is conveyed with a disclosure statement and all amendments thereto as required by subsections (a) and (d), that purchaser, in addition to any rights to damages or other relief, is entitled to receive from the declarant an amount not to exceed five percent of the sales price of the unit.\n(d) The disclosure statement and any information furnished in connection therewith may be amended prior to conveyance if the amendment is delivered to the purchaser to whom the disclosure statement was delivered. If the amendment materially adversely affects a purchaser, then the purchaser shall have 15 days after delivery of the amendment to cancel the purchase agreement in accordance with this section.",
	"repealed": false
}