{
	"id": "43A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.19",
	"title": "43A.19 AFFIRMATIVE ACTION.",
	"text": "(a) To assure that positions in the executive branch of the civil service are equally accessible to all qualified persons, and to eliminate the effects of past and present discrimination, intended or unintended, on the basis of protected group status, the commissioner shall adopt and periodically revise, if necessary, a statewide affirmative action program. The statewide affirmative action program must consist of at least the following:\n(1) objectives, goals, and policies;\n(2) procedures, standards, and assumptions to be used by agencies in the preparation of agency affirmative action plans, including methods by which goals and timetables are established;\n(3) the analysis of separation patterns to determine the impact on protected group members; and\n(4) requirements for annual objectives and submission of affirmative action progress reports from heads of agencies.\nAgency heads must report the data in clause (3) to the state Director of Recruitment, Retention and Affirmative Action and the state ADA coordinator, in addition to being available to anyone upon request. The commissioner must annually post the aggregate and agency-level reports under clause (4) on the agency's website.\n(b) The commissioner shall establish statewide affirmative action goals for each of the federal Equal Employment Opportunity (EEO) occupational categories applicable to state employment, using at least the following factors:\n(1) the percentage of members of each protected class in the recruiting area population who have the necessary skills; and\n(2) the availability for promotion or transfer of current employees who are members of protected classes.\n(c) The commissioner may use any of the following factors in addition to the factors required under paragraph (b):\n(1) the extent of unemployment of members of protected classes in the recruiting area population;\n(2) the existence of training programs in needed skill areas offered by employing agencies and other institutions; and\n(3) the expected number of available positions to be filled.\n(d) The commissioner shall designate a state director of diversity and equal employment opportunity who may be delegated the preparation, revision, implementation, and administration of the program. The commissioner of management and budget may place the director's position in the unclassified service if the position meets the criteria established in section 43A.08, subdivision 1a.\n(e) The commissioner shall designate a statewide ADA and disability employment director. The commissioner may delegate the preparation, revision, implementation, evaluation, and administration of the program to the director. The director must administer the 700-hour on-the-job demonstration experience under the supported work program and disabled veteran's employment programs. The ADA and disability employment director shall have education, knowledge, and skills in disability policy, employment, and the ADA. The commissioner may place the director's position in the unclassified service if the position meets the criteria established in section 43A.08, subdivision 1a.\n(f) Agency affirmative action plans, including reports and progress, must be posted on the agency's public and internal websites within 30 days of being approved. The commissioner of management and budget shall post a link to all executive branch agency-approved affirmative action plans on its public website. Accessible copies of the affirmative action plan must be available to all employees and members of the general public upon request.\n[Repealed, 1Sp1985 c 13 s 376]\nImplementation of the provisions of this section shall not be deemed a violation of other provisions of this chapter or chapter 363A.",
	"repealed": false
}