{
	"id": "360.0215",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.0215",
	"title": "360.0215 SERVICE OF PROCESS; LONG-ARM STATUTE; FEE.",
	"text": "The use and operation of an aircraft by a nonresident or the nonresident's agent in the state of Minnesota or by a resident owner or the resident owner's agent who has remained without the state continuously for 30 days prior to the commencement of an action against the nonresident or absentee owner, shall be deemed an appointment by such nonresident or absentee of the commissioner of transportation, to be the true and lawful attorney upon whom may be served all legal processes in any action or proceeding against the nonresident or absentee growing out of such use or operation of an aircraft in the state of Minnesota, resulting in damages or loss to person or property, and said use or operation shall be a signification of agreement that any such process in any action against the nonresident or absentee which is so served shall be of the same legal force and validity as if served upon the nonresident or absentee personally. Service of such process shall be made by serving a copy thereof upon the commissioner or by filing a copy in the commissioner's office, together with the payment of a fee of $2, and such service shall be sufficient service upon said nonresident or absentee; provided that notice of such service and a copy of the process are within ten days thereafter sent by mail by the plaintiff to the defendant at the defendant's last known address, and that the plaintiff's affidavit of compliance with the provisions of this section are attached to the summons.\nThe court in which the action is pending may order such continuance as may be necessary to afford the defendant reasonable opportunity to defend any such action, not exceeding 90 days from the day of the filing of the action in such court. The fee of $2 paid by the plaintiff to the commissioner at the time of service of such proceeding shall be taxed in the plaintiff's costs if the plaintiff prevails in the suit. The said commissioner shall keep a record of all such processes so served which shall show the day and hour of such service.",
	"repealed": false
}