{
	"id": "161.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.045",
	"title": "161.045 HIGHWAY USER TAX DISTRIBUTION FUND APPROPRIATIONS; TRUNK HIGHWAY FUND APPROPRIATIONS.",
	"text": "For purposes of this section, \"commissioner\" means any commissioner of a state agency that either proposes to spend or spends funds out of the highway user tax distribution fund or the trunk highway fund.\nA commissioner may expend highway user tax distribution funds only for highway purposes and may expend trunk highway funds only for trunk highway purposes.\n(a) A commissioner must not pay for any of the following with funds from the highway user tax distribution fund or the trunk highway fund:\n(1) Bureau of Criminal Apprehension laboratory;\n(2) Explore Minnesota Tourism kiosks;\n(3) Minnesota Safety Council;\n(4) driver education programs;\n(5) Office of Emergency Medical Services;\n(6) Mississippi River Parkway Commission;\n(7) payments to the Department of Information Technology Services in excess of actual costs incurred for trunk highway purposes;\n(8) personnel costs incurred on behalf of the governor's office;\n(9) the Office of Aeronautics within the Department of Transportation;\n(10) the Office of Transit and Active Transportation within the Department of Transportation;\n(11) the Office of Passenger Rail;\n(12) purchase and maintenance of soft body armor under section 299A.38;\n(13) tourist information centers;\n(14) parades, events, or sponsorships of events;\n(15) the installation, construction, expansion, or maintenance of public electric vehicle infrastructure;\n(16) the statewide notification center for excavation services pursuant to chapter 216D; and\n(17) manufacturing license plates.\n(b) The prohibition in paragraph (a) includes all expenses for the named entity or program, including but not limited to payroll, purchased services, supplies, repairs, and equipment. This prohibition on spending applies to any successor entities or programs that are substantially similar to the entity or program named in this subdivision.",
	"repealed": false
}