{
	"id": "136A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.08",
	"title": "136A.08 RECIPROCAL AGREEMENTS RELATING TO NONRESIDENT TUITION WITH OTHER STATES OR PROVINCES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Province\" and \"provincial\" mean the Canadian province of Manitoba.\n(c) \"Resident of this state\" means a resident student as defined in section 136A.101, subdivision 8.\nThe office, in consultation with the commissioner of management and budget and each affected public postsecondary board, may enter into agreements, on subjects that include remission of nonresident tuition for designated categories of students at public postsecondary institutions, with appropriate state or provincial agencies and public postsecondary institutions in other states or provinces. The agreements shall be for the purpose of the mutual improvement of educational advantages for residents of this state and other states or provinces with whom agreements are made.\nA higher education reciprocity agreement with the state of Wisconsin may include provision for the transfer of funds between Minnesota and Wisconsin. If this provision is included, the amount of funds to be transferred shall be determined according to a formula which is mutually acceptable to the office and a duly designated agency representing Wisconsin. The formula shall recognize differences in tuition rates between the two states and the number of students attending institutions in each state under the agreement. Any payments to Minnesota by Wisconsin shall be deposited by the office in the general fund of the state treasury. The amount required for the payments shall be certified by the commissioner of the office to the commissioner of management and budget annually.\nA reciprocity agreement with North Dakota may include provision for the transfer of funds between Minnesota and North Dakota. If provision for transfer of funds between the two states is included, the amount of funds to be transferred shall be determined according to a formula which is mutually acceptable to the office and a duly designated agency representing North Dakota. In adopting a formula, the office shall consider tuition rates in the two states and the number of students attending institutions in each state under the agreement. Any payment to Minnesota by North Dakota shall be deposited by the office in the general fund. The amount required for the payments shall be certified by the commissioner of the office to the commissioner of management and budget annually. All provisions in this subdivision pertaining to North Dakota shall also be applied to South Dakota, and all authority and conditions granted for higher education reciprocity with North Dakota are also granted for higher education reciprocity with South Dakota.\nThe office may enter into an agreement, with a state or province with which it has negotiated a reciprocity agreement for tuition, to permit students to receive student aid awards from the student's state or province of residence for attending an eligible institution in the other state or province.\nAn agreement made by the office under this section is not valid as to a particular institution without the approval of that institution's state or provincial governing board. A valid agreement under this subdivision that incurs additional financial liability to the state or to any of the Minnesota public postsecondary boards, beyond enrollment funding adjustments, must be submitted to the commissioner of management and budget and to the chairs of the higher education finance divisions of the senate and house of representatives for review. The agreement remains valid unless it is disapproved in law.\nThe office must annually, before the last day in January, submit a report to the committees in the house of representatives and the senate with responsibility for higher education finance on:\n(1) participation in the tuition reciprocity program by Minnesota students and students from other states attending Minnesota postsecondary institutions under a reciprocity agreement;\n(2) reciprocity and resident tuition rates at each institution;\n(3) interstate payments and obligations for each state participating in the tuition reciprocity program in the prior year; and\n(4) summary statistics on number of graduates by institution, degree granted, and year of graduation for reciprocity students who attended Minnesota postsecondary institutions.\n[Repealed, 2007 c 144 art 2 s 52]\nA student who does not meet the definition of resident after residing in Minnesota for 12 months may appeal to the commissioner by providing documentation on the student's reasons for residing in Minnesota. The commissioner may grant resident status for the purpose of this section to the student upon determining the documentation establishes that postsecondary education was not the student's principal reason for residing in Minnesota.",
	"repealed": false
}