{
	"id": "62Q.188",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.188",
	"title": "62Q.188 FLEXIBLE BENEFITS PLANS.",
	"text": "For the purposes of this section, the terms used in this section have the meanings defined in section 62Q.01, except that \"health plan\" includes individual coverage and group coverage for employer plans with up to 100 employees.\nNotwithstanding any provision of this chapter, chapter 363A, or any other law to the contrary, a health plan company may offer, sell, issue, and renew a health plan that is a flexible benefits plan under this section if the following requirements are satisfied:\n(1) the health plan must be offered in compliance with the laws of this state, except as otherwise permitted in this section;\n(2) the health plan must be designed to enable covered persons to better manage costs and coverage options through the use of co-pays, deductibles, and other cost-sharing arrangements;\n(3) the health plan may modify or exclude any or all coverages of benefits that would otherwise be required by law, except for maternity benefits and other benefits required under federal law;\n(4) each health plan and plan's premiums must be approved by the commissioner of health or commerce, whichever is appropriate under section 62Q.01, subdivision 2, but neither commissioner may disapprove a plan on the grounds of a modification or exclusion permitted under clause (3); and\n(5) prior to the sale of the health plan, the purchaser must be given a written list of the coverages otherwise required by law that are modified or excluded in the health plan. The list must include a description of each coverage in the list and indicate whether the coverage is modified or excluded. If coverage is modified, the list must describe the modification. The list may, but is not required to, also list any or all coverages otherwise required by law that are included in the health plan and indicate that they are included. The health plan company must require that a copy of this written list be provided, prior to the effective date of the health plan, to each enrollee or employee who is eligible for health coverage under the plan.\nAn employer may provide a health plan permitted under this section to its employees, the employees' dependents, and other persons eligible for coverage under the employer's plan, notwithstanding chapter 363A or any other law to the contrary.",
	"repealed": false
}