{
	"id": "628.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/628.41",
	"title": "628.41 GRAND JURIES; MEMBERS; QUORUM; COMPENSATION.",
	"text": "A grand jury is a body of persons returned at stated periods from the citizens of the county, or counties as provided in subdivision 2, before a court of competent jurisdiction, chosen by lot, and sworn to inquire as to public offenses committed or triable in the county or counties. It shall consist of not more than 23, nor less than 16, persons, and shall not proceed to any business unless at least 16 members are present.\nIf subject matter of the grand jury inquiry concerns activity, events, or other matters in more than one county, a grand jury may be selected, in reasonable proportion, from the counties in which the activity, events, or other matters occurred. A judge of the district court from any judicial district which includes one of the counties involved in an inquiry may convene a multicounty grand jury, without regard to judicial district boundaries, and may designate which county attorney or county attorneys shall attend upon the grand jury. The judge shall designate where a grand jury drawn from more than one county shall sit.\nAll indictments, reports or other returns returned by a grand jury drawn from more than one county shall be returned without any designation of venue. Thereupon, the judge ordering the impaneling of the grand jury shall designate the county of venue for purposes of trial.\nIf a grand jury drawn from more than one county was impaneled pursuant to the request of a county attorney, that county attorney shall prosecute indictments returned thereby, except that the county attorney of the county in which venue was designated pursuant to subdivision 3 may file a written request to prosecute with the judge impaneling the grand jury within 15 days, in which case the judge shall designate the prosecuting authority. In all other cases, the prosecuting authority shall be designated by the judge impaneling the grand jury.\nThe costs of a grand jury drawn from more than one county shall be apportioned between the counties from which the grand jury was drawn as may be ordered by the judge impaneling the grand jury.\nMembers of grand juries drawn from more than one county shall be compensated as provided in section 593.48. In addition, grand jurors residing more than 50 miles from the place where the grand jury sits shall be reimbursed for expenses actually incurred for meals and lodging, not to exceed $35 per day.",
	"repealed": false
}