{
	"id": "181.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.75",
	"title": "181.75 POLYGRAPH TESTS OF EMPLOYEES OR PROSPECTIVE EMPLOYEES PROHIBITED.",
	"text": "No employer or agent thereof shall directly or indirectly solicit or require a polygraph, voice stress analysis, or any test purporting to test the honesty of any employee or prospective employee. No person shall sell to or interpret for an employer or the employer's agent a test that the person knows has been solicited or required by an employer or agent to test the honesty of an employee or prospective employee. An employer or agent or any person knowingly selling, administering, or interpreting tests in violation of this section is guilty of a misdemeanor. If an employee requests a polygraph test any employer or agent administering the test shall inform the employee that taking the test is voluntary.\nThe Department of Labor and Industry shall investigate suspected violations of this section. The department may refer any evidence available concerning violations of this section to the county attorney of the appropriate county, who may with or without such reference, institute the appropriate criminal proceedings under this section.\nIn addition to the penalties provided by law for violation of this section, specifically and generally, whether or not injunctive relief is otherwise provided by law, the courts of this state are vested with jurisdiction to prevent and restrain violations of this section and to require the payment of civil penalties. Whenever it shall appear to the satisfaction of the attorney general that this section has been or is being violated, the attorney general shall be entitled, on behalf of the state, to sue for and have injunctive relief in any court of competent jurisdiction against any such violation or threatened violation without abridging other penalties provided by law.\nIn addition to the remedies otherwise provided by law, any person injured by a violation of this section may bring a civil action to recover any and all damages recoverable at law, together with costs and disbursements, including costs of investigation and reasonable attorney's fees, and receive other equitable relief as determined by the court. The court may, as appropriate, enter a consent judgment or decree without a finding of illegality.",
	"repealed": false
}