{
	"id": "347.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.54",
	"title": "347.54 CONFISCATION.",
	"text": "(a) The animal control authority having jurisdiction shall immediately seize any dangerous dog if:\n(1) after 14 days after the owner has notice that the dog is dangerous, the dog is not validly registered under section 347.51;\n(2) after 14 days after the owner has notice that the dog is dangerous, the owner does not secure the proper liability insurance or surety coverage as required under section 347.51, subdivision 2;\n(3) the dog is not maintained in the proper enclosure;\n(4) the dog is outside the proper enclosure and not under physical restraint of a responsible person as required under section 347.52; or\n(5) the dog is not sterilized within 30 days, pursuant to section 347.52, paragraph (d).\n(b) If an owner of a dog is convicted of a crime for which the dog was originally seized, the court may order that the dog be confiscated and destroyed in a proper and humane manner, and that the owner pay the costs incurred in confiscating, confining, and destroying the dog.\nA dangerous dog seized under subdivision 1 may be reclaimed by the owner of the dog upon payment of impounding and boarding fees, and presenting proof to the appropriate animal control authority that the requirements of sections 347.51 and 347.52 will be met. A dog not reclaimed under this subdivision within seven days may be disposed of in a manner permitted by law, and the owner is liable to the animal control authority for costs incurred in confining and disposing of the dog.\nIf a person has been convicted of a misdemeanor for violating a provision of section 347.51, 347.515, or 347.52, and the person is charged with a subsequent violation relating to the same dog, the dog must be seized by the animal control authority having jurisdiction. If the owner is convicted of the crime for which the dog was seized, the court shall order that the dog be destroyed in a proper and humane manner and the owner pay the cost of confining and destroying the animal. If the owner is not convicted and the dog is not reclaimed by the owner within seven days after the owner has been notified that the dog may be reclaimed, the dog may be disposed of in a manner permitted by law.",
	"repealed": false
}