{
	"id": "504B.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.211",
	"title": "504B.211 RESIDENTIAL TENANT'S RIGHT TO PRIVACY.",
	"text": "For purposes of this section, \"landlord\" has the meaning defined in section 504B.001, subdivision 7, and also includes the landlord's agent or other person acting under the landlord's direction and control.\nExcept as provided in subdivision 4, a landlord may enter the premises rented by a residential tenant only for a reasonable business purpose and after making a good faith effort to give the residential tenant reasonable notice under the circumstances of not less than 24 hours in advance of the intent to enter. A residential tenant may permit a landlord to enter the rented premises with less than 24 hours notice if desired. The notice must specify a time or anticipated window of time of entry and the landlord may only enter between the hours of 8:00 a.m. and 8:00 p.m. unless the landlord and tenant agree to an earlier or later time. A residential tenant may not waive and the landlord may not require the residential tenant to waive the residential tenant's right to prior notice of entry under this section as a condition of entering into or maintaining the lease.\nFor purposes of subdivision 2, a reasonable business purpose includes, but is not limited to:\n(1) showing the unit to prospective residential tenants during the notice period before the lease terminates or after the current residential tenant has given notice to move to the landlord or the landlord's agent;\n(2) showing the unit to a prospective buyer or to an insurance representative;\n(3) performing maintenance work;\n(4) allowing inspections by state, county, or city officials charged in the enforcement of health, housing, building, fire prevention, or housing maintenance codes;\n(5) the residential tenant is causing a disturbance within the unit;\n(6) the landlord has a reasonable belief that the residential tenant is violating the lease within the residential tenant's unit;\n(7) prearranged housekeeping work in senior housing where 80 percent or more of the residential tenants are age 55 or older;\n(8) the landlord has a reasonable belief that the unit is being occupied by an individual without a legal right to occupy it; or\n(9) the residential tenant has vacated the unit.\nNotwithstanding subdivision 2, a landlord may enter the premises rented by a residential tenant to inspect or take appropriate action without prior notice to the residential tenant if the landlord reasonably suspects that:\n(1) immediate entry is necessary to prevent injury to persons or property because of conditions relating to maintenance, building security, or law enforcement;\n(2) immediate entry is necessary to determine a residential tenant's safety; or\n(3) immediate entry is necessary in order to comply with local ordinances regarding unlawful activity occurring within the residential tenant's premises.\nIf the landlord enters when the residential tenant is not present and prior notice has not been given, the landlord shall disclose the entry by placing a written disclosure of the entry in a conspicuous place in the premises.\nIf a landlord violates this section, the residential tenant is entitled to a penalty which may include a rent reduction up to full rescission of the lease, recovery of any damage deposit less any amount retained under section 504B.178, and up to a $500 civil penalty for each violation and reasonable attorney fees. A residential tenant may follow the procedures in sections 504B.381, 504B.385, and 504B.395 to 504B.471 to enforce the provisions of this section. A violation of this section by the landlord is a violation of section 504B.161.\nThis section does not apply to residential tenants and landlords of manufactured home parks as defined in section 327C.015.",
	"repealed": false
}