{
	"id": "115B.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.50",
	"title": "115B.50 RESPONSE ACTIONS.",
	"text": "(a) In accordance with the priority list established under section 115B.17, subdivision 13, the commissioner shall take all response actions at or related to a dry cleaning facility that the commissioner determines are reasonable and necessary to protect the public health or welfare or the environment under the standards required in sections 115B.01 to 115B.20. The commissioner shall review and approve any investigation and response action plan submitted by an owner or operator of a dry cleaning facility who is taking response actions under subdivision 2 and shall oversee the implementation of the approved plans. In carrying out the duties under this subdivision, the commissioner may take emergency removal actions as provided in section 115B.17, subdivision 1, paragraph (b), and may exercise the authority provided in section 115B.17, subdivisions 2 to 5, 15, and 16.\n(b) The commissioner may not seek recovery against a current or former owner or operator of a dry cleaning facility of any environmental response costs in excess of $10,000 incurred by the commissioner at the facility, except:\n(1) to the extent of insurance coverage, in excess of $10,000, held by the owner or operator; or\n(2) as provided in section 115B.51.\nIf the commissioner seeks recovery of environmental response costs against an owner or operator pursuant to this paragraph, the owner or operator shall act as directed by the commissioner to assert any rights of the owner or operator to any insurance coverage applicable to those costs and, if coverage is denied, to assign those rights to the commissioner.\n(c) Before taking a response action under this subdivision, the commissioner shall notify the owner or operator of the facility. Except for emergency removal actions under section 115B.17, subdivision 1, paragraph (b), the commissioner shall not take response actions under this subdivision at a dry cleaning facility where an owner or operator of the facility is taking response actions under subdivision 2 in accordance with an investigation or response action plan approved by the commissioner.\n(a) At the request of the owner or operator of a dry cleaning facility who takes response actions at the facility in accordance with a response action plan approved by the commissioner, the commissioner shall reimburse the owner or operator for all but $10,000 of the environmental response costs incurred by the owner or operator if the commissioner determines that the costs are reasonable and were actually incurred. If a request for reimbursement is denied, the owner or operator may appeal the decision as a contested case under chapter 14.\n(b) If the commissioner reimburses an owner or operator for environmental response costs under this subdivision for which the owner or operator has insurance coverage, the commissioner is subrogated to the rights of the owner or operator with respect to that insurance coverage to the extent of the reimbursement. Acceptance of reimbursement under this subdivision constitutes an assignment by the owner or operator with respect to any insurance coverage applicable to the costs that are reimbursed.\nThe commissioner may not, in a single fiscal year, make expenditures from the account related to a single dry cleaning facility that exceed $100,000.\nThe commissioner may use the expedited rulemaking process under section 14.389 to adjust reimbursement dollar amounts contained in the rules established under subdivision 2.",
	"repealed": false
}