{
	"id": "245A.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.042",
	"title": "245A.042 HOME AND COMMUNITY-BASED SERVICES; ADDITIONAL STANDARDS AND PROCEDURES.",
	"text": "Residential and nonresidential programs for persons with disabilities or age 65 and older must obtain a license according to this chapter to provide home and community-based services defined in the federal waiver plans governed by United States Code, title 42, sections 1396 et seq., or the state's alternative care program according to section 256B.0913, and identified in section 245D.03, subdivision 1. As a condition of licensure, an applicant or license holder must demonstrate and maintain verification of compliance with:\n(1) licensing requirements under this chapter and chapter 245D;\n(2) applicable health care program requirements under Minnesota Rules, parts 9505.0170 to 9505.0475 and 9505.2160 to 9505.2245; and\n(3) provider standards and qualifications identified in the federal waiver plans or the alternative care program.\n(a) Applicants seeking chapter 245D licensure who meet the following criteria are subject to modified application procedures:\n(1) the applicant holds a chapter 245B license issued on or before December 31, 2012, at the time of application;\n(2) the applicant's chapter 245B license or licenses are in substantial compliance according to the licensing standards in this chapter and chapter 245B; and\n(3) the commissioner has conducted at least one on-site inspection of the chapter 245B license or licenses within the two-year period before submitting the chapter 245D license application.\nFor purposes of this subdivision, \"substantial compliance\" means the commissioner has not issued a sanction according to section 245A.07 against any chapter 245B license held by the applicant or made the chapter 245B license or licenses conditional according to section 245A.06 within the 12-month period before submitting the application for chapter 245D licensure.\n(b) The modified application procedures mean the commissioner must accept the applicant's attestation of compliance with certain requirements in lieu of providing information to the commissioner for evaluation that is otherwise required when seeking chapter 245D licensure.\n(a) The commissioner shall implement the responsibilities of this chapter according to the timelines in paragraphs (b) and (c) only within the limits of available appropriations or other administrative cost recovery methodology.\n(b) The licensure of home and community-based services according to this section shall be implemented January 1, 2014. License applications shall be received and processed on a phased-in schedule as determined by the commissioner beginning July 1, 2013. Licenses will be issued thereafter upon the commissioner's determination that the application is complete according to section 245A.04.\n(c) Within the limits of available appropriations or other administrative cost recovery methodology, implementation of compliance monitoring must be phased in after January 1, 2014.\n(1) Applicants who do not currently hold a license issued under chapter 245B must receive an initial compliance monitoring visit after 12 months of the effective date of the initial license for the purpose of providing technical assistance on how to achieve and maintain compliance with the applicable law or rules governing the provision of home and community-based services under chapter 245D. If during the review the commissioner finds that the license holder has failed to achieve compliance with an applicable law or rule and this failure does not imminently endanger the health, safety, or rights of the persons served by the program, the commissioner may issue a licensing review report with recommendations for achieving and maintaining compliance.\n(2) Applicants who do currently hold a license issued under this chapter must receive a compliance monitoring visit after 24 months of the effective date of the initial license.\n(d) Nothing in this subdivision shall be construed to limit the commissioner's authority to suspend or revoke a license or issue a fine at any time under section 245A.07, or issue correction orders and make a license conditional for failure to comply with applicable laws or rules under section 245A.06, based on the nature, chronicity, or severity of the violation of law or rule and the effect of the violation on the health, safety, or rights of persons served by the program.\n(e) License holders governed under chapter 245D must ensure compliance with the following requirements within the stated timelines:\n(1) service initiation and service planning requirements must be met at the next annual meeting of the person's support team or by January 1, 2015, whichever is later, for the following:\n(i) provision of a written notice that identifies the service recipient rights and an explanation of those rights as required under section 245D.04, subdivision 1;\n(ii) service planning for basic support services as required under section 245D.07, subdivision 2; and\n(iii) service planning for intensive support services under section 245D.071, subdivisions 3 and 4;\n(2) staff orientation to program requirements as required under section 245D.09, subdivision 4, for staff hired before January 1, 2014, must be met by January 1, 2015. The license holder may otherwise provide documentation verifying these requirements were met before January 1, 2014;\n(3) development of policy and procedures as required under section 245D.11, must be completed no later than August 31, 2014;\n(4) written or electronic notice and copies of policies and procedures must be provided to all persons or their legal representatives and case managers as required under section 245D.10, subdivision 4, paragraphs (b) and (c), by September 15, 2014, or within 30 days of development of the required policies and procedures, whichever is earlier; and\n(5) all employees must be informed of the revisions and training must be provided on implementation of the revised policies and procedures as required under section 245D.10, subdivision 4, paragraph (d), by September 15, 2014, or within 30 days of development of the required policies and procedures, whichever is earlier.\nThe commissioner shall consult with the existing stakeholder group established as part of the provider standards process to gather input related to the development of an administrative cost recovery methodology to implement the provisions in chapter 245D.",
	"repealed": false
}