{
	"id": "116.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.18",
	"title": "116.18 WATER POLLUTION CONTROL FUNDS; APPROPRIATIONS AND BONDS.",
	"text": "The sum of $167,000,000, or so much thereof as may be necessary, is appropriated from the bond proceeds fund in the state treasury to the Pollution Control Agency, for the period commencing on July 23, 1971, to be granted and disbursed to municipalities and agencies of the state in aid of the construction of projects conforming to section 116.16, in accordance with the rules, priorities, and criteria therein described.\n[Repealed, 1Sp1985 c 14 art 19 s 38]\nFor projects tendered, on or after October 1, 1987, a grant of federal money under section 201(g), section 202, 203, or 206(f) of the Federal Water Pollution Control Act, as amended, United States Code, title 33, sections 1251 to 1376, at 55 percent or more of the eligible cost for construction of the treatment works, state money appropriated under subdivision 1 must be expended for 50 percent of the nonfederal share of the eligible cost of construction for municipalities with populations of 25,000 or less.\n[Repealed, 1973 c 423 s 10]\n(a) The Public Facilities Authority must adopt the objective of maintaining financial assistance to municipalities that the agency has listed on its annual municipal project list of approximately 50 percent of the eligible cost of construction for municipalities with populations over 25,000 and 80 percent of the eligible cost for municipalities with populations of 25,000 or less. Financial assistance may be provided by the Public Facilities Authority through a combination of low interest loans under the state revolving fund under chapter 446A, independent state grants, and other financial assistance available to the municipality. The Public Facilities Authority may award independent grants for projects certified by the state pollution control commissioner for 35 percent or, if the population of the municipality is 25,000 or less, 65 percent of the eligible cost of construction. These grants may be awarded in separate steps for planning and design in addition to actual construction. Not more than $2,000,000 of the total amount of grants awarded under this subdivision in any single fiscal year may be awarded to a single grantee.\n(b) Up to $1,000,000 of the money to be awarded as grants under this subdivision in any single fiscal year shall be set aside for municipalities having substantial economic development projects that cannot come to fruition without municipal wastewater treatment improvements. The agency shall forward its municipal needs list to the authority at the beginning of each fiscal year, and the authority shall review the list and identify those municipalities having substantial economic development projects. After the available money is allocated to municipalities in accordance with agency priorities, the set-aside shall be used by the authority to award grants to remaining municipalities that have been identified.\n(c) Grants may also be awarded under this subdivision to reimburse municipalities willing to proceed with projects and be reimbursed in a subsequent year at the grant percentage determined in paragraph (a).\n(d) Municipalities that entered into an intent to award agreement with the agency under paragraph (c), in the state fiscal years 1985 to 1988, will be reimbursed at 55 percent or, if the population of the municipality is 25,000 or less, 85 percent of the eligible cost of construction.\n(a) The definitions of \"capital cost component,\" \"capital cost component grant,\" \"service fee,\" \"service contract,\" and \"private vendor\" in Minnesota Statutes 2012, section 471A.02, apply to this subdivision.\n(b) Beginning in fiscal year 1989, up to $1,500,000 of the money to be awarded as grants under subdivision 3a in any single fiscal year may be set aside for the award of capital cost component grants to municipalities on the municipal needs list for part of the capital cost component of the service fee under a service contract for a term of at least 20 years with a private vendor for the purpose of constructing and operating wastewater treatment facilities.\n(c) The amount granted to a municipality shall be 50 percent of the average total eligible costs of municipalities of similar size recently awarded state and federal grants under the provisions of subdivisions 2a and 3a and the Federal Water Pollution Control Act, United States Code, title 33, sections 1281 to 1299. Federal and state eligibility requirements for determining the amount of grant dollars to be awarded to a municipality are not applicable to municipalities awarded capital cost component grants. Federal and state eligibility requirements for determining which cities qualify for state and federal grants are applicable, except as provided in this subdivision.\n(d) Except as provided in this subdivision, municipalities receiving capital cost component grants shall not be required to comply with federal and state regulations regarding facilities planning and procurement contained in sections 116.16 to 116.18, except those necessary to issue a national pollutant discharge elimination system permit or state disposal system permit and those necessary to assure that the proposed facilities are reasonably capable of meeting the conditions of the permit over 20 years. The municipality and the private vendor shall be parties to the permit. Municipalities receiving capital cost component grants may also be exempted by rules of the agency from other state and federal regulations relating to the award of state and federal grants for wastewater treatment facilities, except those necessary to protect the state from fraud or misuse of state funds.\n(e) Funds shall be distributed from the set-aside to municipalities that apply for the funds in accordance with these provisions in the order of their ranking on the municipal needs list.\n(f) The authority shall award capital cost component grants to municipalities selected by the state pollution control commissioner upon certification by the state pollution control commissioner that the municipalities' projects and applications have been reviewed and approved in accordance with this subdivision and agency rules adopted under paragraph (g).\n(g) The agency shall adopt permanent rules to provide for the administration of grants awarded under this subdivision.\n(h) The commissioner of employment and economic development may adopt rules containing procedures for administration of the authority's duties as set forth in paragraph (f).\n(a) Beginning in fiscal year 1989, up to ten percent of the money to be awarded as grants under subdivision 3a in any single fiscal year, up to a maximum of $1,000,000, may be set aside for the award of grants by the agency to municipalities to reimburse owners of individual on-site wastewater treatment systems or alternative discharging sewage systems for a part of the costs of upgrading or replacing the systems.\n(b) An individual on-site treatment system is a wastewater treatment system, or part thereof, that uses soil treatment and disposal technology to treat 5,000 gallons or less of wastewater per day from dwellings or other establishments.\n(c) An alternative discharging sewage system is a system permitted under section 115.58 that:\n(1) serves one or more dwellings and other establishments;\n(2) discharges less than 10,000 gallons of water per day; and\n(3) uses any treatment and disposal methods other than subsurface soil treatment and disposal.\n(d) Municipalities may apply yearly for grants of up to 50 percent of the cost of replacing or upgrading individual on-site treatment systems, including conversion to an alternative discharging sewage system, within their jurisdiction, up to a limit of $5,000 per system or per connection to a cluster system. Before agency approval of the grant application, a municipality must certify that:\n(1) it has adopted and is enforcing the requirements of Minnesota Rules governing subsurface sewage treatment systems;\n(2) the existing systems for which application is made do not conform to those rules, are at least 20 years old, do not serve seasonal residences, and were not constructed with state or federal funds; and\n(3) the costs requested do not include administrative costs, costs for improvements or replacements made before the application is submitted to the agency unless it pertains to the plan finally adopted, and planning and engineering costs other than those for the individual site evaluations and system design.\n(e) The federal and state regulations regarding the award of state and federal wastewater treatment grants do not apply to municipalities or systems funded under this subdivision, except as provided in this subdivision.\n(f) The agency shall adopt permanent rules regarding priorities, distribution of funds, payments, inspections, procedures for administration of the agency's duties, and other matters that the agency finds necessary for proper administration of grants awarded under this subdivision.\nA municipality with a population of 25,000 or less that was tendered a state matching grant under subdivision 2a, or a state independent grant under subdivision 3a, or a federal grant under the Federal Water Pollution Control Act, United States Code, title 33, sections 1281 to 1299, from October 1, 1984, through September 30, 1987, shall, after the municipality has awarded bids for construction of the treatment works, and upon request, receive a grant increase of 2.5 percent of the total eligible costs of construction, up to the maximum entitlement for grants awarded on or after October 1, 1987, under subdivisions 2a and 3a. The municipality must inform other entities that are providing funding for construction of the treatment works of the grant increase, and repay any funds to which it is not entitled. A municipality must not receive funding for more than 100 percent of the total costs of the treatment works. Documentation of money received from other sources must be submitted with the request for the grant increase. Money remaining after all grants have been awarded under this subdivision may be used for the award of grants under subdivisions 2a and 3a. An adjustment grant awarded after July 1, 1989, that is a continuation of a previously awarded adjustment grant must be awarded through a letter from the agency to the municipality stating the grant amount. A formal grant agreement is not required.\nFor the purpose of providing money appropriated in subdivision 1 for grants to municipalities and agencies of the state for the acquisition and betterment of public land, buildings, and improvements of a capital nature needed for the prevention, control, and abatement of water pollution, the commissioner of management and budget is authorized upon request of the Pollution Control Agency to sell and issue Minnesota state water pollution control bonds in the amount of $156,000,000, in the manner and upon the conditions prescribed in section 116.17 and in the constitution, article XI, sections 4 to 7. The proceeds of the bonds, except as provided in section 116.17, subdivision 5, are appropriated and shall be credited to a Minnesota state water pollution control account in the bond proceeds fund. The amount of bonds issued pursuant to this authorization shall not exceed at any time the amount needed to produce a balance in the water pollution control account equal to the aggregate amount of grants then approved and not previously disbursed, plus the amount of grants to be approved in the current and the following fiscal year, as estimated by the Pollution Control Agency.\nAll federal and other funds made available for any purpose of the water pollution control program are also appropriated for the program.\nNone of the appropriations made in this section shall lapse until the purpose for which it is made has been accomplished or abandoned. The amount of each grant approved for the water pollution control program shall be and remain appropriated for that purpose until the grant is fully disbursed or part or all thereof is revoked by the Pollution Control Agency.",
	"repealed": false
}