{
	"id": "65B.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.49",
	"title": "65B.49 INSURERS.",
	"text": "On and after January 1, 1975, no insurance policy providing benefits for injuries arising out of the maintenance or use of a motor vehicle shall be issued, renewed, continued, delivered, issued for delivery, or executed in this state with respect to any motor vehicle registered or principally garaged in this state unless coverage is provided therein or supplemental thereto, under provisions approved by the commissioner, requiring the insurer to pay, regardless of the fault of the insured, basic economic loss benefits.\nA plan of reparation security shall state the name and address of the named insured, the coverage afforded by the policy, the premium charged, the term and limits of liability, and shall contain an agreement or endorsement that insurance is provided thereunder in accordance with and subject to the provisions of sections 65B.41 to 65B.71.\nEach plan of reparation security shall provide for payment of basic economic loss benefits.\n(1) Each plan of reparation security shall also contain stated limits of liability, exclusive of interest and costs, with respect to each vehicle for which coverage is thereby granted, of not less than $30,000 because of bodily injury to one person in any one accident and, subject to said limit for one person, of not less than $60,000 because of injury to two or more persons in any one accident, and, if the accident has resulted in injury to or destruction of property, of not less than $10,000 because of such injury to or destruction of property of others in any one accident.\n(2) Under residual liability insurance the reparation obligor shall be liable to pay, on behalf of the insured, sums which the insured is legally obligated to pay as damages because of bodily injury and property damage arising out of the ownership, maintenance or use of any motor vehicle, including a motor vehicle permissively operated by an insured as that term is defined in section 65B.43, subdivision 5, if the injury or damage occurs within this state, the United States of America, its territories or possessions, or Canada. A reparation obligor shall also be liable to pay sums which another reparation obligor is entitled to recover under the indemnity provisions of section 65B.53, subdivision 1.\n(3) Every plan of reparation security shall be subject to the following provisions which need not be contained therein:\n(a) The liability of the reparation obligor with respect to the residual liability coverage required by this clause shall become absolute whenever injury or damage occurs; such liability may not be canceled or annulled by any agreement between the reparation obligor and the insured after the occurrence of the injury or damage; no statement made by the insured or on the insured's behalf and no violation of said policy shall defeat or void said policy.\n(b) The satisfaction by the insured of a judgment for such injury or damage shall not be a condition precedent to the right or duty of the reparation obligor to make payment on account of such injury or damage.\n(c) The reparation obligor shall have the right to settle any claim covered by the residual liability insurance policy, and if such settlement is made in good faith, the amount thereof shall be deductible from the limits of liability for the accident out of which such claim arose.\n(d) Except as provided in subdivision 5a, a residual liability insurance policy shall be excess of a nonowned vehicle policy whether the nonowned vehicle is borrowed or rented, or used for business or pleasure. A nonowned vehicle is one not used or provided on a regular basis.\n(1) No plan of reparation security may be renewed, delivered or issued for delivery, or executed in this state with respect to any motor vehicle registered or principally garaged in this state unless separate uninsured and underinsured motorist coverages are provided therein. Each coverage, at a minimum, must provide limits of $25,000 because of injury to or the death of one person in any accident and $50,000 because of injury to or the death of two or more persons in any accident. In the case of injury to, or the death of, two or more persons in any accident, the amount available to any one person must not exceed the coverage limit provided for injury to, or the death of, one person in any accident.\n(2) Every owner of a motor vehicle registered or principally garaged in this state shall maintain uninsured and underinsured motorist coverages as provided in this subdivision.\n(3) No reparation obligor is required to provide limits of uninsured and underinsured motorist coverages in excess of the bodily injury liability limit provided by the applicable plan of reparation security.\n(4) No recovery shall be permitted under the uninsured and underinsured motorist coverages of this section for basic economic loss benefits paid or payable, or which would be payable but for any applicable deductible.\n(5) If at the time of the accident the injured person is occupying a motor vehicle, the limit of liability for uninsured and underinsured motorist coverages available to the injured person is the limit specified for that motor vehicle. However, if the injured person is occupying a motor vehicle of which the injured person is not an insured, the injured person may be entitled to excess insurance protection afforded by a policy in which the injured party is otherwise insured. The excess insurance protection is limited to the extent of covered damages sustained, and further is available only to the extent by which the limit of liability for like coverage applicable to any one motor vehicle listed on the automobile insurance policy of which the injured person is an insured exceeds the limit of liability of the coverage available to the injured person from the occupied motor vehicle.\nIf at the time of the accident the injured person is not occupying a motor vehicle or motorcycle, the injured person is entitled to select any one limit of liability for any one vehicle afforded by a policy under which the injured person is insured.\n(6) Regardless of the number of policies involved, vehicles involved, persons covered, claims made, vehicles or premiums shown on the policy, or premiums paid, in no event shall the limit of liability for uninsured and underinsured motorist coverages for two or more motor vehicles be added together to determine the limit of insurance coverage available to an injured person for any one accident.\n(7) The uninsured and underinsured motorist coverages required by this subdivision do not apply to bodily injury of the insured while occupying a motor vehicle owned by the insured, unless the occupied vehicle is an insured motor vehicle.\n(8) The uninsured and underinsured motorist coverages required by this subdivision do not apply to bodily injury of the insured while occupying a motorcycle owned by the insured.\n[Repealed, 1Sp1985 c 10 s 123 subd 5]\nWith respect to underinsured motorist coverage, the maximum liability of an insurer is the amount of damages sustained but not recovered from the insurance policy of the driver or owner of any underinsured at fault vehicle. If a person is injured by two or more vehicles, underinsured motorist coverage is payable whenever any one of those vehicles meets the definition of underinsured motor vehicle in section 65B.43, subdivision 17. However, in no event shall the underinsured motorist carrier have to pay more than the amount of its underinsured motorist limits.\n[Repealed, 1980 c 539 s 7]\n(a) Every plan of reparation security, wherever issued, insuring a natural person as named insured, covering private passenger vehicles as defined under section 65B.001, subdivision 3, and pickup trucks and vans as defined under section 168.002 must: (1) provide that all of the obligation for damage and loss of use to a rented private passenger vehicle, including pickup trucks and vans as defined under section 168.002, and rented trucks with a registered gross vehicle weight of 26,000 pounds or less would be covered by the property damage liability portion of the plan; and (2) extend the plan's basic economic loss benefits, residual liability insurance, and uninsured and underinsured motorist coverages to the operation or use of the rented motor vehicle. This subdivision does not apply to plans of reparation security covering only motor vehicles registered under section 168.10, subdivision 1a, 1b, 1c, or 1d, or recreational vehicles as defined under section 168.002. The obligation of the plan must not be contingent on fault or negligence. In all cases where the plan's property damage liability coverage is less than $35,000, the coverage available under the subdivision must be $35,000. Other than as described in this paragraph; paragraph (i), clause (2); or paragraph (j), nothing in this section amends or alters the provisions of the plan of reparation security as to primacy of the coverages in this section.\n(b) A vehicle is rented for purposes of this subdivision:\n(1) if the rate for the use of the vehicle is determined on a monthly, weekly, or daily basis; or\n(2) during the time that a vehicle is loaned as a replacement for a vehicle being serviced or repaired regardless of whether the customer is charged a fee for the use of the vehicle.\nA vehicle is not rented for the purposes of this subdivision if the rate for the vehicle's use is determined on a period longer than one month or if the term of the rental agreement is longer than one month. A vehicle is not rented for purposes of this subdivision if the rental agreement has a purchase or buyout option or otherwise functions as a substitute for purchase of the vehicle.\n(c) The policy or certificate issued by the plan must inform the insured of the application of the plan to private passenger rental vehicles, including pickup trucks and vans as defined under section 168.002, and that the insured may not need to purchase additional coverage from the rental company.\n(d) Where an insured has two or more vehicles covered by a plan or plans of reparation security containing the rented motor vehicle coverage required under paragraph (a), the insured may select the plan the insured wishes to collect from and that plan is entitled to a pro rata contribution from the other plan or plans based upon the property damage limits of liability. If the person renting the motor vehicle is also covered by the person's employer's insurance policy or the employer's automobile self-insurance plan, the reparation obligor under the employer's policy or self-insurance plan has primary responsibility to pay claims arising from use of the rented vehicle.\n(e) A notice advising the insured of rental vehicle coverage must be given by the reparation obligor to each current insured with the first renewal notice after January 1, 1989. The notice must be approved by the commissioner of commerce. The commissioner may specify the form of the notice.\n(f) When a motor vehicle is rented in this state, there must be attached to the rental contract a separate form containing a written notice in at least 10-point bold type, if printed, or in capital letters, if typewritten, which states:\n\"Under Minnesota law, a personal automobile insurance policy must: (1) cover the rental of this motor vehicle against damage to the vehicle and against loss of use of the vehicle; and (2) extend the policy's basic economic loss benefits, residual liability insurance, and uninsured and underinsured motorist coverages to the operation or use of a rented motor vehicle. Therefore, purchase of any collision damage waiver or similar insurance affected in this rental contract is not necessary. In addition, purchase of any additional liability insurance is not necessary if your policy was issued in Minnesota unless you wish to have coverage for liability that exceeds the amount specified in your personal automobile insurance policy.\"\nNo collision damage waiver or other insurance offered as part of or in conjunction with a rental of a motor vehicle may be sold unless the person renting the vehicle provides a written acknowledgment that the above consumer protection notice has been read and understood.\n(g) When damage to a rented vehicle is covered by a plan of reparation security as provided under paragraph (a), the rental contract must state that payment by the reparation obligor within the time limits of section 72A.201 is acceptable, and prior payment by the renter is not required.\n(h) Compensation for the loss of use of a damaged rented motor vehicle is limited to a period no longer than 14 days.\n(i)(1) For purposes of this subdivision, \"rented motor vehicle\" means a rented vehicle described in paragraph (a), using the definition of \"rented\" provided in paragraph (b).\n(2) Notwithstanding section 169.09, subdivision 5a, an owner of a rented motor vehicle is not vicariously liable for legal damages resulting from the operation of the rented motor vehicle in an amount greater than $100,000 because of bodily injury to one person in any one accident and, subject to the limit for one person, $300,000 because of injury to two or more persons in any one accident, and $50,000 because of injury to or destruction of property of others in any one accident, if the owner of the rented motor vehicle has in effect, at the time of the accident, a policy of insurance or self-insurance, as provided in section 65B.48, subdivision 3, covering losses up to at least the amounts set forth in this paragraph. Nothing in this paragraph alters or affects the obligations of an owner of a rented motor vehicle to comply with the requirements of compulsory insurance through a policy of insurance as provided in section 65B.48, subdivision 2, or through self-insurance as provided in section 65B.48, subdivision 3, which policy of insurance or self-insurance must apply whenever the operator is not covered by a plan of reparation security as provided under paragraph (a); or with the obligations arising from section 72A.125 for products sold in conjunction with the rental of a motor vehicle. Nothing in this paragraph alters or affects liability, other than vicarious liability, of an owner of a rented motor vehicle.\n(3) The dollar amounts stated in this paragraph shall be adjusted for inflation based upon the Consumer Price Index for all urban consumers, known as the CPI-U, published by the United States Bureau of Labor Statistics. The dollar amounts stated in this paragraph are based upon the value of that index for July 1995, which is the reference base index for purposes of this paragraph. The dollar amounts in this paragraph shall change effective January 1 of each odd-numbered year based upon the percentage difference between the index for July of the preceding year and the reference base index, calculated to the nearest whole percentage point. The commissioner shall announce and publish, on or before September 30 of the preceding year, the changes in the dollar amounts required by this paragraph to take effect on January 1 of each odd-numbered year. The commissioner shall use the most recent revision of the July index available as of September 1. Changes in the dollar amounts must be in increments of $5,000, and no change shall be made in a dollar amount until the change in the index requires at least a $5,000 change. If the United States Bureau of Labor Statistics changes the base year upon which the CPI-U is based, the commissioner shall make the calculations necessary to convert from the old base year to the new base year. If the CPI-U is discontinued, the commissioner shall use the available index that is most similar to the CPI-U.\n(j) The plan of reparation security covering the owner of a rented motor vehicle is excess of any residual liability coverage insuring an operator of a rented motor vehicle.\n[See Note.]\n[Repealed, 1980 c 539 s 7]\nNothing in sections 65B.41 to 65B.71 shall be construed as preventing the insurer from offering other benefits or coverages in addition to those required to be offered under this section.\nAny coverage issued by a participating member of the Minnesota automobile insurance plan shall comply with the provisions of this section, any provisions of law or of the contract notwithstanding.\nNo plan of reparation security shall exclude coverage for a vehicle when used to transport children as part of a family or group family day care program.\n(a) Unless expressly provided for in this chapter, a plan of reparation security must conform to the six-year time limitation provided under section 541.05, subdivision 1, clause (1).\n(b) The time limitation for commencing a cause of action relating to underinsured motorist coverage under subdivision 3a is four years from the date of accrual.",
	"repealed": false
}