{
	"id": "62J.496",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.496",
	"title": "62J.496 ELECTRONIC HEALTH RECORD SYSTEM REVOLVING ACCOUNT AND LOAN PROGRAM.",
	"text": "(a) An account is established to:\n(1) finance the purchase of certified electronic health records or qualified electronic health records as defined in section 62J.495, subdivision 1a;\n(2) enhance the utilization of electronic health record technology, which may include costs associated with upgrading the technology to meet the criteria necessary to be a certified electronic health record or a qualified electronic health record;\n(3) train personnel in the use of electronic health record technology; and\n(4) improve the secure electronic exchange of health information.\n(b) Amounts deposited in the account, including any grant funds obtained through federal or other sources, loan repayments, and interest earned on the amounts shall be used only for awarding loans or loan guarantees, as a source of reserve and security for leveraged loans, for activities authorized in section 62J.495, subdivision 4, or for the administration of the account.\n(c) The commissioner may accept contributions to the account from private sector entities subject to the following provisions:\n(1) the contributing entity may not specify the recipient or recipients of any loan issued under this subdivision;\n(2) the commissioner shall make public the identity of any private contributor to the loan fund, as well as the amount of the contribution provided;\n(3) the commissioner may issue letters of commendation or make other awards that have no financial value to any such entity; and\n(4) a contributing entity may not specify that the recipient or recipients of any loan use specific products or services, nor may the contributing entity imply that a contribution is an endorsement of any specific product or service.\n(d) The commissioner may use the loan funds to reimburse private sector entities for any contribution made to the loan fund. Reimbursement to private entities may not exceed the principle amount contributed to the loan fund.\n(e) The commissioner may use funds deposited in the account to guarantee, or purchase insurance for, a local obligation if the guarantee or purchase would improve credit market access or reduce the interest rate applicable to the obligation involved.\n(f) The commissioner may use funds deposited in the account as a source of revenue or security for the payment of principal and interest on revenue or general obligation bonds issued by the state if the proceeds of the sale of the bonds will be deposited into the loan fund.\n(g) The commissioner shall not award new loans or loan guarantees after July 1, 2016.\n(a) \"Eligible borrower\" means one of the following:\n(1) federally qualified health centers;\n(2) community clinics, as defined under section 145.9268;\n(3) nonprofit or local unit of government hospitals licensed under sections 144.50 to 144.56;\n(4) individual or small group physician practices that are focused primarily on primary care;\n(5) nursing facilities licensed under sections 144A.01 to 144A.27;\n(6) local public health departments as defined in chapter 145A; and\n(7) other providers of health or health care services approved by the commissioner for which interoperable electronic health record capability would improve quality of care, patient safety, or community health.\n(b) The commissioner shall administer the loan fund to prioritize support and assistance to:\n(1) critical access hospitals;\n(2) federally qualified health centers;\n(3) entities that serve uninsured, underinsured, and medically underserved individuals, regardless of whether such area is urban or rural;\n(4) individual or small group practices that are primarily focused on primary care;\n(5) nursing facilities certified to participate in the medical assistance program; and\n(6) providers enrolled in the elderly waiver program of customized living or 24-hour customized living of the medical assistance program, if at least half of their annual operating revenue is paid under the medical assistance program.\n(c) An eligible applicant must submit a loan application to the commissioner of health on forms prescribed by the commissioner. The application must include, at a minimum:\n(1) the amount of the loan requested and a description of the purpose or project for which the loan proceeds will be used;\n(2) a quote from a vendor;\n(3) a description of the health care entities and other groups participating in the project;\n(4) evidence of financial stability and a demonstrated ability to repay the loan;\n(5) a description of how the system to be financed interoperates or plans in the future to interoperate with other health care entities and provider groups located in the same geographical area;\n(6) a plan on how the certified electronic health record technology will be maintained and supported over time; and\n(7) any other requirements for applications included or developed pursuant to section 3014 of the HITECH Act.\n(a) The commissioner of health may make a no-interest loan or low-interest loan to a provider or provider group who is eligible under subdivision 2 consistent with the priorities established in subdivision 2. The total accumulative loan principal must not exceed $3,000,000 per loan. The interest rate for each loan, if imposed, shall not exceed the current market interest rate. The commissioner of health has discretion over the size, interest rate, and number of loans made. Nothing in this section shall require the commissioner to make a loan to an eligible borrower under subdivision 2.\n(b) The commissioner of health may prescribe forms and establish an application process and, notwithstanding section 16A.1283, may impose a reasonable nonrefundable application fee to cover the cost of administering the loan program. Any application fees imposed and collected under the electronic health records system revolving account and loan program in this section are appropriated to the commissioner of health for the duration of the loan program. The commissioner may apply for and use all federal funds available through the HITECH Act to administer the loan program.\n(c) For loans approved prior to July 1, 2009, the borrower must begin repaying the principal no later than two years from the date of the loan. Loans must be amortized no later than six years from the date of the loan.\n(d) For loans granted on January 1, 2010, or thereafter, the borrower must begin repaying the principal no later than one year from the date of the loan. Loans must be amortized no later than six years after the date of the loan.\n(e) All repayments and interest paid on each loan must be credited to the account.\n(f) The loan agreement shall include the assurance that the borrower meets the requirements included or developed pursuant to section 3014 of the HITECH Act. The requirements shall include, but are not limited to:\n(1) submitting reports on quality measures in compliance with regulations adopted by the federal government;\n(2) demonstrating that any certified electronic health record technology purchased, improved, or otherwise financially supported by this loan program is used to exchange health information in a manner that, in accordance with law and standards applicable to the exchange of information, improves the quality of health care;\n(3) including a plan on how the borrower intends to maintain and support the certified electronic health record technology over time and the resources expected to be used to maintain and support the technology purchased with the loan; and\n(4) complying with other requirements the secretary may require to use loans funds under the HITECH Act.\nData collected by the commissioner of health on the application to determine eligibility under subdivision 2 and to monitor borrowers' default risk or collect payments owed under subdivision 3 are (1) private data on individuals as defined in section 13.02, subdivision 12; and (2) nonpublic data as defined in section 13.02, subdivision 9. The names of borrowers and the amounts of the loans granted are public data.",
	"repealed": false
}