{
	"id": "160.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.84",
	"title": "160.84 DEFINITIONS.",
	"text": "The terms used in sections 160.84 to 160.98 have the meanings given them in this section and section 160.02.\n\"BOT facility\" means a build-operate-transfer toll facility developed, financed, designed, constructed, improved, rehabilitated, and operated by a private operator who holds title to the facility subject to a development agreement providing that title will be transferred to the road authority on expiration of an agreed term.\n\"BTO facility\" means a build-transfer-operate toll facility developed, financed, designed, constructed, improved, or rehabilitated by a private operator who: (1) transfers any interest it may have in the toll facility to the road authority before operation begins; and (2) operates the toll facility for an agreed term under a lease, management, or toll concession agreement.\n\"Commissioner\" means the commissioner of the Minnesota Department of Transportation.\n\"Development agreement\" means a written agreement between a road authority and a private operator that provides for the development, financing, design, construction, improvement, rehabilitation, ownership, and operation of a toll facility.\n\"Metropolitan area\" has the meaning given it in section 473.121, subdivision 2.\n\"Private operator\" means an individual, corporation, partnership, cooperative or unincorporated association, joint venture, or consortium that develops, finances, designs, constructs, improves, rehabilitates, owns, or operates a toll facility subject to sections 160.84 to 160.92.\n\"Road authority\" has the meaning given it in section 160.02, subdivision 25, and also refers to a joint powers authority formed under section 160.91.\n\"Toll facility\" means a bridge, causeway, or tunnel, and its approaches; a road, street, or highway; an appurtenant building, structure, or other improvement; land lying within applicable rights-of-way; and other appurtenant rights or hereditaments that together comprise a project for which a road authority or private operator is authorized to develop, finance, design, operate, and impose tolls under sections 160.84 to 160.92.",
	"repealed": false
}