{
	"id": "473.606",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.606",
	"title": "473.606 OFFICERS.",
	"text": "The corporation shall elect from its membership a vice-chair and shall elect a secretary and a treasurer, who may or may not be one of the commissioners. The vice-chair, the secretary, and the treasurer shall hold office at the pleasure of the corporation, and the secretary and the treasurer, if not a commissioner, shall receive compensation as determined by the corporation.\nThe chair, vice-chair, and secretary shall have such powers and perform such duties as may be given or imposed upon them by sections 473.601 to 473.679, or by the bylaws of the corporation.\nThe treasurer shall receive and be responsible for all moneys of the corporation, from whatever source derived, and the same shall be considered public funds. The treasurer shall disburse the moneys of the corporation only on orders made by the executive and operating officer, herein provided for, countersigned by such other officer or such employee of the corporation as may be authorized and directed so to do by the corporation, showing the name of the claimant and the nature of the claim. No disbursement shall be certified by such officers until the same have been approved by said commissioners at a meeting thereof. Whenever the executive director of the corporation shall certify, pursuant to action taken by the commissioners at a meeting thereof, that there are moneys and the amount thereof in the possession of the treasurer not currently needed, then the treasurer may invest said amount or any part thereof in securities approved for investment under section 118A.04.\nWhenever it shall appear to the commissioners that any invested funds are needed for current purposes before the maturity dates of the securities held, they shall cause the executive director to so certify to the treasurer and it shall then be the duty of the treasurer to order the sale or conversion into cash of the securities in the amount so certified. All interest and profit on said investments shall be credited to and constitute a part of the funds of the commission. The treasurer shall keep an account of all moneys received and disbursed, and at least once a year, at times to be designated by the corporation, file with the secretary a financial statement of the corporation, showing in appropriate and identifiable groupings the receipts and disbursements since the last approved statements; moneys on hand and the purposes for which the same are appropriated; and shall keep an account of all securities purchased as herein provided, the funds from which purchased and the interest and profit which may have accrued thereon, and shall accompany the financial statement aforesaid with a statement setting forth such account. The corporation may pay to the treasurer from time to time compensation in such amount as it may determine to cover clerk hire to enable the treasurer to carry out duties and those required in connection with bonds issued by the corporation as authorized under sections 473.601 to 473.679.\nThe corporation shall appoint an executive director, who shall be the executive and operating officer of the corporation, shall serve at the pleasure of the corporation, and shall receive compensation as determined by it. The director shall have had experience as a business executive, preferably in connection with aviation and in the promotion of business enterprises. Under the supervision of the corporation, the director shall be responsible for the operation, management, and promotion of all activities with which the corporation is charged, together with other duties prescribed by the corporation. The director shall have the powers necessarily incident to the performance of duties and those other powers granted by the corporation, but shall not have authority to incur liability or make expenditures on behalf of the corporation without general or specific directions by the corporation, as shown by the bylaws or minutes of a meeting thereof.\nThe corporation shall have the power to appoint engineers and other consultants, attorneys, and such other officers, agents, and employees as it may see fit, who shall perform such duties and receive such compensation as the corporation may determine and be removable at the pleasure of the corporation. The corporation must adopt an affirmative action plan, which shall be submitted to the appropriate agency or office of the state for review and approval. The plan must include a yearly progress report to the agency or office. Whenever the corporation performs any work within the limits of a city of the first class, or establishes a minimum wage for skilled or unskilled labor in the specifications or any contract for work within one of the cities, the rate of pay to such skilled and unskilled labor must be the prevailing rate of wage for such labor in that city.\nThe corporation may indemnify any commissioner, officer, or employee for loss or expense arising or resulting from any claim made because of bodily injury, death or property damage sustained by reason of performance of official duties for the corporation, including bodily injury, death or property damage sustained by reason of operation of a motor vehicle while performing official duties. It may defend any suit brought against any such commissioner, officer, or employee to enforce any such claim and may settle any such claim or suit and pay the amount of any such settlement or the amount of any final judgment rendered against any such commissioner, officer, or employee on any such claim without first requiring payment on it. It may pay the premium on any insurance policy which insures any commissioner, officer, or employee of the corporation or any group of such commissioners, officers, or employees against liability for injuries to person or property within the limitations of this paragraph. It may take such action as may be necessary to bring the corporation and its commissioners, officers, and employees within the provisions and limitations of chapter 170.\nAny insurance contract covering such risk shall contain, as a condition precedent, a clause or provision expressly waiving the defense, by the insurer, that the corporation is engaged in a governmental function.",
	"repealed": false
}