{
	"id": "205.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.17",
	"title": "205.17 BALLOTS.",
	"text": "In all statutory and home rule charter cities, and in all towns, the municipal clerk shall have printed the official ballot containing the names of all candidates for municipal offices and municipal ballot questions. The ballot shall be printed in quantities of 25, 50, or 100, shall be headed \"City or Town Election Ballot,\" shall state the name of the city or town and the date of the election, and shall conform in other respects to the state general election ballot. The names shall be arranged on city ballots in the manner provided for the state elections. On town ballots names of the candidates for each office shall be arranged either:\n(1) alphabetically according to the candidates' surnames; or\n(2) in the manner provided for state elections if the town electors chose at the town's annual meeting to arrange the names in that way for at least two consecutive years.\n[Repealed, 2013 c 131 art 2 s 85]\nThe municipal primary ballot shall conform as far as practicable with the municipal general election ballot. No blank spaces shall be provided for writing in the names of candidates.\n[Repealed, 2013 c 131 art 2 s 85]\nIn statutory cities, the names of candidates to fill vacancies at a special election held as provided in section 412.02, subdivision 2a, shall be placed on the municipal primary and general election ballots. The names of candidates to fill a vacancy in the office of council member in a statutory city shall be listed under the separate heading \"Special election for council member to fill vacancy in term expiring ........,\" with the date of expiration of the term and any other information necessary to distinguish the office. Under the heading for the office of mayor in a special election shall be the words \"To fill vacancy in term expiring .............\"\nThe ballots for municipal elections must be prepared by the municipal clerk in the manner provided in the rules of the secretary of state.\nNo later than 30 days before absentee ballots must be prepared and delivered under section 204B.35 for use in a town general election conducted in March, the secretary of state shall supply each town clerk in a town conducting a March general election with a copy of an example ballot. The example ballot must illustrate the format required for the ballots used in the general election that year.",
	"repealed": false
}