{
	"id": "103B.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.315",
	"title": "103B.315 COMPREHENSIVE WATER PLAN REVIEW AND ADOPTION.",
	"text": "[Repealed, 2003 c 128 art 1 s 176]\n[Repealed, 2003 c 128 art 1 s 176]\n[Repealed, 2003 c 128 art 1 s 176]\nThe county board shall conduct a public hearing on the local water management plan pursuant to section 375.51.\n(a) After conducting the public hearing but before final adoption, the county board must submit its local water management plan, all written comments received on the plan, a record of the public hearing under subdivision 4, and a summary of changes incorporated as a result of the review process to the board for review. The board shall complete the review within 90 days after receiving a local water management plan and supporting documents. The board shall consult with the Departments of Agriculture, Health, and Natural Resources; the Pollution Control Agency; the Environmental Quality Board; and other appropriate state agencies during the review.\n(b) The board may disapprove a local water management plan if the board determines the plan is not consistent with state law. If a plan is disapproved, the board shall provide a written statement of its reasons for disapproval. A disapproved local water management plan must be revised by the county board and resubmitted for approval by the board within 120 days after receiving notice of disapproval of the local water management plan, unless the board extends the period for good cause.\n(c) If the local government unit disagrees with the board's decision to disapprove the plan, it may, within 60 days, initiate mediation through the board's informal dispute resolution process as established pursuant to section 103B.345, subdivision 1. A local government unit may appeal disapproval to the court of appeals. A decision of the board on appeal is subject to judicial review under sections 14.63 to 14.69.\nA county board shall adopt and begin implementation of its local water management plan within 120 days after receiving notice of approval of the plan from the board.\n[Repealed, 2003 c 128 art 1 s 176]",
	"repealed": false
}