{
	"id": "383B.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.79",
	"title": "383B.79 MULTIJURISDICTIONAL PROGRAM.",
	"text": "A multijurisdictional reinvestment program is authorized involving Hennepin County, the Hennepin County Housing and Redevelopment Authority, and one or more of the following political subdivisions: the cities of Minneapolis, Brooklyn Center, and other interested statutory or home rule charter cities in Hennepin County, the Minneapolis Park Board, the Three Rivers Park District, and any watershed district entirely or partially located in Hennepin County. The multijurisdictional program may include plans for housing rehabilitation and removals, industrial polluted land cleanup, water ponding, environmental cleanup, community corridor connections, corridor planning, creation of green space, acquisition of property, development and redevelopment of parks and open space, water quality and lakeshore improvement, development and redevelopment of housing and commercial projects, economic development, and job creation.\nUp to one-half of any state appropriation for the program authorized in subdivision 1 may be used by the county as a grant to the cities of Minneapolis and Brooklyn Center to provide assistance in a capital nature for constructing public infrastructure improvements in order to further economic development.\nGovernment jurisdictions participating in the reinvestment program planning and projects must match any state contribution on at least a dollar-for-dollar basis in the aggregate. Government jurisdictions, however constituted, may use any funds under their control for the match requirement.\nThe board of county commissioners shall administer the program and funds and bond for projects in this section either as a county board or a housing and redevelopment authority. The board of county commissioners may acquire property in connection with the projects in this section with any funds under its control. Any sale, lease, or development of such property by the board of county commissioners shall be conducted in accordance with section 469.029.\nHennepin County or the Hennepin County Housing and Redevelopment Authority may appropriate funds for any of the activities described in subdivision 1, whether or not state funds are appropriated for the activity. Hennepin County may include any part of the costs of a project described in section 469.002, subdivision 12, or in a designated transit improvement area as defined in section 469.351, subdivision 1, paragraph (f), in a capital improvement plan adopted under section 373.40, and may issue bonds for such purposes pursuant to and subject to the procedures and limitations set forth in section 373.40, whether or not the capital improvement to be financed is to be owned by the county or any other governmental entity. Such purposes are in addition to the capital improvements described in section 373.40, but shall not include a sports facility building designed or used primarily for professional sports. No funds appropriated under this subdivision may be used to pay operating expenses.",
	"repealed": false
}