{
	"id": "62M.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.01",
	"title": "62M.01 CITATION, JURISDICTION, AND SCOPE.",
	"text": "This chapter may be cited as the \"Minnesota Utilization Review Act of 1992.\"\nThis chapter applies to any insurance company licensed under chapter 60A to offer, sell, or issue a policy of accident and sickness insurance as defined in section 62A.01; a health service plan licensed under chapter 62C; a health maintenance organization licensed under chapter 62D; the Minnesota Comprehensive Health Association created under chapter 62E; a community integrated service network licensed under chapter 62N; an accountable provider network operating under chapter 62T; a fraternal benefit society operating under chapter 64B; a joint self-insurance employee health plan operating under chapter 62H; a multiple employer welfare arrangement, as defined in section 3 of the Employee Retirement Income Security Act of 1974 (ERISA), United States Code, title 29, section 1103, as amended; a third-party administrator licensed under section 60A.23, subdivision 8, that provides utilization review services for the administration of benefits under a health benefit plan as defined in section 62M.02; any other entity that provides, offers, or administers hospital, outpatient, medical, prescription drug, or other health benefits to individuals treated by a health professional under a policy, plan, or contract; or any entity performing utilization review on behalf of a business entity in this state pursuant to a health benefit plan covering a Minnesota resident.\n(a) Nothing in this chapter applies to review of claims after submission to determine eligibility for benefits under a health benefit plan. The appeal procedure described in section 62M.06 applies to any complaint as defined under section 62Q.68, subdivision 2, that requires a medical determination in its resolution.\n(b) Effective January 1, 2026, this chapter applies to managed care plans or county-based purchasing plans when the plan is providing coverage to state public health care program enrollees under chapter 256B or 256L.\n(c) Effective January 1, 2026, the following sections of this chapter apply to services delivered under chapters 256B and 256L: 62M.02, subdivisions 1 to 5, 7 to 12, 13, 14 to 18, and 21; 62M.04; 62M.05, subdivisions 1 to 4; 62M.06, subdivisions 1 to 3; 62M.07; 62M.072; 62M.09; 62M.10; 62M.12; 62M.17, subdivision 2; and 62M.18.",
	"repealed": false
}