{
	"id": "144.2216",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.2216",
	"title": "144.2216 BIRTH DEFECTS RECORDS AND REPORTS REQUIRED.",
	"text": "With the informed consent of a parent or guardian, as provided in subdivision 4, a hospital, medical clinic, medical laboratory, or other institution for the hospitalization, clinical or laboratory diagnosis, or care of human beings shall provide the commissioner of health with access to information on each birth defect case in the manner and at the times that the commissioner designates.\nWith the informed consent of a parent or guardian, as provided in subdivision 4, other repositories of information on the diagnosis or care of infants may provide the commissioner with access to information on each case of birth defects in the manner and at the times that the commissioner designates.\nFurnishing information in good faith in compliance with this section does not subject the person, hospital, medical clinic, medical laboratory, data repository, or other institution furnishing the information to any action for damages or relief.\nA parent or legal guardian must be informed by the commissioner at the time of the initial data collection that they may request removal at any time of personal identifying information concerning a child from the birth defects information system using a written form prescribed by the commissioner. The commissioner shall advise parents or legal guardians:\n(1) that the information on birth defects may be retained by the Department of Health;\n(2) of the benefit and privacy implications of retaining birth defects records;\n(3) that they may elect to have the birth defects information collected once, within one year of birth or fetal death, as defined in section 144.222, but to require that all personally identifying information be destroyed immediately upon the commissioner receiving the information. If the parents or legal guardians object in writing to the maintaining of birth defects information, the objection or election shall be recorded on a form that is signed by a parent or legal guardian and submitted to the commissioner of health; and\n(4) that if the parent or legal guardian chooses to opt-out, the commissioner will not be able to inform the parent or legal guardian of information related to the prevention, treatment, or cause of a particular birth defect.",
	"repealed": false
}