{
	"id": "10A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.14",
	"title": "10A.14 REGISTRATION.",
	"text": "(a) The treasurer of a political committee, political fund, principal campaign committee, or party unit must register with the board by filing a registration statement. The registration statement must be filed by the earliest of the following dates:\n(1) no later than 14 days after the committee, fund, or party unit has made a contribution, received contributions, or made expenditures in excess of $750;\n(2) no later than the next report of receipts and expenditures filing date applicable to the committee, fund, or party unit if the committee, fund, or party unit reached the threshold in clause (1) before the end of the reporting period covered by that report; or\n(3) by the end of the next business day after it has received a loan or contribution that must be reported under section 10A.20, subdivision 5.\n(b) This subdivision does not apply to ballot question or independent expenditure political committees or funds, which are subject to subdivision 1a.\nThe treasurer of an independent expenditure or ballot question political committee or fund must register with the board by filing a registration statement. The registration must be filed by the earliest of the following dates:\n(1) no later than 14 calendar days after the committee or the association registering the political fund has:\n(i) received aggregate contributions for independent expenditures of more than $1,500 in a calendar year;\n(ii) received aggregate contributions for expenditures to promote or defeat a ballot question of more than $5,000 in a calendar year;\n(iii) made aggregate independent expenditures of more than $1,500 in a calendar year; or\n(iv) made aggregate expenditures to promote or defeat a ballot question of more than $5,000 in a calendar year;\n(2) no later than the next report of receipts and expenditures filing date applicable to the independent expenditure or ballot question committee or fund if the committee or fund reached the threshold in clause (1) before the end of the reporting period covered by that report; or\n(3) by the end of the next business day after it has received a loan or contribution that must be reported under section 10A.20, subdivision 5, and it has met one of the requirements of clause (1).\nThe statement of organization must include:\n(1) the name, address, and website address if the registrant maintains a website, of the committee, fund, or party unit;\n(2) the name, address, and email address of the chair of a political committee, principal campaign committee, or party unit;\n(3) the name and address of any supporting association of a political fund;\n(4) the name, address, and email address of the treasurer and any deputy treasurers;\n(5) the name, address, and email address of the candidate of a principal campaign committee;\n(6) a listing of all depositories or safety deposit boxes used; and\n(7) for the state committee of a political party only, a list of its party units.\n(a) A candidate; treasurer of a political committee, political fund, principal campaign committee, or party unit; or chair of a political committee, principal campaign committee, or party unit may file a form with the board that includes alternate contact information. If a form is filed, the form must include the following information for the filer:\n(1) name;\n(2) political committee, political fund, principal campaign committee, or party unit; and\n(3) alternate contact information.\n(b) The board must only use the alternate contact information to contact the filer for the purposes of administering chapter 10A. Information collected pursuant to this subdivision is private data on individuals.\n(c) For purposes of this subdivision, \"alternate contact information\" means an address, phone number, or email address that is different from the information provided on the form required by subdivision 2.\n[Repealed, 1976 c 307 s 35]\nIf an individual fails to file a statement required by this section by the date that the statement was due, the board may impose a late filing fee of $25 per day, not to exceed $1,000, starting on the day after the statement was due.\nThe board must send notice by certified mail to any individual who fails to file a statement within ten business days after the statement was due that the individual may be subject to a civil penalty for failure to file the statement. An individual who fails to file the statement within seven days after the certified mail notice was sent by the board is subject to a civil penalty imposed by the board of up to $1,000.\nFor good cause shown, the board must grant exemptions to the requirement that email addresses be provided.",
	"repealed": false
}