{
	"id": "297A.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.69",
	"title": "297A.69 AGRICULTURAL EXEMPTIONS.",
	"text": "The gross receipts from the sale of, and storage, distribution, use, or consumption of the items contained in this section are specifically exempted from the taxes imposed by this chapter.\nMaterials stored, used, or consumed in agricultural production of personal property intended to be sold ultimately at retail are exempt, whether or not the item becomes an ingredient or constituent part of the property produced. Materials that qualify for this exemption include, but are not limited to, the following:\n(1) feeds, seeds, trees, fertilizers, and herbicides, including when purchased for use by farmers in a federal or state farm or conservation program;\n(2) materials sold to a veterinarian to be used or consumed in the care, medication, and treatment of agricultural production animals and horses;\n(3) chemicals, including chemicals used for cleaning food processing machinery and equipment;\n(4) materials, including chemicals, fuels, and electricity purchased by persons engaged in agricultural production to treat waste generated as a result of the production process;\n(5) fuels, electricity, gas, and steam used or consumed in the production process, including electricity, gas, or steam used for space heating, cooling, or lighting of facilities housing agricultural animals;\n(6) petroleum products and lubricants;\n(7) packaging materials, including returnable containers used in packaging food and beverage products; and\n(8) accessory tools and equipment that are separate detachable units with an ordinary useful life of less than 12 months used in producing a direct effect upon the product.\nMachinery, equipment, implements, tools, accessories, appliances, contrivances, and furniture and fixtures, except those listed in this clause are not included within this exemption.\nRepair and replacement parts, except tires, used for maintenance or repair of farm machinery, logging equipment, and aquaculture production equipment are exempt, if the part replaces a machinery part assigned a specific or generic part number by the manufacturer of the machinery.\nThe following machinery, equipment, and fencing is exempt:\n(1) farm machinery;\n(2) logging equipment, including chain saws used for commercial logging;\n(3) fencing used for the containment of farmed Cervidae, as defined in section 35.153, subdivision 3;\n(4) primary and backup generator units used to generate electricity for the purpose of operating farm machinery, aquacultural production equipment, or logging equipment, or providing light or space heating necessary for the production of livestock, dairy animals, dairy products, or poultry and poultry products; and\n(5) aquaculture production equipment.\nMS 2004 [Repealed, 2003 c 127 art 1 s 34]\n(a) Horses, including racehorses, are exempt.\n(b) Materials, including feed and bedding, used or consumed in the breeding, raising, owning, boarding, and keeping of horses are exempt. Machinery, equipment, implements, tools, appliances, furniture, and fixtures used in the breeding, raising, owning, boarding, and keeping of horses are not included within this exemption.\nPoultry feed is exempt if the poultry is raised for human consumption.",
	"repealed": false
}