{
	"id": "144.212",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.212",
	"title": "144.212 DEFINITIONS.",
	"text": "As used in sections 144.211 to 144.227, the following terms have the meanings given.\n\"Amendment\" means completion or correction made to certification items on a vital record after a certification has been issued or more than one year after the event, whichever occurs first, that does not result in a sealed or replaced record.\n\"Authorized representative\" means an agent designated in a written and witnessed statement signed by the subject of the record or other qualified applicant.\n\"Certification item\" means all individual items appearing on a certificate of birth and the demographic and legal items on a certificate of death.\n\"Commissioner\" means the commissioner of health.\n\"Correction\" means a change made to a noncertification item, including information collected for medical and statistical purposes. A correction also means a change to a certification item within one year of the event provided that no certification, whether paper or electronic, has been issued.\n\"Court of competent jurisdiction\" means a court within the United States with jurisdiction over the individual and such other individuals that the court deems necessary.\n\"Delayed registration\" means registration of a record of birth or death filed one or more years after the date of birth or death.\n\"Disclosure\" means to make available or make known personally identifiable information contained in a vital record, by any means of communication.\n\"File\" means to present a vital record or report for registration to the Office of Vital Records and to have the vital record or report accepted for registration by the Office of Vital Records.\n\"Final disposition\" means the burial, interment, cremation, removal from the state, or other authorized disposition of a dead body or dead fetus.\n\"Institution\" means a public or private establishment that:\n(1) provides inpatient or outpatient medical, surgical, or diagnostic care or treatment; or\n(2) provides nursing, custodial, or domiciliary care, or to which persons are committed by law.\n\"Legal representative\" means a licensed attorney representing an individual.\n\"Local issuance office\" means a county governmental office authorized by the state registrar to issue certified birth and death records.\n\"Record\" means a report of a vital event that has been registered by the state registrar.\n\"Registration\" means the process by which vital records are completed, filed, and incorporated into the official records of the Office of Vital Records.\n\"Replacement\" means a completion, addition, removal, or change made to certification items on a vital record after a vital event is registered and a record is established that has no notation of a change on a certificate and seals the prior vital record.\n\"State registrar\" means the commissioner of health or a designee.\n\"System of vital records\" includes the registration, collection, preservation, amendment, verification, maintenance of the security and integrity of, and certification of vital records, the collection of other reports required by sections 144.211 to 144.227, and related activities including the tabulation, analysis, publication, and dissemination of vital records.\n\"Verification\" means a confirmation of the information on a vital record based on the facts contained in a certification.\n\"Vital record\" means a record or report of birth, stillbirth, death, marriage, dissolution and annulment, and data related thereto. The birth record is not a medical record of the mother or the child.\n\"Vital records statistics\" means the data derived from records and reports of birth, death, fetal death, induced abortion, marriage, dissolution and annulment, and related reports.\n[Repealed by amendment, 2013 c 108 art 12 s 16]\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]\n\"Homeless youth\" has the meaning given in section 256K.45, subdivision 1a.",
	"repealed": false
}