{
	"id": "403.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.162",
	"title": "403.162 ADMINISTRATION OF PREPAID WIRELESS E911 FEES.",
	"text": "Prepaid wireless E911, telecommunications access Minnesota, and 988 fees collected by sellers must be remitted to the commissioner of revenue at the times and in the manner provided by chapter 297A with respect to the general sales and use tax. The commissioner of revenue shall establish registration and payment procedures that substantially coincide with the registration and payment procedures that apply in chapter 297A.\nA seller may deduct and retain three percent of prepaid wireless E911, telecommunications access Minnesota, and 988 fees collected by the seller from consumers.\nThe audit, assessment, appeal, collection, refund, penalty, interest, enforcement, and administrative provisions of chapters 270C and 289A that are applicable to the taxes imposed by chapter 297A apply to any fee imposed under section 403.161.\nThe commissioner of revenue shall establish procedures by which a seller of prepaid wireless telecommunications service may document that a sale is not a retail transaction. These procedures must substantially coincide with the procedures for documenting sale for resale transactions as provided in chapter 297A.\n(a) The commissioner of revenue shall, based on the relative proportion of the prepaid wireless E911 fee, the prepaid wireless telecommunications access Minnesota fee, and the prepaid wireless 988 fee imposed per retail transaction, divide the fees collected in corresponding proportions. Within 30 days of receipt of the collected fees, the commissioner shall:\n(1) deposit the proportion of the collected fees attributable to the prepaid wireless E911 fee in the 911 emergency telecommunications service account in the special revenue fund;\n(2) deposit the proportion of collected fees attributable to the prepaid wireless telecommunications access Minnesota fee in the telecommunications access fund established in section 237.52, subdivision 1; and\n(3) deposit the proportion of the collected fees attributable to the prepaid wireless 988 fee in the 988 special revenue account established in section 145.561, subdivision 3.\n(b) The commissioner of revenue may deduct and deposit in a special revenue account an amount not to exceed two percent of collected fees. Money in the account is annually appropriated to the commissioner of revenue to reimburse its direct costs of administering the collection and remittance of prepaid wireless E911 fees, prepaid wireless telecommunications access Minnesota fees, and prepaid wireless 988 fees.",
	"repealed": false
}