{
	"id": "268A.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/268A.085",
	"title": "268A.085 COMMUNITY REHABILITATION PROVIDER GOVERNING BOARDS.",
	"text": "Every city, town, county, nonprofit corporation, or combination thereof establishing an extended employment program shall appoint a governing board of no fewer than seven voting members before becoming eligible for the assistance provided by sections 268A.06 to 268A.15. When any city, town, or county singly establishes an extended employment program, the governing board shall be appointed by the chief executive officer of the city or the chair of the governing board of the county or town. When any combination of cities, towns, counties, or nonprofit corporations establishes an extended employment program, the chief executive officers of the cities, nonprofit corporations, and the chairs of the governing bodies of the counties or towns shall appoint the board. If a nonprofit corporation singly establishes an extended employment program, the corporation shall appoint the board of directors. Membership on a board shall be representative of the community served and shall include a person with a disability. If a county establishes an extended employment program and manages the program with county employees, the governing board shall be the county board of commissioners, and other provisions of this chapter pertaining to membership on the governing board do not apply.\nSubject to the provisions of sections 268A.06 to 268A.15 and the rules of the department, each governing board shall:\n(1) review and evaluate the need for extended employment programs provided under sections 268A.06 to 268A.15;\n(2) recruit and promote local financial support for extended employment programs from private sources including: the United Way; business, industrial, and private foundations; voluntary agencies; and other lawful sources, and promote public support for municipal and county appropriations;\n(3) promote, arrange, and implement working agreements with other educational and social service agencies, both public and private, and any other allied agencies; and\n(4) when an extended employment program is certified, act as its administrator for purposes of this chapter.",
	"repealed": false
}