{
	"id": "356.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.611",
	"title": "356.611 LIMITATION ON PUBLIC EMPLOYEE SALARIES FOR PENSION PURPOSES.",
	"text": "[Repealed, 2005 c 169 s 2]\n(a) For members or participants of a covered retirement plan listed in subdivision 6, compensation in excess of the limitation specified in section 401(a)(17) of the Internal Revenue Code, as adjusted, for changes in the cost of living under section 401(a)(17)(B) of the Internal Revenue Code, must not be included for contribution and benefit computation purposes.\n(b) Notwithstanding paragraph (a), for members or participants specified in paragraph (a) who first contributed to a plan specified in that paragraph before July 1, 1995, the annual compensation limit specified in section 401(a)(17) of the Internal Revenue Code on June 30, 1993, applies if that provides a greater allowable annual compensation.\n(c) To the extent required by sections 3401(h) and 414(u)(12) of the Internal Revenue Code, an individual receiving a differential wage payment as defined in section 3401(h)(2) of the Internal Revenue Code from an employer shall be treated as employed by that employer, and the differential wage payment will be treated as compensation for purposes of applying the limits on annual additions under section 415(c) of the Internal Revenue Code.\nMS 2016 [Repealed, 2018 c 211 art 13 s 21]\nMS 2016 [Repealed, 2018 c 211 art 13 s 21]\nMS 2016 [Repealed, 2018 c 211 art 13 s 21]\nMS 2016 [Repealed, 2018 c 211 art 13 s 21]\nAs used in this section, \"covered retirement plan\" means any of the following plans:\n(1) the legislator's retirement plan, established by chapter 3A, including constitutional officers as specified in that chapter;\n(2) the general state employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(3) the correctional state employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(4) the State Patrol retirement plan, established by chapter 352B;\n(5) the unclassified state employees retirement plan, established by chapter 352D;\n(6) the general employees retirement plan of the Public Employees Retirement Association, established by chapter 353;\n(7) the public employees police and fire retirement plan of the Public Employees Retirement Association, established by chapter 353;\n(8) the public employees defined contribution plan, established by chapter 353D;\n(9) the local government correctional service retirement plan of the Public Employees Retirement Association, established by chapter 353E;\n(10) the statewide volunteer firefighter retirement plan, established by chapter 353G;\n(11) the Teachers Retirement Association, established by chapter 354;\n(12) the St. Paul Teachers Retirement Fund Association, established by chapter 354A;\n(13) the higher education individual retirement account plan, established by chapter 354B;\n(14) the higher education supplemental retirement plan, established by chapter 354C;\n(15) a retirement plan of a volunteer firefighter retirement association subject to chapter 424A;\n(16) the judges retirement plan, established by chapter 490; or\n(17) the Bloomington Fire Department Relief Association governed by Laws 2013, chapter 111, article 5, sections 31 to 42; Minnesota Statutes 2000, chapter 424; and Laws 1965, chapter 446, as amended.",
	"repealed": false
}