{
	"id": "302.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/302.021",
	"title": "302.021 TRANSFER AND PLEDGE OF SHARES OF STOCK AND RIGHTS HELD BY CLEARING CORPORATION.",
	"text": "For the purposes of this section:\n(1) \"clearing corporation\" means a corporation, all of the capital stock of which is held by or for a national securities exchange registered under the Securities Exchange Act of 1934, United States Code, title 15, section 78a et seq., as amended; and\n(2) \"custodian\" means a bank or trust company which is supervised and examined by state or federal authority having supervision over banks and which is acting as custodian for a clearing corporation.\nNotwithstanding the provisions of this chapter or any other applicable law, if a certificate or instrument evidencing shares of stock, or rights to purchase or subscribe to shares of stock, is in the custody of a clearing corporation or of a custodian subject to the instructions of a clearing corporation, title to any such certificate or instrument or to any interest therein and to the shares or rights evidenced by such certificate, instrument or interest may be transferred by the making of entries on the books of the clearing corporation reducing the account of the transferor by the number of shares or rights transferred and increasing the account of the transferee by such number of shares or rights. A transfer of title so made shall for all purposes have the same effect as if the transferor had delivered to the transferee a certificate or instrument evidencing the shares or rights transferred, duly endorsed in blank.\nA valid pledge may be made of any such certificate or instrument or of any interest therein and of the shares or rights evidenced by such certificate, instrument or interest by:\n(1) The giving by the pledgor to the clearing corporation of notice of the pledge and of instructions that, until receipt by the clearing corporation of notice to the contrary from the pledgee, such certificate, instrument or interest therein and the shares or rights evidenced by such certificate, instrument or interest shall be held by the clearing corporation, either directly or through the custodian, for the account of the pledgee, and\n(2) By making of entries on the books of the clearing corporation reducing the account of the pledgor by the number of shares or rights pledged and increasing the account of the pledgee by such number of shares or rights.\nA pledge so made shall for all purposes be as valid and effective as one made by transfer of actual possession of a certificate or instrument evidencing the shares or rights pledged from the pledgor to the pledgee.\nThe provisions of this section shall be applicable although the charter or articles of incorporation or code of regulations or bylaws of the corporation, any shares or rights of which are transferred or pledged as herein provided, or any certificate or instrument evidencing such shares or rights, in whole or in part, provide that such shares or rights shall be transferable only on the books of the corporation or shall be registered by a registrar or transferred by a transfer agent.",
	"repealed": false
}