{
	"id": "92.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.46",
	"title": "92.46 LANDS AS CAMPGROUNDS.",
	"text": "(a) The director may designate suitable portions of the state lands withdrawn from sale and not reserved, as provided in section 92.45, as permanent state public campgrounds. The director may have the land surveyed and platted into lots of convenient size, and lease them for cottage and camp purposes under terms and conditions the director prescribes, subject to the provisions of this section.\n(b) A lease may not be for a term more than 20 years. The lease may allow renewal, from time to time, for additional terms of no longer than 20 years each. The lease may be canceled by the commissioner 90 days after giving the person leasing the land written notice of violation of lease conditions. The lease rate shall be based on the appraised value of leased land as determined by the commissioner of natural resources and shall be adjusted by the commissioner at the fifth, tenth, and 15th anniversary of the lease, if the appraised value has increased or decreased. For leases that are renewed in 1991 and following years, the lease rate shall be five percent of the appraised value of the leased land. The appraised value shall be the value of the leased land without any private improvements and must be comparable to similar land without any improvements within the same county. The minimum appraised value that the commissioner assigns to the leased land must be substantially equal to the county assessor's estimated market value of similar land adjusted by the assessment/sales ratio as determined by the Department of Revenue.\n(c) By July 1, 1986, the commissioner of natural resources shall adopt rules under chapter 14 to establish procedures for leasing land under this section. The rules shall be subject to review and approval by the commissioners of revenue and administration prior to the initial publication pursuant to chapter 14 and prior to their final adoption. The rules must address at least the following:\n(1) method of appraising the property; and\n(2) an appeal procedure for both the appraised values and lease rates.\n(d) All money received from these leases must be credited to the fund to which the proceeds of the land belong.\n(e) Notwithstanding section 16A.125 or any other law to the contrary, for fiscal years 1999 and 2000, 100 percent, and thereafter, 50 percent, of the money received from the lease of permanent school fund lands leased pursuant to this subdivision must be credited to the lakeshore leasing and sales account in the permanent school fund and is appropriated for use to survey, appraise, and pay associated selling, leasing, or exchange costs of lots as required in this section and Minnesota Statutes 1992, section 92.67, subdivision 3. Any money designated for deposit in the permanent school fund that is not needed to survey, appraise, and pay associated selling, leasing, or exchange costs of lots, as required in this section, shall be deposited in the permanent school fund. The commissioner shall add to the appraised value of any lot offered for sale or exchange the costs of surveying, appraising, and disposing of the lot, and shall first deposit into the permanent school fund an amount equal to the costs of surveying, appraising, and disposing of any lot paid out of the permanent school fund. Any remaining money shall be deposited into any other contributing funds in proportion to the contribution from each fund. In no case may the commissioner add to the appraised value of any lot offered for sale or exchange an amount more than the actual contract service costs of surveying, appraising, and disposing of the lot.\nEffective May 22, 1973, no new leases may be made pursuant to subdivision 1. If substantial improvements have been made to land leased pursuant to subdivision 1, the commissioner must require the lessee to comply with applicable county ordinances for management of shoreland areas and must cancel any lease for noncompliance with these standards unless the substandard use is authorized by the county ordinance.\n[Repealed, 1975 c 353 s 41]\nState land leased under subdivision 1, that have increased lease rates effective on or after January 1, 1986, shall phase in the increased lease rates by three equal annual increments, except that the lease rates shall be adjusted to reflect changes in the lease rates resulting from rules adopted under subdivision 1.\nA county where state lands are leased under this section, may spend money raised from the levy of property taxes for the maintenance and upgrading of roads serving the leased property regardless of whether the roads are part of the county highway system.",
	"repealed": false
}