{
	"id": "162.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.06",
	"title": "162.06 ACCRUALS TO COUNTY STATE-AID HIGHWAY FUND; ACCOUNTS.",
	"text": "(a) By December 15 of each year the commissioner shall estimate the amount of money that will be available to the county state-aid highway fund during that fiscal year. The amount available must be based on actual receipts at the time of the allocation calculation, the unallocated fund balance, and the projected receipts for the remainder of the fiscal year. The amount available, except for deductions as provided in this section, shall be apportioned by the commissioner to the counties as provided in section 162.07.\n(b) For purposes of this section, \"amount available\" means the amount estimated in paragraph (a).\nTwo percent must be deducted from the amount available, set aside in a separate account, and used for administrative costs incurred by the state Transportation Department in carrying out the provisions relating to the county state-aid highway system.\n(a) After deducting administrative costs as provided in subdivision 2, the commissioner shall set aside each year one percent of the amount available to provide for a disaster account; provided that the total amount of money in the disaster account must never exceed two percent of the total sums to be apportioned to the counties. The money must be used to provide aid to any county encountering disasters or unforeseen events affecting its county state-aid highway system, and resulting in an undue and burdensome financial hardship.\n(b) Any county desiring aid by reason of disaster or unforeseen event shall request the aid in the form required by the commissioner. Upon receipt of the request, the commissioner shall appoint a board consisting of two representatives of the counties, who must be either a county engineer or member of a county board, from counties other than the requesting county, and a representative of the commissioner. The board shall investigate the matter and report its findings and recommendations in writing to the commissioner.\n(c) Final determination of the amount of aid, if any, to be paid to the county from the disaster account must be made by the commissioner. Upon determining to aid a requesting county, the commissioner shall certify the amount payable to the county treasurer of the county. Money so paid must be expended on the county state-aid highway system in accordance with the rules of the commissioner.\n(a) Each year the screening board, provided for in section 162.07, subdivision 5, may recommend to the commissioner a sum of money that the commissioner shall set aside from the amount available and credit to a research account. The amount so recommended and set aside shall not exceed one-half of one percent of the preceding year's distribution amount, as defined in section 162.07, subdivision 1a.\n(b) Any money so set aside shall be used by the commissioner for the purpose of:\n(1) conducting research for improving the design, construction, maintenance and environmental compatibility of state-aid highways and appurtenances;\n(2) constructing research elements and reconstructing or replacing research elements that fail; and\n(3) conducting programs for implementing and monitoring research results.\n(c) Any balance remaining in the research account at the end of each year from the sum set aside for the year immediately previous, shall be transferred to the county state-aid highway fund.\nAfter deducting for administrative costs and for the disaster account and research account from the amount available as provided in this section, the commissioner shall deduct a sum equal to the three-quarters of one percent of the remainder. The sum so deducted shall be set aside in a separate account and shall be used for (1) the establishment, location, relocation, construction, reconstruction, and improvement of those roads included in the county state-aid highway system under section 162.02, subdivision 6, which border and provide substantial access to an outdoor recreation unit as defined in section 86A.04 or which provide access to the headquarters of or the principal parking lot located within such a unit, and (2) the reconstruction, improvement, repair, and maintenance of county roads, city streets, and town roads that provide access to public lakes, rivers, state parks, and state campgrounds. Roads described in clause (2) are not required to meet county state-aid highway standards. At the request of the commissioner of natural resources the counties wherein such roads are located shall do such work as requested in the same manner as on any county state-aid highway and shall be reimbursed for such construction, reconstruction, or improvements from the amount set aside by this subdivision. Before requesting a county to do work on a county state-aid highway as provided in this subdivision, the commissioner of natural resources must obtain approval for the project from the County State-Aid Screening Board. The screening board, before giving its approval, must obtain a written comment on the project from the county engineer of the county requested to undertake the project. Before requesting a county to do work on a county road, city street, or a town road that provides access to a public lake, a river, a state park, or a state campground, the commissioner of natural resources shall obtain a written comment on the project from the county engineer of the county requested to undertake the project. Any balance of the amount so set aside, at the end of each year must be transferred to the county state-aid highway fund.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]",
	"repealed": false
}