{
	"id": "353G.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/353G.17",
	"title": "353G.17 TRANSFER AUTHORIZED.",
	"text": "(a) An entity operating a fire department with firefighters who are covered by the plan may initiate the transfer of records, assets, and liabilities related to the firefighters' lump-sum or monthly benefits under the plan to a relief association that, at the time of the transfer, will be associated with the entity. The entity may be a municipality, a firefighting corporation, or a joint powers entity.\n(b) A transfer is initiated by filing with the executive director the following:\n(1) a notice of intent to initiate a transfer;\n(2) a copy of the resolutions of the entity approving the transfer of records, assets, and liabilities from the plan to a relief association; and\n(3) for each firefighter, the firefighter's name, address, telephone number, and email address, if any.\n(c) The notice shall inform the executive director of the following:\n(1) the transfer effective date, which shall comply with paragraph (d);\n(2) the name of the relief association and the municipality, firefighting corporation, or joint powers entity with which the relief association is associated; and\n(3) a summary of the type and level of pension or retirement benefits, including any ancillary benefits, provided by the relief association or, in the case of a new relief association, to be provided, and related terms and conditions.\n(d) If the notice of intent to transfer is filed with the executive director before September 1, the transfer takes effect on the next January 1. If the notice of intent to transfer is filed after August 31, the transfer takes effect on the January 1 following the one-year anniversary of the filing of the notice.\n(a) Before a transfer of records, assets, and liabilities from the plan to a relief association may occur, the board of trustees of the relief association shall adopt resolutions as follows:\n(1) approving and accepting the transfer of records, assets, and liabilities from the plan; and\n(2) amending the bylaws of the relief association as necessary to add the firefighters whose benefits are being transferred from the plan and to provide that each benefit being transferred retains vesting, distribution, and other rights to which the firefighter, for whom the benefit is being transferred, is entitled under the terms of the plan to the date of the transfer.\nThe board of trustees shall file a copy of the resolutions with the executive director.\n(b) The board of trustees of the relief association shall file with the state auditor the following:\n(1) a copy of the resolutions required under paragraph (a);\n(2) a copy of the bylaws of the relief association and any bylaw amendments;\n(3) a copy of the relief association's investment policy;\n(4) a statement that a board of trustees has been duly elected and each trustee's name, address, telephone number, and email address, if any;\n(5) a copy of the most recent annual financial, investment, and plan administration report filed under section 424A.014, unless the due date for the first report has not yet occurred; and\n(6) a copy of the documentation indicating that a special fund has been established with a financial institution to receive a transfer of assets from the plan.\n(c) Upon receipt of the information and documents required under paragraph (b), the state auditor shall issue to the relief association and the executive director written confirmation of receipt of all required information and documents.\n(a) A transfer under subdivision 1 shall not occur unless the active firefighters whose benefits are to be transferred from the plan to a relief association approve the transfer by a vote of the firefighters conducted by the executive director.\n(b) The approval of the firefighters shall be determined by a vote of all active firefighters whose benefits are to be transferred. An affirmative vote of a majority of the firefighters voting shall constitute approval.\n(c) The executive director shall provide a voting ballot and the following to each active firefighter:\n(1) a summary of the benefits currently provided to the firefighters under the plan;\n(2) a copy of the resolutions of the municipality approving the transfer;\n(3) a copy of the resolutions of the board of trustees approving the transfer;\n(4) a copy of the notice of intent to transfer required under subdivision 1;\n(5) a copy of the state auditor's confirmation required under subdivision 2, paragraph (c); and\n(6) the instructions and time frame for voting. Firefighters shall be given no less than 30 days in which to vote.\n(d) The vote of any firefighter, including whether or not the firefighter voted, shall not be disclosed to any officer or member of the staff of the municipality or to any officer, trustee, or member of the staff of the relief association.\n(e) The executive director shall tally the votes and report the results to the relief association and the municipality.\n(a) Upon completion of the actions required under subdivisions 1 to 3, the plan shall transfer to the relief association as of the effective date identified in the notice under subdivision 1, the records, assets, and liabilities related to the former and current firefighters with benefits under the plan, along with any assets in excess of liabilities credited to the lump-sum account or the monthly benefit retirement account attributable to the firefighters and the municipality.\n(b) The executive director:\n(1) shall transfer the assets in cash;\n(2) shall transfer any accounts receivable associated with the lump-sum account or monthly benefit retirement account;\n(3) shall settle any accounts payable from the account before the transfer; and\n(4) may deduct from the assets to be transferred reasonable costs incurred by the plan to conduct the voting process and complete the transfer.\n(a) Upon transfer of the assets of the lump-sum account or monthly benefit retirement account, the pension liabilities attributable to the benefits for the former and current firefighters shall become the obligation of the special fund of the relief association.\n(b) Upon the transfer of the assets of the lump-sum account or monthly benefit retirement account, the board of trustees of the relief association has legal title to and management responsibility for the transferred assets as trustees for persons having a beneficial interest in those assets arising out of the benefit coverage provided by the account.\n(c) The relief association is the successor in interest with respect to all claims against the plan relating to the transferred lump-sum account or monthly benefit retirement account, except for claims alleging any act or acts by the plan or its fiduciaries that were not done in good faith or that constituted a breach of fiduciary responsibility under chapter 356A.\n(d) The value of each volunteer firefighter's benefit in the plan on the day before the asset transfer shall be no less than the value of the volunteer firefighter's benefit on the day after the asset transfer. The relief association shall give credit, with respect to each firefighter whose benefit is being transferred, for all past service, including service credit with the plan and with any predecessor relief association, to the extent credit is given for such service in the records of the plan for that firefighter.\n(e) Upon completion of the transfer of records, assets, and liabilities, the executive director shall provide written notice to the state auditor, the commissioner of revenue, and the secretary of state that the transfer is complete.\nIf the municipality, board of trustees, or firefighters fail to approve the transfer under subdivision 1, 2, or 3 or the requirements of subdivision 2, paragraph (b), are not met, the transfer of records, assets, and liabilities from the plan to the relief association shall not occur.",
	"repealed": false
}