{
	"id": "473.142",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.142",
	"title": "473.142 SMALL BUSINESSES.",
	"text": "(a) The Metropolitan Council and agencies specified in section 473.143, subdivision 1, may award up to a six percent preference in the amount bid for specified goods or services to small targeted group businesses and veteran-owned small businesses designated under section 16C.16.\n(b) The council and each agency specified in section 473.143, subdivision 1, may designate a purchase of goods or services for award only to small targeted group businesses designated under section 16C.16 if the council or agency determines that at least three small targeted group businesses are likely to bid. The council and each agency specified in section 473.143, subdivision 1, may designate a purchase of goods or services for award only to veteran-owned small businesses designated under section 16C.16 if the council or agency determines that at least three veteran-owned small businesses are likely to bid.\n(c) The council and each agency specified in section 473.143, subdivision 1, as a condition of awarding a construction contract or approving a contract for consultant, professional, or technical services, may set goals that require the prime contractor to subcontract a portion of the contract to small targeted group businesses and veteran-owned small businesses designated under section 16C.16. The council or agency must establish a procedure for granting waivers from the subcontracting requirement when qualified small targeted group businesses and veteran-owned small businesses are not reasonably available. The council or agency may establish financial incentives for prime contractors who exceed the goals for use of subcontractors and financial penalties for prime contractors who fail to meet goals under this paragraph. The subcontracting requirements of this paragraph do not apply to prime contractors who are small targeted group businesses and veteran-owned small businesses. At least 75 percent of the value of the subcontracts awarded to small targeted group businesses under this paragraph must be performed by the business to which the subcontract is awarded or by another small targeted group business. At least 75 percent of the value of the subcontracts awarded to veteran-owned small businesses under this paragraph must be performed by the business to which the subcontract is awarded or another veteran-owned small business.\n(d) The council and each agency listed in section 473.143, subdivision 1, are encouraged to purchase from small targeted group businesses and veteran-owned small businesses designated under section 16C.16 when making purchases that are not subject to competitive bidding procedures.\n(e) The council and each agency may adopt rules to implement this section.\n(f) Each council or agency contract must require the prime contractor to pay any subcontractor within ten days of the prime contractor's receipt of payment from the council or agency for undisputed services provided by the subcontractor. The contract must require the prime contractor to pay interest of 1-1/2 percent per month or any part of a month to the subcontractor on any undisputed amount not paid on time to the subcontractor. The minimum monthly interest penalty payment for an unpaid balance of $100 or more is $10. For an unpaid balance of less than $100, the prime contractor shall pay the actual penalty due to the subcontractor. A subcontractor who prevails in a civil action to collect interest penalties from a prime contractor must be awarded its costs and disbursements, including attorney fees, incurred in bringing the action.\n(g) This section does not apply to procurement financed in whole or in part with federal funds if the procurement is subject to federal disadvantaged, minority, or women business enterprise regulations. The council and each agency shall report to the commissioner of administration on compliance with this section. The information must be reported at the time and in the manner requested by the commissioner.",
	"repealed": false
}