{
	"id": "268.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.035",
	"title": "268.035 DEFINITIONS.",
	"text": "The words, terms, and phrases in this section, for the purposes of the Minnesota Unemployment Insurance Law, have the meaning stated.\n(a) \"Agricultural employment\" means the same as \"agricultural labor\" defined under United States Code, title 26, section 3306, subparagraph (k), of the Federal Unemployment Tax Act and Code of Federal Regulations, title 26, section 31.3121(g)-1.\n(b) For the purposes of this chapter, the term \"crew leader\" means an individual who:\n(1) furnishes workers to be employed in agricultural employment for another person; and\n(2) pays the wages to the worker.\n(c) For the purposes of this chapter, a worker who is a member of a crew furnished by a crew leader for another person is an employee of the crew leader if:\n(1)(i) the crew leader holds a valid certificate of registration under United States Code, title 29, section 1802, the Migrant and Seasonal Agricultural Worker Protection Act; or (ii) substantially all of the members of the crew operate or maintain any mechanized equipment that is provided by the crew leader; and\n(2) the crew leader has not entered into a written agreement with the other person under which the worker is designated as an employee of the other person.\nIf a worker furnished by a crew leader for another person is not an employee of the crew leader under clauses (1) and (2), the worker is an employee of the other person and the wages paid to the worker are considered paid by the other person.\n\"Applicant\" means an individual who has filed an application for unemployment benefits and has established or is pursuing the establishment of a benefit account.\n\"Back pay\" means a payment by an employer to an employee or former employee for lost wages.\n(a) \"Base period,\" unless otherwise provided in this subdivision, means the most recent four completed calendar quarters before the effective date of an applicant's application for unemployment benefits if the application has an effective date occurring after the month following the most recent completed calendar quarter. The base period under this paragraph is as follows:\n(b) If an application for unemployment benefits has an effective date that is during the month following the most recent completed calendar quarter, then the base period is the first four of the most recent five completed calendar quarters before the effective date of an applicant's application for unemployment benefits. The base period under this paragraph is as follows:\n(c) Regardless of paragraph (a), a base period of the first four of the most recent five completed calendar quarters must be used if the applicant would have more wage credits under that base period than under a base period of the four most recent completed calendar quarters.\n(d) If the applicant has insufficient wage credits to establish a benefit account under a base period of the four most recent completed calendar quarters, or a base period of the first four of the most recent five completed calendar quarters, but during either base period the applicant received workers' compensation for temporary disability under chapter 176 or a similar federal law or similar law of another state, or if the applicant whose own serious illness caused a loss of work for which the applicant received compensation for loss of wages from some other source, the applicant may request a base period as follows:\n(1) if an applicant was compensated for a loss of work of seven to 13 weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent six completed calendar quarters before the effective date of the application for unemployment benefits;\n(2) if an applicant was compensated for a loss of work of 14 to 26 weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent seven completed calendar quarters before the effective date of the application for unemployment benefits;\n(3) if an applicant was compensated for a loss of work of 27 to 39 weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent eight completed calendar quarters before the effective date of the application for unemployment benefits; and\n(4) if an applicant was compensated for a loss of work of 40 to 52 weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent nine completed calendar quarters before the effective date of the application for unemployment benefits.\n(e) No base period under this subdivision may include wage credits upon which a prior benefit account was established.\n[Renumbered subd 26a]\n\"Benefit year\" means the period of 52 calendar weeks beginning the date a benefit account is effective. For a benefit account established effective any January 1, April 1, July 1, or October 1, the benefit year will be a period of 53 calendar weeks.\n\"Calendar quarter\" means the period of three consecutive calendar months ending on March 31, June 30, September 30, or December 31.\n[Renumbered subd 2a]\n\"Commissioner\" means the commissioner of employment and economic development.\n[Repealed, 2007 c 135 art 3 s 42]\nFor purposes of this chapter, section 181.723 determines whether a worker is an independent contractor or an employee when performing public or private sector commercial or residential building construction or improvement services.\n\"Corporation\" includes associations, joint-stock companies, and insurance companies. This definition is not exclusive.\n(a) \"Covered agricultural employment\" means agricultural employment performed for a person who:\n(1) during any calendar quarter in the current or the prior calendar year paid wages of $20,000 or more to employees; or\n(2) in the current or the prior calendar year employed four or more employees who each worked for some portion of a day in 20 calendar weeks, regardless of whether they were employed during the same weeks.\n(b) Employment of an officer or shareholder of a family farm corporation and employment of an individual 16 years of age or under is included in covered agricultural employment only if the employer is an employer under United States Code, title 26, section 3306(a)(2) of the Federal Unemployment Tax Act.\n(a) \"Covered employment\" means an employee's entire employment during the calendar quarter if:\n(1) 50 percent or more of the employment during the quarter is performed in Minnesota;\n(2) 50 percent or more of the employment during the quarter is not performed in Minnesota or any other state, or Canada, but some of the employment is performed in Minnesota and the employee's residence is in Minnesota during 50 percent or more of the calendar quarter;\n(3) the employment during the quarter is performed outside the United States and Canada, by an employee who is a United States citizen in the employ of an American employer, if the employer's principal place of business in the United States is located in Minnesota. For the purposes of this clause, an \"American employer\" is defined under the Federal Unemployment Tax Act, United States Code, title 26, chapter 23, section 3306, subsection (j)(3); or\n(4) the employment during the quarter is performed by an officer or member of the crew of an American vessel operating on navigable waters within, or within and without, the United States, and the office from which the operations of the vessel and controlled is in Minnesota.\n(b) \"Covered employment\" includes covered agricultural employment under subdivision 11.\n(c) For the purposes of section 268.095, \"covered employment\" includes employment covered under an unemployment insurance program:\n(1) of any other state;\n(2) established by an act of Congress; or\n(3) the law of Canada.\n(d) The percentage of employment performed under paragraph (a) is determined by the amount of hours worked.\n(e) Covered employment does not include any employment defined as \"noncovered employment\" under subdivision 20.\n\"Department\" means the Department of Employment and Economic Development.\n[Renumbered subd 12d]\n\"Determination\" means a document sent to an applicant or employer by mail or electronic transmission that is an initial department ruling on a specific issue. All documents that are determinations under this chapter use that term in the title of the document and are appealable to an unemployment law judge under section 268.105, subdivision 1.\n[Renumbered subd 12f]\n\"Earnings\" means all compensation to which the applicant has a legal claim and is earned income under state and federal law for income tax purposes.\n\"Electronic transmission\" means a communication that is sent online, by telephone, or by facsimile transmission.\n\"Employee\" means:\n(1) every individual who is performing or has performed services for an employer in employment; or\n(2) each individual employed to perform or assist in performing the work of any agent or employee of the employer is considered to be an employee of that employer whether the individual was hired or paid directly by that employer or by the agent or employee, provided the employer had actual or constructive knowledge of the work.\n\"Employer\" means any person that has had one or more employees during the current or the prior calendar year including any person that has elected, under section 268.042, to be subject to the Minnesota Unemployment Insurance Law and a joint venture composed of one or more employers.\nAn employee leasing company, professional employer organization, or similar person that has been assigned a tax account under section 268.046 is an employer for purposes of this chapter.\n(a) \"Employment\" means service performed by:\n(1) an individual who is an employee under the common law of employer-employee and not an independent contractor;\n(2) an officer of a corporation;\n(3) a member of a limited liability company who is an employee under the common law of employer-employee;\n(4) an individual who is an employee under the Federal Insurance Contributions Act, United States Code, title 26, chapter 21, sections 3121 (d)(3)(A) and 3121 (d)(3)(D); or\n(5) product demonstrators in retail stores or other locations to aid in the sale of products. The person that pays the wages is the employer.\n(b) Employment does not include service as a juror.\n(c) Construction industry employment is defined in subdivision 9a. Trucking and messenger/courier industry employment is defined in subdivision 25b. Rules on determining worker employment status are described under Minnesota Rules, chapter 3315.\n\"Family farm corporation\" has the meaning given to it in section 500.24, subdivision 2.\n\"Filing\" or \"filed\" means the personal delivery of an application, appeal, or other required action to the commissioner or any of the commissioner's agents, or if done by mail, deposited in the United States mail properly addressed to the department with postage prepaid, in which case it is considered filed on the day indicated by the cancellation mark of the United States Postal Service.\nIf an application, appeal, or other required action is made by electronic transmission, it is considered filed on the day received by the department.\n[Renumbered subd 25a]\n\"High quarter\" means the calendar quarter in an applicant's base period with the highest amount of wage credits.\n\"Immediate family member\" means an individual's spouse, parent, stepparent, grandparent, son or daughter, stepson or stepdaughter, or grandson or granddaughter.\n\"Noncovered employment\" means:\n(1) employment for the United States government or an instrumentality thereof, including military service;\n(2) employment for a state, other than Minnesota, or a political subdivision or instrumentality thereof;\n(3) employment for a foreign government;\n(4) employment covered under the federal Railroad Unemployment Insurance Act;\n(5) employment for a church or convention or association of churches, or a nonprofit organization operated primarily for religious purposes that is operated, supervised, controlled, or principally supported by a church or convention or association of churches;\n(6) employment for an elementary or secondary school with a curriculum that includes religious education that is operated by a church, a convention or association of churches, or a nonprofit organization that is operated, supervised, controlled, or principally supported by a church or convention or association of churches;\n(7) employment for Minnesota or a political subdivision, or a nonprofit organization, of a duly ordained or licensed minister of a church in the exercise of a ministry or by a member of a religious order in the exercise of duties required by the order;\n(8) employment for Minnesota or a political subdivision, or a nonprofit organization, of an individual receiving rehabilitation of \"sheltered\" work in a facility conducted for the purpose of carrying out a program of rehabilitation for individuals whose earning capacity is impaired by age or physical or mental deficiency or injury or a program providing \"sheltered\" work for individuals who because of an impaired physical or mental capacity cannot be readily absorbed in the competitive labor market. This clause applies only to services performed in a facility certified by the Rehabilitation Services Branch of the department or in a day training or habilitation program licensed by the Department of Human Services;\n(9) employment for Minnesota or a political subdivision, or a nonprofit organization, of an individual receiving work relief or work training as part of an unemployment work relief or work training program financed in whole or in part by any federal agency or an agency of a state or political subdivision thereof. This clause does not apply to programs that require unemployment benefit coverage for the participants;\n(10) employment for Minnesota or a political subdivision, as an elected official, a member of a legislative body, or a member of the judiciary;\n(11) employment as a member of the Minnesota National Guard or Air National Guard;\n(12) employment for Minnesota or a political subdivision, or instrumentality thereof, of an individual serving on a temporary basis in case of fire, flood, tornado, or similar emergency;\n(13) employment as an election official or election worker for Minnesota or a political subdivision, if the compensation for that employment was less than $1,000 in a calendar year;\n(14) employment for Minnesota that is a major policy-making or advisory position in the unclassified service;\n(15) employment for Minnesota in an unclassified position established under section 43A.08, subdivision 1a;\n(16) employment for a political subdivision of Minnesota that is a nontenured major policy making or advisory position;\n(17) domestic employment in a private household, local college club, or local chapter of a college fraternity or sorority, if the wages paid in any calendar quarter in either the current or prior calendar year to all individuals in domestic employment totaled less than $1,000.\n\"Domestic employment\" includes all service in the operation and maintenance of a private household, for a local college club, or local chapter of a college fraternity or sorority as distinguished from service as an employee in the pursuit of an employer's trade or business;\n(18) employment of an individual by a son, daughter, or spouse, and employment of a child under the age of 18 by the child's father or mother;\n(19) employment of an inmate of a custodial or penal institution;\n(20) employment for a school, college, or university, by a student who is enrolled and whose primary relation to the school, college, or university is as a student. This does not include an individual whose primary relation to the school, college, or university is as an employee who also takes courses;\n(21) employment of an individual who is enrolled as a student in a full-time program at a nonprofit or public educational institution that maintains a regular faculty and curriculum and has a regularly organized body of students in attendance at the place where its educational activities are carried on, taken for credit at the institution, that combines academic instruction with work experience, if the employment is an integral part of the program, and the institution has so certified to the employer, except that this clause does not apply to employment in a program established for or on behalf of an employer or group of employers;\n(22) employment of a foreign college or university student who works on a seasonal or temporary basis under the J-1 visa summer work travel program described in Code of Federal Regulations, title 22, section 62.32;\n(23) employment of university, college, or professional school students in an internship or other training program with the city of St. Paul or the city of Minneapolis under Laws 1990, chapter 570, article 6, section 3;\n(24) employment for a hospital by a patient of the hospital. \"Hospital\" means an institution that has been licensed by the Department of Health as a hospital;\n(25) employment as a student nurse for a hospital or a nurses' training school by an individual who is enrolled and is regularly attending classes in an accredited nurses' training school;\n(26) employment as an intern for a hospital by an individual who has completed a four-year course in an accredited medical school;\n(27) employment as an insurance salesperson, by other than a corporate officer, if all the wages from the employment is solely by way of commission. The word \"insurance\" includes an annuity and an optional annuity;\n(28) employment as an officer of a township mutual insurance company or farmer's mutual insurance company under chapter 67A;\n(29) employment of a corporate officer, if the officer directly or indirectly, including through a subsidiary or holding company, owns 25 percent or more of the employer corporation, and employment of a member of a limited liability company, if the member directly or indirectly, including through a subsidiary or holding company, owns 25 percent or more of the employer limited liability company;\n(30) employment as a real estate salesperson, other than a corporate officer, if all the wages from the employment is solely by way of commission;\n(31) employment as a direct seller as defined in United States Code, title 26, section 3508;\n(32) employment of an individual under the age of 18 in the delivery or distribution of newspapers or shopping news, not including delivery or distribution to any point for subsequent delivery or distribution;\n(33) casual employment performed for an individual, other than domestic employment under clause (17), that does not promote or advance that employer's trade or business;\n(34) employment in \"agricultural employment\" unless it is \"covered agricultural employment\" under subdivision 11;\n(35) if employment during one-half or more of any pay period was covered employment, all the employment for the pay period is covered employment; but if during more than one-half of any pay period the employment was noncovered employment, then all of the employment for the pay period is noncovered employment. \"Pay period\" means a period of not more than a calendar month for which a payment or compensation is ordinarily made to the employee by the employer; or\n(36) employment of a foreign agricultural worker who works on a seasonal or temporary basis under the H-2A visa temporary agricultural employment program described in Code of Federal Regulations, title 20, part 655.\n[Renumbered subd 21b]\n\"Nonprofit organization\" means an organization described in United States Code, title 26, section 501(c)(3), and is exempt from income tax under section 501(a).\n\"Person\" means:\n(1) an individual or any type of organization or entity, resident or nonresident, for profit or nonprofit, religious, charitable or educational, including any receiver or trustee in a bankruptcy, successor of any of the foregoing, or legal representative of a deceased individual; and\n(2) any government entity, state or federal, foreign or domestic, or Indian tribe, including any subdivision or instrumentality thereof owned wholly or in part.\n[Renumbered subd 21c]\n\"Preponderance of the evidence\" means evidence in support of a fact that is more convincing and has a greater probability of truth than the evidence opposing the fact.\n(a) An applicant is in \"reemployment assistance training\" when:\n(1)(i) a reasonable opportunity for suitable employment for the applicant does not exist in the labor market area and additional training will assist the applicant in obtaining suitable employment;\n(ii) the curriculum, facilities, staff, and other essentials are adequate to achieve the training objective;\n(iii) the training is vocational or short term academic training directed to an occupation or skill that will substantially enhance the employment opportunities available to the applicant in the applicant's labor market area;\n(iv) the training course is full time by the training provider; and\n(v) the applicant is making satisfactory progress in the training;\n(2) the applicant can provide proof of enrollment in one or more programs offered by an adult basic education consortium under section 124D.518. Programs may include but are not limited to:\n(i) general educational development diploma preparation;\n(ii) local credit completion adult high school diploma preparation;\n(iii) state competency-based adult high school diploma preparation;\n(iv) basic skills enhancement training focused on math, functional literacy, reading, or writing;\n(v) computer skills training; or\n(vi) English as a second language instruction;\n(3) the applicant can provide proof of enrollment in an English as a second language program taught by a licensed instructor;\n(4) the applicant can provide proof of enrollment in an over-the-road truck driving training program offered by a college or university within the Minnesota state system; or\n(5) the applicant can provide proof of enrollment in a program funded under section 116L.99.\n(b) Full-time training provided through the dislocated worker program, the Trade Act of 1974, as amended, or the North American Free Trade Agreement is \"reemployment assistance training,\" if that training course is in accordance with the requirements of that program.\n(c) Apprenticeship training provided in order to meet the requirements of an apprenticeship program under chapter 178 is \"reemployment assistance training.\"\n(d) An applicant is in reemployment assistance training only if the training course has actually started or is scheduled to start within 30 calendar days.\nA \"staffing service\" is an employer whose business involves employing individuals directly for the purpose of furnishing temporary assignment workers to support or supplement the workforce of the business that is a client of the staffing service.\n\"State\" and \"United States\" includes, in addition to the states of the United States, the Commonwealth of Puerto Rico, the District of Columbia, and the Virgin Islands.\n(a) On or before June 30 of each year, the commissioner must calculate, from wage detail reports under section 268.044, the state's average annual wage and the state's average weekly wage in the following manner:\n(1) the sum of the total monthly covered employment reported by all employers for the prior calendar year is divided by 12 to calculate the average monthly covered employment;\n(2) the sum of the total wages paid for all covered employment reported by all employers for the prior calendar year is divided by the average monthly covered employment to calculate the state's average annual wage; and\n(3) the state's average annual wage is divided by 52 to calculate the state's average weekly wage.\n(b) For purposes of calculating the amount of taxable wages under subdivision 24, the state's average annual wage applies to the calendar year following the calculation.\n(c) For purposes of calculating the state's maximum weekly unemployment benefit amount available on any benefit account under section 268.07, subdivision 2a, the state's average weekly wage applies to the one-year period beginning the last Sunday in October of the calendar year of the calculation.\n(d) For purposes of calculating the wage credits necessary to establish a benefit account under section 268.07, subdivision 2, the state's average weekly wage applies to the one-year period beginning the last Sunday in October of the calendar year of the calculation.\n(a) Suitable employment means employment in the applicant's labor market area that is reasonably related to the applicant's qualifications. In determining whether any employment is suitable for an applicant, the degree of risk involved to the health and safety, physical fitness, prior training, experience, length of unemployment, prospects for securing employment in the applicant's customary occupation, and the distance of the employment from the applicant's residence is considered.\n(b) In determining what is suitable employment, primary consideration is given to the temporary or permanent nature of the applicant's separation from employment and whether the applicant has favorable prospects of finding employment in the applicant's usual or customary occupation at the applicant's past wage level within a reasonable period of time.\nIf prospects are unfavorable, employment at lower skill or wage levels is suitable if the applicant is reasonably suited for the employment considering the applicant's education, training, work experience, and current physical and mental ability.\nThe total compensation must be considered, including the wage rate, hours of employment, method of payment, overtime practices, bonuses, incentive payments, and fringe benefits.\n(c) When potential employment is at a rate of pay lower than the applicant's former rate, consideration must be given to the length of the applicant's unemployment and the proportion of difference in the rates. Employment that may not be suitable because of lower wages during the early weeks of the applicant's unemployment may become suitable as the duration of unemployment lengthens.\n(d) For an applicant seasonally unemployed, suitable employment includes temporary work in a lower skilled occupation that pays average gross weekly wages equal to or more than 150 percent of the applicant's weekly unemployment benefit amount.\n(e) If a majority of the applicant's weeks of employment in the base period includes part-time employment, part-time employment in a position with comparable skills and comparable hours that pays comparable wages is suitable employment.\nFull-time employment is not suitable employment for an applicant if a majority of the applicant's weeks of employment in the base period includes part-time employment.\n(f) To determine suitability of employment in terms of shifts, the arrangement of hours in addition to the total number of hours is to be considered. Employment on a second, third, rotating, or split shift is suitable employment if it is customary in the occupation in the labor market area.\n(g) Employment is not suitable if:\n(1) the position offered is vacant because of a labor dispute;\n(2) the wages, hours, or other conditions of employment are less favorable than those prevailing for similar employment in the labor market area; or\n(3) as a condition of becoming employed, the applicant would be required to join a company union or to resign from or refrain from joining any labor organization.\n(h) A job assignment with a staffing service is suitable only if 25 percent or more of the applicant's wage credits are from job assignments with clients of a staffing service and the job assignment meets the definition of suitable employment under paragraph (a).\n(a) \"Taxable wages\" means those wages paid to an employee in covered employment each calendar year up to an amount equal to 60 percent of the state's average annual wage, rounded to the nearest $1,000.\n(b) Taxable wages includes the amount of wages paid for covered employment by the employer's predecessor when there has been an experience rating history transfer under section 268.051, subdivision 4.\n\"Taxes\" means the money payments required by the Minnesota Unemployment Insurance Law to be paid into the trust fund by an employer on account of paying wages to employees in covered employment.\n[Renumbered subd 25c]\nIn the trucking and messenger/courier industries, an operator of a car, van, truck, tractor, or truck-tractor that is licensed and registered by a governmental motor vehicle agency is an employee unless each of the following factors is present, and if each factor is present, the operator is an independent contractor:\n(1) the individual owns the equipment or holds it under a lease arrangement;\n(2) the individual is responsible for the maintenance of the equipment;\n(3) the individual is responsible for the operating costs, including fuel, repairs, supplies, vehicle insurance, and personal expenses. The individual may be paid the carrier's fuel surcharge and incidental costs, including, but not limited to, tolls, permits, and lumper fees;\n(4) the individual is responsible for supplying the necessary personal services to operate the equipment;\n(5) the individual's compensation is based on factors related to the work performed, such as a percentage of any schedule of rates, and not on the basis of the hours or time expended;\n(6) the individual enters into a written contract that specifies the relationship to be that of an independent contractor and not that of an employee; and\n(7) the individual substantially controls the means and manner of performing the services, in conformance with regulatory requirements and specifications of the shipper.\n\"Trust fund\" means the Minnesota unemployment insurance trust fund established by section 268.194.\nAn applicant is \"unemployed\" in any week that:\n(1) the applicant performs less than 32 hours of service in employment, covered employment, noncovered employment, self-employment, or volunteer work; and\n(2) any earnings with respect to that week are less than the applicant's weekly unemployment benefit amount.\n\"Unemployment benefits\" means the money payments portion of the Minnesota unemployment insurance program available to an applicant.\n\"Wage credits\" mean the amount of wages paid within an applicant's base period for covered employment.\n\"Wage detail report\" means the report on each employee in covered employment required from an employer on a calendar quarter basis under section 268.044.\n(a) \"Wages\" means all compensation for employment, including commissions; bonuses, awards, and prizes; severance payments; standby pay; vacation and holiday pay; back pay as of the date of payment; tips and gratuities paid to an employee by a customer of an employer and accounted for by the employee to the employer; sickness and accident disability payments, except as otherwise provided in this subdivision; and the cash value of housing, utilities, meals, exchanges of services, and any other goods and services provided to compensate an employee, except:\n(1) the amount of any payment made to, or on behalf of, an employee under a plan established by an employer that makes provision for employees generally or for a class or classes of employees, including any amount paid by an employer for insurance or annuities, or into a plan, to provide for a payment, on account of (i) retirement or (ii) medical and hospitalization expenses in connection with sickness or accident disability, or (iii) death;\n(2) the payment by an employer of the tax imposed upon an employee under United States Code, title 26, section 3101 of the Federal Insurance Contribution Act, with respect to compensation paid to an employee for domestic employment in a private household of the employer or for agricultural employment;\n(3) any payment made to, or on behalf of, an employee or beneficiary (i) from or to a trust described in United States Code, title 26, section 401(a) of the federal Internal Revenue Code, that is exempt from tax under section 501(a) at the time of the payment unless the payment is made to an employee of the trust as compensation for services as an employee and not as a beneficiary of the trust, or (ii) under or to an annuity plan that, at the time of the payment, is a plan described in section 403(a);\n(4) the value of any special discount or markdown allowed to an employee on goods purchased from or services supplied by the employer where the purchases are optional and do not constitute regular or systematic payment for services;\n(5) customary and reasonable directors' fees paid to individuals who are not otherwise employed by the corporation of which they are directors;\n(6) the payment to employees for reimbursement of meal expenses when employees are required to perform work after their regular hours;\n(7) the payment into a trust or plan for purposes of providing legal or dental services if provided for all employees generally or for a class or classes of employees;\n(8) the value of parking facilities provided or paid for by an employer, in whole or in part, if provided for all employees generally or for a class or classes of employees;\n(9) royalties to an owner of a franchise, license, copyright, patent, oil, mineral, or other right;\n(10) advances or reimbursements for traveling or other ordinary and necessary expenses incurred or reasonably expected to be incurred in the business of the employer. Traveling and other reimbursed expenses must be identified either by making separate payments or by specifically indicating the separate amounts where both wages and expense allowances are combined in a single payment;\n(11) residual payments to radio, television, and similar artists that accrue after the production of television commercials, musical jingles, spot announcements, radio transcriptions, film sound tracks, and similar activities;\n(12) the income to a former employee resulting from the exercise of a nonqualified stock option;\n(13) supplemental unemployment benefit payments under a plan established by an employer, if the payment is not wages under the Federal Unemployment Tax Act. The payments are wages unless made solely for the supplementing of weekly state or federal unemployment benefits. Supplemental unemployment benefit payments may not be assigned, nor may any consideration be required from the applicant, other than a release of claims in order to be excluded from wages;\n(14) sickness or accident disability payments made by the employer after the expiration of six calendar months following the last calendar month that the individual worked for the employer;\n(15) disability payments made under the provisions of any workers' compensation law;\n(16) sickness or accident disability payments made by a third-party payer such as an insurance company; or\n(17) payments made into a trust fund, or for the purchase of insurance or an annuity, to provide for sickness or accident disability payments to employees under a plan or system established by the employer that provides for the employer's employees generally or for a class or classes of employees.\n(b) Nothing in this subdivision excludes from the term \"wages\" any payment made under any type of salary reduction agreement, including payments made under a cash or deferred arrangement and cafeteria plan, as defined in United States Code, title 26, sections 401(k) and 125 of the federal Internal Revenue Code, to the extent that the employee has the option to receive the payment in cash.\n(c) Wages includes the total payment to the operator and supplier of a vehicle or other equipment where the payment combines compensation for personal services as well as compensation for the cost of operating and hiring the equipment in a single payment. This paragraph does not apply if:\n(1) there is a preexisting written agreement providing for allocation of specific amounts; or\n(2) at the time of each payment there is a written acknowledgment indicating the separate allocated amounts.\n(d) Wages includes payments made for services as a caretaker. Unless there is a contract or other proof to the contrary, compensation is considered as being equally received by a married couple where the employer makes payment to only one spouse, or by all tenants of a household who perform services where two or more individuals share the same dwelling and the employer makes payment to only one individual.\n(e) Wages includes payments made for services by a migrant family. Where services are performed by a married couple or a family and an employer makes payment to only one individual, each worker is considered as having received an equal share of the compensation unless there is a contract or other proof to the contrary.\n(f) Wages includes advances or draws against future earnings, when paid, unless the payments are designated as a loan or return of capital on the books of the employer at the time of payment.\n(g) Wages includes payments made by a subchapter \"S\" corporation, as organized under the Internal Revenue Code, to or on behalf of officers and shareholders that are reasonable compensation for services performed for the corporation.\nFor a subchapter \"S\" corporation, wages does not include:\n(1) a loan for business purposes to an officer or shareholder evidenced by a promissory note signed by an officer before the payment of the loan proceeds and recorded on the books and records of the corporation as a loan to an officer or shareholder;\n(2) a repayment of a loan or payment of interest on a loan made by an officer to the corporation and recorded on the books and records of the corporation as a liability;\n(3) a reimbursement of reasonable corporation expenses incurred by an officer and documented by a written expense voucher and recorded on the books and records of the corporation as corporate expenses; and\n(4) a reasonable lease or rental payment to an officer who owns property that is leased or rented to the corporation.\n(a) \"Wages paid\" means the amount of wages:\n(1) that have been actually paid; or\n(2) that have been credited to or set apart so that payment and disposition is under the control of the employee.\n(b) Wage payments delayed beyond the regularly scheduled pay date are \"wages paid\" on the missed pay date. Back pay is \"wages paid\" on the date of actual payment. Any wages earned but not paid with no scheduled date of payment are \"wages paid\" on the last day of employment.\n(c) Wages paid does not include wages earned but not paid except as provided for in this subdivision.\n\"Week\" means calendar week, ending at midnight Saturday.\n\"Weekly unemployment benefit amount\" means the amount of unemployment benefits computed under section 268.07, subdivision 2a.",
	"repealed": false
}