{
	"id": "182A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/182A.03",
	"title": "182A.03 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Accredited college or university\" means a college or university that is accredited by one of the following regional accrediting agencies: Middle States Association of Schools and Colleges, New England Association of Schools and Colleges, North Central Association of Colleges and Schools, Northwest Association of Schools and Colleges, Southern Association of Colleges and Schools, or Western Association of Colleges and Schools. A college or university that is located outside the United States is accredited if it is accredited by an agency within the jurisdiction of the college or university that has accreditation standards that are at least equal to the standards of the regional accrediting agencies.\n\"American Board of Industrial Hygiene\" or \"ABIH\" is the nonprofit corporation established to improve the practice and educational standards of the profession of industrial hygiene by certifying individuals who meet its education, experience, and examination requirements.\n\"Associate safety professional\" or \"ASP\" is an individual who has received the designation associate safety professional from the Board of Certified Safety Professionals and whose recognition has not lapsed or been revoked.\n\"Board of Certified Safety Professionals\" or \"BCSP\" is the nonprofit corporation established to improve the practice and education standards of the profession of safety by certifying individuals who meet its education, experience, examination, and maintenance requirements.\n\"Certified industrial hygienist\" or \"CIH\" is an individual who has received the designation certified industrial hygienist from the American Board of Industrial Hygiene and whose certification has not lapsed or been revoked.\n\"Certified safety professional\" or \"CSP\" is an individual who has received the designation certified safety professional from the Board of Certified Safety Professionals and whose certification has not lapsed or been revoked.\n\"Construction health and safety technologist\" or \"CHST\" is an individual who has been designated a construction health and safety technologist through joint certification by the American Board of Industrial Hygiene and the Board of Certified Safety Professionals and whose certification has not lapsed or been revoked.\n\"Industrial hygiene\" means the science and art devoted to control of those environmental factors and stresses arising in or from the workplace that may cause sickness, impaired health and well-being, or significant discomfort and inefficiency among workers and the general community.\n\"Industrial hygienist in training\" or \"IHIT\" means an individual who has been designated industrial hygienist in training by the American Board of Industrial Hygiene whose designation has not lapsed or been revoked.\n\"Occupational health and safety technologist\" or \"OHST\" means an individual who has been designated an occupational health and safety technologist through joint certification by the American Board of Industrial Hygiene and the Board of Certified Safety Professionals and whose certification has not lapsed or been revoked.\n\"Safety profession\" means the science and art of hazard controls.",
	"repealed": false
}