{
	"id": "347.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.59",
	"title": "347.59 STANDARDS OF CARE.",
	"text": "(a) A commercial breeder must comply with chapters 343 and 346.\n(b) A commercial breeder must ensure that animals that are part of the commercial breeder's breeding business operations are cared for as follows:\n(1) cats must not be housed in outdoor confinement areas;\n(2) animals exercised in groups must be compatible and show no signs of contagious or infectious disease;\n(3) females in estrus must not be housed in the same confinement area with unneutered males, except for breeding purposes;\n(4) animals must be provided daily enrichment and must be provided positive physical contact with human beings and compatible animals at least twice daily unless a veterinarian determines such activities would adversely affect the health or well-being of the animal;\n(5) animals must not be sold, traded, or given away before the age of eight weeks unless a veterinarian determines it would be in the best interests of the health or well-being of the animal;\n(6) the commercial breeder must provide identification and tracking for each animal, which is not transferable to another animal; and\n(7) the commercial breeder must provide adequate staff to maintain the facility and observe each animal daily to monitor each animal's health and well-being, and to properly care for the animals.\n(c) A commercial breeder must not knowingly hire staff or independent contractors who have been convicted of cruelty to animals under the law of any jurisdiction.\n(d) A commercial breeder must comply with any additional standards the board considers necessary to protect the public health and welfare of animals covered under sections 347.57 to 347.61. The standards must be established by rule.\n(e) A United States Department of Agriculture (USDA) licensed breeder or dealer who is in compliance with the minimum USDA regulations governing the license holder as they relate to animal confinement areas as of July 1, 2014, does not have to comply with the minimum confinement area measurements under section 346.39, subdivision 4, for existing confinement areas in each facility the breeder or dealer owns. If a USDA-licensed breeder or dealer builds a new confinement area after July 1, 2014, those minimum standards must meet or exceed the minimum specifications as they relate to confinement area size under section 346.39, subdivision 4.",
	"repealed": false
}