{
	"id": "480A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/480A.10",
	"title": "480A.10 FURTHER REVIEW IN SUPREME COURT.",
	"text": "The supreme court may grant further review of any decision of the court of appeals upon the petition of any party. In determining whether to grant such a petition, the supreme court should take into consideration whether the question presented is an important one upon which the court has not, but should rule, whether the court of appeals has held a statute to be unconstitutional, whether the court of appeals has decided a question in direct conflict with an applicable precedent of the supreme court, or whether the lower courts have so far departed from the accepted and usual course of justice as to call for an exercise of the court's supervisory powers. The supreme court shall issue its decision whether to grant a petition for review within 60 days of the date the petition is filed.\n(a) The supreme court may grant accelerated review of any case pending in the court of appeals upon the petition of any party. The supreme court shall establish rules for petitions. The petition should be granted only upon a showing that the case is of such imperative public importance as to justify the deviation from normal appellate processes and to require immediate settlement in the supreme court. Making a petition for accelerated review does not stay proceedings or extend time in the court of appeals. If accelerated review is granted, the case shall be transferred to the supreme court without decision in the court of appeals.\n(b) Upon its own motion or upon the certification of the court of appeals, the supreme court may provide for accelerated review of any case if (1) the question presented is an important one upon which the court has not, but should rule, (2) the lower courts have held a statute to be unconstitutional, or (3) the lower courts have so far departed from the accepted and usual course of justice as to call for an exercise of the court's supervisory powers.\nThe Rules of Appellate Procedure shall prescribe the form for petitions for further or accelerated review, and the time for filing them.",
	"repealed": false
}