{
	"id": "515B.3-1141",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-1141",
	"title": "515B.3-1141 REPLACEMENT RESERVES.",
	"text": "(a) The association shall include in its annual budgets replacement reserves projected by the board to be adequate, together with past and future contributions to replacement reserves, to fund the replacement of those components of the common interest community which the association is obligated to replace by reason of ordinary wear and tear or obsolescence, subject to the following:\n(1) The amount annually budgeted for replacement reserves shall be adequate, together with past and future contributions to replacement reserves, to replace the components as determined based upon the estimated remaining useful life of each component; provided that portions of replacement reserves need not be segregated for the replacement of specific components.\n(2) Unless otherwise required by the declaration, annual budgets need not include reserves for the replacement of (i) components that a remaining useful life of more than 30 years, or (ii) components whose replacement will be funded by assessments authorized under section 515B.3-1151(e)(1), or approved in compliance with clause (5).\n(3) The association shall keep the replacement reserves in an account or accounts separate from the association's operating funds, and shall not use or borrow from the replacement reserves to fund the association's operating expenses, provided that this restriction shall not affect the association's authority to pledge the replacement reserves as security for a loan to the association.\n(4) The association shall reevaluate the adequacy of its budgeted replacement reserves at least every third year after the recording of the declaration creating the common interest community.\n(5) Unless otherwise required by the declaration, after the termination of the period of declarant control, and subject to approval by (i) the board, and (ii) unit owners, other than the declarant or its affiliates, of units to which 51 percent of the votes in the association are allocated, the association need not annually assess for replacement reserves to replace those components whose replacement is planned to be paid for by special assessments, if the declaration authorizes special assessments, or by assessments levied under section 515B.3-1151(e)(2). The approval provided for in the preceding sentence shall be effective for no more than the association's current and three following fiscal years, subject to modification or renewal by the same approval standards.\n(6) Unless otherwise required by the declaration, subsection (a) shall not apply to a common interest community which is restricted to nonresidential use.\n(b) Unless the declaration provides otherwise, any surplus funds that the association has remaining after payment of or provision for common expenses and reserves shall be (i) credited to the unit owners to reduce their future common expense assessments or (ii) credited to reserves, or any combination thereof, as determined by the board of directors.\n(c) This section applies to common interest communities only for their fiscal years commencing on or after January 1, 2012.",
	"repealed": false
}