{
	"id": "297B.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/297B.035",
	"title": "297B.035 VEHICLE PURCHASED BY DEALER OR LESSOR.",
	"text": "Except as provided in this section, motor vehicles purchased solely for resale in the ordinary course of business by any motor vehicle dealer, as defined in section 168.002, subdivision 6, who is licensed under section 168.27, subdivision 2 or 3, including vehicles which bear dealer plates as authorized by section 168.27, subdivision 16, shall be exempt from the provisions of this chapter.\nMotor vehicles which satisfy the definitions of subdivision 1, shall be taxed at a yearly rate of $15 per dealer plate. This tax shall be paid when dealer plates, tabs, or stickers are purchased and shall be deposited in the state treasury and credited as provided in section 297B.09. This tax shall be in lieu of any other state sales, excise, or use tax.\nMotor vehicles sold in contravention of section 168.27, subdivision 2, paragraph (a); 3; 6; or 10, paragraph (a), clause (1), item (ii), shall not be considered to have been acquired or purchased for resale in the ordinary or regular course of business for the purposes of this chapter, and the seller shall be required to pay the excise tax due on the purchase of those vehicles. The sale by a lessor of a new motor vehicle under lease within 120 days of the commencement of the lease is deemed a sale in contravention of section 168.27, subdivision 10, paragraph (a), clause (1), item (ii), unless the lessor holds a valid contract or franchise with the manufacturer or distributor of the vehicle. Notwithstanding section 297B.11, the rights of a dealer to appeal any amounts owed by the dealer under this subdivision are governed exclusively by the hearing procedure under section 168.27, subdivision 13.\nMotorized bicycles, as defined in section 168.002, subdivision 20, purchased for resale in the ordinary course of business shall be exempt from the provisions of this chapter if the person purchasing the motorized bicycles has a permanent enclosed commercial building or structure either owned in fee or leased and is engaged in the business of selling motorized bicycles, either exclusively or in addition to any other occupation.\nIf a motor vehicle dealer uses a vehicle, purchased for resale in the ordinary course of business, other than for demonstration purposes, the dealer may elect to pay the motor vehicle sales tax under this chapter or the use tax under chapter 297A based on the reasonable rental value of the vehicle. If the motor vehicle dealer fails to report the use tax under chapter 297A, it is presumed that the dealer elected to pay the motor vehicle sales tax under this chapter.",
	"repealed": false
}