{
	"id": "149A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.09",
	"title": "149A.09 DENIAL; REFUSAL TO REISSUE; REVOCATION; SUSPENSION; LIMITATION OF LICENSE, REGISTRATION, OR PERMIT.",
	"text": "The regulatory agency may deny, refuse to renew, revoke, or suspend any license, registration, or permit applied for or issued pursuant to this chapter when the person subject to regulation under this chapter:\n(1) does not meet or fails to maintain the minimum qualification for holding a license, registration, or permit under this chapter;\n(2) submits false or misleading material information to the regulatory agency in connection with a license, registration, or permit issued by the regulatory agency or the application for a license, registration, or permit;\n(3) violates any law, rule, order, stipulation agreement, settlement, compliance agreement, license, registration, or permit that regulates the removal, preparation, transportation, arrangements for disposition, or final disposition of dead human bodies in Minnesota or any other state in the United States;\n(4) is convicted of a crime, including a finding or verdict of guilt, an admission of guilt, or a no contest plea in any court in Minnesota or any other jurisdiction in the United States. \"Conviction,\" as used in this subdivision, includes a conviction for an offense which, if committed in this state, would be deemed a felony or gross misdemeanor without regard to its designation elsewhere, or a criminal proceeding where a finding or verdict of guilty is made or returned, but the adjudication of guilt is either withheld or not entered;\n(5) is convicted of a crime, including a finding or verdict of guilt, an admission of guilt, or a no contest plea in any court in Minnesota or any other jurisdiction in the United States that the regulatory agency determines is reasonably related to the removal, preparation, transportation, arrangements for disposition or final disposition of dead human bodies, or the practice of mortuary science;\n(6) is adjudicated as mentally incompetent, mentally ill, developmentally disabled, or mentally ill and dangerous to the public;\n(7) has a conservator or guardian appointed;\n(8) fails to comply with an order issued by the regulatory agency or fails to pay an administrative penalty imposed by the regulatory agency;\n(9) owes uncontested delinquent taxes in the amount of $500 or more to the Minnesota Department of Revenue, or any other governmental agency authorized to collect taxes anywhere in the United States;\n(10) is in arrears on any court ordered family or child support obligations; or\n(11) engages in any conduct that, in the determination of the regulatory agency, is unprofessional as prescribed in section 149A.70, subdivision 7, or renders the person unfit to practice mortuary science or to operate a funeral establishment or crematory.\nIf the regulatory agency proposes to deny renewal, suspend, or revoke a license, registration, or permit issued under this chapter, the regulatory agency must first notify, in writing, the person against whom the action is proposed to be taken and provide an opportunity to request a hearing under the contested case provisions of sections 14.57 to 14.62. If the subject of the proposed action does not request a hearing by notifying the regulatory agency, by mail, within 20 calendar days after the receipt of the notice of proposed action, the regulatory agency may proceed with the action without a hearing and the action will be the final order of the regulatory agency.\nA judicial review of the final order issued by the regulatory agency may be requested in the manner prescribed in sections 14.63 to 14.69. Failure to request a hearing pursuant to subdivision 2 shall constitute a waiver of the right to further agency or judicial review of the final order.\nThe regulatory agency may, where the facts support such action, place reasonable limitations or qualifications on the right to practice mortuary science, to operate a funeral establishment or crematory, or to perform activities or actions permitted under this chapter.\nThe regulatory agency may, where there is sufficient reason, restore a license, registration, or permit that has been revoked, reduce a period of suspension, or remove limitations or qualifications.",
	"repealed": false
}