{
	"id": "268B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.01",
	"title": "268B.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given.\n\"Active duty\" has the meaning given in United States Code, title 29, section 2611(14), and includes domestic deployment.\n\"Applicant\" means an individual or the individual's authorized representative applying for leave with benefits under this chapter.\n\"Applicant's average weekly wage\" means an amount equal to the applicant's high quarter wage credits divided by 13.\n\"Authorized representative\" means an individual designated by the person or the individual's legal representative to act on their behalf. This individual may be a family member, guardian, or other individual designated by the person or the individual's legal representative, if any, to assist in purchasing and arranging for supports. For the purposes of this chapter, an authorized representative must be at least 18 years of age.\n(a) \"Base period,\" unless otherwise provided in this subdivision, means the most recent four completed calendar quarters before the effective date of an applicant's application for family or medical leave benefits if the application has an effective date occurring after the month following the most recent completed calendar quarter. The base period under this paragraph is as follows:\n(b) If an application for family or medical leave benefits has an effective date that is during the month following the most recent completed calendar quarter, then the base period is the first four of the most recent five completed calendar quarters before the effective date of an applicant's application for family or medical leave benefits. The base period under this paragraph is as follows:\n(c) Regardless of paragraph (a), a base period of the first four of the most recent five completed calendar quarters must be used if the applicant would have more wage credits under that base period than under a base period of the four most recent completed calendar quarters.\n(d) If the applicant has insufficient wage credits to establish a benefit account under a base period of the four most recent completed calendar quarters, or a base period of the first four of the most recent five completed calendar quarters, but during either base period the applicant received workers' compensation for temporary disability under chapter 176 or a similar federal law or similar law of another state, or if the applicant whose own serious illness caused a loss of work for which the applicant received compensation for loss of wages from some other source, the applicant may request a base period as follows:\n(1) if an applicant was compensated for a loss of work of seven to 13 weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent six completed calendar quarters before the effective date of the application for family or medical leave benefits;\n(2) if an applicant was compensated for a loss of work of 14 to 26 weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent seven completed calendar quarters before the effective date of the application for family or medical leave benefits;\n(3) if an applicant was compensated for a loss of work of 27 to 39 weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent eight completed calendar quarters before the effective date of the application for family or medical leave benefits; and\n(4) if an applicant was compensated for a loss of work of 40 or more weeks during a base period referred to in paragraph (a) or (b), then the base period is the first four of the most recent nine completed calendar quarters before the effective date of the application for family or medical leave benefits.\n(e) For an applicant under a private plan as provided in section 268B.10, the base period is those most recent four quarters in which wage credits were earned. If an employer does not have four quarters of wage detail information, the employer must accept an employee's certification of wage credits, based on the employee's records. If the employee does not provide certification of additional wage credits, the employer may use a base period that consists of all available quarters.\n(f) The base period is calculated once during the benefit year.\n\"Benefit\" or \"benefits\" means monetary payments under this chapter associated with qualifying bonding, family care, medical care related to pregnancy, serious health condition, qualifying exigency, or safety leave events, unless otherwise indicated by context.\n\"Benefit account\" means a benefit account established under section 268B.04.\n(a) Except as provided in paragraphs (b) to (d), \"benefit year\" means the period of 52 calendar weeks beginning the effective date of leave under section 268B.04 is effective. For an effective date of leave that is any January 1, April 1, July 1, or October 1, the benefit year will be a period of 53 calendar weeks.\n(b) For an individual with multiple employers participating in the state plan, \"benefit year\" means the period of 52 calendar weeks beginning the date an effective date of leave under section 268B.04 is effective for any of the multiple employers.\n(c) For a private plan under section 268B.10, \"benefit year\" means:\n(1) a calendar year;\n(2) any fixed 12-month period, such as a fiscal year or a 12-month period measured forward from an employee's first date of employment;\n(3) a 12-month period measured forward from an employee's first day of leave taken; or\n(4) a rolling 12-month period measured backward from an employee's first day of leave taken.\nEmployers are required to notify employees of their benefit year within 30 days of the private plan approval and first day of employment.\n(d) For individuals with multiple employers with at least one employer participating in the state plan and at least one employer participating in a private plan:\n(1) for the employer or employers participating in the state plan, \"benefit year\" means the period of 52 calendar weeks beginning the effective date of leave is effective for any employer; and\n(2) the employer or employers participating in a private plan may define their benefit year according to paragraph (c).\n\"Bonding\" means time spent by an applicant who is a biological, adoptive, or foster parent with a biological, adopted, or foster child in conjunction with the child's birth, adoption, or placement.\n\"Calendar day\" or \"day\" means a fixed 24-hour period corresponding to a single calendar date.\n\"Calendar quarter\" means the period of three consecutive calendar months ending on March 31, June 30, September 30, or December 31.\n\"Calendar week\" has the same meaning as \"week\" under subdivision 49.\n\"Commissioner\" means the commissioner of employment and economic development, unless otherwise indicated by context.\n\"Construction industry\" means any construction, reconstruction, building erection, alteration, remodel, repair, renovation, rehabilitation, excavation, or demolition of any building, structure, facility utility, power plant, sewer, dam, highway, road, street, airport, bridge, or other improvement.\n(a) \"Covered employment\" means performing services of whatever nature, unlimited by the relationship of master and servant as known to the common law, or any other legal relationship performed for wages or under any contract calling for the performance of services, written or oral, express or implied.\n(b) For the purposes of this chapter, covered employment means an employee's entire employment during a calendar year if:\n(1) 50 percent or more of the employment during the calendar year is performed in Minnesota; or\n(2) 50 percent or more of the employment during the calendar year is not performed in Minnesota or any other single state within the United States, or United States territory or foreign nation, but some of the employment is performed in Minnesota and the employee's residence is in Minnesota during 50 percent or more of the calendar year.\n(c) \"Covered employment\" does not include:\n(1) a self-employed individual;\n(2) an independent contractor; or\n(3) employment by a seasonal employee, as defined in subdivision 35.\n(d) Entities that are excluded under this section may opt in to coverage following a procedure determined by the commissioner. In such cases, services provided by employees are considered covered employment under subdivision 15.\n(e) The commissioner may adopt rules in accordance with chapter 14 to:\n(1) further define the application of this subdivision; and\n(2) establish the criteria for covered employment for individuals that do not meet the criteria in paragraphs (a) and (b), but that perform services as an employee to a Minnesota employer.\n\"Covered individual\" means either:\n(1) an applicant who meets the financial eligibility requirements of section 268B.04, subdivision 2, if services provided are covered employment under subdivision 15; or\n(2) a self-employed individual or independent contractor who has elected coverage under section 268B.11 and who meets the financial eligibility requirements under section 268B.11.\n\"Effective date of application\" means the date on which an application is submitted to the department.\n\"Effective date of leave\" means the date of first absence associated with a leave under section 268B.09.\n\"Department\" means the Department of Employment and Economic Development, unless otherwise indicated by context.\n(a) \"Employee\" means an individual who performs services of whatever nature for an employer.\n(b) Employee does not include employees of the United States of America, self-employed individuals, or independent contractors.\n(c) Employee does not include seasonal employees as defined in subdivision 35.\n(a) \"Employer\" means:\n(1) any person, type of organization, or entity, including any partnership, association, trust, estate, joint stock company, insurance company, limited liability company, or corporation, whether domestic or foreign, or the receiver, trustee in bankruptcy, trustee, or the legal representative of a deceased person, having any individual in covered employment;\n(2) the state, state agencies, Minnesota State Colleges and Universities, University of Minnesota, and other statewide public systems;\n(3) any municipality or local government entity, including but not limited to a county, city, town, school district, Metropolitan Council, Metropolitan Airports Commission, housing and redevelopment authority, port authority, economic development authority, sports facilities authority, board or commission, joint powers board or organization created under section 471.59, destination medical center corporation, municipal corporation, quasimunicipal corporation, or other political subdivision. An employer also includes charter schools; and\n(4) the taxpaying employer as described in section 268.046, subdivision 1.\n(b) Employer does not include:\n(1) the United States of America; or\n(2) a self-employed individual who has elected and been approved for coverage under section 268B.11 with regard to the self-employed individual's own coverage and benefits.\n\"Estimated self-employment income\" means a self-employed individual's net earnings from self-employment in the most recent taxable year.\n\"Family and medical benefit insurance account\" means the family and medical benefit insurance account in the special revenue fund in the state treasury under section 268B.02.\n\"Family benefit program\" means the program administered under this chapter for the collection of premiums and payment of benefits related to family care, bonding, safety leave, and leave related to a qualifying exigency.\n\"Family care\" means an applicant caring for a family member with a serious health condition or caring for a family member who is a military member.\n(a) \"Family member\" means, with respect to an applicant:\n(1) a spouse or domestic partner;\n(2) a child, including a biological child, adopted child, foster child, stepchild, child of a domestic partner, or child to whom the applicant stands in loco parentis, is a legal guardian, or is a de facto custodian;\n(3) a parent or legal guardian of the applicant;\n(4) a sibling;\n(5) a grandchild;\n(6) a grandparent or spouse's grandparent;\n(7) a son-in-law or daughter-in-law; and\n(8) an individual who has a personal relationship with the applicant that creates an expectation and reliance that the applicant care for the individual without compensation, whether or not the applicant and the individual reside together.\n(b) For the purposes of this chapter, \"grandchild\" means a child of the applicant's child.\n(c) For the purposes of this chapter, \"grandparent\" means a parent of the applicant's parent.\n(d) For the purposes of this chapter, \"parent\" means the biological, adoptive, de facto custodian, or foster parent, stepparent, or legal guardian of an applicant or the applicant's spouse, or an individual who stood in loco parentis to an applicant when the applicant was a child.\n\"Financially eligible\" means an applicant meets the requirements established under section 268B.04, subdivision 2.\n\"Health care provider\" means:\n(1) an individual who is licensed, certified, or otherwise authorized under law to practice in the individual's scope of practice as a physician; physician assistant; podiatrist; osteopath; surgeon; advanced practice registered nurse; an alcohol and drug counselor as defined in section 148F.01, subdivision 5; or a mental health professional as defined in section 245I.02, subdivision 27; or\n(2) any other individual determined by the commissioner by rule, in accordance with the rulemaking procedures in the Administrative Procedure Act, to be capable of providing health care services.\n\"High quarter\" means the calendar quarter in an applicant's base period with the highest amount of wage credits.\n\"Incapacity\" means inability to perform regular work, attend school, or perform regular daily activities due to a serious health condition, treatment therefore, or recovery therefrom.\nIf there is an existing specific test or definition for independent contractor in Minnesota statute or rule applicable to an occupation or sector as of May 25, 2023, that test or definition shall apply to that occupation or sector for purposes of this chapter. If there is not an existing test or definition as described, the definition for independent contractor shall be as provided in Minnesota Rules, part 5200.0221.\n\"Initial paid week\" means the first seven days of a leave, which must be paid and is a payable period for leave types including family care, medical care related to pregnancy, serious health condition, qualifying exigency, or safety leave. For intermittent leave, initial paid week means seven consecutive or nonconsecutive, or a combination of consecutive and nonconsecutive, calendar days from the effective date of leave, of which only days when leave is taken are payable. The initial week must be paid retroactively after the applicant has met the seven-day qualifying event under section 268B.06, subdivision 2. A retroactive payment must be included in the first benefit payment to the applicant.\n\"Inpatient care\" means an overnight stay in a hospital, hospice, or residential medical care facility, including any period of incapacity, or any subsequent treatment in connection with such inpatient care.\n\"Maximum weekly benefit amount\" means the state's average weekly wage as calculated under section 268.035, subdivision 23.\n\"Medical benefit program\" means the program administered under this chapter for the collection of premiums and payment of benefits related to an applicant's serious health condition or medical care related to pregnancy.\n\"Medical care related to pregnancy\" includes prenatal care or incapacity due to pregnancy or recovery from childbirth, stillbirth, miscarriage, or related health conditions.\n\"Net earnings from self-employment\" has the meaning given in section 1402 of the Internal Revenue Code, as defined in section 290.01, subdivision 31.\n(a) \"Qualifying exigency\" means a need arising out of a military member's active duty service or notice of an impending call or order to active duty in the United States armed forces, including providing for the care or other needs of the family member's child or other dependent, making financial or legal arrangements for the family member, attending counseling, attending military events or ceremonies, spending time with the family member during a rest and recuperation leave or following return from deployment, or making arrangements following the death of the military member.\n(b) For the purposes of this chapter, a \"military member\" means a current or former member of the United States armed forces, including a member of the National Guard or reserves, who, except for a deceased military member, is a resident of the state and is a family member of the applicant taking leave related to the qualifying exigency.\n\"Safety leave\" means leave from work because of domestic abuse, sexual assault, or stalking of the applicant or applicant's family member, provided the leave is to:\n(1) seek medical attention related to the physical or psychological injury or disability caused by domestic abuse, sexual assault, or stalking;\n(2) obtain services from a victim services organization;\n(3) obtain psychological or other counseling;\n(4) seek relocation due to the domestic abuse, sexual assault, or stalking; or\n(5) seek legal advice or take legal action, including preparing for or participating in any civil or criminal legal proceeding related to, or resulting from, the domestic abuse, sexual assault, or stalking.\n(a) A seasonal employee is an individual who is employed for no more than 150 days during any consecutive 52-week period in hospitality by an employer whose average receipts during any six months of the preceding calendar year were not more than 33 percent of its average receipts for the other six months of such year.\n(b) For the purposes of this section, \"hospitality\" has the meaning given under the collective definitions in section 157.15, subdivisions 4 to 9 and 11 to 14.\n(c) For an individual to be classified as a seasonal employee, an employer must apply to the department in a format and manner prescribed by the commissioner and certify that:\n(1) the employee meets or will meet the 150-day maximum employment duration under this subdivision;\n(2) the employee's primary line of work is hospitality;\n(3) the employer meets the receipts threshold under this subdivision; and\n(4) the employer has provided the required employee notice required under section 268B.26.\n(d) An employer must notify the department, in a format and manner prescribed by the commissioner, within five business days if a previously classified seasonal employee no longer meets the criteria above and is no longer a seasonal employee.\n\"Self-employed individual\" means a resident of the state who, in one taxable year preceding the current calendar year, derived at least 5.3 percent of the state's average annual wage in net earnings from self-employment.\n\"Self-employment premium base\" means the lesser of:\n(1) a self-employed individual's estimated self-employment income for the calendar year plus the individual's self-employment wages in the calendar year; or\n(2) the maximum earnings subject to the FICA Old-Age, Survivors, and Disability Insurance tax in the taxable year.\n\"Self-employment wages\" means the amount of wages that a self-employed individual earned in the calendar year from an entity from which the individual also received net earnings from self-employment.\n(a) \"Serious health condition\" means a physical or mental illness, injury, impairment, condition, or substance use disorder that involves:\n(1) inpatient care in a hospital, hospice, or residential medical care facility, including any period of incapacity; or\n(2) continuing treatment or supervision by a health care provider which includes any one or more of the following:\n(i) a period of incapacity of seven or more days, and any subsequent treatment or period of incapacity relating to the same condition, that also involves:\n(A) treatment two or more times, within 30 days of the first day of incapacity, unless extenuating circumstances beyond the individual's control prevent a follow-up visit from occurring as planned, by a health care provider or by a provider of health care services under orders of, or on referral by, a health care provider; or\n(B) treatment by a health care provider on at least one occasion that results in a regimen of continuing treatment under the supervision of the health care provider;\n(ii) a period of incapacity due to medical care related to pregnancy;\n(iii) a period of incapacity or treatment for a chronic health condition that:\n(A) requires periodic visits, defined as at least twice a year, for treatment by a health care provider or under orders of, or on referral by, a health care provider;\n(B) continues over an extended period of time, including recurring episodes of a single underlying condition; and\n(C) may cause episodic rather than continuing periods of incapacity;\n(iv) a period of incapacity which is permanent or long term due to a condition for which treatment may not be effective. The applicant or family member must be under the continuing supervision of, but need not be receiving active treatment by, a health care provider; or\n(v) a period of absence to receive multiple treatments, including any period of recovery from the treatments, by a health care provider or by a provider of health care services under orders of, or on referral by, a health care provider, for:\n(A) restorative surgery after an accident or other injury; or\n(B) a condition that would likely result in a period of incapacity of more than seven full calendar days in the absence of medical intervention or treatment.\n(b) For the purposes of paragraph (a), clauses (1) and (2), treatment by a health care provider means an in-person visit or telemedicine visit with a health care provider, or by a provider of health care services under orders of, or on referral by, a health care provider.\n(c) For the purposes of paragraph (a), treatment includes but is not limited to examinations to determine if a serious health condition exists and evaluations of the condition.\n(d) Absences attributable to incapacity under paragraph (a), clause (2), item (ii) or (iii), qualify for leave under this chapter even if the applicant or the family member does not receive treatment from a health care provider during the absence, and even if the absence does not last more than seven consecutive, full calendar days.\n\"State's average weekly wage\" means the weekly wage calculated under section 268.035, subdivision 23.\n(a) \"Supplemental benefit payment\" means:\n(1) a payment made by an employer to an employee as salary continuation or as paid time off. Such a payment must be in addition to any family or medical leave benefits the employee is receiving under this chapter; and\n(2) a payment offered by an employer to an employee who is taking leave under this chapter to supplement the family or medical leave benefits the employee is receiving.\n(b) Employers may, but are not required to, designate certain benefits including but not limited to salary continuation, vacation leave, sick leave, or other paid time off as a supplemental benefit payment.\n(c) Nothing in this chapter requires an employee to receive supplemental benefit payments.\n(d) At no time shall a supplemental benefit payment combined with any leave benefit received under this chapter exceed the regular wage or salary of the applicant.\n\"Taxable year\" has the meaning given in section 290.01, subdivision 9.\n\"Taxable wages\" means those wages paid to an employee in covered employment each calendar year up to an amount equal to the maximum wages subject to premium in a calendar year, which is equal to the maximum earnings in that year subject to the FICA Old-Age, Survivors, and Disability Insurance tax rounded to the nearest $1,000.\n\"Typical workweek\" means the average number of hours worked per week by an employee within the last two quarters prior to the effective date of application.\n\"Wage credits\" means the amount of wages paid within an applicant's base period for covered employment, as defined in subdivision 15.\n\"Wage detail report\" means the report on each employee and all seasonal employees in covered employment required from an employer on a calendar quarter basis under section 268B.12.\n\"Wages\" has the meaning given in section 268.035, subdivision 29.\n(a) \"Wages paid\" means the amount of wages:\n(1) that have been actually paid; or\n(2) that have been credited to or set apart so that payment and disposition is under the control of the employee.\n(b) Wage payments delayed beyond the regularly scheduled pay date are wages paid on the missed pay date. Back pay is wages paid on the date of actual payment. Any wages earned but not paid with no scheduled date of payment are wages paid on the last day of employment.\n(c) Wages paid does not include wages earned but not paid except as provided for in this subdivision.\n\"Week\" means calendar week ending at midnight Saturday.\n\"Weekly benefit amount\" means the amount of family and medical leave benefits computed under section 268B.04.",
	"repealed": false
}