{
	"id": "256.9752",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9752",
	"title": "256.9752 SENIOR NUTRITION PROGRAMS.",
	"text": "It is the goal of all agencies on aging and senior nutrition programs to support the physical and mental health of seniors living in the community by:\n(1) promoting nutrition programs that serve senior citizens in their homes and communities; and\n(2) providing, within the limit of funds available, the support services that will enable the senior citizen to access nutrition programs in the most cost-effective and efficient manner.\n(a) A food delivery support account is established in the special revenue fund. The account consists of funds under section 174.49, subdivision 2, and as provided by law and any other money donated, allotted, transferred, or otherwise provided to the account.\n(b) Money in the account is annually appropriated to the commissioner of human services for grants to nonprofit organizations to provide transportation of home-delivered meals, groceries, purchased food, or a combination, to Minnesotans who are experiencing food insecurity and have difficulty obtaining or preparing meals due to limited mobility, disability, age, or resources to prepare their own meals. A nonprofit organization must have a demonstrated history of providing and distributing food customized for the population that they serve.\n(c) Grant funds under this subdivision must supplement, but not supplant, any state or federal funding used to provide prepared meals to Minnesotans experiencing food insecurity.\nThe Minnesota Board on Aging shall allocate to area agencies on aging the state and federal funds which are received for the senior nutrition programs of congregate dining and home-delivered meals in a manner consistent with federal requirements.\n(a) Funds allocated to an area agency on aging for nutrition support services may be used for the following:\n(1) transportation of home-delivered meals and purchased food and medications to the residence of a senior citizen;\n(2) expansion of home-delivered meals into unserved and underserved areas;\n(3) transportation to supermarkets or delivery of groceries from supermarkets to homes;\n(4) vouchers for food purchases at selected restaurants in isolated rural areas;\n(5) the Supplemental Nutrition Assistance Program (SNAP) outreach;\n(6) transportation of seniors to congregate dining sites;\n(7) nutrition screening assessments and counseling as needed by individuals with special dietary needs, performed by a licensed dietitian or nutritionist; and\n(8) other appropriate services which support senior nutrition programs, including new service delivery models.\n(b) An area agency on aging may transfer unused funding for nutrition support services to fund congregate dining services and home-delivered meals.",
	"repealed": false
}