{
	"id": "31A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/31A.02",
	"title": "31A.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Commissioner\" means the commissioner of agriculture or the commissioner's delegate.\n[Repealed, 1996 c 310 s 1]\n\"Animals\" means cattle, swine, sheep, goats, poultry, farmed Cervidae, as defined in section 35.153, subdivision 3, llamas, as defined in section 17.455, subdivision 2, Ratitae, as defined in section 17.453, subdivision 3, horses, equines, and other domesticated animals.\n\"Custom processing\" means slaughtering, eviscerating, dressing, or processing an animal or processing meat products or poultry products for the owner of the animal or of the meat products and poultry products, if all meat products or poultry products derived from the custom operation are returned to the owner of the animal or of the meat products or poultry products. No person may sell, offer for sale, or possess with intent to sell meat derived from custom processing.\n\"Meat broker\" means a person in the business of buying or selling carcasses, parts of carcasses, meat, meat food products, poultry, or poultry products of animals on commission, or otherwise negotiating purchases or sales of those articles other than for the person's own account or as an employee of another person, firm, or corporation.\n\"Renderer\" means a person in the business of rendering carcasses, or parts or products of the carcasses of animals, except rendering conducted under inspection under sections 31A.01 to 31A.16.\n\"Animal food manufacturer\" means a person in the business of manufacturing or processing animal food derived wholly or in part from animal carcasses or carcass parts or products.\n\"Intrastate commerce\" means commerce within this state.\n\"Meat food product\" or \"poultry food product\" means a product usable as human food and made wholly or in part from meat or poultry or a portion of the carcass of cattle, sheep, swine, poultry, wild game or fowl, farmed Cervidae, as defined in section 35.153, subdivision 3, llamas, as defined in section 17.455, subdivision 2, Ratitae, as defined in section 17.453, subdivision 3, or goats. \"Meat food product\" or \"poultry food product\" does not include products which contain meat, poultry, or other portions of the carcasses of cattle, sheep, swine, wild game or fowl, farmed Cervidae, llamas, Ratitae, or goats only in a relatively small proportion or that historically have not been considered by consumers as products of the meat food industry, and which are exempted from definition as a meat food product or poultry food product by the commissioner under the conditions the commissioner prescribes to assure that the meat or other portions of carcasses contained in the products are not adulterated and that the products are not represented as meat food products or poultry food products.\n\"Meat food product,\" as applied to products of equines, has a meaning comparable to that for cattle, sheep, swine, wild game or fowl, farmed Cervidae, llamas, Ratitae, and goats.\n\"Usable as human food\" means that a carcass, or part or product of a carcass, of an animal (1) is not denatured or otherwise identified as required by rules of the commissioner to deter its use as human food, or (2) is not naturally inedible by humans.\n\"Prepared\" means slaughtered, canned, salted, rendered, boned, cut up, or otherwise manufactured or processed.\n\"Adulterated\" means an item is covered by section 34A.02.\n\"Misbranded\" means an item is covered by section 34A.03.\n\"Label\" has the meaning given in section 34A.01, subdivision 6.\n\"Labeling\" has the meaning given in section 34A.01, subdivision 7.\n\"Federal Meat Inspection Act\" means the Federal Meat Inspection Act.\n\"Federal Poultry Inspection Act\" means the Federal Poultry Products Inspection Act, as amended.\n\"Federal Food, Drug, and Cosmetic Act\" means the Federal Food, Drug, and Cosmetic Act, as amended.\n\"Pesticide chemical,\" \"food additive,\" \"color additive,\" and \"raw agricultural commodity\" have the meanings given them in the Federal Food, Drug, and Cosmetic Act.\n\"Official mark\" means the official inspection legend or other symbol prescribed by rule of the commissioner to identify the status of an article or animal under this chapter.\n\"Official inspection legend\" means a symbol prescribed by rule of the commissioner showing that an article was inspected and passed under this chapter.\n\"Official certificate\" means a certificate prescribed by rule of the commissioner for issuance by an inspector or other person performing official functions under this chapter.\n\"Official device\" means a device prescribed or authorized by the commissioner for use in applying an official mark.\n\"Poultry\" means any domesticated bird, including, but not limited to, chickens, turkeys, ducks, geese, or guineas.",
	"repealed": false
}