{
	"id": "256L.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.12",
	"title": "256L.12 MANAGED CARE.",
	"text": "In order to contain costs, the commissioner of human services shall select vendors of medical care who can provide the most economical care consistent with high medical standards and shall, where possible, contract with organizations on a prepaid capitation basis to provide these services. The commissioner shall consider proposals by counties and vendors for managed care plans and managed care-like entities as defined by the final regulation implementing section 1331 of the Affordable Care Act regarding basic health plans, which may include: prepaid capitation programs, competitive bidding programs, or other vendor payment mechanisms designed to provide services in an economical manner or to control utilization, with safeguards to ensure that necessary services are provided.\nThe commissioner shall designate the geographic areas in which eligible individuals must receive services through managed care plans.\nPersons enrolled in the MinnesotaCare program who reside in the designated geographic areas must enroll in a managed care plan to receive their health care services. Enrollees must receive their health care services from health care providers who are part of the managed care plan provider network, unless authorized by the managed care plan, in cases of medical emergency, or when otherwise required by law or by contract.\nIf only one managed care option is available in a geographic area, the managed care plan may require that enrollees designate a primary care provider from which to receive their health care. Enrollees will be permitted to change their designated primary care provider upon request to the managed care plan. Requests to change primary care providers may be limited to once annually. If more than one managed care plan is offered in a geographic area, enrollees will be enrolled in a managed care plan for up to one year from the date of enrollment, but shall have the right to change to another managed care plan once within the first year of initial enrollment. Enrollees may also change to another managed care plan during an annual 30-day open enrollment period. Enrollees shall be notified of the opportunity to change to another managed care plan before the start of each annual open enrollment period.\nEnrollees may change managed care plans or primary care providers at other than the above designated times for cause as determined through an appeal pursuant to section 256.045.\nAll contracts between the Department of Human Services and prepaid health plans to serve medical assistance and MinnesotaCare recipients must comply with the requirements of United States Code, title 42, section 1396a (a)(23)(B), notwithstanding any waivers authorized by the United States Department of Health and Human Services pursuant to United States Code, title 42, section 1315.\nMinnesotaCare enrollees who become eligible for medical assistance will remain in the same managed care plan if the managed care plan has a contract for that population. Managed care plans must participate in the MinnesotaCare program under a contract with the Department of Human Services in service areas where they participate in the medical assistance program.\nEnrollees are responsible for all co-payments in section 256L.03, subdivision 5, and shall pay co-payments to the managed care plan or to its participating providers. The enrollee is also responsible for payment of inpatient hospital charges which exceed the MinnesotaCare benefit limit.\n(a) The following requirements apply to all counties or vendors who contract with the Department of Human Services to serve MinnesotaCare recipients. Managed care plan contractors:\n(1) shall authorize and arrange for the provision of the full range of services listed in section 256L.03 in order to ensure appropriate health care is delivered to enrollees;\n(2) shall accept the prospective, per capita payment or other contractually defined payment from the commissioner in return for the provision and coordination of covered health care services for eligible individuals enrolled in the program;\n(3) may contract with other health care and social service practitioners to provide services to enrollees;\n(4) shall provide for an enrollee grievance process as required by the commissioner and set forth in the contract with the department;\n(5) shall retain all revenue from enrollee co-payments;\n(6) shall accept all eligible MinnesotaCare enrollees, without regard to health status or previous utilization of health services;\n(7) shall demonstrate capacity to accept financial risk according to requirements specified in the contract with the department. A health maintenance organization licensed under chapter 62D, or a nonprofit health plan licensed under chapter 62C, is not required to demonstrate financial risk capacity, beyond that which is required to comply with chapters 62C and 62D; and\n(8) shall submit information as required by the commissioner, including data required for assessing enrollee satisfaction, quality of care, cost, and utilization of services.\n(b) A health maintenance organization must be a nonprofit corporation organized under chapter 317A to serve as a managed care contractor under this section and section 256L.121.\nThe managed care plan shall be responsible for assessing the need and provision of substance use disorder services according to criteria set forth in section 245G.05.\n(a) Rates will be prospective, per capita, where possible. The commissioner may allow health plans to arrange for inpatient hospital services on a risk or nonrisk basis. The commissioner shall consult with an independent actuary to determine appropriate rates.\n(b) For services rendered on or after January 1, 2004, the commissioner shall withhold five percent of managed care plan payments and county-based purchasing plan payments under this section pending completion of performance targets. Each performance target must be quantifiable, objective, measurable, and reasonably attainable, except in the case of a performance target based on a federal or state law or rule. Criteria for assessment of each performance target must be outlined in writing prior to the contract effective date. Clinical or utilization performance targets and their related criteria must consider evidence-based research and reasonable interventions, when available or applicable to the populations served, and must be developed with input from external clinical experts and stakeholders, including managed care plans, county-based purchasing plans, and providers. The managed care plan must demonstrate, to the commissioner's satisfaction, that the data submitted regarding attainment of the performance target is accurate. The commissioner shall periodically change the administrative measures used as performance targets in order to improve plan performance across a broader range of administrative services. The performance targets must include measurement of plan efforts to contain spending on health care services and administrative activities. The commissioner may adopt plan-specific performance targets that take into account factors affecting only one plan, such as characteristics of the plan's enrollee population. The withheld funds must be returned no sooner than July 1 and no later than July 31 of the following calendar year if performance targets in the contract are achieved.\n(c) For services rendered on or after January 1, 2011, the commissioner shall withhold an additional three percent of managed care plan or county-based purchasing plan payments under this section. The withheld funds must be returned no sooner than July 1 and no later than July 31 of the following calendar year. The return of the withhold under this paragraph is not subject to the requirements of paragraph (b).\n(d) Effective for services rendered on or after January 1, 2011, through December 31, 2011, the commissioner shall include as part of the performance targets described in paragraph (b) a reduction in the plan's emergency room utilization rate for state health care program enrollees by a measurable rate of five percent from the plan's utilization rate for the previous calendar year. Effective for services rendered on or after January 1, 2012, the commissioner shall include as part of the performance targets described in paragraph (b) a reduction in the health plan's emergency department utilization rate for medical assistance and MinnesotaCare enrollees, as determined by the commissioner. For 2012, the reductions shall be based on the health plan's utilization in 2009. To earn the return of the withhold each subsequent year, the managed care plan or county-based purchasing plan must achieve a qualifying reduction of no less than ten percent of the plan's utilization rate for medical assistance and MinnesotaCare enrollees, excluding enrollees in programs described in section 256B.69, subdivisions 23 and 28, compared to the previous measurement year, until the final performance target is reached. When measuring performance, the commissioner must consider the difference in health risk in a managed care or county-based purchasing plan's membership in the baseline year compared to the measurement year, and work with the managed care or county-based purchasing plan to account for differences that they agree are significant.\nThe withheld funds must be returned no sooner than July 1 and no later than July 31 of the following calendar year if the managed care plan or county-based purchasing plan demonstrates to the satisfaction of the commissioner that a reduction in the utilization rate was achieved. The commissioner shall structure the withhold so that the commissioner returns a portion of the withheld funds in amounts commensurate with achieved reductions in utilization less than the targeted amount.\nThe withhold described in this paragraph shall continue for each consecutive contract period until the plan's emergency room utilization rate for state health care program enrollees is reduced by 25 percent of the plan's emergency room utilization rate for medical assistance and MinnesotaCare enrollees for calendar year 2009. Hospitals shall cooperate with the health plans in meeting this performance target and shall accept payment withholds that may be returned to the hospitals if the performance target is achieved.\n(e) Effective for services rendered on or after January 1, 2012, the commissioner shall include as part of the performance targets described in paragraph (b) a reduction in the plan's hospitalization admission rate for medical assistance and MinnesotaCare enrollees, as determined by the commissioner. To earn the return of the withhold each year, the managed care plan or county-based purchasing plan must achieve a qualifying reduction of no less than five percent of the plan's hospital admission rate for medical assistance and MinnesotaCare enrollees, excluding enrollees in programs described in section 256B.69, subdivisions 23 and 28, compared to the previous calendar year, until the final performance target is reached. When measuring performance, the commissioner must consider the difference in health risk in a managed care or county-based purchasing plan's membership in the baseline year compared to the measurement year, and work with the managed care or county-based purchasing plan to account for differences that they agree are significant.\nThe withheld funds must be returned no sooner than July 1 and no later than July 31 of the following calendar year if the managed care plan or county-based purchasing plan demonstrates to the satisfaction of the commissioner that this reduction in the hospitalization rate was achieved. The commissioner shall structure the withhold so that the commissioner returns a portion of the withheld funds in amounts commensurate with achieved reductions in utilization less than the targeted amount.\nThe withhold described in this paragraph shall continue until there is a 25 percent reduction in the hospitals admission rate compared to the hospital admission rate for calendar year 2011 as determined by the commissioner. Hospitals shall cooperate with the plans in meeting this performance target and shall accept payment withholds that may be returned to the hospitals if the performance target is achieved. The hospital admissions in this performance target do not include the admissions applicable to the subsequent hospital admission performance target under paragraph (f).\n(f) Effective for services provided on or after January 1, 2012, the commissioner shall include as part of the performance targets described in paragraph (b) a reduction in the plan's hospitalization rate for a subsequent hospitalization within 30 days of a previous hospitalization of a patient regardless of the reason, for medical assistance and MinnesotaCare enrollees, as determined by the commissioner. To earn the return of the withhold each year, the managed care plan or county-based purchasing plan must achieve a qualifying reduction of the subsequent hospital admissions rate for medical assistance and MinnesotaCare enrollees, excluding enrollees in programs described in section 256B.69, subdivisions 23 and 28, of no less than five percent compared to the previous calendar year until the final performance target is reached.\nThe withheld funds must be returned no sooner than July 1 and no later than July 31 of the following calendar year if the managed care plan or county-based purchasing plan demonstrates to the satisfaction of the commissioner that a reduction in the subsequent hospitalization rate was achieved. The commissioner shall structure the withhold so that the commissioner returns a portion of the withheld funds in amounts commensurate with achieved reductions in utilization less than the targeted amount.\nThe withhold described in this paragraph must continue for each consecutive contract period until the plan's subsequent hospitalization rate for medical assistance and MinnesotaCare enrollees is reduced by 25 percent of the plan's subsequent hospitalization rate for calendar year 2011. Hospitals shall cooperate with the plans in meeting this performance target and shall accept payment withholds that must be returned to the hospitals if the performance target is achieved.\n(g) A managed care plan or a county-based purchasing plan under section 256B.692 may include as admitted assets under section 62D.044 any amount withheld under this section that is reasonably expected to be returned.\nFor services rendered on or after October 1, 2003, the total payment made to managed care plans under the MinnesotaCare program is reduced 1.0 percent. This provision excludes payments for mental health services added as covered benefits after December 31, 2007.\nIn addition to the reduction in subdivision 9a, the total payment made to managed care plans under the MinnesotaCare program shall be reduced for services provided on or after January 1, 2006, to reflect a 6.0 percent reduction in reimbursement for inpatient hospital services.\nEach managed care plan contracting with the Department of Human Services under this section shall collaborate with the local public health agencies to ensure childhood immunization to all enrolled families with children. As part of this collaboration the plan must provide the families with a recommended immunization schedule.\nFor American Indian enrollees of MinnesotaCare, MinnesotaCare shall cover health care services provided at Indian health service facilities and facilities operated by a tribe or tribal organization under funding authorized by United States Code, title 25, sections 450f to 450n, or title III of the Indian Self-Determination and Education Act, Public Law 93-638, if those services would otherwise be covered under section 256L.03. Payments for services provided under this subdivision shall be made on a fee-for-service basis, and may, at the option of the tribe or organization, be made at the rates authorized under sections 256.969, subdivision 16, and 256B.0625, subdivision 34, for those MinnesotaCare enrollees eligible for coverage at medical assistance rates. For purposes of this subdivision, \"American Indian\" has the meaning given to persons to whom services will be provided for in Code of Federal Regulations, title 42, section 36.12.",
	"repealed": false
}