{
	"id": "144G.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.16",
	"title": "144G.16 PROVISIONAL LICENSE.",
	"text": "Beginning August 1, 2021, for new assisted living facility license applicants, the commissioner shall issue a provisional license from one of the licensure categories specified in section 144G.10, subdivision 2. A provisional license is effective for up to one year from the initial effective date of the license, except that a provisional license may be extended according to subdivisions 2, paragraph (d), and 3.\n(a) During the provisional license period, the commissioner shall survey the provisional licensee after the commissioner is notified or has evidence that the provisional licensee is providing assisted living services to at least one resident.\n(b) Within two days of beginning to provide assisted living services, the provisional licensee must provide notice to the commissioner that it is providing assisted living services by sending an email to the email address provided by the commissioner.\n(c) If the provisional licensee does not provide services during the provisional license period, the provisional license shall expire at the end of the period and the applicant must reapply.\n(d) If the provisional licensee notifies the commissioner that the licensee is providing assisted living services within 45 calendar days prior to expiration of the provisional license, the commissioner may extend the provisional license for up to 60 calendar days in order to allow the commissioner to complete the on-site survey required under this section and follow-up survey visits.\n(a) If the provisional licensee is in substantial compliance with the survey, the commissioner shall issue a facility license.\n(b) If the provisional licensee is not in substantial compliance with the initial survey, the commissioner shall either: (1) not issue the facility license and terminate the provisional license; or (2) extend the provisional license for a period not to exceed 90 calendar days and apply conditions necessary to bring the facility into substantial compliance. If the provisional licensee is not in substantial compliance with the survey within the time period of the extension or if the provisional licensee does not satisfy the license conditions, the commissioner may deny the license.\n(a) If a provisional licensee whose assisted living facility license has been denied or extended with conditions disagrees with the conclusions of the commissioner, then the provisional licensee may request a reconsideration by the commissioner. The reconsideration request process must be conducted internally by the commissioner and chapter 14 does not apply.\n(b) The provisional licensee requesting the reconsideration must make the request in writing and must list and describe the reasons why the provisional licensee disagrees with the decision to deny the facility license or the decision to extend the provisional license with conditions.\n(c) The reconsideration request and supporting documentation must be received by the commissioner within 15 calendar days after the date the provisional licensee receives the denial or provisional license with conditions.\nA provisional licensee whose license is denied is permitted to continue operating during the period of time when:\n(1) a reconsideration is in process;\n(2) an extension of the provisional license and terms associated with it is in active negotiation between the commissioner and the licensee, and the commissioner confirms the negotiation is active; or\n(3) a transfer of residents to a new facility is underway and not all of the residents have relocated.\nA provisional licensee whose license is denied must comply with the requirements for notification and the coordinated move of residents in sections 144G.52 and 144G.55. If the license denial is upheld by the reconsideration process, the licensee must submit a draft closure plan as required by section 144G.57 within ten calendar days of receipt of the reconsideration decision, must work with the commissioner on any revisions needed to the draft plan, and must have a final closure plan submitted and approved within 30 calendar days of receipt of the reconsideration decision.\n(a) The fine for failure to comply with the notification requirements in section 144G.52, subdivision 7, is $1,000.\n(b) Fines and penalties collected under this section shall be deposited in a dedicated special revenue account. On an annual basis, the balance in the special revenue account shall be appropriated to the commissioner to implement the recommendations of the advisory council established in section 144A.4799.",
	"repealed": false
}