{
	"id": "299A.642",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.642",
	"title": "299A.642 VIOLENT CRIME COORDINATING COUNCIL.",
	"text": "The Violent Crime Coordinating Council is established to provide guidance related to the investigation and prosecution of gang and drug crime. For the purposes of this section, \"gang and drug crime\" includes violent crimes associated with gang activity.\n(a) The coordinating council shall consist of the following individuals or their designees:\n(1) the director of the Office of Special Investigations as the representative of the commissioner of corrections;\n(2) the superintendent of the Bureau of Criminal Apprehension as the representative of the commissioner of public safety;\n(3) the attorney general;\n(4) four chiefs of police, selected by the Minnesota Chiefs of Police Association, of which one must be employed by the city of Minneapolis, one must be employed by the city of St. Paul, one must be employed by a municipality located in the seven-county metropolitan area excluding Minneapolis and St. Paul, and one must be employed in greater Minnesota;\n(5) four sheriffs, selected by the Minnesota Sheriffs' Association, of which, one must work in Hennepin County, one must work in Ramsey County, one must work in Anoka, Carver, Dakota, Scott, or Washington County, and one must work in greater Minnesota;\n(6) the United States attorney for the district of Minnesota;\n(7) two county attorneys, selected by the Minnesota County Attorneys Association, one who must work in the seven-county metropolitan area and one who must work in greater Minnesota;\n(8) four citizen members appointed by the commissioner of public safety in consultation with representatives from the councils created in sections 3.922 and 15.0145; and\n(9) a tribal peace officer, selected by the commissioner of public safety, in consultation with the Minnesota Indian Affairs Council.\n(b) The coordinating council shall adopt procedures to govern its conduct as necessary and shall select a chair from among its members. The chair shall serve a two-year term and the appointment of the chair shall alternate between a person who works in greater Minnesota and a person who works in the seven-county metropolitan area.\nThe coordinating council shall develop an overall strategy to ameliorate the harm caused to the public by gang and drug crime within the state of Minnesota. Additionally, the coordinating council shall:\n(1) subject to approval by the commissioner of public safety, develop an operating procedures and policies manual to investigate gang and drug crime in a multijurisdictional manner;\n(2) identify and recommend a candidate or candidates for statewide coordinator to the commissioner of public safety;\n(3) assist the Department of Public Safety in developing grant eligibility criteria and operating an objective and conflict-free grant review application process;\n(4) make recommendations to the commissioner of public safety to terminate grant funding for multijurisdictional entities if an entity no longer operates in accordance with subdivision 4, or no longer functions in a manner consistent with the best interests of the state or public;\n(5) assist in developing a process to collect and share information to improve the investigation and prosecution of gang and drug offenses;\n(6) develop and approve an operational budget for the coordinating council;\n(7) develop policies that prohibit the improper use of personal characteristics such as race, color, national origin, gender, or religion to target individuals for law enforcement action, prosecution, or forfeiture action; and\n(8) subject to approval by the commissioner of public safety, adopt narrowly tailored, objective criteria and identifying characteristics for use in determining whether individuals are or may be members of gangs involved in criminal activity. The council shall review and update the criteria and characteristics adopted under this clause every two years with the objective to ensure effectiveness and relevance to the accurate identification of subjects actively involved in criminal gang activity. As part of its review process, the council shall obtain input from members of communities that are impacted by criminal gang activity. Before adopting any changes under this clause, the council must submit its recommendations to the commissioner of public safety for approval.\n(a) The commissioner of public safety shall certify multijurisdictional entities, and their designated fiscal agents, that are established pursuant to this section to combat gang and drug crime and receive grant funding under subdivision 9. To certify an entity and its designated fiscal agent, the commissioner shall require that a multijurisdictional entity:\n(1) be subject to the operational command and supervision of one of the participating agencies;\n(2) be subject to a biennial operational and financial audit contracted out to an external organization not associated with the multijurisdictional entity and designed to ensure that the entity and its designated fiscal agent are in compliance with applicable legal requirements, proper law enforcement standards and practices, and effective financial controls;\n(3) have adequate staffing and funding to support law enforcement, prosecutorial, and financial operations, including bookkeeping, evidence handling, and inventory recording; and\n(4) be subject to any other conditions the commissioner deems necessary to carry out the purposes of this section.\nThe commissioner may use grant funds authorized under subdivision 9 to pay for costs incurred in conducting audits under clause (2).\n(b) A multijurisdictional entity, and its designated fiscal agent, must be certified annually by the commissioner and may not operate under this section unless it is certified. If the commissioner revokes an entity's or fiscal agent's certification, the commissioner may order, for purposes relating to this section, any or all of the following:\n(1) dissolution of the entity, its governing boards, or both;\n(2) transfer of duties of the entity, its governing boards, or both, to the Department of Public Safety; and\n(3) any other action deemed necessary by the commissioner.\nNotwithstanding any action taken by the commissioner, any outstanding obligations or liabilities of the entity remain with the entity and the parties of the agreement and do not transfer.\n(c) An agreement entered into pursuant to section 471.59 and this section shall provide that the parties to the agreement are subject to the provisions in this subdivision and shall provide for the disposition of property and allocation of obligations upon voluntary or mandated dissolution of the entity or upon termination of the agreement.\nThe commissioner of public safety shall appoint a statewide coordinator. The coordinator serving in the unclassified service shall:\n(1) coordinate and monitor all multijurisdictional gang and drug enforcement activities;\n(2) facilitate local efforts and ensure statewide coordination with efforts to combat gang and drug crime;\n(3) facilitate training for personnel;\n(4) monitor compliance with investigative protocols; and\n(5) review audits conducted under subdivision 4, take corrective actions based on audit results, and submit a summary report of the audits and any corrective actions to the commissioner of public safety.\nAll participating law enforcement officers must be licensed peace officers as defined in section 626.84, subdivision 1, or qualified federal law enforcement officers as defined in section 626.8453. Participating officers remain employees of the same entity that employed them before joining any multijurisdictional entity established under this section. Participating officers are not employees of the state. Participating officers shall be subject to annual performance reviews conducted by the entity's operational supervisor.\nLaw enforcement officers participating in any multijurisdictional entity established under this section have statewide jurisdiction to conduct criminal investigations and have the same powers of arrest as those possessed by a sheriff.\nA multijurisdictional entity established pursuant to this section shall process all seized cash, physical assets, and evidence through the standard evidence handling procedures established by the participating agencies.\nThe commissioner of public safety may make grants to state and local units of government to combat gang and drug crime. When awarding grants, the commissioner shall consider awarding grants under this section to fund community-based gang intervention and prevention efforts for youth.\nNotwithstanding section 15.059, this section does not expire.\n(a) A multijurisdictional entity established under this section shall create a governing board consisting of the chief law enforcement officer, or designee, from each participating agency, a prosecutor from one of the participating agencies, and up to three additional members selected by the governing board. A governing board shall have no less than six members.\n(b) The prosecutor on the governing board shall have the following responsibilities:\n(1) to recommend to the governing board the nature and frequency of training for officers assigned to a multijurisdictional entity in order to increase successful prosecutions;\n(2) to advise on the lawful handling and processing of seized property and evidence and forfeited property and money; and\n(3) to ensure that seizures and forfeitures are reported in accordance with section 609.5315, subdivision 6.\nParticipating agencies may accept lawful grants or contributions from any federal source or legal business or entity.\nThe attorney general or a designee shall generally advise on any matters that the coordinating council deems appropriate.\n(a) The attorney general or a designee shall serve as a liaison between the coordinating council and the councils created in sections 3.922 and 15.0145. The attorney general or designee will be responsible for:\n(1) informing the councils of the plans, activities, and decisions and hearing their reactions to those plans, activities, and decisions; and\n(2) providing the coordinating council with the position of the councils on the coordinating council's plan, activities, and decisions.\n(b) In no event is the coordinating council required to disclose the names of individuals identified by it to the councils referenced in this subdivision.\n(c) Nothing in this subdivision changes the data classification of any data held by the coordinating council.\n(a) By February 1 of each year, the commissioner of public safety shall submit the following reports to the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice policy and funding:\n(1) a report containing a summary of all audits conducted on multijurisdictional entities under subdivision 4;\n(2) a report on the results of audits conducted on data submitted to the criminal gang investigative data system under section 299C.091;\n(3) a report on the activities and goals of the coordinating council; and\n(4) a report on how funds appropriated for violent crime reduction strategies were used.\n(b) The report submitted under paragraph (a), clause (4), must include the following information regarding actions taken by the Bureau of Criminal Apprehension and Violent Crime Enforcement Teams receiving funding under this section:\n(1) the number of firearms seized;\n(2) the number of gun trafficking investigations conducted; and\n(3) a summary of the types of investigations conducted.",
	"repealed": false
}