{
	"id": "16A.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.056",
	"title": "16A.056 WEBSITE WITH SEARCHABLE DATABASE ON STATE EXPENDITURES.",
	"text": "The commissioner, in consultation with the commissioners of administration and revenue and the legislative auditor, must maintain a website with a searchable database providing the public with information on state contracts, state appropriations, state expenditures, state tax expenditures, and state entities that are the subject of audits. The website must not include information that is not public data, as defined in section 13.02, subdivision 8a. For each data field identified in subdivisions 2 to 6, the searchable database must allow a user of the website to:\n(1) perform a search using that field;\n(2) sort by that field;\n(3) obtain information grouped or aggregated by that field, where groups or subtotals are feasible; and\n(4) view information in that field by each fiscal year.\nThe searchable database may accommodate grouping and aggregating by allowing the user to download the data into a user-controlled database.\n(a) The searchable database on the website must include at least the following data fields on state contracts:\n(1) the name of the entity receiving the contract;\n(2) the name of the agency entering into the contract;\n(3) an indication if the contract is for (i) goods; (ii) professional or technical services; (iii) services other than professional and technical services; or (iv) a grant; and\n(4) the fund or funds from which the entity receiving the contract will be paid.\n(b) For each contract, the database must also include:\n(1) an address for each entity receiving a contract; and\n(2) a brief statement of the purpose of the contract or grant.\n(c) Information on a new contract or grant must be entered into the database within 30 days after the contract or grant is entered into.\n(d) For purposes of this section, a \"grant\" is a contract between a state agency and a recipient, the primary purpose of which is to transfer cash or a thing of value to the recipient to support a public purpose. Grant does not include aid payments to units of local government, payments to state employees, or payments made under laws providing for assistance to individuals.\nThe searchable database on the website must include at least the following data fields on state appropriations:\n(1) the agency receiving the appropriation, or the name of the nonstate entity receiving state money;\n(2) the agency program, to the extent applicable;\n(3) the agency activity, to the extent applicable;\n(4) an item within an activity if applicable;\n(5) the fund from which the appropriation is made; and\n(6) the object of expenditure.\nThe searchable database on the website must include at least the following data fields on state expenditures:\n(1) the name of the agency or nonstate entity making the expenditure;\n(2) the agency program, to the extent applicable;\n(3) the agency activity, to the extent applicable;\n(4) an item within an activity if applicable;\n(5) the fund from which the expenditure is made; and\n(6) the object of expenditure.\nThe website must include a searchable database of state tax expenditures. For each fiscal year, the database must include data fields showing the estimated impact on state revenues of each tax expenditure item listed in the report prepared under section 270C.11.\nThe website required by this section must include a link to a website containing the findings and results from the audits completed by the legislative auditor that have been released to the public.\nThe database required under this section must include information beginning with fiscal year 2012 appropriations and must retain data for at least ten years.\nThe commissioner of management and budget must consult with the chairs of the house of representatives Ways and Means and senate Finance Committees before encumbering any money appropriated on or after July 1, 2009, for the planning, development, and implementation of state accounting or procurement systems. No money appropriated for these purposes may be spent unless the commissioner certifies that the systems will allow compliance with requirements of this section.",
	"repealed": false
}