{
	"id": "383D.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/383D.41",
	"title": "383D.41 COMMUNITY DEVELOPMENT AGENCY.",
	"text": "There is created in Dakota County a public body corporate and politic, to be known as the Dakota County Community Development Agency, having all of the powers and duties of a housing and redevelopment authority under sections 469.001 to 469.047; and all powers and duties of a county housing and redevelopment authority under any other provisions of Minnesota law. Sections 469.001 to 469.047 and 469.090 to 469.1081 apply to the county of Dakota. For the purposes of applying the provisions of sections 469.001 to 469.047 and 469.090 to 469.1081 to Dakota county, and subject to the provisions of this section, the county has all of the powers and duties of a municipality, the county board has all of the powers and duties of a governing body, the chair of the county board has all of the powers and duties of a mayor, and the area of operation includes the area within the territorial boundaries of the county.\nThis section shall not limit or restrict any existing housing and redevelopment authority or prevent a municipality from creating an authority. A municipal housing and redevelopment authority may request the Dakota County Community Development Agency to handle the housing duties of the authority. If the municipal authority makes the request, the Dakota County Community Development Agency shall act and have exclusive jurisdiction for housing in the municipality pursuant to sections 469.001 to 469.047. A transfer of duties relating to housing does not transfer any duties relating to redevelopment.\nIf any housing project, development district, redevelopment project, or economic development project is constructed in Dakota County pursuant to this authorization, and the project is within the boundaries of any incorporated home rule charter or statutory city, the location of the project must be approved by the governing body of the city, and:\n(1) in the case of any housing project or housing development project, by the municipal housing and redevelopment authority established for the city if it has not previously requested that the Dakota County Community Development Agency or its predecessor agency handle the housing duties of the authority; or\n(2) in the case of any redevelopment project by the municipal housing and redevelopment authority established for the city.\nNotwithstanding section 469.015, subdivision 3, a performance bond is not required for any works of single family housing construction undertaken by the authority if the authority determines that the cost of a performance bond is greater than the benefit of the bond.\n(a) The authority shall consist of seven commissioners who, except as otherwise provided in this subdivision, shall serve three-year terms, which shall begin on the first Tuesday following the first Monday in January of the first year of the term. A commissioner shall also serve after the expiration of a term until a successor is appointed and qualified.\n(b) Each commissioner appointed, except a commissioner appointed pursuant to paragraph (c), shall be a resident of and shall represent the same county commissioner district as the commissioner who is replaced. A commissioner who ceases to maintain a principal residence in the district from which appointed shall cease to serve as a commissioner. A vacancy is created in the membership of the authority for a county commissioner district whenever the county commissioner for that district ends county board membership.\n(c) If required by Code of Federal Regulations, title 24, part 964, the commission may include an eighth member that serves as an at-large commissioner. An at-large commissioner must be appointed in accordance with the requirements of Code of Federal Regulations, title 24, part 964. The at-large commissioner shall serve a three-year term, which shall begin on the first Tuesday following the first Monday in January of the first year of the term. An at-large commissioner shall also serve after the expiration of a term until a successor is appointed and qualified. The at-large commissioner may only take part in decisions related to the administration, operation, and management of federal public housing programs and Section 8 tenant-based rental assistance programs.\nNotwithstanding any law to the contrary, employees of the authority shall not be deemed county employees for any purpose, absent a resolution of consent adopted by the county board.\n(a) After December 31, 1999, the Dakota County Housing and Redevelopment Authority shall be known as the Dakota County Community Development Agency. In addition to the other powers granted in this section, the Dakota County Community Development Agency shall have the powers of an economic development authority under sections 469.090 to 469.1081 that are granted to the agency by resolution adopted by the Dakota County Board of Commissioners, except as provided in paragraph (b). The enabling resolution may impose the limits upon the actions of the agency that are listed in paragraph (c). The agency may exercise any of the powers granted to it under sections 469.001 to 469.047 and any of the powers of an economic development authority granted to it by the Dakota County Board of Commissioners for the purposes described in these sections.\n(b) The Dakota County Community Development Agency may not levy the tax described in section 469.107, but with the approval of the Dakota County Board may increase its levy of the special tax described in section 469.033, subdivision 6, to an amount not exceeding 0.01813 percent of net tax capacity, or any higher limit authorized under section 469.107 or 469.033, subdivision 6.\n(c) The enabling resolution may impose the limits upon the actions of the authority as may be imposed by a municipality under section 469.092, except that the resolution adopted under paragraph (a) may not impose any limitations on the authority's exercise of its powers under sections 469.001 to 469.047.\nNotwithstanding any other law, Dakota County may offer to the Dakota County Community Development Agency, under the conditions and policies established by the county, nonconservation tax-forfeited land prior to making the properties available to cities in Dakota County.\nOn or before December 31, 2000, the county board may make a onetime election to adopt a resolution declaring vacant the entire membership of the authority and appoint new members to fill the vacancies. A member appointed under this paragraph shall serve until the end of the term to which the member is appointed.\n(a) In addition to its other powers, the Dakota County Community Development Agency shall have all powers of a city under sections 428A.11 to 428A.21 in connection with housing improvement areas in Dakota County.\n(b) For purposes of the Dakota County Community Development Agency's exercise of the powers granted in this subdivision, references in sections 428A.11 to 428A.21 to:\n(1) a \"mayor\" shall be references to the chair of the board of commissioners of the Dakota County Community Development Agency;\n(2) a \"council\" shall be references to the board of commissioners of the Dakota County Community Development Agency; and\n(3) a \"city clerk\" shall be references to an official of the Dakota County Community Development Agency designated by the executive director of the Dakota County Community Development Agency.\n(c) Notwithstanding sections 428A.11, subdivision 3, and 428A.13, subdivision 1, the governing body of the Dakota County Community Development Agency may adopt a resolution, rather than an ordinance, establishing one or more housing improvement areas, and \"enabling ordinance\" for purposes of sections 428A.11 to 428A.21 means a resolution under this clause.\n(d) The community development agency (1) shall send a copy of each petition for the establishment of a housing improvement area to the city in which the proposed housing improvement area is located, and (2) may not hold the public hearing required in section 428A.13, subdivision 2, fewer than 30 days after the date on which the related application was sent pursuant to clause (1). The community development agency may not establish a housing improvement area if the applicable city council opposes the establishment by resolution adopted within 30 days after the petition required to be sent pursuant to clause (1).\n(a) In addition to the projects described in section 462A.222, subdivision 3, paragraph (e), the Dakota County Community Development Agency may allocate tax credits in the first round for up to three projects of the following type: new construction or substantial rehabilitation multifamily housing projects that are not restricted to persons who are 55 years of age or older and that are located within one of the following areas at the time a reservation for tax credits is made:\n(1) an area within one-half mile of a completed or planned light rail transitway, bus rapid transitway, or commuter rail station;\n(2) an area within one-fourth mile from any stop along a high-frequency local bus line;\n(3) an area within one-half mile from a bus stop or station on a high-frequency express route;\n(4) an area within one-half mile from a park and ride lot; or\n(5) an area within one-fourth mile of a high-service public transportation fixed route stop.\n(b) For purposes of this section, the following terms have the meanings given them:\n(1) \"high-frequency local bus line\" means a local bus route providing service at least every 15 minutes and running between 6:00 a.m. and 7:00 p.m. on weekdays and between 9:00 a.m. and 6:00 p.m. on Saturdays;\n(2) \"high-frequency express route\" means an express route with bus service providing six or more trips during at least one of the peak morning hours between 6:00 a.m. and 9:00 a.m. and every ten minutes during the peak morning hour; and\n(3) \"high-service public transportation fixed route stop\" means a stop serviced between 6:00 a.m. and 7:00 p.m. on weekdays and 9:00 a.m. and 6:00 p.m. on Saturdays and with service approximately every 30 minutes during that time.",
	"repealed": false
}