{
	"id": "126C.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.52",
	"title": "126C.52 AUTHORITY TO BORROW MONEY; LIMITATIONS.",
	"text": "The board of any school district may borrow money upon negotiable tax anticipation certificates of indebtedness, in the manner and subject to the limitations set forth in sections 126C.50 to 126C.56, for the purpose of anticipating general taxes already levied by the district for school purposes. The aggregate of the borrowing under this subdivision must never exceed 75 percent of the taxes which are due and payable in the calendar year, and as to which taxes no penalty for nonpayment or delinquency has attached. In determining the amount of taxes due and payable in the calendar year, any amounts paid by the state to replace such taxes, whether paid in that calendar year or not, must be included.\nThe board of any school district may also borrow money in the manner and subject to the limitations set forth in sections 126C.50 to 126C.56 in anticipation of receipt of state aids for schools as defined in Minnesota Statutes and of federal school aids to be distributed by or through the department. The aggregate of such borrowings under this subdivision shall never exceed 75 percent of such aids which are receivable by said school district in the fiscal year in which the money is borrowed, as estimated and certified by the commissioner.\n(a) The board of an intermediate school district may borrow money in the manner and subject to the limitations set forth in sections 126C.50 to 126C.56 in anticipation of the receipt of:\n(1) state aids for schools as defined in Minnesota Statutes;\n(2) federal school aids to be distributed by or through the department; and\n(3) membership fees and tuition payments from its member school districts.\nThe aggregate of such borrowings under this subdivision shall never exceed 75 percent of such aids, fees, and tuition payments which are receivable by the intermediate school district in the fiscal year in which the money is borrowed, as estimated and certified by the commissioner.\n(b) The board of an intermediate school district may, upon receipt of a written resolution by each of its member school districts, pledge the member district's full faith and credit and unlimited taxing powers to repay each member district's pro rata share of any certificates issued or the amount paid by the state under section 126C.55, subdivision 2, plus interest, if the revenues specified in paragraph (a) and any other revenues of the intermediate school district are insufficient to do so.",
	"repealed": false
}