{
	"id": "315.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.01",
	"title": "315.01 FORMATION; TRUSTEES.",
	"text": "The worshipers with an unincorporated church, congregation, or religious society who are of lawful age and have been considered as belonging to it, may elect trustees and incorporate as provided in this section.\nA written notice, signed by at least five worshipers, stating the time, place, and object of the meeting, must be posted at least 15 days before the meeting, at the place of worship of the society. At the time and place fixed, if at least five worshipers are present, they shall, by a plurality vote, elect a chair and secretary. The chair and secretary shall together determine the qualifications of voters and receive and count the votes. The voters shall, by a plurality vote, elect at least three and not more than 15 members of their society as trustees, to take charge of its property and temporal affairs. The voters shall adopt a corporate name for the trustees and their successors. They may also determine the qualifications of the trustees to be chosen afterward and the religious denomination or sect to which the society will belong. Immediately after the meeting the chair and secretary shall sign, in the presence of two subscribing witnesses, and acknowledge a certificate stating the names of the trustees elected, the name adopted for the incorporated society, the qualifications, if any, of future trustees, and the name of the religious denomination to which the society belongs, if any.\nWhen the constitution, rules, or usages of a church, denomination, congregation, or religious society require that trustees be chosen by a minister, presiding elder, or other officers, or by a body, the person who chose the trustees, or the presiding officer and secretary of the body shall execute, acknowledge, and deliver to the trustees a certificate, stating the names of the trustees, the time when and the person or body by which they were chosen, and their corporate name. When the certificate is recorded as required by law, the trustees and their successors become a corporate body under the name specified in the certificate, and have the rights, powers, and privileges of other religious corporations organized under this chapter.\nWhen the constitution, rules, and usages of a church or religious denomination declare that the ministers, elders, deacons, or other officers elected by a church or congregation according to the constitution, rules, or usages, are the trustees of the church or congregation, those designated persons may assemble and execute and acknowledge a certificate stating their corporate name. When this certificate is recorded with the county recorder of the proper county, they and their successors are a corporate body under the name in the certificate.",
	"repealed": false
}