{
	"id": "103E.202",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.202",
	"title": "103E.202 PETITIONS.",
	"text": "This section applies to a petition for a drainage project and a petition for repair.\n(a) A petition must be signed by a requisite number of owners of 40-acre tracts or government lots and property that the drainage project described in the petition passes over, or by the property owners of the required percentage of the property area determined by the total and percentage of area of 40-acre tracts or government lots that the proposed drainage project passes over, excluding areas in and holders of easements for utilities and roads. A petition may be signed by the commissioner of transportation or by a political subdivision if the property is in the jurisdiction of the commissioner or political subdivision and is passed over by the proposed drainage project.\n(b) Each separate parcel of property counts as one signature but the petition must be signed by all owners of the parcel to count as a signature. The signature of each entity regardless of the number of parcels of property owned counts as one signature on the petition.\n(c) Paragraph (a) does not apply to a petition for an improvement of an outlet.\nAfter a petition has been filed, a petitioner may not withdraw from the petition except with the written consent of all other petitioners on the filed petition.\nA petition for a drainage project and a bond must be filed with the auditor. If a drainage system is within two or more counties, the petition must be filed with the auditor of the county with the greatest area of property that the proposed drainage project passes over.\nOne or more petitioners must file a bond with the petition for at least $10,000 that is payable to the county where the petition is filed, or for a petition for a proposed joint county drainage system or a petition for a drainage project affecting a joint county drainage system, the bond must be payable to all of the counties named in the petition. The bond must have adequate surety and be approved by the county attorney where the petition is filed. The bond must be conditioned to pay the costs incurred if the proceedings are dismissed or a contract is not awarded to construct the drainage system proposed in the petition.\nThe costs incurred before the proposed drainage project is established may not exceed the amount of the petitioners' bond. A claim for expenses greater than the amount of the bond may not be paid unless an additional bond is filed. If the drainage authority determines that the cost of the proceeding will be greater than the petitioners' bond before the proposed drainage project is established, the drainage authority must require an additional bond to cover all costs to be filed within a prescribed time. The proceeding must be stopped until the additional bond prescribed by the drainage authority is filed. If the additional bond is not filed within the time prescribed, the proceeding must be dismissed.",
	"repealed": false
}