{
	"id": "136G.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/136G.13",
	"title": "136G.13 ACCOUNT DISTRIBUTIONS.",
	"text": "(a) Qualified distributions may be made:\n(1) directly to participating eligible educational institutions on behalf of the beneficiary;\n(2) directly to the account owner or beneficiary; or\n(3) to any other third party as requested by the account owner.\n(b) Qualified distributions must be withdrawn proportionally from contributions and earnings in an account owner's account on the date of distribution as provided in section 529 of the Internal Revenue Code.\nMatching grant account funds may be used as part or all of a qualified distribution.\nAn account owner may request a taxable distribution from an account at any time. Taxable distributions are based on the total account balances in an account owner's account and must be withdrawn proportionally from contributions and earnings as provided in section 529 of the Internal Revenue Code. For purposes of this subdivision, \"earnings portion\" means the ratio of the earnings in the account to the total account balance, immediately prior to the distribution, multiplied by the distribution.\n(a) If an account owner requests a taxable distribution from an account that has a matching grant account, the total account balance of the matching grant account, if any, is reduced.\n(b) After the taxable distribution is withdrawn from the account, the account owner forfeits matching grant amounts in the same proportion as the taxable distribution is to the total account balance of the account.\nAn account owner may request a distribution due to the death or disability of, or scholarship to, or attendance at a United States military academy by, a beneficiary from an account by submitting a completed request to the plan. The plan shall apprise the account owner that the account owner is responsible for obtaining and retaining records and other documentation adequate to substantiate a distribution under this section.",
	"repealed": false
}