{
	"id": "245.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.91",
	"title": "245.91 DEFINITIONS.",
	"text": "For the purposes of sections 245.91 to 245.97, the following terms have the meanings given them.\n\"Agency\" means the divisions, officials, or employees of the state Departments of Human Services, Direct Care and Treatment, Health, and Education, and of local school districts and designated county social service agencies as defined in section 256G.02, subdivision 7, that are engaged in monitoring, providing, or regulating services or treatment for mental illness, developmental disability, substance use disorder, or emotional disturbance.\n\"Client\" means a person served by an agency, facility, or program, who is receiving services or treatment for mental illness, developmental disability, substance use disorder, or emotional disturbance. Client also includes a now deceased person who had been served by an agency, facility, or program.\n\"Emergency use of manual restraint\" has the meaning given in section 245D.02, subdivision 8a, and applies to services licensed under chapter 245D.\n\"Facility\" or \"program\" means a nonresidential or residential program as defined in section 245A.02, subdivisions 10 and 14, and any agency, facility, or program that provides services or treatment for mental illness, developmental disability, substance use disorder, or emotional disturbance that is required to be licensed, certified, or registered by the commissioner of human services, health, or education; a sober home as defined in section 254B.01, subdivision 11; peer recovery support services provided by a recovery community organization as defined in section 254B.01, subdivision 8; and an acute care inpatient facility that provides services or treatment for mental illness, developmental disability, substance use disorder, or emotional disturbance.\n\"Gather\" means access to information or data for purposes of inspection and to receive copies of information or data.\n\"Regional center\" means a state-operated treatment program as defined in section 253B.02, subdivision 18d.\n\"Serious injury\" means:\n(1) fractures;\n(2) dislocations;\n(3) evidence of internal injuries;\n(4) head injuries with loss of consciousness or potential for a closed head injury or concussion without loss of consciousness requiring a medical assessment by a health care professional, whether or not further medical attention was sought;\n(5) lacerations involving injuries to tendons or organs, and those for which complications are present;\n(6) extensive second-degree or third-degree burns, and other burns for which complications are present;\n(7) extensive second-degree or third-degree frostbite, and others for which complications are present;\n(8) irreversible mobility or avulsion of teeth;\n(9) injuries to the eyeball;\n(10) ingestion of foreign substances and objects that are harmful;\n(11) near drowning;\n(12) heat exhaustion or sunstroke;\n(13) attempted suicide; and\n(14) all other injuries and incidents considered serious after an assessment by a health care professional, including but not limited to self-injurious behavior, a medication error requiring medical treatment, a suspected delay of medical treatment, a complication of a previous injury, or a complication of medical treatment for an injury.",
	"repealed": false
}