{
	"id": "326A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.08",
	"title": "326A.08 ENFORCEMENT.",
	"text": "If the board, or the complaint committee if authorized by the board, has a reasonable basis to believe that a person or firm has engaged in or is about to engage in a violation of a statute, rule, or order that the board has issued or is empowered to enforce, the board, or the complaint committee if authorized by the board, may proceed as described in this section. The board may, upon receipt of a complaint or other information suggesting violations of this chapter or of the rules of the board, conduct investigations to determine whether there is reasonable basis to institute proceedings under this section against any person or firm for such violations. The investigation is not a prerequisite to such proceedings in the event that a determination can be made without investigation.\nExcept as otherwise described in this section, all hearings shall be conducted in accordance with chapter 14. Hearings conducted under chapter 14 that relate to a disciplinary action must be closed to the public, except for individuals whose presence is necessary for conducting the proceeding or providing testimony or evidence. The hearing record and the findings, conclusions, report, and order or recommendation of the administrative law judge are private data on individuals, as defined in section 13.02, until the board issues its final order or the report or order of the administrative law judge becomes the final decision in the case.\n(a) When necessary to prevent an imminent violation of a statute, rule, or order that the board has issued or is empowered to enforce, the board, or the complaint committee if authorized by the board, may bring an action in the name of the state in the district court in Ramsey county, when necessary to prevent imminent harm to the public, or in any county in which jurisdiction is proper to enjoin the act or practice and to enforce compliance with the statute, rule, or order. Upon a showing that a person or firm has engaged in or is about to engage in an act or practice constituting a violation of a statute, rule, or order that the board has issued or is empowered to enforce, a permanent or temporary injunction, restraining order, or other appropriate relief shall be granted.\n(b) For purposes of injunctive relief under this subdivision, irreparable harm exists when the board shows that a person or firm has engaged in or is about to engage in an act or practice constituting a violation of a statute, rule, or order that the board has issued or is empowered to enforce.\n(c) Injunctive relief granted under paragraph (a) does not relieve an enjoined person or firm from criminal prosecution from a competent authority or from action by the board pursuant to subdivisions 4 to 7 with respect to the person's or firm's certificate, permit, registration, or practice privileges granted under section 326A.14 or application for examination, certificate, registration, permit, or renewal or notification for practice privileges granted under section 326A.14.\n(a) The board, or the complaint committee if authorized by the board, may issue and have served upon a certificate holder, a permit holder, a registration holder, a person with practice privileges granted under section 326A.14, a person who has previously been subject to a disciplinary order by the board, or an unlicensed firm or person an order requiring the person or firm to cease and desist from the act or practice constituting a violation of the statute, rule, or order. The order must be calculated to give reasonable notice of the rights of the person or firm to request a hearing and must state the reasons for the entry of the order. No order may be issued until an investigation of the facts has been conducted pursuant to section 214.10.\n(b) Service of the order may be by first class United States mail, including certified United States mail, or overnight express mail service, postage prepaid and addressed to the party at the party's last known address. Service by United States mail, including certified mail, is complete upon placing the order in the mail or otherwise delivering the order to the United States mail service. Service by overnight express mail service is complete upon delivering the order to an authorized agent of the express mail service.\n(c) Unless otherwise agreed by the board, or the complaint committee if authorized by the board, and the person or firm requesting the hearing, the hearing must be held no later than 30 days after the request for the hearing is received by the board.\n(d) The administrative law judge shall issue a report within 30 days of the close of the contested case hearing record, notwithstanding Minnesota Rules, part 1400.8100, subpart 3. Within 30 days after receiving the report and any exceptions to it, the board shall issue a further order vacating, modifying, or making permanent the cease and desist orders as the facts require.\n(e) If no hearing is requested within 30 days of service of the order, the order becomes final and remains in effect until it is modified or vacated by the board.\n(f) If the person or firm to whom a cease and desist order is issued fails to appear at the hearing after being duly notified, the person or firm is in default and the proceeding may be determined against that person or firm upon consideration of the cease and desist order, the allegations of which may be considered to be true.\n(g) In lieu of or in addition to the order provided in paragraph (a), the board may require the person or firm to provide to the board a true and complete list of the person's or firm's clientele so that they can, if deemed necessary, be notified of the board's action. Failure to do so, or to provide an incomplete or inaccurate list, is an act discreditable.\n(a) The board may, by order, deny, refuse to renew, suspend, temporarily suspend, or revoke the application, or practice privileges, registration or certificate of a person or firm; censure or reprimand the person or firm; prohibit the person or firm from preparing tax returns or reporting on financial statements; limit the scope of practice of any licensee; limit privileges under section 326A.14; refuse to permit a person to sit for examination; or refuse to release the person's examination grades if the board finds that the order is in the public interest and that, based on a preponderance of the evidence presented, the person or firm:\n(1) has violated a statute, rule, or order that the board has issued or is empowered to enforce;\n(2) has engaged in conduct or acts that are fraudulent, deceptive, or dishonest whether or not the conduct or acts relate to performing or offering to perform professional services, providing that the fraudulent, deceptive, or dishonest conduct or acts reflect adversely on the person's or firm's ability or fitness to provide professional services;\n(3) has engaged in conduct or acts that are negligent or otherwise in violation of the standards established by board rule, where the conduct or acts relate to providing professional services, including in the filing or failure to file the licensee's income tax returns;\n(4) has been convicted of, has pled guilty or nolo contendere to, or has been sentenced as a result of the commission of a felony or crime, an element of which is dishonesty or fraud; has been shown to have or admitted to having engaged in acts or practices tending to show that the person or firm is incompetent; or has engaged in conduct reflecting adversely on the person's or firm's ability or fitness to provide professional services, whether or not a conviction was obtained or a plea was entered or withheld and whether or not dishonesty or fraud was an element of the conduct;\n(5) employed fraud or deception in obtaining a certificate, permit, registration, practice privileges, renewal, or reinstatement or in passing all or a portion of the examination;\n(6) has had the person's or firm's permit, registration, practice privileges, certificate, right to examine, or other similar authority revoked, suspended, canceled, limited, or not renewed for cause, or has committed unprofessional acts for which the person or firm was otherwise disciplined or sanctioned, including, but not limited to, being ordered to or agreeing to cease and desist from prescribed conduct, in any state or any foreign country;\n(7) has had the person's or firm's right to practice before any federal, state, other government agency, or Public Company Accounting Oversight Board revoked, suspended, canceled, limited, or not renewed for cause, or has committed unprofessional acts for which the person or firm was otherwise disciplined or sanctioned, including, but not limited to, being ordered to or agreeing to cease and desist from prescribed conduct;\n(8) failed to meet any requirement for the issuance or renewal of the person's or firm's certificate, registration or permit, or for practice privileges;\n(9) with respect to temporary suspension orders, has committed an act, engaged in conduct, or committed practices that may result or may have resulted, in the opinion of the board or the complaint committee if authorized by the board, in an immediate threat to the public;\n(10) has engaged in any conduct reflecting adversely upon the person's or firm's fitness to perform services while a licensee, individual granted privileges under section 326A.14, or a person registered under section 326A.06, paragraph (b); or\n(11) has, prior to a voluntary surrender of a certificate or permit to the board, engaged in conduct which at any time resulted in the discipline or sanction described in clause (6) or (7).\n(b) In lieu of or in addition to any remedy provided in paragraph (a), the board, or the complaint committee if authorized by the board, may require, as a condition of continued possession of a certificate, a registration, or practice privileges, termination of suspension, reinstatement of permit, registration of a person or firm or of practice privileges under section 326A.14, a certificate, an examination, or release of examination grades, that the person or firm:\n(1) submit to a peer review of the person's or firm's ability, skills, or quality of work, conducted in a fashion and by persons, entity, or entities as required by the board; and\n(2) complete to the satisfaction of the board continuing professional education courses specified by the board.\n(c) Service of the order may be by first class United States mail, including certified United States mail, or overnight express mail service, postage prepaid and addressed to the party at the party's last known address. Service by United States mail, including certified mail, is complete upon placing the order in the mail or otherwise delivering the order to the United States mail service. Service by overnight express mail service is complete upon delivering the order to an authorized agent of the express mail service. The order shall state the reasons for the entry of the order.\n(d) All hearings required by this subdivision must be conducted in accordance with chapter 14 except with respect to temporary suspension orders as provided for in subdivision 6.\n(e) In addition to the remedies authorized by this subdivision, the board, or the complaint committee if authorized by the board, may enter into an agreement with the person or firm for corrective action and may unilaterally issue a warning to a person or firm.\n(f) The board shall not use agreements for corrective action or warnings in any situation where the person or firm has been convicted of or pled guilty or nolo contendere to a felony or crime and the felony or crime is the basis of the board's action against the person or firm, where the conduct of the person or firm indicates a pattern of related violations of paragraph (a) or the rules of the board, or where the board concludes that the conduct of the person or firm will not be deterred other than by disciplinary action under this subdivision or subdivision 4 or 6.\n(g) Agreements for corrective action may be used by the board, or the complaint committee if authorized by the board, where the violation committed by the person or firm does not warrant disciplinary action pursuant to this subdivision or subdivision 4 or 6, but where the board, or the complaint committee if authorized by the board, determines that corrective action is required to prevent further such violations and to otherwise protect the public. Warnings may be used by the board, or the complaint committee if authorized by the board, where the violation of the person or firm is de minimus, does not warrant disciplinary action under this subdivision or subdivision 4 or 6, and does not require corrective action to protect the public.\n(h) Agreements for corrective action must not be considered disciplinary action against the person's or firm's application, permit, registration or certificate, or practice privileges under section 326A.14. However, agreements for corrective action are public data. Warnings must not be considered disciplinary action against the person's or firm's application, permit, registration, or certificate or person's practice privileges and are private data.\n(a) When the board, or the complaint committee if authorized by the board, issues a temporary suspension order, the suspension is in effect upon service of a written order on the person, firm, or counsel of record as provided in subdivision 4, paragraph (b), specifying the statute, rule, or order violated. The order remains in effect until the board issues a final order in the matter after a hearing or upon agreement between the board and the person or firm.\n(b) The order may prohibit the person or firm from providing professional services in whole or in part, as the facts may require, and may condition the end of such suspension on compliance with a statute, rule, or order that the board has issued or is empowered to enforce.\n(c) The order must set forth the rights to hearing contained in this section and must state the reasons for the entry of order.\n(d) Within ten days after service of the order, the person or firm may request a hearing in writing. The board shall hold a hearing before its own members within five working days of a receipt of a request for hearing or within five working days of receipt of a request for hearing on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. This hearing is not subject to chapter 14. Evidence presented by the board or the person or firm shall be in affidavit form only. The person, firm, or counsel of record may appear for oral argument.\n(e) Within five working days after the hearing, the board shall issue its order and, if the suspension is continued, schedule a contested case hearing within 30 days after issuance of the order. The administrative law judge shall issue a report within 30 days after closing of the contested case hearing record, notwithstanding the provisions of Minnesota Rules, part 1400.8100, subpart 3. The board shall issue a final order within 30 days after receipt of that report.\n(a) The board may impose a civil penalty not to exceed $5,000 per violation upon a person or a firm that violates an order, statute, or rule that the board has issued or is empowered to enforce.\n(b) The board may, in addition, impose a fee to reimburse the board for all or part of the cost of the proceedings, including reasonable investigative costs, resulting in disciplinary or corrective action authorized by this section, the imposition of civil penalties, or the issuance of a cease and desist order. The fee may be imposed when the board shows that the position of the person or firm that violates a statute, rule, or order that the board has issued or is empowered to enforce is not substantially justified, unless special circumstances make an award unjust, notwithstanding the provisions of Minnesota Rules, part 1400.8401. The costs include, but are not limited to, the amount paid by the board for services from the office of administrative hearings, attorney and reasonable investigative fees, court reporters, witnesses, reproduction of records, board members' per diem compensation, board staff time, and expense incurred by board members and staff.\nAny person or entity who prepares or reports on financial statements or schedules for a client for a fee is subject to this section and the practice of the person or entity may be disciplined by the board as provided for in this section. The board may discipline a person or entity based on violations of this chapter, the board's rules, or misrepresentations made by the person or entity regarding the work the person or entity performed.\nIn any case where the board renders a decision imposing discipline against a person or firm, the board shall examine its records to determine whether the person or firm holds a certificate or a permit in any other state. If so, the board shall notify the board of accountancy of the other state of its decision, by mail or by other reasonable means, within 45 days of the decision becoming final.\nIf a person's or firm's permit, registration, practice privileges, license, certificate, or other similar authority lapses, expires, is surrendered, withdrawn, terminated, canceled, limited, not renewed, or otherwise becomes invalid, the board may institute a proceeding under this subdivision within two years after the date the license, certificate, or permit was last effective and enter a revocation or suspension order as of the last date on which the license, certificate, or permit was in effect, or impose a civil penalty as provided for in subdivision 7.",
	"repealed": false
}