{
	"id": "148E.260",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.260",
	"title": "148E.260 DISCIPLINARY ACTIONS.",
	"text": "(a) When the board has grounds for disciplinary actions under this chapter, the board may take one or more of the following disciplinary actions:\n(1) deny an application;\n(2) permanently revoke a license to practice social work;\n(3) indefinitely or temporarily suspend a license to practice social work;\n(4) impose restrictions on a licensee's scope of practice;\n(5) impose conditions required for the licensee to maintain licensure, including, but not limited to, additional education, supervision, and requiring the passing of an examination provided for in section 148E.055;\n(6) reprimand a licensee;\n(7) impose a civil penalty of up to $10,000 for each violation in order to discourage future violations or to deprive the licensee of any economic advantage gained by reason of the violation; or\n(8) impose a fee to reimburse the board for all or part of the cost of the proceedings resulting in disciplinary action, including, but not limited to, the amount paid by the board for services received from or expenses incurred by the Office of Administrative Hearings, the Office of the Attorney General, court reporters, witnesses, board members, board staff, or the amount paid by the board for reproducing records.\n(b) Disciplinary action taken by the board under this subdivision is in effect pending determination of an appeal unless the court, upon petition and for good cause shown, decides otherwise.\n(a) In addition to the board's authority to issue a reprimand according to subdivision 1, a designated board member reviewing a complaint as provided for in chapter 214 may issue a reprimand to a licensee. The designated board member must notify the licensee that the reprimand will become final disciplinary action unless the licensee requests a hearing by the board within 14 calendar days.\n(b) If the licensee requests a hearing within 14 calendar days, the board must schedule a hearing unless the designated board member withdraws the reprimand.\n(c) The hearing must be scheduled within 14 working days of the time the licensee submits a request for the hearing.\n(d) The designated board member who issued the reprimand may participate in the hearing but must not deliberate or vote on the decision by the board.\n(e) The only evidence permitted at the hearing is affidavits or other documents except for testimony by the licensee or other witnesses whose testimony the board chair has authorized for good cause.\n(f) If testimony is authorized, the testimony is subject to cross-examination.\n(g) After the hearing, the board must affirm or dismiss the reprimand.\n(a) In addition to any other remedy provided by statute, the board or a designated board member may, without a hearing, temporarily suspend a license to practice social work if the board or the designated board member finds that:\n(1) the licensee has violated a statute or rule enforced by the board, any other federal or state law or rule related to the practice of social work, or an order, stipulation, or agreement agreed to or issued by the board; and\n(2) continued practice by the licensee would create a serious risk of harm to others.\n(b) The suspension is in effect upon service of a written order on the licensee specifying the statute, rule, order, stipulation, or agreement violated. Service of the order is effective if the order is served on the licensee or the licensee's attorney personally or by first class mail to the most recent address provided to the board for the licensee or the licensee's attorney.\n(c) The temporary suspension remains in effect until after the board issues an order according to paragraph (e), or if there is a contested case hearing, after the board issues a written final order according to paragraph (g).\n(d) If the licensee requests in writing within five calendar days of service of the order that the board hold a hearing, the board must hold a hearing on the sole issue of whether to continue, modify, or lift the suspension. The board must hold the hearing within ten working days of receipt of the licensee's written request. Evidence presented by the board or licensee must be in affidavit form only, except that the licensee or the licensee's attorney may present oral argument.\n(e) Within five working days after the hearing, the board must issue its order. If the licensee contests the order, the board must schedule a contested case hearing under chapter 14. The contested case hearing must be scheduled to occur within 45 calendar days after issuance of the order.\n(f) The administrative law judge must issue a report within 30 calendar days after the contested case hearing is concluded.\n(g) The board must issue a final order within 30 calendar days after the board receives the administrative law judge's report.",
	"repealed": false
}