{
	"id": "360.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.012",
	"title": "360.012 SOVEREIGNTY; LIABILITY; EFFECT OF OTHER LAW.",
	"text": "Sovereignty in the space above the lands and waters of this state is declared to rest in the state, except where granted to and assumed by the United States pursuant to a constitutional grant from the people of this state.\nA political subdivision must: (1) allow the commissioner to review a proposed ordinance affecting the operation of an unmanned aircraft; and (2) notify the commissioner whenever the political subdivision adopts an ordinance affecting the operation of unmanned aircraft.\nThe ownership of the space above the lands and waters of this state is declared to be vested in the several owners of the surface beneath, subject to the right of flight described in subdivision 3.\nFlight in aircraft over the lands and water of this state is lawful, unless at such low altitude as to interfere with the then-existing use to which the land or water, or the space above the land or water, is put by the owner, or unless so conducted as to be imminently dangerous or damaging to persons or property lawfully in the land or water beneath. The landing of an aircraft on the lands or waters of another, without the other's consent is unlawful, except in the case of a forced landing. For damages caused by the forced landing, however, the owner or lessee of the aircraft or the pilot shall be liable as provided in subdivision 4.\nThe owner of every aircraft which is operated over the lands or waters of this state is absolutely liable for injury or damage to persons or property on the land or water beneath, caused by the ascent, descent, or flight of the aircraft, or the dropping or falling of any object therefrom, whether such owner was negligent or not, unless the injury or damage is caused in whole or in part by the negligence of the person injured, or of the owner or bailee of the property damaged. If the aircraft is leased at the time of the injury or damage to person or property, both the owner and lessee shall be liable, and they may be sued jointly, or either or both of them may be sued separately. A pilot who is not the owner or lessee shall be liable only for the consequences of the pilot's own negligence. The injured person, or owner or bailee of the damaged property, shall have a lien on the aircraft causing the injury or damage to the extent of such injury or damage caused by the aircraft or objects falling from it.\nThe liability of the owner of one aircraft to the owner of another aircraft, or to pilots or passengers or other persons on either aircraft, for damages caused by collision on land or in the air shall be determined by the rules of law applicable to torts occurring on land.\nAll crimes, torts, and other wrongs committed by or against a pilot, passenger, or other person while in flight over this state shall be governed by the laws of this state; and the question whether damage occasioned by or to an aircraft while in flight over this state constitutes a tort, crime, or other wrong by or against the owner of such aircraft shall be determined by the laws of this state.\nAll contractual and other legal relations entered into by pilots, passengers, or other persons while in flight over this state shall have the same effect as if entered into on the land or water beneath.",
	"repealed": false
}