{
	"id": "446A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.07",
	"title": "446A.07 CLEAN WATER REVOLVING FUND.",
	"text": "The authority shall establish a clean water revolving fund to provide loans for the purposes and eligible costs authorized under title VI of the Federal Water Pollution Control Act. The fund must be credited with repayments.\n(a) For the purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Eligible recipients\" means governmental units or other entities eligible to receive loans or other assistance as provided in title VI of the Federal Water Pollution Control Act.\n(c) \"Federal Water Pollution Control Act\" means the Federal Water Pollution Control Act, as amended, United States Code, title 33, sections 1251 et seq.\nA state matching fund is established to be used in compliance with federal matching requirements specified in the Federal Water Pollution Control Act.\nThe authority shall enter an agreement with the administrator of the United States Environmental Protection Agency to receive capitalization grants for the clean water revolving fund. The authority may exercise powers necessary to comply with the requirements specified in the agreement, which must be in compliance with the Federal Water Pollution Control Act.\n(a) The authority shall annually prepare and submit to the United States Environmental Protection Agency an intended use plan. The plan must identify the intended uses of the amounts available to the clean water revolving fund, including a list of wastewater treatment and stormwater projects and all other eligible activities to be funded during the fiscal year.\n(b) To be eligible for placement on the intended use plan:\n(1) a project must be listed on the Pollution Control Agency's project priority list;\n(2) the applicant must submit a written request to the authority, including a brief description of the project, a project cost estimate and the requested loan amount, and a proposed project schedule; and\n(3) for a construction loan, the project must have a facility plan approved by the Pollution Control Agency.\n(c) The Pollution Control Agency shall annually provide to the authority its project priority list of wastewater and stormwater projects to be considered for funding. The authority may not submit the plan until it has received the review and comment of the Pollution Control Agency or until 30 days have elapsed since the plan was submitted to the Pollution Control Agency, whichever occurs first. In addition, the authority shall offer eligible recipients seeking placement on the intended use plan an opportunity to review and comment on the plan before it is adopted. The plan may be amended to add additional projects for consideration for funding as it determines funds are available and additional projects are able to proceed.\nApplications by eligible recipients for loans from the clean water revolving fund must be made to the authority on forms requiring information prescribed by the authority. The Pollution Control Agency shall certify to the authority those projects that appear to meet the criteria set forth in the Federal Water Pollution Control Act, this section, and rules of the Pollution Control Agency.\nThe authority shall award loans for projects certified by the Pollution Control Agency or shall provide funding for the appropriate state agency or department to make loans for eligible activities identified in the intended use plan, provided the use of funds and the terms and conditions of the loans are in conformance with the Federal Water Pollution Control Act, this section, and rules of the Pollution Control Agency and the authority adopted under this section.\n(a) When making loans from the clean water revolving fund, the authority shall comply with the conditions of the Federal Water Pollution Control Act, including the criteria in this subdivision.\n(b) Loans must be made at or below market interest rates, including interest-free loans, for terms not to exceed those allowed under the Federal Water Pollution Control Act.\n(c) The annual principal and interest payments must begin no later than one year after completion of the project. Loans must be fully amortized no later than 20 years after project completion, unless the recipient's average annual residential wastewater system cost after completion of the project would exceed 1.4 percent of median household income in the recipient governmental unit or entity, in which case the loan must be fully amortized no later than 30 years after project completion.\n(d) An eligible recipient shall establish a dedicated source of revenue for repayment of the loan.\n(e) The fund must be credited with all payments of principal and interest on all loans.\n(f) A loan may not be used to pay operating expenses or current obligations, unless specifically allowed by the Federal Water Pollution Control Act.\n(g) A loan made by the authority must be secured by notes or bonds of the eligible recipient of the loan.\n(a) The clean water revolving fund may be used as provided in title VI of the Federal Water Pollution Control Act, including the following uses:\n(1) to buy or refinance the debt obligation of governmental units for treatment works where debt was incurred and construction begun after March 7, 1985, at or below market rates;\n(2) to guarantee or purchase insurance for local obligations to improve credit market access or reduce interest rates;\n(3) to provide a source of revenue or security for the payment of principal and interest on revenue or general obligation bonds issued by the authority if the bond proceeds are deposited in the fund;\n(4) to provide loan guarantees, loans, or set-aside for similar revolving funds established by a governmental unit other than state agencies, or state agencies under sections 17.117, 103F.725, subdivision 1a, and 116J.617;\n(5) to earn interest on fund accounts;\n(6) to pay the reasonable costs incurred by the authority and the Pollution Control Agency of administering the fund and conducting activities required under the Federal Water Pollution Control Act, including water quality management planning under section 205(j) of the act and water quality standards continuing planning under section 303(e) of the act;\n(7) to provide principal forgiveness or grants to the extent permitted under the Federal Water Pollution Control Act and other federal law, based on the criteria and requirements established for the wastewater infrastructure funding program under section 446A.072; and\n(8) to provide loans, principal forgiveness, or grants to the extent permitted under the Federal Water Pollution Control Act and other federal law to address green infrastructure, water or energy efficiency improvements, or other environmentally innovative activities.\n(b) Amounts spent under paragraph (a), clause (6), may not exceed the amount allowed under the Federal Water Pollution Control Act.\n(c) Principal forgiveness or grants provided under paragraph (a), clause (8), may not exceed 25 percent of the eligible project costs as determined by the Pollution Control Agency for project components directly related to green infrastructure, water or energy efficiency improvements, or other environmentally innovative activities, up to a maximum of $1,000,000.\nPayments from the fund must be made in accordance with the applicable state and federal law governing the payments, except that for projects other than those funded under section 17.117, 103F.725, subdivision 1a, 116J.617, or 462A.05, no payment for a project may be made to an eligible recipient until and unless the authority has determined the total estimated cost of the project and ascertained that financing of the project is assured by:\n(1) a loan authorized by state law or the appropriation of proceeds of bonds or other money of the governmental unit to a fund for the construction of the project; and\n(2) an irrevocable undertaking, by resolution of the eligible recipient of the governmental unit, to use all money made available for the project exclusively for the project, and to pay any additional amount by which the cost of the project exceeds the estimate by the appropriation to the construction fund of additional money or the proceeds of additional bonds to be issued by the eligible recipient.\nMS 2006 [Repealed by amendment, 2007 c 96 art 1 s 5]\nThe Pollution Control Agency shall adopt rules relating to the certification of projects to the authority for funding, and other matters that the Pollution Control Agency considers necessary for proper administration of its duties under this section. Eligible activities are those required under the Federal Water Pollution Control Act of 1987, as amended.",
	"repealed": false
}