{
	"id": "79.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.081",
	"title": "79.081 MANDATORY DEDUCTIBLES.",
	"text": "Each insurer, including the assigned risk plan, issuing a policy of insurance, must make available to an employer, upon request, the option to agree to pay an amount per claim selected by the employer and specified in the policy toward the total of any claim payable under chapter 176. The amount of premium to be paid by an employer who selects a policy with a deductible shall be reduced based upon a rating schedule or rating plan filed with and approved by the commissioner of commerce. Administration of claims shall remain with the insurer as provided in the terms and conditions of the policy. Each insurer shall notify its agents authorized to write workers' compensation insurance about the availability and terms and conditions of deductibles required by this section, using a brochure in a format approved by the commissioner.\nIf an insured employer chooses a deductible, the insured employer is liable for the amount of the deductible. The insurer shall administer the claim as provided in the terms and conditions of the insurance policy and seek reimbursement from the insured employer for the deductible. The payment or nonpayment of deductible amounts by the insured employer to the insurer shall be treated under the policy insuring the liability for workers' compensation in the same manner as payment or nonpayment of premiums.\nAn insurer is not required to offer a deductible to an employer if, as a result of a credit investigation, the insurer determines that the employer is not sufficiently financially stable to be responsible for the payment of deductible amounts.\nThe existence of an insurance contract with a deductible or the fact of payment as a result of a deductible does not affect the requirement of an employer to report an injury or death to an insurer or the commissioner of labor and industry.\nNothing in this section alters the obligation of the employer to provide the benefits required by this chapter. An employee is not responsible to pay all or a part of the deductible chosen by an employer.",
	"repealed": false
}