{
	"id": "97A.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.085",
	"title": "97A.085 GAME REFUGES.",
	"text": "All state parks are designated as game refuges.\nThe commissioner may designate a game refuge if more than 50 percent of the area is in public ownership. The game refuge must be a contiguous area of at least 640 acres unless it borders or includes a marsh, or other body of water or watercourse suitable for wildlife habitat.\nThe commissioner may designate a land area or portion of a land area described in a petition as a game refuge. The petition must be signed by the owner, the lessee, or the person in possession of each tract in the area. A certificate of the auditor of the county where the lands are located must accompany the petition stating that the persons named in the petition are the owners, lessees, or persons in possession of all of the land described according to the county records. The game refuge must be a contiguous area of at least 640 acres unless it borders or includes a marsh, or other body of water or watercourse suitable for wildlife habitat.\nThe commissioner may designate as a game refuge public waters or a contiguous area described in a petition, signed by 50 or more residents of the county where the public waters or area is located. The game refuge must be a contiguous area of at least 640 acres unless it borders or includes a marsh, or other body of water or watercourse suitable for wildlife habitat. The game refuge may be designated only if the commissioner finds that protected wild animals are depleted and are in danger of extermination, or that it will best serve the public interest. If any of the land area in the proposed game refuge is privately owned and the commissioner receives a petition opposing designation of the refuge signed by the owners, lessees, or persons in possession of at least 75 percent of the private land area within the proposed game refuge, the commissioner shall not designate the private lands as a game refuge.\nBefore designating a game refuge under this section, the commissioner must hold a public hearing within the county where the majority of the proposed game refuge exists. Notices of the time and place of the hearing must be posted in five conspicuous places within the proposed game refuge at least 15 days before the hearing. A notice of the hearing must be published in a legal newspaper in each county where the area is located at least seven days before the hearing.\nThe commissioner may designate a game refuge under this section for only specified species. The game refuge must be posted accordingly.\nA state game refuge includes all public lands, waters, highways, and railroad right-of-way within the refuge boundary and, in the discretion of the commissioner, may include adjacent public lands and waters.\n(a) The designation of a state game refuge is not effective until the boundary has been posted with notices that measure at least 12 inches.\n(b) The notices must be posted at intervals of not more than 500 feet or less along the boundary. The notices must also be posted at all public road entrances to the refuges, except where the boundary is also an international or state boundary in public waters. Where the boundary of a refuge extends more than 500 feet continuously through a body of water, instead of placing notices in the water, notices with the words, \"Adjacent Waters Included,\" may be placed on the shoreline at the intersection of the boundary and the water 20 feet or less above the high-water mark and at intervals of 500 feet or less along the shoreline.\n(c) A certification by the commissioner or the director of the Wildlife Division, or a certification filed with the commissioner or director by a conservation officer, refuge supervisor, or other authorized officer or employee, stating that the required notices have been posted is prima facie evidence of the posting.\nA state game refuge may be vacated or modified by the commissioner under the same procedures required for establishment of the refuge, except that a refuge established or modified under subdivision 2 or 3 may be vacated or modified following a public hearing as specified in subdivision 4a.\nNotwithstanding subdivision 8, the commissioner may vacate a state game refuge by publishing a notice in the State Register if the refuge has been open to trapping and hunting small game including waterfowl, deer or bear by archery, and deer or bear by firearms for at least five years.",
	"repealed": false
}