{
	"id": "325G.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.042",
	"title": "325G.042 CONSUMER CREDIT; EQUAL TREATMENT OF SPOUSES.",
	"text": "To the extent that a creditor considers credit history in evaluating the credit worthiness of similarly qualified applicants for a similar type and amount of credit, in evaluating an applicant's credit worthiness, a creditor shall consider:\n(1) the credit history, when available, of accounts designated as accounts that the applicant and the applicant's spouse are permitted to use or for which both are contractually liable;\n(2) at the applicant's request, any information the applicant may present that tends to indicate that the credit history being considered by the creditor does not accurately reflect the applicant's creditworthiness; and\n(3) at the applicant's request, the credit history, when available, of any account reported in the name of the applicant's spouse or former spouse that the applicant can demonstrate accurately reflects the applicant's credit worthiness.\n(a) A creditor that furnishes credit information shall designate:\n(1) any new credit account to reflect the participation of both spouses if the applicant's spouse is contractually liable on the account, other than as a guarantor, surety, endorser, or similar party; and\n(2) any existing credit account to reflect such participation, within 90 days after receiving a written request to do so from one of the spouses.\n(b) If a creditor furnishes credit information to a consumer reporting agency concerning a credit account designated to reflect the participation of both spouses, the creditor shall furnish the information in a manner that will enable the agency to provide access to the information in the name of each spouse.\n(c) If a creditor furnishes credit information in response to an inquiry concerning a credit account designated to reflect the participation of both spouses, the creditor shall furnish the information in the name of the spouse about whom the information is requested.\nA creditor's failure to comply with this section is not a violation if it results from an inadvertent error, provided that the creditor promptly, and at no cost to the applicant or borrower, rectified the error after it was brought to the creditor's attention.\n(a) Enforcement of this section is under section 8.31, except that in a private cause of action under section 8.31, subdivision 3a, the damages are limited to $1,000 and the plaintiff has no right to recover costs of investigation and attorney fees.\n(b) No one may bring a private cause of action under this section unless the individual has first in good faith attempted to correct the problem with the party violating the section.\nCompliance with the requirements of the Federal Consumer Credit Protection Act, title VII (Equal Credit Opportunity), United States Code, title 15, section 1691 et seq., as amended and the regulations promulgated under those sections dealing with the subject matter of this section, shall be deemed to be in compliance with this section.\nFor purposes of this section, the term \"account\" means an extension of consumer credit and the word \"use\" in relation to an account refers only to open-end credit.",
	"repealed": false
}