{
	"id": "253B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.08",
	"title": "253B.08 JUDICIAL COMMITMENT; HEARING PROCEDURES.",
	"text": "(a) The hearing on the commitment petition shall be held within 14 days from the date of the filing of the petition, except that the hearing on a commitment petition pursuant to section 253D.07 shall be held within 90 days from the date of the filing of the petition. For good cause shown, the court may extend the time of hearing up to an additional 30 days. The proceeding shall be dismissed if the proposed patient has not had a hearing on a commitment petition within the allowed time.\n(b) The proposed patient, or the head of the treatment facility or state-operated treatment program in which the patient is held, may demand in writing at any time that the hearing be held immediately. Unless the hearing is held within five days of the date of the demand, exclusive of Saturdays, Sundays, and legal holidays, the petition shall be automatically dismissed if the patient is being held in a treatment facility or state-operated treatment program pursuant to court order. For good cause shown, the court may extend the time of hearing on the demand for an additional ten days. This paragraph does not apply to a commitment petition brought under section 253B.18 or chapter 253D.\nThe proposed patient, patient's counsel, the petitioner, the county attorney, and any other persons as the court directs shall be given at least five days' notice that a hearing will be held and at least two days' notice of the time and date of the hearing, except that any person may waive notice. Notice to the proposed patient may be waived by patient's counsel.\nThe hearing shall be conducted in a manner consistent with orderly procedure. The hearing shall be held at a courtroom meeting standards prescribed by local court rule which may be at a treatment facility or state-operated treatment program. The hearing may be conducted by interactive video conference under General Rules of Practice, rule 131, and Minnesota Rules of Civil Commitment, rule 14.\nAll persons to whom notice has been given may attend the hearing and, except for the proposed patient's counsel, may testify. The court shall notify them of their right to attend the hearing and to testify. The court may exclude any person not necessary for the conduct of the proceedings from the hearings except any person requested to be present by the proposed patient. Nothing in this section shall prevent the court from ordering the sequestration of any witness or witnesses other than the petitioner or the proposed patient.\n[Repealed, 1997 c 217 art 1 s 118]\n(a) The court may permit the proposed patient to waive the right to attend the hearing if it determines that the waiver is freely given. At the time of the hearing, the proposed patient shall not be so under the influence of drugs, medication, or other treatment so as to be hampered in participating in the proceedings. When the professional responsible for the proposed patient's treatment is of the opinion that the discontinuance of medication or other treatment is not in the best interest of the proposed patient, the court, at the time of the hearing, shall be presented a record of all medication or other treatment which the proposed patient has received during the 48 hours immediately prior to the hearing.\n(b) The court, on its own motion or on the motion of any party, may exclude or excuse a proposed patient who is seriously disruptive or who is incapable of comprehending and participating in the proceedings. In such instances, the court shall, with specificity on the record, state the behavior of the proposed patient or other circumstances justifying proceeding in the absence of the proposed patient.\nThe proposed patient or the patient's counsel and the county attorney may present and cross-examine witnesses, including court examiners, at the hearing. The court may in its discretion receive the testimony of any other person. Opinions of court examiners may not be admitted into evidence unless the court examiner is present to testify, except by agreement of the parties.\n[Repealed, 1997 c 217 art 1 s 118]\nThe court shall admit all relevant evidence at the hearing. The court shall make its determination upon the entire record pursuant to the Rules of Evidence.\nIn any case where the petition was filed immediately following a criminal proceeding in which the proposed patient was acquitted under section 611.026, the court shall take judicial notice of the record of the criminal proceeding.\nThe court shall keep accurate records containing, among other appropriate materials, notations of appearances at the hearing, including witnesses, motions made and their disposition, and all waivers of rights made by the parties. The court shall take and preserve an accurate stenographic record or tape recording of the proceedings.",
	"repealed": false
}