{
	"id": "473.446",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.446",
	"title": "473.446 TRANSIT TAX LEVIES.",
	"text": "(a) For the purposes of sections 473.405 to 473.449 and the metropolitan transit system, except as otherwise provided in this subdivision, the council shall levy each year upon all taxable property within the metropolitan area, defined in section 473.121, subdivision 2, a transit tax consisting of:\n(1) an amount necessary to provide full and timely payment of certificates of indebtedness, bonds, including refunding bonds or other obligations issued or to be issued under section 473.39 by the council for purposes of acquisition and betterment of property and other improvements of a capital nature and to which the council has specifically pledged tax levies under this clause; and\n(2) an additional amount necessary to provide full and timely payment of certificates of indebtedness issued by the council, after consultation with the commissioner of management and budget, if revenues to the metropolitan area transit fund in the fiscal year in which the indebtedness is issued increase over those revenues in the previous fiscal year by a percentage less than the percentage increase for the same period in the revised Consumer Price Index for all urban consumers for the St. Paul-Minneapolis metropolitan area prepared by the United States Department of Labor.\n(b) Indebtedness to which property taxes have been pledged under paragraph (a), clause (2), that is incurred in any fiscal year may not exceed the amount necessary to make up the difference between (1) the amount that the council received or expects to receive in that fiscal year from the metropolitan area transit fund and (2) the amount the council received from that fund in the previous fiscal year multiplied by the percentage increase for the same period in the revised Consumer Price Index for all urban consumers for the St. Paul-Minneapolis metropolitan area prepared by the United States Department of Labor.\nMS 2000 [Repealed, 1Sp2001 c 5 art 3 s 96]\nMS 2000 [Repealed, 1Sp2001 c 5 art 3 s 96]\nThe metropolitan transit taxing district is hereby designated as that portion of the metropolitan transit area lying within the following named cities, towns, or unorganized territory within the counties indicated:\n(a) Anoka County. Anoka, Blaine, Centerville, Columbia Heights, Coon Rapids, Fridley, Circle Pines, Hilltop, Lexington, Lino Lakes, Spring Lake Park;\n(b) Carver County. Chanhassen, the city of Chaska;\n(c) Dakota County. Apple Valley, Burnsville, Eagan, Inver Grove Heights, Lilydale, Mendota, Mendota Heights, Rosemount, South St. Paul, Sunfish Lake, West St. Paul;\n(d) Ramsey County. All of the territory within Ramsey County;\n(e) Hennepin County. Bloomington, Brooklyn Center, Brooklyn Park, Champlin, Chanhassen, Crystal, Deephaven, Eden Prairie, Edina, Excelsior, Golden Valley, Greenwood, Hopkins, Long Lake, Maple Grove, Medicine Lake, Minneapolis, Minnetonka, Minnetonka Beach, Mound, New Hope, Orono, Osseo, Plymouth, Richfield, Robbinsdale, St. Anthony, St. Louis Park, Shorewood, Spring Park, Tonka Bay, Wayzata, Woodland, the unorganized territory of Hennepin County;\n(f) Scott County. Prior Lake, Savage, Shakopee;\n(g) Washington County. Baytown, the city of Stillwater, White Bear Lake, Bayport, Birchwood, Cottage Grove, Dellwood, Lake Elmo, Landfall, Mahtomedi, Newport, Oakdale, Oak Park Heights, Pine Springs, St. Paul Park, Willernie, Woodbury.\nThe Metropolitan Council in its sole discretion may provide transit service by contract beyond the boundaries of the metropolitan transit taxing district or to cities and towns within the taxing district which are receiving financial assistance under section 473.388, upon petition therefor by an interested city, township or political subdivision within the metropolitan transit area. The Metropolitan Council may establish such terms and conditions as it deems necessary and advisable for providing the transit service, including such combination of fares and direct payments by the petitioner as will compensate the council for the full capital and operating cost of the service and the related administrative activities of the council. The amount of the levy made by any municipality to pay for the service shall be disregarded when calculation of levies subject to limitations is made, provided that cities and towns receiving financial assistance under section 473.388 shall not make a special levy under this subdivision without having first exhausted the available local transit funds as defined in section 473.388. The council shall not be obligated to extend service beyond the boundaries of the taxing district, or to cities and towns within the taxing district which are receiving financial assistance under section 473.388, under any law or contract unless or until payment therefor is received.\nThe provisions of subdivisions 1 and 2 or any other law changing the boundaries of the metropolitan transit taxing district or reducing the levy otherwise required to be levied within the district shall not be deemed to impair the rights of holders of outstanding indebtedness to require the levy of property taxes, if necessary to provide for any deficiency in accordance with the conditions of such indebtedness, on all property within the limits of the metropolitan transit taxing district as such limits were in effect at the date of issuance of such indebtedness.\nEach county treasurer shall collect and make settlement of the taxes levied under subdivisions 1 and 1a with the treasurer of the council. The levy of transit taxes pursuant to this section shall not affect the amount or rate of taxes which may be levied by any county or municipality or by the council for other purposes authorized by law and shall be in addition to any other property tax authorized by law.\nMS 1976 [Repealed, 1977 c 454 s 49]\nMS 1976 [Repealed, 1977 c 454 s 49]\nMS 1984 [Repealed, 1Sp1985 c 10 s 123 subd 1]\nBeginning for taxes levied in 1984, payable in 1985, and for each succeeding year, as part of its levy made pursuant to subdivisions 1 and 6, the council shall levy the amounts necessary to provide full and timely payment of certificates of indebtedness, bonds, and other obligations of the former Metropolitan Transit Commission, until all debt of the commission is fully discharged and transfer the proceeds to the appropriate council account for payment of its obligations. The taxes must be levied, certified, and collected in accordance with the terms and conditions of the indebtedness. Nothing in Laws 1984, chapter 654 may impair the rights of holders of valid obligations of the former Metropolitan Transit Commission to require a levy of property taxes. The council shall take the actions necessary to comply with the terms and conditions of the obligations, including if necessary the levy of property taxes to provide for a deficiency.\nThe commissioner of revenue shall certify the council's levy limitation under this section to the council by August 1 of the levy year. The council must certify its proposed property tax levy under this section to the commissioner of revenue by September 1 of the levy year. The commissioner of revenue shall annually determine whether the property tax for transit purposes certified by the council for levy following the adoption of its proposed budget is within the levy limitation imposed by subdivisions 1 and 1b. The commissioner shall also annually determine whether the transit tax imposed on all taxable property within the metropolitan transit area but outside of the metropolitan transit taxing district is within the levy limitation imposed by subdivision 1a. The determination must be completed prior to September 10 of each year. If current information regarding market valuation in any county is not transmitted to the commissioner in a timely manner, the commissioner may estimate the current market valuation within that county for purposes of making the calculations.",
	"repealed": false
}