{
	"id": "383A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.32",
	"title": "383A.32 PURCHASING.",
	"text": "(a) Joint program. Notwithstanding a charter provision, city ordinance, or prior law to the contrary pertaining to buying by the city of Saint Paul or the county of Ramsey, and to promote competitive bidding, effect economies in volume buying, and provide better service, the city of Saint Paul and the county of Ramsey shall establish a joint buying program.\n(b) Saint Paul Purchasing Department to be used. The county of Ramsey shall buy, or contract for, the supplies, materials, equipment and contractual services required by each department or agency of the county government through the facilities of the city of Saint Paul purchasing department and, for this service, shall pay to the city the cost incurred in providing the service. The cost is determined through an analysis and evaluation of all purchases processed through December 31, 1959, and thereafter through each succeeding year. The manner and method of computing this cost is the joint responsibility of the county and the city.\n(c) Saint Paul city charter provisions reserved. All of the charter provisions of the city of Saint Paul pertaining to the procedures, rules, and regulations in the field of buying goods, wares, and merchandise are in their entirety reserved in full.\n(d) Standardization committee. A permanent Committee on Standardization of Purchases for the city of Saint Paul and the county of Ramsey is established, to be composed, on an equal basis, of representatives of the city of Saint Paul, the county of Ramsey, and other governmental units permitted to buy through the city purchasing department. The city council shall choose the members of the committee on standardization for the city, and the board of county commissioners, for the county. The committee shall agree on single specifications for each item commonly used in each of the governmental units to combine their purchasing power.\n(e) Central stock room. As soon as practical after the establishment of the central purchasing program, the city of Saint Paul and the county of Ramsey shall establish a central office supply stock room. The permanent committee on standardization of purchases shall provide for inventory control procedures and the method and manner of distribution of supplies and materials from the central stock room. Each of the governmental units participating in the central buying program shall contribute the amount that is jointly agreed upon into a revolving fund established for the operation of the central stock room, and shall pay, from time to time, into the revolving fund the money required to cover overhead, in addition to the cost of materials and supplies obtained therefrom. The city of Saint Paul and its purchasing department shall administer and account for the revolving fund.\n(f) Warehouse. The city of Saint Paul and the county of Ramsey shall provide adequate warehouse and storage space for each item that is practical to store and the buying of which, in quantities greater than current needs, will secure a distinct financial advantage to these governmental subdivisions.\n(g) County purchasing. If the county elects to have its own purchasing officer as provided in the charter, this subdivision shall not apply to the county.\n(a) Ramsey County may buy articles or supplies that are sold at a uniform price, by reason of a patent, copyright, or exclusive franchise, without advertisement and competitive bids, where no advantage can be secured by advertisement and competitive bidding.\n(b) Before making such a purchase, the county board shall adopt a finding to the effect that the particular purchase is made pursuant to this subdivision.\nNotwithstanding the charter of the city of Saint Paul or prior statutory enactments relating to buying by the city of Saint Paul and the county of Ramsey to the contrary, the council of the city of Saint Paul, the Ramsey County Board of Commissioners, and the governing body of any municipal subdivision governed by this section may waive the requirements for a performance bond on each purchase of materials and supplies. For bids requiring labor and material or labor alone, and bid in accordance with section 471.345, subdivision 4 or 5, performance bonds may be waived. For bids requiring labor and material or labor alone, and bid in accordance with section 471.345, subdivision 3, performance bonds or equivalent financial security shall be required.",
	"repealed": false
}