{
	"id": "353.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.031",
	"title": "353.031 DISABILITY DETERMINATION PROCEDURES.",
	"text": "(a) This section applies to all disability determinations for the public employees general fund, the public employees police and fire fund, and the local government correctional service retirement plan and any other disability determination subject to approval by the board, except as otherwise specified in section 353.032, 353.33, 353.656, or 353E.05. These requirements and the requirements of section 353.03, subdivision 3, are in addition to the specific requirements of each plan and govern in the event there is any conflict between these sections and the procedures specific to any of those plans under section 353.33, 353.656, or 353E.06.\n(b) Notwithstanding any law to the contrary, an employee, as defined in section 353.032, subdivision 1, clause (2), who applies for a duty disability benefit based on a psychological condition, as defined in section 353.032, subdivision 1, clause (7), is not eligible for duty disability benefits under this chapter until the employee has satisfied the additional procedure, including all completion of treatment requirements under section 353.032.\nDisability determinations for the public employees general fund must be made subject to section 353.01, subdivision 19; and for the police and fire plan and the local government correctional service retirement plan must be made consistent with the legislative policy and intent set forth in section 353.63.\n(a) Every claim for a disability benefit must be initiated in writing on an application form and in the manner prescribed by the executive director and filed with the executive director. To be valid, an application for disability benefits must be made within 18 months following termination of public service as defined under section 353.01, subdivision 11a, and include the required application form and the medical reports required by paragraph (c).\n(b) All medical reports must support a finding that the disability arose before the employee was placed on any paid or unpaid leave of absence or terminated public service, as defined under section 353.01, subdivision 11a.\n(c) An applicant for disability shall provide a detailed report signed by a licensed medical doctor and at least one additional report signed by a medical doctor, psychiatrist, psychologist, APRN, or chiropractor. The applicant must authorize the release of all medical and health care evidence, including all medical records and relevant information from any source, to support the application for initial, or the continuing payment of, disability benefits.\n(d) All reports must contain an opinion regarding the applicant's prognosis, the duration of the disability, and the expectations for improvement. Any report that does not contain and support a finding that the disability will last for at least one year may not be relied upon to support eligibility for benefits.\n(e) Where the medical evidence supports the expectation that at some point in time the applicant will no longer be disabled, any decision granting disability may provide for a termination date upon which disability can be expected to no longer exist. In the event a termination date is made part of the decision granting benefits, prior to the actual termination of benefits, the applicant shall have the opportunity to show that the disabling condition for which benefits were initially granted continues. In the event the benefits terminate in accordance with the original decision, the applicant may petition for review under section 356.96 or may reapply for disability in accordance with these procedures and section 353.33, 353.656, or 353E.06, as applicable.\n(f) Upon receipt of a valid application, the executive director must notify the employer. No later than 30 days after receiving the notification, the employer must provide a report to the executive director indicating that there is no available work that the applicant can perform in the applicant's disabled condition and that all reasonable accommodations have been considered. Upon request of the executive director, an employer shall provide evidence of the steps the employer has taken to attempt to provide reasonable accommodations and continued employment to the applicant. The employer shall also provide a certification of the applicant's past public service; the dates of any paid sick leave, vacation, or any other employer-paid salary continuation plan beyond the last working day; and whether or not any sick or annual leave has been allowed.\n(g) An applicant who is placed on leave of absence without compensation because of a disability is not barred from receiving a disability benefit.\n(h) An applicant for disability benefits may file a retirement annuity application under section 353.29, subdivision 4, simultaneously with an application for disability benefits. If the application for disability benefits is approved, the retirement annuity application is canceled. If disability benefits are denied, the retirement annuity application must be processed upon the request of the applicant. No member of the general employees retirement plan, the police and fire plan, or the local government correctional service retirement plan may receive a disability benefit and a retirement annuity simultaneously from the same plan.\n(a) If an application for disability benefits is filed within two years of the date of the injury or the onset of the illness that gave rise to the disability application, the application must be supported by evidence that the applicant is unable to perform the duties of the position held by the applicant on the date of the injury or the onset of the illness causing the disability. The employer must provide evidence indicating whether the applicant is able or unable to perform the duties of the position held on the date of the injury or onset of the illness causing the disability, a clear explanation of any duties that the individual can or cannot perform, and an explanation of why the employer may or may not authorize continued employment to the applicant in the current or other position.\n(b) If an application for disability benefits is filed more than two years after the date of injury or the onset of an illness causing the disability, the application must be supported by evidence that the applicant is unable to perform the duties that were expected to be performed by the applicant during the 90 days preceding the last day the applicant performed services for the employer. The employer must provide evidence of the duties that were expected to be performed by the applicant during the 90 days preceding the last day the applicant performed services, whether the applicant can or cannot perform those duties overall, a clear explanation of any duties that the applicant can or cannot perform, and an explanation of why the employer may or may not authorize continued employment to the applicant in the current or other position.\n(c) Any report supporting a claim to disability benefits under section 353.656 or 353E.06 must specifically relate the disability to its cause; and for any claim to duty disability from an injury or illness arising out of an act of duty, the report must state the specific act of duty giving rise to the claim, and relate the cause of disability to inherently dangerous duties specific to the positions covered by the public employees police and fire plan and the local government correctional service retirement plan. Any report that does not relate the cause of disability to specific inherently dangerous duties performed by the employee may not be relied upon as evidence to support eligibility for benefits and may be disregarded in the executive director's decision-making process.\n(d) Any application for duty disability must be supported by a first report of injury as defined in section 176.231.\n(e) If a member who has applied for and been approved for disability benefits before the termination of service does not terminate service or is not placed on an authorized leave of absence as certified by the governmental subdivision within 45 days following the date on which the application is approved, the application shall be canceled. If an approved application for disability benefits has been canceled, a subsequent application for disability benefits may not be filed on the basis of the same medical condition for a minimum of one year from the date on which the previous application was canceled.\n(f) Notwithstanding section 353.01, subdivision 41, if the member has applied for a duty disability based on a psychological condition, the application must be supported by evidence that the applicant is unable to perform the duties of the position held by the applicant on the date of injury or the onset of the illness or to another position with the employer which provides salary and employer-provided benefits, including pension benefits, that are equal to or greater than those for the position held by the employee on the date of the injury, event, or onset of the mental illness.\nThe executive director may contract with an accredited independent organization specializing in disability determinations or a licensed physician to be the medical adviser of the association. The medical adviser shall review all medical reports submitted to the association, including the findings of an independent medical examination requested under this section, and shall advise the executive director.\nAny individual applying for or receiving disability benefits must submit to an independent medical examination if requested by the executive director. The medical examination must be paid for by the association.\nIf a person applying for or receiving a disability benefit refuses to submit to a medical examination under subdivision 6, or fails to provide or to authorize the release of medical evidence under subdivision 3 or 8, the association shall cease the application process or shall discontinue the payment of a disability benefit, whichever is applicable. Upon the receipt of the requested medical evidence, the association shall resume the application process or the payment of a disability benefit upon approval for the continuation, whichever is applicable.\n(a) A person must not be paid a disability benefit except upon furnishing adequate proof to the executive director of the association that the person is disabled and, upon reapplication, that the disability is the same disability for which disability benefits were initially granted.\n(b) At the end of each year of disability payments for the first five years of disability payments and at the end of every three years of disability payments thereafter, the person receiving the disability payments must reapply and provide proof of disability to the executive director of the association. The executive director has the right, between applications, to require the person to submit proof of the continuance of the disability claimed.\n(c) Adequate proof of a disability upon reapplication must include a written expert report by a licensed physician, an APRN, or a licensed chiropractor, or, with respect to a mental impairment, a licensed psychiatrist or psychologist.\n(d) The reapplication requirement may be waived by the executive director if the executive director receives a written statement from the medical adviser retained by the association under subdivision 5 that no improvement can be expected in the person's disability condition that was the basis for the payment of the disability benefit.\n(e) If the person's reapplication is denied, the person bears the burden of proving eligibility for a disability benefit in an appeal under section 356.96.\nAny decision of the executive director is final, except that a member whose application for disability benefits or whose reapplication under subdivision 8 is denied may appeal the executive director's decision to the board of trustees under section 356.96. In developing the record for review by the board when a decision is appealed, the executive director may direct that the applicant participate in a fact-finding session conducted by an administrative law judge assigned by the Office of Administrative Hearings, and, as applicable, a vocational assessment conducted by the qualified rehabilitation counselor on contract with the association.\nTo restore forfeited service and salary credit, a repayment of a refund must be made within six months after the effective date of disability benefits or within six months after the date of the filing of the disability application, whichever is later, except that the salary credit purchase for periods of reduced salary must be made as authorized under section 353.0162.",
	"repealed": false
}