{
	"id": "473.4051",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.4051",
	"title": "473.4051 GUIDEWAYS AND BUSWAYS; CONSTRUCTION AND OPERATION.",
	"text": "The council must operate all light rail transit facilities and services located in the metropolitan area upon completion of construction of the facilities and the commencement of revenue service using the facilities. The council may not allow the commencement of revenue service until after an appropriate period of acceptance testing to ensure safe and satisfactory performance. In assuming the operation of the system, the council must comply with section 473.415. The council must coordinate operation of the light rail transit system with bus service to avoid duplication of service on a route served by light rail transit and to ensure the widest possible access to light rail transit lines in both suburban and urban areas by means of a feeder bus system.\n(a) After operating revenue, federal funds, and state funds are used for operations of a guideway or busway, as the terms are defined in section 473.4485, subdivision 1, the council must pay all remaining operating costs from sales tax revenue, as defined in section 473.4465, subdivision 1.\n(b) The requirements under paragraph (a) do not apply to the costs of Northstar Commuter Rail attributed to operations outside of a metropolitan county.\n(a) The council must pay all ongoing capital maintenance costs from one or more of: available federal funds; sales tax revenue, as defined in section 473.4465, subdivision 1; and proceeds from certificates of indebtedness, bonds, or other obligations under section 473.39.\n(b) For purposes of this subdivision, \"capital maintenance\" includes routine maintenance, capital maintenance, and maintenance in a state of good repair.\nState money may not be used to pay more than ten percent of the total capital cost of a light rail transit project.\n(a) The council must design, fully scope, and construct each arterial bus rapid transit project with the following elements:\n(1) sidewalk curb ramps and pedestrian signals that meet current Americans with Disabilities Act standards as of the time of engineering completion at the four intersection quadrants of an intersection adjacent to a bus rapid transit station;\n(2) transit pavement markings, as applicable; and\n(3) traffic signal transit priority modifications, where feasible and reasonable, to improve speed and efficiency of service.\n(b) The requirements under paragraph (a), clause (1), include intersection infrastructure that serves the bus rapid transit station from the opposite side of a street. The requirements under paragraph (a), clause (1), exclude locations that are:\n(1) compliant with current Americans with Disabilities Act standards as of the time of engineering completion for the project; or\n(2) otherwise included in a programmed and colocated roadway construction project.\n(c) For bus rapid transit project costs resulting from the requirements under paragraph (a), clause (1), the council must pay 50 percent of the costs and the unit of government with jurisdiction over the road must pay 50 percent of the costs. The council must pay the project costs resulting from the requirements under paragraph (a), clauses (2) and (3).",
	"repealed": false
}