{
	"id": "252.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.27",
	"title": "252.27 CHILDREN'S SERVICES; PARENTAL CONTRIBUTION.",
	"text": "Whenever any child who has a developmental disability, or a physical disability or emotional disturbance is in 24-hour care outside the home including respite care, in a facility licensed by the commissioner of human services, the cost of services shall be paid by the county of financial responsibility determined pursuant to chapter 256G. If the child's parents or guardians do not reside in this state, the cost shall be paid by the responsible governmental agency in the state from which the child came, by the parents or guardians of the child if they are financially able, or, if no other payment source is available, by the commissioner of human services.\nMS 2022 [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]\nMS 2022 [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]\nMS 2023 Supp [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]\n(a) Parental or guardian responsibility for the child's cost of care incurred by counties shall be up to the maximum amount of the total income and resources attributed to the child except for the clothing and personal needs allowance as provided in section 256B.35, subdivision 1. Reimbursement by the parents or guardians shall be made to the county making any payments for services.\n(b) Notwithstanding paragraph (a), the county board may require payment of the full cost of caring for children whose parents or guardians do not reside in this state.\n(c) To the extent that a child described in subdivision 1 is eligible for benefits under chapter 62A, 62C, 62D, 62E, or 64B, the county is not liable for the cost of services.\n[Repealed, 1995 c 207 art 6 s 124]\nMS 2022 [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]\n[Repealed, 1986 c 414 s 5]\nMS 2022 [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]\nMS 2022 [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]\nMS 2022 [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]",
	"repealed": false
}