{
	"id": "127A.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.215",
	"title": "127A.215 COMPREHENSIVE SCHOOL MENTAL HEALTH SERVICES LEAD.",
	"text": "The department must employ a comprehensive school mental health services lead to serve as a source of information and support for schools in addressing the mental health needs of students, teachers, and school staff and developing comprehensive school mental health systems in school districts and charter schools.\n(a) The lead must, upon request, assist schools in assessing the quality of their comprehensive school mental health systems and developing improvement plans to implement evidence-based mental health resources, tools, and practices in school districts and charter schools throughout Minnesota.\n(b) The lead must establish a clearinghouse and provide information and resources for school districts, charter schools, teachers, school staff, and families to support students', teachers', and school staff's mental health needs.\n(c) The lead must work with school districts and charter schools to improve mental health infrastructure support by:\n(1) developing guidance and sharing resources on improving the quality of comprehensive school mental health systems;\n(2) developing and sharing resources on evidence-based strategies, behavioral interventions, and practices or techniques for addressing mental health needs, including implementing a comprehensive approach to suicide prevention;\n(3) facilitating coordination and cooperation to enable school districts and charter schools to share strategies, challenges, and successes associated with supporting the mental health needs of students, teachers, and staff;\n(4) providing advice, upon request, to schools on implementing trauma-informed and culturally responsive school-based programs that provide prevention or intervention services to students, teachers, and staff;\n(5) aligning resources among the different state agencies, including the Department of Education, Department of Human Services, and Department of Health, to ensure school mental health systems can efficiently access state resources; and\n(6) maintaining a comprehensive list of resources on the Department of Education website that schools may use to address students', teachers', and staff's mental health needs, including grant opportunities; community-based prevention and intervention services; model policies; written publications that schools may distribute to students, teachers, and staff; professional development opportunities; best practices; and other resources for mental health education under section 120B.21.\n(d) The lead may report to the legislature as necessary regarding students', teachers', and school staff's mental health needs; challenges in developing comprehensive school mental health services; successful strategies and outcomes; and recommendations for integrating mental health services and supports in schools.\nThe comprehensive school mental health services lead must consult with the Regional Centers of Excellence, the Department of Health, the Department of Human Services, the Minnesota School Safety Center, and other federal, state, and local agencies as necessary to identify or develop information, training, and resources to help school districts and charter schools support students', teachers', and school staff's mental health needs.",
	"repealed": false
}