{
	"id": "299A.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.49",
	"title": "299A.49 DEFINITIONS.",
	"text": "For the purposes of sections 299A.48 to 299A.52 and 299K.095, the following terms have the meanings given.\n\"Bomb squad\" means a team trained, equipped, and authorized by the commissioner to evaluate and provide disposal operations for bombs or other similar hazardous explosives. Bomb squad includes a bomb disposal unit as defined in section 299C.063.\nMS 2022 [Repealed by amendment, 2023 c 52 art 5 s 17]\n\"Commissioner\" means the commissioner of public safety.\n\"Emergency response incident\" means any incident to which the response of a state emergency response asset is required.\n\"Hazardous materials\" means substances or materials that, because of their chemical, physical, or biological nature, pose a potential risk to life, health, or property if they are released. \"Hazardous materials\" includes any substance or material in a particular form or quantity that may pose an unreasonable risk to health, safety, and property, or any substance or material in a quantity or form that may be harmful to humans, animals, crops, water systems, or other elements of the environment if accidentally or intentionally released. Hazardous substances so designated may include explosives, radioactive materials, etiologic agents, flammable liquids or solids, combustible liquids or solids, poisons, oxidizing or corrosive materials, chemical and biological substances, and toxic or flammable gases.\n\"Hazardous materials emergency response team\" means a team (1) trained, equipped, and authorized to evaluate and, when possible, provide practical mitigation to a hazardous materials incident and (2) required to recommend to the local incident manager the best means of controlling the hazard after consideration of life safety concerns, environmental effects, exposure hazards, quantity and type of hazardous material, availability of resources, and other relevant factors.\n\"Local unit of government\" means a county, home rule charter or statutory city, or town.\n\"Minnesota air rescue team\" means a team trained, equipped, and authorized by the commissioner to perform specialized air rescue operations.\n\"Person\" means any individual, partnership, association, public or private corporation or other entity including the United States government, any interstate body, the state, and any agency, department, or political subdivision of the state.\nMS 2022 [Repealed by amendment, 2023 c 52 art 5 s 17]\n\"State emergency response asset\" means any team or teams defined under this section that has entered into a contractual agreement with the State Fire Marshal Division.\n\"Urban search and rescue \" or \"US&R\" means a multihazard discipline that involves the location, extrication, and initial medical stabilization of victims trapped or missing because of a man-made or natural disaster.",
	"repealed": false
}