{
	"id": "473.386",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.386",
	"title": "473.386 SPECIAL TRANSPORTATION SERVICE.",
	"text": "The council shall implement a special transportation service, as defined in section 174.29, in the metropolitan area. The service has the following objectives:\n(a) to provide greater access to transportation for the elderly, people with disabilities, and others with special transportation needs in the metropolitan area;\n(b) to develop an integrated system of special transportation service providing transportation tailored to meet special individual needs in the most cost-efficient manner; and\n(c) to use existing public, private, and private nonprofit providers of service when feasible and cost-efficient, to supplement rather than replace existing service, and to increase the productivity of all special transportation vehicles available in the area.\n(a) The council may contract for services necessary for the provision of special transportation. Transportation service provided under a contract must specify the service to be provided, the standards that must be met, and the rates for operating and providing special transportation services.\n(b) The council shall establish management policies for the service and may contract with a service administrator for day-to-day administration and management of the service. Any contract must delegate to the service administrator clear authority to administer and manage the delivery of the service pursuant to council management policies and must establish performance and compliance standards for the service administrator. The council may provide directly day to day administration and management of the service and may own or lease vehicles used to provide the service.\n(c) The council shall ensure that the service administrator establishes a system for registering and expeditiously responding to complaints by users, informing users of how to register complaints, and requiring providers to report on incidents that impair the safety and well-being of users or the quality of the service.\n(d) The council shall report on its special transportation services as part of the program evaluation provided for in section 473.13, subdivision 1a.\n(e) The council shall provide, on an annual basis, an opportunity for users and other interested persons to provide testimony to the council concerning services provided under this section.\n(a) If the council requires a person to be certified as eligible for special transportation services, an applicant for certification must submit an application form and the applicant's eligibility must be verified by a type of professional specified by the council. The council shall:\n(1) require the applicant to sign the application form and certify that the application information is accurate; and\n(2) require the person verifying the applicant's eligibility to sign the eligibility verification form and certify that the verifying information is accurate.\n(b) The penalty provided for in section 174.295, subdivision 4, applies to the certifications by the applicant and the person verifying the applicant's eligibility. The council must include a notice of the penalty for fraudulent certification in the application form and the eligibility verification form.\nIn implementing the special transportation service, the council must:\n(1) encourage participation in the service by public, private, and private nonprofit providers of special transportation currently receiving capital or operating assistance from a public agency;\n(2) when feasible and cost-efficient, contract with public, private, and private nonprofit providers that have demonstrated their ability to effectively provide service at a reasonable cost;\n(3) encourage individuals using special transportation to use the type of service most appropriate to their particular needs;\n(4) encourage shared rides to the greatest extent practicable;\n(5) encourage public agencies that provide transportation to eligible individuals as a component of human services and educational programs to coordinate with this service and to allow reimbursement for transportation provided through the service at rates that reflect the public cost of providing that transportation;\n(6) establish criteria to be used in determining individual eligibility for special transportation services;\n(7) consult with the Transportation Accessibility Advisory Committee in a timely manner before changes are made in the provision of special transportation services;\n(8) provide for effective administration and enforcement of council policies and standards; and\n(9) ensure that, taken as a whole including contracts with public, private, and private nonprofit providers, the geographic coverage area of the special transportation service is continuous within the boundaries of the transit taxing district, as defined as of March 1, 2006, in section 473.446, subdivision 2, and any area added to the transit taxing district under section 473.4461 that received capital improvements financed in part under the United States Department of Transportation Urban Partnership Agreement program.\nThe council may not grant any financial assistance to any recipient that proposes to use any part of the grant to provide special transportation service in the metropolitan area unless the program is coordinated with the council's special transportation service in the manner determined by the council. The council is not required to provide funding for transportation services from a residence to a service site and home again when the services are used by individuals in conjunction with their participation in human service developmental achievement center programs in which transportation to and from the program is a required and funded component of those programs.\nThe council shall distribute all available funding under this section in a manner designed to achieve an equitable allocation of special transportation services based on the proportion of the number of elderly, disabled, or economically disadvantaged individuals with special transportation needs who actually use the special transportation service.\nA person operating or assisting the operation of a vehicle may leave the vehicle to enter premises in order to help a passenger who does not require emergency ambulance service. Operators and assistants shall provide the help necessary for door-through-door service, including help in entering and leaving the vehicle and help through the exterior entrance and over any exterior steps at either departure or destination buildings, provided that both the steps and the wheelchair are in good repair. If an operator or assistant refuses help because of the condition of the steps or the wheelchair, the operator of the service shall send letters to the service administrator designated by the council, who shall notify the person denied service describing the corrective measures necessary to qualify for service.\nMS 1986 [Repealed, 1987 c 88 s 13]\nThe Metropolitan Council may transfer to a special transportation service provider or a provider of taxi services the title to a vehicle formerly used to provide special transportation service under this section. If the council transfers title to a provider of taxi services, it may do so only to a provider of taxi services that is licensed by a city whose taxi licensing ordinance requires (1) criminal background checks and annual driving record checks for drivers, and (2) inspection of vehicles at least annually.\nThe council must establish fares for special transportation services in accordance with federal law. The council must use all fares collected for special transportation services exclusively for purposes related to special transportation services.\n(a) For purposes of this subdivision, \"biennium\" and \"fiscal year\" have the meanings given in section 16A.011, subdivisions 6 and 14, respectively.\n(b) In each February and November forecast of state revenues and expenditures under section 16A.103, the commissioner of management and budget must incorporate a state obligation from the general fund for the annual net costs to the council to implement the special transportation service under this section. Notwithstanding section 16A.11, subdivision 3, the appropriation base in each fiscal year of the upcoming biennium is as determined in this subdivision.\n(c) The commissioner must determine net costs under paragraph (b) as:\n(1) the amount necessary to:\n(i) maintain service levels accounting for expected demand, including service area, hours of service, ride scheduling requirements, and fares per council policy;\n(ii) maintain the general existing condition of the special transportation service bus fleet, including bus maintenance and replacement; and\n(iii) meet the requirements of this section; plus\n(2) the amount of forecast adjustments, as determined by the commissioner of management and budget in consultation with the council, necessary to match (i) actual special transportation service program costs in the prior fiscal year, and (ii) adjusted program costs forecasted for the second year of the current biennium, for a forecast prepared in the first year of the biennium; less\n(3) funds identified for the special transportation service from nonstate sources.\n(d) In conjunction with each February and November forecast, the council must submit a financial review of the special transportation service to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance and to the commissioner of management and budget. At a minimum, the financial review must include:\n(1) a summary of special transportation service sources of funds and expenditures for the prior two fiscal years and each fiscal year of the forecast period, which must include:\n(i) a breakout by expenditures categories; and\n(ii) information that is sufficient to identify a conversion between state fiscal years and the fiscal years of the council;\n(2) details on cost assumptions used in the forecast;\n(3) information on ridership and farebox recovery rates for the prior two fiscal years and each fiscal year of the forecast period;\n(4) identification of the amount of appropriations necessary for any forecast adjustments as identified under paragraph (c), clause (2); and\n(5) information as prescribed by the commissioner.\n[See Note.]",
	"repealed": false
}