{
	"id": "72A.2033",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.2033",
	"title": "72A.2033 INSURANCE PRODUCER TRAINING.",
	"text": "An insurance producer shall not solicit the sale of an annuity product unless the insurance producer has adequate knowledge of the product to recommend the annuity and the insurance producer is in compliance with the insurer's standards for product training. An insurance producer may rely on insurer-provided product-specific training standards and materials to comply with this section.\n(a) An insurance producer who is otherwise entitled to engage in the sale of annuity products shall complete a onetime four-credit training course approved by the commissioner and provided by a continuing education provider approved by the commissioner prior to commencing the transaction of annuities.\nInsurance producers who hold a life insurance line of authority on December 31, 2022, and who desire to sell annuities shall complete the requirements of this subdivision no later than six months after January 1, 2023. Individuals who obtain a life insurance line of authority on or after January 1, 2023, may not engage in the sale of annuities until the annuity training course required under this subdivision has been completed.\n(b) The length of the training required under this subdivision must be four continuing education hours.\n(c) The training required under this subdivision must include information on the following topics:\n(1) the types of annuities and various classifications of annuities;\n(2) identification of the parties to an annuity;\n(3) how fixed, variable, and indexed annuity contract provisions affect consumers;\n(4) the application of income taxation of qualified and nonqualified annuities;\n(5) the primary uses of annuities;\n(6) appropriate standard of conduct, sales practices, replacement, and disclosure requirements; and\n(7) the recognition of indicators that a prospective insured may lack the short-term memory or judgment to knowingly purchase an insurance product.\n(d) Providers of courses intended to comply with this subdivision shall cover all topics listed in the prescribed outline and shall not present any marketing information or provide training on sales techniques or provide specific information about a particular insurer's products.\n(e) A provider of an annuity training course intended to comply with this subdivision must be an approved continuing education provider in this state and comply with the requirements applicable to insurance producer continuing education courses.\n(f) An insurance producer licensed by December 31, 2022, who holds a life insurance line of authority and has previously completed the training in subdivision 2, paragraph (a), shall complete either:\n(1) a new four-credit training course approved by the Department of Commerce after July 1, 2022; or\n(2) an additional onetime one-credit training course approved by the Department of Commerce after July 1, 2022, and provided by a Department of Commerce-approved education provider on appropriate sales practices and replacement and disclosure requirements under sections 72A.203 to 72A.2036.\nAnnuity training courses may be conducted and completed by classroom or self-study methods in accordance with chapter 45. In order to assist compliance with this section, all courses approved by the commissioner for the purposes of this section shall be given the course title \"Best Interest Standards of Conduct for Annuity Sales.\" Only courses satisfying the requirements of this section shall use this course title after July 1, 2022.\n(g) Providers of annuity training shall comply with the course completion reporting requirements of chapter 45.\n(h) The satisfaction of the training requirements of another state that are substantially similar to the provisions of this subdivision satisfies the training requirements of this subdivision in this state.\n(i) The satisfaction of the components of the training requirements of any course or courses with components substantially similar to the provisions of this subdivision satisfy the training requirements of this subdivision.\n(j) An insurer shall verify that an insurance producer has completed the annuity training course required under this subdivision before allowing the insurance producer to sell an annuity product for that insurer. An insurer may satisfy its responsibility under this subdivision by obtaining certificates of completion of the training course or obtaining reports provided by commissioner-sponsored database systems, vendors, or from a reasonably reliable commercial database vendor that has a reporting arrangement with approved insurance education providers. If such data collection and reporting arrangements are not in place, an insurer must maintain records verifying that the producer has completed the annuity training course required under this subdivision and make the records available to the commissioner upon request.",
	"repealed": false
}