{
	"id": "162.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.12",
	"title": "162.12 ACCRUALS TO MUNICIPAL STATE-AID STREET FUND; ACCOUNTS.",
	"text": "By December 15 of each year the commissioner shall estimate the amount of money that will be available to the municipal state-aid street fund during that fiscal year. The amount available is based on actual receipts at the time of the allocation calculation, the unallocated fund balance, and the projected receipts for the remainder of the fiscal year. The total available, except for deductions as provided herein, shall be apportioned by the commissioner to the cities having a population of 5,000 or more as hereinafter provided.\nA sum of two percent shall be deducted from the total available in the municipal state-aid street fund, set aside in a separate account, and used for administration costs incurred by the state Transportation Department in carrying out the provisions relating to the municipal state-aid street system.\n(a) After deducting administrative costs as provided in subdivision 2, the commissioner shall set aside each year a sum of money equal to two percent of the remaining money in the municipal state-aid street fund to provide for a disaster account; provided, that the total amount of money in the disaster account must never exceed three percent of the total sums to be apportioned to the statutory and home rule charter cities having a population of 5,000 or more. The disaster account must be used to provide aid to any city encountering disaster or unforeseen event affecting the municipal state-aid street system of the city, and resulting in an undue and burdensome financial hardship.\n(b) Any city desiring aid by reason of disaster or unforeseen event shall request aid in the form required by the commissioner. Upon receipt of the request the commissioner shall appoint a board consisting of two representatives of the cities, who must be either a city engineer or member of the governing body of a city, from cities other than the requesting city, and a representative of the commissioner. The board shall investigate the matter and report its findings and recommendations in writing to the commissioner.\n(c) Final determination of the amount of aid, if any, to be paid to the city from the disaster account must be made by the commissioner. Upon determining to aid the city, the commissioner shall certify the amount payable to the fiscal officer of the city. Money so paid must be expended on the municipal state-aid street system in accordance with rules of the commissioner.\n(a) Each year the screening board, provided for in section 162.13, subdivision 3, may recommend to the commissioner a sum of money that the commissioner shall set aside from the municipal state-aid street fund and credit to a research account. The amount so recommended and set aside shall not exceed one-half of one percent of the preceding year's apportionment sum.\n(b) Any money so set aside shall be used by the commissioner for the purpose of:\n(1) conducting research for improving the design, construction, maintenance and environmental compatibility of municipal state-aid streets and appurtenances;\n(2) constructing research elements and reconstructing or replacing research elements that fail; and\n(3) conducting programs for implementing and monitoring research results.\n(c) Any balance remaining in the research account at the end of each year from the sum set aside for the year immediately previous, shall be transferred to the municipal state-aid street fund.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]",
	"repealed": false
}