{
	"id": "383A.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.81",
	"title": "383A.81 ENVIRONMENTAL RESPONSE FUND.",
	"text": "An environmental response fund is created for the purposes specified in this section. The taxes imposed by section 383A.80 must be deposited in the fund. The board of county commissioners shall administer the fund either as a county board or a housing and redevelopment authority.\n(a) The fund created in subdivision 1 must be used for the following purposes:\n(1) acquisition through purchase or condemnation of lands or property which are polluted or contaminated with hazardous substances;\n(2) paying the costs associated with indemnifying or holding harmless the entity taking title to lands or property from any liability arising out of the ownership, remediation, or use of the land or property;\n(3) paying for the costs of remediating the acquired land or property; or\n(4) paying the costs associated with remediating lands or property which are polluted or contaminated with hazardous substances.\n(b) No more than three percent of the fund may be used each year for the costs of administration.\nIn expending funds under this section, the county shall seek matching funds from contamination cleanup funds administered by the commissioner of the Department of Employment and Economic Development, the Metropolitan Council, the federal government, the private sector, and any other source.\nThe county may pledge the proceeds from the taxes imposed by section 383A.80 to bonds issued under this chapter and chapters 398A, 462, 469, and 475.\nThe first priority for the use of the environmental response fund created in this section is to clean up the site located in the city of St. Paul known as the Dale Street Shops and Maxson Steel site or other sites at or near rail lines that are blighted and the clean up of which will lead to living wage jobs, and to improve the land for economic development.\nLand or property acquired under this section may be resold at fair market value. Proceeds from the sale of the land must be deposited in the environmental response fund.\nThe commissioner of transportation shall collaborate with the county and any affected municipality by providing technical assistance and support in cleaning up a contaminated site related to a trunk highway or railroad improvement.",
	"repealed": false
}