{
	"id": "142A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.61",
	"title": "142A.61 SUPPORT FOR ADOPTIVE, FOSTER, AND KINSHIP FAMILIES.",
	"text": "The commissioner shall design and implement a coordinated program to reduce the need for placement changes or out-of-home placements of children and youth in foster care, adoptive placements, and permanent physical and legal custody kinship placements, and to improve the functioning and stability of these families. To the extent federal funds are available, the commissioner shall provide the following adoption and foster care-competent services and ensure that placements are trauma-informed and child and family-centered:\n(1) a program providing information, referrals, a parent-to-parent support network, peer support for youth, family activities, respite care, crisis services, educational support, and mental health services for children and youth in adoption, foster care, and kinship placements and adoptive, foster, and kinship families in Minnesota;\n(2) training offered statewide in Minnesota for foster, adoptive, and kinship families, and the professionals who serve the families, on the effects of trauma, common disabilities of adopted children and children in foster care and kinship placements, and challenges in adoption, foster care, and kinship placements; and\n(3) periodic evaluation of these services to ensure program effectiveness in preserving and improving the success of adoptive, foster, and kinship placements.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Child and family-centered\" means individualized services that respond to a child's or youth's strengths, interests, and current developmental stage, including social, cognitive, emotional, physical, cultural, racial, and spiritual needs, and offer support to the entire adoptive, foster, or kinship family.\n(c) \"Trauma-informed\" means care that acknowledges the effect trauma has on children and the children's families; modifies services to respond to the effects of trauma; emphasizes skill and strength-building rather than symptom management; and focuses on the physical and psychological safety of the child and family.",
	"repealed": false
}