{
	"id": "336.4-104",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.4-104",
	"title": "336.4-104 DEFINITIONS AND INDEX OF DEFINITIONS.",
	"text": "(a) In this article, unless the context otherwise requires:\n(1) \"Account\" means any deposit or credit account with a bank, including a demand, time, savings, passbook, share draft, or like account, other than an account evidenced by a certificate of deposit;\n(2) \"Afternoon\" means the period of a day between noon and midnight;\n(3) \"Banking day\" means that part of any day, excluding Saturday, Sunday, and holidays, on which a bank is open to the public for carrying on substantially all of its banking functions;\n(4) \"Clearinghouse\" means an association of banks or other payors regularly clearing items;\n(5) \"Customer\" means a person having an account with a bank or for whom a bank has agreed to collect items, including a bank that maintains an account at another bank;\n(6) \"Documentary draft\" means a draft to be presented for acceptance or payment if specified documents, certificated securities (section 336.8-102) or instructions for uncertificated securities (section 336.8-102), or other certificates, statements, or the like are to be received by the drawee or other payor before acceptance or payment of the draft;\n(7) \"Draft\" means a draft as defined in section 336.3-104 or an item, other than an instrument, that is an order;\n(8) \"Drawee\" means a person ordered in a draft to make payment;\n(9) \"Item\" means an instrument or a promise or order to pay money handled by a bank for collection or payment. The term does not include a payment order governed by article 4A or a credit or debit card slip;\n(10) \"Midnight deadline\" with respect to a bank is midnight on its next banking day following the banking day on which it receives the relevant item or notice or from which the time for taking action commences to run, whichever is later;\n(11) \"Settle\" means to pay in cash, by clearinghouse settlement, in a charge or credit or by remittance, or otherwise as agreed. A settlement may be either provisional or final;\n(12) \"Suspends payments\" with respect to a bank means that it has been closed by order of the supervisory authorities, that a public officer has been appointed to take it over, or that it ceases or refuses to make payments in the ordinary course of business.\n(b) Other definitions applying to this article and the sections in which they appear are:\n\"Agreement for electronic presentment,\" section 336.4-110\n\"Bank,\" section 336.4-105\n\"Collecting bank,\" section 336.4-105\n\"Depositary bank,\" section 336.4-105\n\"Intermediary bank,\" section 336.4-105\n\"Payor bank,\" section 336.4-105\n\"Presenting bank,\" section 336.4-105\n\"Presentment notice,\" section 336.4-110\n(c) \"Control\" as provided in section 336.7-106 and the following definitions in other articles apply to this article:\n\"Acceptance,\" section 336.3-409\n\"Alteration,\" section 336.3-407\n\"Cashier's check,\" section 336.3-104\n\"Certificate of deposit,\" section 336.3-104\n\"Certified check,\" section 336.3-409\n\"Check,\" section 336.3-104\n\"Holder in due course,\" section 336.3-302\n\"Instrument,\" section 336.3-104\n\"Notice of dishonor,\" section 336.3-503\n\"Order,\" section 336.3-103\n\"Ordinary care,\" section 336.3-103\n\"Person entitled to enforce,\" section 336.3-301\n\"Presentment,\" section 336.3-501\n\"Promise,\" section 336.3-103\n\"Prove,\" section 336.3-103\n\"Record,\" section 336.3-103\n\"Remotely created item,\" section 336.3-103\n\"Teller's check,\" section 336.3-104\n\"Unauthorized signature,\" section 336.3-403\n(d) In addition, article 1 contains general definitions and principles of construction and interpretation applicable throughout this article.",
	"repealed": false
}