{
	"id": "116.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.26",
	"title": "116.26 RESTORING SEIZED ITEMS.",
	"text": "When a cleaning agent or chemical water conditioner has been seized under sections 116.21 to 116.35, any person may within two months after the date of seizure, upon prior notice in accordance with subdivision 2 to the Pollution Control Agency by certified mail, apply to the district court within whose jurisdiction the seizure was made for an order of restoration under subdivision 3.\nNotice under subdivision 1 shall be mailed at least 15 days prior to the day on which the application is to be made to the district court and shall specify:\n(1) the district court to which the application is to be made;\n(2) the place where and the time when the application is to be heard;\n(3) the cleaning agent or chemical water conditioner in regard to which the application is to be made; and\n(4) the evidence upon which the applicant relies to establish entitlement to possession of the cleaning agent or chemical water conditioner.\n(a) Subject to section 116.27 when upon hearing, the district court is satisfied (1) that the applicant is otherwise entitled to possession of the items seized, and (2) that the items seized are not and will not be required as evidence in proceedings under sections 116.21 to 116.35, the court shall order that the items seized be restored forthwith to the applicant.\n(b) Where the court is satisfied that the applicant is otherwise entitled to possession but is not satisfied as to the necessity for retention as evidence, the court shall order restoration to the applicant (1) four months after the date of seizure if no proceedings under section 116.23 have been commenced before that time, or (2) upon the final conclusion of any such proceedings.\nWhen no application has been made under subdivision 1 within two months from the date of seizure, or when upon application no order of restoration is made, the items seized shall be delivered to the Pollution Control Agency, which may dispose of them as it sees fit.",
	"repealed": false
}