{
	"id": "240.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.131",
	"title": "240.131 ADVANCE DEPOSIT WAGERING.",
	"text": "Advance deposit wagering is authorized pari-mutuel betting on horse racing under this chapter if conducted in compliance with this section and the Interstate Horseracing Act of 1978, United States Code, title 15, section 3001 et seq.\nIt is unlawful for any person to accept an advance deposit wager from a Minnesota resident unless the person is an authorized advance deposit wagering provider as defined in section 240.01, subdivision 1d, and conducts advance deposit wagering under the terms of a contract that meets the requirements in subdivision 3 and other requirements of this chapter.\nBefore accepting an advance deposit wager from a Minnesota resident, an authorized advance deposit wagering provider must have a written contract in place with the licensed racetrack that conducts racing of the breed on which wagers will be accepted. The contract must be approved by the commission and by the horsepersons' organization representing the majority of horsepersons racing the breed involved at the licensed racetrack. The contract must, at a minimum:\n(1) provide for the payment of a source market fee for advance deposit wagers placed by Minnesota residents. The payment must be made, at a minimum, on a quarterly basis;\n(2) specify the manner in which the amount of the source market fee is determined;\n(3) govern all other aspects of the business relationship between the licensed racetrack and the ADW provider;\n(4) provide for what will happen if either party to the contract discontinues operations or ceases to be licensed in Minnesota;\n(5) provide that the contract is enforceable only in the state courts of Minnesota; and\n(6) provide for a term of agreement of not more than three years.\nBefore accepting an advance deposit wager from a Minnesota resident, an authorized advance deposit wagering provider shall demonstrate evidence of financial responsibility in a format prescribed by the commission through a surety bond executed and issued by an insurer authorized to issue surety bonds in this state, an irrevocable letter of credit, or other form of financial guarantee in an amount to be determined by the commission. The commission may also accept, as evidence of financial responsibility, a surety bond, an irrevocable letter of credit, or other form of financial guarantee in accordance with this subdivision filed with one or more states where the applicant is licensed as an advance deposit wagering provider. The commission may ask for additional evidence of financial responsibility at any time the commission deems necessary. Any surety bond, an irrevocable letter of credit, or other form of financial guarantee issued under this subdivision shall be in favor of this state and shall specifically authorize recovery by the commission for the payment of all fees required by this chapter, including source market fees, regulatory fees, and breeders fund fees, as well as payments due to Minnesota resident account holders.\n(a) The commission shall not license or authorize a person to conduct advance deposit wagering under this section unless the person has submitted, and the commission approved, a plan of operation for advance deposit wagering. At a minimum, the plan of operation must provide for:\n(1) methods of resolving disputes with account holders and licensed racetracks;\n(2) procedures to protect the security of account holders' accounts and information;\n(3) methods to verify the identity of account holders and ensure that all account holders are natural persons who are at least 18 years of age;\n(4) procedures to ensure that wagers are only accepted from account holders who have sufficient funds on deposit and that no credit is extended by the person to an account holder;\n(5) procedures for keeping accurate records of all contests, wagers, and payouts;\n(6) annually contracting with an independent third party to conduct an audit and submit the results of the audit to the commission; and\n(7) other requirements established by the commission in rule.\n(b) A plan of operation must be submitted in a manner prescribed by the commission. A plan of operation may only be amended with the approval of the commission. The commission may withdraw approval of a plan of operation.\n(a) It is the intent of the legislature that the proceeds of advance deposit wagering authorized by this chapter be used to support and improve the horse racing industry in Minnesota by improving purses, supporting breeding, and ensuring that the industry is adequately regulated for the protection of all participants.\n(b) Source market fees shall be established by contract and are in addition to other contractual fees such as host fees.\n(c) Except as provided in paragraph (e), a class A or class B licensee shall pay all source market fees it receives from an ADW provider as follows:\n(1) 28 percent to a licensed racetrack that primarily conducts standardbred horse racing; and\n(2) 72 percent to a licensed racetrack that primarily conducts Thoroughbred and Quarter Horse racing.\n(d) Of the total source market fees received by a licensed racetrack under paragraph (c), at least 50 percent must be set aside for breeders awards and purses. Of the amount set aside: (1) at least 33 percent shall be paid by the racetrack to the state for deposit to the breeders fund and must be expended solely for breeders awards in accordance with section 240.18, subdivisions 2, paragraph (d), clause (2), and 3, paragraph (b), clause (2); and (2) the remainder shall be paid by the racetrack to purse accounts for races held at the racetrack pursuant to agreements between the racetrack and the horsepersons' associations that represent a majority of the type of breed that races at the track.\n(e) No source market fees shall be paid by a class A or class B licensee to a licensed racetrack whose license has been revoked or not renewed under this chapter. In the event that a racetrack's license has been revoked or not renewed, source market fees otherwise payable to that racetrack by a class A or class B licensee under this section shall be paid to the other licensed racetrack.\n(a) A regulatory fee is imposed at the rate of one percent of all amounts wagered by Minnesota residents with an authorized advance deposit wagering provider. The fee shall be declared on a form prescribed by the commission. The ADW provider must pay the fee to the commission no more than 15 days after the end of the month in which the wager was made. Fees collected under this paragraph must be deposited in the state treasury and credited to a racing and card-playing regulation account in the special revenue fund and are appropriated to the commission to offset the costs incurred by the commission as described in section 240.30, subdivision 9, or the costs associated with regulating horse racing and pari-mutuel wagering in Minnesota.\n(b) A breeders fund fee is imposed in the amount of one-quarter of one percent of all amounts wagered by Minnesota residents with an authorized advance deposit wagering provider. The fee shall be declared on a form prescribed by the commission. The ADW provider must pay the fee to the commission no more than 15 days after the end of the month in which the wager was made. Fees collected under this paragraph must be deposited in the state treasury and credited to a racing and card-playing regulation account in the special revenue fund and are appropriated to the commission to offset the cost of administering the breeders fund, to support racehorse adoption, retirement, and repurposing, and promote horse breeding in Minnesota.\n(a) A class A or class B licensee shall have a private right of action against any person who accepts a pari-mutuel wager from a Minnesota resident that is not authorized by this chapter. The class A or class B licensee is entitled to injunctive relief and to presumptive damages equal to ten percent of the total of wagers accepted in violation of this section, as well as reasonable costs and attorney fees. Presumptive damages recovered under this subdivision shall be distributed as source market fees as provided in subdivision 6.\n(b) The commission shall have a right of action against any person who accepts a pari-mutuel wager that is not authorized by this chapter. The commission is entitled to injunctive relief and to recovery of all amounts that would have been payable to the state under subdivision 7, as well as reasonable costs and attorney fees. The commission may also fine the person under section 240.22.\nThe commission may adopt rules to implement this section using the expedited process in section 14.389.",
	"repealed": false
}