{
	"id": "169.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.28",
	"title": "169.28 CERTAIN VEHICLES TO STOP AT RAILROAD CROSSING.",
	"text": "(a) The driver of any motor vehicle carrying passengers for hire, or of any school bus whether carrying passengers or not, or of any Head Start bus whether carrying passengers or not, or of any vehicle that is required to stop at railroad grade crossings under Code of Federal Regulations, title 49, section 392.10, before crossing at grade any track or tracks of a railroad, shall stop the vehicle not less than 15 feet nor more than 50 feet from the nearest rail of the railroad and while so stopped shall listen and look in both directions along the track for any approaching railroad train or other on-track equipment, and for signals indicating the approach of a railroad train or other on-track equipment, except as otherwise provided in this section. The driver must not proceed until safe to do so and until the roadway is clear of traffic so that the vehicle can proceed without stopping until the rear of the vehicle is at least ten feet past the farthest railroad track. The driver must not shift gears while crossing the railroad tracks.\n(b) A school bus or Head Start bus shall not be flagged across railroad grade crossings except at those railroad grade crossings that the local school administrative officer may designate.\n(c) A type III vehicle, as defined in section 169.011, is exempt from the requirement of school buses to stop at railroad grade crossings.\n(d) The requirements of this subdivision do not apply to the crossing of light rail vehicle track or tracks that are located in a public street when:\n(1) the crossing occurs within the intersection of two or more public streets;\n(2) the intersection is controlled by a traffic-control signal; and\n(3) the intersection is marked with signs indicating to drivers that the requirements of this subdivision do not apply. Notwithstanding any other provision of law, the owner or operator of the track or tracks is authorized to place, maintain, and display the signs upon and in the view of the public street or streets.\n(a) The commissioner may designate a crossing as an exempt crossing:\n(1) if the crossing is on a rail line on which service has been abandoned;\n(2) if the crossing is on a rail line that carries fewer than five railroad trains each year, traveling at speeds of ten miles per hour or less; or\n(3) as agreed to by the operating railroad and the Department of Transportation, following a diagnostic review of the crossing.\n(b) The commissioner shall direct the railroad to erect at the crossing signs bearing the word \"Exempt\" that conform to section 169.06. The installation or presence of an exempt sign does not relieve a driver of the duty to use due care.\n(c) A railroad train or other on-track equipment must not proceed across an exempt crossing unless a police officer is present to direct traffic or a railroad employee is on the ground to warn traffic until the railroad train enters the crossing.\n(d) A vehicle that must stop at grade crossings under subdivision 1 is not required to stop at a marked exempt crossing unless directed otherwise by a police officer or a railroad employee.",
	"repealed": false
}