{
	"id": "35.0661",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.0661",
	"title": "35.0661 TEMPORARY EMERGENCY RESTRICTIONS ON MOVEMENT OF PEOPLE, LIVESTOCK, MACHINERY, AND OTHER PERSONAL PROPERTY.",
	"text": "(a) If the board determines that a confirmed case of a disease in this state presents a substantial and imminent threat to the state's domestic animal population, it shall certify the case to the governor. After receiving certification from the board, the governor may declare an emergency under this section for purposes of allowing the board to establish quarantine zones of control to protect the health of domestic animals from animal diseases of potentially disastrous proportions. The governor may declare an emergency under this section without declaring a peacetime emergency under section 12.31. A declaration under this section may specify that it applies to all or certain units of state or local government, must specify the time period for which it applies, and must be filed with the secretary of state. This section is in addition to and does not limit authority granted to the governor or local government officials by chapter 12 or other law.\n(b) The board may meet by electronic means without violating state open meeting laws for the purpose of declaring that a confirmed case of a disease in this state presents a substantial and imminent threat to the state's domestic animal population. If the board meets by electronic means for this purpose, it shall comply with the emergency meeting notice provisions of section 13D.04, subdivision 3, and, to the fullest extent possible, provide public and media access to the meeting.\nUpon an emergency declaration by the governor under subdivision 1, the board or any licensed veterinarian designated by the board may establish quarantine zones of control in any area where a specific animal is deemed by a licensed veterinarian as likely to be infected with the disease based on an actual veterinary examination or laboratory testing. Quarantine zones of control to restrict the movement of livestock must be the smallest size practicable to prevent the spread of disease and must exist for the shortest duration consistent with effective disease control.\n(a) The board may issue orders restricting the movement of persons, machinery, and personal property off infected premises designated by the board as quarantined under subdivision 2. The executive director of the board or any licensed veterinarian designated by the board may issue the orders. An order may be issued upon a determination that reasonable cause exists to believe that the movement of persons or personal property out of a quarantine zone will reasonably threaten to transport a dangerous, infectious, or communicable disease outside of the quarantine zone.\n(b) The order must be served upon any person subject to the order. The restrictions sought by the board on movement out of a quarantine zone must be limited to the greatest extent possible consistent with the paramount disease control objectives as determined by the board. An order under this section may be served on any day at any time. The order must include a notice of the person's rights under this section, including the ability to enter into an agreement to abide by disease control measures under paragraph (c) and the right to request a court hearing under paragraph (d).\n(c) No person may be restricted by an order under this subdivision for longer than 72 hours, exclusive of Saturdays, Sundays, and legal holidays, so long as the person agrees to abide by the disease control measures established by the board. The person shall sign an acknowledgment form prepared by the board evidencing the person's agreement to abide by the disease control measures established by the board.\n(d) A person whose movements are restricted by an order under this subdivision may seek a district court hearing on the order at any time after it is served on the person. The hearing may be held by electronic means as soon as possible. The subject of the order may:\n(1) contest imposition of the order on grounds that it is an abuse of the board's discretion under this section; or\n(2) seek a variance from it to allow movement of a person inconsistent with the order, upon a showing that the person would otherwise suffer irreparable harm.\n[Repealed, 1Sp2005 c 1 art 1 s 98]",
	"repealed": false
}