{
	"id": "121A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.41",
	"title": "121A.41 DEFINITIONS.",
	"text": "As used in sections 121A.40 to 121A.56, the terms defined in this section shall have the meanings assigned them.\n\"Dismissal\" means the denial of the current educational program to any pupil, including exclusion, expulsion, and suspension. It does not include removal from class.\n\"District\" means any school district.\n\"Exclusion\" means an action taken by the school board to prevent enrollment or reenrollment of a pupil for a period that shall not extend beyond the school year.\n\"Expulsion\" means a school board action to prohibit an enrolled pupil from further attendance for up to 12 months from the date the pupil is expelled.\n\"Parent\" means (a) one of the pupil's parents, (b) in the case of divorce or legal separation, the parent or parents with physical custody of the pupil, including a noncustodial parent with legal custody who has provided the district with a current address and telephone number, or (c) a legally appointed guardian. In the case of a pupil with a disability under the age of 18, parent may include a district-appointed surrogate parent.\n(a) \"Pupil\" means any student:\n(1) without a disability under 21 years of age; or\n(2) with a disability under 22 years old who has not received a regular high school diploma; and\n(3) who remains eligible to attend a public elementary or secondary school.\n(b) A \"student with a disability\" or a \"pupil with a disability\" has the same meaning as a \"child with a disability\" under section 125A.02.\n\"School\" means any school defined in section 120A.05, subdivisions 9, 11, 13, and 17. \"School\" also means a charter school.\n\"School board\" means the governing body of any school district.\n\"Suspension\" means an action by the school administration, under rules promulgated by the school board, prohibiting a pupil from attending school for a period of no more than ten school days. If a suspension is longer than five days, the suspending administrator must provide the superintendent with a reason for the longer suspension. This definition does not apply to dismissal from school for one school day or less, except as provided in federal law for a student with a disability. Each suspension action may include a readmission plan. The readmission plan shall include, where appropriate, a provision for implementing alternative educational services upon readmission and may not be used to extend the current suspension. Consistent with section 125A.091, subdivision 5, the readmission plan must not obligate a parent to provide a sympathomimetic medication for the parent's child as a condition of readmission. The school administration may not impose consecutive suspensions against the same pupil for the same course of conduct, or incident of misconduct, except where the pupil will create an immediate and substantial danger to self or to surrounding persons or property, or where the district is in the process of initiating an expulsion, in which case the school administration may extend the suspension to a total of 15 school days.\n\"Alternative educational services\" may include, but are not limited to, special tutoring, modified curriculum, modified instruction, other modifications or adaptations, instruction through electronic media, special education services as indicated by appropriate assessment, homebound instruction, supervised homework, or enrollment in another district or in an alternative learning center under section 123A.05 selected to allow the pupil to progress toward meeting graduation standards under section 120B.02, although in a different setting.\n\"Nonexclusionary disciplinary policies and practices\" means policies and practices that are alternatives to dismissing a pupil from school, including but not limited to evidence-based positive behavior interventions and supports, social and emotional services, school-linked mental health services, counseling services, social work services, academic screening for Title 1 services or reading interventions, and alternative education services. Nonexclusionary disciplinary policies and practices include but are not limited to the policies and practices under sections 120B.12; 121A.575, clauses (1) and (2); 121A.031, subdivision 4, paragraph (a), clause (1); 121A.61, subdivision 3, paragraph (r); and 122A.627, clause (3).\n\"Pupil withdrawal agreement\" means a verbal or written agreement between a school administrator or district administrator and a pupil's parent to withdraw a student from the school district to avoid expulsion or exclusion dismissal proceedings. The duration of the withdrawal agreement cannot be for more than a 12-month period.",
	"repealed": false
}