{
	"id": "70A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/70A.03",
	"title": "70A.03 DEFINITIONS.",
	"text": "For the purposes of this chapter, unless a different meaning is manifest from the context:\n(1) \"Casualty insurance,\" except as excluded by subdivision 2 of section 70A.02, means any of the kinds of insurance enumerated in section 60A.06, subdivision 1, clauses (3), (5), (6), (7), (8), (9), (10), (11), (12), (13), and (14), together with similar kinds of insurance which may be written pursuant to the provisions of section 60A.06, subdivision 2, and, notwithstanding the provisions of section 71A.07, includes insurance effected or exchanged pursuant to the provisions of chapter 71A, and the term \"insurers\" includes all individuals, partnerships or corporations and their attorneys engaged in effecting or exchanging insurance pursuant to the provisions of those statutes.\n(2) \"Fire and allied lines of insurance,\" except as excluded by subdivision 2 of section 70A.02, means and includes insurance against the risks of loss specified in section 60A.06, subdivision 1, clause (1), and all other kinds of insurance which fire insurance companies are now, or may hereafter be, authorized to write in this state, and, notwithstanding the provisions of section 71A.07, includes insurance effected or exchanged pursuant to the provisions of chapter 71A, and the term \"insurers\" includes all individuals, partnerships or corporations and their attorneys engaged in effecting or exchanging insurance pursuant to the provisions of those statutes.\n(3) \"Inland marine insurance\" includes insurance now or hereafter defined by statute, or by judicial interpretation thereof, or if not so defined or interpreted, by ruling of the commissioner, or as established by general custom of the business, as inland marine insurance.\n(4) \"Supplementary rate information\" includes every manual of classifications, rules and rates, every rating plan and every modification of any of the foregoing, and any other information requested by the commissioner.\n(5) \"Rate service organization\" means any person, other than an employee of an insurer, who assists insurers or other rate service organizations in rate making or filing by:\n(a) collecting, compiling, and furnishing loss or expense statistics; or\n(b) recommending, making, or filing rates or supplementary rate information.",
	"repealed": false
}