{
	"id": "299K.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/299K.08",
	"title": "299K.08 FACILITY REQUIRED TO COMPLY.",
	"text": "Facilities subject to the federal act must comply with the federal act and sections 299K.01 to 299K.10.\n(a) In addition to facilities specified in the federal act, facilities that are operated by employers subject to the occupational health and safety provisions of sections 182.65 to 182.675 shall comply with the hazardous chemical inventory reporting of the federal act.\n(b) This section is a designation of additional facilities under sections 11021 and 11022 of the federal act, and the legislative process meets the requirements for public notice and opportunity to comment.\n(a) Except as provided in paragraph (b), in addition to facilities specified in the federal act, the following facilities shall comply with the toxic chemical release reporting requirements of section 11023 of the federal act and United States Code, title 42, section 13106, to the same extent as facilities that are required by federal law to comply with these requirements: facilities having a two-digit standard industrial classification of 10, 40, 45, or 49; a three-digit standard industrial classification of 806, 807, or 822; or a four-digit standard industrial classification of 5161, 5162, 5169, 7384, 7389 (solvent recovery facilities only), 8734, or 9223.\n(b) For the facilities added in this section, the toxic chemical release reporting requirements of section 11023 of the federal act, and sections 115D.07, 115D.08, and 115D.12, do not apply to substances that are associated with or incidental to the combustion of fossil fuels or other fuels for the generation of electricity or the production of steam.\n(a) For Minnesota facilities required to report under subdivision 3, the alternative threshold quantities outlined in Code of Federal Regulations, title 40, section 372.27, paragraphs (a)(1) and (a)(2)(ii), or a successor regulation, shall be changed back to the threshold levels prior to implementation of the toxic release inventory burden reduction rule of December 18, 2006.\n(b) The use of Environmental Protection Agency certification form 9530-2, (Form A), or any equivalent successor to the form, shall not be used by facilities:\n(1) if the total annual reportable amount is 500 pounds or more for nonpersistent bioaccumulative and toxic chemicals; or\n(2) with respect to any chemical identified by the Environmental Protection Agency administrator as a chemical of special concern under Code of Federal Regulations, title 40, section 372.28, or a successor regulation.\n(c) Facilities affected by paragraph (b) must use Environmental Protection Agency form 9350-1 (Form R), or any equivalent successor to the form.\n(a) A person may petition the commission to:\n(1) exempt all facilities having a standard industrial classification listed in subdivision 3, or a classification within one of the listed classifications, from the reporting requirements of subdivision 3; or\n(2) review a previously granted exemption.\n(b) In making a determination on a petition under paragraph (a), the commission shall consider:\n(1) the reported or estimated releases and transfers from facilities within the affected classification;\n(2) the quality of the data submitted;\n(3) the extent to which facilities within the affected classification report no releases or transfers;\n(4) the number of reporting facilities in the affected classification;\n(5) the percentage of all releases and transfers in the state that are reported by facilities in the affected classification;\n(6) hazards to public safety and the environment posed by releases and transfers from facilities in the affected classification; and\n(7) other factors identified by the commission.\n(c) The commission shall hold at least one public meeting to receive testimony on the petition. The commission shall publish in the State Register notice of granted exemptions. The commission shall report on the status of petitions and exemptions as part of the annual toxic release inventory report.\n(d) A facility specified in paragraph (a) that is not within a classification exempted under paragraph (b) and does not release or transfer chemicals subject to reporting under section 11023 of the federal act is exempt from reporting under subdivision 3 if the owner or operator of the facility certifies in writing to the commission that there are no releases or transfers at the facility. The certification must be submitted to the commission by the first reporting date for the facility under the federal act. The facility is exempt from further reporting unless there is a release or transfer from the facility or there is a change in the facility's standard industrial classification. Facilities that qualify for this exemption shall maintain documentation supporting the exemption and shall provide this documentation at the request of the commission.",
	"repealed": false
}