{
	"id": "474A.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/474A.061",
	"title": "474A.061 MANUFACTURING, HOUSING, AND PUBLIC FACILITIES POOLS.",
	"text": "(a) For any requested allocations from the small issue pool and the public facilities pool, an issuer may apply for an allocation under this section by submitting to the department an application on forms provided by the department, accompanied by (1) a preliminary resolution, (2) a statement of bond counsel that the proposed issue of obligations requires an allocation under this chapter and the Internal Revenue Code, (3) the type of qualified bonds to be issued, (4) an application deposit in the amount of one percent of the requested allocation before the last Monday in June, or in the amount of two percent of the requested allocation on or after the last Monday in June, and (5) a public purpose scoring worksheet for manufacturing project and enterprise zone facility project applications. The issuer must pay the application deposit to the Department of Management and Budget. The Minnesota Housing Finance Agency, the Minnesota Rural Finance Authority, and the Minnesota Office of Higher Education may apply for and receive an allocation under this section without submitting an application deposit.\n(b) An entitlement issuer may not apply for an allocation under this subdivision unless it has either permanently issued bonds equal to the amount of its entitlement allocation for the current year plus any amount of bonding authority carried forward from previous years or returned for reallocation all of its unused entitlement allocation. For purposes of this subdivision, its entitlement allocation includes an amount obtained under section 474A.04, subdivision 6.\n(c) If an application is rejected under this section, the commissioner must notify the applicant and return the application deposit to the applicant within 30 days unless the applicant requests in writing that the application be resubmitted. The granting of an allocation of bonding authority under this section must be evidenced by a certificate of allocation.\n(a) For any requested allocations from the housing pool, an issuer may apply for an allocation under this section by submitting to the department an application on forms provided by the department, accompanied by (1) a preliminary resolution, (2) a statement of bond counsel that the proposed issue of obligations requires an allocation under this chapter and the Internal Revenue Code, (3) an application deposit in the amount of two percent of the requested allocation, (4) a sworn statement from the applicant identifying the project as either a preservation project, 30 percent AMI residential rental project, 50 percent AMI residential rental project, 100 percent LIHTC project, 20 percent LIHTC project, or any other residential rental project, and (5) a certification from the applicant or its accountant stating that the requested allocation does not exceed the aggregate bond limitation. The issuer must pay the application deposit to the Department of Management and Budget. The Minnesota Housing Finance Agency may apply for and receive an allocation under this section without submitting an application deposit.\n(b) An entitlement issuer may not apply for an allocation from the housing pool unless it either has permanently issued bonds equal to any amount of bonding authority carried forward from a previous year or has returned for reallocation any unused bonding authority carried forward from a previous year. For purposes of this subdivision, its entitlement allocation includes an amount obtained under section 474A.04, subdivision 6. This paragraph does not apply to an application from the Minnesota Housing Finance Agency for an allocation under subdivision 2a for cities who choose to have the agency issue bonds on the city's behalf.\n(c) If an application is rejected under this section, the commissioner must notify the applicant and return the application deposit to the applicant within 30 days unless the applicant requests in writing that the application be resubmitted. The granting of an allocation of bonding authority under this section must be evidenced by a certificate of allocation.\nMS 1988 [Repealed, 1990 c 552 s 24]\n(a) Commencing on the second Tuesday in January and continuing on each Monday through the last Monday in June, the commissioner shall allocate available bonding authority from the housing pool to applications received on or before the Monday of the preceding week for residential rental projects that meet the eligibility criteria under section 474A.047. Allocations of available bonding authority from the housing pool for eligible residential rental projects shall be awarded in the following order of priority:\n(1) preservation projects;\n(2) 30 percent AMI residential rental projects;\n(3) 50 percent AMI residential rental projects;\n(4) 100 percent LIHTC projects;\n(5) 20 percent LIHTC projects; and\n(6) other residential rental projects for which the amount of bonds requested in their respective applications do not exceed the aggregate bond limitation.\nIf there are two or more applications for residential rental projects at the same priority level and there is insufficient bonding authority to provide allocations for all the projects in any one allocation period, available bonding authority shall be randomly awarded by lot but only for projects that can receive the full amount of their respective requested allocations. If a residential rental project does not receive any of its requested allocation pursuant to this paragraph and the project applies for an allocation of bonds again in the same calendar year or to the next successive housing pool, the project shall be fully funded up to its original application request for bonding authority before any new project, applying in the same allocation period, that has an equal priority shall receive bonding authority. An issuer that receives an allocation under this paragraph must issue obligations equal to all or a portion of the allocation received on or before 180 days of the allocation. If an issuer that receives an allocation under this paragraph does not issue obligations equal to all or a portion of the allocation received within the time period provided in this paragraph or returns the allocation to the commissioner, the amount of the allocation is canceled and returned for reallocation through the housing pool or to the unified pool after July 1.\n(b) After January 1, and through January 15, The Minnesota Housing Finance Agency may accept applications from cities for single-family housing programs which meet program requirements as follows:\n(1) the housing program must meet a locally identified housing need and be economically viable;\n(2) the adjusted income of home buyers may not exceed 80 percent of the greater of statewide or area median income as published by the Department of Housing and Urban Development, adjusted for household size;\n(3) house price limits may not exceed the federal price limits established for mortgage revenue bond programs. Data on the home purchase price amount, mortgage amount, income, household size, and race of the households served in the previous year's single-family housing program, if any, must be included in each application; and\n(4) for applicants who choose to have the agency issue bonds on their behalf, an application fee pursuant to section 474A.03, subdivision 4, and an application deposit equal to one percent of the requested allocation must be submitted to the Minnesota Housing Finance Agency before the agency forwards the list specifying the amounts allocated to the commissioner under paragraph (d). The agency shall submit the city's application fee and application deposit to the commissioner when requesting an allocation from the housing pool.\nApplications by a consortium shall include the name of each member of the consortium and the amount of allocation requested by each member.\n(c) Any amounts remaining in the housing pool after June 15 are available for single-family housing programs for cities that applied in January and received an allocation under this section in the same calendar year. For a city that chooses to issue bonds on its own behalf or pursuant to a joint powers agreement, the agency must allot available bonding authority based on the formula in paragraphs (d) and (f). Allocations will be made loan by loan, on a first-come, first-served basis among cities on whose behalf the Minnesota Housing Finance Agency issues bonds.\nAny city that received an allocation pursuant to paragraph (f) in the same calendar year that wishes to issue bonds on its own behalf or pursuant to a joint powers agreement for an amount becoming available for single-family housing programs after June 15 shall notify the Minnesota Housing Finance Agency by June 15. The Minnesota Housing Finance Agency shall notify each city making a request of the amount of its allocation within three business days after June 15. The city must comply with paragraph (f).\nFor purposes of paragraphs (a) to (h), \"city\" means a county or a consortium of local government units that agree through a joint powers agreement to apply together for single-family housing programs, and has the meaning given it in section 462C.02, subdivision 6. \"Agency\" means the Minnesota Housing Finance Agency.\n(d) The total amount of allocation for mortgage bonds for one city is limited to the lesser of: (i) the amount requested, or (ii) the product of the total amount available for mortgage bonds from the housing pool, multiplied by the ratio of each applicant's population as determined by the most recent estimate of the city's population released by the state demographer's office to the total of all the applicants' population, except that each applicant shall be allocated a minimum of $100,000 regardless of the amount requested or the amount determined under the formula in clause (ii). If a city applying for an allocation is located within a county that has also applied for an allocation, the city's population will be deducted from the county's population in calculating the amount of allocations under this paragraph.\nUpon determining the amount of each applicant's allocation, the agency shall forward to the commissioner a list specifying the amounts allotted to each application with all application fees and deposits from applicants who choose to have the agency issue bonds on their behalf.\nTotal allocations from the housing pool for single-family housing programs may not exceed 27 percent of the adjusted allocation to the housing pool until after June 15 in 2020 and 2021, after which the allocations may not exceed 31 percent of the adjusted allocation to the housing pool until after June 15.\n(e) The agency may issue bonds on behalf of participating cities. The agency shall request an allocation from the commissioner for all applicants who choose to have the agency issue bonds on their behalf and the commissioner shall allocate the requested amount to the agency. The agency may request an allocation at any time after the second Tuesday in January and through the last Monday in June. After awarding an allocation and receiving a notice of issuance for the mortgage bonds issued on behalf of the participating cities, the commissioner shall transfer the application deposits to the Minnesota Housing Finance Agency to be returned to the participating cities. The Minnesota Housing Finance Agency shall return any application deposit to a city that paid an application deposit under paragraph (b), clause (4), but was not part of the list forwarded to the commissioner under paragraph (d).\n(f) A city may choose to issue bonds on its own behalf or through a joint powers agreement and may request an allocation from the commissioner by forwarding an application with an application fee pursuant to section 474A.03, subdivision 4, and a one percent application deposit to the commissioner no later than the Monday of the week preceding an allocation. If the total amount requested by all applicants exceeds the amount available in the pool, the city may not receive a greater allocation than the amount it would have received under the list forwarded by the Minnesota Housing Finance Agency to the commissioner. No city may request or receive an allocation from the commissioner until the list under paragraph (d) has been forwarded to the commissioner. A city must request an allocation from the commissioner no later than the last Monday in June. No city may receive an allocation from the housing pool for mortgage bonds which has not first applied to the Minnesota Housing Finance Agency. The commissioner shall allocate the requested amount to the city or cities subject to the limitations under this paragraph.\nIf a city issues mortgage bonds from an allocation received under this paragraph, the issuer must provide for the recycling of funds into new loans. If the issuer is not able to provide for recycling, the issuer must notify the commissioner in writing of the reason that recycling was not possible and the reason the issuer elected not to have the Minnesota Housing Finance Agency issue the bonds. \"Recycling\" means the use of money generated from the repayment and prepayment of loans for further eligible loans or for the redemption of bonds and the issuance of current refunding bonds.\n(g) No entitlement city or county or city in an entitlement county may apply for or be allocated authority to issue mortgage bonds or use mortgage credit certificates from the housing pool. No city in an entitlement county may apply for or be allocated authority to issue residential rental bonds from the housing pool or the unified pool.\n(h) A city that does not use at least 50 percent of its allotment by the date applications are due for the first allocation that is made from the housing pool for single-family housing programs in the immediately succeeding calendar year may not apply to the housing pool for a single-family mortgage bond or mortgage credit certificate program allocation that exceeds the amount of its allotment for the preceding year that was used by the city in the immediately preceding year or receive an allotment from the housing pool in the succeeding calendar year that exceeds the amount of its allotment for the preceding year that was used in the preceding year. The minimum allotment is $100,000 for an allocation made prior to June 15, regardless of the amount used in the preceding calendar year, except that a city whose allocation in the preceding year was the minimum amount of $100,000 and who did not use at least 50 percent of its allocation from the preceding year is ineligible for an allocation in the immediate succeeding calendar year. Each local government unit in a consortium must meet the requirements of this paragraph.\nCommencing on the second Tuesday in January and continuing on each Monday through the last Monday in June, the commissioner shall allocate available bonding authority from the small issue pool to applications received on or before the Monday of the preceding week for manufacturing projects and enterprise zone facility projects. From the second Tuesday in January through the last Monday in June, the commissioner shall reserve $5,000,000 of the available bonding authority from the small issue pool for applications for agricultural development bond loan projects of the Minnesota Rural Finance Authority.\nBeginning in calendar year 2002, on the second Tuesday in January through the last Monday in June, the commissioner shall reserve $10,000,000 of available bonding authority in the small issue pool for applications for student loan bonds of or on behalf of the Minnesota Office of Higher Education. The total amount of allocations for student loan bonds from the small issue pool may not exceed $10,000,000 per year.\nThe commissioner shall reserve $10,000,000 until the day after the last Monday in February, $10,000,000 until the day after the last Monday in April, and $10,000,000 until the day after the last Monday in June in the small issue pool for enterprise zone facility projects and manufacturing projects. The amount of allocation provided to an issuer for a specific enterprise zone facility project or manufacturing project will be based on the number of points received for the proposed project under the scoring system under section 474A.045.\nIf there are two or more applications for manufacturing and enterprise zone facility projects from the small issue pool and there is insufficient bonding authority to provide allocations for all projects in any one week, the available bonding authority shall be awarded based on the number of points awarded a project under section 474A.045, with those projects receiving the greatest number of points receiving allocation first. If two or more applications receive an equal number of points, available bonding authority shall be awarded by lot unless otherwise agreed to by the respective issuers.\nFrom the beginning of the calendar year and continuing for a period of 120 days, the commissioner shall reserve $5,000,000 of the available bonding authority from the public facilities pool for applications for public facilities projects to be financed by the Western Lake Superior Sanitary District. Commencing on the second Tuesday in January and continuing on each Monday through the last Monday in June, the commissioner shall allocate available bonding authority from the public facilities pool to applications for eligible public facilities projects received on or before the Monday of the preceding week. If there are two or more applications for public facilities projects from the pool and there is insufficient available bonding authority to provide allocations for all projects in any one week, the available bonding authority shall be awarded by lot unless otherwise agreed to by the respective issuers.\nMS 1996 [Repealed, 1998 c 363 s 9]\n(a) For any requested allocations from the small issue pool or the public facilities pool, if an issuer that receives an allocation under this section determines that it will not issue obligations equal to all or a portion of the allocation received under this section within 120 days of allocation or within the time period permitted by federal tax law, whichever is less, the issuer must notify the department. If the issuer notifies the department or the 120-day period since allocation has expired prior to the last Monday in June, the amount of allocation is canceled and returned for reallocation through the pool from which it was originally allocated. If the issuer notifies the department or the 120-day period since allocation has expired on or after the last Monday in June, the amount of allocation is canceled and returned for reallocation through the unified pool. If the issuer notifies the department after the last Monday in November, the amount of allocation is canceled and returned for reallocation to the Minnesota Housing Finance Agency. To encourage a competitive application process, the commissioner shall reserve, for new applications, the amount of allocation that is canceled and returned for reallocation under this section for a minimum of seven calendar days.\n(b) An issuer that returns for reallocation all or a portion of an allocation received under this subdivision within 120 days of allocation shall receive within 30 days a refund equal to:\n(1) one-half of the application deposit for the amount of bonding authority returned within 30 days of receiving allocation;\n(2) one-fourth of the application deposit for the amount of bonding authority returned between 31 and 60 days of receiving allocation; and\n(3) one-eighth of the application deposit for the amount of bonding authority returned between 61 and 120 days of receiving allocation.\n(c) No refund shall be available for allocations returned 120 or more days after receiving the allocation or beyond the last Monday in November.\nMS 1987 Supp [Repealed, 1988 c 586 s 5]\nMS 2000 [Repealed, 2001 c 214 s 49]\n(a) For any requested allocations from the housing pool, if an issuer that receives an allocation under this section determines that it will not permanently issue obligations equal to all or a portion of the allocation received under this section within the time period provided under section 474A.061, subdivision 2a, paragraph (a), or within the time period permitted by federal tax law, whichever is less, the issuer must notify the department. If the issuer notifies the department or the time period provided under section 474A.061, subdivision 2a, paragraph (a), has expired prior to the last Monday in June, the amount of allocation is canceled and returned for reallocation through the housing pool. If the issuer notifies the department or the time period provided under section 474A.061, subdivision 2a, paragraph (a), has expired on or after the last Monday in June, the amount of allocation is canceled and returned for reallocation through the unified pool. If the issuer notifies the department after the last Monday in November, the amount of allocation is canceled and returned for reallocation to the Minnesota Housing Finance Agency. To encourage a competitive application process, the commissioner shall reserve, for new applications, the amount of allocation that is canceled and returned for reallocation under this section for a minimum of seven calendar days.\n(b) An issuer that returns for reallocation all or a portion of an allocation received under this subdivision within 180 days of allocation shall receive within 30 days a refund equal to:\n(1) one-half of the application deposit for the amount of bonding authority returned within 45 days of receiving allocation;\n(2) one-fourth of the application deposit for the amount of bonding authority returned between 46 and 90 days of receiving allocation; and\n(3) one-eighth of the application deposit for the amount of bonding authority returned between 91 and 180 days of receiving allocation.\n(c) No refund shall be available for allocations returned 180 or more days after receiving the allocation or beyond the last Monday in November.",
	"repealed": false
}