{
	"id": "259.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.22",
	"title": "259.22 PETITION.",
	"text": "Any person who has resided in the state for one year or more may petition to adopt a child or an adult, and the same petitioner may petition for the adoption of two or more persons in one petition. The provisions as to length of residence in the state may be reduced to 30 days by the court whenever it appears to be for the best interest of the child.\nThe court may waive any residence requirement of this section if the petitioner is an individual who is related, as defined in section 142B.01, subdivision 15, or a member of a child's extended family or important friends with whom the child has resided or had significant contact.\nNo petition for adoption shall be filed unless the person sought to be adopted has been placed by a licensed child-placing agency. The provisions of this subdivision shall not apply if:\n(1) the person to be adopted is over 14 years of age;\n(2) the child is sought to be adopted by an individual who is related to the child, as defined by section 142B.01, subdivision 15;\n(3) the child has been lawfully placed under the laws of another state while the child and petitioner resided in that other state;\n(4) the court waives the requirement of this subdivision in the best interests of the child or petitioners, provided that the adoption does not involve a placement as defined in section 259.21, subdivision 8; or\n(5) the child has been lawfully placed under section 259.47.\nThis section shall not apply to placements made prior to August 1, 1974. Any placement made prior to that date may be finalized by a petition for adoption.\nA petition shall be filed not later than 12 months after a child is placed in a prospective adoptive home. If a petition is not filed by that time, the agency that placed the child, or, in a direct adoptive placement, the agency that is supervising the placement shall file with the district court in the county where the prospective adoptive parent resides a motion for an order and a report recommending one of the following:\n(1) that the time for filing a petition be extended because of the child's special needs as defined under title IV-E of the Social Security Act, United States Code, title 42, section 673;\n(2) that, based on a written plan for completing filing of the petition, including a specific timeline, to which the prospective adoptive parents have agreed, the time for filing a petition be extended long enough to complete the plan because such an extension is in the best interests of the child and additional time is needed for the child to adjust to the adoptive home; or\n(3) that the child be removed from the prospective adoptive home.\nThe prospective adoptive parent must reimburse an agency for the cost of preparing and filing the motion and report under this section, unless the costs are reimbursed by the commissioner under section 142A.608, subdivision 2, or 259.73.",
	"repealed": false
}