{
	"id": "325E.112",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.112",
	"title": "325E.112 USED MOTOR OIL AND USED MOTOR OIL FILTER COLLECTION.",
	"text": "(a) Motor oil and motor oil filter manufacturers and retailers shall seek to provide by May 31, 2001:\n(1) access to at least one nongovernmental site for collection of used motor oil and used motor oil filters from the public within a five-mile radius of any resident in the seven-county metropolitan area; and\n(2) access to at least one nongovernmental site for collection of used motor oil and used motor oil filters from the public within a city or town with a population of greater than 1,500 outside the seven-county metropolitan area. The commissioner of the Pollution Control Agency shall determine by June 30, 2001, whether these goals have been met.\n(b) If the commissioner of the Pollution Control Agency determines that motor oil and motor oil filter manufacturers and retailers have not met the goals in paragraph (a) by May 31, 2001, then beginning July 1, 2001, all retailers that sell at an individual location more than 1,000 motor oil filters per calendar year at retail for off-site installation must provide for collection of used motor oil and used motor oil filters from the public. Retailers who do not collect the used motor oil and used motor oil filters at their individual locations may meet the requirement by entering into a written agreement with another party whose location is:\n(1) within two miles of the retailer's location if the retailer is located:\n(i) within the Interstate Highway 494/694 beltway;\n(ii) in a home rule charter or statutory city or a town contiguous to the Interstate Highway 494/694 beltway; or\n(iii) in a home rule charter or statutory city of over 30,000 population within the metropolitan area as defined in section 473.121; or\n(2) within five miles of the retailer's location if the retailer is not in an area described in clause (1).\n(c) The written agreement under paragraph (b) must specify that the other party will accept from the public up to ten gallons of used motor oil and ten used motor oil filters per person per month during normal hours of operation unless:\n(1) the used motor oil is known to be contaminated with antifreeze, other hazardous waste, or other materials which may increase the cost of used motor oil management and disposal;\n(2) the storage equipment for that particular waste is temporarily filled to capacity; or\n(3) the used motor oil or used motor oil filters are from a business.\n(d) Persons accepting used motor oil from the public in accordance with this subdivision shall presume that the used motor oil is not contaminated with hazardous waste, provided the person offering the used motor oil is acting in good faith and the person accepting the used motor oil does not have evidence to the contrary. Persons collecting used motor oil from the public must take precautions to prevent contamination of used motor oil storage equipment. Precautions may include, but are not limited to, keeping a log of persons dropping off used motor oil, securing access to used motor oil storage equipment, or posting signage at the site indicating the proper use of the equipment.\n(e) Persons accepting used motor oil and used motor oil filters under paragraph (b), including persons accepting the oil and filters on behalf of the retailer, may not charge a fee when accepting ten gallons or less of used motor oil or ten or fewer used motor oil filters per person per month.\n(f) Persons that receive contaminated used motor oil may manage the used motor oil as household hazardous waste through publicly administered household hazardous waste collection programs, with approval from the household hazardous waste program. Used motor oil contaminated with hazardous waste from the public that cannot be managed through a household hazardous waste collection program must be managed as a hazardous waste in accordance with rules adopted by the Pollution Control Agency.\nA contaminated used motor oil reimbursement program is established to provide reimbursement of the costs of disposing of contaminated used motor oil. In order to receive reimbursement, persons who accept used motor oil from the public or parties that they have contracted with to accept used motor oil must provide to the commissioner of the Pollution Control Agency proof of contamination, information on methods the person used to prevent the contamination of used motor oil at the site, a copy of the billing for disposal costs incurred because of the contamination and proof of payment, and a copy of the hazardous waste manifest or shipping paper used to transport the waste. The commissioner shall reimburse a recipient of contaminated used motor oil 100 percent of the costs of properly disposing of the contaminated used motor oil. The commissioner may not reimburse persons who intentionally place contaminants or do not take precautions to prevent contaminants from being placed in used motor oil, or operate a private collection site that:\n(1) is not publicly promotable or listed with the agency;\n(2) does not accept up to five gallons of used motor oil and five used motor oil filters per person per day without charging a fee; or\n(3) does not control access to the site during times when the site is closed.\nA person operating a collection site may refuse to accept any used motor oil or used motor oil filter:\n(1) that is from a business;\n(2) that appears to be contaminated with antifreeze, hazardous waste, or other materials that may increase the cost of used motor oil management and disposal; or\n(3) when the storage equipment for that particular waste is temporarily filled.\nPersons operating government collection sites are eligible for reimbursement of the costs of disposing of contaminated used motor oil. Reimbursements made under this subdivision are limited to the money available in the contaminated used motor oil reimbursement account.\n[Repealed, 1Sp2003 c 21 art 8 s 20]\n[Repealed, 2003 c 128 art 2 s 56]\nPersons who accept used motor oil and used motor oil filters from the public and retailers and manufacturers who contract with such persons for purposes of subdivision 1 are exempt from liability under chapter 115B for the used motor oil, contaminated used motor oil, and used motor oil filters accepted at facilities that accept used motor oil or used motor oil filters from the public free of charge, after the used motor oil, contaminated used motor oil, and used motor oil filters are sent off-site in compliance with rules adopted by the Pollution Control Agency.\nThe commissioner of the Pollution Control Agency shall enforce compliance with this section under sections 115.071 and 116.072.",
	"repealed": false
}