{
	"id": "117.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/117.135",
	"title": "117.135 TAXES AND ASSESSMENTS.",
	"text": "In all eminent domain proceedings taxes and assessments imposed upon the acquired property shall be compensated for as provided by section 272.68, except the state Transportation Department, as the acquiring authority, shall pay all taxes, including all unpaid special assessments and future installments thereof, as provided in subdivision 2.\nWhen the state Transportation Department acquires a fee interest in property before forfeiture, by any means, provision must be made to pay all taxes, including all unpaid special assessments and future installments thereof, unpaid on the property at the date of acquisition. For the purpose of this section, the date of acquisition shall be either the date on which the department enters into a written agreement to purchase the property or, in cases of condemnation, the date of acquisition shall be the date of the award of the court-appointed commissioners; except where the provisions of section 117.042 are exercised and apply, in which case the date of acquisition will be the date on which the state Transportation Department is entitled to take possession. Taxes lawfully levied shall not be abated. This subdivision shall not be construed to require the payment of accrued taxes and unpaid assessments on the acquired property which exceed the fair market value thereof. The state Transportation Department in acquiring property may make provisions for the apportionment of the taxes and unpaid assessments if less than a complete parcel or tract is acquired.\nIf such accrued taxes and unpaid assessments are not paid as hereinabove required, then the county auditor of the county in which the acquired property is located shall notify the commissioner of management and budget of the pertinent facts, and the commissioner of management and budget shall divert an amount equal to such accrued taxes and unpaid assessments from any funds which are thereafter to be distributed by the commissioner of management and budget to the state Transportation Department from the trunk highway fund, and shall pay over such diverted funds to the county treasurer of the county in which the acquired property is located in payment of such accrued taxes and unpaid assessments.\nIf the state Transportation Department permits a person or business to occupy a property for a period of more than 120 days after the date of acquisition, the department shall thereafter charge a reasonable rental therefor in accordance with the provisions of section 161.23, subdivision 3.",
	"repealed": false
}