{
	"id": "62A.047",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.047",
	"title": "62A.047 CHILDREN'S HEALTH SUPERVISION SERVICES AND PRENATAL CARE SERVICES.",
	"text": "A policy of individual or group health and accident insurance regulated under this chapter, or individual or group subscriber contract regulated under chapter 62C, health maintenance contract regulated under chapter 62D, or health benefit certificate regulated under chapter 64B, issued, renewed, or continued to provide coverage to a Minnesota resident, must provide coverage for child health supervision services and prenatal care services. The policy, contract, or certificate must specifically exempt reasonable and customary charges for child health supervision services and prenatal care services from a deductible, co-payment, or other coinsurance or dollar limitation requirement. This section does not prohibit the use of policy waiting periods for these services. Minimum benefits may be limited to one visit payable to one provider for all of the services provided at each visit cited in this section subject to the schedule set forth in this section. Nothing in this section applies to a commercial health insurance policy issued as a companion to a health maintenance organization contract, a policy designed primarily to provide coverage payable on a per diem, fixed indemnity, or nonexpense incurred basis, or a policy that provides only accident coverage. A policy, contract, or certificate described under this section may not apply to preexisting condition limitations to individuals under 19 years of age. This section does not apply to individual coverage under a grandfathered plan.\n\"Child health supervision services\" means pediatric preventive services, appropriate immunizations, developmental assessments, and laboratory services appropriate to the age of a child from birth to age six, and appropriate immunizations from ages six to 18, as defined by Standards of Child Health Care issued by the American Academy of Pediatrics. Reimbursement must be made for at least five child health supervision visits from birth to 12 months, three child health supervision visits from 12 months to 24 months, once a year from 24 months to 72 months.\n\"Prenatal care services\" means the comprehensive package of medical and psychosocial support provided throughout the pregnancy, including risk assessment, serial surveillance, prenatal education, and use of specialized skills and technology, when needed, as defined by Standards for Obstetric-Gynecologic Services issued by the American College of Obstetricians and Gynecologists.",
	"repealed": false
}