{
	"id": "70A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/70A.04",
	"title": "70A.04 RATE STANDARDS.",
	"text": "Rates shall not be excessive, inadequate or unfairly discriminatory, nor shall an insurer use rates to engage in unfair price competition.\n(a) Rates are presumed not to be excessive if a reasonable degree of price competition exists at the consumer level with respect to the class of business to which they apply. In determining whether a reasonable degree of price competition exists, the commissioner shall consider all relevant tests.\nIn addition to any other manner of determining whether a reasonable degree of price competition exists with respect to any class of insurance, it is presumed that a reasonable degree of competition does not exist if less than five insurers write more than 75 percent of the direct written premiums.\n(b) If such competition does not exist, rates are excessive if they are likely to produce a long-run profit that is unreasonably high in relation to the riskiness of the class of business, or if expenses are unreasonably high in relation to the services rendered.\nIn determining whether an excessive rate is being charged by an individual insurer for a class of insurance where a reasonable degree of competition does not exist, the commissioner shall determine whether the rate charged produces a rate of return that is not in excess of a reasonable rate of return. To determine what is a reasonable rate of return, the riskiness of the class of insurance, the profitability of the insurer in that class of business, and other relevant factors shall be considered.\nRates are inadequate only if they will endanger the solidity of an insurer that uses them or if they are insufficient to sustain projected losses and expenses within the state. Rates are conclusively presumed to be adequate if they are sufficient to sustain projected losses and expenses within the state.\nOne rate is unfairly discriminatory in relation to another if it clearly fails to reflect equitably the differences in expected losses, expenses and the degree of risk. Rates are not unfairly discriminatory because different premiums result for policyholders with like loss exposures but different expense factors, or like expense factors but different loss exposures, so long as the rates reflect the differences with reasonable accuracy. Rates are not unfairly discriminatory if they attempt to spread risk broadly among persons insured under a group, franchise or blanket policy.\nUnfair price competition exists if an insurer charges any rate for the purpose of securing an unfair competitive advantage, or if the use of the rate has or tends to have or if continued will have or tend to have the effect of destroying competition or creating a monopoly.",
	"repealed": false
}