{
	"id": "609.651",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.651",
	"title": "609.651 STATE LOTTERY FRAUD.",
	"text": "A person is guilty of a felony and may be sentenced under subdivision 4 if the person does any of the following with intent to defraud the State Lottery:\n(1) alters or counterfeits a State Lottery ticket;\n(2) knowingly presents an altered or counterfeited State Lottery ticket for payment;\n(3) knowingly transfers an altered or counterfeited State Lottery ticket to another person; or\n(4) otherwise claims a lottery prize by means of fraud, deceit, or misrepresentation.\nA person is guilty of a felony and may be sentenced under subdivision 4 if the person:\n(1) obtains access to a computer database maintained by the director without the specific authorization of the director;\n(2) obtains access to a computer database maintained by a person under contract with the director to maintain the database without the specific authorization of the director and the person maintaining the database.\nA person is guilty of a felony and may be sentenced under subdivision 4 if the person:\n(1) makes a materially false or misleading statement, or a material omission, in a record required to be submitted under chapter 349A; or\n(2) makes a materially false or misleading statement, or a material omission, in information submitted to the director of the State Lottery in a lottery retailer's application or a document related to a bid.\n(a) A person who violates subdivision 1 or 2 may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $50,000, or both.\n(b) A person who violates subdivision 1 or 2 and defrauds the State Lottery of $35,000 or more may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $100,000, or both.\n(c) A person who violates subdivision 3 may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $25,000, or both.",
	"repealed": false
}