{
	"id": "152.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.101",
	"title": "152.101 MANUFACTURERS, RECORDS.",
	"text": "Every person engaged in manufacturing, compounding, processing, selling, delivering or otherwise disposing of any controlled substance shall, upon July 1, 1971, May 1, 1973, and every second year thereafter, prepare a complete and accurate record of all stocks of each controlled substance on hand and shall keep such record for two years. When additional controlled substances are designated after July 1, 1971, a similar record must be prepared upon the effective date of their designation. On and after July 1, 1971, every person manufacturing, compounding or processing any controlled substance shall prepare and keep, for not less than two years, a complete and accurate record of the kind and quantity of each drug manufactured, compounded or processed and the date of such manufacture, compounding, or processing; and every person selling, delivering, or otherwise disposing of any controlled substance shall prepare or obtain, and keep for not less than two years, a complete and accurate record of the kind and quantity of each such controlled substance received, sold, delivered, or otherwise disposed of, the name and address from whom it was received and to whom it was sold, delivered or otherwise disposed of, and the date of such transaction. The form of such records shall be prescribed by the state board of pharmacy.\nThis section shall not apply to a licensed doctor of medicine, a doctor of osteopathic medicine duly licensed to practice medicine, a licensed doctor of dentistry, a licensed doctor of podiatry, or licensed doctor of veterinary medicine in the course of that doctor's professional practice, unless such practitioner regularly engages in dispensing any such drugs to the practitioner's patients for which the patients are charged, either separately or together with charges for other professional services.\nThis section shall not apply to a person engaged in bona fide research conducted under an exemption granted under applicable federal law.",
	"repealed": false
}