{
	"id": "61A.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.091",
	"title": "61A.091 EMPLOYEE GROUP LIFE INSURANCE PLANS.",
	"text": "No employer who makes available or otherwise sponsors a group life insurance plan that provides life insurance benefits to more than five employees of that employer, whether through insurance policies, self-insurance, or any combination of these arrangements, may require an employee to participate in the life insurance plan as a condition of employment, unless the employer pays the full cost of the plan. No employer may discharge any employee who pursuant to this section refuses to contribute to an employee group life insurance plan, nor shall the employer discriminate or otherwise retaliate against the employee who pursuant to this section refuses to contribute to an employee group life insurance plan. An employee may bring an action against an employer for recovery of any wages withheld in violation of this section. This remedy shall be in addition to any other remedy provided by law. For the purposes of this section, \"employer\" means any natural person, company, corporation, partnership, association or firm which employs any employee. \"Employee\" is an individual as defined by section 62E.02, subdivision 8. This section does not apply where a collectively bargained contract provides for mandatory participation in a group life insurance plan. This section does not apply to any insurance purchased or carried for the purpose of buying or selling any part of employer, its shares, its assets or its business. This section does not apply to any insurance purchased or carried by any pension, profit sharing or other retirement plan or trust.\nAll group life insurance policies covering employees of an employer containing a waiver of premium benefits upon total disability of the employee shall provide that termination of the master policy, for any reason whatsoever, will be without prejudice to the claim of any covered employee who is suffering from a disability, as defined in the group life policy waiver of premium section at the time of the termination. This subdivision may be superseded by a rule promulgated by the commissioner of commerce.",
	"repealed": false
}