{
	"id": "340A.3055",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.3055",
	"title": "340A.3055 MANUFACTURER'S WAREHOUSE PERMIT.",
	"text": "No brewer, malt liquor manufacturer, or intoxicating liquor manufacturer may import alcoholic beverages to a central warehouse, central distribution center, or holding area in Minnesota that the brewer or manufacturer owns or leases unless the brewer or manufacturer has obtained from the commissioner a manufacturer's warehouse permit for the facility. A manufacturer's warehouse permit allows a brewer or manufacturer to import alcoholic beverages for storage at the facility for which the permit is issued. No person other than a licensed wholesaler, or a motor carrier of property as defined in section 221.012, subdivision 27, or a common carrier as defined in section 218.011, subdivision 10, acting on behalf of a brewer, malt liquor manufacturer, intoxicating liquor manufacturer, or licensed wholesaler, may accept delivery from or pick up alcoholic beverages from the facility. A licensed wholesaler may distribute alcoholic beverages only from the wholesaler's warehouse.\nA permit under this section may be issued only to a brewer, malt liquor manufacturer, or intoxicating liquor manufacturer:\n(1) whose manufacturing facility or facilities are located outside Minnesota; and\n(2) who holds a valid importer's license under section 340A.302.\nThe annual fee for a permit under this section is $1,000.\nA holder of a permit under this section may sell alcoholic beverages stored in a facility to which a permit has been issued under this section only to:\n(1) a wholesaler licensed under this chapter;\n(2) a wholesaler licensed in another state; or\n(3) an out-of-state or out-of-country entity that sells alcoholic beverages at wholesale or retail.\nA holder of a permit under this section must report monthly to the commissioner of revenue, in a form and at a time the commissioner prescribes:\n(1) all alcoholic beverages imported into Minnesota and delivered to the permit holder's facility; and\n(2) all sales of alcoholic beverages made from the facility.\nReports to the commissioner of revenue under this subdivision shall remain confidential unless a manufacturer authorizes the release of a report.",
	"repealed": false
}