{
	"id": "327.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.32",
	"title": "327.32 CODE COMPLIANCE.",
	"text": "No person shall sell or offer for sale in this state any new manufactured home or manufacture any manufactured home in this state unless the manufactured home complies with the Manufactured Home Building Code and bears a label as required by the secretary.\nNo person shall sell or offer for sale in this state any used manufactured home manufactured after June 14, 1976, or install for occupancy any used manufactured home manufactured after June 14, 1976, unless the used manufactured home complies with the Notice of Compliance Form as provided in this subdivision. If manufactured after June 14, 1976, the home must bear a label or data plate as required by the secretary. The Notice of Compliance Form shall be signed by the seller and purchaser indicating which party is responsible for either making or paying for any necessary corrections prior to the sale and transferring ownership of the manufactured home.\nThe Notice of Compliance Form shall be substantially in the following form:\n\"Notice of Compliance Form as required in Minnesota Statutes, section 327.32,\nsubdivision 1\nThis notice must be completed and signed by the purchaser(s) and the seller(s) of the used manufactured home described in the purchase agreement and on the bottom of this notice before the parties transfer ownership of a used manufactured home constructed after June 14, 1976.\nElectric ranges and clothes dryers must have required four-conductor cords and plugs. For the purpose of complying with the requirements of section 327B.06, a licensed retailer or limited retailer shall retain at least one copy of the form required under this subdivision.\nSolid fuel-burning fireplaces or stoves must be listed for use in manufactured homes, Code of Federal Regulations, title 24, section 3280.709 (g), and installed correctly in accordance with their listing or standards (i.e., chimney, doors, hearth, combustion, or intake, etc., Code of Federal Regulations, title 24, section 3280.709 (g)).\nGas water heaters and furnaces must be listed for manufactured home use, Code of Federal Regulations, title 24, section 3280.709 (a) and (d)(1) and (2), and installed correctly, in accordance with their listing or standards.\nSmoke alarms are required to be installed and operational in accordance with Code of Federal Regulations, title 24, section 3280.208.\nCarbon monoxide alarms or CO detectors that are approved and operational are required to be installed within ten feet of each room lawfully used for sleeping purposes.\nEgress windows are required in every bedroom with at least one operable window with a net clear opening of 20 inches wide and 24 inches high, five square feet in area, with the bottom of windows opening no more than 36 inches above the floor. Locks, latches, operating handles, tabs, or other operational devices shall not be located more than 54 inches above the finished floor.\nThe furnace compartment of the home is required to have interior finish with a flame spread rating not exceeding 25, as specified in the 1976 United States Department of Housing and Urban Development Code governing manufactured housing construction.\nThe water heater enclosure in this home is required to have interior finish with a flame spread rating not exceeding 25, as specified in the 1976 United States Department of Housing and Urban Development Code governing manufactured housing construction.\nThe home complies with the snowload and heat zone requirements for the state of Minnesota as indicated by the data plate.\nThe parties to this agreement have initialed all required sections and agree by their signature to complete any necessary corrections prior to the sale or transfer of ownership of the home described below as listed in the purchase agreement. The state of Minnesota or a local building official has the authority to inspect the home in the manner described in Minnesota Statutes, section 327.33, prior to or after the sale to ensure compliance was properly executed as provided under the Manufactured Home Building Code.\nAn alternative frost-free design slab for a new or used manufactured home that is submitted to the local building official, third-party inspector, or the department, stamped by a licensed professional engineer or architect as being in compliance with either the federal installation standards in effect at the date of manufacture, the manufacturer's installation manual, or the Minnesota State Building Code, when applicable, shall be issued a permit or approval within ten days of being received by the approving authority.\nAll new single-section manufactured homes and new multisection manufactured homes shall be installed in compliance with either the manufacturer's installation instructions in effect at the date of manufacture or, when applicable, the Minnesota State Building Code.\nAll used multisection manufactured homes shall be installed in compliance with the manufacturer's installation instructions in effect at the date of manufacture, approved addenda, or, when applicable, the Minnesota State Building Code.\n(a) All used manufactured homes reinstalled less than 24 months from the date of installation by the first purchaser must be reinstalled in compliance with subdivision 1c. All used manufactured homes reinstalled more than 24 months from the date of installation by the first purchaser may be reinstalled without a frost-protected foundation if the home is reinstalled in compliance with Minnesota Rules, chapter 1350, for above frost-line installations and the notice requirement of subdivision 1f is complied with by the seller and the purchaser of the used manufactured home.\n(b) The installer or licensed residential building contractor shall affix an installation seal issued by the department to the outside of the home as required by the Minnesota State Building Code. The certificate of installation issued by the installer of record shall clearly state that the home has been reinstalled with an above frost-line foundation. Fees for inspection of a reinstallation and for issuance of reinstallation seals shall follow the requirements of sections 326B.802 to 326B.885. Fees for review of plans, specifications, and on-site inspections shall be those as specified in section 326B.153, subdivision 1, paragraph (c). Whenever an installation certificate for an above frost-line installation is issued to a used manufactured home being listed for sale, the purchase agreement must disclose that the home is installed on a nonfrost-protected foundation and recommend that the purchaser have the home inspected to determine the effects of frost on the home.\n(c) An installation seal may be issued to a residential building contractor licensed under section 326B.805 for use in the installation of used manufactured homes only after the qualifying person for the residential building contractor has completed a three-hour training course relating to the installation of manufactured homes that has been approved by either the United States Department of Housing and Urban Development or by the commissioner. The course completion certificate shall be submitted to the commissioner. For the purposes of this subdivision, \"qualifying person\" has the meaning given in section 326B.802, subdivision 10.\nThe seller of the used manufactured home being reinstalled under subdivision 1e shall provide the following notice to the purchaser and secure signatures of all parties to the purchase agreement on or before signing a purchase agreement prior to submitting an application for an installation certificate. Whenever a current owner of a manufactured home reinstalls the manufactured home under subdivision 1e, the current owner is not required to comply with the notice requirement under this subdivision. The notice shall be in at least 14-point font, except the heading, \"WHICH MAY VOID WARRANTY,\" must be in capital letters, in 20-point font. The notice must be printed on a separate sheet of paper in a color different than the paper on which the purchase agreement is printed. The notice becomes a part of the purchase agreement and shall be substantially in the following form:\n\"Notice of Reinstalling of a Used Manufactured Home Above Frost-Line;\nWHICH MAY VOID WARRANTY\nIt is recommended that the used manufactured home being reinstalled follow the instructions in the manufacturer's installation manual. By signing this notice, the purchaser(s) are acknowledging they have elected to use footings placed above the local frost line in accordance with the Minnesota State Building Code.\nThe seller has explained the differences between the manufacturer's installation instructions and the installation system selected by the purchaser(s) with respect to possible effects of frost on the manufactured home.\nThe purchaser(s) acknowledge by signing this notice that there is no manufacturer's original warranty remaining on the home and recognize that any other extended or ancillary warranty could be adversely affected if any applicable warranty stipulates that the home be installed in accordance with the manufacturer's installation manual to remain effective.\nAfter the reinstallation of the manufactured home, it is highly recommended that the purchaser(s) have a licensed manufactured home installer recheck the home's installation for any releveling needs or anchoring system adjustments each freeze-thaw cycle.\nThe purchaser(s) of the used manufactured home described below that is being reinstalled acknowledge they have read this notice and have been advised to contact the manufacturer of the home and/or the Department of Labor and Industry if they desire additional information before signing this notice. It is the intent of this notice to inform the purchaser(s) that the purchaser(s) elected not to use a frost-protected foundation system for the reinstallation of the manufactured home as originally required by the home's installation manual.\nPlain language notice.\nI understand that because this home will be installed with footings placed above the local frost line, this home may be subject to adverse effects from frost heave that may damage this home. Purchaser(s) initials: .......\nI understand that the installation of this home with footings placed above the local frost line could affect my ability to obtain a mortgage or mortgage insurance on this home. Purchaser(s) initials: .......\nI understand that the installation of this home with footings placed above the local frost line could void my warranty on the home if any warranty is still in place on this home. Purchaser(s) initials: .......\nName of licensed installer and license number or homeowner responsible for the installation of the home as described above.\nThe commissioner shall issue seals for any manufactured home manufactured after July 1, 1972, and prior to June 15, 1976, to any person upon application supported by evidence the commissioner deems necessary to establish that the seals will be affixed only to manufactured homes which comply with the Manufactured Home Building Code.\nNo person shall alter any manufactured home to which a seal or label has been affixed if the alteration causes the manufactured home to be in violation of the Manufactured Home Building Code. The commissioner may make rules regarding alterations and permits therefor.\n[Repealed, 2010 c 347 art 3 s 75]\nNo manufactured home which bears a seal or label as provided in this section shall be required by any agency or political subdivision of this state to comply with any other building, plumbing, heating, or electrical code or any construction standards other than the Manufactured Home Building Code nor be subject to any other state or local building inspection, except as the commissioner shall, by rule, provide in the case of alterations, manufactured home accessory structures and installations, or except as otherwise provided by federal or state law. No manufactured home installation or manufactured home accessory structure shall be required by any agency or political subdivision of this state to comply with any installation standards other than those adopted and promulgated by the commissioner. Nothing in this section shall be construed to inhibit the application of zoning, subdivision, architectural, or esthetic requirements pursuant to chapter 462.\nNo person shall install any manufactured home or manufactured home accessory structure in violation of any rule promulgated by the commissioner. The commissioner shall issue installation seals to any manufactured home installer upon application supported by evidence the commissioner deems necessary to establish that the seals will be affixed only to those manufactured homes where the installation complies with the commissioner's rules. No person shall install a manufactured home in a manufactured home park as defined in section 327.14, subdivision 3, which is located within a governmental subdivision which has enacted an ordinance requiring that manufactured homes within its jurisdiction be secured by an anchoring system, unless the manufactured home is secured by an anchoring system which complies with the commissioner's rules.\nAll jurisdictions enforcing the State Building Code, in accordance with sections 326B.101 to 326B.151, shall undertake or provide for the administration and enforcement of the manufactured home installation rules promulgated by the commissioner. Municipalities which have adopted the State Building Code may provide installation inspection and plan review services in noncode areas of the state.\nEach manufacturer, distributor, and dealer shall establish and maintain records, make reports, and provide information as the commissioner or the secretary may reasonably require to be able to determine whether the manufacturer, distributor, or dealer has acted or is acting in compliance with sections 327.31 to 327.35, and shall, upon request of a person duly designated by the commissioner or the secretary, permit that person to inspect appropriate books, papers, records, and documents relevant to determining whether that manufacturer, distributor, or dealer has acted or is acting in compliance with sections 327.31 to 327.35, and the National Manufactured Home Construction and Safety Standards Act of 1974, United States Code, title 42, section 5401, et seq., as amended by the National Manufactured Housing Construction and Safety Standards Act, Title VI, Manufactured Housing Improvement Act of 2000, or other applicable federal or state law.",
	"repealed": false
}