{
	"id": "137.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.51",
	"title": "137.51 LAND PROTECTION AND TRANSFER.",
	"text": "The obligation of the state of Minnesota to make the payments required under section 137.54 is expressly conditioned upon the university's covenant in perpetuity, subject to subdivision 3, limiting the use of the university land by the university, its successors, and assigns to the permitted university uses and the other permitted uses and forbidding the use of the university land by the university, its successors, and assigns for any of the prohibited uses. A declaration imposing those restrictions and granting to the Department of Natural Resources the right to enforce the same which has been executed by the university and filed in the Office of the Dakota County Recorder shall satisfy this condition. In furtherance of the purposes of this subdivision, the university and Department of Natural Resources shall promptly endeavor to enter into a joint powers agreement pursuant to section 471.59, or a conservation easement held by a qualified conservation organization or by a conservation easement holder as described in applicable Minnesota law embodying those restrictions, which agreement or easement shall provide for cooperative oversight of the use of the university land. Nothing in this section or in any declaration, agreement, or easement made or entered into pursuant to this section shall impair the rights of third parties under leases, easements, or use agreements in force as of May 25, 2006. Any lease or other transfer of the university land made after May 25, 2006, shall, unless otherwise agreed to by the commissioner of natural resources, be for a term that expires not later than the date the university land is conveyed as provided under subdivision 2. Any agreement between the board and the commissioner of natural resources must provide that the income received by the university from leases of the university land to third parties shall be dedicated to the operation and maintenance of the university land. Except as limited by Laws 2006, chapter 247, or by any declaration, agreement, or conservation easement made, entered into, or granted as provided in this section, the rights of the university with respect to the university land while it continues to own the land are not impaired.\nNot later than the date on which the state of Minnesota makes the last of the payments required under section 137.54, the Board of Regents of the University of Minnesota shall offer to convey the university land to the Department of Natural Resources in its \"as is\" condition by quitclaim deed, without warranties, for the sum of $1. The Department of Natural Resources may request conveyance of any or all of the university land offered to be conveyed and the regents shall convey the portion requested. The commissioner of natural resources may, at its option, request that the university convey all or part of the university land to another governmental unit of the state. Except as provided in this subdivision, the instrument of conveyance by the university may not limit the rights of the state with respect to the land. Any conveyance shall be subject to the perpetual right of the university to use the university land for the permitted university uses. A conveyance shall also be subject to the rights of third parties under leases, easements, and use agreements in force on May 25, 2006. The instruments of transfer shall otherwise limit the use of the university land to the other permitted uses and subject those uses to restrictions as may be provided in any agreement between the university and state or any conservation easement granted pursuant to subdivision 1, and proscribe its use for the prohibited purposes. The University of Minnesota shall have the right to enforce those limitations and restrictions. The university shall promptly endeavor and use due diligence to require the federal government to fulfill its obligations under applicable laws, including the Defense Environmental Restoration Program, United States Code, title 10, section 2701, et seq., or the Comprehensive Environmental Response Compensation and Liability Act, as amended, United States Code, title 42, section 9601, et seq., with respect to environmental contamination that occurred prior to the time the university took title to the university land. The university shall seal any abandoned wells on the land pursuant to state law.\nUnless otherwise agreed by the board and the commissioner of management and budget, in the event the state of Minnesota fails to make the total payments required by section 137.54 by July 1, 2033, the restrictions in this section on the university's use of the university land; any declaration, agreement, or conservation easement containing those restrictions; and the university's obligation to offer the university land to the state of Minnesota shall be null and void.",
	"repealed": false
}