{
	"id": "115A.1310",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1310",
	"title": "115A.1310 DEFINITIONS.",
	"text": "For the purposes of sections 115A.1310 to 115A.1330, the following terms have the meanings given.\n\"Cathode-ray tube\" or \"CRT\" means a vacuum tube or picture tube used to convert an electronic signal into a visual image.\n\"Collection\" means the aggregation of covered electronic devices from households and includes all the activities up to the time the covered electronic devices are delivered to a recycler.\n\"Collector\" means a public or private entity that receives covered electronic devices from households and arranges for the delivery of the devices to a recycler.\n\"Computer\" means an electronic, magnetic, optical, electrochemical, or other high-speed data processing device performing logical, arithmetic, or storage functions, but does not include an automated typewriter or typesetter, a portable handheld calculator or device, or other similar device.\n\"Computer monitor\" means an electronic device that is a cathode-ray tube or flat panel display primarily intended to display information from a central processing unit or the Internet.\n\"Covered electronic device\" means computers, including tablet computers and laptop computers, peripherals, facsimile machines, DVD players, video cassette recorders, and video display devices that are sold to a household by means of retail, wholesale, or electronic commerce.\n\"Department\" means the Department of Revenue.\n\"Dwelling unit\" has the meaning given in section 238.02, subdivision 21a.\n\"Household\" means an occupant of a single detached dwelling unit or a single unit of a multiple dwelling unit located in this state who has used a video display device at a dwelling unit primarily for personal use.\n\"Manufacturer\" means a person who:\n(1) manufactures video display devices to be sold under its own brand as identified by its own brand label; or\n(2) sells video display devices manufactured by others under its own brand as identified by its own brand label.\n\"Peripheral\" means a keyboard, printer, or any other device sold exclusively for external use with a computer that provides input or output into or from a computer.\n\"Phase I recycling credits\" means the number of pounds of covered electronic devices recycled by a manufacturer from households during program years one through nine, less the product of the number of pounds of video display devices sold to households during the same program year, multiplied by the proportion of sales a manufacturer is required to recycle.\n\"Phase II recycling credits\" means an amount calculated in a program year beginning July 1, 2019, and in each program year thereafter, according to the formula (1.5 x A) - (B - C), where:\nA = the number of pounds of covered electronic devices a manufacturer recycled or arranged to have collected and recycled during a program year from households located outside the 11-county metropolitan area, as defined in section 115A.1314, subdivision 2;\nB = the manufacturer's recycling obligation calculated for the same program year in section 115A.1320, subdivision 1, paragraph (g); and\nC = the number of pounds of covered electronic devices a manufacturer recycled or arranged to have collected and recycled, up to but not exceeding B, during the same program year from households in the 11-county metropolitan area.\n\"Portable battery\" means a rechargeable battery as defined in section 115A.9157.\n\"Program year\" means the period from July 1 through June 30.\n\"Recycler\" means a public or private individual or entity who accepts covered electronic devices from households and collectors for the purpose of recycling. A manufacturer who takes products for refurbishment or repair is not a recycler.\n\"Recycling\" means the process of collecting and preparing video display devices or covered electronic devices for use in manufacturing processes or for recovery of usable materials followed by delivery of such materials for use. Recycling does not include the destruction by incineration or other process or land disposal of recyclable materials nor reuse, repair, or any other process through which video display devices or covered electronic devices are returned to use for households in their original form.\n[Repealed, 2016 c 166 s 18]\n\"Retailer\" means a person who sells, rents, or leases, through sales outlets, catalogs, or the Internet, a video display device to a household and not for resale in any form.\n\"Sell\" or \"sale\" means any transfer for consideration of title or of the right to use, by lease or sales contract, including, but not limited to, transactions conducted through sales outlets, catalogs, or the Internet, or any other similar electronic means either inside or outside of the state, by a person who conducts the transaction and controls the delivery of a video display device to a consumer in the state, but does not include a manufacturer's or distributor's wholesale transaction with a distributor or a retailer.\n\"Television\" means an electronic device that is a cathode-ray tube or flat panel display primarily intended to receive video programming via broadcast, cable, or satellite transmission or video from surveillance or other similar cameras.\n\"Video display device\" means a television or computer monitor that contains a cathode-ray tube or a flat panel screen that is marketed by manufacturers for use by households. Video display device does not include any of the following:\n(1) a video display device that is part of a motor vehicle or any component part of a motor vehicle assembled by, or for, a vehicle manufacturer or franchised dealer, including replacement parts for use in a motor vehicle;\n(2) a video display device, including a touch-screen display, that is functionally or physically part of a larger piece of equipment or is designed and intended for use in an industrial; commercial, including retail; library checkout; traffic control; kiosk; security, other than household security; border control; or medical setting, including diagnostic, monitoring, or control equipment;\n(3) a video display device that is contained within a clothes washer, clothes dryer, refrigerator, refrigerator and freezer, microwave oven, conventional oven or range, dishwasher, room air conditioner, dehumidifier, or air purifier; or\n(4) a telephone of any type.",
	"repealed": false
}