{
	"id": "326.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.32",
	"title": "326.32 DEFINITIONS.",
	"text": "As used in sections 326.32 to 326.339, the terms defined in this section have the meanings given them.\nAn individual is \"armed with a firearm\" if at any time in the performance of the individual's duties the individual wears, carries, possesses, or has access to a firearm.\nAn individual is \"armed with a weapon\" if at any time in the performance of the individual's duties the individual wears, carries, possesses, or has access to:\n(1) a weapon other than a firearm; or\n(2) an immobilizing or restraining device.\n\"Board\" means the Board of Private Detective and Protective Agent Services.\n\"Board member\" means any person appointed as a member of the Board of Private Detective and Protective Agent Services.\n\"Chair\" means the board member designated by the board to act in the capacity of board chair.\n\"Board review\" means the process by which the board reviews and evaluates private detective or protective agent license applications.\n[Repealed, 1987 c 360 s 26]\n[Repealed, 1987 c 360 s 26]\n\"Applicant\" means any individual, partnership or corporation who has made application for a private detective or protective agent license.\n\"License\" means a private detective license or a protective agent license.\n\"License holder\" means any individual, partnership as defined in section 323A.0101, clause (8), or corporation licensed to perform the duties of a private detective or a protective agent.\n\"Minnesota manager\" means the member of a partnership or corporation, who meets the qualifications for licensing as provided in sections 326.32 to 326.339. The Minnesota manager must be actively involved in the day to day management and supervision of the licensed activity in the Minnesota office.\n\"Minnesota office\" means an office maintained in Minnesota by a license holder for the conduct or solicitation of business when the principal place of business of the license holder is located outside the state of Minnesota.\nA \"proprietary employer\" means an individual, partnership, or corporation that is not engaged in the business of providing protective agents but employs individuals to serve as security guards solely on the employer's property and its curtilage.\n\"Public member\" means a person who is not, nor ever was, a member of the profession or occupation being licensed, or the spouse of any such person or a person who has not, nor ever has had, a material or financial interest in either the providing of the professional service being licensed or regulated or an activity directly related to the profession being licensed.\n\"Qualified representative\" means the member of a partnership or corporation, who meets the qualifications for licensing as provided in sections 326.32 to 326.339. The qualified representative must be actively involved in the day to day management and supervision of the licensed activity.\n(a) \"Security guard\" means a person who wears or carries any insignia that identifies the person to the public as security, who is paid a fee, wage, or salary to do one or more of the following:\n(1) prevent or detect intrusion, unauthorized entry or activity, vandalism, or trespass on private property;\n(2) prevent or detect theft, loss, embezzlement, misappropriation, or concealment of merchandise, money, bonds, stocks, notes, or other valuable documents or papers;\n(3) control, regulate, or direct the flow or movements of the public, whether by vehicle or otherwise, to assure protection of private property;\n(4) protect individuals from bodily harm; or\n(5) enforce policies and rules of the security guard's employer related to crime reduction to the extent that the enforcement falls within the scope of the security guard's duties.\n(b) The term \"security guard\" does not include:\n(1) an auditor, accountant, or accounting clerk performing audits or accounting functions;\n(2) an employee of a firm licensed under section 326.3381 whose duties are primarily administrative or clerical in nature;\n(3) a person employed by a proprietary company to conduct plainclothes surveillance or investigation;\n(4) a person temporarily employed under statute or ordinance by political subdivisions to provide protective services at social functions;\n(5) an employee of an air or rail carrier;\n(6) a customer service representative or sales clerk employed in a retail establishment; or\n(7) a person employed to perform primarily maintenance or custodial functions.\n[Renumbered subd 1a]",
	"repealed": false
}