{
	"id": "298.282",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.282",
	"title": "298.282 DISTRIBUTION OF TACONITE MUNICIPAL AID ACCOUNT; TACONITE MUNICIPAL AID; PAYMENT.",
	"text": "(a) The amount deposited with the county as provided in section 298.28, subdivision 3, must be distributed as provided by this section among: (1) the municipalities located within a taconite assistance area under section 273.1341 that meet the criteria of section 273.1341, clause (1) or (2); (2) a township that contains a state park consisting primarily of an underground iron ore mine; (3) a city located within five miles of that state park; and (4) Breitung Township in St. Louis County, each being referred to in this section as a qualifying municipality. The distribution to Breitung Township under this subdivision shall be $25,000 annually.\n(b) The amount deposited in the state general fund as provided in section 298.018, subdivision 1, must be distributed in the same manner as provided under paragraph (a), except that subdivisions 3, 4, and 5 do not apply, and the distributions shall be made on the dates provided under section 298.018, subdivision 1a.\n(a) Each year following the final determination of the amount of taxes payable under section 298.24, the commissioner of revenue shall determine the amount in the taconite municipal aid account as of July 1 of that year and the amount to be distributed to each qualifying municipality during the year. The amount to be distributed to each qualifying municipality shall be determined by determining an index for each qualifying municipality by subtracting its local effort tax rate, multiplied by its equalized gross tax capacity, from its fiscal need factor. For the purposes of this subdivision, the following terms have the meanings given them herein. A municipality's \"local effort tax rate\" means its fiscal need factor per capita divided by $21 per capita for each one percent of the gross local tax rate or $17 per capita for each one percent of the net local tax rate for the first $350 of its fiscal need factor per capita; plus its fiscal need factor per capita divided by $18 per capita for each one percent of the gross local tax rate or $15 per capita for each one percent of the net local tax rate on that part of its fiscal need factor per capita, if any, in excess of $350. In no case shall a municipality's local effort tax rate be less than a gross local tax rate of 6.56 percent or a net local tax rate of 8.16 percent. A municipality's \"equalized gross tax capacity\" means its previous year tax capacity, less the tax capacity in any tax increment district, divided by the municipality's aggregate sales ratio covering the period ending two years prior to the year of aid distribution. A municipality's \"fiscal need factor\" means the three-year average of the sum of its municipal levy, taconite aids received under section 298.28, subdivisions 2, 11, paragraph (b), and this section and its local government aid distribution amount, for taxes payable and distribution amounts receivable in the three years immediately preceding the aid distribution year.\nThe ratio of the resulting index for each qualifying municipality to the sum of all qualifying municipalities' indexes shall be multiplied by the total amount in the taconite municipal aid account less the amount distributed pursuant to subdivision 5.\n(b) If the distribution under this section, sections 298.26 and 298.28, and chapter 477A, to any municipality would exceed that municipality's levy for that year, the amount in excess of the levy for that year shall reduce the amount distributed to the municipality under this section and this excess amount shall be distributed to the other qualifying municipalities in the same manner as the distribution made pursuant to subdivision 2, except that the qualifying municipality receiving an initial distribution when added to that received pursuant to sections 298.26, 298.28, and chapter 477A in excess of the qualifying municipality's levy, shall not receive a distribution nor shall its index be used in computing the distribution pursuant to this clause. The distributions to be received in the year in which the taxes are payable shall be compared to the levy for that same year. Upon completion of the determination, the commissioner of revenue shall certify to the chief clerical officer of each qualifying municipality the amount which will be distributed to the municipality from the taconite municipal aid account that year.\nIf the amount certified by the commissioner of revenue as distributable to any qualifying municipality is greater than the amount previously estimated to have been distributable to such qualifying municipality in such year, the excess distributed to such municipality shall be held in a separate fund by the qualifying municipality and shall not be expended until the succeeding calendar year. If the amount distributable to any qualifying municipality, after final determination by the commissioner of revenue is less than the amount estimated to have been distributable to such qualifying municipality, such municipality may issue certificates of indebtedness in the amount of the shortage and may include in its next tax levy an amount sufficient to pay such certificates of indebtedness and interest thereon or, if no certificates were issued, an amount equal to such shortage.\nOn or before September 15 of each year, the county auditor shall issue a warrant in favor of the treasurer of each qualifying municipality in the amount determined by the commissioner of revenue to be due and payable to such qualifying municipality in such year.\nThe county auditor shall annually on September 15 make a payment from the taconite municipal aid fund to cities and towns for the purpose of replacing the revenue loss to them resulting from Laws 1975, chapter 437, article XI, section 7. The amount of aid to be paid annually to each city and town is the amount they were entitled to receive for 1975 under the provisions of Minnesota Statutes 1974, section 298.32.",
	"repealed": false
}