{
	"id": "469.018",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.018",
	"title": "469.018 RENTALS.",
	"text": "Each authority shall manage and operate its housing projects in an efficient manner to enable it to fix the rentals or payments for dwelling accommodations at rates consistent with its providing decent, safe, and sanitary dwelling accommodations for persons of low income. No authority shall construct or operate any housing project for profit, or as a source of revenue to the municipality. An authority shall fix the rentals or payments for dwellings in its projects at no higher rates than it shall find to be necessary in order to produce revenues which, together with all other available moneys, revenues, income, and receipts of the authority, will be sufficient (1) to pay, as they become due, the principal and interest on the bonds of the authority; (2) to create and maintain reserves required to assure the payment of principal and interest as they become due on its bonds; (3) to meet the cost of, and to provide for, maintaining and operating the projects, including necessary reserves and the cost of any insurance, and the administrative expenses of the authority; and (4) to make payments in lieu of taxes that it determines are consistent with the maintenance of the low-rent character of projects.\nWith respect to the management and operation of a housing project the authority may employ reliable real estate operators or firms or brokers or the municipality to perform those services for it. No such real estate operators or firms or brokers or the municipality shall have any authority in tenant selection or the fixing of rentals. Each authority employing real estate operators or firms or brokers or the municipality shall require the execution of a contract of employment stating the terms and conditions under which the services are to be performed, which shall be subject to the approval of the commissioner of employment and economic development.\nNotwithstanding any other law to the contrary, no declaration governing a common interest community, as defined in chapter 515B, whether or not the common interest community is subject to chapter 515B, and no bylaw, regulation, rule, or policy adopted by or on behalf of the unit owners' association for a common interest community, may prohibit or limit an authority from leasing a residential unit owned by it to eligible persons of low or moderate income and their families under applicable state or federal legislation. Nothing in this subdivision shall prohibit common interest community declarations, bylaws, regulations, rules, or policies from otherwise regulating the use of a unit owned by an authority or the conduct of unit occupants, provided the regulations apply to all units in the common interest community; nor from enforcing a prohibition against leasing residential units that was effective before the authority owned the unit. This subdivision applies to all common interest community units owned by an authority for which title was acquired by the authority after January 1, 1999.",
	"repealed": false
}