{
	"id": "79A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.24",
	"title": "79A.24 COMMERCIAL SELF-INSURANCE GROUP SECURITY DEPOSIT.",
	"text": "Each year every commercial self-insurance group shall secure its estimated future liability for the payment of compensation and the performance of the obligations of its membership imposed under chapter 176. A new deposit must be posted in the following manner: within 30 days of the filing of the annual report, the security posting for all prior years plus one-third of the posting for the current year; by July 31, one-third of the posting for the current year; by October 31, the final one-third of the posting for the current year.\nThe minimum deposit is 125 percent of the commercial self-insurance group's estimated future liability for the payment of compensation as determined by an actuary. If the group has been in existence for three years, this minimum deposit shall be 110 percent of the commercial self-insurance group's estimated future liability for the payment of workers' compensation as determined by an actuary. Each actuarial study shall include a projection of future losses during a one-year period until the next scheduled actuarial study, less payments anticipated to be made during that time. The opinion may discount liabilities to present value at a rate up to the lesser of four percent per annum, or the average of the applicable federal midterm rates, based on annual compounding, as published by the United States Secretary of the Treasury under United States Code, title 26, section 1274(d), for the 12 months preceding the valuation date of the report. Deduction should be made for the total amount which is estimated to be returned to the commercial self-insurance group from any specific excess insurance coverage, aggregate excess insurance coverage, and any supplementary benefits which are estimated to be reimbursed by the special compensation fund. Supplementary benefits will not be reimbursed by the special compensation fund unless the special compensation fund assessment pursuant to section 176.129 is paid and the required reports are filed with the special compensation fund. In the case of surety bonds, bonds shall secure administrative and legal costs in addition to the liability for payment of compensation reflected on the face of the bond. In no event shall the security be less than the group's selected retention limit of the Workers' Compensation Reinsurance Association. The posting or depositing of security under this section shall release all previously posted or deposited security from any obligations under the posting or depositing and any surety bond so released shall be returned to the surety. Any other security shall be returned to the depositor or the person posting the bond.\nNotwithstanding the requirements of subdivisions 1 and 2, the commissioner may, until the next annual securing of liability, adjust this required security deposit for the portion attributable to the current year only, if, in the commissioner's judgment, the self-insurer will be able to meet its obligations under this chapter until the next annual securing of liability.\nThe commissioner may only accept as security, and the commercial self-insurance group shall deposit as security, cash, approved government securities as set forth in section 79A.04, subdivision 3a, surety bonds or irrevocable letters of credit in any combination in accordance with the requirements under section 79A.04, subdivision 3.\n(a) All surety bonds, irrevocable letters of credit, and documents showing issuance of any irrevocable letter of credit shall be deposited in accordance with the provisions of section 79A.071.\n(b) Upon the commissioner sending a request to renew, request to post, or request to increase a security deposit, a perfected security interest is created in the commercial self-insurance group's and member's assets in favor of the commissioner to the extent of any then unsecured portion of the commercial self-insurance group's incurred liabilities. The perfected security interest is transferred to any cash or securities thereafter posted by the commercial self-insurance group with the commissioner of management and budget and is released only upon either of the following:\n(1) the acceptance by the commissioner of a surety bond or irrevocable letter of credit for the full amount of the incurred liabilities for the payment of compensation; or\n(2) the return of cash or securities by the commissioner. The commercial self-insurance group loses all right, title, and interest in and any right to control all assets or obligations posted or left on deposit as security. In the event of a declaration of insolvency by a court of competent jurisdiction, or in the event of the issuance of a certificate of default by the commissioner, the commissioner shall liquidate the deposit as provided in this chapter, and transfer it to the commercial self-insurance group security fund for application to the commercial self-insurance group's incurred liability.\n(c) No securities in physical form on deposit with the commissioner of management and budget or the commissioner or custodial accounts assigned to the state shall be released or exchanged without an order from the commissioner. No security can be exchanged more than once every 90 days.\n(d) Any securities deposited with the commissioner of management and budget or with a custodial account assigned to the commissioner of management and budget or letters of credit or surety bonds held by the commissioner may be exchanged or replaced by the depositor with any other acceptable securities or letters of credit or surety bond of like amount so long as the market value of the securities or amount of the surety bonds or letter of credit equals or exceeds the amount of the deposit required. If securities are replaced by surety bond, the commercial self-insurance group must maintain securities on deposit in an amount sufficient to meet all outstanding workers' compensation liability arising during the period covered by the deposit of the replaced securities.\nA commercial self-insurance group may purchase an insurance policy from an insurer authorized to transact workers' compensation insurance in this state which provides coverage of all claims for compensation arising out of injuries occurring during the entire period or during a portion of the period of time in which the commercial self-insurance group has been in existence. While the insurance policy remains in effect, it discharges the obligation of the commercial self-insurance group to maintain a security deposit for the claims covered under the policy. A policy described in this subdivision may not be issued by an insurer unless it has previously been approved as to the insurer, form, and substance by the commissioner.\nIn the event of the insolvency of the insurer that issued a policy under subdivision 5 to a commercial self-insurance group, eligibility for chapter 60C coverage under the policy is determined by applying the requirements of section 60C.09, subdivision 2, clause (3), to each commercial self-insurance group member separately, rather than to the net worth of the commercial self-insurance group entity or aggregate net worth of all members of the commercial self-insurance group.",
	"repealed": false
}