{
	"id": "524.5-404",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-404",
	"title": "524.5-404 NOTICE.",
	"text": "(a) A copy of the petition and the notice of hearing on a petition for conservatorship or other protective order must be served personally on the respondent pursuant to section 524.5-406, paragraph (d), but if the respondent's location is unknown or personal service cannot be made, service on the respondent must be made by substituted service or publication. The notice must include a statement that the respondent must be physically present unless excused by the court, inform the respondent of the respondent's rights at the hearing, and, if the appointment of a conservator is requested, include a description of the nature, purpose, and consequences of an appointment. A failure to serve the respondent with a notice substantially complying with this paragraph precludes the court from granting the petition.\n(b) In a proceeding to establish a conservatorship or for another protective order, notice of the hearing shall also be given to the persons listed in the petition. Failure to give notice under this paragraph does not preclude the appointment of a conservator or the making of another protective order.\n(c) Notice of the hearing on a petition for an order after appointment of a conservator or making of another protective order, shall be given to interested persons pursuant to section 524.5-113 and to any other person as ordered by the court, except notice to the person subject to conservatorship is not required if the person subject to conservatorship has not attained 14 years of age and is not missing, detained, or unable to return to the United States.\n(d) The conservator shall give notice of the filing of the conservator's inventory, together with a copy of the inventory, to the person subject to conservatorship and any other person the court directs. The notice must be sent or delivered within 14 days after the filing of the inventory.",
	"repealed": false
}