{
	"id": "16B.357",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.357",
	"title": "16B.357 MINNESOTA ADVISORY COUNCIL ON INFRASTRUCTURE.",
	"text": "(a) The Minnesota Advisory Council on Infrastructure is established as provided under sections 16B.356 to 16B.359.\n(b) The purpose of the council is to define and maintain a vision for the future of Minnesota's infrastructure that provides for its proper management, coordination, and investment.\nThe council consists of the following voting members:\n(1) two members appointed by the governor;\n(2) two members appointed by the senate majority leader;\n(3) two members appointed by the senate minority leader;\n(4) two members appointed by the speaker of the house;\n(5) two members appointed by the house minority leader; and\n(6) one member appointed by the Indian Affairs Council.\nThe council consists of the following nonvoting members:\n(1) the commissioner of administration;\n(2) the commissioner of agriculture;\n(3) the commissioner of commerce;\n(4) the commissioner of employment and economic development;\n(5) the commissioner of health;\n(6) the commissioner of management and budget;\n(7) the commissioner of natural resources;\n(8) the commissioner of the Pollution Control Agency;\n(9) the commissioner of transportation;\n(10) the commissioner of Iron Range resources and rehabilitation;\n(11) the chair of the Metropolitan Council;\n(12) the chair of the Board of Water and Soil Resources;\n(13) the executive director of the Minnesota Public Facilities Authority;\n(14) the chancellor of Minnesota State Colleges and Universities; and\n(15) the president of the University of Minnesota.\n(a) An appointing authority under subdivision 2 may only appoint an individual who has direct and practical expertise and experience, whether from the public or private sector, in any of the following:\n(1) asset management in one or more of the areas of planning, design, construction, management, or operations and maintenance, for: (i) drinking water; (ii) wastewater; (iii) stormwater; (iv) transportation; (v) energy; or (vi) communications;\n(2) financial management and procurement; or\n(3) regional asset management across jurisdictions and infrastructure sectors.\n(b) Each appointing authority under subdivision 2, clauses (1) to (5), must appoint one individual who resides in a metropolitan county, as defined in section 473.121, subdivision 4, and one individual who resides outside of a metropolitan county.\n(c) No current legislator may be appointed to the council.\n(d) Prior to making appointments, the appointing authorities under subdivision 2 must coordinate and provide for:\n(1) geographic representation throughout the state;\n(2) representation for all major types of infrastructure assets; and\n(3) representation from the public and private sectors.\nEach appointing authority under subdivision 2 must acknowledge and give consideration to appointment recommendations made by interested stakeholders, including but not limited to:\n(1) the Association of Minnesota Counties;\n(2) the League of Minnesota Cities;\n(3) the Coalition of Greater Minnesota Cities;\n(4) the Minnesota Association of Townships;\n(5) the Minnesota Chapter of the American Public Works Association;\n(6) the Associated General Contractors of Minnesota;\n(7) a labor union representing the building trades;\n(8) a public utility;\n(9) the Minnesota Municipal Utilities Association;\n(10) the Minnesota Chamber of Commerce;\n(11) the Minnesota section of the American Water Works Association;\n(12) the Minnesota Rural Water Association; and\n(13) the Minnesota Rural Electric Association.\n(a) Notwithstanding section 15.06, subdivision 6, an individual specified under subdivision 3 may appoint a designee to serve on the council only as provided in this subdivision.\n(b) An individual specified under subdivision 3 may appoint a designee who serves on an ongoing basis to exercise the powers and duties as a nonvoting council member under this section. The designation must be made by written order, filed with the secretary of state. The designee must be a public employee who is:\n(1) a deputy commissioner or deputy director;\n(2) an assistant commissioner;\n(3) an immediate subordinate of the appointing authority;\n(4) a director of a relevant office; or\n(5) if the appointing authority is the chair of a board or council specified under subdivision 3, another member of that board or council.\n(a) The council must elect from among its voting members a chair, or cochairs, and vice-chair. As necessary, the council may elect other council members to serve as officers.\n(b) The chair is responsible for convening meetings of the council and setting each meeting agenda.\n(a) A majority of the council, including voting and nonvoting members and excluding vacancies, is a quorum.\n(b) The council may conduct business as provided under section 13D.015.\nThe compensation, membership terms, filling of vacancies, and removal of members on the council are as provided in section 15.0575.\nThe council is subject to the Minnesota Open Meeting Law under chapter 13D.\nThe council is subject to the Minnesota Data Practices Act under chapter 13.",
	"repealed": false
}