{
	"id": "273.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.13",
	"title": "273.13 CLASSIFICATION OF PROPERTY.",
	"text": "All real and personal property subject to a general property tax and not subject to any gross earnings or other in-lieu tax is hereby classified for purposes of taxation as provided by this section.\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1986 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1969 [Repealed, Ex1971 c 31 art 22 s 5]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1986 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1986 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1965 [Repealed, Ex1967 c 32 art 4 s 3]\nMS 1986 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1987 Supp [Repealed, 1988 c 719 art 5 s 81]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1971 [Repealed, 1974 c 313 s 1]\nMS 1982 [Repealed, 1984 c 593 s 46]\nMS 1986 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1969 [Repealed, Ex1971 c 31 art 36 s 2]\nMS 1987 Supp [Repealed, 1988 c 719 art 5 s 81]\nMS 1982 [Repealed, 1983 c 342 art 2 s 30]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1986 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1982 [Repealed, 1983 c 222 s 45]\nMS 1986 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 1984 [Repealed, 1Sp1985 c 14 art 4 s 98]\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\n\"Net tax capacity\" means the product of the appropriate classification rates in this section and taxable market values.\n(a) Except as provided in subdivision 23 and in paragraphs (b) and (c), real estate which is residential and used for homestead purposes is class 1a. In the case of a duplex or triplex in which one of the units is used for homestead purposes, the entire property is deemed to be used for homestead purposes. The market value of class 1a property must be determined based upon the value of the house, garage, and land.\nThe first $500,000 of market value of class 1a property has a net classification rate of one percent of its market value; and the market value of class 1a property that exceeds $500,000 has a classification rate of 1.25 percent of its market value.\n(b) Class 1b property includes homestead real estate or homestead manufactured homes used for the purposes of a homestead by:\n(1) any person who is blind as defined in section 256D.35, or the person who is blind and the spouse of the person who is blind;\n(2) any person who is permanently and totally disabled or by the person with a disability and the spouse of the person with a disability; or\n(3) the surviving spouse of a veteran who was permanently and totally disabled homesteading a property classified under this paragraph for taxes payable in 2008.\nProperty is classified and assessed under clause (2) only if the government agency or income-providing source certifies, upon the request of the homestead occupant, that the homestead occupant satisfies the disability requirements of this paragraph, and that the property is not eligible for the valuation exclusion under subdivision 34.\nProperty is classified and assessed under paragraph (b) only if the commissioner of revenue or the county assessor certifies that the homestead occupant satisfies the requirements of this paragraph.\nPermanently and totally disabled for the purpose of this subdivision means a condition which is permanent in nature and totally incapacitates the person from working at an occupation which brings the person an income. The first $50,000 market value of class 1b property has a net classification rate of .45 percent of its market value. The remaining market value of class 1b property is classified as class 1a or class 2a property, whichever is appropriate.\n(c) Class 1c property is commercial use real and personal property that abuts public water as defined in section 103G.005, subdivision 15, or abuts a state trail administered by the Department of Natural Resources, and is devoted to temporary and seasonal residential occupancy for recreational purposes but not devoted to commercial purposes for more than 250 days in the year preceding the year of assessment, and that includes a portion used as a homestead by the owner, which includes a dwelling occupied as a homestead by a shareholder of a corporation that owns the resort, a partner in a partnership that owns the resort, or a member of a limited liability company that owns the resort even if the title to the homestead is held by the corporation, partnership, or limited liability company. For purposes of this paragraph, property is devoted to a commercial purpose on a specific day if any portion of the property, excluding the portion used exclusively as a homestead, is used for residential occupancy and a fee is charged for residential occupancy. Class 1c property must contain three or more rental units. A \"rental unit\" is defined as a cabin, condominium, townhouse, sleeping room, or individual camping site equipped with water and electrical hookups for recreational vehicles. Class 1c property must provide recreational activities such as the rental of ice fishing houses, boats and motors, snowmobiles, downhill or cross-country ski equipment; provide marina services, launch services, or guide services; or sell bait and fishing tackle. Any unit in which the right to use the property is transferred to an individual or entity by deeded interest, or the sale of shares or stock, no longer qualifies for class 1c even though it may remain available for rent. A camping pad offered for rent by a property that otherwise qualifies for class 1c is also class 1c, regardless of the term of the rental agreement, as long as the use of the camping pad does not exceed 250 days. If the same owner owns two separate parcels that are located in the same township, and one of those properties is classified as a class 1c property and the other would be eligible to be classified as a class 1c property if it was used as the homestead of the owner, both properties will be assessed as a single class 1c property; for purposes of this sentence, properties are deemed to be owned by the same owner if each of them is owned by a limited liability company, and both limited liability companies have the same membership. The portion of the property used as a homestead is class 1a property under paragraph (a). The remainder of the property is classified as follows: the first $600,000 of market value is tier I, the next $1,700,000 of market value is tier II, and any remaining market value is tier III. The classification rates for class 1c are: tier I, 0.50 percent; tier II, 1.0 percent; and tier III, 1.25 percent. Owners of real and personal property devoted to temporary and seasonal residential occupancy for recreation purposes in which all or a portion of the property was devoted to commercial purposes for not more than 250 days in the year preceding the year of assessment desiring classification as class 1c, must submit a declaration to the assessor designating the cabins or units occupied for 250 days or less in the year preceding the year of assessment by January 15 of the assessment year. Those cabins or units and a proportionate share of the land on which they are located must be designated as class 1c as otherwise provided. The remainder of the cabins or units and a proportionate share of the land on which they are located must be designated as class 3a commercial. The owner of property desiring designation as class 1c property must provide guest registers or other records demonstrating that the units for which class 1c designation is sought were not occupied for more than 250 days in the year preceding the assessment if so requested. The portion of a property operated as a (1) restaurant, (2) bar, (3) gift shop, (4) conference center or meeting room, and (5) other nonresidential facility operated on a commercial basis not directly related to temporary and seasonal residential occupancy for recreation purposes does not qualify for class 1c.\n(d) Class 1d property includes structures that meet all of the following criteria:\n(1) the structure is located on property that is classified as agricultural property under section 273.13, subdivision 23;\n(2) the structure is occupied exclusively by seasonal farm workers during the time when they work on that farm, and the occupants are not charged rent for the privilege of occupying the property, provided that use of the structure for storage of farm equipment and produce does not disqualify the property from classification under this paragraph;\n(3) the structure meets all applicable health and safety requirements for the appropriate season; and\n(4) the structure is not salable as residential property because it does not comply with local ordinances relating to location in relation to streets or roads.\nThe market value of class 1d property has the same classification rates as class 1a property under paragraph (a).\n(a) An agricultural homestead consists of class 2a agricultural land that is homesteaded, along with any class 2b rural vacant land that is contiguous to the class 2a land under the same ownership. The market value of the house and garage and immediately surrounding one acre of land has the same classification rates as class 1a or 1b property under subdivision 22. The value of the remaining land including improvements up to the first tier valuation limit of agricultural homestead property has a classification rate of 0.5 percent of market value. The remaining property over the first tier has a classification rate of one percent of market value. For purposes of this subdivision, the \"first tier valuation limit of agricultural homestead property\" and \"first tier\" means the limit certified under section 273.11, subdivision 23.\n(b) Class 2a agricultural land consists of parcels of property, or portions thereof, that are agricultural land and buildings. Class 2a property has a classification rate of one percent of market value, unless it is part of an agricultural homestead under paragraph (a). Class 2a property must also include any property that would otherwise be classified as 2b, but is interspersed with class 2a property, including but not limited to sloughs, wooded wind shelters, acreage abutting ditches, ravines, rock piles, land subject to a setback requirement, and other similar land that is impractical for the assessor to value separately from the rest of the property or that is unlikely to be able to be sold separately from the rest of the property.\nAn assessor may classify the part of a parcel described in this subdivision that is used for agricultural purposes as class 2a and the remainder in the class appropriate to its use.\n(c) Class 2b rural vacant land consists of parcels of property, or portions thereof, that are unplatted real estate, rural in character and not used for agricultural purposes, including land used for growing trees for timber, lumber, and wood and wood products, that is not improved with a structure. The presence of a minor, ancillary nonresidential structure as defined by the commissioner of revenue does not disqualify the property from classification under this paragraph. Any parcel of 20 acres or more improved with a structure that is not a minor, ancillary nonresidential structure must be split-classified, and ten acres must be assigned to the split parcel containing the structure. If a parcel of 20 acres or more is enrolled in the sustainable forest management incentive program under chapter 290C, the number of acres assigned to the split parcel improved with a structure that is not a minor, ancillary nonresidential structure must equal three acres or the number of acres excluded from the sustainable forest incentive act covenant due to the structure, whichever is greater. Class 2b property has a classification rate of one percent of market value unless it is part of an agricultural homestead under paragraph (a), or qualifies as class 2c under paragraph (d).\n(d) Class 2c managed forest land consists of no less than 20 and no more than 1,920 acres statewide per taxpayer that is being managed under a forest management plan that meets the requirements of chapter 290C, but is not enrolled in the sustainable forest resource management incentive program. It has a classification rate of .65 percent, provided that the owner of the property must apply to the assessor in order for the property to initially qualify for the reduced rate and provide the information required by the assessor to verify that the property qualifies for the reduced rate. If the assessor receives the application and information before May 1 in an assessment year, the property qualifies beginning with that assessment year. If the assessor receives the application and information after April 30 in an assessment year, the property may not qualify until the next assessment year. The commissioner of natural resources must concur that the land is qualified. The commissioner of natural resources shall annually provide county assessors verification information on a timely basis. The presence of a minor, ancillary nonresidential structure as defined by the commissioner of revenue does not disqualify the property from classification under this paragraph.\n(e) Agricultural land as used in this section means:\n(1) contiguous acreage of ten acres or more, used during the preceding year for agricultural purposes; or\n(2) contiguous acreage used during the preceding year for an intensive livestock or poultry confinement operation, provided that land used only for pasturing or grazing does not qualify under this clause.\n\"Agricultural purposes\" as used in this section means the raising, cultivation, drying, or storage of agricultural products for sale, or the storage of machinery or equipment used in support of agricultural production by the same farm entity. For a property to be classified as agricultural based only on the drying or storage of agricultural products, the products being dried or stored must have been produced by the same farm entity as the entity operating the drying or storage facility. \"Agricultural purposes\" also includes (i) enrollment in a local conservation program or the Reinvest in Minnesota program under sections 103F.501 to 103F.535 or the federal Conservation Reserve Program as contained in Public Law 99-198 or a similar state or federal conservation program if the property was classified as agricultural (A) under this subdivision for taxes payable in 2003 because of its enrollment in a qualifying program and the land remains enrolled or (B) in the year prior to its enrollment, or (ii) use of land, not to exceed three acres, to provide environmental benefits such as buffer strips, old growth forest restoration or retention, or retention ponds to prevent soil erosion. For purposes of this section, a \"local conservation program\" means a program administered by a town, statutory or home rule charter city, or county, including a watershed district, water management organization, or soil and water conservation district, in which landowners voluntarily enroll land and receive incentive payments equal to at least $50 per acre in exchange for use or other restrictions placed on the land. In order for property to qualify under the local conservation program provision, a taxpayer must apply to the assessor by February 1 of the assessment year and must submit the information required by the assessor, including but not limited to a copy of the program requirements, the specific agreement between the land owner and the local agency, if applicable, and a map of the conservation area. Agricultural classification shall not be based upon the market value of any residential structures on the parcel or contiguous parcels under the same ownership.\n\"Contiguous acreage,\" for purposes of this paragraph, means all of, or a contiguous portion of, a tax parcel as described in section 272.193, or all of, or a contiguous portion of, a set of contiguous tax parcels under that section that are owned by the same person.\n(f) Agricultural land under this section also includes:\n(1) contiguous acreage that is less than ten acres in size and exclusively used in the preceding year for raising or cultivating agricultural products; or\n(2) contiguous acreage that contains a residence and is less than 11 acres in size, if the contiguous acreage exclusive of the house, garage, and surrounding one acre of land was used in the preceding year for one or more of the following three uses:\n(i) for an intensive grain drying or storage operation, or for intensive machinery or equipment storage activities used to support agricultural activities on other parcels of property operated by the same farming entity;\n(ii) as a nursery, provided that only those acres used intensively to produce nursery stock are considered agricultural land; or\n(iii) for intensive market farming; for purposes of this paragraph, \"market farming\" means the cultivation of one or more fruits or vegetables or production of animal or other agricultural products for sale to local markets by the farmer or an organization with which the farmer is affiliated.\n\"Contiguous acreage,\" for purposes of this paragraph, means all of a tax parcel as described in section 272.193, or all of a set of contiguous tax parcels under that section that are owned by the same person.\n(g) Land shall be classified as agricultural even if all or a portion of the agricultural use of that property is the leasing to, or use by another person for agricultural purposes.\nClassification under this subdivision is not determinative for qualifying under section 273.111.\n(h) The property classification under this section supersedes, for property tax purposes only, any locally administered agricultural policies or land use restrictions that define minimum or maximum farm acreage.\n(i) The term \"agricultural products\" as used in this subdivision includes production for sale of:\n(1) livestock, dairy animals, dairy products, poultry and poultry products, fur-bearing animals, horticultural and nursery stock, fruit of all kinds, vegetables, forage, grains, bees, and apiary products by the owner;\n(2) aquacultural products for sale and consumption, as defined under section 17.47, if the aquaculture occurs on land zoned for agricultural use;\n(3) the commercial boarding of horses, which may include related horse training and riding instruction, if the boarding is done on property that is also used for raising pasture to graze horses or raising or cultivating other agricultural products as defined in clause (1);\n(4) property which is owned and operated by nonprofit organizations used for equestrian activities, excluding racing;\n(5) game birds and waterfowl bred and raised (i) on a game farm licensed under section 97A.105, provided that the annual licensing report to the Department of Natural Resources, which must be submitted annually by March 30 to the assessor, indicates that at least 500 birds were raised or used for breeding stock on the property during the preceding year and that the owner provides a copy of the owner's most recent schedule F; or (ii) for use on a shooting preserve licensed under section 97A.115;\n(6) insects primarily bred to be used as food for animals;\n(7) trees, grown for sale as a crop, including short rotation woody crops, and not sold for timber, lumber, wood, or wood products; and\n(8) maple syrup taken from trees grown by a person licensed by the Minnesota Department of Agriculture under chapter 28A as a food processor.\n(j) If a parcel used for agricultural purposes is also used for commercial or industrial purposes, including but not limited to:\n(1) wholesale and retail sales;\n(2) processing of raw agricultural products or other goods;\n(3) warehousing or storage of processed goods; and\n(4) office facilities for the support of the activities enumerated in clauses (1), (2), and (3), the assessor shall classify the part of the parcel used for agricultural purposes as class 1b, 2a, or 2b, whichever is appropriate, and the remainder in the class appropriate to its use. The grading, sorting, and packaging of raw agricultural products for first sale is considered an agricultural purpose. A greenhouse or other building where horticultural or nursery products are grown that is also used for the conduct of retail sales must be classified as agricultural if it is primarily used for the growing of horticultural or nursery products from seed, cuttings, or roots and occasionally as a showroom for the retail sale of those products. Use of a greenhouse or building only for the display of already grown horticultural or nursery products does not qualify as an agricultural purpose.\n(k) The assessor shall determine and list separately on the records the market value of the homestead dwelling and the one acre of land on which that dwelling is located. If any farm buildings or structures are located on this homesteaded acre of land, their market value shall not be included in this separate determination.\n(l) Class 2d airport landing area consists of a landing area or public access area of a privately owned public use airport. It has a classification rate of one percent of market value. To qualify for classification under this paragraph, a privately owned public use airport must be licensed as a public airport under section 360.018. For purposes of this paragraph, \"landing area\" means that part of a privately owned public use airport properly cleared, regularly maintained, and made available to the public for use by aircraft and includes runways, taxiways, aprons, and sites upon which are situated landing or navigational aids. A landing area also includes land underlying both the primary surface and the approach surfaces that comply with all of the following:\n(i) the land is properly cleared and regularly maintained for the primary purposes of the landing, taking off, and taxiing of aircraft; but that portion of the land that contains facilities for servicing, repair, or maintenance of aircraft is not included as a landing area;\n(ii) the land is part of the airport property; and\n(iii) the land is not used for commercial or residential purposes.\nThe land contained in a landing area under this paragraph must be described and certified by the commissioner of transportation. The certification is effective until it is modified, or until the airport or landing area no longer meets the requirements of this paragraph. For purposes of this paragraph, \"public access area\" means property used as an aircraft parking ramp, apron, or storage hangar, or an arrival and departure building in connection with the airport.\n(m) Class 2e consists of land with a commercial aggregate deposit that is not actively being mined and is not otherwise classified as class 2a or 2b, provided that the land is not located in a county that has elected to opt-out of the aggregate preservation program as provided in section 273.1115, subdivision 6. It has a classification rate of one percent of market value. To qualify for classification under this paragraph, the property must be at least ten contiguous acres in size and the owner of the property must record with the county recorder of the county in which the property is located an affidavit containing:\n(1) a legal description of the property;\n(2) a disclosure that the property contains a commercial aggregate deposit that is not actively being mined but is present on the entire parcel enrolled;\n(3) documentation that the conditional use under the county or local zoning ordinance of this property is for mining; and\n(4) documentation that a permit has been issued by the local unit of government or the mining activity is allowed under local ordinance. The disclosure must include a statement from a registered professional geologist, engineer, or soil scientist delineating the deposit and certifying that it is a commercial aggregate deposit.\nFor purposes of this section and section 273.1115, \"commercial aggregate deposit\" means a deposit that will yield crushed stone or sand and gravel that is suitable for use as a construction aggregate; and \"actively mined\" means the removal of top soil and overburden in preparation for excavation or excavation of a commercial deposit.\n(n) When any portion of the property under this subdivision or subdivision 22 begins to be actively mined, the owner must file a supplemental affidavit within 60 days from the day any aggregate is removed stating the number of acres of the property that is actively being mined. The acres actively being mined must be (1) valued and classified under subdivision 24 in the next subsequent assessment year, and (2) removed from the aggregate resource preservation property tax program under section 273.1115, if the land was enrolled in that program. Copies of the original affidavit and all supplemental affidavits must be filed with the county assessor, the local zoning administrator, and the Department of Natural Resources, Division of Land and Minerals. A supplemental affidavit must be filed each time a subsequent portion of the property is actively mined, provided that the minimum acreage change is five acres, even if the actual mining activity constitutes less than five acres.\n(o) The definitions prescribed by the commissioner under paragraphs (c) and (d) are not rules and are exempt from the rulemaking provisions of chapter 14, and the provisions in section 14.386 concerning exempt rules do not apply.\nCommercial and industrial property and utility real and personal property is class 3a.\n(1) Except as otherwise provided, each parcel of commercial, industrial, or utility real property has a classification rate of 1.5 percent of the first tier of market value, and 2.0 percent of the remaining market value. In the case of contiguous parcels of property owned by the same person or entity, only the value equal to the first-tier value of the contiguous parcels qualifies for the reduced classification rate, except that contiguous parcels owned by the same person or entity shall be eligible for the first-tier value classification rate on each separate business operated by the owner of the property, provided the business is housed in a separate structure. For the purposes of this subdivision, the first tier means the first $150,000 of market value. Real property owned in fee by a utility for transmission line right-of-way shall be classified at the classification rate for the higher tier.\nFor purposes of this subdivision, parcels are considered to be contiguous even if they are separated from each other by a road, street, waterway, or other similar intervening type of property. Connections between parcels that consist of power lines or pipelines do not cause the parcels to be contiguous. Property owners who have contiguous parcels of property that constitute separate businesses that may qualify for the first-tier classification rate shall notify the assessor by July 1, for treatment beginning in the following taxes payable year.\n(2) All personal property that is: (i) part of an electric generation, transmission, or distribution system; or (ii) part of a pipeline system transporting or distributing water, gas, crude oil, or petroleum products; and (iii) not described in clause (3), and all railroad operating property has a classification rate as provided under clause (1) for the first tier of market value and the remaining market value. In the case of multiple parcels in one county that are owned by one person or entity, only one first tier amount is eligible for the reduced rate.\n(3) The entire market value of personal property that is: (i) tools, implements, and machinery of an electric generation, transmission, or distribution system; (ii) tools, implements, and machinery of a pipeline system transporting or distributing water, gas, crude oil, or petroleum products; or (iii) the mains and pipes used in the distribution of steam or hot or chilled water for heating or cooling buildings, has a classification rate as provided under clause (1) for the remaining market value in excess of the first tier.\n(4) Real property used for raising, cultivating, processing, or storing cannabis plants, cannabis flower, or cannabis products for sale has a classification rate as provided under clause (1) for the first tier of market value and the remaining market value. As used in this paragraph, \"cannabis plant\" has the meaning given in section 342.01, subdivision 19, \"cannabis flower\" has the meaning given in section 342.01, subdivision 16, and \"cannabis product\" has the meaning given in section 342.01, subdivision 20.\nMS 2000 [Repealed, 1Sp2001 c 5 art 3 s 96]\n(a) Class 4a is residential real estate containing four or more units and used or held for use by the owner or by the tenants or lessees of the owner as a residence for rental periods of 30 days or more, excluding property qualifying for class 4d. Class 4a also includes hospitals licensed under sections 144.50 to 144.56, other than hospitals exempt under section 272.02, and contiguous property used for hospital purposes, without regard to whether the property has been platted or subdivided. The market value of class 4a property has a classification rate of 1.25 percent.\n(b) Class 4b includes:\n(1) residential real estate containing less than four units, including property rented as a short-term rental property for more than 14 days in the preceding year, that does not qualify as class 4bb, other than seasonal residential recreational property;\n(2) manufactured homes not classified under any other provision;\n(3) a dwelling, garage, and surrounding one acre of property on a nonhomestead farm classified under subdivision 23, paragraph (b) containing two or three units; and\n(4) unimproved property that is classified residential as determined under subdivision 33.\nFor the purposes of this paragraph, \"short-term rental property\" means nonhomestead residential real estate rented for periods of less than 30 consecutive days.\nThe market value of class 4b property has a classification rate of 1.25 percent.\n(c) Class 4bb includes:\n(1) nonhomestead residential real estate containing one unit, other than seasonal residential recreational property;\n(2) a single family dwelling, garage, and surrounding one acre of property on a nonhomestead farm classified under subdivision 23, paragraph (b); and\n(3) a condominium-type storage unit having an individual property identification number that is not used for a commercial purpose.\nClass 4bb property has the same classification rates as class 1a property under subdivision 22.\nProperty that has been classified as seasonal residential recreational property at any time during which it has been owned by the current owner or spouse of the current owner does not qualify for class 4bb.\n(d) Class 4c property includes:\n(1) except as provided in subdivision 22, paragraph (c), real and personal property devoted to commercial temporary and seasonal residential occupancy for recreation purposes, for not more than 250 days in the year preceding the year of assessment. For purposes of this clause, property is devoted to a commercial purpose on a specific day if any portion of the property is used for residential occupancy, and a fee is charged for residential occupancy. Class 4c property under this clause must contain three or more rental units. A \"rental unit\" is defined as a cabin, condominium, townhouse, sleeping room, or individual camping site equipped with water and electrical hookups for recreational vehicles. A camping pad offered for rent by a property that otherwise qualifies for class 4c under this clause is also class 4c under this clause regardless of the term of the rental agreement, as long as the use of the camping pad does not exceed 250 days. In order for a property to be classified under this clause, either (i) the business located on the property must provide recreational activities, at least 40 percent of the annual gross lodging receipts related to the property must be from business conducted during 90 consecutive days, and either (A) at least 60 percent of all paid bookings by lodging guests during the year must be for periods of at least two consecutive nights; or (B) at least 20 percent of the annual gross receipts must be from charges for providing recreational activities, or (ii) the business must contain 20 or fewer rental units, and must be located in a township or a city with a population of 2,500 or less located outside the metropolitan area, as defined under section 473.121, subdivision 2, that contains a portion of a state trail administered by the Department of Natural Resources. For purposes of item (i)(A), a paid booking of five or more nights shall be counted as two bookings. Class 4c property also includes commercial use real property used exclusively for recreational purposes in conjunction with other class 4c property classified under this clause and devoted to temporary and seasonal residential occupancy for recreational purposes, up to a total of two acres, provided the property is not devoted to commercial recreational use for more than 250 days in the year preceding the year of assessment and is located within two miles of the class 4c property with which it is used. In order for a property to qualify for classification under this clause, the owner must submit a declaration to the assessor designating the cabins or units occupied for 250 days or less in the year preceding the year of assessment by January 15 of the assessment year. Those cabins or units and a proportionate share of the land on which they are located must be designated class 4c under this clause as otherwise provided. The remainder of the cabins or units and a proportionate share of the land on which they are located will be designated as class 3a. The owner of property desiring designation as class 4c property under this clause must provide guest registers or other records demonstrating that the units for which class 4c designation is sought were not occupied for more than 250 days in the year preceding the assessment if so requested. The portion of a property operated as a (1) restaurant, (2) bar, (3) gift shop, (4) conference center or meeting room, and (5) other nonresidential facility operated on a commercial basis not directly related to temporary and seasonal residential occupancy for recreation purposes does not qualify for class 4c. For the purposes of this paragraph, \"recreational activities\" means renting ice fishing houses, boats and motors, snowmobiles, downhill or cross-country ski equipment; providing marina services, launch services, or guide services; or selling bait and fishing tackle;\n(2) qualified property used as a golf course if:\n(i) it is open to the public on a daily fee basis. It may charge membership fees or dues, but a membership fee may not be required in order to use the property for golfing, and its green fees for golfing must be comparable to green fees typically charged by municipal courses; and\n(ii) it meets the requirements of section 273.112, subdivision 3, paragraph (d).\nA structure used as a clubhouse, restaurant, or place of refreshment in conjunction with the golf course is classified as class 3a property;\n(3) real property up to a maximum of three acres of land owned and used by a nonprofit community service oriented organization and not used for residential purposes on either a temporary or permanent basis, provided that:\n(i) the property is not used for a revenue-producing activity for more than six days in the calendar year preceding the year of assessment; or\n(ii) the organization makes annual charitable contributions and donations at least equal to the property's previous year's property taxes and the property is allowed to be used for public and community meetings or events for no charge, as appropriate to the size of the facility.\nFor purposes of this clause:\n(A) \"charitable contributions and donations\" has the same meaning as lawful gambling purposes under section 349.12, subdivision 25, excluding those purposes relating to the payment of taxes, assessments, fees, auditing costs, and utility payments;\n(B) \"property taxes\" excludes the state general tax;\n(C) a \"nonprofit community service oriented organization\" means any corporation, society, association, foundation, or institution organized and operated exclusively for charitable, religious, fraternal, civic, or educational purposes, and which is exempt from federal income taxation pursuant to section 501(c)(3), (8), (10), or (19) of the Internal Revenue Code; and\n(D) \"revenue-producing activities\" shall include but not be limited to property or that portion of the property that is used as an on-sale intoxicating liquor or 3.2 percent malt liquor establishment licensed under chapter 340A, a restaurant open to the public, bowling alley, a retail store, gambling conducted by organizations licensed under chapter 349, an insurance business, or office or other space leased or rented to a lessee who conducts a for-profit enterprise on the premises.\nAny portion of the property not qualifying under either item (i) or (ii) is class 3a. The use of the property for social events open exclusively to members and their guests for periods of less than 24 hours, when an admission is not charged nor any revenues are received by the organization shall not be considered a revenue-producing activity.\nThe organization shall maintain records of its charitable contributions and donations and of public meetings and events held on the property and make them available upon request any time to the assessor to ensure eligibility. An organization meeting the requirement under item (ii) must file an application by May 1 with the assessor for eligibility for the current year's assessment. The commissioner shall prescribe a uniform application form and instructions;\n(4) postsecondary student housing of not more than one acre of land that is owned by a nonprofit corporation organized under chapter 317A and is used exclusively by a student cooperative, sorority, or fraternity for on-campus housing or housing located within two miles of the border of a college campus;\n(5)(i) manufactured home parks as defined in section 327.14, subdivision 3, excluding manufactured home parks described in items (ii) and (iii), (ii) manufactured home parks as defined in section 327.14, subdivision 3, that are described in section 273.124, subdivision 3a, and (iii) class I manufactured home parks as defined in section 327C.015, subdivision 2;\n(6) real property that is actively and exclusively devoted to indoor fitness, health, social, recreational, and related uses, is owned and operated by a not-for-profit corporation, and is located within the metropolitan area as defined in section 473.121, subdivision 2;\n(7) a leased or privately owned noncommercial aircraft storage hangar not exempt under section 272.01, subdivision 2, and the land on which it is located, provided that:\n(i) the land is on an airport owned or operated by a city, town, county, Metropolitan Airports Commission, or group thereof; and\n(ii) the land lease, or any ordinance or signed agreement restricting the use of the leased premise, prohibits commercial activity performed at the hangar.\nIf a hangar classified under this clause is sold after June 30, 2000, a bill of sale must be filed by the new owner with the assessor of the county where the property is located within 60 days of the sale;\n(8) a privately owned noncommercial aircraft storage hangar not exempt under section 272.01, subdivision 2, and the land on which it is located, provided that:\n(i) the land abuts a public airport; and\n(ii) the owner of the aircraft storage hangar provides the assessor with a signed agreement restricting the use of the premises, prohibiting commercial use or activity performed at the hangar; and\n(9) residential real estate, a portion of which is used by the owner for homestead purposes, and that is also a place of lodging, if all of the following criteria are met:\n(i) rooms are provided for rent to transient guests that generally stay for periods of 14 or fewer days;\n(ii) meals are provided to persons who rent rooms, the cost of which is incorporated in the basic room rate;\n(iii) meals are not provided to the general public except for special events on fewer than seven days in the calendar year preceding the year of the assessment; and\n(iv) the owner is the operator of the property.\nThe market value subject to the 4c classification under this clause is limited to five rental units. Any rental units on the property in excess of five, must be valued and assessed as class 3a. The portion of the property used for purposes of a homestead by the owner must be classified as class 1a property under subdivision 22;\n(10) real property up to a maximum of three acres and operated as a restaurant as defined under section 157.15, subdivision 12, provided it: (i) is located on a lake as defined under section 103G.005, subdivision 15, paragraph (a), clause (3); and (ii) is either devoted to commercial purposes for not more than 250 consecutive days, or receives at least 60 percent of its annual gross receipts from business conducted during four consecutive months. Gross receipts from the sale of alcoholic beverages must be included in determining the property's qualification under item (ii). The property's primary business must be as a restaurant and not as a bar. Gross receipts from gift shop sales located on the premises must be excluded. Owners of real property desiring 4c classification under this clause must submit an annual declaration to the assessor by February 1 of the current assessment year, based on the property's relevant information for the preceding assessment year;\n(11) lakeshore and riparian property and adjacent land, not to exceed six acres, used as a marina, as defined in section 86A.20, subdivision 5, which is made accessible to the public and devoted to recreational use for marina services. The marina owner must annually provide evidence to the assessor that it provides services, including lake or river access to the public by means of an access ramp or other facility that is either located on the property of the marina or at a publicly owned site that abuts the property of the marina. No more than 800 feet of lakeshore may be included in this classification. Buildings used in conjunction with a marina for marina services, including but not limited to buildings used to provide food and beverage services, fuel, boat repairs, or the sale of bait or fishing tackle, are classified as class 3a property; and\n(12) real and personal property devoted to noncommercial temporary and seasonal residential occupancy for recreation purposes.\nClass 4c property has a classification rate of 1.5 percent of market value, except that (i) each parcel of noncommercial seasonal residential recreational property under clause (12) has the same classification rates as class 4bb property, (ii) manufactured home parks assessed under clause (5), item (i), have the same classification rate as class 4b property, the market value of manufactured home parks assessed under clause (5), item (ii), have a classification rate of 0.75 percent if more than 50 percent of the lots in the park are occupied by shareholders in the cooperative corporation or association and a classification rate of one percent if 50 percent or less of the lots are so occupied, and class I manufactured home parks as defined in section 327C.015, subdivision 2, have a classification rate of 1.0 percent, (iii) commercial-use seasonal residential recreational property and marina recreational land as described in clause (11), has a classification rate of one percent for the first $500,000 of market value, and 1.25 percent for the remaining market value, (iv) the market value of property described in clause (4) has a classification rate of one percent, (v) the market value of property described in clauses (2), (6), and (10) has a classification rate of 1.25 percent, (vi) that portion of the market value of property in clause (9) qualifying for class 4c property has a classification rate of 1.25 percent, and (vii) property qualifying for classification under clause (3) that is owned or operated by a congressionally chartered veterans organization has a classification rate of one percent. The commissioner of veterans affairs must provide a list of congressionally chartered veterans organizations to the commissioner of revenue by June 30, 2017, and by January 1, 2018, and each year thereafter.\n(e) Class 4d property includes:\n(1) qualifying low-income rental housing certified to the assessor by the Housing Finance Agency under section 273.128, subdivision 3. If only a portion of the units in the building qualify as low-income rental housing units as certified under section 273.128, subdivision 3, only the proportion of qualifying units to the total number of units in the building qualify for class 4d(1). The remaining portion of the building shall be classified by the assessor based upon its use. Class 4d(1) also includes the same proportion of land as the qualifying low-income rental housing units are to the total units in the building. For all properties qualifying as class 4d(1), the market value determined by the assessor must be based on the normal approach to value using normal unrestricted rents; and\n(2) a unit that is owned by the occupant and used as a homestead by the occupant, and otherwise meets all the requirements for community land trust property under section 273.11, subdivision 12, provided that by December 31 of each assessment year, the community land trust certifies to the assessor that (i) the community land trust owns the real property on which the unit is located, and (ii) the unit owner is a member in good standing of the community land trust. For all units qualifying as class 4d(2), the market value determined by the assessor must be based on the normal approach to value without regard to any restrictions that apply because the unit is a community land trust property.\n(f) Class 4d(1) property has a classification rate of 0.25 percent. Class 4d(2) property has a classification rate of 0.75 percent.\n\"Elderly assisted living facility property\" means residential real estate containing more than one unit held for use by the tenants or lessees as a residence for periods of 30 days or more, along with community rooms, lounges, activity rooms, and related facilities, designed to meet the housing, health, and financial security needs of the elderly. The real estate may be owned by an individual, partnership, limited partnership, for-profit corporation or nonprofit corporation exempt from federal income taxation under United States Code, title 26, section 501(c)(3) or related sections.\nAn admission or initiation fee may be required of tenants. Monthly charges may include charges for the residential unit, meals, housekeeping, utilities, social programs, a health care alert system, or any combination of them. On-site health care may be provided by in-house staff or an outside health care provider.\nThe assessor shall classify elderly assisted living facility property, depending upon the property's ownership, occupancy, and use. The applicable classification rates shall apply based on its classification, if taxable.\nMS 1986 [Repealed, 1987 c 268 art 6 s 53]\nMS 1986 [Repealed, 1987 c 268 art 6 s 53]\nMS 1986 [Repealed, 1987 c 268 art 6 s 53]\nMS 1986 [Repealed, 1987 c 268 art 6 s 53]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nClass 5 property includes:\n(1) unmined iron ore and low-grade iron-bearing formations as defined in section 273.14; and\n(2) all other property not otherwise classified.\nClass 5 property has a classification rate of 2.0 percent of market value.\nMS 1997 Supp [Repealed, 1998 c 389 art 2 s 21]\n(a) All real property that is not improved with a structure must be classified according to its current use.\n(b) Except as provided in subdivision 23, paragraph (c) or (d), real property that is not improved with a structure and for which there is no identifiable current use must be classified according to its highest and best use permitted under the local zoning ordinance. If the ordinance permits more than one use, the land must be classified according to the highest and best use permitted under the ordinance. If no such ordinance exists, the assessor shall consider the most likely potential use of the unimproved land based upon the use made of surrounding land or land in proximity to the unimproved land.\n(a) All or a portion of the market value of property owned by a veteran and serving as the veteran's homestead under this section is excluded in determining the property's taxable market value if the veteran has a service-connected disability of 70 percent or more as certified by the United States Department of Veterans Affairs. To qualify for exclusion under this subdivision, the veteran must have been honorably discharged from the United States armed forces, as indicated by United States Government Form DD214 or other official military discharge papers.\n(b)(1) For a disability rating of 70 percent or more, $150,000 of market value is excluded, except as provided in clause (2); and\n(2) for a total (100 percent) and permanent disability, $300,000 of market value is excluded.\n(c) If a veteran with a disability qualifying for a valuation exclusion under paragraph (b), clause (2), predeceases the veteran's spouse, and if upon the death of the veteran the spouse holds the legal or beneficial title to the homestead and permanently resides there, the exclusion shall carry over to the benefit of the veteran's spouse until such time as the spouse remarries, or sells, transfers, or otherwise disposes of the property, except as otherwise provided in paragraph (n). Qualification under this paragraph requires an application under paragraph (h), and a spouse must notify the assessor if there is a change in the spouse's marital status, ownership of the property, or use of the property as a permanent residence.\n(d) If the spouse of a member of any branch or unit of the United States armed forces who dies due to a service-connected cause while serving honorably in active service, as indicated on United States Government Form DD1300 or DD2064, holds the legal or beneficial title to a homestead and permanently resides there, the spouse is entitled to the benefit described in paragraph (b), clause (2), until such time as the spouse remarries or sells, transfers, or otherwise disposes of the property, except as otherwise provided in paragraph (n).\n(e) If a veteran meets the disability criteria of paragraph (a) but does not own property classified as homestead in the state of Minnesota, then the homestead of the veteran's primary family caregiver, if any, is eligible for the exclusion that the veteran would otherwise qualify for under paragraph (b).\n(f) In the case of an agricultural homestead, only the portion of the property consisting of the house and garage and immediately surrounding one acre of land qualifies for the valuation exclusion under this subdivision.\n(g) A property qualifying for a valuation exclusion under this subdivision is not eligible for the market value exclusion under subdivision 35, or classification under subdivision 22, paragraph (b).\n(h) To qualify for a valuation exclusion under this subdivision a property owner must apply to the assessor by December 31 of the first assessment year for which the exclusion is sought. Except as provided in paragraph (c), the owner of a property that has been accepted for a valuation exclusion must notify the assessor if there is a change in ownership of the property or in the use of the property as a homestead.\n(i) A first-time application by a qualifying spouse for the market value exclusion under paragraph (d) must be made any time within two years of the death of the service member.\n(j) For purposes of this subdivision:\n(1) \"active service\" has the meaning given in section 190.05;\n(2) \"own\" means that the person's name is present as an owner on the property deed;\n(3) \"primary family caregiver\" means a person who is approved by the secretary of the United States Department of Veterans Affairs for assistance as the primary provider of personal care services for an eligible veteran under the Program of Comprehensive Assistance for Family Caregivers, codified as United States Code, title 38, section 1720G; and\n(4) \"veteran\" has the meaning given the term in section 197.447.\n(k) If a veteran did not apply for or receive the exclusion under paragraph (b), clause (2), before dying, or the exclusion under paragraph (b), clause (2), did not exist at the time of the veterans death, the veteran's spouse is entitled to the benefit under paragraph (b), clause (2), until the spouse remarries or sells, transfers, or otherwise disposes of the property, except as otherwise provided in paragraph (n), if:\n(1) the spouse files a first-time application;\n(2) upon the death of the veteran, the spouse holds the legal or beneficial title to the homestead and permanently resides there;\n(3) the veteran met the honorable discharge requirements of paragraph (a); and\n(4) the United States Department of Veterans Affairs certifies that:\n(i) the veteran met the total (100 percent) and permanent disability requirement under paragraph (b), clause (2); or\n(ii) the spouse has been awarded dependency and indemnity compensation.\n(l) The purpose of this provision of law providing a level of homestead property tax relief for veterans with a disability, their primary family caregivers, and their surviving spouses is to help ease the burdens of war for those among our state's citizens who bear those burdens most heavily.\n(m) By July 1, the county veterans service officer must certify the disability rating and permanent address of each veteran receiving the benefit under paragraph (b) to the assessor.\n(n) A spouse who received the benefit in paragraph (c), (d), or (k) but no longer holds the legal or beneficial title to the property may continue to receive the exclusion for a property other than the property for which the exclusion was initially granted until the spouse remarries or sells, transfers, or otherwise disposes of the property, provided that:\n(1) the spouse applies under paragraph (h) for the continuation of the exclusion allowed under this paragraph;\n(2) the spouse holds the legal or beneficial title to the property for which the continuation of the exclusion is sought under this paragraph, and permanently resides there;\n(3) the estimated market value of the property for which the exclusion is sought under this paragraph is less than or equal to the estimated market value of the property that first received the exclusion, based on the value of each property on the date of the sale of the property that first received the exclusion; and\n(4) the spouse has not previously received the benefit under this paragraph for a property other than the property for which the exclusion is sought.\n(o) If a spouse had previously received the exclusion under paragraph (c) or (d) and the exclusion expired prior to taxes payable in 2020, the spouse may reapply under this section for the exclusion under paragraph (c) or (d).\n(a) Prior to determining a property's net tax capacity under this section, property classified as 4d(2) under subdivision 25, paragraph (e), clause (2), class 1a, or 1b under subdivision 22, and the portion of property classified as class 2a under subdivision 23 consisting of the house, garage, and surrounding one acre of land, shall be eligible for a market value exclusion as determined under paragraph (b).\n(b) For a homestead valued at $95,000 or less, the exclusion is 40 percent of market value. For a homestead valued between $95,000 and $517,200, the exclusion is $38,000 minus nine percent of the valuation over $95,000. For a homestead valued at $517,200 or more, there is no valuation exclusion. The valuation exclusion shall be rounded to the nearest whole dollar, and may not be less than zero.\n(c) Any valuation exclusions or adjustments under section 273.11 shall be applied prior to determining the amount of the valuation exclusion under this subdivision.\n(d) In the case of a property that is classified as part homestead and part nonhomestead, (i) the exclusion shall apply only to the homestead portion of the property, but (ii) if a portion of a property is classified as nonhomestead solely because not all the owners occupy the property, not all the owners have qualifying relatives occupying the property, or solely because not all the spouses of owners occupy the property, the exclusion amount shall be initially computed as if that nonhomestead portion were also in the homestead class and then prorated to the owner-occupant's percentage of ownership. For the purpose of this section, when an owner-occupant's spouse does not occupy the property, the percentage of ownership for the owner-occupant spouse is one-half of the couple's ownership percentage.",
	"repealed": false
}