{
	"id": "473.711",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.711",
	"title": "473.711 FINANCING; BUDGET AND TAX LEVIES.",
	"text": "The method of providing funds for the commission shall be as set forth in this section.\nThe Metropolitan Mosquito Control Commission shall prepare an annual budget. The budget may provide for expenditures in an amount not exceeding the property tax levy limitation determined in this subdivision.\n(a) The commission may levy a tax on all taxable property in the district as defined in section 473.702 to provide funds for the purposes of sections 473.701 to 473.716. The tax shall not exceed the property tax levy limitation determined in this subdivision. A participating county may agree to levy an additional tax to be used by the commission for the purposes of sections 473.701 to 473.716 but the sum of the county's and commission's taxes may not exceed the county's proportionate share of the property tax levy limitation determined under this subdivision based on the ratio of its total net tax capacity to the total net tax capacity of the entire district as adjusted by section 270.12, subdivision 3. The auditor of each county in the district shall add the amount of the levy made by the district to other taxes of the county for collection by the county treasurer with other taxes. When collected, the county treasurer shall make settlement of the tax with the district in the same manner as other taxes are distributed to political subdivisions. No county shall levy any tax for mosquito, disease vectoring tick, and black gnat (Simuliidae) control except under this section. The levy shall be in addition to other taxes authorized by law.\n(b) The property tax levied by the Metropolitan Mosquito Control Commission shall not exceed the product of (i) the commission's property tax levy limitation for the previous year determined under this subdivision multiplied by (ii) an index for market valuation changes equal to the total estimated market value of all taxable property for the current tax payable year located within the district plus any area that has been added to the district since the previous year, divided by the total estimated market value of all taxable property located within the district for the previous taxes payable year.\nMS 2002 [Repealed, 2003 c 127 art 13 s 9]\nIf the commissioner of the department of health declares a health emergency due to a threatened or actual outbreak of disease caused by mosquitoes, disease vectoring ticks, or black gnats (Simuliidae), the commission may levy an additional tax not to exceed $500,000 on all taxable property in the district to pay for the required control measures.\nA participating county may levy a tax in an amount to be determined by the county board for mosquito, disease vectoring tick, and black gnat (Simuliidae) nuisance control. If the county levies the tax for nuisance control, it must contract with the commission to provide for nuisance control activities within the county. The levy for nuisance control shall be in addition to other levies authorized by law to the county.\nEach county in the district shall turn over to the commission all proceeds of such special tax and any subsequent special tax immediately after such proceeds are received, to be deposited in a bank or banks designated by the commission as its official depository, in an account to be known as the metropolitan mosquito control fund; and such funds may only be expended by the commission for the activities of the commission. Any bank or trust company so designated shall qualify as a depository by furnishing a corporate surety bond or collateral as required by section 118A.03, and shall thereafter, as long as money of the commission in excess of $10,000 is on deposit therein, maintain such bond or collateral in the amounts required by said section. However, no bond or collateral shall be required to secure any deposit, insofar as it is insured under federal law as provided in section 118A.03. Any county which issues certificates of indebtedness in anticipation of the collection and payment of such special tax shall deposit the funds procured thereby in the metropolitan mosquito control fund and said county shall redeem these certificates of indebtedness out of the special tax levy provided in this section. Any balance shall be deposited in the metropolitan mosquito control fund. All disbursements made pursuant to sections 473.702 to 473.716 shall be made from said fund upon order of the commission signed by the chair or vice-chair and by the business administrator, and each claim voucher shall be signed by the business administrator and shall specify the name of the payee, the amount to be disbursed, and the purpose of the disbursement.\nThe commission may issue certificates of indebtedness in anticipation of the collection and payment of a tax levied under this section in the same manner as a statutory city under section 412.261 and use their proceeds to accomplish its duties.\nThe commission must certify its property tax levy to the commissioner of revenue by August 1 of the levy year. The commissioner of revenue shall annually determine whether the property tax certified by the metropolitan mosquito control commission for levy following the adoption of its budget is within the levy limitation imposed by subdivision 2. The determination must be completed prior to September 10 of each year. If current information regarding market valuation in any county is not transmitted to the commissioner in a timely manner, the commissioner may estimate the current market valuation within that county for purposes of making the calculation.",
	"repealed": false
}