{
	"id": "144.496",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.496",
	"title": "144.496 MINNESOTA RADON AWARENESS ACT.",
	"text": "This section may be cited as the \"Minnesota Radon Awareness Act.\"\n(a) The following terms used in this section have the meanings given them.\n(b) \"Buyer\" means a person negotiating or offering to acquire for value, legal or equitable title, or the right to acquire legal or equitable title to residential real property.\n(c) \"Mitigation\" means measures designed to permanently reduce indoor radon concentrations.\n(d) \"Radon test\" means a measurement of indoor radon concentrations according to established industry standards for residential real property.\n(e) \"Residential real property\" means property occupied as, or intended to be occupied as, a single-family residence, including a unit in a common interest community as defined in section 515B.1-103, clause (10), regardless of whether the unit is in a common interest community not subject to chapter 515B.\n(f) \"Seller\" means a person who owns legal or equitable title to residential real property.\n(g) \"Elevated radon concentration\" means a radon concentration at or above the United States Environmental Protection Agency's radon action level.\n(a) Before signing an agreement to sell or transfer residential real property, the seller shall disclose in writing to the buyer any knowledge the seller has of radon concentrations in the dwelling. The disclosure shall include:\n(1) whether a radon test or tests have occurred on the real property;\n(2) the most current records and reports pertaining to radon concentrations within the dwelling;\n(3) a description of any radon concentrations, mitigation, or remediation;\n(4) information regarding the radon mitigation system, including system description and documentation, if such system has been installed in the dwelling; and\n(5) a radon warning statement meeting the requirements of subdivision 4.\n(b) The seller shall provide the buyer with a copy of the Minnesota Department of Health publication entitled \"Radon in Real Estate Transactions.\"\n(c) The seller's radon disclosure requirements in this section apply to the transfer of any interest in residential real estate, whether by sale, exchange, deed, contract for deed, lease with an option to purchase, or any other option.\n(d) The seller's radon disclosure requirements in this section do not apply to any of the following:\n(1) real property that is not residential real property;\n(2) a gratuitous transfer;\n(3) a transfer made pursuant to a court order;\n(4) a transfer to a government or governmental agency;\n(5) a transfer by foreclosure or deed in lieu of foreclosure;\n(6) a transfer to heirs or devisees of a decedent;\n(7) a transfer from a cotenant to one or more other cotenants;\n(8) a transfer made to a spouse, parent, grandparent, child, or grandchild of the seller;\n(9) a transfer between spouses resulting from a decree of marriage dissolution or from a property settlement agreement incidental to that decree;\n(10) an option to purchase a unit in a common interest community, until exercised;\n(11) a transfer to a person who controls or is controlled by the grantor as those terms are defined with respect to a declarant under section 515B.1-103, clause (2);\n(12) a transfer to a tenant who is in possession of the residential real property; or\n(13) a transfer of special declarant rights under section 515B.3-104.\n(e) A seller may provide the written disclosure required under this section to a real estate licensee representing or assisting a prospective buyer. The written disclosure provided to the real estate licensee representing or assisting a prospective buyer is considered to have been provided to the prospective buyer. If the written disclosure is provided to the real estate licensee representing or assisting the prospective buyer, the real estate licensee must provide a copy to the prospective buyer.\nThe radon warning statement must include the following language:\n\"Radon Warning Statement\nThe Minnesota Department of Health strongly recommends that ALL home buyers have an indoor radon test performed prior to purchase or taking occupancy, and recommends having the radon levels mitigated if elevated radon concentrations are found. Elevated radon concentrations can easily be reduced by a qualified, certified, or licensed, if applicable, radon mitigator.\nEvery buyer of any interest in residential real property is notified that the property may present exposure to dangerous levels of indoor radon gas that may place the occupants at risk of developing radon-induced lung cancer. Radon, a Class A human carcinogen, is the leading cause of lung cancer in nonsmokers and the second leading cause overall. The seller of any interest in residential real property is required to provide the buyer with any information on radon test results of the dwelling.\"\n(a) A seller who fails to make a radon disclosure as required by this section, and is aware of material facts pertaining to radon concentrations in the dwelling, is liable to the buyer.\n(b) A buyer who is injured by a violation of this section may bring a civil action and recover damages and receive other equitable relief as determined by the court. An action under this subdivision must be commenced within two years after the date on which the buyer closed the purchase or transfer of the real property.\n(c) This section does not invalidate a transfer solely because of the failure of any person to comply with a provision of this section. This section does not prevent a court from ordering a rescission of the transfer.\nThis section is effective January 1, 2014, and applies to agreements to sell or transfer residential real property executed on or after that date.",
	"repealed": false
}