{
	"id": "216B.2425",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2425",
	"title": "216B.2425 STATE TRANSMISSION AND DISTRIBUTION PLAN.",
	"text": "The commission shall maintain a list of certified high-voltage transmission line and grid enhancing technology projects.\n[See Note.]\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Capacity\" means the maximum amount of electricity that can flow through a transmission line while observing industry safety standards.\n(c) \"Congestion\" means a condition in which a lack of transmission line capacity prevents the delivery of the lowest-cost electricity dispatched to meet load at a specific location.\n(d) \"Dynamic line rating\" means hardware or software used to calculate the thermal limit of existing transmission lines at a specific point in time by incorporating information on real-time and forecasted weather conditions.\n(e) \"Grid enhancing technology\" means hardware or software that reduces congestion or enhances the flexibility of the transmission system by increasing the capacity of a high-voltage transmission line or rerouting electricity from overloaded to uncongested lines, while maintaining industry safety standards. Grid enhancing technologies include but are not limited to dynamic line rating, advanced power flow controllers, and topology optimization.\n(f) \"Power flow controller\" means hardware and software used to reroute electricity from overloaded transmission lines to underutilized transmission lines.\n(g) \"Thermal limit\" means the temperature a transmission line reaches when heat from the electric current flow within the transmission line causes excessive sagging of the transmission line.\n(h) \"Topology optimization\" means a software technology that uses mathematical models to identify reconfigurations in the transmission grid in order to reroute electricity from overloaded transmission lines to underutilized transmission lines.\n(i) \"Transmission line\" has the meaning given to \"high-voltage transmission line\" in section 216I.02, subdivision 8.\n(j) \"Transmission system\" means a network of high-voltage transmission lines owned or operated by an entity subject to this section that transports electricity to Minnesota customers.\n(a) By November 1 of each odd-numbered year, a transmission projects report must be submitted to the commission by each utility, organization, or company that:\n(1) is a public utility, a municipal utility, a cooperative electric association, the generation and transmission organization that serves each utility or association, or a transmission company; and\n(2) owns or operates electric transmission lines in Minnesota, except a company or organization that owns a transmission line that serves a single customer or interconnects a single generating facility.\n(b) The report may be submitted jointly or individually to the commission.\n(c) The report must:\n(1) list specific present and reasonably foreseeable future inadequacies in the transmission system in Minnesota;\n(2) identify alternative means of addressing each inadequacy listed, including grid enhancing technologies such as dynamic line rating, power flow controllers, topology optimization, and other hardware or software that reduce congestion or enhance the flexibility of the transmission system;\n(3) identify general economic, environmental, and social issues associated with each alternative; and\n(4) provide a summary of public input related to the list of inadequacies and the role of local government officials and other interested persons in assisting to develop the list and analyze alternatives.\n(d) To meet the requirements of this subdivision, reporting parties may rely on available information and analysis developed by a regional transmission organization or any subgroup of a regional transmission organization and may develop and include additional information as necessary.\n(e) In addition to providing the information required under this subdivision, a utility operating under a multiyear rate plan approved by the commission under section 216B.16, subdivision 19, shall identify in its report investments that it considers necessary to modernize the transmission and distribution system by enhancing reliability, improving security against cyber and physical threats, and by increasing energy conservation opportunities by facilitating communication between the utility and its customers through the use of two-way meters, control technologies, energy storage and microgrids, technologies to enable demand response, and other innovative technologies.\n(a) By June 1 of each even-numbered year, the commission shall adopt a state transmission project list and shall certify, certify as modified, or deny certification of the transmission and distribution projects proposed under subdivision 2. Except as provided in paragraph (b), the commission may only certify a project that is a high-voltage transmission line as defined in section 216B.2421, subdivision 2, that the commission finds is:\n(1) necessary to maintain or enhance the reliability of electric service to Minnesota consumers;\n(2) needed, applying the criteria in section 216B.243, subdivision 3; and\n(3) in the public interest, taking into account electric energy system needs and economic, environmental, and social interests affected by the project.\n(b) The commission may certify a project proposed under subdivision 2, paragraph (e), only if the commission finds the proposed project is in the public interest.\nCertification of a project as a priority electric transmission project satisfies section 216B.243. A certified project on which construction has not begun more than six years after being placed on the list, must be reapproved by the commission.\nThe Department of Commerce shall create, maintain, and update annually an inventory of transmission lines in the state.\nThis section does not apply to any transmission line proposal that has been approved by, or was pending before, a local unit of government, the Environmental Quality Board, or the Public Utilities Commission on August 1, 2001.\n(a) Each entity subject to this section shall determine necessary transmission upgrades to support development of renewable energy resources required to meet objectives under section 216B.1691 and shall include those upgrades in its report under subdivision 2.\n(b) MS 2008 [Expired]\nEach entity subject to this section that is operating under a multiyear rate plan approved under section 216B.16, subdivision 19, shall conduct a distribution study to identify interconnection points on its distribution system for small-scale distributed generation resources and shall identify necessary distribution upgrades to support the continued development of distributed generation resources, and shall include the study in its report required under subdivision 2.\nThe public utility that owns a nuclear generating plant must include the following information in the public utility's annual integrated distribution plan filed with the commission, beginning with the plan due November 1, 2023:\n(1) a forecast of distribution system upgrades necessary to accommodate the interconnection of distributed generation resulting from the utility's compliance with sections 216B.1641 and 216B.1691, subdivision 2h, and other customer-sited projects, including energy storage systems;\n(2) an evaluation of measures that can reduce the need for or cost of distribution system upgrades to enable the interconnection of distributed generation resources, including but not limited to the employment of smart inverters, grid management tools, distributed energy resources management tools, and energy export tariffs; and\n(3) a discussion of alternative methods to allocate costs of distribution system upgrades among distributed generation owners or developers and ratepayers.",
	"repealed": false
}