{
	"id": "114E.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/114E.45",
	"title": "114E.45 AMENDMENT OR TERMINATION BY CONSENT.",
	"text": "(a) An environmental covenant may be amended or terminated by consent only if the amendment or termination is signed by:\n(1) the environmental agency;\n(2) the current owner of the fee simple title to the real property subject to the covenant;\n(3) every other original signatory to the covenant, or their successor or assign, unless:\n(i) the person waived the right to consent to termination or modification in the environmental covenant or another signed and acknowledged record that is recorded;\n(ii) the person fails to object to the amendment or termination within 60 days after a notice requesting the person's consent to amendment or termination was mailed by certified mail, return receipt requested, to the person's last known address, as obtained from the United States Postal Service; or\n(iii) a court finds that the person no longer exists or cannot be located or identified with the exercise of reasonable diligence; and\n(4) each holder, except as otherwise provided in paragraph (d).\nAny person may establish that the notice described in clause (3), item (ii), was properly mailed by recording an affidavit to that effect from a person having knowledge of the facts, and a certified copy of the recorded affidavit shall be prima facie evidence of the facts stated therein.\n(b) If an interest in real property is subject to an environmental covenant, the interest is not affected by an amendment of the covenant unless the current owner of the interest consents to the amendment or has waived in the environmental covenant or other signed record the right to consent to amendments.\n(c) Except for an assignment undertaken pursuant to a governmental reorganization, or as otherwise provided in the environmental covenant, assignment of an environmental covenant to a new holder is an amendment.\n(d) Except as otherwise provided in paragraph (c) or in an environmental covenant:\n(1) a holder may not assign its interest without consent of the other parties specified in paragraph (a);\n(2) a holder may be removed and replaced by agreement of the other parties specified in paragraph (a); and\n(3) a court of competent jurisdiction may fill a vacancy in the position of holder.",
	"repealed": false
}