{
	"id": "517.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/517.08",
	"title": "517.08 APPLICATION FOR LICENSE.",
	"text": "[Renumbered subds 1a and 1b]\nApplication for a civil marriage license shall be made by both of the parties upon a form provided for the purpose and shall contain the following information:\n(1) the full names of the parties and the sex of each party;\n(2) their post office addresses and county and state of residence;\n(3) their full ages;\n(4) if either party has previously been married, the party's married name, and the date, place and court in which the civil marriage was dissolved or annulled or the date and place of death of the former spouse;\n(5) whether the parties are related to each other, and, if so, their relationship;\n(6) the address of the parties after the civil marriage is entered into to which the local registrar shall send a certified copy of the civil marriage certificate;\n(7) the full names the parties will have after the civil marriage is entered into and the parties' Social Security numbers. The Social Security numbers must be collected for the application but must not appear on the civil marriage license. If a party listed on a civil marriage application does not have a Social Security number, the party must certify on the application, or a supplement to the application, that the party does not have a Social Security number;\n(8) if one party to the civil marriage license has a felony conviction under Minnesota law or the law of another state or federal jurisdiction, the party may not change the party's name through the marriage application process and must follow the process in section 259.13 to change the party's name; and\n(9) notice that a party who has a felony conviction under Minnesota law or the law of another state or federal jurisdiction may not use a different name after a civil marriage except as authorized by section 259.13, and that doing so is a gross misdemeanor.\n(a) The local registrar shall examine upon oath the parties applying for a license relative to the legality of the contemplated civil marriage. Both parties must present proof of age to the local registrar. If one party is unable to appear in person, the party appearing may complete the absent applicant's information. The local registrar shall provide a copy of the civil marriage application to the party who is unable to appear, who must verify the accuracy of the appearing party's information in a notarized statement. The verification statement must be accompanied by a copy of proof of age of the party. The civil marriage license must not be released until the verification statement and proof of age has been received by the local registrar. If the local registrar is satisfied that there is no legal impediment to it, including the restriction contained in section 259.13, the local registrar shall issue the license, containing the full names of the parties before and after the civil marriage, and county and state of residence, with the county seal attached, and make a record of the date of issuance. The license shall be valid for a period of six months. Except as provided in paragraph (b), the local registrar shall collect from the applicant a fee of $115 for administering the oath, issuing, recording, and filing all papers required, and preparing and transmitting to the state registrar of vital records the reports of civil marriage required by this section. If the license should not be used within the period of six months due to illness or other extenuating circumstances, it may be surrendered to the local registrar for cancellation, and in that case a new license shall issue upon request of the parties of the original license without fee. A local registrar who knowingly issues or signs a civil marriage license in any manner other than as provided in this section shall pay to the parties aggrieved an amount not to exceed $1,000.\n(b) The civil marriage license fee for parties who have completed at least 12 hours of premarital education is $40. In order to qualify for the reduced license fee, the parties must submit at the time of applying for the civil marriage license a statement that is signed, dated, and notarized or marked with a church seal from the person who provided the premarital education on their letterhead confirming that it was received. The premarital education must be provided by a licensed or ordained minister or the minister's designee, a person authorized to solemnize civil marriages under section 517.18, or a person authorized to practice marriage and family therapy under section 148B.33. The education must include the use of a premarital inventory and the teaching of communication and conflict management skills.\n(c) The statement from the person who provided the premarital education under paragraph (b) must be in the following form:\n\"I, .......................... (name of educator), confirm that .......................... (names of both parties) received at least 12 hours of premarital education that included the use of a premarital inventory and the teaching of communication and conflict management skills. I am a licensed or ordained minister, a person authorized to solemnize civil marriages under Minnesota Statutes, section 517.18, or a person licensed to practice marriage and family therapy under Minnesota Statutes, section 148B.33.\"\nThe names of the parties in the educator's statement must be identical to the legal names of the parties as they appear in the civil marriage license application. Notwithstanding section 138.17, the educator's statement must be retained for seven years, after which time it may be destroyed.\n(a) Of the civil marriage license fee collected pursuant to subdivision 1b, paragraph (a), $25 must be retained by the county. The local registrar must pay $90 to the commissioner of management and budget to be deposited as follows:\n(1) $55 in the general fund;\n(2) $3 in the state government special revenue fund to be appropriated to the commissioner of public safety for parenting time centers under section 119A.37;\n(3) $2 in the special revenue fund to be appropriated to the commissioner of health for developing and implementing the MN ENABL program under section 145.9255;\n(4) $25 in the special revenue fund is appropriated to the commissioner of employment and economic development for the Minnesota Family Resiliency Partnership under section 116L.96; and\n(5) $5 in the special revenue fund, which is appropriated to the Board of Regents of the University of Minnesota for the Minnesota couples on the brink project under section 137.32.\n(b) Of the $40 fee under subdivision 1b, paragraph (b), $25 must be retained by the county. The local registrar must pay $15 to the commissioner of management and budget to be deposited as follows:\n(1) $5 as provided in paragraph (a), clauses (2) and (3); and\n(2) $10 in the special revenue fund is appropriated to the commissioner of employment and economic development for the Minnesota Family Resiliency Partnership under section 116L.96.\nFor purposes of this section, proof of the age of a party may be established in the form of:\n(1) an original or certified copy of a birth certificate or birth record;\n(2) a driver's license or other identification card issued by a government entity or school; or\n(3) a school record, immigration record, naturalization record, court record, or other document or record issued by a government entity that contains the date of birth of a party.\n[Repealed, 1978 c 699 s 17]\n[Repealed, 1978 c 699 s 17]\nThe local registrar of each county shall annually report to the Department of Health the number of civil marriage licenses issued in the county for which the fee in subdivision 1b, paragraph (a), was paid and the number for which the fee in subdivision 1b, paragraph (c), was paid.",
	"repealed": false
}