{
	"id": "52.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.10",
	"title": "52.10 CREDIT COMMITTEE; CREDIT MANAGER; POWERS.",
	"text": "The credit committee shall have the general supervision of all loans to members as provided herein. Applications for loans shall be on a form prepared by the credit committee, shall set forth the purpose for which the loan is desired, the security, if any, offered and such other data as may be required. Within the meaning of this section, an assignment of shares or deposits or the endorsement of a note may be deemed security. Except where the credit committee approves the extension of a self-replenishing line of credit pursuant to section 52.16, subdivision 2, at least a majority of the members of the credit committee shall pass on all loans and approval must be in writing and by unanimous vote of the members present. The credit committee shall meet as often as may be necessary after due notice to each member of the committee. In the case of any credit union having total assets in excess of $10,000, the board of directors may authorize the credit committee to appoint one or more loan officers. Loan officers, subject to the supervision of the committee, may be delegated authority by the credit committee to act on all or some applications for loans and to approve them, reporting thereon to the credit committee at their next meeting or within 15 days. The credit committee and the board of directors, meeting jointly and acting collectively as a whole, shall have the general supervision of all loans to a member who is a director, officer, or a member of the credit or supervisory committee whenever the application exceeds the amount of the member's holdings in shares and deposits. Application for these loans shall be in similar form as may be required to be furnished to the credit committee for a loan in the case of any other member. At least a majority of the members of the credit committee and of the board of directors at a joint meeting and acting collectively as a whole, shall pass on all such loans in the absence of the applicant, and the approval of the loan must be in writing and by unanimous vote of all members present. The credit committee and the board of directors shall meet for this purpose as often as may be necessary after due notice to each member of the board and credit committee.\nIf a credit manager is appointed, the board shall have the powers and responsibilities described in subdivision 1 for a credit committee. The board may delegate in writing any or all of these powers and responsibilities to a credit manager.",
	"repealed": false
}