{
	"id": "326B.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.33",
	"title": "326B.33 LICENSES.",
	"text": "Except as otherwise provided by law, no individual shall perform or supervise electrical work unless the individual is: (a) licensed by the commissioner as a master electrician; and (b)(i) the electrical work is for a licensed contractor and the individual is an employee, partner, or officer of, or is the licensed contractor, or (ii) the electrical work is performed for the individual's employer on electrical wiring, apparatus, equipment, or facilities that are owned or leased by the employer and that are located within the limits of property operated, maintained, and either owned or leased by the employer.\n(1) An applicant for a Class A master electrician license shall (a) be a graduate of a four-year electrical course offered by an accredited college or university; or (b) shall have had at least one year of experience, acceptable to the commissioner, as a licensed journeyworker; or (c) shall have had at least five years' experience, acceptable to the commissioner, in planning for, laying out, supervising and installing wiring, apparatus, or equipment for electrical light, heat and power.\n(2) As of August 1, 1985, no new Class B master electrician licenses shall be issued. An individual who has a Class B master electrician license as of August 1, 1985, may retain and renew the license and exercise the privileges it grants, which include electrical work limited to single phase systems, not over 200 amperes in capacity, on farmsteads or single-family dwellings located in towns or municipalities with fewer than 2,500 inhabitants.\n(a) Except as otherwise provided by law, no individual shall perform and supervise any electrical work except for planning or laying out of electrical work unless:\n(1) the individual is licensed by the commissioner as a journeyworker electrician; and\n(2) the electrical work is:\n(i) for a contractor and the individual is an employee, partner, or officer of the licensed contractor; or\n(ii) performed under the supervision of a master electrician also employed by the individual's employer on electrical wiring, apparatus, equipment, or facilities that are owned or leased by the employer and that are located within the limits of property operated, maintained, and either owned or leased by the employer.\n(b) An applicant for a Class A journeyworker electrician license shall have had at least four years of experience, acceptable to the commissioner, in wiring for, installing, and repairing electrical wiring, apparatus, or equipment, provided however, that one year of experience credit for the successful completion of a two-year post high school electrical course approved by the commissioner may be allowed.\n(c) As of August 1, 1985, no new Class B journeyworker electrician licenses shall be issued. An individual who holds a Class B journeyworker electrician license as of August 1, 1985, may retain and renew the license and exercise the privileges it grants, which include electrical work limited to single phase systems, not over 200 amperes in capacity, on farmsteads or on single-family dwellings located in towns or municipalities with fewer than 2,500 inhabitants.\nNotwithstanding the provisions of subdivisions 1, 2, and 14, any individual holding a Class A installer license may lay out and install and supervise the laying out and installing of electrical wiring, apparatus, or equipment for major electrical home appliances on the load side of the main service on farmsteads and in any town or municipality with fewer than 1,500 inhabitants, which is not contiguous to a city of the first class and does not contain an established business of a contractor. As of December 1, 2007, no new Class A installer licenses shall be issued. An individual who holds a Class A installer license as of December 1, 2007, may retain and renew the license and exercise the privileges it grants.\nNotwithstanding the provisions of subdivisions 1, 2, and 14, any individual holding a Class B installer license may lay out and install electrical wiring, apparatus and equipment on center pivot irrigation booms on the load side of the main service on farmsteads, and install such other electrical equipment as is approved by the commissioner.\nAn applicant for a Class A or B installer license shall have completed a post high school course in electricity approved by the commissioner or shall have had at least one year of experience, approved by the commissioner, in electrical wiring.\nEvery Class A and Class B installer, as a condition of licensure, shall give bond to the state in the penal sum of $1,000. The bond must comply with section 326B.0921.\n(a) Except as otherwise provided by law, no individual shall install, alter, repair, plan, lay out, or supervise the installing, altering, repairing, planning, or laying out of electrical wiring, apparatus, or equipment for technology circuits or systems unless:\n(1) the individual is licensed by the commissioner as a power limited technician; and\n(2) the electrical work is:\n(i) for a licensed contractor and the individual is an employee, partner, or officer of, or is the licensed contractor; or\n(ii) performed under the direct supervision of a master electrician or power limited technician also employed by the individual's employer on technology circuits, systems, apparatus, equipment, or facilities that are owned or leased by the employer and that are located within the limits of property operated, maintained, and either owned or leased by the employer.\n(b) An applicant for a power limited technician's license shall (1) be a graduate of a four-year electrical course offered by an accredited college or university; or (2) have had at least 36 months' experience, acceptable to the commissioner, in planning for, laying out, supervising, installing, altering, and repairing wiring, apparatus, or equipment for power limited systems, provided however, that up to 12 months (2,000 hours) of experience credit for successful completion of a two-year post high school electrical course or other technical training approved by the commissioner may be allowed.\n(c) Licensees must attain 16 hours of continuing education acceptable to the board every renewal period.\n(a) Except as otherwise provided by law, no individual shall install, alter, repair, plan, lay out, or supervise the installing, altering, repairing, planning, or laying out of electrical wiring, apparatus, or equipment for satellite broadcast communication systems unless:\n(1) the electrical work is for a licensed contractor and the individual is an employee, partner, or officer of, or is the licensed contractor; and\n(2) the individual (i) provides certification to the department demonstrating successful completion of the National Standards and Testing Program for satellite system installers sponsored by the Satellite Broadcasting and Communications Association of America, Inc. or other program approved by the board and (ii) has passed an examination administered by the commissioner.\n(b) Individuals who fulfill the requirements of this subdivision under paragraph (a), clause (2), are prohibited from performing any other function allowed under the power limited technician license.\n(c) Satellite system installers shall be subject to the fees provided for under section 326B.33, subdivision 19, paragraph (b), clause (2).\n(d) Satellite system installers must attain four hours of continuing education under rules adopted by the Board of Electricity.\n(a) An individual licensed as an elevator constructor may install, maintain, and repair electrical wiring, apparatus, and equipment for elevators and escalators while in the employ of an elevator contractor or Class A electrical contractor.\n(b) An applicant for an elevator constructor's license shall have at least 36 months' experience, acceptable to the commissioner, in wiring for, installing, and repairing electrical wiring, apparatus, or equipment for elevators and escalators, provided, however, that one year of experience credit for the completion of a two-year post-high school electrical course approved by the commissioner may be allowed.\n(a) An individual licensed as a lineman may install, maintain, and repair transmission and distribution systems that are or will be owned or leased by an electric utility.\n(b) An applicant for a lineman's license shall have at least 48 months' experience, acceptable to the commissioner, in wiring for, installing, and repairing electrical wiring, apparatus, or equipment for an electrical utility.\n(a) An individual licensed as a maintenance electrician may maintain and repair electrical wiring, apparatus, and equipment while in the employ of a contractor, or as a full-time employee of a single employer while engaged in the maintenance and repair of electrical wiring, apparatus, and equipment owned or leased by the employer and located within the limits of property owned or leased by the employer.\n(b) An applicant for a maintenance electrician's license shall have at least 48 months' experience, acceptable to the commissioner, in wiring for, installing, and repairing electrical wiring, apparatus, or equipment, provided, however, that one year of experience credit for the completion of a two-year post-high school electrical course approved by the commissioner may be allowed.\n(a) An individual licensed as a master elevator constructor may, while licensed as an elevator electrical contractor or while in the employ of an elevator contractor or Class A electrical contractor, plan, lay out, supervise and install, maintain, and repair wiring, apparatus, and equipment for elevators and escalators.\n(b) An applicant for a master elevator constructor's license shall have at least 60 months' experience, acceptable to the commissioner, in wiring for, installing, and repairing electrical wiring, apparatus, or equipment for elevators and escalators, provided, however, that one year of experience credit for the completion of a two-year post-high school electrical course approved by the commissioner may be allowed.\n(a) An unlicensed individual means an individual who has not been licensed by the department to perform specific electrical work. An unlicensed individual shall not perform electrical work required to be performed by a licensed individual unless the individual has first registered with the department as an unlicensed individual. Thereafter, an unlicensed individual shall not perform electrical work required to be performed by a licensed individual unless the work is performed under the direct supervision of an individual actually licensed to perform such work. The licensed individual and unlicensed individual must be employed by the same employer. Licensed individuals shall not permit unlicensed individuals to perform electrical work except under the direct supervision of an individual actually licensed to perform such work. Unlicensed individuals shall not supervise the performance of electrical work or make assignments of electrical work to unlicensed individuals. Except for technology circuits or systems work, licensed individuals shall supervise no more than two unlicensed individuals. For technology circuits or systems work, licensed individuals shall supervise no more than three unlicensed individuals.\n(b) Notwithstanding any other provision of this section, no individual other than a master electrician or power limited technician shall plan or lay out electrical wiring, apparatus, or equipment for light, heat, power, or other purposes, except circuits or systems exempted from personal licensing by subdivision 21, paragraph (b).\n(c) Contractors employing unlicensed individuals to perform electrical work shall maintain records establishing compliance with this subdivision that shall identify all unlicensed individuals performing electrical work, except for individuals working on circuits or systems exempted from personal licensing by subdivision 21, paragraph (b), and shall permit the department to examine and copy all such records.\n(d) When a licensed individual supervises the electrical work of an unlicensed individual, the licensed individual is responsible for ensuring that the electrical work complies with the Minnesota Electrical Act and all rules adopted under the act.\nUnlicensed individuals performing electrical work for a contractor or employer shall register with the department in the manner prescribed by the commissioner. Experience credit for electrical work performed in Minnesota after January 1, 2009, by an applicant for a license identified in this section shall not be granted where the applicant has not registered with or is not licensed by the department.\nExcept as otherwise provided by law, no individual other than an employee, partner, or officer of a licensed contractor, as defined by section 326B.31, subdivision 14, shall perform or offer to perform electrical work with or without compensation unless the individual obtains a contractor's license. A contractor's license does not of itself qualify its holder to perform or supervise the electrical work authorized by holding any class of personal license.\nAs a condition of licensing, each contractor shall give and maintain bond to the state in the penal sum of $25,000. The bond must comply with section 326B.0921.\nEach contractor shall have and maintain in effect general liability insurance, which includes premises and operations insurance and products and completed operations insurance, with limits of at least $100,000 per occurrence, $300,000 aggregate limit for bodily injury, and property damage insurance with limits of at least $50,000 or a policy with a single limit for bodily injury and property damage of $300,000 per occurrence and $300,000 aggregate limits. Such insurance shall be written by an insurer licensed to do business in the state of Minnesota and each contractor shall maintain on file with the commissioner a certificate evidencing such insurance. In the event of a policy cancellation, the insurer shall send written notice to the commissioner at the same time that a cancellation request is received from or a notice is sent to the insured.\n(a) Each contractor must designate a responsible master electrician, satellite system installer, or power limited technician, who shall be responsible for the performance of all electrical work in accordance with the requirements of sections 326B.31 to 326B.399, all rules adopted under these sections, and all orders issued under section 326B.082. The classes of work that a licensed contractor is authorized to perform shall be limited to the classes of work that the responsible master electrician, satellite system installer, or power limited electrician is licensed to perform.\n(b) When a contractor's license is held by an individual, sole proprietorship, partnership, limited liability company, or corporation and the individual, proprietor, one of the partners, one of the members, or an officer of the corporation, respectively, is not the responsible master electrician or power limited technician, all requests for inspection shall be signed by the responsible master electrician, satellite system installer, or power limited technician. If the contractor is an individual or a sole proprietorship, the responsible licensed individual must be the individual, proprietor, or managing employee. If the contractor is a partnership, the responsible licensed individual must be a general partner or managing employee. If the licensed contractor is a limited liability company, the responsible licensed individual must be a chief manager or managing employee. If the contractor is a corporation, the responsible licensed individual must be an officer or managing employee. If the responsible licensed individual is a managing employee, the responsible licensed individual must be actively engaged in performing electrical work on behalf of the contractor, and cannot be employed in any capacity as an electrician, installer, or technician by any other contractor or employer designated in subdivision 21. An individual may be the responsible licensed individual for only one contractor or employer.\n(c) All applications and renewals for contractor licenses shall include a verified statement that the applicant or licensee has complied with this subdivision.\nIn addition to the other requirements described in this section and sections 326B.091 to 326B.098, and except as provided in subdivision 20, as a precondition to issuance of a personal license, each applicant must pass a written or oral examination developed and administered by the commissioner to ensure the competence of each applicant for license. An oral examination shall be administered only to an applicant who furnishes a written statement from a certified teacher or other professional, trained in the area of reading disabilities stating that the applicant has a specific reading disability which would prevent the applicant from performing satisfactorily on a written test. The oral examination shall be structured so that an applicant who passes the examination will not impair the applicant's own safety or that of others while acting as a licensed individual.\n(a) Unless revoked or suspended under this chapter, all licenses issued or renewed under this section expire on the date specified in this subdivision. Master licenses expire March 1 of each odd-numbered year after issuance or renewal. Electrical contractor licenses expire March 1 of each even-numbered year after issuance or renewal. Technology system contractor and satellite system contractor licenses expire August 1 of each even-numbered year after issuance or renewal. All other personal licenses expire two years from the date of original issuance and every two years thereafter. Registrations of unlicensed individuals expire one year from the date of original issuance and every year thereafter.\n(b) For purposes of calculating license fees and renewal license fees required under section 326B.092:\n(1) the registration of an unlicensed individual under subdivision 12 shall be considered an entry level license;\n(2) the following licenses shall be considered journeyworker licenses: Class A journeyworker electrician, Class B journeyworker electrician, Class A installer, Class B installer, lineman, maintenance electrician, satellite system installer, and power limited technician;\n(3) the following licenses shall be considered master licenses: Class A master electrician and Class B master electrician; and\n(4) the following licenses shall be considered business licenses: Class A electrical contractor, Class B electrical contractor, satellite system contractor, and technology systems contractor.\n(c) For each filing of a certificate of responsible person by an employer, the fee is $100.\nThe commissioner may enter into reciprocity agreements for personal licenses with another state if approved by the board. Once approved by the board, the commissioner may issue a personal license without requiring the applicant to pass an examination provided the applicant:\n(a) submits an application under this section;\n(b) pays the application and examination fee and license fee required under section 326B.092; and\n(c) holds a valid comparable license in the state participating in the agreement.\nAgreements are subject to the following:\n(1) The parties to the agreement must administer a statewide licensing program that includes examination and qualifying experience or training comparable to Minnesota's.\n(2) The experience and training requirements under which an individual applicant qualified for examination in the qualifying state must be deemed equal to or greater than required for an applicant making application in Minnesota at the time the applicant acquired the license in the qualifying state.\n(3) The applicant must have acquired the license in the qualifying state through an examination deemed equivalent to the same class of license examination in Minnesota. A lesser class of license may be granted where the applicant has acquired a greater class of license in the qualifying state and the applicant otherwise meets the conditions of this subdivision.\n(4) At the time of application, the applicant must hold a valid license in the qualifying state and have held the license continuously for at least one year before making application in Minnesota.\n(5) An applicant is not eligible for a license under this subdivision if the applicant has failed the same or greater class of license examination in Minnesota, or if the applicant's license of the same or greater class has been revoked or suspended.\n(6) An applicant who has failed to renew a personal license for two years or more after its expiration is not eligible for a license under this subdivision.\n(a) An individual who is a maintenance electrician is not required to hold or obtain a license under sections 326B.31 to 326B.399 if:\n(1) the individual is engaged in the maintenance and repair of electrical equipment, apparatus, and facilities that are owned or leased by the individual's employer and that are located within the limits of property operated, maintained, and either owned or leased by the individual's employer;\n(2) the individual is supervised by:\n(i) the responsible master electrician for a contractor who has contracted with the individual's employer to provide services for which a contractor's license is required; or\n(ii) a licensed master electrician, a licensed maintenance electrician, an electrical engineer, or, if the maintenance and repair work is limited to technology circuits or systems work, a licensed power limited technician; and\n(3) the individual's employer has on file with the commissioner a current certificate of responsible person, signed by the responsible master electrician of the contractor, the licensed master electrician, the licensed maintenance electrician, the electrical engineer, or the licensed power limited technician, and stating that the person signing the certificate is responsible for ensuring that the maintenance and repair work performed by the employer's employees complies with the Minnesota Electrical Act and the rules adopted under that act. The employer must pay a filing fee to file a certificate of responsible person with the commissioner. The certificate shall expire two years from the date of filing. In order to maintain a current certificate of responsible person, the employer must resubmit a certificate of responsible person, with a filing fee, no later than two years from the date of the previous submittal.\n(b) Employees of a licensed electrical or technology systems contractor or other employer where provided with supervision by a master electrician in accordance with subdivision 1, or power limited technician in accordance with subdivision 7, paragraph (a), clause (1), are not required to hold a license under sections 326B.31 to 326B.399 for the planning, laying out, installing, altering, and repairing of technology circuits or systems except planning, laying out, or installing:\n(1) in other than residential dwellings, class 2 or class 3 remote control circuits that control circuits or systems other than class 2 or class 3, except circuits that interconnect these systems through communication, alarm, and security systems are exempted from this paragraph;\n(2) class 2 or class 3 circuits in electrical cabinets, enclosures, or devices containing physically unprotected circuits other than class 2 or class 3; or\n(3) technology circuits or systems in hazardous classified locations as covered by the National Electrical Code.\n(c) Companies and their employees that plan, lay out, install, alter, or repair class 2 and class 3 remote control wiring associated with plug or cord and plug connected appliances other than security or fire alarm systems installed in a residential dwelling are not required to hold a license under sections 326B.31 to 326B.399.\n(d) Heating, ventilating, air conditioning, and refrigeration contractors and their employees are not required to hold or obtain a license under sections 326B.31 to 326B.399 when performing heating, ventilating, air conditioning, or refrigeration work as described in section 326B.38.\n(e) Employees of any electrical, communications, or railway utility, cable communications company as defined in section 238.02, or a telephone company as defined under section 237.01 or its employees, or of any independent contractor performing work on behalf of any such utility, cable communications company, or telephone company, shall not be required to hold a license under sections 326B.31 to 326B.399:\n(1) while performing work on installations, materials, or equipment which are owned or leased, and operated and maintained by such utility, cable communications company, or telephone company in the exercise of its utility, antenna, or telephone function, and which:\n(i) are used exclusively for the generation, transformation, distribution, transmission, or metering of electric current, or the operation of railway signals, or the transmission of intelligence and do not have as a principal function the consumption or use of electric current or provided service by or for the benefit of any person other than such utility, cable communications company, or telephone company; and\n(ii) are generally accessible only to employees of such utility, cable communications company, or telephone company or persons acting under its control or direction; and\n(iii) are not on the load side of the service point or point of entrance for communication systems;\n(2) while performing work on installations, materials, or equipment which are a part of the street lighting operations of such utility; or\n(3) while installing or performing work on outdoor area lights which are directly connected to a utility's distribution system and located upon the utility's distribution poles, and which are generally accessible only to employees of such utility or persons acting under its control or direction.\n(f) An individual who physically performs electrical work on a residential dwelling that is located on a property the individual owns and actually occupies as a residence or owns and will occupy as a residence upon completion of its construction is not required to hold or obtain a license under sections 326B.31 to 326B.399 if the residential dwelling has a separate electrical utility service not shared with any other residential dwelling.\n(g) Companies and their employees licensed under section 326B.164 shall not be required to hold or obtain a license under sections 326B.31 to 326B.399 while performing elevator work.",
	"repealed": false
}