{
	"id": "480.059",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.059",
	"title": "480.059 CRIMINAL ACTIONS, PLEADINGS, PRACTICE AND PROCEDURE.",
	"text": "The supreme court shall have the power to regulate the pleadings, practice, procedure, and the forms thereof in criminal actions in all courts of this state, by rules promulgated by it from time to time. Such rules shall not abridge, enlarge, or modify the substantive rights of any person.\nBefore any such rules are adopted the supreme court shall appoint an advisory committee consisting of eight lawyers licensed to practice law in the state, one judge of the court of appeals, and two judges of the district court to assist the court in considering and preparing such rules.\n[Repealed, 1984 c 655 art 1 s 66]\nBefore any such rule is adopted, the supreme court shall distribute copies of the proposed rule to the judiciary and attorneys of the state for their consideration and suggestions and give due consideration to such suggestions as they may submit to the court. The Minnesota State Bar Association, or a professional judicial organization may file with the court a petition specifying their suggestions concerning any existing or proposed rule and requesting a hearing thereon. The court shall thereupon grant a hearing thereon within six months after the filing of the petition.\nAny court, other than the supreme court, may adopt rules of court governing its practice; but such rules shall not conflict with the rules promulgated by the supreme court.\n(a) All rules promulgated under this section shall be effective at a time fixed by the court and shall be published in the appendix to the official reports of the supreme court and shall be bound therewith. The court shall publish and distribute to the judiciary and attorneys of the state, on or before September 1, 1974, copies of the final version of the rules it intends to adopt. A period of at least 120 days shall be allowed from the date of publication of this final version for the rules to be studied by the judiciary and attorneys of the state prior to the adoption of any of the rules.\n(b) The commissioner of administration shall print, publish and distribute copies thereof to the judiciary and attorneys and as required by law.\nPresent statutes relating to the pleadings, practice, procedure, and the forms thereof in criminal actions shall be effective until modified or superseded by court rule. If a rule is promulgated pursuant to this section which is in conflict with a statute, the statute shall thereafter be of no force and effect. Notwithstanding any rule, however, the following statutes remain in full force and effect:\n(1) statutes which relate to substantive criminal law, found in chapters 609, 617, and 624, except for sections 609.115, and 609.145;\n(2) statutes which relate to the rights of the accused, found in sections 611.01 to 611.033, 611.11, and 611.30 to 611.34 and Laws 1973, chapter 317;\n(3) statutes which relate to the prevention of crime, found in chapter 625;\n(4) statutes which relate to training, investigation, apprehension, and reports, found in chapter 626;\n(5) statutes which relate to privacy of communications, found in chapter 626A;\n(6) statutes which relate to extradition, detainers, and arrest, found in sections 629.01 to 629.404;\n(7) statutes which relate to judgment and sentence, found in sections 631.20 to 631.21 and 631.40 to 631.51;\n(8) statutes which relate to special rules, evidence, privileges, and witnesses, found in sections 595.02 to 595.025 and chapter 634;\n(9) the supreme court shall not have the power to adopt or promulgate any rule requiring less than unanimous verdicts in criminal cases; and\n(10) statutes which relate to the writ of habeas corpus, including but not limited to, sections 589.01 to 589.30 and 484.03.\nWhenever, pursuant to this section, the court adopts a rule which conflicts, modifies, or supersedes a statute not enumerated above it shall indicate the statute in the order adopting the rule.\nThis section shall not abridge the right of the legislature to enact, modify, or repeal any statute or modify or repeal any rule of the supreme court adopted pursuant thereto.",
	"repealed": false
}