{
	"id": "256R.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.13",
	"title": "256R.13 AUDITING REQUIREMENTS.",
	"text": "(a) The commissioner shall provide for an audit of the cost and statistical data of nursing facilities participating as vendors of medical assistance. The commissioner shall select for audit at least 15 percent of the nursing facilities' data reported at random or using factors including, but not limited to: data reported to the public as criteria for rating nursing facilities; data used to set limits for other medical assistance programs or vendors of services to nursing facilities; change in ownership; frequent changes in administration in excess of normal turnover rates; complaints to the commissioner of health about care, safety, or rights; where previous inspections or reinspections under section 144A.10 have resulted in correction orders related to care, safety, or rights; or where persons involved in ownership or administration of the facility have been indicted for alleged criminal activity.\n(b) The commissioner shall meet the 15 percent requirement by either conducting an audit focused on an individual nursing facility, a group of facilities, or targeting specific data categories in multiple nursing facilities. These audits may be conducted on site at the nursing facility, at office space used by a nursing facility or a nursing facility's parent organization, or at the commissioner's office. Data being audited may be collected electronically, in person, or by any other means the commissioner finds acceptable.\n(a) The commissioner may subject reports and supporting documentation to desk and field audits to determine compliance with this chapter. Retroactive adjustments shall be made as a result of desk or field audit findings if the cumulative impact of the finding would result in a rate adjustment of at least 0.15 percent of the statewide weighted average operating payment rate as determined in section 256R.09, subdivision 6. If a field audit reveals inadequacies in a nursing facility's record keeping or accounting practices, the commissioner may require the nursing facility to engage competent professional assistance to correct those inadequacies within 90 days so that the field audit may proceed.\n(b) Field audits may cover the four most recent annual statistical and cost reports for which desk audits have been completed and payment rates have been established. The field audit must be an independent review of the nursing facility's statistical and cost report. All transactions, invoices, or other documentation that support or relate to the statistics and costs claimed on the annual statistical and cost reports are subject to review by the field auditor. If the provider fails to provide the field auditor access to supporting documentation related to the information reported on the statistical and cost report within the time period specified by the commissioner, the commissioner shall calculate the total payment rate by disallowing the cost of the items for which access to the supporting documentation is not provided.\n(c) Changes in the total payment rate which result from desk or field audit adjustments to statistical and cost reports for reporting periods earlier than the four most recent annual cost reports must be made to the four most recent annual statistical and cost reports, the current statistical and cost report, and future statistical and cost reports to the extent that those adjustments affect the total payment rate established by those reporting years.\nIf the commissioner requests supporting documentation during an audit for an item of cost reported by a nursing facility, and the nursing facility's response does not adequately document the item of cost, the commissioner may make reasoned assumptions considered appropriate in the absence of the requested documentation to reasonably establish a payment rate rather than disallow the entire item of cost. This subdivision shall not diminish the nursing facility's appeal rights.\nThe commissioner shall extend the period for retention of records under section 256R.09, subdivision 3, for purposes of performing field audits as necessary to enforce sections 256R.04; 256R.05, subdivision 2; 256R.06, subdivisions 2, 6, and 7; 256R.08, subdivisions 1 and 3; and 256R.09, subdivisions 3 and 4, with written notice to the facility postmarked no later than 90 days prior to the expiration of the record retention requirement.",
	"repealed": false
}