{
	"id": "144.4803",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4803",
	"title": "144.4803 DEFINITIONS.",
	"text": "\"Active tuberculosis\" includes infectious and noninfectious tuberculosis and means:\n(1) a condition evidenced by a positive culture for mycobacterium tuberculosis taken from a pulmonary or laryngeal source;\n(2) a condition evidenced by a positive culture for mycobacterium tuberculosis taken from an extrapulmonary source when there is clinical evidence such as a positive skin test for tuberculosis infection, coughing, sputum production, fever, or other symptoms compatible with pulmonary tuberculosis; or\n(3) a condition in which clinical specimens are not available for culture, but there is radiographic evidence of tuberculosis such as an abnormal chest x-ray, and clinical evidence such as a positive skin test for tuberculosis infection, coughing, sputum production, fever, or other symptoms compatible with pulmonary tuberculosis, that lead a physician, advanced practice registered nurse, or physician assistant to reasonably diagnose active tuberculosis according to currently accepted standards of medical practice and to initiate treatment for tuberculosis.\n\"Advanced practice registered nurse\" means a person who is licensed by the Board of Nursing under chapter 148 to practice as an advanced practice registered nurse.\n[Renumbered subd 5a]\n\"Carrier\" means a person who has active tuberculosis or is clinically suspected of having active tuberculosis.\n\"Clinically suspected of having active tuberculosis\" means presenting a reasonable possibility of having active tuberculosis based upon epidemiologic, clinical, or radiographic evidence, laboratory test results, or other reliable evidence as determined by a physician, advanced practice registered nurse, or physician assistant using currently accepted standards of medical practice.\n\"Commissioner\" means the commissioner of health.\n\"Community health board\" means an administrative authority established under section 145A.03.\n\"Contagion precautions for tuberculosis\" means those measures under currently accepted standards of medical practice that prevent a carrier from exposing others to tuberculosis.\n\"Department\" means the Department of Health.\n\"Directly observed therapy\" means a method for ensuring compliance with medication directions in which a licensed health professional or designee observes a person ingesting prescribed medications or administers the prescribed medication to the person.\n\"Disease prevention officer\" means a designated agent of the commissioner, or a designated agent of a community health board that has express delegated authority from the commissioner to proceed under sections 144.4801 to 144.4813.\n\"Endangerment to the public health\" means a carrier who may transmit tuberculosis to another person or persons because the carrier has engaged or is engaging in any of the following conduct:\n(1) refuses or fails to submit to a diagnostic tuberculosis examination that is ordered by a physician, advanced practice registered nurse, or physician assistant and is reasonable according to currently accepted standards of medical practice;\n(2) refuses or fails to initiate or complete treatment for tuberculosis that is prescribed by a physician, advanced practice registered nurse, or physician assistant and is reasonable according to currently accepted standards of medical practice;\n(3) refuses or fails to keep appointments for treatment of tuberculosis;\n(4) refuses or fails to provide the commissioner, upon request, with evidence showing the completion of a course of treatment for tuberculosis that is prescribed by a physician, advanced practice registered nurse, or physician assistant and is reasonable according to currently accepted standards of medical practice;\n(5) refuses or fails to initiate or complete a course of directly observed therapy that is prescribed by a physician, advanced practice registered nurse, or physician assistant and is reasonable according to currently accepted standards of medical practice;\n(6) misses at least 20 percent of scheduled appointments for directly observed therapy, or misses at least two consecutive appointments for directly observed therapy;\n(7) refuses or fails to follow contagion precautions for tuberculosis after being instructed on the precautions by a licensed health professional or by the commissioner;\n(8) based on evidence of the carrier's past or present behavior, may not complete a course of treatment for tuberculosis that is reasonable according to currently accepted standards of medical practice; or\n(9) may expose other persons to tuberculosis based on epidemiological, medical, or other reliable evidence.\n\"Epidemiological data\" or \"epidemiological evidence\" means data or evidence relating to the occurrence, distribution, clinical characteristics, and control of disease within a group of people or within a specified population.\n\"Health order\" means an order issued by the commissioner or a community health board with express delegated authority from the commissioner.\n\"Infectious tuberculosis\" means the stage of tuberculosis where mycobacterial organisms are capable of being expelled into the air by a person, as determined by laboratory, epidemiological, or clinical findings.\n\"Isolation\" means placing a carrier who has infectious tuberculosis in:\n(1) a hospital or other treatment facility;\n(2) the carrier's residence or current location; or\n(3) any other place approved by the commissioner, provided that the place of isolation prevents or limits the transmission of the infectious tuberculosis agent to others during the period of infectiousness.\n\"Licensed health professional\" means a person licensed by one of the health-related licensing boards listed in section 214.01, subdivision 2.\n\"Peace officer\" means an employee or an elected or appointed official of a political subdivision or law enforcement agency who is licensed by the Board of Peace Officer Standards and Training, is charged with the prevention and detection of crime and the enforcement of the general criminal laws of the state, and has the full power of arrest. \"Peace officer\" includes an officer of the Minnesota State Patrol.\n\"Physician\" means a person who is licensed by the Board of Medical Practice under chapter 147 to practice medicine.\n\"Physician assistant\" means a person who is licensed by the Board of Medical Practice under chapter 147A to practice as a physician assistant.\n\"Respondent\" means a person or group of persons to whom the commissioner has issued a health order, excluding the carrier.\n\"Treatment facility\" means a hospital or other treatment provider that is qualified to provide care, treatment, and appropriate contagion precautions for tuberculosis.",
	"repealed": false
}