{
	"id": "90.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.061",
	"title": "90.061 STATE APPRAISERS.",
	"text": "The commissioner may designate any qualified person as a state appraiser. Each state appraiser shall be bonded in a sum of not less than $1,000, conditioned upon the faithful performance of duties.\nEvery state appraiser is hereby authorized to arrest any person found trespassing or to have trespassed upon state lands and deliver the trespasser to the sheriff of the county and immediately enter a complaint before a court of competent jurisdiction in the county charging the person so arrested with such trespass, and the person so charged shall be arraigned and given a hearing on the complaint.\nEach state appraiser shall possess when on duty an identification card provided by the commissioner. Any person not a state appraiser who shall impersonate or claim to be a state appraiser shall be guilty of a misdemeanor.\n(a) When an appraisal or valuation of any land is made, the state appraiser shall place an estimate and valuation of any timber thereon and make a separate appraisal report thereof; the report shall be made from field notes made on the land, shall be dated when made and, together with the field notes shall be made a part of the records of the department. The state appraiser shall sign each page of the field notes and appraisal report. These records shall show that the state appraiser was actually upon the land when the estimate and valuation was made.\n(b) The appraisal report shall state the amount of each kind of timber and the value of each kind of timber for each 40-acre tract or subdivision and for each tract designated in the government survey as a government lot or portions thereof except that reports made for the purpose of timber sales only shall include the percentage value of timber on such 40-acre tract or subdivision or government lot or a portion thereof together with the total amount of each kind of timber and the total value of each kind of timber for the sale unit.\nThe duties of the state appraiser shall be to appraise and place a valuation upon any state lands or any state timber or any interest therein anywhere; to check-scale timber cut from state lands in trespass, either situated upon state lands or removed therefrom; to check-scale any scale of timber cut on state lands; to make check-scales, by the stump and top, or any other method, of timber removed from state lands; and to perform such other duties as may be assigned.\nNothing contained in this chapter shall be construed to in any way amend any other provision of law relating to the appointment of appraisers by other officials.\nNo state appraiser shall have any interest, directly or indirectly, in any of the state land or material improvements thereon and shall not purchase, directly or indirectly, any interest in the same or any part thereof.\n(a) State appraisers are empowered, with the consent of the commissioner, to perform any scaling, and generally to supervise the cutting and removal of timber and forest products on or from state lands so far as may be reasonably necessary to insure compliance with the terms of the permits or other contracts governing the same and protect the state from loss.\n(b) The form of appraisal reports, records, and notes to be kept by state appraisers shall be as the commissioner prescribes.",
	"repealed": false
}