{
	"id": "471.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.75",
	"title": "471.75 ORDERS, SUFFICIENT FUNDS; CERTIFICATES OF INDEBTEDNESS.",
	"text": "From and after January 1, 1944, (or in the case of municipalities referred to in section 471.73, from and after January 1 of the year following the adoption of the resolution referred to in section 471.73) no municipality subject to sections 471.71 to 471.83 shall draw or issue any order or warrant on any fund (except as authorized by subdivision 6) until there is sufficient money in the fund to pay the same, together with all warrants and orders previously issued against the fund.\nWhenever, from and after the date provided by subdivision 1, the expenses and obligations incurred chargeable to any particular fund of a municipality subject to sections 471.71 to 471.83 in any year are sufficient to absorb such available cash as may remain in the fund from prior years or may have been received from other sources, plus (in the case of school districts) such amounts as have been certified by the state Department of Education as due for state aids of any kind, or income tax distributions for said district for such year, plus the percentage of the entire amount of the tax levy for such fund payable in that year indicated in subdivision 3, neither the governing body nor any officer, board, or employee of such taxing district shall have power, and no power shall exist, to create any additional indebtedness (save as the remainder of such tax levy is collected or available money is received from other sources) which shall be a charge against that particular fund or shall be in any manner a valid claim against such municipality; but such additional indebtedness attempted to be created shall be a personal claim against the officer or member of the governing body voting for or attempting to create the same. Whenever the county auditor shall have certified to the municipality the portion of the remainder of the tax levy which has been collected by the county treasurer, such portion shall be deemed to have been collected within the meaning of this section.\nThe percentage of the entire amount of the tax levy which may be expended or against which obligations may be incurred under subdivision 2 shall be 95 percent in the case of any municipality in which the average tax delinquency in the three preceding years shall not exceed five percent, and shall be 90 percent in the case of any municipality in which the average tax delinquency in the three preceding years shall exceed five but shall not exceed ten percent, and shall be 85 percent in the case of any municipality in which the average tax delinquency in the three preceding years shall exceed ten percent. Taxes involved in litigation as to the amount thereof shall not be considered delinquent within the meaning of this section.\nAt any time after the first day of the year following the making of an annual tax levy, the governing body of any municipality may, for the purpose of meeting the obligations of the current year, by resolution, with or without advertisement for bids, issue and sell as many certificates of indebtedness as may be needed in anticipation of the collection of taxes so levied for any fund named in the tax levy, for the purpose of raising money for such fund. All certificates of indebtedness issued under the provisions of sections 471.71 to 471.83 shall be negotiable and shall be payable to the order of the payee and shall have a definite due date, but may be made payable on or before such date. No certificate shall be issued to become due and payable later than the last day of the year of issuance. Such certificates shall not be sold for less than par and accrued interest and shall not bear a greater rate of interest than six percent per annum, which interest shall be payable at maturity or at such earlier times as the governing body may determine. Each certificate shall state upon its face for which funds the proceeds of the certificate shall be used, the total amount of the certificates so issued against such fund, and the total amount embraced in said tax levy for that fund. They shall be numbered consecutively and be in denominations of $25 or any multiple thereof and shall otherwise be in such form and be made payable at such place as will best aid in their negotiation.\nThe total amount of certificates of indebtedness issued against any fund for any year, with interest thereon to maturity, shall not exceed in any municipality that percent of the tax levy for the fund for such year which is prescribed by subdivisions 2 and 3 as the maximum percentage of the tax levy against which obligations may be incurred in the municipality, and the aggregate of outstanding certificates against any fund at no time shall exceed the uncollected portion of such percentage of the tax levy for the fund, and prior to the beginning of the seventh month of the year shall not exceed 50 percent of the uncollected portion of such percentage of the levy. Any such municipality may renew any outstanding certificates of indebtedness from any prior year or issue new certificates, notwithstanding the fact that prior certificates may be unpaid, whenever inability to pay such outstanding prior certificates is due solely to failure to collect sufficient moneys upon the tax levy against which they were issued to discharge such certificates; in the event such certificates are renewed, the municipality may pay accrued interest thereon at the time of renewal. Except as authorized in this subdivision, no certificate for any year shall be issued until all certificates for prior years have been paid, nor shall any certificate be extended.\nIf any such municipality is unable to sell certificates of indebtedness in the manner prescribed hereby, it may issue such certificates, within the limitations herein provided, to the treasurer of the municipality, or the treasurer's order, and deposit the same with the treasurer. Certificates so issued shall be held by the treasurer until they may be sold and shall bear interest at not to exceed six percent per annum. The municipality may thereupon, as long as such certificates are on deposit with the treasurer, issue warrants on funds against which such certificates were issued, the principal amount of such warrants not to exceed the total principal amount of the certificates so held by the treasurer. Such warrants shall bear interest at the rate specified by the governing body but not to exceed six percent per annum from and after the day they are presented to the treasurer and stamped \"Not paid for want of funds, but protected by certificates of indebtedness now held by me.\" Such certificates may be sold by the governing body of the municipality for not less than par and accrued interest, and the proceeds of such sale shall be used to take up such warrants in the order of which they were presented to the treasurer, registered by the treasurer, and stamped as aforesaid. Interest upon such warrants shall stop upon the date they are called by the treasurer for payment. Such certificates of indebtedness so held by the treasurer shall be paid at the same time and the same manner as if they had been issued to a purchaser thereof. All warrants attempted to be issued and all obligations of indebtedness attempted to be incurred under authority of this subdivision in excess of the principal amount of the certificates of indebtedness so held by such treasurer shall be void.\nThe proceeds of the taxes assessed as aforesaid on account of said fund and the faith and credit of the municipality shall be irrevocably pledged for the redemption of the certificates issued hereunder in the order of issuance against each respective fund.\nFrom and after the date specified in subdivision 1, any such municipality shall be deemed for all purposes to be on a cash basis. All taxes shall be levied as now provided by law, but shall be considered as tax revenues for the year in which such taxes are payable. Any balance remaining in any fund at the end of any such year may be used in later years in addition to the taxes levied for such year or years.\nDuring the first month of each year the governing body of each municipality subject to this section, on the basis of the tax levy made, with allowance for probable delinquencies, if any, and on the basis of probable receipts from other sources, shall determine the moneys which will be available for each fund and department during each quarter of the ensuing year, and, by resolution, shall fix the maximum amount of money which shall be expended by each department and from each fund in each quarter of said year. When it appears that money budgeted for any fund is not needed therefor, the governing body, by resolution, may transfer the excess to any other fund unless such transfer is prohibited by any law governing such municipality. If under the law the governing body has no control over the expenditures of a particular department or board, such resolution shall, as to such department or board, set forth the amount of tax moneys or other funds, if any, which will be made available for such department or board by action of the governing body.",
	"repealed": false
}