{
	"id": "62Q.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.70",
	"title": "62Q.70 APPEAL OF THE COMPLAINT DECISION.",
	"text": "(a) Each health plan company shall establish an internal appeal process for reviewing a health plan company's decision regarding a complaint filed in accordance with section 62Q.69. The appeal process must meet the requirements of this section. This section applies only to group health plans. However, a health plan company offering individual coverage may, pursuant to section 62Q.69, subdivision 3, paragraph (c), follow the process outlined in this section.\n(b) The person or persons with authority to resolve or recommend the resolution of the internal appeal must not be solely the same person or persons who made the complaint decision under section 62Q.69.\n(c) The internal appeal process must permit the enrollee to review the information relied upon in the course of the appeal and the receipt of testimony, correspondence, explanations, or other information from the complainant, staff persons, administrators, providers, or other persons as deemed necessary by the person or persons investigating or presiding over the appeal.\n(d) The enrollee must be allowed to receive continued coverage pending the outcome of the appeals process.\nThe health plan company must provide notice to enrollees of its internal appeals process in a culturally and linguistically appropriate manner consistent with the provisions of the Affordable Care Act. If a complainant notifies the health plan company of the complainant's desire to appeal the health plan company's decision regarding the complaint through the internal appeal process, the health plan company must provide the complainant the option for the appeal to occur either in writing or by hearing.\n(a) If a complainant appeals in writing, the health plan company must give the complainant written notice of the appeal decision and all key findings within 30 days of the health plan company's receipt of the complainant's written notice of appeal. If a complainant appeals by hearing, the health plan company must give the complainant written notice of the appeal decision and all key findings within 45 days of the health plan company's receipt of the complainant's written notice of appeal.\n(b) If the appeal decision is partially or wholly adverse to the complainant, the notice must advise the complainant of the right to submit the appeal decision to the external review process described in section 62Q.73 and the procedure for initiating the external process.\n(c) Upon the request of the complainant, the health plan company must provide the complainant with a complete summary of the appeal decision.",
	"repealed": false
}