{
	"id": "114E.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/114E.10",
	"title": "114E.10 NATURE OF RIGHTS; ROLE OF ENVIRONMENTAL AGENCY; SUBORDINATION OF INTERESTS.",
	"text": "(a) Any person, including a person that owns an interest in the real property subject to the environmental covenant, the environmental agency, or any other political subdivision or unit of local government, may be a holder. An environmental covenant may identify more than one holder. The interest of a holder is an interest in real property. The holder is the grantee of the real property interest conveyed under an environmental covenant.\n(b) Unless an environmental agency is a holder, any right that the agency may have with respect to an environmental covenant does not constitute an interest in real property. Approval of an environmental covenant does not make the environmental agency a holder unless it has authority under law other than this chapter to acquire an interest in real property for purposes related to an environmental response project and it is expressly identified as a holder in the environmental covenant.\n(c) An environmental agency is bound by any obligation it assumes in an environmental covenant, but an environmental agency does not assume obligations merely by signing an environmental covenant. As provided in section 114E.15, an environmental covenant is not valid unless signed by the environmental agency and the environmental agency may set reasonable conditions for its approval of an environmental covenant. When the environmental agency is a federal agency, the covenant must also be approved and signed by the state environmental agency that has authority under state law to address the release or threatened release involved in the environmental response project. Any other person that signs an environmental covenant is bound by the obligations the person expressly assumes in the covenant, but signing the covenant does not change obligations, rights, or protections granted or imposed under law other than this chapter except as provided in the covenant.\n(d) The following rules apply to interests in real property in existence at the time an environmental covenant is created or amended:\n(1) an interest that has priority under other law is not affected by an environmental covenant unless the person that owns the interest subordinates that interest to the covenant;\n(2) this chapter does not require a person that owns a prior interest to subordinate that interest to an environmental covenant or to agree to be bound by the covenant;\n(3) a subordination agreement may be contained in an environmental covenant or in a separate record that is recorded. If the environmental covenant covers commonly owned property in a common interest community, the environmental covenant or the subordination agreement may be signed by any person authorized by the governing board of the owners' association; and\n(4) an agreement by a person to subordinate a prior interest to an environmental covenant affects the priority of that person's interest but does not by itself impose any affirmative obligation on the person with respect to the environmental covenant.",
	"repealed": false
}