{
	"id": "261.002",
	"url": "https://www.revisor.mn.gov/statutes/cite/261.002",
	"title": "261.002 TRANSFER OF TOWN EMPLOYEES.",
	"text": "The term \"merit system\" as used herein shall mean the rules for a merit system of personnel administration for employees of local social services agencies adopted by the commissioner of human services in accordance with the provisions of section 393.07, including the merit system established for Hennepin County pursuant to Laws 1965, chapter 855, as amended, the federal Social Security Act as amended, and merit system standards and regulations issued by the federal Social Security Board and the United States Children's Bureau.\nAll employees of any municipality or town who are engaged full time in poor relief work therein on January 1, 1974 shall be retained as employees of the county and placed under the jurisdiction of its welfare board.\nAll such employees shall be blanketed into the merit system with comparable status, classification, longevity, and seniority, and subject to the administrative requirements of the local social services agency. Employees with permanent status under any civil service provision on January 1, 1974 shall be granted permanent status under the merit system at comparable classifications and in accordance with work assignments made under the authority of the local social services agency as provided by the merit system rules.\nThe determination of proper job allocation shall be the responsibility of the personnel officer or director as provided under merit system rules applicable to the county involved with the right of appeal of allocation to the merit system council or personnel board by any employee affected by this transfer.\nAll transferred employees shall receive salaries for the classification to which they are allocated in accordance with the schedule in effect for local social services agency employees and at a salary step which they normally would have received had they been employed by the local social services agency for the same period of service they had previously served under the civil service provisions of any municipality or town; provided, however, that no salary shall be reduced as a result of the transfer.\nAll accumulated sick leave of transferred employees in the amount of 60 days or less shall be transferred to the records of the local social services agency and shall be the legal liability of the local social services agency. All accumulated sick leave in excess of 60 days shall be paid in cash to transferred employees by the municipality or town by which they were employed prior to their transfer, at the time of transfer. In lieu of the cash payment, the municipality or town shall, at the option of the employee concerned, allow a leave of absence with pay, prior to transfer, for all or part of the accumulated sick leave.\nEmployees of municipalities and towns engaged in the work of administering poor relief who are not covered by civil service provisions shall be blanketed into the merit system subject to a qualifying examination. Employees with one year or more service shall be subject to a qualifying examination and those with less than one year's service shall be subject to an open competitive examination.\nAll vacation leave of employees referred to in subdivision 2, accumulated prior to their transfer to county employment shall be paid in cash to them by the municipality or town by which they were employed prior to their transfer, at the time of transfer. In lieu of the cash payment, the municipality or town shall, at the option of the employee concerned, allow a leave of absence with pay, prior to transfer, for all or part of the accumulated vacation time.",
	"repealed": false
}