{
	"id": "16B.2975",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.2975",
	"title": "16B.2975 SURPLUS PROPERTY ACQUISITION, DISTRIBUTION, AND DISPOSAL.",
	"text": "\"Governmental unit or nonprofit organization\" means a governmental unit as defined in section 471.59, subdivision 1, an Indian tribal government, and any nonprofit and tax-exempt medical institution, hospital, clinic, health center, school, school system, college, university, or other institution organized and existing for any purpose authorized by federal law to accept surplus federal property.\n\"Surplus property\" means state or federal commodities, equipment, materials, supplies, books, printed matter, buildings, and other personal or real property that is obsolete, unused, not needed for a public purpose, or ineffective for current use. Surplus property does not include products manufactured by or held in inventory by prison industries for sale to the general public in the normal course of its business.\n(a) The commissioner is the state agency designated to transfer, purchase, accept, sell, or dispose of surplus property for the state and for the benefit of any other governmental unit or nonprofit organization for any purpose authorized by state and federal law and in accordance with state and federal rules and regulations. Any governmental unit or nonprofit organization may designate the commissioner to purchase or accept surplus property for it upon mutually agreeable terms and conditions. The commissioner may acquire, accept, warehouse, and distribute surplus property and charge a fee to cover any expenses incurred in connection with any of these acts.\n(b) Federal surplus property that has been transferred to the state for donation to public agencies and nonprofit organizations must be transferred or sold in accordance with the plan developed under paragraph (c). Expenses incurred in connection with the acquisition, warehousing, distribution, and disposal of federal surplus property must be paid from the surplus services revolving fund. Proceeds of sales, minus any expenses, must be deposited in the surplus services revolving fund.\n(c) The commissioner shall develop a detailed plan for disposal of donated federal property in conformance with state law and federal regulations. The plan must be submitted to the governor for certification and submission to the federal administrator of general services.\n(d) The commissioner, after consultation with one or more nonprofit organizations with an interest in providing housing for homeless veterans and their families, may acquire property from the United States government that is designated by the General Services Administration as surplus property. The commissioner may lease the property to a qualified nonprofit organization that agrees to develop or rehabilitate the property for the purpose of providing suitable housing for veterans and their families. The lease agreement with the nonprofit organization may require that the property be developed for use as housing for homeless and displaced veterans and their families and for veterans and their families who lose their housing.\nThe surplus services revolving fund is a separate fund in the state treasury. All money resulting from the acquisition, acceptance, warehousing, distribution, and public sale of surplus property, must be deposited in the fund. Money paid into the surplus services revolving fund is appropriated to the commissioner for the purposes of the programs and services referred to in this section.\n(a) When the state or an agency operating under a legislative appropriation obtains surplus property from the commissioner, the commissioner of management and budget must, at the commissioner's request, transfer the cost of the surplus property, including any expenses of acquiring, accepting, warehousing, and distributing the surplus property, from the appropriation of the agency receiving the surplus property to the surplus services revolving fund. The determination of the commissioner is final as to the cost of the surplus property to the agency receiving the property.\n(b) When any governmental unit or nonprofit organization other than an agency receives surplus property from the commissioner, the governmental unit or nonprofit organization must reimburse the surplus services revolving fund for the cost of the property, including the expenses of acquiring, accepting, warehousing, and distributing it, in an amount the commissioner sets. The commissioner may, however, require the governmental unit or nonprofit organization to deposit in advance in the surplus services revolving fund the cost of the surplus property upon mutually agreeable terms and conditions.\n(c) The commissioner may transfer or sell state surplus property to any person at public auction, at prepriced sale, or by sealed bid process in accordance with applicable state laws.\nThe commissioner may do any of the following to dispose of state surplus property:\n(1) transfer it to or between state agencies;\n(2) transfer it to a governmental unit or nonprofit organization in Minnesota; or\n(3) sell it and charge a fee to cover expenses incurred by the commissioner in the disposal of the surplus property.\nThe proceeds of the sale less the fee must be deposited in an account in a fund other than the general fund and are appropriated to the agency for whose account the sale was made, to be used and expended by that agency to purchase similar state property.\nThe commissioner may transfer state surplus computers to Minnesota Computers for Schools for refurbishing and distribution to any school, school system, college, or university in Minnesota.\nThe commissioner is authorized to solicit and accept donated money and fixed and consumable property for the benefit of the state and any other governmental unit or nonprofit organization for any purpose authorized by state and federal law and in accordance with federal regulations and rules. The gift acceptance procedures of sections 16A.013 to 16A.016 do not apply to this subdivision.\nThe commissioner may give and convey to a canine's handler the state's entirety of the right, title, interest, and estate in and to a canine who is retired from service, with whom the handler trained and worked while the canine was in service to the state. The handler is solely responsible for all future expenses related to the retired canine.",
	"repealed": false
}