{
	"id": "469.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.43",
	"title": "469.43 DEVELOPMENT PLAN.",
	"text": "(a) The corporation, working with the city and the nonprofit economic development agency, must prepare and adopt a development plan. The corporation must hold a public hearing before adopting a development plan. At least 60 days before the hearing, the corporation must make copies of the proposed plan available to the public at the corporation and city offices during normal business hours, on the corporation's and city's website, and as otherwise determined appropriate by the corporation. At least ten days before the hearing, the corporation must publish notice of the hearing in the official newspaper of the city. The development plan may not be adopted unless the corporation finds, by resolution, that:\n(1) the plan provides an outline for the development of the city as a destination medical center, and the plan is sufficiently complete, including the identification of planned and anticipated projects, to indicate its relationship to definite state and local objectives;\n(2) the proposed development affords maximum opportunity, consistent with the needs of the city, county, and state, for the development of the city by private enterprise as a destination medical center;\n(3) the proposed development conforms to the general plan for the development of the city and is consistent with the city comprehensive plan;\n(4) the plan includes:\n(i) strategic planning consistent with a destination medical center in the core areas of commercial research and technology, learning environment, hospitality and convention, sports and recreation, livable communities, including mixed-use urban development and neighborhood residential development, retail/dining/entertainment, and health and wellness;\n(ii) estimates of short- and long-range fiscal and economic impacts;\n(iii) a framework to identify and prioritize short- and long-term public investment and public infrastructure project development and to facilitate private investment and development, including the criteria and process for evaluating and underwriting development proposals;\n(iv) land use planning;\n(v) transportation and transit planning;\n(vi) operational planning required to support the medical center development district; and\n(vii) ongoing market research plans; and\n(5) the city has approved the plan.\n(b) The identification of planned and anticipated projects under paragraph (a), clause (1), must give priority to projects that will pay wages at least equal to the basic cost of living wage as calculated by the commissioner of employment and economic development for the county in which the project is located. The calculation of the basic cost of living wage must be done as provided for under section 116J.013.\nSection 15.99 does not apply to review and approval of the development plan. The city shall act on the development plan within 60 days following its submission by the corporation. The city may incorporate the development plan into the city's comprehensive plan.\nAll projects are subject to the planning, zoning, sanitary, and building laws; ordinances; regulations; and land use plans that apply to the city.\nThe corporation may modify the development plan at any time. The corporation must update the development plan not less than every five years. A modification or update under this subdivision must be adopted by the corporation upon the notice and after the public hearing and findings required for the original adoption of the development plan, including approval by the city.\nAs part of the development plan, the corporation may create and define the boundaries of medical center development districts and subdistricts at any place or places within the city. Projects may be undertaken within defined medical center development districts consistent with the development plan.\n(a) The medical business entity must establish a nonprofit economic development agency organized under chapter 317A to provide experience and expertise in developing and marketing the destination medical center. The corporation must engage the agency to assist the corporation in preparing the development plan. The governing board of the agency must be comprised of members of the medical community, city, and county. The agency must collaborate with city, county, and other community representatives. The nonprofit agency must provide services to assist the corporation and city in implementing the goals, objectives, and strategies in the development plan including, but not limited to:\n(1) facilitating private investment through development of a comprehensive marketing program to global interests;\n(2) developing and updating the criteria for evaluating and underwriting development proposals;\n(3) drafting and implementing the development plan, including soliciting and evaluating proposals for development and evaluating and making recommendations to the authority and the city regarding those proposals;\n(4) providing transactional services in connection with approved projects;\n(5) developing patient, visitor, and community outreach programs for a destination medical center development district;\n(6) working with the corporation to acquire and facilitate the sale, lease, or other transactions involving land and real property;\n(7) seeking financial support for the corporation, the city, and a project;\n(8) partnering with other development agencies and organizations, the city, and the county in joint efforts to promote economic development and establish a destination medical center;\n(9) supporting and administering the planning and development activities required to implement the development plan;\n(10) preparing and supporting the marketing and promotion of the medical center development district;\n(11) preparing and implementing a program for community and public relations in support of the medical center development district;\n(12) assisting the corporation or city and others in applications for federal grants, tax credits, and other sources of funding to aid both private and public development; and\n(13) making other general advisory recommendations to the corporation and the city, as requested.\n(b) The nonprofit economic development agency must disclose to the city and to the corporation the existence, nature, and all material facts regarding any financial interest its employees or contractors have in any public infrastructure project submitted to the city for approval and any financial interest its employees or contractors have in the destination medical center development. \"Contractors\" includes affiliates of the contractors or members or shareholders with an ownership interest of more than 20 percent in the contractor.\nThe nonprofit economic development agency shall not require the city to pay any amounts to the nonprofit economic development agency that are unrelated to public infrastructure project costs.\nAny contract for services between the corporation and the nonprofit economic development agency paid, in whole or in part, with public money provides the corporation, the city, and the state auditor the right to audit the books and records of the agency that are necessary to certify:\n(1) the nature and extent of the services furnished pursuant to the contract; and\n(2) that the payment for services and related disbursements complies with all state laws, regulations, and the terms of the contract.\nAny contract for services between the corporation and the agency paid, in whole or in part, with public money must require the corporation to maintain for the life of the corporation accurate and complete books and records directly relating to the contract.\nBy February 15 of each year, the corporation and city must jointly submit a report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over local and state government operations, economic development, and taxes, and to the commissioners of revenue and employment and economic development, and the county. The corporation and city must also submit the report as provided in section 3.195. The report must include:\n(1) the development plan and any proposed changes to the development plan;\n(2) progress of projects identified in the development plan;\n(3) actual costs and financing sources, including the amount paid with state aid under section 469.47, and required local contributions of projects completed in the previous two years by the corporation, city, county, and medical business entity;\n(4) estimated costs and financing sources for projects to be started in the next two years by the corporation, city, county, and medical business entity; and\n(5) debt service schedules for all outstanding obligations of the city for debt issued for projects identified in the plan.",
	"repealed": false
}