{
	"id": "308C.502",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.502",
	"title": "308C.502 MEMBER RESTRICTIONS.",
	"text": "In accordance with the applicable provisions of the Fair Housing Act, Title VIII of the Civil Rights Act of 1968, as amended; United States Code, title 42, chapter 3607, section 807(a)(b)(1)(2), and the rules and regulations of the United States Department of Housing and Urban Development applicable with respect to housing for older persons contained in Code of Federal Regulations, title 24, subtitle B, chapter I, subpart E, section 100.300-308, membership and housing in a cooperative governed by this chapter may be age restricted to older persons. As used in this section, \"housing for older persons\" means housing:\n(1) intended for, and solely occupied by, persons 62 years of age or older, except that:\n(i) as to joint holders of a membership, only one person need be age 62 or older; and\n(ii) as to a trust that is the holder of a membership pursuant to the requirements of this chapter, only one beneficiary who intends to occupy the cooperative as a member need be age 62 or older; or\n(2) intended and operated for occupancy by persons 55 years of age or older, and:\n(i) at least 80 percent of the occupied units are occupied by at least one person who is 55 years of age or older;\n(ii) the housing facility or community publishes and adheres to policies and procedures that demonstrate the intent required under this clause; and\n(iii) the housing facility or community complies with rules issued by the secretary of housing and urban development for verification of occupancy, which shall:\n(A) provide for verification by reliable surveys and affidavits; and\n(B) include examples of the types of policies and procedures relevant to a determination of compliance with the requirement of item (ii). Such surveys and affidavits shall be admissible in administrative and judicial proceedings for the purposes of such verification.\nIn accordance with the applicable provisions of the Fair Housing Act, Title VIII of the Civil Rights Act of 1968, as amended; United States Code, title 42, chapter 3607, section 807(a)(b)(1)(2), membership and housing in a cooperative governed by this chapter may be restricted to persons of low or moderate income.\nMembership and housing in a cooperative governed by this chapter may be restricted to persons engaged in a specific activity or persons who meet a specified characteristic based on past activity provided such restriction does not violate any provision of the Fair Housing Act, Title VIII of the Civil Rights Act of 1968, as amended; United States Code, title 42, chapter 3607, section 807(a)(b)(1)(2).\nCooperatives governed by this chapter may impose the same age or income restrictions on any nonmember occupants the board may permit to reside at the housing cooperative.",
	"repealed": false
}