{
	"id": "253D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.08",
	"title": "253D.08 COUNTY ATTORNEY ACCESS TO DATA.",
	"text": "Notwithstanding sections 144.291 to 144.298; 245.467, subdivision 6; 245.4876, subdivision 7; 260B.171; 260B.235, subdivision 8; 260C.171; and 609.749, subdivision 6, or any provision of chapter 13 or other state law, prior to filing a petition for commitment of a sexually dangerous person or a person with a sexual psychopathic personality, and upon notice to the proposed committed person, the county attorney or the county attorney's designee may move the court for an order granting access to any records or data, to the extent it relates to the proposed committed person, for the purpose of determining whether good cause exists to file a petition and, if a petition is filed, to support the allegations set forth in the petition.\nThe court may grant the motion if: (1) the Department of Corrections refers the case for commitment of a sexually dangerous person or a person with a sexual psychopathic personality; or (2) upon a showing that the requested category of data or records may be relevant to the determination by the county attorney or designee. The court shall decide a motion under this section within 48 hours after a hearing on the motion. Notice to the proposed committed person need not be given upon a showing that such notice may result in harm or harassment of interested persons or potential witnesses.\nNotwithstanding any provision of chapter 13 or other state law, a county attorney considering the civil commitment of a person under this chapter may obtain records and data from the Department of Corrections or any probation or parole agency in this state upon request, without a court order, for the purpose of determining whether good cause exists to file a petition and, if a petition is filed, to support the allegations set forth in the petition. At the time of the request for the records, the county attorney shall provide notice of the request to the person who is the subject of the records.\nData collected pursuant to this section shall retain their original status and, if not public, are inadmissible in any court proceeding unrelated to civil commitment, unless otherwise permitted.",
	"repealed": false
}