{
	"id": "182.663",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.663",
	"title": "182.663 STATISTICS AND RECORD KEEPING.",
	"text": "In order to further the purposes of this chapter, the commissioner shall develop and maintain an effective program of collection, compilation, and analysis of occupational safety and health statistics. Such programs may cover all employments within the scope of this chapter. The commissioner shall compile accurate statistics on work deaths, injuries and illnesses which shall include all deaths and all disabling, serious, or significant injuries and illnesses, whether or not involving loss of time from work, other than minor injuries requiring only first aid treatment and which do not involve medical treatment, loss of consciousness, restrictions of work or motion, or transfer to another job. Such programs shall be developed so that the state may coordinate and cooperate with a federal data collection and record-keeping program.\nEach employer shall make, keep and preserve, and make available to the commissioner such records regarding the employer's activities relating to this chapter as the commissioner may prescribe by rules as necessary or appropriate for the enforcement of this chapter or for the development of information regarding the causes and prevention of occupational accidents and illnesses. The records which the commissioner shall require the employer to make, keep and preserve shall be at least as effective as those required by the United States Department of Labor.\nThe commissioner shall adopt rules requiring employers to maintain accurate records of employee exposures to hazardous substances or harmful physical agents which are required to be monitored under this chapter. The rules shall provide employees or their representatives with an opportunity to have access to the records. The rules shall provide employees or their representatives with an opportunity to observe the monitoring or measuring and to have access to the records and reports of the monitoring and measuring. In order to carry out the provisions of this section, the rules may include provisions requiring employers to conduct periodic inspections. An employer shall promptly notify an employee who has been or is being exposed to hazardous substances or harmful physical agents in concentrations or at levels which exceed those prescribed by an applicable occupational safety and health standard adopted under this chapter, and shall inform any employee who is being exposed of the corrective action being taken.\nThe commissioner is authorized to compile, analyze, and publish annually, either in summary or detailed form, all reports or information obtained under this section, and to cooperate with the United States Department of Labor in obtaining national summaries of occupational deaths, injuries and illnesses. The commissioner shall preserve the anonymity of each employee with respect to whom medical reports or information is obtained.\nAny information obtained by the commissioner under this chapter shall be obtained with a minimum burden upon employers, especially those operating small business. Unnecessary duplication of efforts in obtaining information shall be reduced to the maximum extent feasible.",
	"repealed": false
}