{
	"id": "84D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/84D.03",
	"title": "84D.03 INFESTED WATERS; RESTRICTED ACTIVITIES.",
	"text": "(a) The commissioner shall list a water of the state as an infested water if the commissioner determines that:\n(1) the water contains a population of an aquatic invasive species that could spread to other waters if use of the water and related activities are not regulated to prevent this; or\n(2) the water is highly likely to be infested by an aquatic invasive species because it is connected to a water that contains a population of an aquatic invasive species.\n(b) When determining which invasive species comprise infested waters, the commissioner shall consider:\n(1) the extent of a species distribution within the state;\n(2) the likely means of spread for a species; and\n(3) whether regulations specific to infested waters containing a specific species will effectively reduce that species' spread.\n(c) The presence of common carp and curly-leaf pondweed shall not be the basis for listing a water as infested.\n(d) The commissioner shall maintain a list of infested waters and provide access to a copy of the listed waters. Listings are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n[Repealed, 1999 c 92 s 11]\n(a) Taking wild animals from infested waters for bait or aquatic farm purposes is prohibited except as provided in paragraph (b) or (c) and section 97C.341.\n(b) In waters that are listed as infested waters, except those listed as infested with prohibited invasive species of fish or certifiable diseases of fish, as defined under section 17.4982, subdivision 6, taking wild animals may be permitted for:\n(1) commercial taking of wild animals for bait and aquatic farm purposes as provided in a permit issued under section 84D.11, subject to rules adopted by the commissioner; and\n(2) bait purposes for noncommercial personal use in waters that contain Eurasian watermilfoil, when the infested waters are listed solely because they contain Eurasian watermilfoil and if the equipment for taking is limited to cylindrical minnow traps not exceeding 16 inches in diameter and 32 inches in length.\n(c) In streams or rivers that are listed as infested waters, except those listed as infested with certifiable diseases of fish, as defined under section 17.4982, subdivision 6, the harvest of bullheads, goldeyes, mooneyes, sheepshead (freshwater drum), and suckers for bait by hook and line for noncommercial personal use is allowed as follows:\n(1) fish taken under this paragraph must be used on the same body of water where caught and while still on that water body. Where the river or stream is divided by barriers such as dams, the fish must be caught and used on the same section of the river or stream;\n(2) fish taken under this paragraph may not be transported live from or off the water body;\n(3) fish harvested under this paragraph may only be used in accordance with this section;\n(4) any other use of wild animals used for bait from infested waters is prohibited;\n(5) fish taken under this paragraph must meet all other size restrictions and requirements as established in rules; and\n(6) all species listed under this paragraph shall be included in the person's daily limit as established in rules, if applicable.\n(d) Equipment authorized for minnow harvest in a listed infested water by permit issued under paragraph (b) may not be transported to, or used in, any waters other than waters specified in the permit.\n(e) Bait intended for sale may not be held in infested water after taking and before sale unless authorized under a license or permit according to Minnesota Rules, part 6216.0500.\n(f) In the Minnesota River downstream of Granite Falls, the Mississippi River downstream of St. Anthony Falls, and the St. Croix River downstream of the dam at Taylors Falls, including portions described as Minnesota-Wisconsin boundary waters in Minnesota Rules, part 6266.0500, subpart 1, items A and B, harvesting gizzard shad by cast net for noncommercial personal use as bait for angling, as provided in a permit issued under section 84D.11, is allowed as follows:\n(1) nontarget species must immediately be returned to the water;\n(2) gizzard shad taken under this paragraph must be used on the same body of water where caught and while still on that water body. Where the river is divided by barriers such as dams, the gizzard shad must be caught and used on the same section of the river;\n(3) gizzard shad taken under this paragraph may not be transported off the water body; and\n(4) gizzard shad harvested under this paragraph may only be used in accordance with this section.\n(a) All nets, traps, buoys, anchors, stakes, and lines used for commercial fishing or turtle, frog, or crayfish harvesting in an infested water that is listed because it contains invasive fish, invertebrates, aquatic plants or aquatic macrophytes other than Eurasian watermilfoil, or certifiable diseases, as defined in section 17.4982, must be tagged with tags provided by the commissioner, as specified in the commercial licensee's license or permit. Tagged gear must not be used in water bodies other than those specified in the license or permit. The license or permit may authorize department staff to remove tags from gear that has been decontaminated according to a protocol specified by the commissioner if use of the decontaminated gear in other water bodies does not pose an unreasonable risk of harm to natural resources or the use of natural resources in the state. This tagging requirement does not apply to commercial fishing equipment used in Lake Superior.\n(b) All nets, traps, buoys, anchors, stakes, and lines used for commercial fishing or turtle, frog, or crayfish harvesting in an infested water that is listed solely because it contains Eurasian watermilfoil must be dried for a minimum of ten days or frozen for a minimum of two days before they are used in any other waters, except as provided in this paragraph. Commercial licensees must notify the department's regional or area fisheries office or a conservation officer before removing nets or equipment from an infested water listed solely because it contains Eurasian watermilfoil and before resetting those nets or equipment in any other waters. Upon notification, the commissioner may authorize a commercial licensee to move nets or equipment to another water without freezing or drying, if that water is listed as infested solely because it contains Eurasian watermilfoil.\n(c) A commercial licensee must remove all aquatic macrophytes from nets and other equipment before placing the equipment into waters of the state.\n(d) The commissioner shall provide a commercial licensee with a current listing of listed infested waters at the time that a license or permit is issued.",
	"repealed": false
}