{
	"id": "216I.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.08",
	"title": "216I.08 APPLICATIONS; LOCAL REVIEW.",
	"text": "(a) Notwithstanding sections 216I.06 and 216I.07, an applicant who seeks a site or route permit for one of the projects identified in subdivision 2 may apply to the local units of government that have jurisdiction over the site or route for approval to build the project. If local approval is granted, a site or route permit is not required from the commission. If the applicant files an application with the commission, the applicant waives the applicant's right to seek local approval for the project.\n(b) A local unit of government with jurisdiction over a project identified in this section to whom an applicant has applied for approval to build the project may request that the commission assume jurisdiction and make a decision on a site or route permit pursuant to the applicable provisions under this chapter. A local unit of government must file the request with the commission within 60 days of the date an applicant files an application for the project with any one local unit of government. If one of the local units of government with jurisdiction over the project requests that the commission assume jurisdiction, jurisdiction over the project transfers to the commission. If the local units of government maintain jurisdiction over the project, the commission must select the appropriate local unit of government to be the responsible governmental unit to conduct the project's environmental review.\nAn applicant may seek approval under this section from a local unit of government to construct:\n(1) large electric power generating plants and solar energy generating systems with a capacity of less than 80 megawatts;\n(2) large electric power generating plants of any size that burn natural gas and are intended to be a peaking plant;\n(3) high-voltage transmission lines with a capacity between 100 and 200 kilovolts;\n(4) substations with a voltage designed for and capable of operation at a nominal voltage of 100 kilovolts or more;\n(5) a high-voltage transmission line service extension to a single customer between 200 and 300 kilovolts and less than ten miles in length;\n(6) a high-voltage transmission line rerouting to serve the demand of a single customer, if at least 80 percent of the rerouted line is located on property owned or controlled by the customer or the owner of the transmission line;\n(7) energy storage systems; and\n(8) large wind energy conversion systems with a capacity less than 25 megawatts.\nAn applicant must notify the commission that the applicant has elected to seek local approval of the proposed project within ten days of the date the applicant submits an application to a local unit of government to approve an eligible project.\n(a) A local unit of government that maintains jurisdiction over a qualifying project must prepare or request that the applicant prepare an environmental assessment on the project. The local unit of government must afford the public an opportunity to participate in developing the scope of the environmental assessment before the environmental assessment is prepared.\n(b) Upon completing the environmental assessment, the local unit of government must publish notice in the EQB Monitor that indicates (1) the environmental assessment is available for review, (2) how a copy of the document may be reviewed, (3) that the public may comment on the document, and (4) the procedure for submitting comments to the local unit of government. Upon completion of the environmental assessment, the local unit of government must provide a copy of the environmental assessment to the commission.\n(c) The local unit of government is prohibited from making a final decision on the permit until at least ten days after the date the notice appears in the EQB Monitor. If more than one local unit of government has jurisdiction over a project and the local units of government cannot agree which local unit of government prepares the environmental assessment, any local unit of government or the applicant may request that the commission select the appropriate local unit of government to be the responsible governmental unit to conduct an environmental review of the project.",
	"repealed": false
}