{
	"id": "60A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.65",
	"title": "60A.65 MANDATORY CONTROL LEVEL EVENT.",
	"text": "\"Mandatory control level event\" means any of the following events:\n(1) the filing of a risk-based capital report that indicates that the insurer's total adjusted capital is less than its mandatory control level risk-based capital;\n(2) notification by the commissioner to the insurer of an adjusted risk-based capital report that indicates the event in clause (1), provided the insurer does not challenge the adjusted risk-based capital report under section 60A.66; or\n(3) if, pursuant to section 60A.66, the insurer challenges an adjusted risk-based capital report that indicates the event in clause (1), notification by the commissioner to the insurer that the commissioner has, after a hearing, rejected the insurer's challenge.\nIn the event of a mandatory control level event:\n(1) with respect to a life and/or health insurer, the commissioner shall take the actions necessary to place the insurer under regulatory control under chapter 60B. In that event, the mandatory control level event is considered sufficient grounds for the commissioner to take action under chapter 60B, and the commissioner has the rights, powers, and duties with respect to the insurer set forth in chapter 60B. If the commissioner takes actions pursuant to an adjusted risk-based capital report, the insurer is entitled to the protections of section 60B.11 pertaining to summary proceedings. However, the commissioner may forgo action for up to 90 days after the mandatory control level event if the commissioner finds there is a reasonable expectation that the mandatory control level event may be eliminated within the 90-day period; and\n(2) with respect to a property and casualty insurer, the commissioner shall take the actions necessary to place the insurer under regulatory control under chapter 60B, or, in the case of an insurer that is writing no business and that is running off its existing business, may allow the insurer to continue its run-off under the supervision of the commissioner. In either event, the mandatory control level event is sufficient grounds for the commissioner to take action under chapter 60B, and the commissioner has the rights, powers, and duties with respect to the insurer set forth in chapter 60B. If the commissioner takes actions pursuant to an adjusted risk-based capital report, the insurer is entitled to the protections of section 60B.11 pertaining to summary proceedings. However, the commissioner may forgo action for up to 90 days after the mandatory control level event if the commissioner finds there is a reasonable expectation that the mandatory control level event may be eliminated within the 90-day period.",
	"repealed": false
}