{
	"id": "142G.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.20",
	"title": "142G.20 APPLICANT AND PARTICIPANT REQUIREMENTS AND RESPONSIBILITIES.",
	"text": "An applicant must provide information on an application form and supplemental forms about the applicant's circumstances according to section 256P.07.\nAn applicant or participant must apply for, accept if eligible, and follow through with appealing any denials of eligibility for benefits from other programs for which the applicant or participant is potentially eligible and which would, if received, offset assistance payments. An applicant's or participant's failure to complete application for these benefits without good cause results in denial or termination of assistance. Good cause for failure to apply for these benefits is allowed when circumstances beyond the control of the applicant or participant prevent the applicant or participant from making an application.\nAn applicant or participant who does not know or is unsure whether a given change in circumstances will affect the applicant's or participant's MFIP eligibility or assistance payment must contact the county agency for information.\nA participant must complete forms prescribed by the commissioner which are required for recertification of eligibility according to section 256P.04, subdivisions 8 and 9. A county agency must end benefits when the participant fails to submit the recertification form and verifications and complete the interview process before the end of the certification period. If the participant submits the recertification form by the last day of the certification period, benefits may be reinstated back to the date of closing when the recertification process is completed during the first month after benefits ended.\nEach assistance unit with a member who has earned income or a recent work history, and each assistance unit that has income deemed to it from a financially responsible person must complete a monthly MFIP household report form. \"Recent work history\" means the individual received earned income in the report month or any of the previous three calendar months even if the earnings are excluded. To be complete, the MFIP household report form must be signed and dated by the caregivers no earlier than the last day of the reporting period. All questions required to determine assistance payment eligibility must be answered, and documentation of earned income must be included.\n[See Note.]\nAn MFIP household report form must be received by the county agency by the eighth calendar day of the month following the reporting period covered by the form. When the eighth calendar day of the month falls on a weekend or holiday, the MFIP household report form must be received by the county agency the first working day that follows the eighth calendar day.\n[See Note.]\n(a) Paragraphs (b) to (e) apply to the reporting requirements in subdivision 6.\n(b) When the county agency receives an incomplete MFIP household report form, the county agency must immediately contact the caregiver by phone or in writing to acquire the necessary information to complete the form.\n(c) The automated eligibility system must send a notice of proposed termination of assistance to the assistance unit if a complete MFIP household report form is not received by a county agency. The automated notice must be mailed to the caregiver by approximately the 16th of the month. When a caregiver submits an incomplete form on or after the date a notice of proposed termination has been sent, the termination is valid unless the caregiver submits a complete form before the end of the month.\n(d) An assistance unit required to submit an MFIP household report form is considered to have continued its application for assistance if a complete MFIP household report form is received within a calendar month after the month in which the form was due and assistance shall be paid for the period beginning with the first day of that calendar month.\n(e) A county agency must allow good cause exemptions from the reporting requirements under subdivision 5 when any of the following factors cause a caregiver to fail to provide the county agency with a completed MFIP household report form before the end of the month in which the form is due:\n(1) an employer delays completion of employment verification;\n(2) a county agency does not help a caregiver complete the MFIP household report form when the caregiver asks for help;\n(3) a caregiver does not receive an MFIP household report form due to mistake on the part of the department or the county agency or due to a reported change in address;\n(4) a caregiver is ill, or physically or mentally incapacitated; or\n(5) some other circumstance occurs that a caregiver could not avoid with reasonable care which prevents the caregiver from providing a completed MFIP household report form before the end of the month in which the form is due.\n[See Note.]\nA caregiver must report changes as specified under section 256P.07.\nAn assistance unit is ineligible for MFIP unless the caregiver assigns all rights to child support and spousal maintenance benefits according to section 518A.81.\nEach member of the assistance unit must provide the member's Social Security number to the county agency, except for members in the assistance unit who are qualified noncitizens who are victims of domestic violence as defined under section 142G.02, subdivision 80, clauses (8) and (9). When a Social Security number is not provided to the county agency for verification, this requirement is satisfied when each member of the assistance unit cooperates with the procedures for verification of numbers, issuance of duplicate cards, and issuance of new numbers which have been established jointly between the Social Security Administration and the commissioner.",
	"repealed": false
}