{
	"id": "273.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.17",
	"title": "273.17 ASSESSMENT OF REAL PROPERTY.",
	"text": "In every year, on January 2, the assessor shall also assess all real property that may have become subject to taxation since the last previous assessment, including all real property platted since the last real estate assessment, and all buildings or other structures of any kind, whether completed or in process of construction, of over $1,000 in value, the value of which has not been previously added to or included in the valuation of the land on which they have been erected. The assessor shall make return thereof to the county auditor, with a return of personal property, showing the tract or lot on which each structure has been erected and the market value added thereto by such erection. Every assessor shall list, without revaluing, in each year, on a form to be prescribed by the commissioner of revenue, all parcels of land that shall have become homesteads or shall have ceased to be homesteads for taxation purposes since the last real estate assessment, and other parcels of land when the use of the land requires a change in classification or the land has been incorrectly classified in a previous assessment.\nThe county auditor shall note such change in the net tax capacity upon the tax lists, caused by a change in classification, and shall calculate the taxes for such year on such changed net tax capacity. In case of the destruction by fire, flood, or otherwise of any building or structure, over $100 in value, which has been erected previous to the last valuation of the land on which it stood, or the value of which has been added to any former valuation, the assessor shall determine, as nearly as practicable, how much less such land would sell for at private sale in consequence of such destruction, and make return thereof to the auditor.\nIn counties where the county auditor has elected to discontinue the preparation of assessment books as provided by section 273.03, subdivision 2, such changes as provided for in subdivision 1, shall be recorded in a separate record prepared under the direction of the county assessor and shall identify, by description or property identification number, or both, the real estate affected, the previous year's net tax capacities and the new market values and net tax capacities, provided that if only property identification numbers are used they shall be such that shall permit positive identification of the real estate to which they apply. Such record shall further indicate the total amount of increase or decrease in net tax capacity contained therein. The county assessor shall make return of such record to the county auditor who shall be the official custodian thereof.\nSuch record shall be known as \"County assessor's changes in real estate valuations for the year.\" Such records on file in the county auditor's office may be destroyed when they are more than ten years old pursuant to the conditions for destruction of government records contained in sections 138.161 to 138.25.",
	"repealed": false
}