{
	"id": "97A.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.145",
	"title": "97A.145 WETLANDS FOR WILDLIFE.",
	"text": "(a) The commissioner or the commissioner of administration may acquire wetlands and bordering areas, including marshes, ponds, small lakes, and stream bottoms for water conservation relating to wildlife development. The lands that are acquired may be developed for wildlife, recreation, and public hunting. The wetlands may be acquired by gift, lease, purchase, or exchange of state lands.\n(b) The commissioner may also acquire land owned by the state and tax-forfeited land that is suitable for wildlife development. The wetlands may not be acquired unless public access by right-of-way or easement from a public road is also acquired or available. In acquiring wetlands under this section the commissioner shall assign highest priority to type 3 and 4 wetlands, as defined in United States Fish and Wildlife Service Circular No. 39 (1971 edition), that are public waters. Lands purchased or leased under this section may not be used to produce crops unless needed for wildlife. The commissioner may designate, by written order published in the State Register, land acquired under this section as a wildlife management area for purposes of the outdoor recreation system. Designations of wildlife management areas are exempt from the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(a) Lands purchased or leased under this section must be acquired in accordance with this subdivision.\n(b) The commissioner must notify the county board and the town officers where the land is located and furnish them a description of the land to be acquired. The county board must approve or disapprove the proposed acquisition within 90 days after being notified. The commissioner may extend the time up to 30 days. The soil and water conservation district supervisors shall counsel the county board on drainage and flood control and the best utilization and capability of the land.\n(c) If the county board approves the acquisition within the prescribed time, the commissioner may acquire the land.\n(d) If the county board disapproves the acquisition, it must state valid reasons. The commissioner may not purchase or lease the land if the county board disapproves the acquisition and states its reasons within the prescribed time period. The landowner or the commissioner may appeal the disapproval to the district court having jurisdiction where the land is located.\n(e) The commissioner or the owner of the land may submit the proposed acquisition to the Land Exchange Board if:\n(1) the county board does not give reason for disapproval, or does not approve or disapprove the acquisition within the prescribed time period; or\n(2) the court finds that the disapproval is arbitrary and capricious, or that the reasons stated for disapproval are invalid.\n(f) The Land Exchange Board must conduct a hearing and make a decision on the acquisition within 60 days after receiving the proposal. The Land Exchange Board must give notice of the hearing to the county board, the commissioner, the landowner, and other interested parties. The Land Exchange Board must consider the interests of the county, the state, and the landowner in determining whether the acquisition is in the public interest. If a majority of the Land Exchange Board members approves the acquisition, the commissioner may acquire the land. If a majority disapproves, the commissioner may not purchase or lease the land.\nIf a drainage outlet is petitioned and drainage proceedings are conducted under the Drainage Code, chapter 103E, the commissioner should not interfere with or unnecessarily delay the proceedings.",
	"repealed": false
}