{
	"id": "245C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.07",
	"title": "245C.07 STUDY SUBJECT AFFILIATED WITH MULTIPLE FACILITIES.",
	"text": "(a) Subject to the conditions in paragraph (d), when a license holder, applicant, or other entity owns multiple programs or services that are licensed by the Department of Human Services, Department of Health, or Department of Corrections, only one background study is required for an individual who provides direct contact services in one or more of the licensed programs or services if:\n(1) the license holder designates one individual with one address and telephone number as the person to receive sensitive background study information for the multiple licensed programs or services that depend on the same background study; and\n(2) the individual designated to receive the sensitive background study information is capable of determining, upon request of the department, whether a background study subject is providing direct contact services in one or more of the license holder's programs or services and, if so, at which location or locations.\n(b) When a license holder maintains background study compliance for multiple licensed programs according to paragraph (a), and one or more of the licensed programs closes, the license holder shall immediately notify the commissioner which staff must be transferred to an active license so that the background studies can be electronically paired with the license holder's active program.\n(c) When a background study is being initiated by a licensed program or service or a foster care provider that is also licensed under chapter 144G, a study subject affiliated with multiple licensed programs or services may attach to the background study form a cover letter indicating the additional names of the programs or services, addresses, and background study identification numbers.\nWhen the commissioner receives a notice, the commissioner shall notify each program or service identified by the background study subject of the study results.\nThe background study notice the commissioner sends to the subsequent agencies shall satisfy those programs' or services' responsibilities for initiating a background study on that individual.\n(d) If a background study was conducted on an individual related to child foster care and the requirements under paragraph (a) are met, the background study is transferable across all licensed programs. If a background study was conducted on an individual under a license other than child foster care and the requirements under paragraph (a) are met, the background study is transferable to all licensed programs except child foster care.\n(e) The provisions of this section that allow a single background study in one or more licensed programs or services do not apply to background studies submitted by adoption agencies, supplemental nursing services agencies, personnel pool agencies, educational programs, professional services agencies, temporary personnel agencies, and unlicensed personal care provider organizations.\n(f) For an entity operating under NETStudy 2.0, the entity's active roster must be the system used to document when a background study subject is affiliated with multiple entities. For a background study to be transferable:\n(1) the background study subject must be on and moving to a roster for which the person designated to receive sensitive background study information is the same; and\n(2) the same entity must own or legally control both the roster from which the transfer is occurring and the roster to which the transfer is occurring. For an entity that holds or controls multiple licenses, or unlicensed personal care provider organizations, there must be a common highest level entity that has a legally identifiable structure that can be verified through records available from the secretary of state.",
	"repealed": false
}