{
	"id": "14.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.056",
	"title": "14.056 RULE VARIANCES; PROCEDURES.",
	"text": "A petition for a variance under section 14.055 must include the following information:\n(1) the name and address of the person or entity for whom a variance is being requested;\n(2) a description of and, if known, a citation to the specific rule for which a variance is requested;\n(3) the variance requested, including the scope and duration of the variance;\n(4) the reasons that the petitioner believes justify a variance, including a signed statement attesting to the accuracy of the facts asserted in the petition;\n(5) a history of the agency's action relative to the petitioner, as relates to the variance request;\n(6) information regarding the agency's treatment of similar cases, if known; and\n(7) the name, address, and telephone number of any person the petitioner knows would be adversely affected by the grant of the petition.\n(a) An agency may charge a petitioner a variance fee. The fee is:\n(1) $10, which must be submitted with the petition, and is not refundable; or\n(2) the estimated cost for the agency to process the variance petition, if the agency estimates that the cost will be more than $20.\n(b) If an agency intends to charge costs to the petitioner under paragraph (a), clause (2):\n(1) the agency and the petitioner must agree on the costs and the timing and manner of payment;\n(2) for purposes of the 60-day limit in subdivision 5, the petition is not complete until there is agreement with the petitioner on the costs and timing and manner of payment; and\n(3) if the payment made by the petitioner exceeds the agency's actual costs, the agency must refund the overpayment to the petitioner. The payment is not otherwise refundable.\n(c) Proceeds from fees charged under this subdivision are appropriated to the commissioner of management and budget. The commissioner of management and budget may transfer amounts to the fund and agency that supports the program that is the subject of the variance petition when the agency makes a request for the fee proceeds and the commissioner of management and budget determines the agency needs the fee proceeds to implement this section. Annually, the commissioner of management and budget must transfer proceeds from fees that are not transferred to agencies to the general fund.\nIn addition to any notice required by other law, an agency shall make reasonable efforts to ensure that persons or entities who may be affected by the variance have timely notice of the request for a variance. The agency may require the petitioner to serve notice on any other person or entity in the manner specified by the agency.\nBefore granting or denying a variance petition, an agency may request additional information from the petitioner.\nAn agency must issue a written order granting or denying a variance and specifying the scope and period of any variance granted. The order must contain an agency statement of the relevant facts and the reasons for the agency's action. The agency shall grant or deny a variance petition as soon as practicable, and within 60 days of receipt of the completed petition, unless the petitioner agrees to a later date. Failure of the agency to act on a petition within 60 days constitutes approval of the petition.\nWithin five days of issuing a variance order, the agency shall send the order to the petitioner and to any other person entitled to notice under other law.\nAn agency shall maintain a record of all orders granting and denying variances under section 14.055. The records must be indexed by rule and be available for public inspection to the extent provided in chapter 13.",
	"repealed": false
}