{
	"id": "144.6512",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6512",
	"title": "144.6512 RETALIATION IN NURSING HOMES PROHIBITED.",
	"text": "For the purposes of this section:\n(1) \"nursing home\" means a facility licensed as a nursing home under chapter 144A; and\n(2) \"resident\" means a person residing in a nursing home.\nA nursing home or agent of a nursing home may not retaliate against a resident or employee if the resident, employee, or any person acting on behalf of the resident:\n(1) files a good faith complaint or grievance, makes a good faith inquiry, or asserts any right;\n(2) indicates a good faith intention to file a complaint or grievance, make an inquiry, or assert any right;\n(3) files, in good faith, or indicates an intention to file a maltreatment report, whether mandatory or voluntary, under section 626.557;\n(4) seeks assistance from or reports a reasonable suspicion of a crime or systemic problems or concerns to the administrator or manager of the nursing home, the Office of Ombudsman for Long-Term Care, a regulatory or other government agency, or a legal or advocacy organization;\n(5) advocates or seeks advocacy assistance for necessary or improved care or services or enforcement of rights under this section or other law;\n(6) takes or indicates an intention to take civil action;\n(7) participates or indicates an intention to participate in any investigation or administrative or judicial proceeding;\n(8) contracts or indicates an intention to contract to receive services from a service provider of the resident's choice other than the nursing home; or\n(9) places or indicates an intention to place a camera or electronic monitoring device in the resident's private space as provided under section 144.6502.\nFor purposes of this section, to retaliate against a resident includes but is not limited to any of the following actions taken or threatened by a nursing home or an agent of the nursing home against a resident, or any person with a familial, personal, legal, or professional relationship with the resident:\n(1) a discharge or transfer;\n(2) any form of discrimination;\n(3) restriction or prohibition of access:\n(i) of the resident to the nursing home or visitors; or\n(ii) of a family member or a person with a personal, legal, or professional relationship with the resident, to the resident, unless the restriction is the result of a court order;\n(4) the imposition of involuntary seclusion or the withholding of food, care, or services;\n(5) restriction of any of the rights granted to residents under state or federal law;\n(6) restriction or reduction of access to or use of amenities, care, services, privileges, or living arrangements; or\n(7) unauthorized removal, tampering with, or deprivation of technology, communication, or electronic monitoring devices.\nFor purposes of this section, to retaliate against an employee means any of the following actions taken by the nursing home or an agent of the nursing home against an employee:\n(1) unwarranted discharge or transfer;\n(2) unwarranted demotion or refusal to promote;\n(3) unwarranted reduction in compensation, benefits, or privileges;\n(4) the unwarranted imposition of discipline, punishment, or a sanction or penalty; or\n(5) any form of unwarranted discrimination.\nA resident may request that the commissioner determine whether the facility retaliated against a resident. If a resident demonstrates to the commissioner that the facility took any action described in subdivision 3 within 30 days of an initial action described in subdivision 2, the facility must present evidence to the commissioner of the nonretaliatory reason relied on by the facility for the facility action. Based on the evidence provided by both parties, the commissioner shall determine if retaliation occurred.\nNothing in this section affects the rights and remedies available under section 626.557, subdivisions 10, 17, and 20.",
	"repealed": false
}