{
	"id": "289A.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.50",
	"title": "289A.50 CLAIMS FOR REFUNDS.",
	"text": "(a) Subject to the requirements of this section and section 289A.40, a taxpayer who has paid a tax in excess of the taxes lawfully due and who files a written claim for refund will be refunded or credited the overpayment of the tax determined by the commissioner to be erroneously paid.\n(b) The claim must specify the name of the taxpayer, the date when and the period for which the tax was paid, the kind of tax paid, the amount of the tax that the taxpayer claims was erroneously paid, the grounds on which a refund is claimed, and other information relative to the payment and in the form required by the commissioner. An income tax, estate tax, or corporate franchise tax return, or amended return claiming an overpayment constitutes a claim for refund.\n(c) When, in the course of an examination, and within the time for requesting a refund, the commissioner determines that there has been an overpayment of tax, the commissioner shall refund or credit the overpayment to the taxpayer and no demand is necessary. If the overpayment exceeds $1, the amount of the overpayment must be refunded to the taxpayer. If the amount of the overpayment is less than $1, the commissioner is not required to refund. In these situations, the commissioner does not have to make written findings or serve notice by mail to the taxpayer.\n(d) If the amount allowable as a credit for withholding, estimated taxes, or dependent care exceeds the tax against which the credit is allowable, the amount of the excess is considered an overpayment. The refund allowed by section 290.06, subdivision 23, is also considered an overpayment. The requirements of section 270C.33 do not apply to the refunding of such an overpayment shown on the original return filed by a taxpayer.\n(e) If the entertainment tax withheld at the source exceeds by $1 or more the taxes, penalties, and interest reported in the return of the entertainment entity or imposed by section 290.9201, the excess must be refunded to the entertainment entity. If the excess is less than $1, the commissioner need not refund that amount.\n(f) If the surety deposit required for a construction contract exceeds the liability of the out-of-state contractor, the commissioner shall refund the difference to the contractor.\n(g) An action of the commissioner in refunding the amount of the overpayment does not constitute a determination of the correctness of the return of the taxpayer.\n(h) There is appropriated from the general fund to the commissioner of revenue the amount necessary to pay refunds allowed under this section.\nOn or before January 1, 2000, the commissioner of revenue shall prepare and make available to taxpayers a form for filing claims for refund of taxes paid in excess of the amount due. The commissioner may require corporate franchise taxpayers claiming a refund of corporate franchise taxes paid in excess of the amount lawfully due to include on the claim for refund or amended return information necessary for payment of the taxes paid in excess of taxes lawfully due by electronic means.\n(a) If a vendor has collected from a purchaser and remitted to the state a tax on a transaction that is not subject to the tax imposed by chapter 297A, the tax is refundable to the vendor only if and to the extent that the tax and any interest earned on the tax is credited to amounts due to the vendor by the purchaser or returned to the purchaser by the vendor.\n(b) In addition to the requirements of subdivision 1, a claim for refund under this subdivision must state in writing that the tax and interest earned on the tax has been or will be refunded or credited to the purchaser by the vendor.\n(c) Within 60 days after the date the commissioner issues the refund, any amount not refunded or credited to the purchaser by the vendor, as required by paragraph (a), must be returned to the commissioner by the vendor.\n(d) After the commissioner refunds the tax and interest to the vendor, if the commissioner determines that the vendor did not refund or credit the tax and interest as provided in this subdivision, or did not return the amount required to be returned under paragraph (c), the commissioner may assess the vendor for underpayment of tax and interest equal to that portion of the amount that was not refunded or credited to the purchaser. The assessment bears interest which is computed at the rate specified in section 270C.40, subdivision 5, on the unpaid amount from the date the commissioner issues the refund until the date the amount is paid to the commissioner. The assessment may be made at any time within 3-1/2 years after the commissioner refunds the tax and interest to the vendor. If part of the refund was induced by fraud or misrepresentation of a material fact, the assessment may be made at any time.\n(a) If a vendor has collected from a purchaser a tax on a transaction that is not subject to the tax imposed by chapter 297A, the purchaser may apply directly to the commissioner for a refund under this section if:\n(1) the purchaser is currently registered or was registered during the period of the claim, to collect and remit the sales tax or to remit the use tax; and\n(2) either\n(i) the amount of the refund to be applied for exceeds $500, or\n(ii) the amount of the refund to be applied for does not exceed $500, but the purchaser also applies for a capital equipment claim at the same time, and the total of the two refunds exceeds $500.\n(b) The purchaser may not file more than two applications for refund under this subdivision in a calendar year.\n(c) Refunds shall not be issued for sales for resale where the vendor has a published no resale policy.\nA certified service provider, as defined in section 297A.995, subdivision 2, may claim on behalf of a taxpayer that is its client any bad debt allowance provided by section 297A.81. The certified service provider must credit or refund to its client the full amount of any bad debt allowance or refund received.\n(a) If a vendor has collected from a purchaser a tax on a transaction that is not subject to the tax imposed by chapter 297A, the purchaser may seek from the vendor a return of over-collected sales or use taxes as follows:\n(1) the purchaser must provide written notice to the vendor;\n(2) the notice to the vendor must contain the information necessary to determine the validity of the request; and\n(3) no cause of action against the vendor accrues until the vendor has had 60 days to respond to the written notice.\n(b) In connection with a purchaser's request from a vendor of over-collected sales or use taxes, a vendor is presumed to have a reasonable business practice, if in the collection of such sales or use taxes, the vendor: (1) uses a certified service provider as defined in section 297A.995, a certified automated system, as defined in section 297A.995, or a proprietary system that is certified by the state; and (2) has remitted to the state all taxes collected less any deductions, credits, or collection allowances.\nWhen there is an overpayment of withholding tax by an employer or a person making royalty payments, or an overpayment of entertainer withholding tax by the payor, a refund allowable under this section is limited to the amount of the overpayment that was not deducted and withheld from employee wages or from the royalty payments, or from the compensation of an entertainer.\nWhen there is an overpayment of nonresident withholding tax by a partnership or S corporation, a refund allowable under this section to the payor is limited to the amount of the overpayment that was not deducted and withheld from the shares of the payor's partners or shareholders.\nThe commissioner shall determine the amount of refund, if any, that is due, and notify the taxpayer of the determination as soon as practicable after a claim has been filed.\nIf the commissioner determines that the address provided by the taxpayer to claim a refund is invalid or is no longer the current address of the taxpayer, then the date of the mailing of the notification provided under this subdivision is considered the date that the refund is paid for purposes of the payment of interest under section 289A.56 and is considered the date of issuance of the original warrant or check for purposes of issuing a new warrant or check under section 270C.347.\n(a) If a court of this state finds that a person obligated to pay child support or maintenance is delinquent in making payments, the amount of child support or maintenance unpaid and owing, including attorney fees and costs incurred in ascertaining or collecting child support or maintenance, must be withheld from a refund due the person under chapter 290. The public agency responsible for child support enforcement or the parent or guardian of a child for whom the support, attorney fees, and costs are owed or the party to whom maintenance, attorney fees, and costs are owed may petition the district court for an order providing for the withholding of the amount of child support, maintenance, attorney fees, and costs unpaid and owing as determined by court order. The person from whom the refund may be withheld must be notified of the petition under the Rules of Civil Procedure before the issuance of an order under this subdivision. The order may be granted on a showing to the court that required support or maintenance payments, attorney fees, and costs have not been paid when they were due.\n(b) On order of the court, the commissioner shall withhold the money from the refund due to the person obligated to pay the child support or maintenance. The amount withheld shall be remitted to the public agency responsible for child support enforcement, the parent or guardian petitioning on behalf of the child, or the party to whom maintenance is owed, after any delinquent tax obligations of the taxpayer owed to the revenue department have been satisfied and after deduction of the fee prescribed in section 270A.07, subdivision 1. An amount received by the responsible public agency, or the petitioning parent or guardian, or the party to whom maintenance is owed, in excess of the amount of public assistance spent for the benefit of the child to be supported, or the amount of any support, maintenance, attorney fees, and costs that had been the subject of the claim under this subdivision that has been paid by the taxpayer before the diversion of the refund, must be paid to the person entitled to the money. If the refund is based on a joint return, the part of the refund that must be paid to the petitioner is the proportion of the total refund that equals the proportion of the total federal adjusted gross income of the spouses that is the federal adjusted gross income of the spouse who is delinquent in making the child support or maintenance payments.\n(c) A petition filed under this subdivision remains in effect with respect to any refunds due under this section until the support or maintenance, attorney fees, and costs have been paid in full or the court orders the commissioner to discontinue withholding the money from the refund due the person obligated to pay the support or maintenance, attorney fees, and costs. If a petition is filed under this subdivision concerning child support and a claim is made under chapter 270A with respect to the individual's refund and notices of both are received before the time when payment of the refund is made on either claim, the claim relating to the liability that accrued first in time must be paid first. The amount of the refund remaining must then be applied to the other claim.\n[Repealed, 1998 c 389 art 6 s 20]\n(a) If the taxpayer is notified by the commissioner that the refund claim is denied in whole or in part, the taxpayer may:\n(1) file an administrative appeal as provided in section 270C.35, or an appeal with the Tax Court, within 60 days after the notice date of the commissioner's notice of denial; or\n(2) file an action in the district court to recover the refund.\n(b) An action in the district court on a denied claim for refund must be brought within 18 months of the notice date of the denial of the claim by the commissioner. For the purposes of this section, \"notice date\" has the meaning given in section 270C.35, subdivision 3.\n(c) No action in the district court or the Tax Court shall be brought within six months of the filing of the refund claim unless the commissioner denies the claim within that period.\n(d) If a taxpayer files a claim for refund and the commissioner has not issued a denial of the claim, the taxpayer may bring an action in the district court or the Tax Court at any time after the expiration of six months from the time the claim was filed.\n(e) The commissioner and the taxpayer may agree to extend the period for bringing an action in the district court.\n(f) An action for refund of tax by the taxpayer must be brought in the district court of the district in which lies the county of the taxpayer's residence or principal place of business. In the case of an estate or trust, the action must be brought at the principal place of its administration. Any action may be brought in the district court for Ramsey County.\nIf money has been erroneously collected from a taxpayer or other person, the commissioner shall, within the period named in section 289A.40 for filing a claim for refund, and, subject to the provisions of chapter 270A, section 270C.64, and this section, grant a refund to that taxpayer or other person.\nNotwithstanding any other law, within one year after a decision of the Tax Court upholding an assessment of the commissioner of revenue becomes final, if the taxpayer has paid the assessment in full, plus interest calculated by the commissioner, the taxpayer may petition the Tax Court to reopen the case solely for a determination that the interest paid exceeds the interest legally due, and if so, the amount of the overpayment. A determination of overpayment of interest under this subdivision is a determination of overpayment of tax under section 271.12, and is reviewable in the same manner as any other decision of the Tax Court.\n(a) If an addition to federal taxable income under section 290.0131, subdivision 2, is judicially determined to discriminate against interstate commerce with respect to obligations of a certain character or type, the legislature intends that the discrimination be remedied by adding to federal taxable income interest on comparable obligations of Minnesota governmental units and Indian tribes. For purposes of this subdivision, \"comparable obligation\" means obligations of the character or type that the court found to be unconstitutionally favored by section 290.0131, subdivision 2, whether based on the security for payment, use of the proceeds, or any other factor identified as determinative by the court.\n(b) This subdivision applies beginning with the taxable years that begin during the calendar year in which the court's decision is final. Other remedies apply for previous taxable years.",
	"repealed": false
}