{
	"id": "216B.097",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.097",
	"title": "216B.097 COLD WEATHER RULE; COOPERATIVE OR MUNICIPAL UTILITY.",
	"text": "(a) A municipal utility or a cooperative electric association must not disconnect and must reconnect the utility service of a residential customer during the period between October 1 and April 30 if the disconnection affects the primary heat source for the residential unit and all of the following conditions are met:\n(1) The household income of the customer is at or below 50 percent of the state median household income. A municipal utility or cooperative electric association utility may (i) verify income on forms it provides or (ii) obtain verification of income from the local energy assistance provider. A customer is deemed to meet the income requirements of this clause if the customer receives any form of public assistance, including energy assistance, that uses an income eligibility threshold set at or below 50 percent of the state median household income.\n(2) A customer enters into and makes reasonably timely payments under a payment agreement that considers the financial resources of the household.\n(3) A customer receives referrals to energy assistance, weatherization, conservation, or other programs likely to reduce the customer's energy bills.\n(b) A municipal utility or a cooperative electric association must, between August 15 and October 1 each year, notify all residential customers of the provisions of this section.\n(a) Before disconnecting service to a residential customer during the period between October 1 and April 30, a municipal utility or cooperative electric association must provide the following information to a customer:\n(1) a notice of proposed disconnection;\n(2) a statement explaining the customer's rights and responsibilities;\n(3) a list of local energy assistance providers;\n(4) forms on which to declare inability to pay; and\n(5) a statement explaining available time payment plans and other opportunities to secure continued utility service.\n(b) At the same time that notice is given under paragraph (a), the utility must also give written or electronic notice of the proposed disconnection to the local energy assistance provider and the department.\n(a) If a residential customer must be involuntarily disconnected remotely using advanced metering infrastructure or physically at the property being disconnected between October 1 and April 30 for failure to comply with subdivision 1, the disconnection must not occur:\n(1) on a Friday, unless the customer declines to enter into a payment agreement offered that day in person or via personal contact by telephone by a municipal utility or cooperative electric association;\n(2) on a weekend, holiday, or the day before a holiday;\n(3) when utility offices are closed; or\n(4) after the close of business on a day when disconnection is permitted, unless a field representative of a municipal utility or cooperative electric association who is authorized to enter into a payment agreement, accept payment, and continue service, offers a payment agreement to the customer.\nFurther, the disconnection must not occur until at least 30 days after the notice required in subdivision 2 has been mailed to the customer or 15 days after the notice has been personally delivered to the customer.\n(b) The customer must not be disconnected until the utility attempts to confirm whether the residential unit is actually occupied, which the utility may accomplish by:\n(1) visiting the residential unit; or\n(2) examining energy usage data obtained through advanced metering infrastructure to determine whether there is energy usage over at least a 24-hour period that indicates occupancy.\n(c) A utility may not disconnect a residential customer who is in compliance with section 216B.098, subdivision 5.\n(d) If, prior to disconnection, a customer appeals a notice of involuntary disconnection, as provided by the utility's established appeal procedure, the utility must not disconnect until the appeal is resolved.\n(e) For the purposes of this section, \"advanced metering infrastructure\" means an integrated system of smart meters, communication networks, and data management systems that enables two-way communication between a utility and its customers.\nFor the purposes of this section, \"disconnection\" includes a service or load limiter or any device that limits or interrupts electric service in any way.\nA municipal utility or cooperative electric association may recover the reasonable costs of disconnecting and reconnecting a residential customer, based on the costs of providing notice to the customer and other entities and whether the process was accomplished physically at the property being disconnected or reconnected or remotely using advanced metering infrastructure.",
	"repealed": false
}