{
	"id": "458A.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.27",
	"title": "458A.27 EXECUTIVE DIRECTOR.",
	"text": "The executive director of the authority shall be responsible for the custody and control of all moneys received and collected from the operations of the bus transportation system provided for in sections 458A.21 to 458A.37 until such moneys are delivered to the city treasurer and the executive director shall have obtained a receipt therefor, or until such moneys are deposited in a bank account under the control of the city treasurer, subject, however, to the right of the city council, by resolution, to enter into a management contract under terms and conditions different from those provided for in this section.\nThe executive director shall give bond in favor of the city of Duluth in a sum equal to twice the amount of money which the executive director will probably handle at any time during any one year, that amount to be determined annually by the authority; such bond to be conditioned upon the faithful discharge of the executive director's official duties, and approved as to form, correctness and validity by the city attorney, and filed with the city auditor. Premiums for such bonds shall be paid for out of the funds of the Duluth Transit Authority. In addition, the authority may require bonds in favor of the city of Duluth for any other of its employees, in such amount, and with such surety or sureties, as it may deem necessary and proper for the protection of the city. Premiums for any such bonds shall be paid for out of funds of the Duluth Transit Authority. The authority shall, in addition to other insurance provisions of sections 458A.21 to 458A.37, provide for insurance on any of its property, rights, revenue, workers' compensation, public liability, or any other risk or hazard arising from its activities; and the premiums for any such insurance shall be paid for out of funds of the Duluth Transit Authority.",
	"repealed": false
}