{
	"id": "245.4661",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4661",
	"title": "245.4661 ADULT MENTAL HEALTH INITIATIVE SERVICES.",
	"text": "Each county board, county boards acting jointly, or tribal government must provide or contract for sufficient infrastructure for the delivery of mental health services under the Minnesota Comprehensive Adult Mental Health Act, sections 245.461 to 245.486.\nAdult mental health initiatives shall be responsible for designing, planning, improving, and maintaining a mental health service delivery system for adults with serious and persistent mental illness that would:\n(1) provide an expanded array of services from which clients can choose services appropriate to their needs;\n(2) be based on purchasing strategies that improve access and coordinate services without cost shifting;\n(3) prioritize evidence-based services and implement services that are promising practices or theory-based practices so that the service can be evaluated according to subdivision 5a;\n(4) incorporate existing state facilities and resources into the community mental health infrastructure through creative partnerships with local vendors; and\n(5) utilize existing categorical funding streams and reimbursement sources in combined and creative ways, except appropriations and all funds that are attributable to the operation of state-operated services under the control of the Direct Care and Treatment executive board are excluded unless appropriated specifically by the legislature for a purpose consistent with this section.\nEvaluation of each adult mental health initiative will be based on outcome evaluation criteria determined by the commissioners of human services and management and budget after consultation with stakeholders.\nEach adult mental health initiative may be discontinued for any reason by the managing entity or the commissioner of human services, after 90 days' written notice to the other party.\nEach local plan for adult mental health initiative services must be developed under the direction of the county board, or multiple county boards acting jointly, as the local mental health authority. The planning process for each adult mental health initiative shall include, but not be limited to, mental health consumers, families, advocates, local mental health advisory councils, local and state providers, representatives of state and local public employee bargaining units, and the department of human services. As part of the planning process, the county board or boards shall designate a managing entity responsible for receipt of funds and management of adult mental health initiatives.\nThe commissioner of management and budget, in consultation with the commissioner of human services and within available appropriations, shall create and maintain an inventory of adult mental health initiative services administered by the county boards, identifying evidence-based services and services that are theory-based or promising practices. The commissioner of management and budget, in consultation with the commissioner of human services, shall select adult mental health initiative services that are promising practices or theory-based activities for which the commissioner of management and budget shall conduct evaluations using experimental or quasi-experimental design. The commissioner of human services, in consultation with the commissioner of management and budget, shall encourage county boards to administer adult mental health initiative services to support experimental or quasi-experimental evaluation and shall require county boards to collect and report information that is needed to complete the inventory and evaluation for any adult mental health initiative service that is selected for an evaluation. The commissioner of management and budget, under section 15.08, may obtain additional relevant data to support the inventory and the experimental or quasi-experimental evaluation studies.\n(a) For purposes of adult mental health initiatives, the commissioner shall facilitate integration of funds or other resources as needed and requested by each adult mental health initiative. These resources may include:\n(1) community support services funds administered under Minnesota Rules, parts 9535.1700 to 9535.1760;\n(2) other mental health special project funds;\n(3) medical assistance, MinnesotaCare, and housing support under chapter 256I if requested by the adult mental health initiative's managing entity and if the commissioner determines this would be consistent with the state's overall health care reform efforts; and\n(4) regional treatment center resources, with consent from the Direct Care and Treatment executive board.\n(b) The commissioner shall consider the following criteria in awarding grants for adult mental health initiatives:\n(1) the ability of the initiatives to accomplish the objectives described in subdivision 2;\n(2) the size of the target population to be served; and\n(3) geographical distribution.\n(c) The commissioner shall review overall status of the initiatives at least every two years and recommend any legislative changes needed by January 15 of each odd-numbered year.\n(d) The commissioner may waive administrative rule requirements that are incompatible with the implementation of the adult mental health initiative.\n(e) The commissioner may exempt the participating counties from fiscal sanctions for noncompliance with requirements in laws and rules that are incompatible with the implementation of the adult mental health initiative.\n(f) The commissioner may award grants to an entity designated by a county board or group of county boards to pay for start-up and implementation costs of the adult mental health initiative.\nThe adult mental health initiative board, or other entity which is approved to administer an adult mental health initiative, shall:\n(1) administer the initiative in a manner that is consistent with the objectives described in subdivision 2 and the planning process described in subdivision 5;\n(2) assure that no one is denied services that they would otherwise be eligible for; and\n(3) provide the commissioner of human services with timely and pertinent information through the following methods:\n(i) submission of mental health plans and plan amendments which are based on a format and timetable determined by the commissioner;\n(ii) submission of social services expenditure and grant reconciliation reports, based on a coding format to be determined by mutual agreement between the initiative's managing entity and the commissioner; and\n(iii) submission of data and participation in an evaluation of the adult mental health initiatives, to be designed cooperatively by the commissioner and the initiatives.\nMS 2020 [Repealed, 2022 c 99 art 1 s 49]\n(a) The following three distinct grant programs are funded under this section:\n(1) mental health crisis services;\n(2) housing with supports for adults with serious mental illness; and\n(3) projects for assistance in transitioning from homelessness (PATH program).\n(b) In addition, the following are eligible for grant funds:\n(1) community education and prevention;\n(2) client outreach;\n(3) early identification and intervention;\n(4) adult outpatient diagnostic assessment and psychological testing;\n(5) peer support services;\n(6) community support program services (CSP);\n(7) adult residential crisis stabilization;\n(8) supported employment;\n(9) assertive community treatment (ACT);\n(10) housing subsidies;\n(11) basic living, social skills, and community intervention;\n(12) emergency response services;\n(13) adult outpatient psychotherapy;\n(14) adult outpatient medication management;\n(15) adult mobile crisis services;\n(16) adult day treatment;\n(17) partial hospitalization;\n(18) adult residential treatment;\n(19) adult mental health targeted case management; and\n(20) transportation.\n(a) By November 1, 2016, and biennially thereafter, the commissioner of human services shall provide sufficient information to the members of the legislative committees having jurisdiction over mental health funding and policy issues to evaluate the use of funds appropriated under this section. The commissioner shall provide, at a minimum, the following information:\n(1) the amount of funding to adult mental health initiatives, what programs and services were funded in the previous two years, gaps in services that each initiative brought to the attention of the commissioner, and outcome data for the programs and services that were funded; and\n(2) the amount of funding for other targeted services and the location of services.\n(b) This subdivision expires January 1, 2032.\nWhen implementing the funding formula to distribute adult mental health initiative funds, the commissioner shall ensure that no adult mental health initiative region receives less than the amount the region received in fiscal year 2022 in combined adult mental health initiative funding.",
	"repealed": false
}