{
	"id": "375.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.18",
	"title": "375.18 GENERAL POWERS.",
	"text": "Each county board may examine and settle all accounts of the receipts and expenses of the county, and examine, settle, and allow all accounts, demands, and causes of action against the county, and, when so settled, issue county orders for them, as provided by law.\nFor purposes of this section, a \"county administrative official\" shall mean a county auditor, treasurer, auditor-treasurer, administrator, coordinator, manager, a clerk/administrator, or a senior fiscal officer.\nA county board, at its discretion, may delegate its authority to pay certain claims made against the county to a county administrative official. County boards opting to delegate their authority to review claims before payment pursuant to this subdivision shall have internal accounting and administrative control procedures to ensure the proper disbursement of public funds. The procedures shall include regular and frequent review of the county administrative officials' actions by the board. A list of all claims paid under the procedures established by the county board shall be presented to the board for informational purposes only at the next regularly scheduled meeting after payment of the claim. A county board that delegates its authority to pay certain claims made against the county must adopt a resolution authorizing a specified county administrative official to pay the claims that meet the standards and procedures established by the board. This subdivision does not apply to a home rule charter county for which the county charter provides an alternative method for paying claims made against the county.\nNotwithstanding any law to the contrary, a county board, at its discretion, and upon approval by the Department of Human Services, may implement a client-directed support program that authorizes responsible parties for county human services and public health clients to expend public funds for the benefit of the clients without complying with subdivision 1b or section 384.13, 471.38, or 471.391. County boards opting to implement the program according to this subdivision must have internal accounting and administrative control procedures to ensure proper disbursement of public funds. The procedures must include county-owned demand deposit accounts and periodic review of the program by the county board.\nEach county board may have the care of the county property, and management of the county funds and business, except in cases otherwise provided for, and make orders concerning them as it deems expedient.\nEach county board may erect, furnish, and maintain a suitable courthouse. No indebtedness shall be created for a courthouse in excess of an amount equal to a levy of 0.04030 percent of estimated market value without the approval of a majority of the voters of the county voting on the question of issuing the obligation at an election.\nMS 1984 [Repealed, 1985 c 169 s 18]\nMS 1984 [Repealed, 1985 c 169 s 18]\nMS 1984 [Repealed, 1985 c 169 s 18]\nEach county board may transfer by a majority vote any surplus beyond the needs of the current year in any county fund to any other county fund to supply a deficiency in it.\nEach county board may appropriate to any county agricultural society of its county, which is a member of the state agricultural society, or to any farm improvement association organized by the citizens of two or more counties jointly to advance the agricultural interest of each of the counties, a sum of money not exceeding $1,000 each, annually. In any county where two county agricultural societies are members of the state agricultural society any appropriation so made shall be divided equally between them. In addition to the appropriation referred to above, if a county owns grounds and buildings used for agricultural fairs and other purposes, the county board, by a majority vote, may appropriate annually a sum of money equal to ten percent of the total value of the property to the association or society having the management, control, and direction of agricultural fairs held there, to repair, maintain, improve, extend and alter the grounds and buildings.\nEach county board may purchase or condemn land, with improvements on it, to hold agricultural fairs and exhibitions and appropriate money to pay for it, not exceeding $25,000. The county board may purchase or condemn land for holding fairs and exhibitions and appropriate money in payment for it in excess of $25,000 when authorized by a vote of the people. It may accept and receive a donation to be used to obtain lands for the purpose of holding agricultural fairs and exhibitions and in that case and for that purpose, without being authorized by a vote of the people, it may purchase or condemn lands not exceeding in value the amount of the donation; improve and erect structures on the lands, for which they may receive donations of money, materials or labor. It may lease the land from time to time to agricultural and other societies of similar nature and establish reasonable rules and regulations under which it may be used by the societies in the county. All structures and improvements made on the land by societies using it shall belong to the county.\nAll proceedings for the condemnation of the lands shall be under the provisions of chapter 117.\nEach county board may appropriate funds to erect or aid in erecting a monument or other memorial to the soldiers and sailors of the nation to be constructed in the county.\nEach county board may authorize by resolution any person, company, or corporation to construct and maintain railway lines to be operated by other than steam power upon any public road outside of cities not boulevarded or parked, for a period not exceeding 25 years, upon the terms as to use and occupation prescribed in the resolution. The use granted shall not interfere with the reasonable use of the road as a highway, and shall cease in case of the vacation of the road, unless proceedings to condemn are taken within six months after the vacation and diligently prosecuted. The railway and its property shall be subject to taxation by the methods and at the rate as the proper authorities may from time to time prescribe in accordance with law.\nEach county board may acquire by gift or purchase and improve land within the county, for use as a park, site for a building, or other public purpose, and, when required by the public interest, sell and convey it. The land may be paid for out of moneys in the county treasury not otherwise appropriated, or by issuing bonds of the county. The county board may acquire development rights in the form of a conservation easement under chapter 84C. The holder of the conservation easement may be determined by a governmental body.\nEach county board may exercise the other powers conferred upon it by law.\nEach county board may by ordinance:\n(1) prohibit the deposit of solid waste within the county not otherwise authorized by law;\n(2) require the owners or occupants of property to remove the unauthorized deposit of solid waste;\n(3) if it is not removed, provide for removal of the solid waste at the owner's or occupant's expense; and\n(4) provide for the expense to be a lien on the property and collected as a special assessment.\nA county board may also seek civil penalties and damages from persons responsible for unauthorized deposit of solid waste under section 115A.99, which, if unpaid, may be imposed as a lien on property owned by the responsible persons and collected as a special assessment.\nEach county board may appropriate county funds to and contract with a community action agency designated under section 142F.301 and located within the county. The money appropriated shall be spent for authorized purposes of the community action agency and as the county board may, by resolution, provide. A contract may be for the purchase, lease, sale or other acquisition or disposition of equipment, supplies, materials, or other property, including real property. The contract is not subject to statutory or ordinance provisions requiring public bidding or third-party intermediaries for the transfer of property.",
	"repealed": false
}