{
	"id": "245D.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.051",
	"title": "245D.051 PSYCHOTROPIC MEDICATION USE AND MONITORING.",
	"text": "(a) When a person is prescribed a psychotropic medication and the license holder is assigned responsibility for administration of the medication in the person's support plan or the support plan addendum, the license holder must ensure that the requirements in section 245D.05, subdivision 2, are met.\n(b) The license holder must develop, implement, and maintain the following documentation in the person's support plan addendum according to the requirements in sections 245D.07 and 245D.071:\n(1) a description of the target symptoms that the psychotropic medication is to alleviate; and\n(2) documentation methods the license holder will use to monitor and measure changes in the target symptoms that are to be alleviated by the psychotropic medication if required by the prescriber. The license holder must collect and report on medication and symptom-related data as instructed by the prescriber. The license holder must provide the monitoring data to the expanded support team for review every three months, or as otherwise requested by the person or the person's legal representative.\nFor the purposes of this section, \"target symptom\" refers to any perceptible diagnostic criteria for a person's diagnosed mental disorder, as defined by the Diagnostic and Statistical Manual of Mental Disorders Fourth Edition Text Revision (DSM-IV-TR) or successive editions, that has been identified for alleviation.\nIf the person or the person's legal representative refuses to authorize the administration of a psychotropic medication as ordered by the prescriber, the license holder must not administer the medication. The refusal to authorize medication administration must be reported to the prescriber as expediently as possible. After reporting the refusal to the prescriber, the license holder must follow any directives or orders given by the prescriber. A refusal may not be overridden without a court order. Refusal to authorize administration of a specific psychotropic medication is not grounds for service termination and does not constitute an emergency. A decision to terminate services must be reached in compliance with section 245D.10, subdivision 3.",
	"repealed": false
}