{
	"id": "179A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.04",
	"title": "179A.04 COMMISSIONER'S POWER, AUTHORITY, AND DUTIES.",
	"text": "The commissioner shall accept and investigate all petitions for:\n(1) certification or decertification as the exclusive representative of an appropriate unit;\n(2) mediation services;\n(3) any election or other voting procedures provided for in sections 179A.01 to 179A.25;\n(4) certification to arbitration; and\n(5) fair share fee challenges, upon the receipt of a filing fee. The commissioner shall hear and decide all issues in a fair share fee challenge.\nThe commissioner shall determine appropriate units, under the criteria of section 179A.09.\n(a) The commissioner shall:\n(1) provide mediation services as requested by the parties until the parties reach agreement, and may continue to assist parties after they have submitted their final positions for interest arbitration;\n(2) issue notices, subpoenas, and orders required by law to carry out duties under sections 179A.01 to 179A.25;\n(3) assist the parties in formulating petitions, notices, and other papers required to be filed with the commissioner or the board;\n(4) conduct elections;\n(5) certify the final results of any election or other voting procedure conducted under sections 179A.01 to 179A.25;\n(6) adopt rules relating to the administration of this chapter and the conduct of hearings and elections;\n(7) receive, catalogue, file, and make available to the public all decisions of arbitrators and panels authorized by sections 179A.01 to 179A.25, all grievance arbitration decisions to the extent the decision is public under section 13.43, subdivision 2, paragraph (b), and the commissioner's orders and decisions;\n(8) adopt, subject to chapter 14, a grievance procedure that fulfills the purposes of section 179A.20, subdivision 4, that is available to any employee in a unit not covered by a contractual grievance procedure;\n(9) maintain a schedule of state employee classifications or positions assigned to each unit established in section 179A.10, subdivision 2;\n(10) collect fees established by rule for empanelment of persons on the labor arbitrator roster maintained by the commissioner or in conjunction with fair share fee challenges. Arbitrator application fees will be $100 per year for initial applications and renewals effective July 1, 2007;\n(11) provide technical support and assistance to voluntary joint labor-management committees established for the purpose of improving relationships between exclusive representatives and employers, at the discretion of the commissioner;\n(12) provide to the parties a list of arbitrators as required by section 179A.16, subdivision 4;\n(13) maintain a list of up to 60 arbitrators for referral to employers and exclusive representatives for the resolution of grievance or interest disputes. Each person on the list must be knowledgeable about collective bargaining and labor relations in the public sector, well versed in state and federal labor law, and experienced in and knowledgeable about labor arbitration. To the extent practicable, the commissioner shall appoint members to the list so that the list is gender and racially diverse; and\n(14) upon request of the board, provide administrative support and other assistance to the board, including assistance in development and adoption of board rules.\n(b) From the names provided by representative organizations, the commissioner shall maintain a list of arbitrators to conduct teacher discharge or termination hearings according to section 122A.40 or 122A.41. The persons on the list must meet at least one of the following requirements:\n(1) be a former or retired judge;\n(2) be a qualified arbitrator on the list maintained by the bureau;\n(3) be a present, former, or retired administrative law judge; or\n(4) be a neutral individual who is learned in the law and admitted to practice in Minnesota, who is qualified by experience to conduct these hearings, and who is without bias to either party.\nEach year, Education Minnesota shall provide a list of up to 14 names and the Minnesota School Boards Association a list of up to 14 names of persons to be on the list. The commissioner may adopt rules about maintaining and updating the list.\nHearings and mediation meetings authorized by this section shall be held at a time and place determined by the commissioner, but, whenever practical, a hearing shall be held in the general geographic area where the question has arisen or exists.",
	"repealed": false
}