{
	"id": "61B.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/61B.22",
	"title": "61B.22 BOARD OF DIRECTORS.",
	"text": "The board of directors of the association consists of nine member insurers serving terms as established in the plan of operation under section 61B.25. The insurer board members must be elected by member insurers, subject to the approval of the commissioner, for the terms of office specified in their nominations. Each elected insurer board member shall designate its representative and may designate an alternate. Vacancies on the board shall be filled for the remaining period of the term by a majority vote of the remaining board members, subject to approval of the commissioner. In approving selections or in appointing insurer board members, the commissioner shall consider whether all member insurers are fairly represented.\nMembers of the board may be reimbursed from the assets of the association for reasonable and necessary expenses incurred by them as members of the board, but shall not otherwise be compensated by the association for their services.\nExcept as otherwise required under the plan of operation:\n(a) The board of directors may designate three or more directors as an executive committee, which, to the extent determined by unanimous affirmative action of the entire board, has and shall exercise the authority of the board in the management of the business of the association. This executive committee shall act only in the interval between meetings of the board, and is subject at all times to the control and direction of the board.\n(b) The board of directors may create additional committees, which have and shall exercise the specific authority and responsibility as determined by the unanimous affirmative action of the entire board.\n(c) Any action that may be taken at a meeting of the board of directors or of a lawfully constituted executive committee may be taken without a meeting if authorized by a writing or writings signed by all the directors or by all of the members of the committee, as the case may be. This action is effective on the date on which the last signature is placed on the writing or writings, or on an earlier effective date established in the writing or writings.\n(d) Members of the board of directors or of a lawfully constituted executive committee may participate in a meeting of the board or committee by means of conference telephone or similar communications equipment through which all persons participating in the meeting can hear each other. Participation in a meeting as provided in this paragraph constitutes presence in person at the meeting.\nBoard meetings are not subject to chapter 13D.",
	"repealed": false
}