{
	"id": "327.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.76",
	"title": "327.76 INNKEEPER'S LIEN.",
	"text": "An innkeeper shall have a lien upon the valuables, baggage or other property of a guest brought into the innkeeper's hotel, for the proper charges due on account of the guest's accommodation, board, room and lodging, for all money paid out for or advanced to the guest, for extras furnished to the guest at the guest's written request, and for the costs of enforcing the lien. The innkeeper's lien right is in addition to the innkeeper's right to recover payment from the guest under other legal or equitable theories or causes of action. However, possession of the valuables, baggage or other property subject to the lien may be taken, and the lien enforced, only in the manner provided in subdivisions 2 and 3.\nThe lien created in subdivision 1 may be enforced only after final judgment in an action brought to recover the charges and moneys. During the pendency of the proceeding, the plaintiff may take possession of the valuables, baggage or other property upon an order issued by the court, if it appears to the court from an affidavit filed by or on behalf of the plaintiff that the valuables, baggage or other property is about to be destroyed, substantially devalued or removed from the premises. Ten days' written notice of the hearing on the motion for the order shall be served on the defendant and shall inform the defendant that affidavits may be filed and testimony presented on behalf of the defendant, and that if the defendant fails to appear the plaintiff will apply to the court for the order. The plaintiff shall file a bond approved by the court conditioned for the return of the property to the defendant, if a return be adjudged, and for the payment to defendant of any sum adjudged against the plaintiff. The bond shall be in the amount fixed by the court. Upon an order issued by the court, the plaintiff shall have the right to take possession of the valuables, baggage or other property pending final judgment in the plaintiff's action to recover charges or moneys owed.\nIf final judgment is entered by the court for the defendant on the merits of the action, the plaintiff shall return possession of the valuables, baggage or other property to the defendant and pay to the defendant costs incurred by the defendant in defending against the plaintiff's claim. If final judgment is entered by the court in favor of the plaintiff, and if the judgment is not satisfied within 30 days, the valuables, baggage or other property subject to the innkeeper's lien may be sold at public auction to satisfy the lien, the costs of the action to enforce the lien, and the costs of sale. The sale shall be made by a sheriff upon the notice and in the manner provided for in sections 550.18 to 550.20.",
	"repealed": false
}