{
	"id": "604A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.10",
	"title": "604A.10 LIABILITY OF FOOD DONORS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Distressed food\" means, in addition to the definition in section 31.495, certain perishable foods, as defined in section 28A.03, that may not be readily marketable due to appearance, freshness, grade, surplus, or other considerations and are not suspect of having been rendered unsafe or unsuitable for food use and are adequately labeled.\n(c) \"Food bank\" means a surplus food collection and distribution system operated and established to assist in bringing donated food to nonprofit charitable organizations and individuals for the purpose of reducing hunger and meeting nutritional needs.\n(d) \"Food facility\" means:\n(1) a restaurant, food establishment, grocery store, delicatessen, convenience store, vehicle, vending machine, produce stand, temporary food facility, satellite food distribution facility, stationary mobile food preparation unit, or mobile food preparation unit;\n(2) a place used in conjunction with the operations described in clause (1), including, but not limited to, storage facilities for food-related utensils, equipment, and materials; or\n(3) a farmers' market.\n(e) \"Nonprofit charitable organization\" means an organization that is incorporated under the Minnesota Nonprofit Corporation Act and is operating for charitable purposes.\nA food manufacturer, distributor, processor, or a person who donates or collects distressed food to or for the state, a political subdivision, or an institution or facility operated by the state or a political subdivision for any lawful purpose or to or for a nonprofit charitable organization for distribution at no charge to the elderly or needy, or who directly distributes distressed food to the elderly or needy at no charge, is not liable for any injury, including but not limited to injury resulting from the ingesting of the distressed food, unless the injury is caused by the gross negligence, recklessness, or intentional misconduct of the food manufacturer, processor, distributor, or person.\nA food bank or nonprofit charitable organization that in good faith collects or receives and distributes to the elderly or needy, at no charge, food that is fit for human consumption at the time it is distributed, is not liable for any injury, including but not limited to injury resulting from the ingesting of the food, unless the injury is caused by the gross negligence, recklessness, or intentional misconduct of the food bank or nonprofit charitable organization.\nA food facility that donates, to a food bank or other nonprofit charitable organization, food that is fit for human consumption at the time of donation and distributed by the food bank or nonprofit charitable organization to the elderly or needy at no charge, is not liable for any injury, including, but not limited to, liability resulting from ingestion of the food, unless the injury is caused by the gross negligence, recklessness, or intentional misconduct of the food facility.\nThis section does not restrict the authority of the commissioner of agriculture to regulate or ban the use or consumption of distressed food donated, collected, or received for charitable purposes.",
	"repealed": false
}