{
	"id": "61A.258",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.258",
	"title": "61A.258 PRENEED INSURANCE PRODUCTS; MINIMUM MORTALITY STANDARDS FOR RESERVES AND NONFORFEITURE VALUES.",
	"text": "For the purposes of this section, the following terms have the meanings given them:\n(1) \"2001 CSO Mortality Table (2001 CSO)\" means that mortality table, consisting of separate rates of mortality for male and female lives, developed by the American Academy of Actuaries CSO Task Force from the Valuation Basic Mortality Table developed by the Society of Actuaries Individual Life Insurance Valuation Mortality Task Force, and adopted by the National Association of Insurance Commissioners (NAIC) in December 2002. The 2001 CSO Mortality Table (2001 CSO) is included in the Proceedings of the NAIC (2nd Quarter 2002). Unless the context indicates otherwise, the \"2001 CSO Mortality Table (2001 CSO)\" includes both the ultimate form of that table and the select and ultimate form of that table and includes both the smoker and nonsmoker mortality tables and the composite mortality tables. It also includes both the age-nearest-birthday and age-last-birthday bases of the mortality tables;\n(2) \"Ultimate 1980 CSO\" means the Commissioners' 1980 Standard Ordinary Life Valuation Mortality Tables (1980 CSO) without ten-year selection factors, incorporated into the 1980 amendments to the NAIC Standard Valuation Law approved in December 1983; and\n(3) \"preneed insurance\" is any life insurance policy or certificate that is issued in combination with, in support of, with an assignment to, or as a guarantee for a prearrangement agreement for goods and services to be provided at the time of and immediately following the death of the insured. Goods and services may include but are not limited to embalming, cremation, body preparation, viewing or visitation, coffin or urn, memorial stone, and transportation of the deceased. The status of the policy or contract as preneed insurance is determined at the time of issue in accordance with the policy form filing.\nFor preneed insurance contracts, the minimum mortality standard for determining reserve liabilities and nonforfeiture values for both male and female insureds shall be the Ultimate 1980 CSO.\n(a) The interest rates used in determining the minimum standard for valuation of preneed insurance shall be the calendar year statutory valuation interest rates as defined in section 61A.25.\n(b) The interest rates used in determining the minimum standard for nonforfeiture values for preneed insurance shall be the calendar year statutory nonforfeiture interest rates as defined in section 61A.24.\n(a) The method used in determining the standard for the minimum valuation of reserves of preneed insurance shall be the method defined in section 61A.25.\n(b) The method used in determining the standard for the minimum nonforfeiture values for preneed insurance shall be the method defined in section 61A.24.\nA policy providing preneed insurance or designed to cover, in whole or in part, the goods and services described in subdivision 1, clause (3), is not subject to section 72A.207.",
	"repealed": false
}