{
	"id": "245.814",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.814",
	"title": "245.814 LIABILITY INSURANCE FOR LICENSED PROVIDERS.",
	"text": "The commissioner of human services shall within the appropriation provided purchase and provide insurance to individuals licensed as foster home providers to cover their liability for:\n(1) injuries or property damage caused or sustained by persons in foster care in their home; and\n(2) actions arising out of alienation of affections sustained by the birth parents of a foster child or birth parents or children of a foster adult.\nFor purposes of this subdivision, insurance for homes licensed to provide adult foster care shall be limited to family adult foster care homes as defined in section 245A.02, subdivision 6f, and family adult day services licensed under section 245A.143.\nCoverage shall apply to all foster homes licensed by the Department of Human Services, licensed by a federally recognized tribal government, or established by the juvenile court and certified by the commissioner of corrections pursuant to section 260B.198, subdivision 1, paragraph (a), clause (3), item (v), to the extent that the liability is not covered by the provisions of the standard homeowner's or automobile insurance policy. The insurance shall not cover property owned by the individual foster home provider, damage caused intentionally by a person over 12 years of age, or property damage arising out of business pursuits or the operation of any vehicle, machinery, or equipment.\nIf the commissioner of human services is unable to obtain insurance through ordinary methods for coverage of foster home providers, the appropriation shall be returned to the general fund and the state shall pay claims subject to the following limitations.\n(a) Compensation shall be provided only for injuries, damage, or actions set forth in subdivision 1.\n(b) Compensation shall be subject to the conditions and exclusions set forth in subdivision 2.\n(c) The state shall provide compensation for bodily injury, property damage, or personal injury resulting from the foster home providers activities as a foster home provider while the foster child or adult is in the care, custody, and control of the foster home provider in an amount not to exceed $250,000 for each occurrence.\n(d) The state shall provide compensation for damage or destruction of property caused or sustained by a foster child or adult in an amount not to exceed $250 for each occurrence.\n(e) The compensation in paragraphs (c) and (d) is the total obligation for all damages because of each occurrence regardless of the number of claims made in connection with the same occurrence, but compensation applies separately to each foster home. The state shall have no other responsibility to provide compensation for any injury or loss caused or sustained by any foster home provider or foster child or foster adult.\nThis coverage is extended as a benefit to foster home providers to encourage care of persons who need out-of-home care. Nothing in this section shall be construed to mean that foster home providers are agents or employees of the state nor does the state accept any responsibility for the selection, monitoring, supervision, or control of foster home providers which is exclusively the responsibility of the counties which shall regulate foster home providers in the manner set forth in the rules of the commissioner of human services.\nIf the commissioner determines that appropriate commercial liability insurance coverage is not available for a licensed foster home, group home, developmental achievement center, or day care provider, and that coverage available through the joint underwriting authority of the commissioner of commerce or other public entity is not appropriate for the provider or a class of providers, the commissioner of human services and the commissioner of commerce may jointly establish a risk pool to provide coverage for licensed providers out of premiums or fees paid by providers. The commissioners may set limits on coverage, establish premiums or fees, determine the proportionate share of each provider to be collected in a premium or fee based on the provider's claim experience and other factors the commissioners consider appropriate, establish eligibility and application requirements for coverage, and take other action necessary to accomplish the purposes of this subdivision. A human services risk pool fund is created for the purposes of this subdivision. Fees and premiums collected from providers for risk pool coverage are appropriated to the risk pool fund. Interest earned from the investment of money in the fund must be credited to the fund and money in the fund is appropriated to the commissioner of human services to pay administrative costs and covered claims for participating providers. In the event that money in the fund is insufficient to pay outstanding claims and associated administrative costs, the commissioner of human services may assess providers participating in the risk pool amounts sufficient to pay the costs. The commissioner of human services may not assess a provider an amount exceeding one year's premiums collected from that provider.\nThe commissioner of children, youth, and families may use federal reimbursement money earned on an expenditure for foster care parent liability insurance premiums to offset the costs of the premiums. The commissioners of children, youth, and families and human services will work with the insurance provider to transition coverage and responsibility as appropriate while avoiding a lapse in coverage.",
	"repealed": false
}