{
	"id": "92.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.70",
	"title": "92.70 LAND USE TRESPASS.",
	"text": "\"Public land\" means publicly owned land or interests in land including land and interests in land that are owned by the state, counties, or road authorities, administered by the commissioner of natural resources, owned by the state as beds of navigable waters, acquired as conservation easements with benefits running to the state, a county, or the public under the reinvest in Minnesota reserve program, water bank program, or other state or county programs.\n(a) A person who uses public land for personal use or personal economic gain where the use is prohibited is guilty of trespass and a petty misdemeanor and shall be subject to a penalty not to exceed $50 per occurrence and is subject to a civil penalty for twice the amount of actual damages.\n(b) A person violating paragraph (a) may be issued a ticket by a sheriff, conservation officer, or personnel of the department designated by the commissioner. The ticket must identify the trespass, where the trespass occurred, and the official observing the trespass. A copy of the ticket must be sent to the public agency responsible for managing the land.\n(c) The civil penalty shall be paid to the public agency responsible for managing the public land. A civil penalty paid to the state is appropriated to the state agency responsible for managing the land to restore the damage and improve state land.\n(d) Within 60 days after a ticket is issued, the public agency responsible for managing the public land where the trespass occurred must make a determination of whether a civil penalty will be sought for the trespass and notify the person.\n(a) A person who willfully and knowingly uses public land for personal use or personal economic gain where the use is prohibited is guilty of trespass and a misdemeanor and is liable to the state or county for a civil penalty three times the amount of the damage.\n(b) A person violating paragraph (a) may be issued a ticket and summons for a court appearance. The prosecuting authority shall prosecute the misdemeanor and shall bring an action for the civil penalty or, on failure to do so, the attorney general at the request of the public agency responsible for managing the land may prosecute the misdemeanor and shall bring an action for the civil penalty.\n(c) Damages must be determined as the greater of:\n(1) the cost to restore the public land to the condition it was in before the trespass occurred plus an amount to compensate the public for the loss of use; or\n(2) the economic gain realized by the person committing the trespass.\n(d) The civil penalty shall be paid to the court and the court administrator shall pay:\n(1) for a trespass on county land, the entire amount to the county to be used for restoration of the trespass and county land improvement purposes; and\n(2) for a trespass on state land, the civil penalty to the state agency responsible for managing the public land which is appropriated for restoration of the trespass and state land improvement purposes.\nThe prosecution for criminal trespass and the civil penalty are separate criminal and civil actions. If a trespass occurs, an action may be commenced for the criminal penalty, the civil penalty, or the civil penalty and the criminal penalty.",
	"repealed": false
}