{
	"id": "239.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.77",
	"title": "239.77 BIODIESEL CONTENT MANDATE.",
	"text": "(a) \"Biodiesel blend\" is a blend of diesel fuel and biodiesel fuel between six percent and 20 percent for on-road and off-road diesel-fueled vehicle use. Biodiesel blend must comply with ASTM specification D7467-10.\n(b) \"Biodiesel fuel\" means a renewable, biodegradable, mono alkyl ester combustible liquid fuel that is derived from agricultural and other plant oils or animal fats and that meets American Society for Testing and Materials specification D6751-11b for Biodiesel Fuel (B100) Blend Stock for Distillate Fuels.\n(c) Biodiesel produced from palm oil is not biodiesel fuel for the purposes of this section, unless the palm oil is contained within waste oil and grease collected within the United States or Canada.\n(a) Except as otherwise provided in this section, all diesel fuel sold or offered for sale in Minnesota for use in internal combustion engines must contain at least the stated percentage of biodiesel fuel oil by volume on and after the following dates:\nExcept as provided in this paragraph, the minimum content levels in clauses (3) and (4) are effective during the months of April, May, June, July, August, and September only and the minimum content for the remainder of the year is five percent. However, if the commissioners of agriculture, commerce, and pollution control determine, after consultation with the biodiesel task force and other technical experts, that an American Society for Testing and Materials specification or equivalent federal standard exists for the specified biodiesel blend level in those clauses that adequately addresses technical issues associated with Minnesota's cold weather and publish a notice in the State Register to that effect, the commissioners may allow the specified biodiesel blend level in those clauses to be effective year-round. In each year that the seasonal reduction to five percent is in effect, the minimum content level of diesel fuel sold or offered for sale in Minnesota from April 1 to April 14 may be less than the level required under clause (4), but not less than ten percent.\n(b) The minimum content levels in paragraph (a), clauses (3) and (4), become effective on the date specified only if the commissioners of agriculture, commerce, and pollution control publish notice in the State Register and provide written notice to the chairs of the house of representatives and senate committees with jurisdiction over agriculture, commerce, and transportation policy and finance, at least 270 days prior to the date of each scheduled increase, that all of the following conditions have been met and the state is prepared to move to the next scheduled minimum content level:\n(1) an American Society for Testing and Materials specification or equivalent federal standard exists for the next minimum diesel-biodiesel blend;\n(2) a sufficient supply of biodiesel is available and the amount of biodiesel produced in this state from feedstock with at least 75 percent that is produced in the United States and Canada is equal to at least 50 percent of anticipated demand at the next minimum content level;\n(3) adequate blending infrastructure and regulatory protocol are in place in order to promote biodiesel quality and avoid any potential economic disruption; and\n(4) at least five percent of the amount of biodiesel necessary for that minimum content level will be produced from a biological resource other than an agricultural resource traditionally grown or raised in the state, including, but not limited to, algae cultivated for biofuels production, waste oils, and tallow.\nThe condition in clause (2) may be waived if the commissioner finds that, due to weather-related conditions, the necessary feed stock is unavailable.\nThe condition in clause (4) may be waived if the commissioners find that the use of these nontraditional feedstocks would be uneconomic under market conditions existing at the time notice is given under this paragraph.\n(c) The commissioners of agriculture, commerce, and pollution control must consult with the biodiesel task force when assessing and certifying conditions in paragraph (b), and in general must seek the guidance of the biodiesel task force regarding biodiesel labeling, enforcement, and other related issues.\n(d) During a period of biodiesel fuel shortage or a problem with biodiesel quality that negatively affects the availability of biodiesel fuel, the commissioner of commerce may temporarily suspend the minimum content requirement in subdivision 2 until there is sufficient biodiesel fuel, as defined in subdivision 1, available to fulfill the minimum content requirement.\n(e) By February 1, 2012, and periodically thereafter, the commissioner of commerce shall determine the wholesale diesel price at various pipeline and refinery terminals in the region, and the biodiesel price determined after credits and incentives are subtracted at biodiesel plants in the region. The commissioner shall report wholesale price differences to the governor who, after consultation with the commissioners of commerce and agriculture, may by executive order adjust the biodiesel mandate if a price disparity reported by the commissioner will cause economic hardship to retailers of diesel fuel in this state. Any adjustment must be for a specified period of time, after which the percentage of biodiesel fuel to be blended into diesel fuel returns to the amount required in subdivision 2. The biodiesel mandate must not be adjusted to less than five percent.\n(a) The minimum content requirements of subdivision 2 do not apply to fuel used in the following equipment:\n(1) motors located at an electric generating plant regulated by the Nuclear Regulatory Commission;\n(2) railroad locomotives;\n(3) off-road taconite and copper mining equipment and machinery;\n(4) off-road logging equipment and machinery;\n(5) vessels of the United States Coast Guard and vessels subject to inspection under United States Code, title 46, section 3301, subsection (1), (9), (10), (13), or (15); and\n(6) generators tested and validated by an entity that designs and manufactures the generators for use in jurisdictions where biodiesel use is not required.\n(b) The exemption in paragraph (a), clause (1), expires 30 days after the Nuclear Regulatory Commission has approved the use of biodiesel fuel in motors at electric generating plants under its regulation.\nThe minimum content requirements of subdivision 2 do not apply to Number 1 diesel fuel.\n(a) A refinery or terminal shall provide, at the time diesel fuel is sold or transferred from the refinery or terminal, a bill of lading or shipping manifest to the person who receives the fuel. For biodiesel-blended products, the bill of lading or shipping manifest must disclose biodiesel content, stating volume percentage, gallons of biodiesel per gallons of petroleum diesel base-stock, or an ASTM \"Bxx\" designation where \"xx\" denotes the volume percent biodiesel included in the blended product. This subdivision does not apply to sales or transfers of biodiesel blend stock between refineries, between terminals, or between a refinery and a terminal.\n(b) A delivery ticket required under section 239.092 for a biodiesel blend must state the volume percentage of biodiesel blended into the diesel fuel delivered through a meter into a storage tank used for dispensing into motor vehicles powered by an internal combustion engine and not exempt under subdivision 3.\n(a) Beginning in 2009, the commissioner of agriculture must report by January 15 of each year to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over agriculture policy and finance regarding the implementation of the minimum content requirements in subdivision 2, including information about the price and supply of biodiesel fuel. The report shall include information about the impacts of the biodiesel mandate on the development of biodiesel production capacity in the state, and on the use of feedstock grown or raised in the state for biodiesel production. The report must include any written comments received from members of the biodiesel fuel task force by January 1 of that year designated by them for inclusion in the report.\n(b) The commissioner of agriculture, in consultation with the commissioner of commerce and the Biodiesel Fuel Task Force, shall study the need to continue the exceptions in subdivision 3. The 2013 report under paragraph (a) shall include recommendations for studies and other research needs to make a determination on the need for the exceptions, including any recommendations for use of the agricultural growth, research, and innovation program funding to conduct the research. The 2014 report under paragraph (a) shall contain the commissioner of agriculture's recommendations on whether to continue any of the exceptions in subdivision 3.",
	"repealed": false
}