{
	"id": "325D.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/325D.46",
	"title": "325D.46 APPLICATION.",
	"text": "Sections 325D.43 to 325D.48 do not apply to:\n(1) conduct in compliance with the orders or rules of, or a statute administered by, a federal, state, or local governmental agency; or\n(2) actions or appeals pending on July 1, 1973.\nSections 325D.43 to 325D.48 shall apply to publishers, broadcasters, printers, or other persons engaged in the dissemination of information or reproduction of printed or pictorial matters who publish, broadcast, or reproduce material only if the persons have either knowledge of the deceptive trade practice or a financial interest in the goods or services being deceptively offered for sale.\nSection 325D.44, subdivision 1, clauses (2) and (3), do not apply to the use of a service mark, trademark, certification mark, collective mark, trade name, or other trade identification that was used and not abandoned before July 1, 1973, if the use was in good faith and is otherwise lawful except for sections 325D.43 to 325D.48.\n(a) The practices described in this subdivision are practices described in section 325D.44, clauses (2) and (4).\n(b) For purposes of this subdivision, \"business is located within the geographic area,\" \"geographic location of the business,\" or similar term means that at least one owner or employee of the business regularly performs services on behalf of the business at that location. Renting use of a street address, post office box, or mail-drop does not constitute having a business at that location.\n(c) A person operating a business misrepresents the geographic location of its business in a listing of the business in a telephone directory, other directory assistance database, or on the Internet, if the name of the business, or the name under which the business is listed, indicates that the business is located within a geographic area and all of the following apply:\n(1) the business is not located within the geographic area indicated;\n(2) the listing fails to identify the actual municipality and state of the business's geographic location; and\n(3) telephone calls to the local telephone number listed in the telephone directory, directory assistance database, or on the Internet routinely are forwarded or transferred to a location that is outside the calling area covered by the telephone directory or directory assistance database in which the number is listed, or outside the local calling area for the local telephone number posted on the Internet.\n(d) A person operating a business misrepresents the geographic location of the business in print advertisement if a fictitious or assumed business name is listed in print advertisement and both of the following apply:\n(1) the name used misrepresents the geographic location of the business; and\n(2) a telephone call to the local telephone number listed in the print advertisement routinely is forwarded or transferred to a location that is outside the calling area for the local telephone number listed.\n(e) This subdivision does not limit the application of sections 325D.43 to 325D.48.",
	"repealed": false
}