{
	"id": "103G.271",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.271",
	"title": "103G.271 APPROPRIATION AND USE OF WATERS.",
	"text": "(a) Except as provided in paragraph (b), the state, a person, partnership, or association, private or public corporation, county, municipality, or other political subdivision of the state may not appropriate or use waters of the state without a water-use permit from the commissioner.\n(b) This section does not apply to the following water uses:\n(1) use for a water supply by less than 25 persons for domestic purposes, except as required by the commissioner under section 103G.287, subdivision 4, paragraph (b);\n(2) nonconsumptive diversion of a surface water of the state from its natural channel for the production of hydroelectric or hydromechanical power at structures that were in existence on and before July 1, 1937, including repowering, upgrades, or additions to those facilities; or\n(3) appropriation or use of stormwater collected and used to reduce stormwater runoff volume, treat stormwater, or sustain groundwater supplies when water is extracted from constructed management facilities for stormwater.\n(c) The commissioner may issue a state general permit for appropriation of water to a governmental subdivision or to the general public. The general permit may authorize more than one project and the appropriation or use of more than one source of water. Water-use permit processing fees and reports required under subdivision 6 and section 103G.281, subdivision 3, are required for each project or water source that is included under a general permit, except that no fee is required for uses totaling less than 15,000,000 gallons annually.\nA water-use permit may not be issued under this section unless it is consistent with state, regional, and local water and related land resources management plans if the regional and local plans are consistent with statewide plans.\nThe commissioner must not modify or restrict the amount of appropriation from a groundwater source authorized in a water-use permit issued to irrigate agricultural land between April 1 and October 1, or, for agricultural land with a crop, until November 15, unless the commissioner determines the authorized amount of appropriation endangers a domestic water supply.\n(a) Except for local permits under section 103B.211, subdivision 4, a water-use permit is not required for the appropriation and use of less than 10,000 gallons per day and totaling no more than 1,000,000 gallons per year, except as required by the commissioner under section 103G.287, subdivision 4, paragraph (b).\n(b) Water-use permits for more than the minimum amount but less than an intermediate amount prescribed by rule must be processed and approved at the municipal, county, or regional level based on rules adopted by the commissioner.\n(c) The rules must include provisions for reporting to the commissioner the amounts of water appropriated under local permits.\nThe commissioner may not issue new water-use permits that will appropriate water from the Mt. Simon-Hinckley aquifer unless the appropriation is for potable water use, there are no feasible or practical alternatives to this source, and a water conservation plan is incorporated with the permit.\n(a) To maintain the supply of drinking water for future generations and except as provided under paragraph (b), the commissioner may not issue a new water-use permit to appropriate water in excess of one million gallons per year for bulk transport or sale of water for consumptive use to a location more than 50 miles from the point of the proposed appropriation.\n(b) Paragraph (a) does not apply to a water-use permit for a public water supply, as defined under section 144.382, subdivision 4, issued to a local unit of government, rural water district established under chapter 116A, or Tribal unit of government if:\n(1) the use is solely for the public water supply;\n(2) the local unit of government, rural water district established under chapter 116A, or Tribal unit of government has a property interest at the point of the appropriation;\n(3) the communities that will use the water are located within 100 miles of the point of appropriation; and\n(4) the requirements in sections 103G.265, 103G.285, and 103G.287 are met.\n(a) Except as provided in paragraph (c), the commissioner may not issue a water-use permit to increase the volume of appropriation from a groundwater source for a once-through cooling system.\n(b) Except as provided in paragraph (c), once-through system water-use permits using in excess of 5,000,000 gallons annually must be terminated by the commissioner, unless the discharge is into a public water basin within a nature preserve approved by the commissioner and established prior to January 1, 2001. The commissioner may issue a permit for a system in existence prior to January 1, 2015, for up to 5,000,000 gallons annually. Existing once-through systems must not be expanded and are required to convert to water efficient alternatives within the design life of existing equipment.\n(c) Notwithstanding paragraphs (a) and (b), the commissioner, with the approval of the commissioners of health and the Pollution Control Agency, may issue once-through system water-use permits on an annual basis for groundwater thermal exchange devices or aquifer storage and recovery systems that return all once-through system water to the source aquifer. Water-use permit processing fees in subdivision 6, paragraph (a), apply to all water withdrawals under this paragraph, including any reuse of water returned to the source aquifer.\nExcept as provided in subdivision 5, paragraph (b), the commissioner shall, by January 31, 1994, revoke all existing permits, and may not issue new permits, for the appropriation or use of groundwater in excess of 10,000,000 gallons per year for the primary purpose of maintaining or increasing surface water levels in the seven-county metropolitan area and in other areas of concern as determined by the commissioner. This subdivision does not apply until January 1, 1998, to a municipality that, by January 1, 1994, submits a plan acceptable to the commissioner for maintaining or increasing surface water levels using sources other than groundwater.\n(a) Except as described in paragraphs (b) to (g), a water-use permit processing fee must be prescribed by the commissioner in accordance with the schedule of fees in this subdivision for each water-use permit in force at any time during the year. Fees collected under this paragraph are credited to the water management account in the natural resources fund. The schedule is as follows, with the stated fee in each clause applied to the total amount appropriated:\n(1) $140 for amounts not exceeding 50,000,000 gallons per year;\n(2) $3.50 per 1,000,000 gallons for amounts greater than 50,000,000 gallons but less than 100,000,000 gallons per year;\n(3) $4 per 1,000,000 gallons for amounts greater than 100,000,000 gallons but less than 150,000,000 gallons per year;\n(4) $4.50 per 1,000,000 gallons for amounts greater than 150,000,000 gallons but less than 200,000,000 gallons per year;\n(5) $5 per 1,000,000 gallons for amounts greater than 200,000,000 gallons but less than 250,000,000 gallons per year;\n(6) $5.50 per 1,000,000 gallons for amounts greater than 250,000,000 gallons but less than 300,000,000 gallons per year;\n(7) $6 per 1,000,000 gallons for amounts greater than 300,000,000 gallons but less than 350,000,000 gallons per year;\n(8) $6.50 per 1,000,000 gallons for amounts greater than 350,000,000 gallons but less than 400,000,000 gallons per year;\n(9) $7 per 1,000,000 gallons for amounts greater than 400,000,000 gallons but less than 450,000,000 gallons per year;\n(10) $7.50 per 1,000,000 gallons for amounts greater than 450,000,000 gallons but less than 500,000,000 gallons per year; and\n(11) $8 per 1,000,000 gallons for amounts greater than 500,000,000 gallons per year.\n(b) For once-through cooling systems, a water-use processing fee must be prescribed by the commissioner in accordance with the following schedule of fees for each water-use permit in force at any time during the year:\n(1) for nonprofit corporations and school districts, $200 per 1,000,000 gallons; and\n(2) for all other users, $420 per 1,000,000 gallons.\n(c) The fee is payable based on the amount of water appropriated during the year and, except as provided in paragraph (f), the minimum fee is $100.\n(d) For water-use processing fees other than once-through cooling systems:\n(1) the fee for a city of the first class may not exceed $250,000 per year;\n(2) the fee for other entities for any permitted use may not exceed:\n(i) $60,000 per year for an entity holding three or fewer permits;\n(ii) $90,000 per year for an entity holding four or five permits; or\n(iii) $300,000 per year for an entity holding more than five permits;\n(3) the fee for agricultural irrigation may not exceed $750 per year;\n(4) the fee for a municipality that furnishes electric service and cogenerates steam for home heating may not exceed $10,000 for its permit for water use related to the cogeneration of electricity and steam;\n(5) the fee for a facility that temporarily diverts a water of the state from its natural channel to produce hydroelectric or hydromechanical power may not exceed $5,000 per year. A permit for such a facility does not count toward the number of permits held by an entity as described in this paragraph; and\n(6) no fee is required for a project involving the appropriation of surface water to prevent flood damage or to remove floodwaters during a period of flooding, as determined by the commissioner.\n(e) Failure to pay the fee is sufficient cause for revoking a permit. A penalty of ten percent per month calculated from the original due date must be imposed on the unpaid balance of fees remaining 30 days after the sending of a second notice of fees due. A fee may not be imposed on an agency, as defined in section 16B.01, subdivision 2, or federal governmental agency holding a water appropriation permit.\n(f) The minimum water-use processing fee for a permit issued for irrigation of agricultural land is $20 for years in which:\n(1) there is no appropriation of water under the permit; or\n(2) the permit is suspended for more than seven consecutive days between May 1 and October 1.\n(g) The commissioner shall waive the water-use permit fee for installations and projects that use stormwater runoff or where public entities are diverting water to treat a water quality issue and returning the water to its source without using the water for any other purpose, unless the commissioner determines that the proposed use adversely affects surface water or groundwater.\n(h) A surcharge of $50 per million gallons in addition to the fee prescribed in paragraph (a) shall be applied to the volume of water used in each of the months of May, June, July, August, and September that exceeds the volume of water used in January for municipal water use, irrigation of golf courses, and landscape irrigation. The surcharge for municipalities with more than one permit shall be determined based on the total appropriations from all permits that supply a common distribution system.\nAn entity that appropriates water without a required permit under subdivision 1 must pay the applicable water-use permit processing fee specified in subdivision 6 for the period during which the unpermitted appropriation occurred. The fees for unpermitted appropriations are required for the previous seven calendar years after being notified of the need for a permit. This fee is in addition to any other fee or penalty assessed. The commissioner may waive payment of fees for past unpermitted appropriations for a residential system permitted under subdivision 5, paragraph (b), or for a hydroelectric or hydromechanical facility that temporarily diverts a water of the state from its natural channel.\nA water-use permit may be transferred to a successive owner of real property if the permittee conveys the real property where the source of water is located. The new owner must notify the commissioner immediately after the conveyance and request transfer of the permit. The commissioner must not deny the transfer of a permit if the permittee is in compliance with all permit conditions and the permit meets the requirements of sections 103G.255 to 103G.301.",
	"repealed": false
}