{
	"id": "256.4835",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.4835",
	"title": "256.4835 MINNESOTA RARE DISEASE ADVISORY COUNCIL.",
	"text": "There is established an advisory council on rare diseases to provide advice on policies, access, equity, research, diagnosis, treatment, and education related to rare diseases. The advisory council is established in honor of Chloe Barnes and her experiences in the health care system. For purposes of this section, \"rare disease\" has the meaning given in United States Code, title 21, section 360bb. The council shall be called the Minnesota Rare Disease Advisory Council. The Council on Disability shall provide meeting and office space and administrative support to the advisory council but does not have authority over the work of the advisory council.\n(a) The advisory council shall consist of at least 17 public members who reflect statewide representation. Except for initial members, members are appointed by the governor according to paragraph (b). Four members of the legislature are appointed according to paragraph (c).\n(b) The governor shall appoint at least the following public members according to section 15.0597:\n(1) three physicians licensed and practicing in the state with experience researching, diagnosing, or treating rare diseases, including one specializing in pediatrics;\n(2) one registered nurse or advanced practice registered nurse licensed and practicing in the state with experience treating rare diseases;\n(3) at least two hospital administrators, or their designees, from hospitals in the state that provide care to persons diagnosed with a rare disease. One administrator or designee appointed under this clause must represent a hospital in which the scope of service focuses on rare diseases of pediatric patients;\n(4) three persons age 18 or older who either have a rare disease or are a caregiver of a person with a rare disease. One person appointed under this clause must reside in rural Minnesota;\n(5) a representative of a rare disease patient organization that operates in the state;\n(6) a social worker with experience providing services to persons diagnosed with a rare disease;\n(7) a pharmacist with experience with drugs used to treat rare diseases;\n(8) a dentist licensed and practicing in the state with experience treating rare diseases;\n(9) a representative of the biotechnology industry;\n(10) a representative of health plan companies;\n(11) a medical researcher with experience conducting research on rare diseases;\n(12) a genetic counselor with experience providing services to persons diagnosed with a rare disease or caregivers of those persons; and\n(13) representatives with other areas of expertise as identified by the advisory council.\n(c) The advisory council shall include two members of the senate, one appointed by the majority leader and one appointed by the minority leader; and two members of the house of representatives, one appointed by the speaker of the house and one appointed by the minority leader. Members appointed under this paragraph serve until their successors are appointed.\n(d) The commissioner of health or a designee, a representative of Mayo Medical School, and a representative of the University of Minnesota Medical School shall serve as ex officio, nonvoting members of the advisory council.\n(e) Members appointed according to paragraph (b) shall serve for a term of three years, except the initial members appointed according to paragraph (b). Members appointed according to paragraph (b) shall serve until their successors have been appointed.\n(f) Members may be reappointed for up to two full additional terms according to the advisory council's operating procedures.\n(g) Members may be removed as provided in section 15.059, subdivision 4.\n(h) Public members serve without compensation, but may have expenses reimbursed as provided in section 15.059, subdivision 3. Legislative members may receive per diem according to the rules of their respective bodies.\nThe advisory council shall meet at the call of the chairperson or at the request of a majority of advisory council members. Meetings of the advisory council are subject to section 13D.01, and notice of its meetings is governed by section 13D.04.\n(a) The advisory council shall elect a chairperson and other officers as it deems necessary and in accordance with the advisory council's operating procedures.\n(b) The advisory council shall be governed by an executive committee elected by the members of the advisory council. One member of the executive committee must be the advisory council chairperson.\n(c) The advisory council shall appoint an executive director. The executive director serves as an ex officio nonvoting member of the executive committee. The advisory council may delegate to the executive director any powers and duties under this section that do not require advisory council approval. The executive director serves in the unclassified service and may be removed at any time by a majority vote of the advisory council. The executive director may employ and direct staff necessary to carry out advisory council mandates, policies, activities, and objectives.\n(d) The executive committee may appoint additional subcommittees and work groups as necessary to fulfill the duties of the advisory council.\n(a) The advisory council's duties may include, but are not limited to:\n(1) in conjunction with the state's medical schools, the state's schools of public health, and hospitals in the state that provide care to persons diagnosed with a rare disease, developing resources or recommendations relating to quality of and access to treatment and services in the state for persons with a rare disease, including but not limited to:\n(i) a list of existing, publicly accessible resources on research, diagnosis, treatment, and education relating to rare diseases;\n(ii) identifying best practices for rare disease care implemented in other states, at the national level, and at the international level that will improve rare disease care in the state and seeking opportunities to partner with similar organizations in other states and countries;\n(iii) identifying and addressing problems faced by patients with a rare disease when changing health plans, including recommendations on how to remove obstacles faced by these patients to finding a new health plan and how to improve the ease and speed of finding a new health plan that meets the needs of patients with a rare disease;\n(iv) identifying and addressing barriers faced by patients with a rare disease to obtaining care, caused by prior authorization requirements in private and public health plans; and\n(v) identifying, recommending, and implementing best practices to ensure health care providers are adequately informed of the most effective strategies for recognizing and treating rare diseases;\n(2) advising, consulting, and cooperating with the Department of Health, including the Advisory Committee on Heritable and Congenital Disorders; the Department of Human Services, including the Drug Utilization Review Board and the Drug Formulary Committee; and other agencies of state government in developing recommendations, information, and programs for the public and the health care community relating to diagnosis, treatment, and awareness of rare diseases;\n(3) advising on policy issues and advancing policy initiatives at the state and federal levels; and\n(4) receiving funds and issuing grants.\n(b) The advisory council shall collect additional topic areas for study and evaluation from the general public. In order for the advisory council to study and evaluate a topic, the topic must be approved for study and evaluation by the advisory council.\n(c) Legislative members may not deliberate about or vote on decisions related to the issuance of grants of state money.\nAdvisory council members are subject to the advisory council's conflict of interest policy as outlined in the advisory council's operating procedures.\nBy January 1 of each year, beginning January 1, 2020, the advisory council shall report to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education and health care policy on the advisory council's activities under subdivision 4 and other issues on which the advisory council may choose to report.",
	"repealed": false
}