{
	"id": "197.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.79",
	"title": "197.79 VETERANS BONUS PROGRAM.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"Applicant\" means a veteran or a veteran's guardian, conservator, or personal representative or a beneficiary or a beneficiary's guardian, conservator, or personal representative who has filed an application with the commissioner for a bonus under this section.\n(b) \"Application\" means a request for a bonus payment by a veteran, a veteran's beneficiary, or a veteran's guardian, conservator, or personal representative through submission of written information on a form designed by the commissioner for this purpose.\n(c) \"Beneficiary\" means in relation to a deceased veteran and in the order named:\n(1) the surviving spouse, if not remarried;\n(2) the children of the veteran, if there is no surviving spouse or the surviving spouse has remarried;\n(3) the veteran's surviving parent or parents;\n(4) the veteran's surviving sibling or siblings; or\n(5) the veteran's estate.\n(d) \"Commissioner\" means the commissioner of the Department of Veterans Affairs.\n(e) \"Department\" means the Department of Veterans Affairs.\n(f) \"Eligibility period for the bonus\" means the period from September 11, 2001, to August 30, 2021.\n(g) \"Guardian\" or \"conservator\" means the legally appointed representative of a minor or incapacitated beneficiary or veteran, the chief officer of a hospital or institution in which the incapacitated veteran is placed if the officer is authorized to accept money for the benefit of the minor or incapacitated veteran, the person determined by the commissioner to be the person who is legally charged with the responsibility for the care of the minor or incapacitated beneficiary or veteran, or the person determined by the commissioner to be the person who has assumed the responsibility for the care of the minor or incapacitated beneficiary or veteran.\n(h) \"Honorable service\" means honorable federal service in the United States armed forces, as evidenced by:\n(1) an honorable discharge;\n(2) a general discharge under honorable conditions;\n(3) in the case of an officer, a certificate of honorable service; or\n(4) in the case of an applicant who is currently serving in active duty in the United States armed forces, a certificate from an appropriate service authority that the applicant's service to date has been honorable.\n(i) \"Incapacitated person\" means an individual who, for reasons other than being a minor, lacks sufficient understanding or the capacity to make personal decisions and who is unable to meet the individual's own personal needs for medical care, nutrition, clothing, shelter, or safety even when assisted by appropriate technology or supported decision making.\n(j) \"Resident veteran\" means a veteran who served in active duty in the United States armed forces at any time during the eligibility period for the bonus, and who also:\n(1) has been separated or discharged from the United States armed forces and resides in Minnesota at the time of application with the intention of residing in the state and not for any temporary purpose. An applicant may verify a residence address by presenting a valid state driver's license; a state identification card; a voter registration card; a rent receipt; a statement by the landlord, apartment manager, or homeowner verifying that the individual is residing at the address; or other form of verification approved by the commissioner; or\n(2) is currently serving in the United States armed forces, and has a certificate from an appropriate service authority stating that the person: (i) served in active duty in the United States armed forces at any time during the eligibility period for the bonus; and (ii) has Minnesota listed as the veteran's home of record in the veteran's official military personnel file.\n(k) \"Service connected\" means caused by an injury or disease incurred or aggravated while on active duty, as determined by the United States Department of Veterans Affairs.\n(l) \"Veteran\" has the meaning given in section 197.447 and does not include a member of the National Guard or the reserve components of the United States armed forces ordered to active duty for the sole purpose of training. Veteran also includes a person who is providing honorable service on active duty in the United States armed forces and has not been separated or discharged.\n(a) For a resident veteran who provided honorable service in the United States armed forces at any time during the eligibility period for the bonus, the bonus amount is:\n(1) $600, if the veteran did not receive the Armed Forces Expeditionary Medal, Global War on Terrorism Expeditionary Medal, Iraq Campaign Medal, Afghanistan Campaign Medal, or Inherent Resolve Campaign Medal during the eligibility period for the bonus;\n(2) $1200, if the veteran received the Armed Forces Expeditionary Medal, Global War on Terrorism Expeditionary Medal, Iraq Campaign Medal, Afghanistan Campaign Medal, or Inherent Resolve Campaign Medal during the eligibility period for the bonus; or\n(3) $2,000, if the veteran was eligible for the Armed Forces Expeditionary Medal, Global War on Terrorism Expeditionary Medal, Iraq Campaign Medal, Afghanistan Campaign Medal, or Inherent Resolve Campaign Medal during the eligibility period for the bonus, and died during that time period as a direct result of a service connected injury, disease, or condition.\n(b) In the case of a deceased veteran, the commissioner shall pay the bonus to the veteran's beneficiary.\nA veteran, or the beneficiary of a veteran, entitled to a bonus may make application for a bonus to the department as prescribed by the commissioner and verified by the applicant. If the veteran is incapacitated or the veteran's beneficiary is a minor or incapacitated, the application must be made by the person's guardian or conservator. An application must be accompanied by evidence of residency, honorable service, active duty service during the eligibility period for the bonus, and any other information the commissioner requires. The applicant must indicate on the application form the bonus amount for which the applicant expects to be eligible.\nIf the information provided in the application is incomplete, the department must notify the applicant in writing of that fact and must identify the items of information needed to make a determination. After notifying an applicant that the person's application is incomplete, the department shall hold the application open for up to 120 days while awaiting further information from the applicant, and the applicant may submit that information within the 120-day period without filing an appeal and request for review.\n(a) Except as provided in paragraphs (b) to (d), the commissioner may not make a bonus payment to any applicant.\n(b) Upon submission of proof to the department that an applicant is entitled to payment under this section, the department shall determine the amount of the bonus for which the applicant is eligible. If the department's determination of the bonus amount is in agreement with, or is greater than, the amount requested by the applicant in the application, the commissioner shall pay to the applicant the bonus amount, as determined by the department.\n(c) If the department determines that the bonus amount for an applicant is less than the amount requested in the application, the department shall notify the applicant in writing of its determination, and include with that notification a form that the applicant may use to accept the department's determination and thereby waive the right to review of that determination. A filing by the applicant of the acceptance and waiver form with the department constitutes a waiver by the applicant of the right to review. Upon receipt of such acceptance and waiver from the applicant, the department shall pay to the applicant the bonus amount, as determined by the department. Unless an appeal is filed with the commissioner by an applicant in accordance with paragraph (d), all orders, decisions, and acts of the department with reference to the claim of the applicant are final and conclusive upon the applicant.\n(d) Upon notification that the department's determination of the bonus amount is less than the bonus amount requested by the applicant in the application, the applicant may appeal the department's determination and request a review by the commissioner. The appeal and request for review must be made in writing within 60 days of the department's mailing of its determination. Following receipt by the department of an applicant's appeal and request for review by the commissioner, no payment shall be made by the department to the applicant until the review has been completed. For such review, the applicant may submit additional information to supplement the information provided in the application, and may request that the review be conducted either: (1) through written correspondence; or (2) in person with the commissioner. The commissioner shall act upon an appeal and request for review within seven working days of its receipt by the department. Following review by the commissioner of the application and any additional information submitted or presented by the applicant, the commissioner's determination is final. Any expenses incurred by the applicant as the result of the applicant's appeal and request for review are the obligation of the applicant.\nNotices and correspondence to an applicant must be directed to the applicant by mail at the address listed in the application or electronically. Notices and correspondence to the commissioner must be addressed to the commissioner's office or the designated department system.\n(a) The commissioner shall determine who is the beneficiary of a deceased veteran and determine who is the person who has assumed the responsibility for the care of any minor or incompetent.\n(b) The commissioner may employ persons and may incur other expenses necessary to administer this section.\nThe bonus payments provided for by this section are gifts or gratuities given as a token of appreciation to eligible veterans and are not compensation for services rendered. The payments are exempt from state taxation.\nA claim for payment under this section is not assignable or subject to garnishment, attachment, or levy of execution.\nA person who knowingly makes a false statement relating to a material fact in support of a claim for a bonus under this section is guilty of a misdemeanor.\nThe application period for the bonus program established in this section shall be July 1, 2022, to June 30, 2024. The department may not receive or accept new applications after June 30, 2024.\nNotwithstanding any law to the contrary, an eligible veteran who previously applied for a bonus under this section may reapply if the veteran either was denied a bonus or is entitled to receive a larger bonus than was originally awarded based on the amendments to this section contained in Laws 2023, chapter 38.",
	"repealed": false
}