{
	"id": "103E.705",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.705",
	"title": "103E.705 REPAIR PROCEDURE.",
	"text": "After the construction of a drainage system has been completed, the drainage authority shall maintain the drainage system that is located in its jurisdiction, including the permanent strips of perennial vegetation under section 103E.021, and provide the repairs necessary to make the drainage system efficient. The drainage authority shall have the drainage system inspected on a regular basis by an inspection committee of the drainage authority or a drainage inspector appointed by the drainage authority. Open drainage ditches shall be inspected at a minimum of every five years when no violation of section 103E.021 is found and annually when a violation of section 103E.021 is found, until one year after the violation is corrected.\n(a) The drainage authority having jurisdiction over a drainage system must inspect the drainage system for violations of section 103E.021. If an inspection committee of the drainage authority or a drainage inspector determines that permanent strips of perennial vegetation are not being maintained in compliance with section 103E.021, a compliance notice must be sent to the property owner.\n(b) The notice must state:\n(1) the date the ditch was inspected;\n(2) the persons making the inspection;\n(3) that spoil banks are to be spread in a manner consistent with the plan and function of the drainage system and that the drainage system has acquired a permanent strip of perennial vegetation, according to section 103E.021;\n(4) the violations of section 103E.021;\n(5) the measures that must be taken by the property owner to comply with section 103E.021 and the date when the property must be in compliance; and\n(6) that if the property owner does not comply by the date specified, the drainage authority will perform the work necessary to bring the area into compliance with section 103E.021 and charge the cost of the work to the property owner.\n(c) If a property owner does not bring an area into compliance with section 103E.021 as provided in the compliance notice, the inspection committee or drainage inspector must notify the drainage authority.\n(d) This subdivision applies to property acquired under section 103E.021.\nFor each drainage system that the board designates and requires the drainage inspector to examine, the drainage inspector shall make a drainage inspection report in writing to the board after examining a drainage system, designating portions that need repair or maintenance of the permanent strips of perennial vegetation and the location and nature of the repair or maintenance. The board shall consider the drainage inspection report at its next meeting and may repair all or any part of the drainage system as provided under this chapter. The permanent strips of perennial vegetation must be maintained in compliance with section 103E.021.\nIf the inspection committee or drainage inspector reports, in writing, to the drainage authority that maintenance of grass strips or repairs are necessary on a drainage system and the report is approved by the drainage authority, the maintenance or repairs must be made under this section.\nIf the drainage authority finds that the estimated cost of repairs and maintenance of one drainage system for one year will be less than the greater of the dollar amount requiring the solicitation of sealed bids under section 471.345, subdivision 3, or $1,000 per mile of open ditch in the ditch system, it may have the repair work done by hired labor and equipment without advertising for bids or entering into a contract for the repair work.\nThe drainage authority may give notice of and hold a hearing on the repair levy before ordering the levy of an assessment for repairs. In one calendar year the drainage authority may not levy an assessment for repairs or maintenance on one drainage system for more than 20 percent of the benefits of the drainage system, $1,000 per mile of open ditch in the ditch system, or the dollar amount requiring the solicitation of sealed bids under section 471.345, subdivision 3, whichever is greater, except for a repair made after a disaster as provided under subdivision 7 or under the petition procedure.\nThe drainage authority may repair and reconstruct the drainage system without advertising for bids and without regard to the $1,000 per mile of open ditch or the dollar amount requiring the solicitation of sealed bids under section 471.345, subdivision 3, limitation if:\n(1) a drainage system is destroyed or impaired by floods, natural disaster, or unforeseen circumstances;\n(2) the area where the drainage system is located has been declared a disaster area by the President of the United States and federal funds are available for repair or reconstruction; and\n(3) the public interests would be damaged by repair or reconstruction being delayed.",
	"repealed": false
}