{
	"id": "626.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.77",
	"title": "626.77 PEACE OFFICERS FROM ADJOINING STATES; FEDERAL LAW ENFORCEMENT OFFICERS.",
	"text": "A peace officer of a state adjoining Minnesota and a federal law enforcement officer have the same authority to arrest and hold an individual in custody as has any peace officer of this state if all of the following circumstances are present:\n(1) the officer is on duty and is acting on a request for assistance by a peace officer of this state;\n(2) while in this state, the officer acts under the direction of the peace officer to whom the officer is rendering assistance;\n(3) while in this state, the officer acts in accordance with the rules and regulations of the officer's own appointive or elective authority; and\n(4) upon effecting an arrest, the officer surrenders custody of the arrested individual to a peace officer of this state without unnecessary delay.\nA peace officer from an adjoining state or a federal law enforcement officer who responds to a request for assistance and who acts in accordance with subdivision 1 is serving in the regular line of duty as fully as though the service was within the officer's jurisdiction. For the purposes of section 3.736 and chapter 466, the officer is deemed to be an employee of the elective or appointive agency of the peace officer requesting assistance.\nAs used in this section, \"federal law enforcement officer\" means an officer or employee whether employed inside or outside the state of the Federal Bureau of Investigation, the Drug Enforcement Administration, the United States Marshal Service, the Secret Service, the Bureau of Alcohol, Tobacco, Firearms and Explosives, the Department of Homeland Security, or the United States Postal Inspection Service, or their successor agencies, who is responsible for the prevention or detection of crimes or for the enforcement of the United States Code and who is authorized to arrest, with or without a warrant, any individual for a violation of the United States Code.",
	"repealed": false
}