{
	"id": "268.046",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.046",
	"title": "268.046 TAX AND REIMBURSABLE ACCOUNTS ASSIGNED TO EMPLOYEE LEASING COMPANIES, PROFESSIONAL EMPLOYER ORGANIZATIONS, OR SIMILAR PERSON.",
	"text": "(a) Any person that contracts with a taxpaying employer to have that person obtain the taxpaying employer's workforce and provide workers to the taxpaying employer for a fee is, as of the effective date of the contract, assigned for the duration of the contract the taxpaying employer's account under section 268.045. That tax account must be maintained by the person separate and distinct from every other tax account held by the person and identified in a manner prescribed by the commissioner. The tax account is, for the duration of the contract, considered that person's account for all purposes of this chapter. The workers obtained from the taxpaying employer and any other workers provided by that person to the taxpaying employer, including officers of the taxpaying employer as defined in section 268.035, subdivision 20, clause (29), whose wages paid by the person are considered paid in covered employment under section 268.035, subdivision 24, for the duration of the contract between the taxpaying employer and the person, must, under section 268.044, be reported on the wage detail report under that tax account, and that person must pay any taxes due at the tax rate computed for that account under section 268.051, subdivision 2.\n(b) Any workers of the taxpaying employer who are not covered by the contract under paragraph (a) must be reported by the taxpaying employer as a separate unit on the wage detail report under the tax account assigned under paragraph (a). Taxes and any other amounts due on the wages reported by the taxpaying employer under this paragraph may be paid directly by the taxpaying employer.\n(c) If the taxpaying employer that contracts with a person under paragraph (a) does not have a tax account at the time of the execution of the contract, an account must be registered for the taxpaying employer under section 268.042 and the new employer tax rate under section 268.051, subdivision 5, must be assigned. The tax account is then assigned to the person as provided for in paragraph (a).\n(d) A person that contracts with a taxpaying employer under paragraph (a) must, within 30 calendar days of the execution or termination of a contract, notify the commissioner by electronic transmission, in a format prescribed by the commissioner, of that execution or termination. The taxpaying employer's name, the account number assigned, and any other information required by the commissioner must be provided by that person.\n(e) Any contract subject to paragraph (a) must specifically inform the taxpaying employer of the assignment of the tax account under this section and the taxpaying employer's obligation under paragraph (b). If there is a termination of the contract, the tax account is, as of the date of termination, immediately assigned to the taxpaying employer.\n(a) Any person that contracts with a nonprofit or government employer that is a reimbursing employer to have that person obtain the nonprofit or government employer's workforce and provide workers to the nonprofit or government employer for a fee, is, as of the effective date of the contract, assigned for the duration of the contract the nonprofit or government employer's account under section 268.045. That reimbursable account must be maintained by the person separate and distinct from every other account held by the person and identified in a manner prescribed by the commissioner. That reimbursable account is, for the duration of the contract, considered that person's account for all purposes of this chapter. The workers obtained from the nonprofit or government employer and any other workers provided by that person to the nonprofit or government employer must, under section 268.044, be reported on the wage detail report under that reimbursable account, and that person must pay any reimbursements due.\n(b) Any workers of the nonprofit or government employer who are not covered by the contract under paragraph (a) must be reported by the nonprofit or government employer as a separate unit on the wage detail report under the reimbursable account assigned under paragraph (a). Reimbursements and any other amounts due on the wages reported by the nonprofit or government employer under this paragraph may be paid directly by the nonprofit or government employer.\n(c) If the nonprofit or government employer that contracts with a person under paragraph (a) does not have an account at the time of the execution of the contract, an account must be registered for the nonprofit or government employer under section 268.042. The reimbursable account is then assigned to the person as provided for in paragraph (a).\n(d) A person that contracts with a nonprofit or government employer under paragraph (a) must, within 30 calendar days of the execution or termination of a contract, notify the commissioner of that execution or termination by electronic transmission, in a format prescribed by the commissioner. The nonprofit or government employer's name, the account number assigned, and any other information required by the commissioner must be provided by that person.\n(e) Any contract subject to paragraph (a) must specifically inform the nonprofit or government employer of the assignment of the reimbursable account under this section and the nonprofit or government employer's obligation under paragraph (b). If there is a termination of the contract, the reimbursable account is, as of the date of termination, immediately assigned to the nonprofit or government employer.\n(a) Any person that violates the requirements of this section and any taxpaying employer that violates subdivision 1, paragraph (b), or any nonprofit or government employer that violates subdivision 2, paragraph (b), is subject to the penalties under section 268.184, subdivision 1a. Penalties are credited to the trust fund.\n(b) Section 268.051, subdivision 4, does not apply to contracts under this section. This section does not limit or prevent the application of section 268.051, subdivision 4, to any other transactions or acquisitions involving the taxpaying employer. This section does not limit or prevent the application of section 268.051, subdivision 4a.\n(c) An assignment of an account upon the execution of a contract under this section and a termination of a contract with the corresponding assignment of the account is not a separation from employment of any worker covered by the contract. Nothing under this subdivision causes the person to be liable for any amounts past due under this chapter from the taxpaying employer or the nonprofit or government employer.\n(d) An exemption from registration under section 79.255, subdivision 9, does not determine the application of this section.",
	"repealed": false
}