{
	"id": "62D.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.101",
	"title": "62D.101 CONTINUATION AND CONVERSION PRIVILEGES FOR FORMER SPOUSES AND CHILDREN.",
	"text": "No health maintenance contract which, in addition to covering an enrollee, also covers the enrollee's spouse shall contain a provision for termination of coverage for a spouse covered under the health maintenance contract solely as a result of a break in the marital relationship.\nEvery health maintenance contract, as described in subdivision 1 shall contain a provision allowing a former spouse and dependent children of an enrollee, without providing evidence of insurability, to obtain from the health maintenance organization at the expiration of any continuation of coverage required under subdivision 2a or sections 62A.146 and 62D.105, an individual health maintenance contract providing at least the minimum benefits of a qualified plan as prescribed by section 62E.06 and the option of a number three qualified plan, a number two qualified plan, a number one qualified plan as provided by section 62E.06, subdivisions 1 to 3, provided application is made to the health maintenance organization within 30 days following notice of the expiration of the continued coverage and upon payment of the appropriate fee. A contract providing reduced benefits at a reduced fee may be accepted by the former spouse and dependent children in lieu of the optional coverage otherwise required by this subdivision. The individual health maintenance contract shall be renewable at the option of the former spouse as long as the former spouse is not covered under another qualified plan as defined in section 62E.02, subdivision 4. Any revisions in the table of rate for the individual contract shall apply to the former spouse's original age at entry and shall apply equally to all similar contracts issued by the health maintenance organization.\nEvery health maintenance contract as described in subdivision 1 shall contain a provision which permits continuation of coverage under the contract for the enrollee's former spouse and children upon entry of a valid decree of dissolution of marriage. The coverage shall be continued until the earlier of the following dates:\n(1) the date the enrollee's former spouse becomes covered under another group plan or Medicare; or\n(2) the date coverage would otherwise terminate under the health maintenance contract.\nIf coverage is provided under a group policy, any required premium contributions for the coverage shall be paid by the enrollee on a monthly basis to the group contract holder to be paid to the health maintenance organization. The contract must require the group contract holder to, upon request, provide the enrollee with written verification from the insurer of the cost of this coverage promptly at the time of eligibility for this coverage and at any time during the continuation period. In no event shall the fee charged exceed 102 percent of the cost to the plan for the period of coverage for other similarly situated spouses and dependent children when the marital relationship has not dissolved, regardless of whether the cost is paid by the employer or employee.\nSubdivision 1 applies to every health maintenance contract which is delivered, issued for delivery, renewed or amended on or after July 19, 1977.\nSubdivisions 2 and 2a apply to every health maintenance contract which is delivered, issued for delivery, renewed, or amended on or after March 1, 1983.",
	"repealed": false
}