{
	"id": "480.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.09",
	"title": "480.09 STATE LIBRARY.",
	"text": "The State Library shall be maintained under the supervision of the justices of the supreme court. Notwithstanding chapter 16C or any other act inconsistent herewith or acts amendatory thereof or supplementary thereto, they shall direct the purchases of books, pamphlets, and documents therefor and the sales and exchanges therefrom upon such terms and conditions as they may deem just and proper. They may authorize the transfer of books and documents to the University of Minnesota or any department thereof, or to any state agency. They shall adopt rules for the government of the library and the management of its affairs, and prescribe penalties for the violation thereof.\nThe justices of the supreme court shall appoint a state law librarian to serve at their pleasure. Subject to the approval of the justices, the librarian may appoint an assistant librarian who shall perform the librarian's duties when the librarian is absent or disabled, and, subject to the approval of the justices, the librarian may employ necessary assistants.\nThe librarian shall:\n(1) have charge of the library rooms and property,\n(2) under the direction of the justices attend to all purchases, exchanges, transfers, and sales,\n(3) enforce the rules prescribed for the government of the library and the management of its affairs,\n(4) collect all damages from injury to or retention of library property and all fines imposed for violation of the rules,\n(5) effect exchanges of any books, documents, journals, maps, pamphlets, and reports delivered to the State Library by any department, agency, or official of the state in accordance with the provisions of section 15.18,\n(6) keep a detailed chronological record of all purchases, exchanges, transfers, and sales and of all additions to the library by gift, purchase, or exchange, respectively,\n(7) keep an account of all amounts collected as damages or fines or from other sources, and of all expenditures.\nThe records and accounts of the library shall be open to public inspection and shall be transferred to the successor of the librarian.\nAll moneys collected shall be paid into the state treasury and are credited to the general fund.\nAll official publications of the United States and of other states and countries, which are received for the use of this state by any officer thereof, shall be sent to the State Library forthwith.",
	"repealed": false
}