{
	"id": "473H.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.09",
	"title": "473H.09 EARLY TERMINATION.",
	"text": "Termination of an agricultural preserve earlier than a date derived through application of section 473H.08 may be permitted in the event of a public emergency upon petition from the owner or authority to the governor. The determination of a public emergency shall be by the governor through executive order pursuant to sections 4.035 and 12.01 to 12.46. The executive order shall identify the preserve, the reasons requiring the action and the date of termination.\n(a) Within 365 days of the death of an owner, an owner's spouse, or other qualifying person, the surviving owner may elect to terminate the agricultural preserve and the covenant allowing the land to be enrolled as an agricultural preserve by notifying the authority on a form provided by the commissioner of agriculture. Termination of a covenant under this subdivision must be executed and acknowledged in the manner required by law to execute and acknowledge a deed.\n(b) For purposes of this subdivision, the following definitions apply:\n(1) \"qualifying person\" includes a partner, shareholder, trustee for a trust that the decedent was the settlor or a beneficiary of, or member of an entity permitted to own agricultural land and engage in farming under section 500.24 that owned the agricultural preserve; and\n(2) \"surviving owner\" includes the executor of the estate of the decedent, trustee for a trust that the decedent was the settlor or a beneficiary of, or an entity permitted to own farm land under section 500.24 of which the decedent was a partner, shareholder, or member.\n(c) When an agricultural preserve is terminated under this subdivision, the property is subject to additional taxes in an amount equal to 50 percent of the taxes actually levied against the property for the current taxes payable year. The additional taxes are extended against the property on the tax list for taxes payable in the current year. The additional taxes must be distributed among the jurisdictions levying taxes on the property in proportion to the current year's taxes.\nTermination of an agricultural preserve earlier than the date derived through the application in section 473H.08 may be requested by the owner eight years after commencement of the preserve. An owner seeking termination under this subdivision must provide notice to the authority exercising planning and zoning authority for the land on a form provided by the commissioner of agriculture. The notice must describe the property for which termination is desired and the date of termination. Termination of the agricultural preserve and covenant pursuant to this subdivision shall become effective only upon approval by a majority vote of the authority.",
	"repealed": false
}