{
	"id": "176.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.66",
	"title": "176.66 OCCUPATIONAL DISEASES; HOW REGARDED.",
	"text": "The disablement of an employee resulting from an occupational disease shall be regarded as a personal injury within the meaning of the workers' compensation law.\n[Repealed, 1973 c 643 s 12]\n[Repealed, 1973 c 643 s 12]\n[Repealed, 1973 c 643 s 12]\n[Repealed, 1973 c 643 s 12]\n[Repealed, 1973 c 643 s 12]\n[Repealed, 1973 c 643 s 12]\n[Repealed, 1973 c 643 s 12]\n[Repealed, 1973 c 643 s 12]\nThe employer liable for the compensation for a personal injury under this chapter is the employer in whose employment the employee was last exposed in a significant way to the hazard of the occupational disease. In the event that the employer who is liable for the compensation had multiple insurers during the employee's term of employment, the insurer who was on the risk during the employee's last significant exposure to the hazard of the occupational disease is the liable party. Where there is a dispute as to which employer is liable under this section, the employer in whose employment the employee is last exposed to the hazard of the occupational disease shall pay benefits pursuant to section 176.191, subdivision 1. If this last employer had coverage for workers' compensation liability from more than one insurer during the employment the insurer on the risk during the last period during which the employee was last exposed to the hazard of the occupational disease shall pay benefits as provided under section 176.191, subdivision 1, whether or not this insurer was on risk during the last significant exposure. The party making payments under this section shall be reimbursed by the party who is subsequently determined to be liable for the occupational disease, including interest at a rate of 12 percent a year. For purposes of this section, a self-insured employer shall be considered to be an insurer and an employer.\nThe compensation for an occupational disease is 66-2/3 percent of the employee's weekly wage on the date of injury subject to a maximum compensation equal to the maximum compensation in effect on the date of last exposure.",
	"repealed": false
}