{
	"id": "354.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.35",
	"title": "354.35 OPTIONAL ACCELERATED RETIREMENT ANNUITY BEFORE NORMAL RETIREMENT AGE.",
	"text": "For purposes of this section, \"normal retirement age\" means normal retirement age as defined in United States Code, title 42, section 416(l), as amended.\n(a) Any coordinated member who retires before normal retirement age may elect to receive an optional accelerated retirement annuity from the association which provides for different annuity amounts over different periods of retirement. The optional accelerated retirement annuity must take the form of an annuity payable for the period before the member attains age 65, or normal retirement age, in a greater amount than the amount of the annuity calculated under section 354.44 on the basis of the age of the member at retirement, but the optional accelerated retirement annuity must be the actuarial equivalent of the member's annuity computed on the basis of the member's age at retirement. The greater amount must be paid until the retiree reaches age 65, or normal retirement age, and at that time the payment from the association must be reduced. For each year the retiree is under age 65, or normal retirement age, up to five percent of the total life annuity required reserves may be used to accelerate the optional retirement annuity under this section.\n(b) Members who retire before age 62 may elect to have the annuity under this subdivision accelerated to age 62 rather than normal retirement age or age 65.\n(c) The method of computing the optional accelerated retirement annuity provided in this subdivision is established by the board of trustees. In establishing the method of computing the optional accelerated retirement annuity or any modification of that procedure, the board of trustees must obtain the written approval of the actuary retained under section 356.214. The written approval must be a part of the permanent records of the board of trustees. The election of an optional accelerated retirement annuity is exercised by making an application on a form provided by the executive director.\nAn annuity under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}