{
	"id": "624.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.22",
	"title": "624.22 FIREWORKS DISPLAYS; PERMIT; OPERATOR CERTIFICATION.",
	"text": "(a) Sections 624.20 to 624.25 do not prohibit the supervised display of fireworks by a statutory or home rule charter city, fair association, amusement park, or other organization, except that:\n(1) a fireworks display may be conducted only when supervised by an operator certified by the state fire marshal; and\n(2) a fireworks display must either be given by a municipality or fair association within its own limits, or by any other organization, whether public or private, only after a permit for the display has first been secured.\n(b) An application for a permit for an outdoor fireworks display must be made in writing to the municipal clerk at least 15 days in advance of the date of the display and must list the name of an operator who is certified by the state fire marshal and will supervise the display. The application must be promptly referred to the chief of the fire department, who shall make an investigation to determine whether the operator of the display is competent and is certified by the state fire marshal, and whether the display is of such a character and is to be so located, discharged, or fired that it will not be hazardous to property or endanger any person. The fire chief shall report the results of this investigation to the clerk. If the fire chief reports that the operator is certified, that in the chief's opinion the operator is competent, and that the fireworks display as planned will conform to the safety guidelines of the state fire marshal provided for in paragraph (f), the clerk shall issue a permit for the display when the applicant pays a permit fee.\n(c) When the supervised outdoor fireworks display for which a permit is sought is to be held outside the limits of an incorporated municipality, the application must be made to the county auditor, and the auditor shall perform duties imposed by sections 624.20 to 624.25 upon the clerk of the municipality. When an application is made to the auditor, the county sheriff shall perform the duties imposed on the fire chief of the municipality by sections 624.20 to 624.25.\n(d) An application for an indoor fireworks display permit must be made in writing to the state fire marshal by the operator of the facility in which the display is to occur at least 15 days in advance of the date of any performance, show, or event which will include the discharge of fireworks inside a building or structure. The application must list the name of an operator who is certified by the state fire marshal and will supervise the display. The state fire marshal shall make an investigation to determine whether the operator of the display is competent and is properly certified and whether the display is of such a character and is to be so located, discharged, or fired that it will not be hazardous to property or endanger any person. If the state fire marshal determines that the operator is certified and competent, that the indoor fireworks display as planned will conform to the safety guidelines provided for in paragraph (f), and that adequate notice will be given to inform patrons of the indoor fireworks display, the state fire marshal shall issue a permit for the display when the applicant pays an indoor fireworks fee of $150 and reimburses the fire marshal for costs of inspection. Receipts from the indoor fireworks fee and inspection reimbursements must be deposited in the general fund as a nondedicated receipt. The state fire marshal may issue a single permit for multiple indoor fireworks displays when all of the displays are to take place at the same venue as part of a series of performances by the same performer or group of performers. A copy of the application must be promptly conveyed to the chief of the local fire department, who shall make appropriate preparations to ensure public safety in the vicinity of the display. The operator of a facility where an indoor fireworks display occurs must provide notice in a prominent place as approved by the state fire marshal to inform patrons attending a performance when indoor fireworks will be part of that performance. The state fire marshal may grant a local fire chief the authority to issue permits for indoor fireworks displays. Before issuing a permit, a local fire chief must make the determinations required in this paragraph.\n(e) After a permit has been granted under either paragraph (b) or (d), sales, possession, use and distribution of fireworks for a display are lawful for that purpose only. A permit is not transferable.\n(f) The state fire marshal shall adopt and disseminate to political subdivisions rules establishing guidelines on fireworks display safety that are consistent with sections 624.20 to 624.25 and the most recent edition of the State Fire Code, to insure that fireworks displays are given safely. In the guidelines, the state fire marshal shall allow political subdivisions to exempt the use of relatively safe fireworks for theatrical special effects, ceremonial occasions, and other limited purposes, as determined by the state fire marshal.\n(a) An applicant to be a supervising operator of a fireworks display shall meet the requirements of this subdivision before the applicant is certified by the state fire marshal.\n(b) An applicant must be at least 21 years old.\n(c) An applicant must have completed a written examination, administered or approved by the state fire marshal, and achieved a passing score of at least 70 percent. The state fire marshal must be satisfied that achieving a passing score on the examination satisfactorily demonstrates the applicant's knowledge of statutes, codes, and nationally recognized standards concerning safe practices for the discharge and display of fireworks.\n(d) An applicant shall apply in writing to the state fire marshal by completing and signing an application form provided by the state fire marshal.\n(e) An applicant shall submit evidence of experience, which must include active participation as an assistant or operator in the performance of at least five fireworks displays, at least one of which must have occurred in the current or preceding year.\nAn applicant shall submit a completed initial application form including references and evidence of experience and successful completion of the written examination. Applicants shall pay a certification fee of $100 to the State Fire Marshal Division of the Department of Public Safety. The state fire marshal shall review the application and send to the applicant written confirmation or denial of certification within 30 days of receipt of the application. Certification is valid for a period of four years from the date of issuance.\nWhen an applicant has met the requirements of subdivisions 2 and 3, the state fire marshal shall certify and classify the operator for supervising proximate audience displays, including indoor fireworks displays, for supervising traditional outdoor fireworks displays, or for supervising both types of displays, based on the operator's documented experience.\nThe operator is responsible for ensuring the fireworks display is organized and operated in accordance with the state fire marshal's guidelines described in subdivision 1.\n(a) The certified operator shall submit a written report to the state fire marshal within ten days following a fireworks display conducted by the operator if any of the following occurred:\n(1) an injury to any person resulting from the display of fireworks;\n(2) a fire or damage to property resulting from the display of fireworks; or\n(3) an unsafe or defective pyrotechnic product or equipment was used or observed.\n(b) The certified operator shall submit a written report to the state fire marshal within 30 days following any other fireworks displays supervised by the operator.\n(c) The state fire marshal may require other information from operators relating to fireworks displays.\nAn applicant shall submit a completed renewal application form prepared and provided by the state fire marshal, which must include at least the dates, locations, and authorities issuing the permits for at least three fireworks displays participated in or supervised by the applicant and conducted during the past four years. An applicant shall pay a certification renewal fee of $100 to the State Fire Marshal Division of the Department of Public Safety. The state fire marshal shall review the application and send to the applicant written confirmation or denial of certification renewal within 30 days of receipt of the application. Certification is valid for a period of four years from the date of issuance.\n(a) The state fire marshal may suspend, revoke, or refuse to renew certification of an operator if the operator has:\n(1) submitted a fraudulent application;\n(2) caused or permitted a fire or safety hazard to exist or occur during the storage, transportation, handling, preparation, or use of fireworks;\n(3) conducted a display of fireworks without receipt of a permit required by the state or a political subdivision;\n(4) conducted a display of fireworks with assistants who were not at least 18 years of age, properly instructed, and continually supervised; or\n(5) otherwise failed to comply with any federal or state law or regulation, or the guidelines, relating to fireworks.\n(b) Any person aggrieved by a decision made by the state fire marshal under this subdivision may petition the state fire marshal in writing to reconsider the decision. The state fire marshal shall render a decision in writing within 30 days of receipt of the written request for reconsideration. Following reconsideration, the person may appeal the decision to the district court.\nThe commissioner of public safety shall maintain a database of the information required under this section for purposes of (1) law enforcement, (2) investigative inquiries made under subdivision 1, and (3) the accumulation and statistical analysis of information relative to fireworks displays.",
	"repealed": false
}