{
	"id": "173.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/173.16",
	"title": "173.16 ADVERTISING DEVICE IN BUSINESS AREA.",
	"text": "After June 8, 1971, advertising devices in a business area shall comply with the standards stated in this section.\n(a) In a business area within a corporate limit the maximum area of a sign face, whether a single sign face or each face of two back-to-back or V-type signs, shall not exceed 1,000 square feet including border and trim, but excluding base and apron supports and other structural members, except as provided under subdivision 5. The maximum size limitation stated in this subdivision shall apply to each side of a sign structure and signs may be placed back-to-back, side by side, or in a V-type construction, but not more than two displays to each facing and such sign structure shall be considered as one sign.\n(b) In a business area outside corporate limits the maximum area of a sign face, whether a single sign face or each face of two back-to-back or V-type signs, shall not exceed 750 square feet including border and trim, but excluding base and apron supports and other structural members, except as provided under subdivision 5. The maximum size limitation stated in this subdivision shall apply to each side of a sign structure and signs may be placed back-to-back, side by side, or in a V-type construction, but not more than two displays to each facing and such sign structure shall be considered as one sign.\n(a) Advertising devices shall not be erected which contain, include or are illuminated by any flashing light or lights, except those giving public service information such as, without limiting the generality of the foregoing, time, date, temperature, weather, or news.\n(b) Advertising devices shall not be erected or maintained which are not effectively shielded so as to prevent beams or rays of light from being directed at any portion of the traveled way of an interstate or primary highway, of such intensity or brilliance as to cause glare or impair the vision of the operator of any motor vehicle; or which otherwise interfere with any driver's operation of a motor vehicle are prohibited.\n(c) Outdoor advertising devices shall not be erected or maintained which shall be so illuminated that they interfere with the effectiveness of or obscure any official traffic sign, device, or signal.\n(a) Advertising devices shall not be erected or maintained in such a place or manner as to obscure or otherwise physically interfere with an official traffic-control device or a railroad safety signal or sign, or to obstruct or physically interfere with the drivers' view of approaching, merging, or intersecting traffic for a distance of 500 feet.\n(b) No advertising device shall be erected closer to any other such advertising device on the same side of the same highway facing traffic proceeding in the same direction than (1) 500 feet on any interstate highway or freeway in a zoned or unzoned commercial or industrial area within or outside an incorporated city, (2) 300 feet on a primary highway in a zoned commercial or industrial area outside an incorporated city, (3) 400 feet on a primary highway in an unzoned commercial or industrial area outside an incorporated city, (4) 100 feet on a primary highway inside an incorporated city; provided, however, that this provision shall not prevent the erection of double-faced, back-to-back, or V-type advertising devices with a maximum of two signs per facing; provided further, however, that such spacing requirements shall not apply as between any off-premise advertising device permitted under the provisions of Laws 1971, chapter 883.\n(c) The above spacing between advertising devices does not apply to structures separated by buildings or other obstructions in such a manner that only one sign facing located within the above spacing distances is visible from the highway at any one time.\n(d) On interstate highways outside of incorporated cities, no advertising device may be located adjacent to or within 500 feet of an interchange, intersection at grade, or safety rest area. On freeways and expressways where there are grade-separated interchanges outside incorporated cities, no advertising device may be located adjacent to or within 500 feet of an interchange, intersection at grade, or safety rest area. Said 500 feet shall be measured along such highway from the beginning or ending of pavement widening at the exit from or entrance to the main-traveled way.\n(e) On primary highways outside of incorporated cities, no advertising device may be located closer than 300 feet from the intersection of any primary highway at grade with another highway, or with a railroad; provided that advertising may be affixed to or located adjacent to a building at such intersection in such a manner as not to cause any greater obstruction of vision than that caused by the building itself.\n(a) Whenever a bona fide county or local zoning authority has made a legitimate determination of customary usage and in the judgment of the commissioner, reasonably provides for size, lighting and spacing control of advertising devices, such determination shall be accepted in lieu of the provisions of this chapter in the zoned commercial and industrial areas within the geographical jurisdiction of such authority.\n(b) All county and local zoning authorities shall give notice to the commissioner of transportation of the establishment or revision of any commercial and industrial zones pursuant to subdivision 1. Notice shall be by certified mail sent to the Office of the Commissioner of Transportation in St. Paul, Minnesota, within 15 days after the effective date of the zoning change or establishment.\n(c) The commissioner may not disapprove any zoning ordinance adopted by a county or local zoning authority that has the effect of establishing a business area unless the zoning ordinance would result in the loss to the state of federal highway funds.\nAdvertising devices must:\n(1) be stationary;\n(2) be immobile;\n(3) not have wheels; and\n(4) be incapable of relocation without a permit.\n(a) A business that is located in an unzoned commercial or industrial area must be in existence for at least three months before a permit may be issued. An outdoor advertising device erected prior to receiving a permit is subject to removal.\n(b) A commercial establishment may demonstrate evidence of its existence by having a website, a telephone number that is answered or has an answering machine identifying the business, a storefront, pictorial evidence of the business, a building permit, or a lease.",
	"repealed": false
}