{
	"id": "116.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.85",
	"title": "116.85 MONITORS REQUIRED FOR OTHER INCINERATORS.",
	"text": "Notwithstanding any other law to the contrary, an incinerator permit that contains emission limits for dioxin, cadmium, chromium, lead, or mercury must, as a condition of the permit, require the installation of an air emission monitoring system approved by the commissioner. The monitoring system must provide continuous measurements to ensure optimum combustion efficiency for the purpose of ensuring optimum dioxin destruction. The system shall also be capable of providing a permanent record of monitored emissions that will be available upon request to the commissioner and the general public. The commissioner shall provide periodic inspection of the monitoring system to determine its continued accuracy.\n(a) Notwithstanding any other law to the contrary, a facility holding an incinerator permit that contains emission limits for mercury must, as a condition of the permit, conduct periodic stack testing for mercury as described by this subdivision. Hospital waste incinerators having a design capacity of less than 3,000,000 Btu per hour may use mercury segregation practices as an alternative to stack testing if allowed by applicable federal requirements, with the approval of the commissioner.\n(b) A facility shall conduct stack testing for mercury at intervals not to exceed three months. An incinerator facility burning greater than 30 percent by weight of refuse-derived fuel must conduct periodic stack testing for mercury at intervals not to exceed 12 months unless a previous test showed a permit exceedence after which the agency may require quarterly testing until permit requirements are satisfied. With the approval of the commissioner, an incinerator facility may use methods other than stack testing for determining mercury in air emissions.\n(c) After demonstrating that mercury emissions have been below 50 percent of the facility's permitted mercury limit for three consecutive years, as tested under the conditions of paragraph (b), an incinerator facility may choose to conduct stack testing once every three years or according to applicable federal requirements, whichever is more stringent. The facility shall notify the commissioner of its alternative mercury testing schedule, and the commissioner shall include operating conditions in the facility's permit that ensure that the facility will continue to emit mercury emissions less than 50 percent of the applicable standard.\n(d) The provisions of paragraph (c) allowing for less frequent stack testing for mercury apply to a new unit constructed at a facility that has previously met the requirements of paragraph (c), provided that the new unit demonstrates, as tested under the conditions of paragraph (b), that mercury emissions have been below 50 percent of the new unit's permitted mercury limit for one year.\n(e) If a test conducted under the provisions of paragraph (c) shows mercury emissions greater than 50 percent of the facility's permitted mercury limit, the facility shall conduct annual mercury stack sampling until emissions are below 50 percent of the facility's permitted mercury limit. Once the facility demonstrates that mercury emissions are again below 50 percent of the facility's permitted mercury limit, the facility may resume testing every three years or according to federal requirements, whichever is more stringent, upon notifying the commissioner.\n(f) In amending, modifying, or reissuing a facility's air emissions permit which contains a provision that restricts mercury emissions from the facility the commissioner shall, at a minimum, continue that permit restriction at the same level unless the applicant demonstrates that no good cause exists to do so.\nShould, at any time after normal startup, the permitted facility's continuously monitored emissions exceed permit requirements, based on accurate and valid emissions data, the facility shall immediately report the exceedance to the commissioner and immediately either commence appropriate modifications to the facility to ensure its ability to meet permitted requirements or commence shutdown if the modifications cannot be completed within 72 hours. Compliance with permit requirements must then be demonstrated based on additional testing.\nShould, at any time after normal startup, the permitted facility's periodically tested emissions exceed permit requirements based on accurate and valid emissions data, the facility shall immediately report the exceedance to the commissioner, shall undertake appropriate steps to ensure the facility's compliance with permitted requirements, and shall demonstrate compliance within 60 days of the initial report of the exceedance. If the commissioner determines that compliance has not been achieved within 60 days, then the facility shall shut down until compliance with permit requirements is demonstrated based on additional testing.\nThis section shall not be construed to limit the authority of the agency to regulate incinerator operations under any other law.",
	"repealed": false
}