{
	"id": "121A.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.75",
	"title": "121A.75 RECEIPT OF RECORDS; SHARING.",
	"text": "(a) For purposes of this section \"principal\" means a principal or other person having general administrative control and supervision of a school.\n(b) For purposes of this section, \"school\" means a public school under section 120A.22, subdivision 4; a nonpublic school under section 120A.22, subdivision 4, that elects to comply with this section; and a charter school under chapter 124E, but does not mean a home school.\n(a) On receipt of a disposition order under section 260B.171, subdivision 3, the superintendent of the student's school district or chief administrative officer of the student's school must immediately transmit the order to the principal of the school where the student is in attendance. The principal must place the disposition order in the student's permanent education record. The principal must also immediately notify any counselor directly supervising or reporting on the behavior or progress of the student. In addition, the principal must immediately notify any teacher or administrator who directly supervises or reports on the behavior or progress of the student whom the principal believes needs the data to work with the student in an appropriate manner, to avoid being needlessly vulnerable, or to protect other persons from needless vulnerability. The principal may also notify other district employees, substitutes, and volunteers who are in direct contact with the student, if they determine these individuals need the data to work with the student in an appropriate manner, to avoid being needlessly vulnerable, or to protect other persons from needless vulnerability. When provided in the disposition order, the notice given under this paragraph by the principal must identify the student, outline the offense, and describe any conditions of probation about which the school must provide information.\n(b) Information received under this subdivision is private data on individuals as defined in section 13.32 and is received for the limited purpose of serving the educational needs of the student and protecting students or staff. The data may not be further disseminated by the teacher, counselor, staff member, administrator, substitute, or volunteer, except as necessary to serve the student, to protect students or staff, or as otherwise required by law, and only to the following persons:\n(1) the student; or\n(2) the student's parent or guardian.\n(c) If a student is removed from school as part of the disposition order, the superintendent of the student's school district or chief administrative officer of the student's school must maintain the copy of the order in a secure file and shall notify the principal when the student is returned to school. If the student is returned to a different school district or school, the student's probation officer must send a copy of the disposition order to the superintendent of the new school district or the chief administrative officer of the new school.\n(d) The disposition order must be included if the student's permanent education record is released to another school district or educational entity to which the student is transferring under section 120A.22, subdivision 7.\n(e) Notwithstanding section 138.17, a disposition order received under section 260B.171, subdivision 3, paragraph (a), must be destroyed when the student graduates from school or at the end of the school year in which the student reaches age 23, whichever is earlier. A disposition order received under section 260B.171, subdivision 3, paragraph (b), must be destroyed when the student is discharged from probation.\n(a) A law enforcement agency must transmit the notice required by section 260B.171, subdivision 5, to the superintendent of the student's school district who must immediately transmit the notice to the principal of the school the student attends, or to the principal of the school the student attends if there is no superintendent. The principal must place the notice in the student's educational record. The principal must immediately notify any teacher, counselor, or administrator directly supervising the student who the principal believes needs the data to work with the student in an appropriate manner, to avoid being needlessly vulnerable, or to protect other persons from needless vulnerability. The principal may also notify other district employees, substitutes, or volunteers who are in direct contact with the student if the principal determines these individuals need the data to work with the juvenile in an appropriate manner, to avoid being needlessly vulnerable, or to protect other persons from needless vulnerability. When provided in the peace officer notice, the notice from the principal must identify the student and describe the alleged offense.\n(b) Data received under this subdivision are private data on individuals under section 13.32 and are received for the limited purpose of serving the student's educational needs and protecting students or staff. The teacher, counselor, staff member, administrator, substitute, or volunteer must not further disseminate the data, except to communicate with the student or the student's parent or guardian as needed to serve the student, protect students or staff, or as otherwise required by law.\n(c) The principal must include the notice in the student's educational record as required by section 120A.22, subdivision 7.\n(d) If the county attorney determines not to proceed with a petition alleging any offense in section 260B.171, subdivision 3, paragraph (a), clauses (1) to (3), or directs the student into a diversion or mediation program, the county attorney must notify the superintendent of the student's school district who must immediately transmit the notice to the principal of the school the student attends, or to the principal of the school that the student attends if there is no superintendent. The notice must contain the name of the student and a summary of the resolution of the case. Notwithstanding section 138.17, the principal must delete the peace officer's report and notice from the student's educational record and destroy the data and make reasonable efforts to notify any teacher, counselor, staff member, administrator, substitute, or volunteer who received data from the peace officer notice.\n(e) If the juvenile court makes a decision on a petition that alleges any offense in section 260B.171, subdivision 3, paragraph (a), clauses (1) to (3), and the decision affects a student and is not a disposition order, the court must notify the superintendent of the student's school district who must immediately transmit the notice to the principal of the school the student attends, or to the principal of the school that the student attends if there is no superintendent, of the decision. Notwithstanding section 138.17, the principal must delete the peace officer's report and notice from the student's educational record and destroy the data and make reasonable efforts to notify any teacher, counselor, staff member, administrator, substitute, or volunteer who received data from the peace officer notice.\n(f) In addition to the data destruction requirements of this subdivision, a principal must comply with the requirements of section 120A.22, subdivision 7.",
	"repealed": false
}