{
	"id": "414.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.01",
	"title": "414.01 ENABLING PROVISIONS FOR MUNICIPAL BOUNDARY ADJUSTMENTS.",
	"text": "The chief administrative law judge shall conduct proceedings, make determinations, and issue orders for the creation of a municipality, the combination of two or more governmental units, or the alteration of a municipal boundary.\nThe legislature finds that:\n(1) sound urban development and preservation of agricultural land and open spaces through land use planning is essential to the continued economic growth of this state;\n(2) municipal government most efficiently provides governmental services in areas intensively developed for residential, commercial, industrial, and governmental purposes; and township government most efficiently provides governmental services in areas used or developed for agricultural, open space, and rural residential purposes;\n(3) the public interest requires that municipalities be formed when there exists or will likely exist the necessary resources to provide for their economical and efficient operation;\n(4) annexation to existing municipalities of unincorporated areas unable to supply municipal services should be facilitated; and\n(5) joint resolutions for orderly annexation, consolidation of municipalities, mergers of towns and municipalities, long-range joint powers planning or other cooperative efforts among counties, cities, and towns should be encouraged.\nThe chief administrative law judge may promote and regulate development of municipalities:\n(1) to provide for the extension of municipal government to areas which are developed or are in the process of being developed for intensive use for residential, commercial, industrial, institutional, and governmental purposes or are needed for such purposes; and\n(2) to protect the stability of unincorporated areas which are used or developed for agricultural, open space, and rural residential purposes and are not presently needed for more intensive uses; and\n(3) to protect the integrity of land use planning in municipalities and unincorporated areas so that the public interest in efficient local government will be properly recognized and served.\nMS 2000 [Repealed, 2002 c 223 s 29]\nMS 1994 [Repealed, 1996 c 303 s 19]\nMS 1994 [Repealed, 1996 c 303 s 19]\nMS 1994 [Repealed, 1996 c 303 s 19]\nThe chief administrative law judge may order the consolidation of separate proceedings in the interest of economy and expedience.\nMS 1967 [Repealed, 1969 c 1139 s 87 subd 2]\nMS 2000 [Repealed, 2002 c 223 s 29]\nMS 1967 [Repealed, 1969 c 1139 s 88 subd 2]\nMS 2006 [Repealed, 2008 c 196 art 1 s 22]\nThe chief administrative law judge may contract with regional, state, county, or local planning commissions and hire expert consultants to provide specialized information and assistance.\nAny person conducting a proceeding under this chapter may administer oaths and affirmations; receive testimony of witnesses, and the production of papers, books, and documents; examine witnesses; and receive and report evidence. Upon the written request of a presiding administrative law judge or a party, the chief administrative law judge may issue a subpoena for the attendance of a witness or the production of books, papers, records, or other documents material to any proceeding under this chapter. The subpoenas shall be enforceable through the district court in the district in which the subpoena is issued.\nMS 1967 [Repealed, 1969 c 1146 s 20]\nTo carry out the duties and powers imposed upon the chief administrative law judge under this chapter, the chief administrative law judge may adopt the rules, that are reasonably necessary, in accordance with the procedure prescribed in the general laws relating to departments and agencies of the state.\nThe chief administrative law judge may prescribe a schedule of filing fees for any petitions, resolutions or ordinances filed pursuant to this chapter by an appropriate rule promulgated in accordance with the procedure prescribed in the general laws relating to departments and agencies of the state for the issuance of administrative rules.\nAny party may request the chief administrative law judge to cause a transcript of the hearing to be made. Any party requesting a copy of the transcript is responsible for its costs.\nMS 1967 [Repealed, 1969 c 1146 s 20]\n(a) When an order or approval letter under this chapter enlarges or diminishes the area of an existing municipality or town, the chief administrative law judge shall communicate the order or approval letter to the municipality and the state demographer. The municipality shall prepare an estimate of population and of the number of households for the annexed or detached area of the municipality or town. The estimate shall be certified by the state demographer. The estimate must estimate the population as of the effective date of the order or approval letter and must be so dated.\n(b) When a new municipality is created by an order under this chapter, the municipality shall request a separation census from the United States Bureau of the Census and bear any costs incurred.\nWhen an order under this chapter enlarges an existing municipality or creates a new municipality, the order may indicate the estimated increased costs to the municipality as the result of the boundary adjustment, and the time period that the municipality would be allowed a levy for these increased costs.\nIn any proceeding under this chapter, the chief administrative law judge or conductor of the proceeding may at any time in the process require representatives from any petitioning property owner or involved city, town, county, political subdivision, or other governmental entity to meet together to discuss resolution of issues raised by the petition or order that confers jurisdiction on the chief administrative law judge and other issues of mutual concern. The chief administrative law judge or conductor of the proceeding may determine which entities are required to participate in these discussions. The chief administrative law judge or conductor of the proceeding may require that the parties meet at least three times during a 60-day period. The parties shall designate a person to report to the chief administrative law judge or conductor of the proceeding on the results of the meetings immediately after the last meeting. The parties may be granted additional time at the discretion of the chief administrative law judge or conductor of the proceedings.\nAny proposed resolution or settlement of contested issues that results in a municipal boundary change, places conditions on any future municipal boundary change, or results in the withdrawal of an objection to a pending proceeding or the withdrawal of a pending proceeding must be filed with the chief administrative law judge and is subject to the applicable procedures and statutory criteria of this chapter.\nThe chief administrative law judge may request information from any state department or agency in order to assist in carrying out the chief administrative law judge's duties under this chapter. The department or agency shall promptly furnish the requested information.",
	"repealed": false
}