{
	"id": "256.962",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.962",
	"title": "256.962 MINNESOTA HEALTH CARE PROGRAMS OUTREACH.",
	"text": "The commissioner, in consultation with community organizations, health plans, and other public entities experienced in outreach to the uninsured, shall design and implement a statewide campaign to raise public awareness on the availability of health coverage through medical assistance and MinnesotaCare and to educate the public on the importance of obtaining and maintaining health care coverage. The campaign shall include multimedia messages directed to the general population.\n(a) The commissioner shall award grants to public and private organizations, regional collaboratives, and regional health care outreach centers for outreach activities, including, but not limited to:\n(1) providing information, applications, and assistance in obtaining coverage through Minnesota public health care programs;\n(2) collaborating with public and private entities such as hospitals, providers, health plans, legal aid offices, pharmacies, insurance agencies, and faith-based organizations to develop outreach activities and partnerships to ensure the distribution of information and applications and provide assistance in obtaining coverage through Minnesota health care programs;\n(3) providing or collaborating with public and private entities to provide multilingual and culturally specific information and assistance to applicants in areas of high uninsurance in the state or populations with high rates of uninsurance; and\n(4) targeting geographic areas with high rates of (i) eligible but unenrolled children, including children who reside in rural areas, or (ii) racial and ethnic minorities and health disparity populations.\n(b) The commissioner shall ensure that all outreach materials are available in languages other than English.\n(c) The commissioner shall establish an outreach trainer program to provide training to designated individuals from the community and public and private entities on application assistance in order for these individuals to provide training to others in the community on an as-needed basis.\n(a) The Minnesota health care programs application must be made available at provider offices, local human services agencies, school districts, public and private elementary schools in which 25 percent or more of the students receive free or reduced-price meals, community health offices, Women, Infants and Children (WIC) program sites, Head Start program sites, public housing councils, child care centers, early childhood education and preschool program sites, legal aid offices, and libraries. The commissioner shall ensure that applications are available in languages other than English.\n(b) Local human service agencies, hospitals, and health care community clinics receiving state funds must provide direct assistance in completing the application form, including the free use of a copy machine and a drop box for applications. These locations must ensure that the drop box is checked at least weekly and any applications are submitted to the commissioner. The commissioner shall provide these entities with an identification number to stamp on each application to identify the entity that provided assistance. Other locations where applications are required to be available shall either provide direct assistance in completing the application form or provide information on where an applicant can receive application assistance.\n(c) Counties must offer applications and application assistance when providing child support collection services.\n(d) Local public health agencies and counties that provide immunization clinics must offer applications and application assistance during these clinics.\n(e) The commissioner shall coordinate with the commissioner of health to ensure that maternal and child health outreach efforts include information on Minnesota health care programs and application assistance, when needed.\nThe commissioner shall provide funds for a statewide toll-free telephone number to provide information on public and private health coverage options and sources of free and low-cost health care. The statewide telephone number must provide the option of obtaining this information in languages other than English.\nBeginning January 1, 2008, the commissioner shall establish an incentive program for organizations and licensed insurance producers under chapter 60K that directly identify and assist potential enrollees in filling out and submitting an application. For each applicant who is successfully enrolled in MinnesotaCare or medical assistance, the commissioner, within the available appropriation, shall pay the organization or licensed insurance producer a $100 application assistance bonus. The organization or licensed insurance producer may provide an applicant a gift certificate or other incentive upon enrollment.\n(a) At the beginning of each school year, a school district or charter school shall provide information to each student on the availability of health care coverage through the Minnesota health care programs and how to obtain an application for the Minnesota health care programs.\n(b) A school district or charter school shall also ensure that applications and information on application assistance are available at early childhood education sites and public schools located within the district's jurisdiction.\n(c) If a school district or charter school maintains a district website, the school district or charter school shall provide on its website a link to information on how to obtain an application and application assistance.\n[Repealed, 2009 c 79 art 5 s 80]\nThe commissioner shall develop and implement a process by January 1, 2013, to provide eligibility review dates upon request from the managed care and county-based purchasing plans for medical assistance and MinnesotaCare enrollees.",
	"repealed": false
}