{
	"id": "193.142",
	"url": "https://www.revisor.mn.gov/statutes/cite/193.142",
	"title": "193.142 MINNESOTA STATE ARMORY BUILDING COMMISSION.",
	"text": "For the purpose of constructing armories as provided by section 193.141, there shall be created a corporation to be known as the \"Minnesota State Armory Building Commission.\" The members and governing body of such corporation shall be the adjutant general and not less than two officers of the National Guard of the state above the grade of major, to be selected and appointed by the adjutant general. The adjutant general shall be chair of such commission. Such commission shall elect a secretary and a treasurer from the members thereof other than the adjutant general. The treasurer of the corporation shall give a security bond to the corporation in such sum as the corporation may determine, conditioned in like manner to the bonds of treasurers of public bodies, to be approved and filed as the corporation may determine.\nUpon the filing with the secretary of state of a certificate by the adjutant general naming the persons authorized to compose such commission and corporation, and declaring them to be constituted a commission and corporation hereunder, such persons shall forthwith become and be such commission and corporation without further proceeding. In case of a vacancy in the membership of such commission and corporation, the remaining members, provided there are not less than two, shall have power to act and to elect such temporary officers of the commission as may be necessary during the existence of the vacancy. In case of a vacancy in the Office of the Adjutant General, or in case of the incapacity of the adjutant general to act as a member and chair of such commission, the officer who is appointed or authorized according to law to exercise the powers of the adjutant general for the time being, shall during the existence of such vacancy or incapacity act as a member and chair of such commission and have all the powers and duties herein vested in or imposed upon the adjutant general as a member and chair of such commission. The adjutant general shall certify to the secretary of state all changes in the membership of the commission, but failure to do so shall not affect the authority of any new member of the commission or the validity of any act of the commission after the accession of a new member.\nIn case at any time all or all but one of the officers of the National Guard who are members of the commission or who are eligible to serve as such are in active service outside the state, or where for any other reason there are not at least two qualified officers of the National Guard available within the state to serve as members of the commission, the adjutant general, or in case of incapacity or of a vacancy in that office, the officer who is appointed or authorized according to law to exercise the powers of the adjutant general for the time being, shall become trustee of the commission and shall have all the powers and perform all the duties of the commission and its officers so long as such conditions exist. Upon the occurrence of such conditions the officer becoming trustee shall file with the secretary of state a certificate reciting the circumstances and declaring that that officer assumes office as such trustee, and thereupon shall be deemed to have qualified as such, with all the authority hereby conferred. Any change in such office shall be likewise certified by the officers succeeding as trustee. Upon the termination of such conditions, the adjutant general or an authorized substitute shall certify the circumstances in like manner, with the names of the officers then authorized by law to compose the commission, and thereupon such officers shall constitute the commission, and the authority of the trustee shall terminate.\nThe Minnesota State Armory Building Commission, authorized by subdivisions 1, 2, and 3, constitutes a continuation of the commission authorized by Minnesota Statutes 1945, section 193.13, and not a new authority, for the purpose of succession to all rights, powers, duties, and obligations of the commission as they existed at the time of the passage of Laws 1947, chapter 133, except as amended by Laws 1947, chapter 133, with the same force and effect as if such functions, powers, and duties had not been transferred.",
	"repealed": false
}