{
	"id": "13.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.32",
	"title": "13.32 EDUCATIONAL DATA.",
	"text": "As used in this section:\n(a) \"Educational data\" means data on individuals maintained by a public educational agency or institution or by a person acting for the agency or institution which relates to a student.\nRecords of instructional personnel which are in the sole possession of the maker thereof and are not accessible or revealed to any other individual except a substitute teacher, and are destroyed at the end of the school year, shall not be deemed to be government data.\nRecords of a law enforcement unit of a public educational agency or institution which are maintained apart from education data and are maintained solely for law enforcement purposes, and are not disclosed to individuals other than law enforcement officials of the jurisdiction are not educational data; provided, that education records maintained by the educational agency or institution are not disclosed to the personnel of the law enforcement unit. The University of Minnesota police department is a law enforcement agency for purposes of section 13.82 and other sections of Minnesota Statutes dealing with law enforcement records. Records of organizations providing security services to a public educational agency or institution must be administered consistent with section 13.861.\nRecords relating to a student who is employed by a public educational agency or institution which are made and maintained in the normal course of business, relate exclusively to the individual in that individual's capacity as an employee, and are not available for use for any other purpose are classified pursuant to section 13.43.\n(b) \"Juvenile justice system\" includes criminal justice agencies and the judiciary when involved in juvenile justice activities.\n(c) \"Parent\" means a parent of a student and includes a natural parent, a guardian, or an individual acting as a parent in the absence of a parent or a guardian.\n(d) \"School-issued device\" means hardware or software that a public educational agency or institution, acting independently or with a technology provider, provides to an individual student for that student's dedicated personal use. A school-issued device includes a device issued through a one-to-one program.\n(e) \"Student\" means an individual currently or formerly enrolled or registered, applicants for enrollment or registration at a public educational agency or institution, or individuals who receive shared time educational services from a public agency or institution.\n(f) \"Substitute teacher\" means an individual who performs on a temporary basis the duties of the individual who made the record, but does not include an individual who permanently succeeds to the position of the maker of the record.\n(g) \"Technology provider\" means a person who:\n(1) contracts with a public educational agency or institution, as part of a one-to-one program or otherwise, to provide a school-issued device for student use; and\n(2) creates, receives, or maintains educational data pursuant or incidental to a contract with a public educational agency or institution.\n(a) Health data concerning students, including but not limited to, data concerning immunizations, notations of special physical or mental problems and records of school nurses are educational data. Access by parents to student health data shall be pursuant to section 13.02, subdivision 8.\n(b) Pupil census data, including emergency information and family information are educational data.\n(c) Data concerning parents are private data on individuals but may be treated as directory information if the same procedures that are used by a school district to designate student data as directory information under subdivision 5 are followed.\nExcept as provided in subdivision 5, educational data is private data on individuals and shall not be disclosed except as follows:\n(a) pursuant to section 13.05;\n(b) pursuant to a valid court order;\n(c) pursuant to a statute specifically authorizing access to the private data;\n(d) to disclose information in health, including mental health, and safety emergencies pursuant to the provisions of United States Code, title 20, section 1232g(b)(1)(I), and Code of Federal Regulations, title 34, section 99.36;\n(e) pursuant to the provisions of United States Code, title 20, sections 1232g(b)(1), (b)(4)(A), (b)(4)(B), (b)(1)(B), (b)(3), (b)(6), (b)(7), and (i), and Code of Federal Regulations, title 34, sections 99.31, 99.32, 99.33, 99.34, 99.35, and 99.39;\n(f) to appropriate health authorities to the extent necessary to administer immunization programs and for bona fide epidemiologic investigations which the commissioner of health determines are necessary to prevent disease or disability to individuals in the public educational agency or institution in which the investigation is being conducted;\n(g) when disclosure is required for institutions that participate in a program under title IV of the Higher Education Act, United States Code, title 20, section 1092;\n(h) to the appropriate school district officials to the extent necessary under subdivision 6, annually to indicate the extent and content of remedial instruction, including the results of assessment testing and academic performance at a postsecondary institution during the previous academic year by a student who graduated from a Minnesota school district within two years before receiving the remedial instruction;\n(i) to appropriate authorities as provided in United States Code, title 20, section 1232g(b)(1)(E)(ii), if the data concern the juvenile justice system and the ability of the system to effectively serve, prior to adjudication, the student whose records are released; provided that the authorities to whom the data are released submit a written request for the data that certifies that the data will not be disclosed to any other person except as authorized by law without the written consent of the parent of the student and the request and a record of the release are maintained in the student's file;\n(j) to volunteers who are determined to have a legitimate educational interest in the data and who are conducting activities and events sponsored by or endorsed by the educational agency or institution for students or former students;\n(k) to provide student recruiting information, from educational data held by colleges and universities, as required by and subject to Code of Federal Regulations, title 32, section 216;\n(l) to the juvenile justice system if information about the behavior of a student who poses a risk of harm is reasonably necessary to protect the health or safety of the student or other individuals;\n(m) with respect to Social Security numbers of students in the adult basic education system, to Minnesota State Colleges and Universities and the Department of Employment and Economic Development for the purpose and in the manner described in section 124D.52, subdivision 7;\n(n) to the commissioner of education for purposes of an assessment or investigation of a report of alleged maltreatment of a student as mandated by chapter 260E. Upon request by the commissioner of education, data that are relevant to a report of maltreatment and are from charter school and school district investigations of alleged maltreatment of a student must be disclosed to the commissioner, including, but not limited to, the following:\n(1) information regarding the student alleged to have been maltreated;\n(2) information regarding student and employee witnesses;\n(3) information regarding the alleged perpetrator; and\n(4) what corrective or protective action was taken, if any, by the school facility in response to a report of maltreatment by an employee or agent of the school or school district;\n(o) when the disclosure is of the final results of a disciplinary proceeding on a charge of a crime of violence or nonforcible sex offense to the extent authorized under United States Code, title 20, section 1232g(b)(6)(A) and (B), and Code of Federal Regulations, title 34, sections 99.31(a)(13) and (14);\n(p) when the disclosure is information provided to the institution under United States Code, title 42, section 14071, concerning registered sex offenders to the extent authorized under United States Code, title 20, section 1232g(b)(7);\n(q) when the disclosure is to a parent of a student at an institution of postsecondary education regarding the student's violation of any federal, state, or local law or of any rule or policy of the institution, governing the use or possession of alcohol or of a controlled substance, to the extent authorized under United States Code, title 20, section 1232g(i), and Code of Federal Regulations, title 34, section 99.31(a)(15), and provided the institution has an information release form signed by the student authorizing disclosure to a parent. The institution must notify parents and students about the purpose and availability of the information release forms. At a minimum, the institution must distribute the information release forms at parent and student orientation meetings;\n(r) a student's name, home address, telephone number, email address, or other personal contact information may be disclosed to a public library for purposes of issuing a library card to the student; or\n(s) with federally recognized Tribal Nations about Tribally enrolled or descendant students to the extent necessary for the Tribal Nation and school district or charter school to support the educational attainment of the student.\nA student shall not have the right of access to private data provided in section 13.04, subdivision 3, as to financial records and statements of the student's parents or any information contained therein.\nData collected by a public school on a child or parent of a child, whose identity must be reported pursuant to section 120A.24, is private data which:\n(1) shall not be designated directory information pursuant to subdivision 5 unless prior written consent is given by the child's parent or guardian; and\n(2) may be disclosed only pursuant to subdivision 3, clause (a), (b), (c), or (f).\nThis provision does not apply to students who receive shared time educational services from a public agency or institution.\n(a) Educational data designated as directory information is public data on individuals to the extent required under federal law. Directory information must be designated pursuant to the provisions of:\n(1) this subdivision; and\n(2) United States Code, title 20, section 1232g, and Code of Federal Regulations, title 34, section 99.37, which were in effect on January 3, 2012.\n(b) When conducting the directory information designation and notice process required by federal law, an educational agency or institution shall give parents and students notice of the right to refuse to let the agency or institution designate specified data about the student as directory information. This notice may be given by any means reasonably likely to inform the parents and students of the right.\n(c) An educational agency or institution may not designate a student's home address, telephone number, email address, or other personal contact information as directory information under this subdivision. This paragraph does not apply to a postsecondary institution.\n(d) When requested, educational agencies or institutions must share personal student contact information and directory information, whether public or private, with the Minnesota Department of Education, as required for federal reporting purposes.\n(e) When requested, educational agencies or institutions may share personal student contact information and directory information for students served in special education with postsecondary transition planning and services under section 125A.08, paragraph (b), clause (1), whether public or private, with the Department of Employment and Economic Development, as required for coordination of services to students with disabilities under sections 125A.08, paragraph (b), clause (1); 125A.023; and 125A.027.\nA secondary institution shall release to military recruiting officers the names, addresses, and home telephone numbers of students in grades 11 and 12 within 60 days after the date of the request, except as otherwise provided by this subdivision. A secondary institution shall give parents and students notice of the right to refuse release of this data to military recruiting officers. Notice may be given by any means reasonably likely to inform the parents and students of the right. Data released to military recruiting officers under this subdivision:\n(1) may be used only for the purpose of providing information to students about military service, state and federal veterans' education benefits, and other career and educational opportunities provided by the military; and\n(2) shall not be further disseminated to any other person except personnel of the recruiting services of the armed forces.\n(a) A school district that receives information under subdivision 3, paragraph (h), from a postsecondary institution about an identifiable student shall maintain the data as educational data and use that data to conduct studies to improve instruction. Public postsecondary systems as part of their participation in the Statewide Longitudinal Education Data System shall provide data on the extent and content of the remedial instruction received by individual students, and the results of assessment testing and the academic performance of, students who graduated from a Minnesota school district within two years before receiving the remedial instruction. The Office of Higher Education, in collaboration with the Department of Education, shall evaluate the data and annually report its findings to the education committees of the legislature.\n(b) This section supersedes any inconsistent provision of law.\nSchool officials who receive data on juveniles, as authorized under section 260B.171, may use and share that data as provided in section 121A.75. A school district, its agents, and employees who use and share this data in good faith are immune from civil or criminal liability that might otherwise result from their actions.\n(a) Upon request, the following education data shall be disclosed under subdivision 3, clause (i), to the juvenile justice system: a student's full name, home address, telephone number, date of birth; a student's school schedule, daily attendance record, and photographs, if any; and parents' names, home addresses, and telephone numbers.\n(b) In addition, the existence of the following data about a student may be disclosed under subdivision 3, clause (i):\n(1) use of a controlled substance, alcohol, or tobacco;\n(2) assaultive or threatening conduct that could result in dismissal from school under section 121A.45, subdivision 2, clause (b) or (c);\n(3) possession or use of weapons or look-alike weapons;\n(4) theft; or\n(5) vandalism or other damage to property.\nAny request for access to data under this paragraph must contain an explanation of why access to the data is necessary to serve the student.\n(c) A principal or chief administrative officer of a school who receives a request to disclose information about a student to the juvenile justice system under paragraph (b) shall, to the extent permitted by federal law, notify the student's parent or guardian by certified mail of the request to disclose information before disclosing the information. If the student's parent or guardian notifies the principal or chief administrative officer within ten days of receiving the certified notice that the parent or guardian objects to the disclosure, the principal or chief administrative officer must not disclose the information. The principal or chief administrative officer must inform the requesting member of the juvenile justice system of the objection.\n(d) A principal or chief administrative officer is not required to create data under this subdivision. Information provided in response to a data request under paragraph (b) shall indicate only whether the data described in paragraph (b) exist. The principal or chief administrative officer is not authorized under paragraph (b) to disclose the actual data or other information contained in the student's education record. A principal or chief administrative officer is not required to provide data that are protected by court order. A principal or chief administrative officer must respond to a data request within 14 days if no objection is received from the parent or guardian.\n(e) Nothing in this subdivision shall limit the disclosure of educational data pursuant to court order.\n(f) A school district, its agents, and employees who provide data in good faith under this subdivision are not liable for compensatory or exemplary damages or an award of attorney fees in an action under section 13.08, or other law, or for a penalty under section 13.09.\n(g) Section 13.03, subdivision 4, applies to data that are shared under this subdivision with a government entity. If data are shared with a member of the juvenile justice system who is not a government entity, the person receiving the shared data must treat the data consistent with the requirements of this chapter applicable to a government entity.\n(h) A member of the juvenile justice system who falsely certifies a request for data under this section is subject to the penalties under section 13.09.\nTo make a data request under subdivision 8, paragraph (b), a member of the juvenile justice system must use the following form:\nREQUEST FOR INFORMATION\nFamily Educational Rights and Privacy Act/\nMinnesota Government Data Practices Act\nREASON FOR REQUEST (requester must describe why information regarding existence of the data marked below is necessary to effectively serve the student) ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nRESPONSE TO REQUEST\nThe school must indicate whether it has data on the student that document any activity or behavior marked by the requester.\nCERTIFICATION: The undersigned certifies that the undersigned is a member of the juvenile justice system. The requested data are needed by the juvenile justice system so it may effectively serve, prior to adjudication, the student whose records are released. The undersigned will not disclose the information received to any other party, except as provided under state law, without prior written consent as required by Code of Federal Regulations, title 34, section 99.38(b). The undersigned further certifies that the undersigned understands that by signing this request, the undersigned is subject to the penalties in Minnesota Statutes, section 13.09.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nSignature/Title\nNothing in this chapter shall be construed as limiting the frequency of inspection of the educational records of a child with a disability by the child's parent or guardian or by the child upon the child reaching the age of majority. An agency or institution may not charge a fee to search for or to retrieve the educational records. An agency or institution that receives a request for copies of the educational records of a child with a disability may charge a fee that reflects the costs of reproducing the records except when to do so would impair the ability of the child's parent or guardian, or the child who has reached the age of majority, to exercise their right to inspect and review those records.\n(a) A parent or guardian of a student may designate an individual, defined under paragraph (c), to participate in a school conference involving the child of the parent or guardian. The parent or guardian must provide the school with prior written consent allowing the significant individual to participate in the conference and to receive any data on the child of the consenting parent or guardian that are necessary and relevant to the conference discussions. The consenting parent or guardian may withdraw consent, in writing, at any time.\n(b) A school may accept the following form, or another consent to release student data form, as sufficient to meet the requirements of this subdivision:\n\"CONSENT TO PARTICIPATE IN CONFERENCES AND RECEIVE STUDENT DATA\nI, ........................................... (Name of parent or guardian), as parent or guardian of ........................................... (Name of child), consent to allow ........................................... (Name of an individual) to participate in school conferences and receive student data relating to the above-named child, consistent with Minnesota Statutes, section 13.32, subdivision 10a. I understand that I may withdraw my consent, upon written request, at any time.\n(c) For purposes of this section, \"an individual\" means one additional adult designated by a child's parent or guardian to attend school-related activities and conferences.\nThe following educational data may be shared between the Department of Education and the Minnesota Office of Higher Education as authorized by Code of Federal Regulations, title 34, section 99.31(a)(6), to analyze instruction in school districts for purposes of improvement:\n(1) attendance data, including name of school or institution, school district, year or term of attendance, and term type;\n(2) student demographic and enrollment data;\n(3) academic performance and testing data; and\n(4) special academic services received by a student.\nAny analysis of or report on the data must contain only summary data.\nCounty personnel in the welfare system may request access to education data in order to coordinate services for a student or family. The request must be submitted to the chief administrative officer of the school and must include the basis for the request and a description of the information that is requested. The chief administrative officer must provide a copy of the request to the parent or legal guardian of the student who is the subject of the request, along with a form the parent or legal guardian may execute to consent to the release of specified information to the requester. Education data may be released under this subdivision only if the parent or legal guardian gives informed consent to the release.\n(a) A technology provider is subject to the provisions of section 13.05, subdivision 11.\n(b) All educational data created, received, maintained, or disseminated by a technology provider pursuant or incidental to a contract with a public educational agency or institution are not the technology provider's property.\n(c) If educational data maintained by the technology provider are subject to a breach of the security of the data, as defined in section 13.055, the technology provider must, following discovery of the breach, disclose to the public educational agency or institution all information necessary to fulfill the requirements of section 13.055.\n(d) Unless renewal of the contract is reasonably anticipated, within 90 days of the expiration of the contract, a technology provider must destroy or return to the appropriate public educational agency or institution all educational data created, received, or maintained pursuant or incidental to the contract.\n(e) A technology provider must not sell, share, or disseminate educational data, except as provided by this section or as part of a valid delegation or assignment of its contract with a public educational agency or institution. An assignee or delegee that creates, receives, or maintains educational data is subject to the same restrictions and obligations under this section as the technology provider.\n(f) A technology provider must not use educational data for any commercial purpose, including but not limited to marketing or advertising to a student or parent. For purposes of this paragraph, a commercial purpose does not include providing the specific services contracted for by a public educational agency or institution. Nothing in this subdivision prohibits the operator's use of deidentified, aggregate information for improving, maintaining, developing, supporting, or diagnosing the operator's site, service, or operation.\n(g) A contract between a technology provider and a public educational agency or institution must include requirements to ensure appropriate security safeguards for educational data. The contract must require that:\n(1) the technology provider's employees or contractors have access to educational data only if authorized; and\n(2) the technology provider's employees or contractors may be authorized to access educational data only if access is necessary to fulfill the official duties of the employee or contractor.\n(h) Within 30 days of the start of each school year, a public educational agency or institution must give parents and students direct and timely notice, by United States mail, email, or other direct form of communication, of any curriculum, testing, or assessment technology provider contract affecting a student's educational data. The notice must:\n(1) identify each curriculum, testing, or assessment technology provider with access to educational data;\n(2) identify the educational data affected by the curriculum, testing, or assessment technology provider contract; and\n(3) include information about the contract inspection and provide contact information for a school department to which a parent or student may direct questions or concerns regarding any program or activity that allows a curriculum, testing, or assessment technology provider to access a student's educational data.\n(i) A public educational agency or institution must provide parents and students an opportunity to inspect a complete copy of any contract with a technology provider.\n(a) Except as provided in paragraph (b), a government entity or technology provider must not electronically access or monitor:\n(1) any location-tracking feature of a school-issued device;\n(2) any audio or visual receiving, transmitting, or recording feature of a school-issued device; or\n(3) student interactions with a school-issued device, including but not limited to keystrokes and web-browsing activity.\n(b) A government entity or technology provider may only engage in activities prohibited by paragraph (a) if:\n(1) the activity is limited to a noncommercial educational purpose for instruction, technical support, or exam-proctoring by district employees, student teachers, staff contracted by a district, a vendor, or the Department of Education, and notice is provided in advance;\n(2) the activity is permitted under a judicial warrant;\n(3) the public educational agency or institution is notified or becomes aware that the device is missing or stolen;\n(4) the activity is necessary to respond to an imminent threat to life or safety and the access is limited to that purpose;\n(5) the activity is necessary to comply with federal or state law, including but not limited to section 121A.031; or\n(6) the activity is necessary to participate in federal or state funding programs, including but not limited to the E-Rate program.\n(c) If a government entity or technology provider interacts with a school-issued device as provided in paragraph (b), clause (4), it must, within 72 hours of the access, notify the student to whom the school-issued device was issued or that student's parent and provide a written description of the interaction, including which features of the device were accessed and a description of the threat. This notice is not required at any time when the notice itself would pose an imminent threat to life or safety, but must instead be given within 72 hours after that imminent threat has ceased.\n(a) A postsecondary institution is exempt from subdivisions 13 and 14. This exemption extends to a technology provider for purposes of a contract with a postsecondary institution.\n(b) Subdivisions 13 and 14 shall not apply to a nonprofit national assessment provider solely for purposes of providing access to employment, educational scholarships and programs, financial aid, or postsecondary educational opportunities, if the provider secures express digital or written consent of the student or the student's parent or guardian, in response to clear and conspicuous notice.",
	"repealed": false
}