{
	"id": "524.5-431",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-431",
	"title": "524.5-431 TERMINATION OF PROCEEDINGS.",
	"text": "(a) A conservatorship terminates upon the death of the person subject to conservatorship or upon order of the court. Unless created for reasons other than that the person subject to conservatorship is a minor, a conservatorship created for a minor also terminates when the person subject to conservatorship attains majority or is emancipated.\n(b) Upon the death of a person subject to conservatorship, the conservator shall conclude the administration of the estate by distribution of probate property to the personal representative of the estate of the person subject to conservatorship. The conservator shall distribute nonprobate property to the successor in interest. The conservator shall file a final report and petition for discharge no later than 30 days after distribution, and notice of hearing for allowance of said report shall be given to interested persons and to the personal representative of the estate of the person subject to conservatorship.\n(c) On petition of any person interested in the welfare of the person subject to conservatorship, the court may terminate the conservatorship if the person subject to conservatorship no longer needs the assistance or protection of a conservator. Termination of the conservatorship does not affect a conservator's liability for previous acts or the obligation to account for funds and assets of the person subject to conservatorship.\n(d) Except as otherwise ordered by the court for good cause, before terminating a conservatorship, the court shall follow the same procedures to safeguard the rights of the person subject to conservatorship that apply to a petition for conservatorship. Upon the establishment of a prima facie case for termination, the court shall order termination unless it is proved that continuation of the conservatorship is in the best interest of the person subject to conservatorship.\n(e) Upon termination of a conservatorship, whether or not formally distributed by the conservator, title to assets of the estate remains vested in the formerly person subject to conservatorship or passes to the person's successors subject to administration, including claims of creditors and allowances of surviving spouse and dependent children, and subject to the rights of others resulting from abatement, retainer, advancement, and ademption. The order of termination must provide for payment of expenses of administration and include payment of fees and costs of final administration for guardians, conservators, and attorneys. The order must direct the conservator to execute appropriate instruments to evidence the transfer of title or confirm a distribution previously made and to file a final report and a petition for discharge upon approval of the final report.\n(f) The court shall enter a final order of discharge upon the approval of the final report and satisfaction by the conservator of any other conditions placed by the court on the conservator's discharge.\n(g) Any documents or information disclosing or pertaining to health or financial information shall be filed as confidential documents, consistent with the bill of particulars under section 524.5-121.\n(h) A conservator may petition the court for discharge from the conservatorship.",
	"repealed": false
}