{
	"id": "103B.451",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.451",
	"title": "103B.451 SOUTH DAKOTA-MINNESOTA BOUNDARY WATERS COMMISSION.",
	"text": "An interstate commission known as the South Dakota-Minnesota Boundary Waters Commission is established. The members of the commission shall be the secretaries of the department of water and natural resources and the department of game, fish and parks of South Dakota and the commissioners of natural resources and the Pollution Control Agency of Minnesota. The fifth member shall be a qualified engineer appointed for a four-year term by the mutual consent of the governors of Minnesota and South Dakota.\n(a) The commission shall have power and authority:\n(1) to investigate and determine the most desirable and beneficial levels of boundary waters artificially controlled and to prescribe a plan for controlling and regulating water levels;\n(2) to hold hearings and take evidence as may be presented, either after complaint or upon its own initiative, as to the desirability of any water level and plan of regulation, and to issue orders concerning the same which in its opinion are for the best interests of the public;\n(3) to plan, propose, coordinate and hold hearings on lake protection and rehabilitation projects for boundary waters; and\n(4) to accept and distribute grants from any source for the purposes set forth in this section.\n(b) The commission shall seek the advice of local units of government and encourage them to implement projects voluntarily and to enter into agreements with one another for that purpose. The commission itself has no authority to implement lake protection or rehabilitation projects.\nThe commission shall establish one local advisory committee for all commission activities. A majority of the members of the committee shall be elected officials of local governmental units, including tribal governments, within the boundary waters watershed with an equal number of representatives from each state. The advisory committee shall be consulted prior to any activity conducted by the commission.\n(a) Hearings must be held at a time and place designated by the commission in counties affected by the subject matter.\n(b) At least two weeks' published notice of the hearings must be given by publication of the notice in a legal newspaper in each county bordering on the boundary waters that may be affected by the subject matter of the hearing.\n(c) All final orders of the commission must be published once each week for two consecutive weeks in a legal newspaper in each county bordering on the boundary waters that may be affected. The printer's affidavit of publication of all notices and orders must be filed with the commission. Hearings held pursuant to this section shall not be subject to the requirements of chapter 14.\nAny party aggrieved by any order or any determination of the commission under this section may appeal to the district court or to the circuit court, as the case may be, of a county in either state where the subject matter of the order or the determination is wholly or partially located, or to the district court of the county in either state where its capitol is located. Notice of appeal must be served upon the commission within 30 days from the last date of publication of the order appealed from. Appeals may likewise be taken from the judgments of the district court or the circuit court, as the case may be, to the appellate courts of their respective states as in other civil cases.",
	"repealed": false
}