{
	"id": "383B.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.73",
	"title": "383B.73 PARK DISTRICT TAX LEVY.",
	"text": "To provide funds for the purposes of the Three Rivers Park District as set forth in its annual budget, in lieu of the levies authorized by any other special law for such purposes, the board of park district commissioners may levy taxes on all the taxable property in the county and park district at a rate not exceeding 0.03224 percent of estimated market value. Notwithstanding section 398.16, on or before October 1 of each year, after public hearing, the board of park district commissioners shall adopt a budget for the ensuing year and shall determine the total amount necessary to be raised from ad valorem tax levies to meet its budget. The board of park district commissioners shall submit the budget to the county board. The county board may veto or modify an item contained in the budget. If the county board determines to veto or to modify an item in the budget, it must, within 15 days after the budget was submitted by the district board, state in writing the specific reasons for its objection to the item vetoed or the reason for the modification. The Park District Board, after consideration of the county board's objections and proposed modifications, may reapprove a vetoed item or the original version of an item with respect to which a modification has been proposed, by a two-thirds majority. If the district board does not reapprove a vetoed item, the item shall be deleted from the budget. If the district board does not reapprove the original version of a modified item, the item shall be included in the budget as modified by the county board. After adoption of the final budget and no later than October 1, the superintendent of the park district shall certify to the office of the Hennepin County director of tax and public records exercising the functions of the county auditor the total amount to be raised from ad valorem tax levies to meet its budget for the ensuing year. The director of tax and public records shall add the amount of any levy certified by the district to other tax levies on the property of the county within the district for collection by the director of tax and public records with other taxes. When collected, the director shall make settlement of such taxes with the district in the same manner as other taxes are distributed to the other political subdivisions in Hennepin County.\nMS 2000 [Repealed, 2001 c 44 s 5]",
	"repealed": false
}