{
	"id": "135A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.14",
	"title": "135A.14 STATEMENT OF IMMUNIZATION.",
	"text": "As used in this section, the following terms have the meanings given them.\n(a) \"Administrator\" means the administrator of the institution or other person with general control and supervision of the institution.\n(b) \"Public or private postsecondary educational institution\" or \"institution\" means any of the following institutions having an enrollment of more than 100 persons during any quarter, term, or semester during the preceding year: (1) the University of Minnesota; (2) the state universities; (3) the state community colleges; (4) public technical colleges; (5) private four-year, professional and graduate institutions; (6) private two-year colleges; and (7) schools subject to either sections 136A.61 to 136A.71, 136A.82 to 136A.834, or schools exempt under section 136A.657, and which offer educational programs within the state for an academic year greater than six consecutive months. An institution's report to the Minnesota Office of Higher Education or the Minnesota Department of Education may be considered when determining enrollment.\n(c) \"Student\" means a person born after 1956 who did not graduate from a Minnesota high school in 1997 or later, and who is (1) registering for more than one class during a full academic term, such as a quarter or a semester or (2) housed on campus and is registering for one or more classes. Student does not include persons who are only enrolled in extension classes, correspondence classes, online classes, or evening or weekend adult accelerated programs.\nExcept as provided in subdivision 3, no student may remain enrolled in a public or private postsecondary educational institution unless the student has submitted to the administrator a statement that the student has received appropriate immunization against measles, rubella, and mumps after having attained the age of 12 months, and against diphtheria and tetanus within ten years of first registration at the institution. This statement must indicate the month and year of each immunization given. Instead of submitting a statement, a student may provide an immunization record maintained by a school according to section 121A.15, subdivision 7, or a school in another state if the required information is contained in the record. A student who has submitted a statement as provided in this subdivision may transfer to a different Minnesota institution without submitting another statement if the student's transcript or other official documentation indicates that the statement was submitted.\n(a) An immunization listed in subdivision 2 is not required if the student submits to the administrator a statement signed by a physician that shows:\n(1) that, for medical reasons, the student did not receive an immunization;\n(2) that the student has experienced the natural disease against which the immunization protects; or\n(3) that a laboratory has confirmed the presence of adequate immunity.\n(b) If the student submits a notarized statement that the student has not been immunized as required in subdivision 2 because of the student's conscientiously held beliefs, the immunizations described in subdivision 2 are not required. The institution shall forward this statement to the commissioner of health.\nThe institution must maintain an immunization record for each student governed by this section for at least one year from the time of original filing. The immunization records may be inspected by the Department of Health and the community health board in whose jurisdiction the institution is located.\nThe institution shall require that the statement from the student, as required within subdivision 2 or 3, be submitted within 45 days of commencement of the academic term for which the student has registered.\n[Repealed, 2014 c 149 s 75]\nEach public and private postsecondary institution shall provide information on the transmission, treatment, and prevention of hepatitis A, B, and C, and the risks of meningococcal disease and on the availability and effectiveness of any vaccine to all persons who are first-time enrollees. The institution may provide the information in an electronic format. The institution must consult with the Department of Health on the preparation of the informational materials provided under this subdivision.\n(a) The commissioner of health may adopt modifications to the immunization requirements of this section. A proposed modification made under this subdivision must be part of the current immunization recommendations of each of the following organizations: the United States Public Health Service's Advisory Committee on Immunization Practices, the American Academy of Family Physicians, and the American Academy of Pediatrics. In proposing a modification to the immunization schedule, the commissioner must:\n(1) consult with the commissioner of education; the commissioner of human services; the chancellor of the Minnesota State Colleges and Universities; and the president of the University of Minnesota; and\n(2) consider the following criteria: the epidemiology of the disease, the morbidity and mortality rates for the disease, the safety and efficacy of the vaccine, the cost of a vaccination program, the cost of enforcing vaccination requirements, and a cost-benefit analysis of the vaccination.\n(b) Before a proposed modification may be adopted, the commissioner must notify the chairs of the house of representatives and senate committees with jurisdiction over health policy issues. If the chairs of the relevant standing committees determine a public hearing regarding the proposed modifications is in order, the hearing must be scheduled within 60 days of receiving notice from the commissioner. If a hearing is scheduled, the commissioner may not adopt any proposed modifications until after the hearing is held.\n(c) The commissioner shall comply with the requirements of chapter 14 regarding the adoption of any proposed modifications to the immunization schedule.\n(d) In addition to the publication requirements of chapter 14, the commissioner of health must inform all immunization providers of any adopted modifications to the immunization schedule in a timely manner.",
	"repealed": false
}