{
	"id": "3.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.97",
	"title": "3.97 LEGISLATIVE AUDIT COMMISSION.",
	"text": "Continuous legislative review of the spending of public funds and financing at all levels of government is required in the public interest to enable the enactment of appropriate legislation.\nThe Legislative Audit Commission consists of:\n(1) three members of the senate appointed by the senate majority leader;\n(2) three members of the senate appointed by the senate minority leader;\n(3) three members of the house of representatives appointed by the speaker of the house; and\n(4) three members of the house of representatives appointed by the house of representatives minority leader.\nMembers shall serve until replaced, or until they are not members of the legislative body from which they were appointed. Appointing authorities shall fill vacancies on the commission within 30 days of a vacancy being created.\nThe commission shall meet in January of each odd-numbered year to elect its chair and vice-chair. They shall serve until successors are elected. The chair and vice-chair shall alternate biennially between the senate and the house of representatives, and shall be of different political parties. The commission shall meet at the call of the chair. The members shall serve without compensation but be reimbursed for their reasonable expenses as members of the legislature. The commission may exercise the powers prescribed by section 3.153.\n[Repealed, 2006 c 262 s 2]\nThe commission shall periodically select topics for the legislative auditor to evaluate. Topics may include any agency, program, or activity established by law to achieve a state purpose, or any topic that affects the operation of state government. The commission shall give primary consideration to topics that are likely, upon examination, to produce recommendations for cost savings, increased productivity, or the elimination of duplication among public agencies. The commission shall also give consideration to programs and statutory provisions that authorize grants, tax incentives, and other inducements for economic development. Legislators and legislative committees may suggest topics for evaluation, but the legislative auditor shall only conduct evaluations approved by the commission.\nThe commission shall review legislative auditor reports and make recommendations, as the commission determines necessary, for improvements in the state's system of internal controls and financial management.\n[Renumbered 3.971, subdivision 1]\n[Renumbered 3.971, subd 2]\n[Renumbered 3.971, subd 3a]\n[Renumbered 3.971, subd 4]\n[Renumbered 3.971, subd 5]\n[Renumbered 3.979, subdivision 1]\n[Renumbered 3.979, subd 2]\n[Renumbered 3.979, subd 3]\n[Renumbered 3.979, subd 4]\n[Renumbered subd 3a]",
	"repealed": false
}