{
	"id": "471.572",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.572",
	"title": "471.572 INFRASTRUCTURE REPLACEMENT RESERVE FUND.",
	"text": "For purposes of this section, the following terms have the meanings given:\n\"Reserve fund\" means the infrastructure replacement reserve fund.\n\"City\" means a statutory or home rule charter city.\nThe governing body of a city may establish, by a two-thirds vote of all its members, by ordinance or resolution a reserve fund and may annually levy a property tax for the support of the fund. The proceeds of taxes levied for its support must be paid into the reserve fund. Any other revenue from a source not required by law to be paid into another fund for purposes other than those provided for the use of the reserve fund may be paid into the fund. Before a tax is levied under this section, the city must publish in the official newspaper of the city an initial resolution authorizing the tax levy. If within ten days after the publication a petition is filed with the city clerk requesting an election on the tax levy signed by a number of qualified voters greater than ten percent of the number who voted in the city at the last general election, the tax may not be levied until the levy has been approved by a majority of the votes cast on it at a regular or special election.\nThe reserve fund may be used only for the replacement of streets, bridges, curbs, gutters, sidewalks, trees, and storm sewers.\nIf the city has established a reserve fund, it may submit to the voters at a regular or special election the question of whether use of the fund should be restricted to a specific improvement or type of capital improvement. If a majority of the votes cast on the question are in favor of the limitation on the use of the reserve fund, it may be used only for the purpose approved by the voters.\nA reserve fund may not be established until after a public hearing is held on the question. Notice of the time, place, and purpose of the hearing must be published for two successive weeks in the official newspaper of the city. The second publication must be not later than seven days before the date of the hearing.\nThe city may terminate a reserve fund at any time in the same manner as the fund was established. Upon termination of the fund any balance is irrevocably appropriated to the debt service fund of the city to be used solely to reduce tax levies for or bonded indebtedness of the city or, if the city has no bonded indebtedness, for capital improvements authorized by this section.",
	"repealed": false
}