{
	"id": "115A.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.191",
	"title": "115A.191 VOLUNTARY CONTRACTS WITH COUNTIES.",
	"text": "The agency and any eligible county board may enter a contract as provided in this section expressing their voluntary and mutually satisfactory agreement concerning the location and development of a stabilization and containment facility. The commissioner shall negotiate contracts with eligible counties and shall present drafts of the negotiated contracts to the agency for its approval. The commissioner shall actively solicit, encourage, and assist counties, together with developers, landowners, the local business community, and other interested parties, in developing resolutions of interest. The county shall provide affected political subdivisions and other interested persons with an opportunity to suggest contract terms.\nA county is eligible to negotiate a contract under this section if the county board files with the agency and the agency accepts a resolution adopted by the county board that expresses the county board's interest in negotiations and its willingness to accept the preliminary evaluation of one or more study areas in the county for consideration as a location of a stabilization and containment facility. The county board resolution expressing interest in negotiations must provide for county cooperation with the agency, as necessary to facilitate the evaluation of study areas in the county, and for the appointment of a member of the county board or an officer or employee of the county as official liaison with the agency with respect to the matters provided in the resolution and future negotiations with the agency. A county board by resolution may withdraw a resolution of interest, and the agency may withdraw its acceptance of such a resolution, at any time before the parties execute a contract under this section.\nThe commissioner, in cooperation with the county board, may engage in activities necessary for the evaluation of study areas in any county that is eligible to negotiate a contract under this section. The determination of whether any study area may be considered or excluded from consideration under sections 115A.18 to 115A.20 and sections 115A.191 to 115A.194 is exclusively the authority of the agency. Before entering a contract under this section, the agency shall determine whether the study area identified in the contract is appropriate for preparation of an environmental impact statement.\n(a) A contract between the agency and a county must include provisions by which:\n(1) the state, acting through the agency, agrees to implement the terms of the contract and provide the benefits and implement the procedures and practices agreed upon pursuant to subdivision 5; and\n(2) the county agrees that the study area or areas in the county that have been determined by the agency to be appropriate for preparation of an environmental impact statement are subject to evaluation and selection by the agency as provided in section 115A.194.\n(b) After executing the contract, the study areas identified in the contract remain subject to the provisions of section 115A.194 until the study areas are dismissed from further consideration by the agency.\n(a) A contract executed under subdivision 4 may contain any terms agreed upon by the state and the county, including:\n(1) procedures relating to the evaluation and selection of a site and the construction, operation, and maintenance of a proposed facility, including procedures for cooperation, consultation, and coordination between the agency and the county or political subdivisions in the county on those matters;\n(2) practices and procedures necessary to assure and demonstrate safe operation of a proposed facility;\n(3) services, compensation, or benefits to be provided by the state to the county or political subdivisions in the county, including:\n(i) payments in lieu of taxes on a publicly owned site;\n(ii) compensation for property owners adjoining or in close proximity to the facility through property tax relief or assurance of property value;\n(iii) compensation for local public expenditures necessitated by the facility;\n(iv) compensation for demonstrable private and community impacts from the facility;\n(v) monetary compensation to the county and other parties affected by the facility, in addition to compensation for necessary expenditures and demonstrable impacts;\n(vi) provision of services or benefits to promote the health, safety, comfort, and economic development and well-being of the county and its citizens;\n(4) provision for amendment of the contract; and\n(5) provisions for resolutions of disputes under the contract.\n(b) Terms of the contract requiring enactment of additional state law, including an appropriation law, are contingent on that enactment. The contract may provide for implementation of its terms during evaluation of a study area in the county under section 115A.194 and in the event that a study area in the county is selected as the site for a facility under that section.\n(a) Requirement. If a county board enters into negotiations for a contract, makes a binding offer to enter a contract, or enters a contract under this section, the county board shall submit the question of whether to proceed with the contract to a vote of the eligible voters of the county at the general election to be held on November 6, 1990. The election may be held before a final determination has been made on the acceptability of a site in the county.\n(b) Election procedure. The election shall be held in the manner provided for a state general election under Minnesota election law as far as practicable. The question on the ballot shall be \"Shall the county proceed with the terms and conditions of its contract with the state of Minnesota for siting and operating a hazardous waste stabilization and containment facility in the county?\" The question is approved if a majority of those voting on the question vote \"Yes.\" The result of the election shall be certified to the county board of commissioners and is binding upon the county and the state as set forth in paragraph (c).\n(c) Effect of referendum. If the question is approved, the county and the state may proceed to implement the terms and conditions of the binding offer or of the contract. If the question is not approved, the stabilization and containment facility authorized under sections 115A.175 to 115A.194, shall not be located in the county.",
	"repealed": false
}