{
	"id": "462.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.39",
	"title": "462.39 POWERS AND DUTIES.",
	"text": "The commission shall have and exercise all powers which may be necessary or convenient to enable it to perform and carry out the duties and responsibilities of sections 462.381 to 462.398 or which may hereafter be imposed upon it by law. Such powers include the specific powers enumerated in this section. The commission is an instrumentality of the state for purposes of section 297A.70, subdivisions 1, 2, and 3.\nThe commission is authorized to receive public and private funds for purposes including, but not limited to program administration, multicounty planning, coordination, and development.\nThe commission may prepare and submit for adoption, after appropriate study and such public hearings as may be necessary, comprehensive plans for local units of government, individually or collectively, within the region. Plans may consist of policy statements, goals, standards, programs, and maps prescribing guides for orderly development within the jurisdiction subject to the plan. The plans shall recognize and incorporate planning principles which encompass physical, social, or economic needs of the region. In preparing development plans the commission shall use to the maximum extent feasible the resources studies and data available from other planning agencies within the region, including counties, municipalities, special districts, and subregional planning agencies, and it shall utilize the resources of state agencies to the same purpose.\nThe creation of a regional development commission does not affect the right of counties or municipalities to conduct subregional or district planning under sections 462.371 to 462.375 or 471.59. It is the purpose of sections 462.381 to 462.398 to encourage local and subdistrict planning capability and the regional commission shall as far as practical use the data, resources, and input of the local planning agencies.\nA regional development commission or, in regions not served by regional development commissions, a regional organization selected by the commissioner of employment and economic development, may develop a program to support planning on behalf of local units of government. The local planning must be related to issues of regional or statewide significance and may include, but is not limited to, the following:\n(1) local planning and development assistance, which may include local zoning ordinances and land use plans;\n(2) community or economic development plans, which may include workforce development plans, housing development plans and market analysis, JOBZ administration, grant writing assistance, and grant administration;\n(3) environment and natural resources plans, which may include solid waste management plans, wastewater management plans, and renewable energy development plans;\n(4) rural community health services; and\n(5) development of geographical information systems to serve regional needs, including hardware and software purchases and related labor costs.\nEach regional development commission or organization shall submit to the commissioner of employment and economic development an annual work program that outlines the work items for the upcoming year and establishes the relationship of the work items to development issues of regional or statewide significance. The entity completing the annual work program and identifying the statewide development issues shall consider input from the Departments of Employment and Economic Development, Natural Resources, Transportation, Agriculture, Commerce, and other state agencies as appropriate to the issues.",
	"repealed": false
}