{
	"id": "41B.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.025",
	"title": "41B.025 RURAL FINANCE AUTHORITY.",
	"text": "There is created a public body corporate and politic to be known as the \"Minnesota Rural Finance Authority,\" which shall perform the governmental functions and exercise the sovereign powers delegated to it in sections 41B.01 to 41B.23 and chapter 41C in furtherance of the public policies and purposes declared in section 41B.01. The board of the authority consists of the commissioners of agriculture, commerce, employment and economic development, and management and budget, the state auditor, and six public members appointed by the governor with the advice and consent of the senate. The state auditor may designate one staff member to serve in the auditor's place. No public member may reside within the metropolitan area, as defined in section 473.121, subdivision 2. Each member shall hold office until a successor has been appointed and has qualified. A certificate of appointment or reappointment of any member is conclusive evidence of the proper appointment of the member.\nThe membership terms, compensation, removal of members, and filling of vacancies for the public members of the authority are as provided in section 15.0575.\nThe commissioner of agriculture is the chair of the board. The commissioner of management and budget is the vice-chair of the board.\n[Repealed, 1987 c 396 art 1 s 32]\nA majority of the members of the authority, excluding vacancies, constitutes a quorum for the purpose of conducting its business and exercising its powers and for all other purposes. Action may be taken by the authority upon a vote of a majority of a quorum present.\nThe authority is under the administrative control of the commissioner of agriculture.\nThe members and officers of the authority are not liable personally, either jointly or severally, for any debt or obligation created or incurred by the authority.\nThe authority must make technical assistance available to potential lenders and applicants to encourage applications for loans.\nThe authority shall submit quarterly reports to the governor and the legislative committees and divisions with jurisdiction over agriculture and capital investment that provide an estimate of when funding for the authority's state bond-financed loan programs is projected to be exhausted.\nWhen feasible, the authority must make a decision on a completed loan application submitted by a borrower or eligible agricultural lender within ten business days.",
	"repealed": false
}