{
	"id": "299F.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.051",
	"title": "299F.051 ARSON TRAINING.",
	"text": "An arson training unit is established within the Division of Fire Marshal to develop and administer arson training courses throughout the state for law enforcement and fire service personnel and for prosecutors.\nThe arson training unit, in consultation with the Bureau of Criminal Apprehension, the state fire marshal, the Minnesota Peace Officer Standards and Training Board, the County Attorneys Association, the attorney general, and the State Advisory Council on Fire Service Education and Research, shall establish a standardized curriculum to be included in the training programs. The standardized curriculum shall include fire scene investigation and preservation of evidence, interviewing of witnesses and suspects, constitutional limits on interrogation by sworn and nonsworn officers, and other topics deemed necessary to successful criminal investigation and prosecution. The training program offered to peace officers shall meet the applicable preservice training requirements established by the Peace Officer Standards and Training Board under section 626.8456.\n(a) The arson training unit, in cooperation with the superintendent of the Bureau of Criminal Apprehension, the Board of Peace Officer Standards and Training, the County Attorneys Association, and the attorney general, shall provide courses at convenient locations in the state for training firefighters, peace officers, and prosecutors in:\n(1) the conduct of investigations following the occurrence of a fire; and\n(2) the prosecution of arson cases.\n(b) For this purpose, the arson training unit may use the services and employees of the bureau, the state fire marshal, and the attorney general. In addition, the arson training unit is authorized to establish minimum qualifications for training course instructors, and engage part-time instructors necessary and proper to furnish the best possible instruction, subject to the limitation of funds appropriated and available for expenditure. Laws 1981, chapter 210, sections 1 to 48, shall not apply to the part-time instructors.\nThe arson training unit, in cooperation with the Bureau of Criminal Apprehension, shall offer in-service and refresher training for firefighters and peace officers through schools administered by the state, county, school district, municipality, or joint or contractual combinations thereof. The in-service training courses offered for peace officers shall be eligible for continuing education credit from the Minnesota Board of Peace Officer Standards and Training.\nThe state fire marshal and the superintendent of the Bureau of Criminal Apprehension shall encourage the cooperation of local firefighters and peace officers in the investigation of violations of sections 609.561 to 609.576 or other crimes associated with reported fires in all appropriate ways.",
	"repealed": false
}