{
	"id": "58.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.125",
	"title": "58.125 PROHIBITION ON SERVICE AS A RESIDENTIAL MORTGAGE ORIGINATOR.",
	"text": "(a) \"Dishonesty\" means directly or indirectly to cheat or defraud; to cheat or defraud for monetary gain or its equivalent; or to wrongfully take property belonging to another in violation of any criminal statute. Dishonesty includes acts involving want of integrity, lack of probity, or a disposition to distort, cheat, or act deceitfully or fraudulently, and may include crimes which federal, state, or local laws define as dishonest.\n(b) \"Breach of trust\" means a wrongful act, use, misappropriation, or omission with respect to any property or fund which has been committed to a person in a fiduciary or official capacity, or the misuse of one's official or fiduciary position to engage in a wrongful act, use, misappropriation, or omission.\nExcept with the prior written consent of the commissioner under subdivision 4, any individual, who has been convicted of a criminal offense involving dishonesty or a breach of trust or money laundering, or has agreed to or entered into a pretrial diversion or similar program in connection with a prosecution for such offense, may not serve as a residential mortgage originator or be employed in that capacity by a person licensed as a mortgage originator.\nApproval is automatically granted and an application will not be required if the covered offense is considered de minimis because it meets all of the following criteria:\n(1) there is only one conviction or program entry of record for a covered offense;\n(2) the offense was punishable by imprisonment for a term of less than one year and/or a fine of less than $1,000, and the individual did not serve time in jail;\n(3) the conviction or program was entered at least five years before the date an application would otherwise be required; and\n(4) the offense did not involve a financial institution or residential mortgage loans.\n(a) An application for prior consent of the commissioner under this section must be in writing, under oath, and on a form obtained from and prescribed by the commissioner. The following factors must be considered by the commissioner when reviewing an application:\n(1) the specific nature of the offense and the circumstances surrounding the offense;\n(2) evidence of rehabilitation since the offense;\n(3) the age of the person at the time of conviction; and\n(4) whether or not restitution has been made.\n(b) The receipt by an individual of prior consent of the commissioner under this section must not be construed as imposing upon an employer an affirmative obligation to employ that individual in any capacity. Nothing in this section precludes an employer from denying employment based upon the existence of a criminal offense specified in subdivision 2 or for any other lawful reason.",
	"repealed": false
}