{
	"id": "62S.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.19",
	"title": "62S.19 UNINTENTIONAL LAPSE.",
	"text": "No individual long-term care policy or certificate shall be issued until the insurer has received from the applicant either a written designation of at least one person, in addition to the applicant, who is to receive notice of lapse or termination of the policy or certificate for nonpayment of premium or a written waiver dated and signed by the applicant electing not to designate additional persons to receive notice. The applicant has the right to designate at least one person who is to receive the notice of termination in addition to the insured. Designation shall not constitute acceptance of any liability on the third party for services provided to the insured. The form used for the written designation must provide space clearly designated for listing at least one person. The designation shall include each person's full name and home address. In the case of an applicant who elects not to designate an additional person, the waiver must state: \"Protection against unintended lapse. I understand that I have the right to designate at least one person other than myself to receive notice of lapse or termination of this long-term care insurance policy for nonpayment of premium. I understand that notice will not be given until 30 days after a premium is due and unpaid. I elect NOT to designate any person to receive such notice.\"\nThe insurer shall notify the insured of the right to change this written designation at least once every two years.\nWhen the policyholder or certificate holder pays the premium for a long-term care insurance policy or certificate through a payroll or pension deduction plan, the requirements specified under subdivision 1 are effective 60 days after the policyholder or certificate holder is no longer on the payment plan. The application or enrollment form for the policies or certificates must clearly indicate the payment plan selected by the applicant.\nNo individual long-term care policy or certificate shall lapse or be terminated for nonpayment of premium unless the insurer, at least 30 days before the effective date of the lapse or termination, has given notice to the insured and to those persons designated under subdivision 1, at the address provided by the insured for purposes of receiving notice of lapse or termination. Notice must be given by first class United States mail, postage prepaid, and notice may not be given until 30 days after a premium is due and unpaid. Notice is considered to have been given as of five days after the date of mailing.\nIn addition to the requirement in subdivision 1, a long-term care insurance policy or certificate must include a provision which provides for reinstatement of coverage, in the event of lapse, if the insurer is provided proof of cognitive impairment or the loss of functional capacity. This option must be available to the insured if requested within five months after termination and must allow for the collection of past due premium, where appropriate. The standard of proof of cognitive impairment or loss of functional capacity shall not be more stringent than the benefit eligibility criteria on cognitive impairment or the loss of functional capacity, if any, contained in the policy and certificate.",
	"repealed": false
}