{
	"id": "52.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.001",
	"title": "52.001 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given.\n\"Board\" means the board of directors of a credit union.\n\"Commissioner\" means the commissioner of the Department of Commerce.\n\"Credit union\" means a cooperative, not-for-profit financial institution formed and operating under this chapter.\n\"Community\" means an identifiable local neighborhood, community, rural district, or other geographically well-defined area in which individuals have common interests or interact. \"Well-defined\" means the proposed area has specific geographic boundaries, including a school district, city, township, county, or clearly identifiable neighborhood, but does not include the state as a whole.\n\"Director\" means a member of the board.\n\"Federal credit union\" means a credit union organized and operating under the laws of the United States.\n\"Insolvent\" means the condition that results when the cash value of assets realizable in a reasonable period of time is less than the liabilities that must be met within that time.\n\"Member\" means a person whose application for membership has been approved as meeting the membership criteria of the credit union, who has paid any required entrance or membership fee, and who has paid for one or more shares.\n\"Organization\" means any corporation, association, partnership, limited liability company, cooperative, trust, or other legal entity.\n\"Out-of-state credit union\" means a credit union organized under the laws of another state or United States territory or possession.\n\"Small group\" means a group that has less than 500 potential members that has made a written request to a credit union for credit union services.\n\"Unsafe or unsound practice\" means any action or lack of action that is contrary to generally accepted standards of prudent operation and that poses an abnormal risk of loss to the credit union or its members.",
	"repealed": false
}