{
	"id": "469.017",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.017",
	"title": "469.017 HOUSING DEVELOPMENT PROJECTS.",
	"text": "Before carrying out a housing development project an authority must find that the project is necessary to alleviate a shortage of decent, safe, and sanitary housing for persons of low or moderate income and their families as such income is determined by the authority. No housing development project involving the use of the power of eminent domain shall be carried out by an authority without the prior approval of the governing body of the municipality in which the project is located. A housing development project or any interest therein may be sold or leased to private developers before, during, or after the completion of construction of improvements thereon. The sale or lease shall be in accordance with the provisions of section 469.029, subdivisions 2, 5, and 7, except that the provisions requiring conformance to a redevelopment plan shall not be applicable. The sale or lease may be made for other than housing purposes if the authority finds that changed circumstances arising subsequent to the acquisition of the project make a sale or lease for housing purposes inappropriate. Nothing in this section shall limit the power of the authority to acquire or dispose of real property pursuant to sections 469.012, subdivision 1h, and 469.029, subdivisions 9 and 10, except that any exercise of the power of eminent domain pursuant to section 469.012, subdivision 1h, shall not be carried out by an authority without the prior approval of the governing body of the municipality in which the housing development project is located. The authority shall have the power to transfer such real property in accordance with the provisions of sections 469.012, subdivision 1h, and 469.029, subdivisions 9 and 10, before, during, or after the completion of construction, rehabilitation, or improvements thereon, except that the transfer shall be in accordance with the provisions of section 469.029, subdivisions 2, 5, and 7, except as elsewhere provided in Laws 1974, chapter 228.",
	"repealed": false
}