{
	"id": "504B.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.375",
	"title": "504B.375 UNLAWFUL EXCLUSION OR REMOVAL; ACTION FOR RECOVERY OF POSSESSION.",
	"text": "(a) This section applies to actual or constructive removal or exclusion of a residential tenant which may include the termination of utilities or the removal of doors, windows, or locks. A residential tenant to whom this section applies may recover possession of the premises as described in paragraphs (b) to (e).\n(b) The residential tenant shall present a verified petition to the district court of the judicial district of the county in which the premises are located that:\n(1) describes the premises and the landlord;\n(2) specifically states the facts and grounds that demonstrate that the exclusion or removal was unlawful, including a statement that no writ of recovery of the premises and order to vacate has been issued under section 504B.345 in favor of the landlord and against the residential tenant and executed in accordance with section 504B.365; and\n(3) asks for possession.\n(c) If it clearly appears from the specific grounds and facts stated in the verified petition or by separate affidavit of the residential tenant or the residential tenant's attorney or agent that the exclusion or removal was unlawful, the court shall immediately order that the residential tenant have possession of the premises.\n(d) The residential tenant shall furnish security, if any, that the court finds is appropriate under the circumstances for payment of all costs and damages the landlord may sustain if the order is subsequently found to have been obtained wrongfully. In determining the appropriateness of security, the court shall consider the residential tenant's ability to afford monetary security.\n(e) The court shall direct the order to the sheriff of the county in which the premises are located and the sheriff shall execute the order immediately by making a demand for possession on the landlord, if found, or the landlord's agent or other person in charge of the premises. If the landlord fails to comply with the demand, the officer shall take whatever assistance may be necessary and immediately place the residential tenant in possession of the premises. If the landlord, the landlord's agent, or other person in control of the premises cannot be found and if there is no person in charge, the officer shall immediately enter into and place the residential tenant in possession of the premises. The officer shall also serve the order and verified petition or affidavit immediately upon the landlord or agent, in the same manner as a summons is required to be served in a civil action in district court.\n(f) The court administrator may charge a filing fee in the amount set for complaints and counterclaims in conciliation court, subject to the filing of an inability to pay affidavit.\nThe landlord may, by written motion and notice served by mail or personally on the residential tenant or the residential tenant's attorney at least two days before the hearing date on the motion, obtain dissolution or modification of the order for possession issued under subdivision 1, paragraph (c), unless the residential tenant proves the facts and grounds on which the order is issued. A landlord bringing a motion under this subdivision may recover possession of the premises only by an eviction action or otherwise provided by law. Upon the dissolution of the order, the court shall assess costs against the residential tenant, subject to the provisions of section 563.01, and may allow damages and reasonable attorney fees for the wrongful granting of the order for possession. If the order is affirmed, the court shall tax costs against the landlord and may allow the residential tenant reasonable attorney's fees.\nAn order issued under subdivision 1, paragraph (c), or affirmed, modified, or dissolved under subdivision 2, is a final order for purposes of appeal. Either party may appeal the order within ten days after entry. If the party appealing remains in possession of the premises, bond must be given to:\n(1) pay all costs of the appeal;\n(2) obey the court's order; and\n(3) pay all rent and other damages that justly accrue to the party excluded from possession during the pendency of the appeal.\nA provision of an oral or written lease or other agreement in which a residential tenant waives this section is contrary to public policy and void.\nThe purpose of this section is to provide an additional and summary remedy for residential tenants unlawfully excluded or removed from rental property and, except where expressly provided in this section, sections 504B.285 to 504B.371 do not apply to proceedings under this section.\nIn addition to residential tenants and landlords, this section applies to:\n(1) occupants and owners of residential real property that is the subject of a mortgage foreclosure or contract for deed cancellation for which the period for redemption or reinstatement of the contract has expired; and\n(2) mortgagees and contract for deed vendors.",
	"repealed": false
}