{
	"id": "204B.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.36",
	"title": "204B.36 BALLOTS; FORM.",
	"text": "All ballots shall be printed with black ink on paper of sufficient thickness to prevent the printing from being discernible from the back. All ballots shall be printed in easily readable type with suitable lines dividing candidates, offices, instructions and other matter printed on ballots. The same type shall be used for the names of all candidates on the same ballot.\nThe name of each candidate shall be printed at a right angle to the length of the ballot. At a general election the name of the political party or the political principle of each candidate for partisan office shall be printed above or below the name of the candidate. The name of a political party or a political principle shall be printed in capital and lowercase letters of the same type, with the capital letters at least one-half the height of the capital letters used for names of the candidates. At a general or special election, blank lines containing the words \"write-in, if any\" shall be printed below the name of the last candidate for each office, or below the title of the office if no candidate has filed for that office, so that a voter may write in the names of individuals whose names are not on the ballot. One blank line shall be printed for each officer of that kind to be elected. At a primary election, no blank lines shall be provided for writing in the names of individuals whose names do not appear on the primary ballot.\nOn the left side of the ballot at the same level with the name of each candidate and each blank line shall be printed an oval or similar target shape in which the voter may designate a vote by filling in the oval or similar mark if a different target shape is used. Each oval or target shape shall be the same size. Above the first name on each ballot shall be instructions for voting. Directly underneath the official title of each office shall be printed the words \"Vote for one\" or \"Vote for up to ...\" (any greater number to be elected).\nWhen a question is to be submitted to a vote, a concise statement of the nature of the question shall be printed on the ballot. The words, \"Yes\" and \"No\" shall be printed to the left of this statement, with an oval or similar target shape to the left of each word so that the voter may indicate by a mark either a negative or affirmative vote. The ballot shall include instructions directing the voter to fill in the oval or similar mark if a different target shape is used, before the word \"Yes\" if the voter desires to vote for the question, or to fill in the oval or similar mark if a different target shape is used, before the word \"No\" if the voter desires to vote against the question.\nThe official ballot shall contain the names of all candidates for each judicial office and shall state the number of those candidates for whom a voter may vote. Each seat for an associate justice, associate judge, or judge of the district court must be numbered. The words \"Supreme Court,\" \"Court of Appeals,\" and \"(number) District Court\" must be printed above the respective judicial office groups on the ballot. The title of each judicial office shall be printed on the official primary and general election ballot as follows:\n(1) In the case of the supreme court:\n\"Chief justice\";\n\"Associate justice (number)\";\n(2) In the case of the court of appeals:\n\"Judge (number)\"; or\n(3) In the case of the district court:\n\"Judge (number).\"\nIf a chief justice, associate justice, or judge is a candidate to succeed again, the word \"incumbent\" shall be printed after that judge's name as a candidate.",
	"repealed": false
}