{
	"id": "56.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/56.155",
	"title": "56.155 INSURANCE IN CONNECTION WITH LOAN.",
	"text": "Notwithstanding section 47.59 to the contrary, no licensee shall, directly or indirectly, sell or offer for sale any insurance in connection with any loan made under this chapter except as and to the extent authorized by this section. The sale of credit life, credit accident and health, and credit involuntary unemployment insurance is subject to the provisions of chapter 62B, except that the term of the insurance may exceed 60 months if the term of the loan exceeds 60 months. Life, accident, health, and involuntary unemployment insurance, or any of them, may be written upon or in connection with any loan but must not be required as additional security for the indebtedness. If the debtor chooses to procure credit life insurance, credit accident and health insurance, or credit involuntary unemployment insurance as security for the indebtedness, the debtor shall have the option of furnishing this security through existing policies of insurance that the debtor owns or controls, or of furnishing the coverage through any insurer authorized to transact business in this state. A statement in substantially the following form must be made orally, except for loans by mail pursuant to section 56.12, and provided in writing in boldface type of a minimum size of 12 points to the borrower before the transaction is completed for each credit life, accident and health, and involuntary unemployment insurance coverage sold:\nCREDIT LIFE INSURANCE, CREDIT DISABILITY INSURANCE, AND CREDIT INVOLUNTARY UNEMPLOYMENT INSURANCE ARE NOT REQUIRED TO OBTAIN CREDIT. YOU MAY BUY ANY INSURANCE FROM ANYONE YOU CHOOSE OR YOU MAY USE EXISTING INSURANCE.\nThe licensee shall disclose whether or not the benefits commence as of the first day of disability or involuntary unemployment and shall further disclose the number of days that an insured obligor must be disabled or involuntarily unemployed, as defined in the policy, before benefits, whether retroactive or nonretroactive, commence. In case there are multiple obligors under a transaction subject to this chapter, no policy or certificate of insurance providing credit accident and health, credit life insurance, or credit unemployment benefits may be procured by or through a licensee upon more than two of the obligors in which case they shall be insured jointly or in the case of credit unemployment benefits on a basis provided for in rules adopted by the commissioner. The premium or identifiable charge for the insurance must not exceed that filed by the insurer with the Department of Commerce. The charge, computed at the time the loan is made for a period not to exceed the full term of the loan contract on an amount not to exceed the total amount required to pay principal and charges, may be deducted from the proceeds or may be included as part of the principal of any loan. If a borrower procures insurance by or through a licensee, the statement required by section 56.14 must disclose the cost to the borrower and the type of insurance, and the licensee shall cause to be delivered to the borrower a copy of the policy, certificate, or other evidence thereof, within a reasonable time. No licensee shall decline new or existing insurance which meets the standards set out in this section nor prevent any obligor from obtaining this insurance coverage from other sources. Notwithstanding any other provision of this chapter, any gain or advantage to the licensee or to any employee, affiliate, or associate of the licensee from this insurance or the sale or provision thereof is not an additional or further charge in connection with the loan; nor are any of the provisions pertaining to insurance contained in this section prohibited by any other provision of this chapter.\nA licensee may require the obligors to provide insurance on real or personal property security against reasonable risks of loss, damage, and destruction. The amount and term of the insurance shall be reasonable in relation to the value of the security and shall not exceed the principal amount of the loan less any existing insurance, including homeowner's insurance as defined by section 65A.27, subdivision 4, on the secured property as to which the lender has been provided a loss payable clause, except that the lender may insure or arrange for insurance not to exceed the reasonable value of any motor vehicle collateral less any existing insurance on the motor vehicle as to which the lender has been provided a loss payable clause. The term of the insurance shall also be reasonable in relation to the value of the security and shall not exceed the term of the loan. The restrictions contained in this subdivision shall not apply to the sale or provision of homeowner's insurance as defined in section 65A.27. In all cases when insurance is offered the obligor shall be informed that the obligor has the option of providing insurance through existing policies of insurance that the obligor owns or controls, or by procuring and furnishing the offered coverage through any insurer authorized to transact an insurance business within this state. The purchase of such insurance through the licensee or from an agent, broker, or insurer specified by the licensee shall not be required.",
	"repealed": false
}