{
	"id": "523.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/523.20",
	"title": "523.20 LIABILITY OF PARTIES REFUSING AUTHORITY OF ATTORNEY-IN-FACT TO ACT ON PRINCIPAL'S BEHALF.",
	"text": "Any party refusing to accept the authority of an attorney-in-fact to exercise a power granted by a power of attorney which (1) is executed in conformity with section 523.23 or a form prepared under section 523.231; (2) contains a specimen signature of the attorney-in-fact authorized to act; (3) for a power of attorney executed on or after January 1, 2014, contains an acknowledgement that the attorney-in-fact has read and understood the notice to the attorney-in-fact required under section 523.23; (4) with regard to the execution or delivery of any recordable instrument relating to real property, is accompanied by affidavits that satisfy the provisions of section 523.17; (5) with regard to any other transaction, is signed by the attorney-in-fact in a manner conforming to section 523.18; and (6) when applicable, is accompanied by an affidavit and any other document required by section 523.16, is liable to the principal and to the principal's heirs, assigns, and representative of the estate of the principal in the same manner as the party would be liable had the party refused to accept the authority of the principal to act on the principal's own behalf unless: (1) the party has actual notice of the revocation of the power of attorney prior to the exercise of the power; (2) the duration of the power of attorney specified in the power of attorney itself has expired; or (3) the party has actual knowledge of the death of the principal or, if the power of attorney is not a durable power of attorney, actual notice of a judicial determination that the principal is legally incompetent. This provision does not negate any liability which a party would have to the principal or to the attorney-in-fact under any other form of power of attorney under the common law or otherwise.",
	"repealed": false
}