{
	"id": "181A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.08",
	"title": "181A.08 POWERS AND DUTIES OF THE DEPARTMENT.",
	"text": "The commissioner, an authorized representative, or any truant officer may enter and inspect the place of business or employment and may interview any employees, of any employer of employees in any occupation in the state, all for the purpose of ascertaining whether any minors are employed contrary to the provisions of sections 181A.01 to 181A.12. Such authorized persons may require that employment certificates, age certificates, and lists of minors employed shall be produced for their inspection.\nThe commissioner or an authorized representative may issue an order requiring an employer to comply with the provisions of sections 181A.01 to 181A.12 or with any rules promulgated under the provisions of section 181A.09. Any such order shall be served by the department upon the employer or an authorized representative in person or by certified mail at the employers place of business. If an employer wishes to contest the order for any reason, the employer shall file written notice of objection with the commissioner within 15 calendar days after service of said order upon said employer. Thereafter, a public hearing shall be held in accordance with the provisions of sections 14.57 to 14.69, and such rules consistent therewith as the commissioner shall make. If, within 15 calendar days after being served with the order, the employer fails to file a written notice of objection with the commissioner, the order becomes a final order of the commissioner.\nIf an employer is found by the commissioner to have violated any provision of sections 181A.01 to 181A.12, or any rules promulgated under section 181A.09, and the commissioner issues an order to comply under subdivision 2, the commissioner shall order the employer to cease and desist from engaging in the violative practice and to take affirmative steps that in the judgment of the commissioner will effectuate the purposes of the section or rule violated. The commissioner may order the employer to reimburse the department and the attorney general for appropriate litigation and hearing costs expended in preparation for and in conducting the contested case proceeding, unless payment of costs would impose extreme financial hardship on the employer. If the employer is able to establish extreme financial hardship, then the commissioner may order the employer to pay a percentage of the total costs that will not cause extreme financial hardship. Costs include but are not limited to the costs of services rendered by the attorney general, private attorneys if engaged by the department, administrative law judges, court reporters, and expert witnesses as well as the cost of transcripts. Interest shall accrue on, and be added to, the unpaid balance of a commissioner's order from the date the order is signed by the commissioner until it is paid, at an annual rate provided in section 549.09, subdivision 1, paragraph (c).\nThe commissioner or an authorized representative may apply to any court of competent jurisdiction for an order restraining the violation of an order issued by the commissioner pursuant to subdivision 2, or for an order enjoining and restraining violations of this chapter or rules adopted pursuant to section 181A.09.",
	"repealed": false
}