{
	"id": "221.0255",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.0255",
	"title": "221.0255 MOTOR CARRIER OF RAILROAD EMPLOYEES.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"conviction\" has the meaning given in section 609.02; and\n(2) \"on-duty time\" means all time from the time a driver begins to work, or is required to be in readiness to work, until the time the driver is relieved from work, including: (i) driving time; (ii) time at a terminal, facility, or other property of a contract carrier; (iii) time on any public or private property waiting to be dispatched; (iv) time spent in working hours by a driver while under employment or agreement with another employer who is not a motor carrier of railroad employees; and (v) time spent inspecting, servicing, conditioning, or attending a vehicle.\n(a) A motor carrier of railroad employees must meet the requirements specified in this section, is subject to section 221.291, and is otherwise exempt from the provisions of this chapter.\n(b) The requirements of this section for a motor carrier of railroad employees or a vehicle operator for a motor carrier of railroad employees apply in the same manner to any entity that enters into an agreement with the carrier to transport railroad employees.\n(a) A vehicle operator for a motor carrier of railroad employees who transports passengers must:\n(1) have a valid driver's license under chapter 171;\n(2) submit to physical examinations that meet the requirements for commercial motor vehicle operators under Code of Federal Regulations, title 49, sections 391.41 to 391.45, or successor requirements; and\n(3) perform pretrip and posttrip vehicle inspections.\n(b) A vehicle operator may not communicate over or otherwise operate a handheld cellular phone when the vehicle is in motion or a part of traffic.\n(a) The motor carrier of railroad employees must implement a policy that provides for annual training and certification of the operator in:\n(1) safe operation of the vehicle transporting railroad employees;\n(2) knowing and understanding relevant laws, rules of the road, and safety policies;\n(3) handling emergency situations;\n(4) proper use of seat belts;\n(5) performance of pretrip and posttrip vehicle inspections, and inspection record keeping; and\n(6) proper maintenance of required records.\n(b) The motor carrier of railroad employees must:\n(1) confirm that the person is not disqualified under subdivision 6, by performing a criminal background check of the operator, which must include:\n(i) a criminal history check of the state criminal records repository; and\n(ii) if the operator has resided in Minnesota less than five years, a criminal history check from each state of residence for the previous five years;\n(2) annually verify the operator's driver's license;\n(3) document meeting the requirements in this subdivision, which must include maintaining at the carrier's business location:\n(i) a driver qualification file on each operator who transports passengers under this section; and\n(ii) records of pretrip and posttrip vehicle inspections as required under subdivision 3, paragraph (a), clause (3);\n(4) maintain liability insurance in a minimum amount of $5,000,000 regardless of the seating capacity of the vehicle;\n(5) maintain uninsured and underinsured coverage in a minimum amount of $2,000,000; and\n(6) ensure inspection of each vehicle operated under this section as provided under section 169.781.\n(c) A driver qualification file under paragraph (b), clause (3), must include:\n(1) a copy of the operator's most recent medical examiner's certificate;\n(2) a copy of the operator's current driver's license;\n(3) documentation of annual license verification;\n(4) documentation of annual training;\n(5) documentation of any known violations of motor vehicle or traffic laws; and\n(6) responses from previous employers, if required by the current employer.\n(d) The driver qualification file must be retained for one year following the date of separation of employment of the driver from the carrier. A record of inspection under paragraph (b), clause (3), item (ii), must be retained for one year following the date of inspection.\n(e) If a party contracts with the motor carrier on behalf of the railroad to transport the railroad employees, then the insurance requirements may be satisfied by either that party or the motor carrier, so long as the motor carrier is a named insured or additional insured under any policy.\n(a) No vehicle operator may transport passengers in a motor vehicle that does not meet the requirements of this subdivision.\n(b) A motor vehicle used to transport passengers under this section must be designed to transport ten or fewer persons, including the driver.\n(c) A motor carrier of railroad employees shall maintain the following on a motor vehicle used to transport passengers:\n(1) tires that meet the same requirements as for a motor vehicle under Code of Federal Regulations, title 49, section 393.75, or successor requirements;\n(2) a full-size spare tire that is fully inflated;\n(3) properly functioning seat belts for the driver and every passenger being transported;\n(4) a properly functioning heater, defroster, and air conditioner;\n(5) a windshield, side windows, and a rear window that are clear of any obstructions, including but not limited to electronic devices, and otherwise conform with the requirements of section 169.71;\n(6) a working cellular telephone or two-way radio capable of contacting personnel of the railroad that employs the passengers being transported;\n(7) a global positioning system device capable of identifying the vehicle's current location;\n(8) an emergency road kit, which must at a minimum contain a blanket, flares or reflective triangles, jumper cables, and a secured fire extinguisher;\n(9) a safety glass hammer or belt cutter;\n(10) a location for personal baggage storage, so that all baggage can be secured in a manner that prevents entry into or flight within the vehicle cabin; and\n(11) a vehicle identification marking that:\n(i) identifies the legal or a single trade name of the motor carrier and bears an inscription as determined by the commissioner identifying the vehicle as used by a motor carrier of railroad employees;\n(ii) is located on both sides of the vehicle;\n(iii) is in letters that contrast sharply in color with the background on which the letters are placed; and\n(iv) is readily legible during daylight hours from a distance of 50 feet when the vehicle is stationary.\n(a) A person who sustains a conviction of violating section 169A.25, 169A.26, 169A.27, or 169A.31, whose driver's license is revoked under sections 169A.50 to 169A.53 of the implied consent law or section 171.177, or who is convicted of or has their driver's license revoked under a similar statute or ordinance of another state, may not operate a vehicle under this subdivision for five years from the date of conviction.\n(b) A person who sustains a conviction of a moving violation in violation of chapter 169 within three years of the first of three other moving violations may not operate a vehicle under this subdivision for one year from the date of the last conviction.\n(c) A person who has ever been convicted of a disqualifying offense as defined in section 171.3215, subdivision 1, paragraph (c), may not operate a vehicle under this subdivision.\n(d) An operator who sustains a conviction as described in paragraph (a) while employed by the carrier shall report the conviction to the carrier within ten days of the date of the conviction.\nA carrier must implement a mandatory alcohol and controlled substance testing program as provided under sections 181.950 to 181.957 that consists of preemployment testing, postaccident testing, random testing, reasonable suspicion testing, return-to-duty testing, and follow-up testing.\n(a) A motor carrier of railroad employees shall not allow or require a driver to drive or remain on duty for more than: ten hours after eight consecutive hours off duty; 15 hours of combined on-duty time and drive time since last obtaining eight consecutive hours of off-duty time; or 70 hours of on-duty and drive time in any period of eight consecutive days. After 24 hours off duty, a driver begins a new seven consecutive day period and on-duty time is reset to zero.\n(b) An operator who encounters an emergency and cannot, because of that emergency, safely complete a transportation assignment within the ten-hour maximum driving time permitted under paragraph (a), may drive for not more than two additional hours in order to complete that transportation assignment or to reach a place offering safety for the occupants of the vehicle and security for the transport motor vehicle, if the transportation assignment reasonably could have been completed within the ten-hour period absent the emergency.\n(c) A carrier shall maintain and retain for a period of six months accurate time records that show the time the driver reports for duty each day, the total number of hours of on-duty time for each driver for each day, the time the driver is released from duty each day, and the total number of hours driven each day.\n(a) Upon receipt of a complaint form or other information alleging a violation of this section, the commissioner must investigate the relevant matter. Representatives of the Department of Transportation and the State Patrol have the authority to enter, at a reasonable time and place, any vehicle or facility of the carrier for purposes of complaint investigations, random inspections, safety reviews, audits, or accident investigations.\n(b) Failure of a railroad or motor carrier of railroad employees to permit a complaint investigation under this subdivision is grounds for issuance of a civil penalty under subdivision 10.\n(a) After completion of an investigation or as provided in subdivision 9, paragraph (b), the commissioner may issue a civil penalty to a railroad or motor carrier of railroad employees that violates this section. A civil penalty issued under this paragraph is in the amount of:\n(1) not less than $200 but not more than $500 for a first offense;\n(2) not less than $500 but not more than $1,000 for a second offense; and\n(3) not less than $1,000 but not more than $5,000 for a third or subsequent offense committed within three years of the first offense.\n(b) The civil penalty amounts identified under paragraph (a) are for all violations identified in a single investigation and are not per violation.\n(c) The recipient of a civil penalty under this subdivision has 30 days to notify the commissioner in writing of intent to contest the civil penalty. If within 30 days after receiving the civil penalty the recipient fails to notify the commissioner of intent to contest the penalty, the civil penalty is not subject to further review.\n(d) Civil penalties assessed under this subdivision are subject to chapter 14 and may be recovered in a civil action.\n(e) Civil penalties collected under this section must be deposited in the state rail safety inspection account in the special revenue fund.",
	"repealed": false
}