{
	"id": "260C.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.215",
	"title": "260C.215 WELFARE OF CHILDREN.",
	"text": "Each authorized child-placing agency shall make special efforts to recruit a foster family from among the child's relatives, except as authorized in section 260C.193, subdivision 3. In recruiting placements for each child, the agency must focus on that child's particular needs and the capacities of the particular prospective foster parents to meet those needs. Each agency shall provide for diligent recruitment of potential foster families that reflect the ethnic and racial diversity of the children in the state for whom foster homes are needed. Special efforts include contacting and working with community organizations and religious organizations and may include contracting with these organizations, utilizing local media and other local resources, conducting outreach activities, and increasing the number of minority recruitment staff employed by the agency. The requirement of special efforts to locate relatives in this section is satisfied on the earlier of the following occasions:\n(1) when the child is placed with a relative who is interested in providing a permanent placement for the child; or\n(2) when the responsible child-placing agency has made special efforts for six months following the child's placement in a residential facility and the court approves the agency's efforts pursuant to section 260C.202. The agency may accept any gifts, grants, offers of services, and other contributions to use in making special recruitment efforts.\n[Repealed, 2012 c 216 art 6 s 14]\nThe commissioner shall designate a permanent professional staff position for recruitment of foster and adoptive families. The recruitment specialist shall provide services to child-placing agencies seeking to recruit adoptive and foster care families and qualified professional staff. The recruitment specialist shall:\n(1) develop materials for use by the agencies in training staff;\n(2) conduct in-service workshops for agency personnel;\n(3) provide consultation, technical assistance, and other appropriate services to agencies to strengthen and improve service delivery to diverse populations; and\n(4) conduct workshops for foster care and adoption recruiters to evaluate the effectiveness of techniques for recruiting foster and adoptive families; and\n(5) perform other duties as assigned by the commissioner to implement the Minnesota Indian Family Preservation Act, sections 260.751 to 260.835.\nThe commissioner may contract for portions of these services.\nThe commissioner of children, youth, and families shall:\n(1) provide practice guidance to responsible social services agencies and licensed child-placing agencies that reflect federal and state laws and policy direction on placement of children;\n(2) develop criteria for determining whether a prospective adoptive or foster family has the ability to understand and validate the child's cultural background;\n(3) provide a standardized training curriculum for adoption and foster care workers and administrators who work with children. Training must address the following objectives:\n(i) developing and maintaining sensitivity to all cultures;\n(ii) assessing values and their cultural implications;\n(iii) making individualized placement decisions that advance the best interests of a particular child under section 260C.212, subdivision 2; and\n(iv) issues related to cross-cultural placement;\n(4) provide a training curriculum for all prospective adoptive and foster families that prepares them to care for the needs of adoptive and foster children taking into consideration the needs of children outlined in section 260C.212, subdivision 2, paragraph (b), and, as necessary, preparation is continued after placement of the child and includes the knowledge and skills related to reasonable and prudent parenting standards for the participation of the child in age or developmentally appropriate activities, according to section 260C.212, subdivision 14;\n(5) develop and provide to responsible social services agencies and licensed child-placing agencies a home study format to assess the capacities and needs of prospective adoptive and foster families. The format must address problem-solving skills; parenting skills; evaluate the degree to which the prospective family has the ability to understand and validate the child's cultural background, and other issues needed to provide sufficient information for agencies to make an individualized placement decision consistent with section 260C.212, subdivision 2. For a study of a prospective foster parent, the format must also address the capacity of the prospective foster parent to provide a safe, healthy, smoke-free home environment. If a prospective adoptive parent has also been a foster parent, any update necessary to a home study for the purpose of adoption may be completed by the licensing authority responsible for the foster parent's license. If a prospective adoptive parent with an approved adoptive home study also applies for a foster care license, the license application may be made with the same agency which provided the adoptive home study;\n(6) consult with representatives reflecting diverse populations from the councils established under sections 3.922 and 15.0145, and other state, local, and community organizations; and\n(7) establish family foster setting licensing guidelines for county agencies and private agencies designated or licensed by the commissioner to perform licensing functions and activities under section 142B.10. Guidelines that the commissioner establishes under this clause shall be considered directives of the commissioner under section 142B.30.\nThe commissioner shall provide to the Indian Affairs Council, the Minnesota Council on Latino Affairs, the Council for Minnesotans of African Heritage, and the Council on Asian-Pacific Minnesotans the annual report required under section 257.0725.\n(a) Each authorized child-placing agency must:\n(1) develop and follow procedures for implementing the requirements of section 260C.212, subdivision 2, and the Indian Child Welfare Act, United States Code, title 25, sections 1901 to 1923;\n(2) have a written plan for recruiting adoptive and foster families that reflect the ethnic and racial diversity of children who are in need of foster and adoptive homes. The plan must include:\n(i) strategies for using existing resources in diverse communities;\n(ii) use of diverse outreach staff wherever possible;\n(iii) use of diverse foster homes for placements after birth and before adoption; and\n(iv) other techniques as appropriate;\n(3) have a written plan for training adoptive and foster families;\n(4) have a written plan for employing staff in adoption and foster care who have the capacity to assess the foster and adoptive parents' ability to understand and validate a child's cultural and meet the child's individual needs, and to advance the best interests of the child, as required in section 260C.212, subdivision 2. The plan must include staffing goals and objectives;\n(5) ensure that adoption and foster care workers attend training offered or approved by the Department of Children, Youth, and Families regarding cultural diversity and the needs of special needs children;\n(6) develop and implement procedures for implementing the requirements of the Indian Child Welfare Act and the Minnesota Indian Family Preservation Act; and\n(7) ensure that children in foster care are protected from the effects of secondhand smoke and that licensed foster homes maintain a smoke-free environment in compliance with subdivision 9.\n(b) In determining the suitability of a proposed placement of an Indian child, the standards to be applied must be the prevailing social and cultural standards of the Indian child's community, and the agency shall defer to tribal judgment as to suitability of a particular home when the tribe has intervened pursuant to the Indian Child Welfare Act.\nEach authorized child-placing agency shall provide to the commissioner of children, youth, and families all data needed by the commissioner for the report required by section 257.0725. The agency shall provide the data within 15 days of the end of the period for which the data is applicable.\nThe commissioner of children, youth, and families shall adopt rules to establish standards for conducting relative searches, recruiting foster and adoptive families, evaluating the role of relative status in the reconsideration of disqualifications under chapter 245C and granting variances of licensing requirements under section 142B.10, subdivision 16, in licensing or approving an individual related to a child.\n(a) A child in foster care shall not be exposed to any type of secondhand smoke in the following settings:\n(1) a licensed foster home or any enclosed space connected to the home, including a garage, porch, deck, or similar space; or\n(2) a motor vehicle while a foster child is transported.\n(b) Smoking in outdoor areas on the premises of the home is permitted, except when a foster child is present and exposed to secondhand smoke.\n(c) The home study required in subdivision 4, clause (5), must include a plan to maintain a smoke-free environment for foster children.\n(d) If a foster parent fails to provide a smoke-free environment for a foster child, the child-placing agency must ask the foster parent to comply with a plan that includes training on the health risks of exposure to secondhand smoke. If the agency determines that the foster parent is unable to provide a smoke-free environment and that the home environment constitutes a health risk to a foster child, the agency must reassess whether the placement is based on the child's best interests consistent with section 260C.212, subdivision 2.\n(e) Nothing in this subdivision shall delay the placement of a child with a relative, consistent with section 142B.06, unless the relative is unable to provide for the immediate health needs of the individual child.\n(f) If a child's best interests would most effectively be served by placement in a home which will not meet the requirements of paragraph (a), the failure to meet the requirements of paragraph (a) shall not be a cause to deny placement in that home.\n(g) Nothing in this subdivision shall be interpreted to interfere, conflict with, or be a basis for denying placement pursuant to the provisions of the federal Indian Child Welfare Act or Minnesota Indian Family Preservation Act.\n(h) Nothing in this subdivision shall be interpreted to interfere with traditional or spiritual Native American or religious ceremonies involving the use of tobacco.",
	"repealed": false
}