{
	"id": "245.4663",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4663",
	"title": "245.4663 MENTAL HEALTH PROVIDER SUPERVISION GRANT PROGRAM.",
	"text": "The commissioner shall award grants to licensed or certified mental health providers that meet the criteria in subdivision 2 to fund supervision of or preceptorships for students, interns, and clinical trainees who are working toward becoming mental health professionals; to subsidize the costs of licensing applications and examination fees for clinical trainees; and to fund training for workers to become supervisors. For purposes of this section, an intern may include an individual who is working toward an undergraduate degree in the behavioral sciences or related field at an accredited educational institution.\nIn order to be eligible for a grant under this section, a mental health provider must:\n(1) provide at least 25 percent of the provider's yearly patient encounters to state public program enrollees or patients receiving sliding fee schedule discounts through a formal sliding fee schedule meeting the standards established by the United States Department of Health and Human Services under Code of Federal Regulations, title 42, section 51c.303;\n(2) primarily serve underrepresented communities as defined in section 148E.010, subdivision 20; or\n(3) provide services to people in a city or township that is not within the seven-county metropolitan area as defined in section 473.121, subdivision 2, and is not the city of Duluth, Mankato, Moorhead, Rochester, or St. Cloud.\nA mental health provider seeking a grant under this section must apply to the commissioner at a time and in a manner specified by the commissioner. The commissioner shall review each application to determine if the application is complete, the mental health provider is eligible for a grant, and the proposed project is an allowable use of grant funds. The commissioner must determine the grant amount awarded to applicants that the commissioner determines will receive a grant.\nA mental health provider must use grant funds received under this section for one or more of the following:\n(1) to pay for direct supervision hours or preceptorships for students, interns, and clinical trainees, in an amount up to $7,500 per student, intern, or clinical trainee;\n(2) to establish a program to provide supervision to multiple students, interns, or clinical trainees;\n(3) to pay licensing application and examination fees for clinical trainees; or\n(4) to provide a weekend training program for workers to become supervisors.\nDuring the grant period, the commissioner may require grant recipients to provide the commissioner with information necessary to evaluate the program.",
	"repealed": false
}