{
	"id": "469.117",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.117",
	"title": "469.117 EMINENT DOMAIN PROCEEDINGS.",
	"text": "If a local agency deems necessary, it may, after having filed in court an application to assess compensation for the property to be appropriated pursuant to eminent domain proceedings, forthwith pay into court a sum of money to secure compensation to the owner of the appropriated property. The amount shall be fixed by the court in a sum not less than the valuation of the property appropriated as fixed by the assessor and as finally equalized. The title to the property appropriated shall pass to the local agency upon the payment of that sum of money into court. After 30 days' notice thereof to the owner, the local agency may enter upon the property appropriated and demolish any structure thereon and proceed with the construction of the project proposed by it. No property for which condemnation proceedings have been initiated shall be demolished until 30 days after the court appointed appraisers have made and filed their award. It shall then proceed with the prosecution of its suit to assess compensation with due diligence. The deposit shall be applied, so far as necessary for that purpose, to the payment of any award that may be made, with interest thereon, and the remainder, if any, shall be returned to the local agency.\nReal property in a redevelopment area that is needed or convenient for a project, which is to be acquired by condemnation pursuant to this section, may be acquired by the local agency for the project. This includes any property devoted to a public use, whether or not held in trust, notwithstanding that the property may have been previously acquired by condemnation or is owned by a public utility corporation, it being determined that the public use in conformity with the provisions of sections 469.109 to 469.123 shall be deemed a superior public use. Property devoted to a public use may be so acquired only if the governing body of the municipality has approved its acquisition by the local agency. An award of compensation shall not be increased by reason of any increase in the value of the real property caused by the assembly, clearance, or reconstruction, or proposed assembly, clearance, or reconstruction for the purposes of sections 469.109 to 469.123 of the real property in an area.",
	"repealed": false
}