{
	"id": "115.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.56",
	"title": "115.56 MANDATORY LICENSING PROGRAM.",
	"text": "(a) Pursuant to section 115.03, subdivision 1, the agency shall adopt rules containing standards of certification and licensure applicable to all subsurface sewage treatment system individuals and businesses.\nThe rules must include but are not limited to:\n(1) training requirements that include both classroom and fieldwork components;\n(2) examination content requirements and testing procedures;\n(3) continuing education requirements;\n(4) equivalent experience provisions;\n(5) bonding and insurance requirements;\n(6) schedules for submitting fees; and\n(7) license revocation and suspension and other enforcement requirements.\n(b) The agency shall consult with the advisory committee before proposing any rules under this subdivision.\n(a) Except as provided in paragraph (b), a person may not design, install, maintain, pump, inspect, or provide service to a subsurface sewage treatment system without a license issued by the commissioner. Licenses issued under this section allow work on subsurface sewage treatment systems that do not require a state permit using prescriptive designs and design guidances provided by the agency. Licensees who design systems using these prescriptive designs and design guidances are not subject to the additional licensing requirements of section 326.03.\n(b) A license is not required for a person who complies with the applicable requirements if the person is:\n(1) a qualified employee of state or local government who is a certified professional;\n(2) an individual who constructs a subsurface sewage treatment system on land that is owned or leased by the individual and functions solely as the individual's dwelling or seasonal dwelling, unless specifically disallowed in local ordinance. A person constructing a subsurface sewage treatment system under this clause must comply with all local administrative and technical requirements. In addition, the system must be inspected before being covered and a compliance report must be provided to the local unit of government after the inspection;\n(3) a farmer who pumps and disposes of sewage waste from subsurface sewage treatment systems, holding tanks, and privies on land that is owned or leased by the farmer; or\n(4) an individual who performs labor or services for a licensed business under this section in connection with the design, installation, operation, pumping, or inspection of a subsurface sewage treatment system at the direction and under the personal supervision of a person certified under this section.\n(c) The commissioner, in conjunction with the University of Minnesota Extension Service or another higher education institution, shall ensure adequate training and design guidance exists for subsurface sewage treatment system certified professionals.\n(d) The commissioner shall conduct examinations to test the knowledge of applicants for certification and shall issue documentation of certification.\n(e) Licenses may be issued only upon submission of general liability insurance, a corporate surety bond in the amount of at least $25,000, and the name of the individual who will be the designated certified individual for that business. The bond may be for both plumbing work and subsurface sewage treatment work if the bond complies with the requirements of this section and satisfies the requirements and references identified in section 326B.46, subdivision 2.\n(f) Local units of government may not require additional local licenses for subsurface sewage treatment system businesses.\n(g) No other professional license under section 326.03 is required to design, install, maintain, inspect, or provide service for a subsurface sewage treatment system that does not require a state permit using prescriptive designs and design guidances provided by the agency if the system designer, installer, maintainer, inspector, or service provider is licensed under this subdivision and the local unit of government has not adopted additional requirements.\n[Repealed, 2009 c 109 s 15]\n(a) The commissioner may deny, suspend, or revoke a license or certification, or use any lesser remedy against a subsurface sewage treatment system business or a certified individual, for any of the following reasons:\n(1) failure to meet the requirements for a certification or license;\n(2) incompetence, negligence, fraud, illegal activity, conflict of interest, or inappropriate conduct in the performance of the duties of a subsurface sewage treatment system business or certified individual;\n(3) failure to comply with applicable requirements;\n(4) submission of false or misleading information or credentials in order to obtain or renew certification or a license; or\n(5) failure to resolve an enforcement action with any local, state, or federal agency.\n(b) Upon receiving a signed written complaint that alleges the existence of a ground for enforcement action against a person under paragraph (a), the commissioner shall initiate an investigation. Revocation, suspension, or other enforcement action may not be taken before written notice is given to the person and an opportunity is provided for a contested case hearing complying with the provisions of chapter 14.\n(a) Until the agency adopts a final rule establishing fees for licenses under subdivision 2, the fee for a license required under subdivision 2 is $200 per year and the annual license fee for a business with multiple licenses shall not exceed $400.\n(b) Revenue from any fees charged by the agency for licenses under subdivision 2 must be credited to the environmental fund and is exempt from section 16A.1285.",
	"repealed": false
}