{
	"id": "354.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.05",
	"title": "354.05 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following terms, for the purposes of this chapter, shall be given the meanings subjoined to them.\n(a) \"Teacher\" means:\n(1) a person who renders service as a teacher, supervisor, principal, superintendent, librarian, nurse, counselor, social worker, therapist, or psychologist in:\n(i) a public school of the state other than in Independent School District No. 625;\n(ii) a charter school; or\n(iii) the Perpich Center for Arts Education, except that any employee of the Perpich Center for Arts Education who was covered by the Minnesota State Retirement System general state employees retirement plan as of July 1, 2018, shall continue to be covered by that plan and not by the Teachers Retirement Association;\n(2) a person who is engaged in educational administration in connection with the state public school system, whether the position be a public office or as employment;\n(3) a person who renders service as a charter school director or chief administrative officer; provided, however, that if the charter school director or chief administrative officer is covered by the Public Employees Retirement Association general employees retirement plan on July 1, 2018, the charter school director or chief administrative officer shall continue to be covered by that plan and not by the Teachers Retirement Association;\n(4) an employee of the Teachers Retirement Association;\n(5) a person who renders teaching service on a part-time basis and who also renders other services for a single employing unit where the teaching service comprises at least 50 percent of the combined employment salary is a member of the association for all services with the single employing unit or, if less than 50 percent of the combined employment salary, the executive director determines all of the combined service is covered by the association; or\n(6) a person who is not covered by the plans established under chapter 352D, 354A, or 354B and who is employed by the Board of Trustees of the Minnesota State Colleges and Universities system in an unclassified position as:\n(i) a president, vice-president, or dean;\n(ii) a manager or a professional in an academic or an academic support program other than specified in item (i);\n(iii) an administrative or a service support faculty position; or\n(iv) a teacher or a research assistant.\n(b) \"Teacher\" does not mean:\n(1) a person who works for a school or institution as an independent contractor as defined by the Internal Revenue Service;\n(2) annuitants of the teachers retirement plan who are employed after retirement by an employing unit that participates in the teachers retirement plan during the course of that reemployment;\n(3) a person who is employed by the University of Minnesota;\n(4) a member or an officer of any general governing or managing board or body of an employing unit that participates in the teachers retirement plan; or\n(5) a person employed by Independent School District No. 625 as a teacher as defined in section 354A.011, subdivision 27.\n(a) Notwithstanding subdivision 2, a person specified in paragraph (b) is not a member of the association except for purposes of Social Security coverage unless the person is covered by section 354B.211, and elects coverage by the Teachers Retirement Association.\n(b) A teacher is excluded from association membership other than Social Security coverage under paragraph (a) if the person is covered by the individual retirement account plan established under chapter 354B.\nThe word \"teaching\" includes the service performed by any person coming within the definition of \"teacher\" as set forth in subdivision 2.\nThe term \"fund\" means the teachers retirement fund referred to in this chapter.\n\"Member of the association\" means every teacher who contributes to the teachers retirement fund as provided in this chapter who has not retired, or a teacher who exercises an option to elect coverage under another public pension plan enumerated in section 356.30, subdivision 3. Any former member of the association who is retired and subsequently resumes teaching service is a member of the association only for purposes of Social Security coverage.\nThe term \"board\" means the board of trustees of the Teachers Retirement Association.\n(a) \"Actuarial equivalent\" means the condition of one annuity or benefit having an equal actuarial present value as another annuity or benefit, determined as of a given date with each actuarial present value based on the appropriate mortality table adopted by the board of trustees based on the experience of the association as recommended by the actuary retained under section 356.214, and approved under section 356.215, subdivision 18, and using the applicable investment return assumption specified in section 356.215, subdivision 8.\n(b) For purposes of computing a joint and survivor annuity, the investment return assumption specified in section 356.461 must be used rather than the investment return specified in section 356.215, subdivision 8.\n\"Dependent child\" means a biological or adopted child of a deceased member who has not reached the age of 18, or who is under age 22 and is a full-time student throughout the normal school year, unmarried and dependent for more than one-half of support upon the member. It also means a child of the member conceived during the member's lifetime and born after the member's death.\nFor the purpose of survivor benefit eligibility under section 354.46, subdivision 2b, \"dependent child\" means any biological or adopted child of a deceased member who has not reached the age of 20 and is dependent for more than one-half of support upon the member. It also includes any child of the member conceived while living and born after death.\n\"Association\" means the combined membership of all teachers who qualify and participate in the retirement program provided for in this chapter.\n\"Approved actuary\" means an actuary who meets the definition in section 356.215, subdivision 1, paragraph (c).\n\"Accumulated deductions\" means the total of the sums deducted from the salary of a member and the total amount of assessments paid by a member in lieu of such deductions, credited to the member's individual fund, less amounts paid to the member or any person in the member's behalf in the form of refundments, annuity payments or benefit payments and less any other amounts deducted pursuant to law.\n\"Payments in lieu of deductions\" means the assessments or payments made by any member to receive credit for service rendered when no salary deductions were made.\n\"Allowable service\" means:\n(1) any service rendered by a teacher for any calendar month when the member receives salary from which deductions are made, deposited and credited in the fund;\n(2) any service rendered by a person for any calendar month where payments in lieu of salary deductions are made, deposited and credited into the fund as provided in Minnesota Statutes 1980, section 354.09, subdivision 4, and section 354.53;\n(3) any service rendered by a teacher for which the teacher elected to obtain credit for service by making payments to the fund under Minnesota Statutes 1980, section 354.09, subdivisions 1 and 4, sections 354.50, 354.51, Minnesota Statutes 1957, section 135.41, subdivision 4, Minnesota Statutes 1971, section 354.09, subdivision 2, or Minnesota Statutes, 1973 Supplement, section 354.09, subdivision 3;\n(4) both service during years of actual membership in the course of which contributions were currently made and service in years during which the teacher was not a member but for which the teacher later elected to obtain credit by making payments to the fund as permitted by any law then in effect;\n(5) any service rendered where contributions were made and no credit was established because of the limitations contained in Minnesota Statutes 1957, section 135.09, subdivision 2, as determined by the ratio between the amounts of money credited to the teacher's account in a fiscal year and the maximum retirement contribution allowable for that year;\n(6) a period of time during which a teacher was on strike without pay, not to exceed a period of one year, if payment in lieu of salary deductions is made under section 354.72;\n(7) a period of service before July 1, 2006, that was properly credited as allowable service by the Minneapolis Teachers Retirement Fund Association, and that was rendered by a teacher as an employee of Special School District No. 1, Minneapolis, or by an employee of the Minneapolis Teachers Retirement Fund Association who was a member of the Minneapolis Teachers Retirement Fund Association by virtue of that employment, who has not begun receiving an annuity or other retirement benefit from the former Minneapolis Teachers Retirement Fund Association calculated in whole or in part on that service before July 1, 2006, and who has not taken a refund of member contributions related to that service unless the refund is repaid under section 354.50, subdivision 4. Service as an employee of Special School District No. 1, Minneapolis, on or after July 1, 2006, is \"allowable service\" only as provided by this chapter; or\n(8) a period of service before July 1, 2015, that was properly credited as allowable service by the Duluth Teachers Retirement Fund Association, and that was rendered by a teacher as an employee of Independent School District No. 709, Duluth, or by an employee of the Duluth Teachers Retirement Fund Association who was a member of the Duluth Teachers Retirement Fund Association by virtue of that employment, who has not begun receiving an annuity or other retirement benefit from the former Duluth Teachers Retirement Fund Association calculated in whole or in part on that service before July 1, 2015, and who has not taken a refund of member contributions related to that service unless the refund is repaid under section 354.50, subdivision 4. Service as an employee of Independent School District No. 709, Duluth, on or after July 1, 2015, is \"allowable service\" only as provided by this chapter.\n(a) \"Average salary,\" for the purpose of determining the member's retirement annuity, means the average salary upon which contributions were made for the highest five successive years of formula service credit.\n(b) \"Average salary\" may not include any more than the equivalent of 60 monthly salary payments.\n(c) \"Average salary\" must be based upon all years of formula service credit if this service credit is less than five years.\n\"Total and permanent disability\" means the inability to engage in any substantial gainful activity by reason of any medically determinable physical or mental impairment which can be expected to be of long continued and indefinite duration. An \"indefinite duration\" is a period of at least one year.\n\"Surviving spouse\" means the spouse of a deceased member or a disabilitant who was legally married to the member at the time of death.\n[Repealed, 1994 c 528 art 3 s 34]\n\"Retirement annuity\" means the payments made by the association to a former member after retirement.\n\"Optional survivors annuity\" means the payments made by the association to a survivor of a former member pursuant to an optional annuity form selected by such member at or before retirement which varies in amount depending primarily upon both employee and employer contributions made by and in behalf of the particular member.\n\"Former spouse\" means a person who is no longer a spouse of a member due to dissolution of the marriage, legal separation, or annulment.\n[Repealed, 1974 c 289 s 59]\n\"Annuity\" means a retirement annuity, optional survivors annuity, or spouses annuity.\n\"Benefit\" means an allowance paid or payable by the association to a surviving dependent spouse or a dependent child which is a fixed amount and also includes an allowance paid or payable by the association to a member or former member who is permanently and totally disabled.\n\"Retirement\" means the withdrawal of a member from active teaching service who is paid a retirement annuity thereafter and commences with the date designated by the retirement board when the retirement annuity first accrues to the former member after withdrawal from active teaching service and application for an annuity under section 354.44, subdivisions 3 and 4. The effective date of retirement must occur for an annuity plan selection to take effect. This date determines any rights specified in this chapter which occur either before or after retirement.\n\"Designated beneficiary\" means the person, trust, or organization designated by a retiree or member to receive the benefits to which a beneficiary is entitled under this chapter. A beneficiary designation is valid only if it is made on an appropriate form provided by the executive director that is signed by the member. The properly completed form must be received by the association on or before the date of death of the retiree or member. If a retiree or a member does not designate a person, trust, or organization, or if the person who was designated predeceases the retiree or the member, or if the trust or organization ceases to exist before the death of the retiree or the member, the designated beneficiary is the estate of the deceased retiree or member.\n[Repealed, 1990 c 570 art 12 s 64]\n[Repealed, 1990 c 570 art 12 s 64]\n\"Formula service credit\" means any allowable service credit as defined in subdivision 13 except:\n(1) any service rendered for which contributions were not made in full as determined by the ratio between the amounts of money credited to the teacher's account in a fiscal year and the retirement contribution payable for the fiscal year under sections 354.092, 354.42, and 354.51; and\n(2) no period of service may be counted more than once for purposes of this subdivision.\n[Repealed, 2009 c 169 art 1 s 77]\nThe term \"normal school operating funds\" as used in this chapter shall be defined as and limited to the proceeds of property tax levies, state school maintenance cost aids distributed in accordance with statutes governing such funds, state aid to distressed school districts, proceeds from federal forest reserve lands, state transportation aids, and receipts from tuition paid by persons or other school districts and rental charges received. The term also includes money appropriated by the legislature for the operation of any state agency, department, state board, or institution.\nThe term \"satisfactory certification\" means a certification executed by a responsible officer of an employing authority in such form and content that false or misleading information would constitute perjury.\n[Repealed, 1994 c 528 art 3 s 34]\n\"Coordinated member\" means any teacher covered by any agreement or modification made between the state and the Secretary of Health, Education and Welfare, making the provisions of the federal Old Age, Survivors and Disability Insurance Act applicable to such member.\n\"Basic member\" means any teacher not covered by any agreement or modification made between the state and the Secretary of Health, Education and Welfare.\n\"Formula program\" means a retirement program which provides benefits based on certain percentages multiplied by the years of service and average salary of a member as described in section 354.44.\n[Repealed, 1990 c 570 art 12 s 64]\n[Repealed, 1990 c 570 art 12 s 64]\n(a) Subject to the limitations of section 356.611, \"salary\" means the periodic compensation, upon which member contributions are required before deductions for deferred compensation, supplemental retirement plans, or other voluntary salary reduction programs.\n(b) \"Salary\" does not mean:\n(1) lump-sum annual leave payments;\n(2) lump-sum wellness and sick leave payments;\n(3) employer-paid amounts used by an employee toward the cost of insurance coverage, employer-paid fringe benefits, flexible spending accounts, cafeteria plans, health care expense accounts, day care expenses, or any payments in lieu of any employer-paid group insurance coverage, including the difference between single and family rates that may be paid to a member with single coverage and certain amounts determined by the executive director to be ineligible;\n(4) any form of payment made in lieu of any other employer-paid fringe benefit or expense;\n(5) any form of severance payments;\n(6) workers' compensation payments;\n(7) disability insurance payments, including self-insured disability payments;\n(8) payments to school principals and all other administrators for services that are in addition to the normal work year contract if these additional services are performed on an extended duty day, Saturday, Sunday, holiday, annual leave day, sick leave day, or any other nonduty day;\n(9) payments under section 356.24, subdivision 1, clause (4); and\n(10) payments made under section 122A.40, subdivision 12, except for payments for sick leave that are accumulated under the provisions of a uniform school district policy that applies equally to all similarly situated persons in the district.\n(c) Amounts provided to an employee by the employer through a grievance proceeding or a legal settlement are salary only if the settlement is reviewed by the executive director and the amounts are determined by the executive director to be consistent with paragraph (a) and prior determinations.\nSeverance payments include, but are not limited to:\n(1) payments to an employee to terminate employment;\n(2) payments, or that portion of payments, that are not clearly for the performance of services by the employee to the employer;\n(3) payments to an administrator or former administrator serving as an advisor to a successor or as a consultant to the employer under an agreement to terminate employment within two years or less of the execution of the agreement for compensation that is significantly different than the most recent contract salary;\n(4) payments under a procedure that allows the employee to designate the time of payment if the payments are made during the period of formula service credit used to compute a benefit or annuity under section 354.44, subdivision 6 or 7; 354.46, subdivision 1 or 2; or 354.48, subdivision 3; and\n(5) lump-sum payments during the time period that contains the highest five successive years of salary for additional services performed without pay during other years of salary.\n\"Retiree of association\" means any former member who has retired as provided in this chapter.\n\"Termination of teaching service\" means the withdrawal of a member from active teaching service by resignation or the termination of the member's teaching contract by the employer. A member is not considered to have terminated teaching service, if before the age of 62, and before the effective date of the termination or retirement, the member has entered into a contract to resume teaching service with an employing unit covered by the provisions of this chapter. A contract to return to work after retirement for an active member who has attained age 62 must comply with the provisions of section 354.444.\n\"Normal retirement age\" means age 65 for a person who first became a member of the association or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989. Through June 30, 2024, for a person who first becomes a member of the association after June 30, 1989, normal retirement age means the higher of age 65 or \"retirement age,\" as defined in United States Code, title 42, section 416(l), as amended, but not to exceed age 66. Beginning July 1, 2024, normal retirement age for all members means age 65.\nNormal work year for school principals and all other administrators means 12 consecutive full months of continuous employment from July 1 to June 30.\nAn application, payment, return, claim, or other document that is not personally delivered to the association on or before the applicable due date is considered to be a timely receipt if received on or before the due date or if delivered or filed under section 645.151.\n(a) \"Annual base salary\" means:\n(1) for an independent school district or educational cooperative, the lowest full-time Bachelor of Arts (BA) base contract salary for the previous fiscal year for that employing unit;\n(2) for a charter school, the lowest starting annual salary for a full-time teacher employed during the previous fiscal year for that employing unit; and\n(3) for a state agency or professional organization, the lowest starting annual salary for a full-time Teachers Retirement Association covered position for the previous fiscal year for that employing unit.\n(b) If there is no previous fiscal year data because an employer unit is new and paragraph (c) does not apply, the annual base salary for the first year of operation will be as provided in paragraph (a), except that the base contract salary for the current fiscal year, rather than the previous fiscal year, must be used.\n(c) For a new employer unit created as a result of a merger or consolidation, the annual base salary must be the lowest annual base salary as specified in paragraph (a) for any of the employer units involved in the merger or consolidation.\nThe fiscal year of the association begins on July 1 of each calendar year and ends on June 30 of the following calendar year.\n\"APRN\" means an individual licensed as an advanced practice registered nurse by the Board of Nursing as defined in section 148.171, subdivision 3, who provides services to a member or an applicant that are within the scope of the APRN's professional licensure.",
	"repealed": false
}