{
	"id": "125A.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.64",
	"title": "125A.64 POWERS OF BOARD OF THE MINNESOTA STATE ACADEMIES.",
	"text": "The board of the Minnesota State Academies may employ central administrative staff members and other personnel necessary to provide and support programs and services at each academy.\nThe board of the Minnesota State Academies may require the Department of Education to provide program leadership, program monitoring, and technical assistance at the academies.\nThe board of the Minnesota State Academies may place any position other than residential academies administrator in the unclassified service. The position must meet the criteria in section 43A.08, subdivision 1a.\nThe board of the Minnesota State Academies may enter into agreements with public or private agencies or institutions to provide residential and building maintenance services. The board of the Minnesota State Academies must first decide that contracting for the services is more efficient and less expensive than not contracting for them.\n(a) The board of the Minnesota State Academies may enter into agreements with teacher preparation institutions for student teachers to get practical experience at the academies. A licensed teacher must provide appropriate supervision of each student teacher.\n(b) The board of the Minnesota State Academies may enter into agreements with accredited higher education institutions for certain student trainees to get practical experience at the academies. The students must be preparing themselves in a professional field that provides special services to children with a disability in school programs. To be a student trainee in a field, a person must have completed at least two years of an approved program in the field. A person who is licensed or registered in the field must provide appropriate supervision of each student trainee.\nNotwithstanding section 120A.40, the board of the Minnesota State Academies for the Deaf and Blind may begin the school year any day prior to September 1.",
	"repealed": false
}