{
	"id": "80A.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.87",
	"title": "80A.87 SECTION 610; JURISDICTION.",
	"text": "(a) Sales and offers to sell. Sections 80A.49, 80A.50, 80A.56(a), 80A.57(a), 80A.58(a), 80A.68, 80A.73, 80A.76, and 80A.77 do not apply to a person that sells or offers to sell a security unless the offer to sell or the sale is made in this state or the offer to purchase or the purchase is made and accepted in this state.\n(b) Purchases and offers to purchase. Sections 80A.56(a), 80A.57(a), 80A.58(a), 80A.68, 80A.73, 80A.76, and 80A.77 do not apply to a person that purchases or offers to purchase a security unless the offer to purchase or the purchase is made in this state or the offer to sell or the sale is made and accepted in this state.\n(c) Offers in this state. For the purpose of this section, an offer to sell or to purchase a security is made in this state, whether or not either party is then present in this state, if the offer:\n(1) originates from within this state; or\n(2) is directed by the offeror to a place in this state and received at the place to which it is directed.\n(d) Acceptances in this state. For the purpose of this section, an offer to purchase or to sell is accepted in this state, whether or not either party is then present in this state, if the acceptance:\n(1) is communicated to the offeror in this state and the offeree reasonably believes the offeror to be present in this state and the acceptance is received at the place in this state to which it is directed; and\n(2) has not previously been communicated to the offeror, orally or in a record, outside this state.\n(e) Publications, radio, television, or electronic communications. An offer to sell or to purchase is not made in this state when a publisher circulates or there is circulated on the publisher's behalf in this state a bona fide newspaper or other publication of general, regular, and paid circulation that is not published in this state, or that is published in this state but has had more than two-thirds of its circulation outside this state during the previous 12 months or when a radio or television program or other electronic communication originating outside this state is received in this state. A radio or television program, or other electronic communication is considered as having originated in this state if either the broadcast studio or the originating source of transmission is located in this state, unless:\n(1) the program or communication is syndicated and distributed from outside this state for redistribution to the general public in this state;\n(2) the program or communication is supplied by a radio, television, or other electronic network with the electronic signal originating from outside this state for redistribution to the general public in this state;\n(3) the program or communication is an electronic communication that originates outside this state and is captured for redistribution to the general public in this state by a community antenna or cable, radio, cable television, or other electronic system; or\n(4) the program or communication consists of an electronic communication that originates in this state, but which is not intended for distribution to the general public in this state.\n(f) Investment advice and misrepresentations. Sections 80A.58(a), 80A.60(a), 80A.69, 80A.72, and 80A.73 apply to a person if the person engages in an act, practice, or course of business instrumental in effecting prohibited or actionable conduct in this state, whether or not either party is then present in this state.",
	"repealed": false
}