{
	"id": "123B.143",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.143",
	"title": "123B.143 SUPERINTENDENT.",
	"text": "All districts maintaining a classified secondary school must employ a superintendent who shall be an ex officio nonvoting member of the school board. The authority for selection and employment of a superintendent must be vested in the board in all cases. An individual employed by a board as a superintendent shall have an initial employment contract for a period of time no longer than three years from the date of employment. Any subsequent employment contract must not exceed a period of three years. A board, at its discretion, may or may not renew an employment contract. A board must not, by action or inaction, extend the duration of an existing employment contract. Beginning 365 days prior to the expiration date of an existing employment contract, a board may negotiate and enter into a subsequent employment contract to take effect upon the expiration of the existing contract. A subsequent contract must be contingent upon the employee completing the terms of an existing contract. If a contract between a board and a superintendent is terminated prior to the date specified in the contract, the board may not enter into another superintendent contract with that same individual that has a term that extends beyond the date specified in the terminated contract. A board may terminate a superintendent during the term of an employment contract for any of the grounds specified in section 122A.40, subdivision 9 or 13. A superintendent shall not rely upon an employment contract with a board to assert any other continuing contract rights in the position of superintendent under section 122A.40. Notwithstanding the provisions of sections 122A.40, subdivision 10 or 11, 123A.32, 123A.75, or any other law to the contrary, no individual shall have a right to employment as a superintendent based on order of employment in any district. If two or more districts enter into an agreement for the purchase or sharing of the services of a superintendent, the contracting districts have the absolute right to select one of the individuals employed to serve as superintendent in one of the contracting districts and no individual has a right to employment as the superintendent to provide all or part of the services based on order of employment in a contracting district. The superintendent of a district shall perform the following:\n(1) visit and supervise the schools in the district, report and make recommendations about their condition when advisable or on request by the board;\n(2) recommend to the board employment and dismissal of teachers;\n(3) annually evaluate each school principal assigned responsibility for supervising a school building within the district, consistent with section 123B.147, subdivision 3, paragraph (b);\n(4) superintend school grading practices and examinations for promotions;\n(5) make reports required by the commissioner; and\n(6) perform other duties prescribed by the board.\n(a) For the purposes of paragraph (b), a \"buyout agreement\" is any agreement under which a person employed as a superintendent left the position before the term of the contract was over and received a sum of money, something else of value, or the right to something of value for some purpose other than performing the services of a superintendent.\n(b) Before a person may enter into a superintendent's contract with a board, the candidate shall disclose in writing the existence and terms of any previous buyout agreement, including amounts and the purpose for the payments, relating to a superintendent's contract with another board. A disclosure made under this paragraph is public data.\n(c) The superintendent's contract of a person who fails to make a timely disclosure under paragraph (b) is void.",
	"repealed": false
}