{
	"id": "260B.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.201",
	"title": "260B.201 MANDATORY COMMITMENT TO COMMISSIONER OF CORRECTIONS.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Chemical dependency treatment\" means a comprehensive set of planned and organized services, therapeutic experiences, and interventions that are intended to improve the prognosis, function, or outcome of patients by reducing the risk of the use of alcohol, drugs, or other mind-altering substances and assist the patient to adjust to, and deal more effectively with, life situations.\n(c) An offender has \"failed or refused to successfully complete\" treatment when, based on factors within the offender's control, the offender is not able to substantially achieve the program's goals and the program's director determines that, based on the offender's prior placement or treatment history, further participation in the program would not result in its successful completion.\n(d) \"Probation\" has the meaning given in section 609.02, subdivision 15.\n(e) \"Sex offender treatment\" means a comprehensive set of planned and organized services, therapeutic experiences, and interventions that are intended to improve the prognosis, function, or outcome of patients by reducing the risk of sexual reoffense and other aggressive behavior and assist the patient to adjust to, and deal more effectively with, life situations.\n(a) A court having jurisdiction over a child shall commit the child to the custody of the commissioner of corrections or place the child at the Minnesota Correctional Facility-Red Wing if the child:\n(1) was previously adjudicated delinquent or convicted as an extended jurisdiction juvenile for an offense for which registration under section 243.166 was required;\n(2) was placed on probation for the offense and ordered to complete a sex offender or chemical dependency treatment program; and\n(3) subsequently failed or refused to successfully complete the program.\n(b) If the child was initially convicted as an extended jurisdiction juvenile, the court may execute the child's adult sentence under section 260B.130, subdivision 4. Notwithstanding paragraph (c), if the court does not do this, it shall comply with paragraph (a).\n(c) A court may place a child in an out-of-state facility if the court makes a finding on the record that the safety of the child or the safety of the community can be best met by placement in an out-of-state facility or that the out-of-state facility is located closer to the child's home.\n[Repealed, 2009 c 59 art 4 s 9; 2009 c 83 art 3 s 24]",
	"repealed": false
}