{
	"id": "103E.806",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.806",
	"title": "103E.806 PARTIAL ABANDONMENT OF DRAINAGE SYSTEM.",
	"text": "After construction of a drainage system, an owner of benefited property may petition the drainage authority to abandon any part of the drainage system that is not of public benefit and utility and does not serve a substantial useful purpose to property remaining in the system.\nIf the drainage system is under the jurisdiction of a county drainage authority, the petition must be filed with the auditor of the county. If the drainage system is under the jurisdiction of a joint county drainage authority, the petition must be filed with the county having the largest area of property in the drainage system, where the primary drainage system records are kept. If the system is under the jurisdiction of a watershed district, the petition must be filed with the secretary of the district.\n(a) When the petition is filed, the drainage authority, in consultation with the auditor or the secretary, shall set a time and location for a hearing on the petition and shall give notice of the hearing by mail to the owners of all property benefited by the drainage system, and either in a newspaper of general circulation within the affected drainage area or by publication on a website of the drainage authority.\n(b) At the hearing, the drainage authority shall make findings and direct, by order, that part of the drainage system be abandoned, if the drainage authority determines that part of the drainage system does not serve a substantial useful purpose as part of the drainage system to any property remaining in the system and is not of a substantial public benefit and utility.\nAfter partial abandonment of a drainage system, a repair petition may not be accepted for the abandoned part of the drainage system and the responsibility of the drainage authority for that part of the drainage system ends.\nAn order under this section does not release the property from a drainage lien filed on account of the drainage system before the date of the order. An order under this section does not release the property from any assessment or a drainage lien filed on or after the date of the order for costs incurred on account of the drainage system before the date of the order.",
	"repealed": false
}