{
	"id": "308A.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.205",
	"title": "308A.205 AGRICULTURAL MARKETING CONTRACTS.",
	"text": "A cooperative and its members or patrons may make and execute marketing contracts, requiring the members or patrons to sell a specified portion of their agricultural products or specified commodities exclusively to or through the cooperative or facilities established by the cooperative.\nIf a sale is contracted to the cooperative, the sale transfers title to the products absolutely, except for recorded liens and security interest, to the cooperative on delivery of the products or at another specified time if expressly provided in the contract. The contract may allow the cooperative to sell or resell the products of its members, or patrons, with or without taking title to the product, and pay the resale price to the patron, after deducting all necessary selling, overhead, and other costs and expenses, including other proper reserves, and interest not exceeding eight percent per annum on common stock.\nThe term of a marketing contract may not exceed five years, but may be made self-renewing for periods not exceeding five years each, subject to the right of either party to terminate at the end of the original term and each renewal term by giving written notice of the termination during a period specified in the contract. The period for notifying to terminate a contract may not be more than 180 days or less than 30 days before the end of the term.\nThe bylaws or the marketing contract may set specific sums, as liquidated damages to be paid by the member or patron to the cooperative for breach of any provisions of the marketing contract regarding the sale or delivery or withholding of products and may provide that the member or patron will pay the costs, premiums for bonds, expenses, and fees if an action is brought on the contract by the cooperative. The remedies for breach of contract are valid and enforceable in the courts of this state. The provisions shall be enforced as liquidated damages and are not to be considered or regarded as a penalty.\nIf there is a breach or threatened breach of a marketing contract by a member or patron, the cooperative is entitled to an injunction to prevent the further breach of the contract, and to a decree of specific performance of the contract. Pending the adjudication of the action after filing a certified complaint showing the breach or threatened breach and filing a sufficient bond, the cooperative is entitled to a temporary restraining order and preliminary injunction against the member or patron.\nIn an action on a marketing contract, it is presumed that landowners, landlords, and lessors are able to control the delivery of products produced on their land by tenants or others and are liable for and subject to remedies for the breach of delivery, if the tenancy, possession, or work on the land or the terms of the tenancy, possession, or labor on the land was created or changed after execution by the landowners, landlords, or lessors of the marketing contract.\n(a) A person or a corporation is guilty of a misdemeanor and subject to a $500 civil penalty to be paid to the aggrieved cooperative or association if the person or the corporation's officers or employees:\n(1) knowingly induce or attempt to induce a member or stockholder of a cooperative or an association operating in this state that is organized under similar statutes of other states with similar restrictions and rights to break a marketing contract with the cooperative or association; or\n(2) maliciously and knowingly spread false reports about the finances or management or activity of a cooperative or association.\n(b) Each violation is a separate offense and is subject to the penalties in paragraph (a).\nA cooperative exercising authority under this section is not a combination in restraint of trade or an illegal monopoly, or an attempt to lessen competition or fix prices arbitrarily. The marketing contracts and agreements under this section are not illegal, or an unlawful restraint of trade, or a part of a conspiracy or combination to accomplish an improper or illegal purpose.",
	"repealed": false
}