{
	"id": "121A.2205",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.2205",
	"title": "121A.2205 POSSESSION AND USE OF EPINEPHRINE AUTO-INJECTORS; MODEL POLICY.",
	"text": "As used in this section:\n(1) \"administer\" means the direct application of an epinephrine auto-injector to the body of an individual;\n(2) \"epinephrine auto-injector\" means a device that automatically injects a premeasured dose of epinephrine; and\n(3) \"school\" means a public school under section 120A.22, subdivision 4, or a nonpublic school, excluding a home school, under section 120A.22, subdivision 4, that is subject to the federal Americans with Disabilities Act.\n(a) At the start of each school year or at the time a student enrolls in school, whichever is first, a student's parent, school staff, including those responsible for student health care, and the prescribing medical professional must develop and implement an individualized written health plan for a student who is prescribed epinephrine auto-injectors that enables the student to:\n(1) possess epinephrine auto-injectors; or\n(2) if the parent and prescribing medical professional determine the student is unable to possess the epinephrine, have immediate access to epinephrine auto-injectors in close proximity to the student at all times during the instructional day.\nThe plan must designate the school staff responsible for implementing the student's health plan, including recognizing anaphylaxis and administering epinephrine auto-injectors when required, consistent with section 121A.22, subdivision 2, clause (10). This health plan may be included in a student's 504 plan.\n(b) Other nonpublic schools are encouraged to develop and implement an individualized written health plan for students requiring epinephrine auto-injectors, consistent with this section and section 121A.22, subdivision 2, clause (10).\n(c) A school district and its agents and employees are immune from liability for any act or failure to act, made in good faith, in implementing this section and section 121A.2207.\n(d) The education commissioner may develop and transmit to interested schools a model policy and individualized health plan form consistent with this section and federal 504 plan requirements. The policy and form may:\n(1) assess a student's ability to safely possess epinephrine auto-injectors;\n(2) identify staff training needs related to recognizing anaphylaxis and administering epinephrine when needed;\n(3) accommodate a student's need to possess or have immediate access to epinephrine auto-injectors in close proximity to the student at all times during the instructional day; and\n(4) ensure that the student's parent provides properly labeled epinephrine auto-injectors to the school for the student as needed.\n(e) Additional epinephrine auto-injectors may be available in school first aid kits.\n(f) The school board of the school district must define instructional day for the purposes of this section.",
	"repealed": false
}