{
	"id": "62V.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/62V.05",
	"title": "62V.05 RESPONSIBILITIES AND POWERS OF MNSURE.",
	"text": "(a) The board shall operate MNsure according to this chapter and applicable state and federal law.\n(b) The board has the power to:\n(1) employ personnel and delegate administrative, operational, and other responsibilities to the director and other personnel as deemed appropriate by the board. This authority is subject to chapters 43A and 179A. The director and managerial staff of MNsure shall serve in the unclassified service and shall be governed by a compensation plan prepared by the board, submitted to the commissioner of management and budget for review and comment within 14 days of its receipt, and approved by the Legislative Coordinating Commission and the legislature under section 3.855, except that section 15A.0815, subdivision 5, paragraph (e), shall not apply;\n(2) establish the budget of MNsure;\n(3) seek and accept money, grants, loans, donations, materials, services, or advertising revenue from government agencies, philanthropic organizations, and public and private sources to fund the operation of MNsure. No health carrier or insurance producer shall advertise on MNsure;\n(4) contract for the receipt and provision of goods and services;\n(5) enter into information-sharing agreements with federal and state agencies and other entities, provided the agreements include adequate protections with respect to the confidentiality and integrity of the information to be shared, and comply with all applicable state and federal laws, regulations, and rules, including the requirements of section 62V.06; and\n(6) exercise all powers reasonably necessary to implement and administer the requirements of this chapter and the Affordable Care Act, Public Law 111-148.\n(c) The board shall establish policies and procedures to gather public comment and provide public notice in the State Register.\n(d) Within 180 days of enactment, the board shall establish bylaws, policies, and procedures governing the operations of MNsure in accordance with this chapter.\n(a) Prior to January 1, 2015, MNsure shall retain or collect up to 1.5 percent of total premiums for individual and small group market health plans and dental plans sold through MNsure to fund the cash reserves of MNsure, but the amount collected shall not exceed a dollar amount equal to 25 percent of the funds collected under section 62E.11, subdivision 6, for calendar year 2012.\n(b) Beginning January 1, 2015, MNsure shall retain or collect up to 3.5 percent of total premiums for individual and small group market health plans and dental plans sold through MNsure to fund the operations of MNsure, but the amount collected shall not exceed a dollar amount equal to 50 percent of the funds collected under section 62E.11, subdivision 6, for calendar year 2012.\n(c) Beginning January 1, 2016, MNsure shall retain or collect up to 3.5 percent of total premiums for individual and small group market health plans and dental plans sold through MNsure to fund the operations of MNsure, but the amount collected may never exceed a dollar amount greater than 100 percent of the funds collected under section 62E.11, subdivision 6, for calendar year 2012.\n(d) For fiscal years 2014 and 2015, the commissioner of management and budget is authorized to provide cash flow assistance of up to $20,000,000 from the special revenue fund or the statutory general fund under section 16A.671, subdivision 3, paragraph (a), to MNsure. Any funds provided under this paragraph shall be repaid, with interest, by June 30, 2015.\n(e) Funding for the operations of MNsure shall cover any compensation provided to navigators participating in the navigator program.\n(a) By April 30, 2013, the board, in consultation with the commissioner of commerce, shall establish certification requirements that must be met by insurance producers in order to assist individuals and small employers with purchasing coverage through MNsure. Prior to January 1, 2015, the board may amend the requirements, only if necessary, due to a change in federal rules.\n(b) Certification requirements shall not exceed the requirements established under Code of Federal Regulations, title 45, part 155.220. Certification shall include training on health plans available through MNsure, available tax credits and cost-sharing arrangements, compliance with privacy and security standards, eligibility verification processes, online enrollment tools, and basic information on available public health care programs. Training required for certification under this subdivision shall qualify for continuing education requirements for insurance producers required under chapter 60K, and must comply with course approval requirements under chapter 45.\n(c) Producer compensation shall be established by health carriers that provide health plans through MNsure. The structure of compensation to insurance producers must be similar for health plans sold through MNsure and outside MNsure.\n(d) Any insurance producer compensation structure established by a health carrier for the small group market must include compensation for defined contribution plans that involve multiple health carriers. The compensation offered must be commensurate with other small group market defined health plans.\n(e) Any insurance producer assisting an individual or small employer with purchasing coverage through MNsure must disclose, orally and in writing, to the individual or small employer at the time of the first solicitation with the prospective purchaser the following:\n(1) the health carriers and qualified health plans offered through MNsure that the producer is authorized to sell, and that the producer may not be authorized to sell all the qualified health plans offered through MNsure;\n(2) that the producer may be receiving compensation from a health carrier for enrolling the individual or small employer into a particular health plan; and\n(3) that information on all qualified health plans offered through MNsure is available through the MNsure website.\nFor purposes of this paragraph, \"solicitation\" means any contact by a producer, or any person acting on behalf of a producer made for the purpose of selling or attempting to sell coverage through MNsure. If the first solicitation is made by telephone, the disclosures required under this paragraph need not be made in writing, but the fact that disclosure has been made must be acknowledged on the application.\n(f) Beginning January 15, 2015, each health carrier that offers or sells qualified health plans through MNsure shall report in writing to the board and the commissioner of commerce the compensation and other incentives it offers or provides to insurance producers with regard to each type of health plan the health carrier offers or sells both inside and outside of MNsure. Each health carrier shall submit a report annually and upon any change to the compensation or other incentives offered or provided to insurance producers.\n(g) Nothing in this chapter shall prohibit an insurance producer from offering professional advice and recommendations to a small group purchaser based upon information provided to the producer.\n(h) An insurance producer that offers health plans in the small group market shall notify each small group purchaser of which group health plans qualify for Internal Revenue Service approved section 125 tax benefits. The insurance producer shall also notify small group purchasers of state law provisions that benefit small group plans when the employer agrees to pay 50 percent or more of its employees' premium. Individuals who are eligible for cost-effective medical assistance will count toward the 75 percent participation requirement in section 62L.03, subdivision 3.\n(i) Nothing in this subdivision shall be construed to limit the licensure requirements or regulatory functions of the commissioner of commerce under chapter 60K.\n(a) The board shall establish policies and procedures for the ongoing operation of a navigator program, in-person assister program, call center, and customer service provisions for MNsure to be implemented beginning January 1, 2015.\n(b) Until the implementation of the policies and procedures described in paragraph (a), the following shall be in effect:\n(1) the navigator program shall be met by section 256.962;\n(2) entities eligible to be navigators, including entities defined in Code of Federal Regulations, title 45, part 155.210 (c)(2), may serve as in-person assisters;\n(3) the board shall establish requirements and compensation for the navigator program and the in-person assister program by April 30, 2013. Compensation for navigators and in-person assisters must take into account any other compensation received by the navigator or in-person assister for conducting the same or similar services; and\n(4) call center operations shall utilize existing state resources and personnel, including referrals to counties for medical assistance.\n(c) The board shall establish a toll-free number for MNsure and may hire and contract for additional resources as deemed necessary.\n(d) The navigator program and in-person assister program must meet the requirements of section 1311(i) of the Affordable Care Act, Public Law 111-148. In establishing training standards for the navigators and in-person assisters, the board must ensure that all entities and individuals carrying out navigator and in-person assister functions have training in the needs of underserved and vulnerable populations; eligibility and enrollment rules and procedures; the range of available public health care programs and qualified health plan options offered through MNsure; and privacy and security standards. For calendar year 2014, the commissioner of human services shall ensure that the navigator program under section 256.962 provides application assistance for both qualified health plans offered through MNsure and public health care programs.\n(e) The board must ensure that any information provided by navigators, in-person assisters, the call center, or other customer assistance portals be accessible to persons with disabilities and that information provided on public health care programs include information on other coverage options available to persons with disabilities.\n(a) The board must initiate background studies under section 245C.031 of:\n(1) each navigator;\n(2) each in-person assister; and\n(3) each certified application counselor.\n(b) The board may initiate the background studies required by paragraph (a) using the online NETStudy 2.0 system operated by the commissioner of human services.\n(c) The board shall not permit any individual to provide any service or function listed in paragraph (a) until:\n(1) the board has evaluated any notification received from the commissioner of human services indicating the individual's potential disqualifications and has determined that the individual is not disqualified under chapter 245C; or\n(2) the board has determined that the individual is disqualified but has granted a set aside of that disqualification according to sections 245C.22 and 245C.23.\n(d) The board or its delegate shall review a reconsideration request of an individual in paragraph (a), including granting a set aside, according to the procedures and criteria in chapter 245C. The board shall notify the individual and the Department of Human Services of the board's decision.\n(a) Beginning January 1, 2015, the board may establish certification requirements for health carriers and health plans to be offered through MNsure that satisfy federal requirements under section 1311(c)(1) of the Affordable Care Act, Public Law 111-148.\n(b) Paragraph (a) does not apply if by June 1, 2013, the legislature enacts regulatory requirements that:\n(1) apply uniformly to all health carriers and health plans in the individual market;\n(2) apply uniformly to all health carriers and health plans in the small group market; and\n(3) satisfy minimum federal certification requirements under section 1311(c)(1) of the Affordable Care Act, Public Law 111-148.\n(c) In accordance with section 1311(e) of the Affordable Care Act, Public Law 111-148, the board shall establish policies and procedures for certification and selection of health plans to be offered as qualified health plans through MNsure. The board shall certify and select a health plan as a qualified health plan to be offered through MNsure, if:\n(1) the health plan meets the minimum certification requirements established in paragraph (a) or the market regulatory requirements in paragraph (b);\n(2) the board determines that making the health plan available through MNsure is in the interest of qualified individuals and qualified employers;\n(3) the health carrier applying to offer the health plan through MNsure also applies to offer health plans at each actuarial value level and service area that the health carrier currently offers in the individual and small group markets; and\n(4) the health carrier does not apply to offer health plans in the individual and small group markets through MNsure under a separate license of a parent organization or holding company under section 60D.15, that is different from what the health carrier offers in the individual and small group markets outside MNsure.\n(d) In determining the interests of qualified individuals and employers under paragraph (c), clause (2), the board may not exclude a health plan for any reason specified under section 1311(e)(1)(B) of the Affordable Care Act, Public Law 111-148. The board may consider:\n(1) affordability;\n(2) quality and value of health plans;\n(3) promotion of prevention and wellness;\n(4) promotion of initiatives to reduce health disparities;\n(5) market stability and adverse selection;\n(6) meaningful choices and access;\n(7) alignment and coordination with state agency and private sector purchasing strategies and payment reform efforts; and\n(8) other criteria that the board determines appropriate.\n(e) For qualified health plans offered through MNsure on or after January 1, 2015, the board shall establish policies and procedures under paragraphs (c) and (d) for selection of health plans to be offered as qualified health plans through MNsure by February 1 of each year, beginning February 1, 2014. The board shall consistently and uniformly apply all policies and procedures and any requirements, standards, or criteria to all health carriers and health plans. For any policies, procedures, requirements, standards, or criteria that are defined as rules under section 14.02, subdivision 4, the board may use the process described in subdivision 8.\n(f) For 2014, the board shall not have the power to select health carriers and health plans for participation in MNsure. The board shall permit all health plans that meet the certification requirements under section 1311(c)(1) of the Affordable Care Act, Public Law 111-148, to be offered through MNsure.\n(g) Under this subdivision, the board shall have the power to verify that health carriers and health plans are properly certified to be eligible for participation in MNsure.\n(h) The board has the authority to decertify health carriers and health plans that fail to maintain compliance with section 1311(c)(1) of the Affordable Care Act, Public Law 111-148.\n(i) For qualified health plans offered through MNsure beginning January 1, 2015, health carriers must use the most current addendum for Indian health care providers approved by the Centers for Medicare and Medicaid Services and the tribes as part of their contracts with Indian health care providers. MNsure shall comply with all future changes in federal law with regard to health coverage for the tribes.\n(a) The board may conduct hearings, appoint hearing officers, and recommend final orders related to appeals of any MNsure determinations, except for those determinations identified in paragraph (d). An appeal by a health carrier regarding a specific certification or selection determination made by MNsure under subdivision 5 must be conducted as a contested case proceeding under chapter 14, with the report or order of the administrative law judge constituting the final decision in the case, subject to judicial review under sections 14.63 to 14.69. For other appeals, the board shall establish hearing processes which provide for a reasonable opportunity to be heard and timely resolution of the appeal and which are consistent with the requirements of federal law and guidance. An appealing party may be represented by legal counsel at these hearings, but this is not a requirement.\n(b) MNsure may establish service-level agreements with state agencies to conduct hearings for appeals. Notwithstanding section 471.59, subdivision 1, a state agency is authorized to enter into service-level agreements for this purpose with MNsure.\n(c) For proceedings under this subdivision, MNsure may be represented by an attorney who is an employee of MNsure.\n(d) This subdivision does not apply to appeals of determinations where a state agency hearing is available under section 256.045.\n(e) An appellant aggrieved by an order of MNsure issued in an eligibility appeal, as defined in Minnesota Rules, part 7700.0101, may appeal the order to the district court of the appellant's county of residence by serving a written copy of a notice of appeal upon MNsure and any other adverse party of record within 30 days after the date MNsure issued the order, the amended order, or order affirming the original order, and by filing the original notice and proof of service with the court administrator of the district court. Service may be made personally or by mail; service by mail is complete upon mailing; no filing fee shall be required by the court administrator in appeals taken pursuant to this subdivision. MNsure shall furnish all parties to the proceedings with a copy of the decision and a transcript of any testimony, evidence, or other supporting papers from the hearing held before the appeals examiner within 45 days after service of the notice of appeal.\n(f) Any party aggrieved by the failure of an adverse party to obey an order issued by MNsure may compel performance according to the order in the manner prescribed in sections 586.01 to 586.12.\n(g) Any party may obtain a hearing at a special term of the district court by serving a written notice of the time and place of the hearing at least ten days prior to the date of the hearing. The court may consider the matter in or out of chambers, and shall take no new or additional evidence unless it determines that such evidence is necessary for a more equitable disposition of the appeal.\n(h) Any party aggrieved by the order of the district court may appeal the order as in other civil cases. No costs or disbursements shall be taxed against any party nor shall any filing fee or bond be required of any party.\n(i) If MNsure or district court orders eligibility for qualified health plan coverage through MNsure, or eligibility for federal advance payment of premium tax credits or cost-sharing reductions contingent upon full payment of respective premiums, the premiums must be paid or provided pending appeal to the district court, court of appeals, or supreme court. Provision of eligibility by MNsure pending appeal does not render moot MNsure's position in a court of law.\n(a) The board shall:\n(1) establish and maintain an agreement with the commissioner of human services for cost allocation and services regarding eligibility determinations and enrollment for public health care programs that use a modified adjusted gross income standard to determine program eligibility. The board may establish and maintain an agreement with the commissioner of human services for other services;\n(2) establish and maintain an agreement with the commissioners of commerce and health for services regarding enforcement of MNsure certification requirements for health plans and dental plans offered through MNsure. The board may establish and maintain agreements with the commissioners of commerce and health for other services; and\n(3) establish interagency agreements to transfer funds to other state agencies for their costs related to implementing and operating MNsure, excluding medical assistance allocatable costs.\n(b) The board shall consult with the commissioners of commerce and health regarding the operations of MNsure.\n(c) The board shall consult with Indian tribes and organizations regarding the operation of MNsure.\n(d) Beginning March 15, 2016, and each March 15 thereafter, the board shall submit a report to the chairs and ranking minority members of the committees in the senate and house of representatives with primary jurisdiction over commerce, health, and human services on all the agreements entered into with the chief information officer of the Department of Information Technology Services, or the commissioners of human services, health, or commerce in accordance with this subdivision. The report shall include the agency in which the agreement is with; the time period of the agreement; the purpose of the agreement; and a summary of the terms of the agreement. A copy of the agreement must be submitted to the extent practicable.\nThe board may adopt rules to implement any provisions in this chapter using the expedited rulemaking process in section 14.389.\n(a) The provisions of this section that apply to health plans shall apply to dental plans offered as stand-alone dental plans through MNsure, to the extent practicable.\n(b) A stand-alone dental plan offered through MNsure must meet all certification requirements under section 1311(c)(1) of the Affordable Care Act, Public Law 111-148, that are applicable to health plans, except for certification requirements that cannot be met because the dental plan only covers dental benefits.\n(a) The board shall not bear insurance risk or enter into any agreement with health care providers to pay claims.\n(b) Nothing in this subdivision shall prevent MNsure from providing insurance for its employees.\nMNsure is prohibited from certifying, selecting, or offering products and policies of coverage that do not meet the definition of health plan or dental plan as provided in section 62V.02.\nThe MNsure Board shall provide legislative reports on interagency agreements and intra-agency transfers according to section 15.0395.",
	"repealed": false
}