{
	"id": "144G.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.83",
	"title": "144G.83 ADDITIONAL TRAINING REQUIREMENTS FOR ASSISTED LIVING FACILITIES WITH DEMENTIA CARE.",
	"text": "(a) An assisted living facility with dementia care must provide residents with dementia-trained staff who have been instructed in the person-centered care approach. All direct care staff assigned to care for residents with dementia must be specially trained to work with residents with Alzheimer's disease and other dementias.\n(b) Only staff trained as specified in subdivisions 2 and 3 shall be assigned to care for dementia residents.\n(c) Staffing levels must be sufficient to meet the scheduled and unscheduled needs of residents. Staffing levels during nighttime hours shall be based on the sleep patterns and needs of residents.\n(d) In an emergency situation when trained staff are not available to provide services, the facility may assign staff who have not completed the required training. The particular emergency situation must be documented and must address:\n(1) the nature of the emergency;\n(2) how long the emergency lasted; and\n(3) the names and positions of staff that provided coverage.\n(a) The licensee must ensure that staff who provide support to residents with dementia can demonstrate a basic understanding and ability to apply dementia training to the residents' emotional and unique health care needs using person-centered planning delivery. Direct care dementia-trained staff and other staff must be trained on the topics identified during the expedited rulemaking process. These requirements are in addition to the licensing requirements for training.\n(b) Failure to comply with paragraph (a) or subdivision 1 shall result in a fine under section 144G.31.\nPersons providing or overseeing staff training must have experience and knowledge in the care of individuals with dementia, including:\n(1) two years of work experience related to Alzheimer's disease or other dementias, or in health care, gerontology, or another related field; and\n(2) completion of training equivalent to the requirements in this section and successfully passing a skills competency or knowledge test required by the commissioner.\nPreservice and in-service training may include various methods of instruction, such as classroom style, web-based training, video, or one-to-one training. The licensee must have a method for determining and documenting each staff person's knowledge and understanding of the training provided. All training must be documented.",
	"repealed": false
}