{
	"id": "253B.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.092",
	"title": "253B.092 ADMINISTRATION OF NEUROLEPTIC MEDICATION.",
	"text": "Neuroleptic medications may be administered, only as provided in this section, to patients subject to civil commitment under this chapter or chapter 253D. For purposes of this section, \"patient\" includes a proposed patient who is the subject of a petition for commitment and a committed person as defined in section 253D.02, subdivision 4.\n(a) Neuroleptic medications may be administered without judicial review in the following circumstances:\n(1) the patient has the capacity to make an informed decision under subdivision 4;\n(2) the patient does not have the present capacity to consent to the administration of neuroleptic medication, but prepared a health care power of attorney, a health care directive under chapter 145C, or a declaration under section 253B.03, subdivision 6d, requesting treatment or authorizing an agent or proxy to request treatment, and the agent or proxy has requested the treatment;\n(3) the patient has been prescribed neuroleptic medication prior to admission to a treatment facility, but lacks the present capacity to consent to the administration of that neuroleptic medication; continued administration of the medication is in the patient's best interest; and the patient does not refuse administration of the medication. In this situation, the previously prescribed neuroleptic medication may be continued for up to 14 days while the treating medical practitioner:\n(i) is obtaining a substitute decision-maker appointed by the court under subdivision 6; or\n(ii) is requesting a court order authorizing administering neuroleptic medication or an amendment to a current court order authorizing administration of neuroleptic medication;\n(4) a substitute decision-maker appointed by the court consents to the administration of the neuroleptic medication and the patient does not refuse administration of the medication; or\n(5) the substitute decision-maker does not consent or the patient is refusing medication, and the patient is in an emergency situation.\n(b) For the purposes of paragraph (a), clause (3), if a person requests a substitute decision-maker or requests a court order administering neuroleptic medication within 14 days, the treating medical practitioner may continue administering the medication to the patient through the hearing date or until the court otherwise issues an order.\nA treating medical practitioner may administer neuroleptic medication to a patient who does not have capacity to make a decision regarding administration of the medication if the patient is in an emergency situation. Medication may be administered for so long as the emergency continues to exist, up to 14 days, if the treating medical practitioner determines that the medication is necessary to prevent serious, immediate physical harm to the patient or to others. If a request for authorization to administer medication is made to the court within the 14 days, the treating medical practitioner may continue the medication through the date of the first court hearing, if the emergency continues to exist. If the request for authorization to administer medication is made to the court in conjunction with a petition for commitment and the court makes a determination at the preliminary hearing under section 253B.07, subdivision 7, that there is sufficient cause to continue the medical practitioner's order until the hearing under section 253B.08, the treating medical practitioner may continue the medication until that hearing, if the emergency continues to exist. The treatment facility, state-operated treatment program, or community-based treatment program shall document the emergency in the patient's medical record in specific behavioral terms.\nA patient who has the capacity to make an informed decision regarding the administration of neuroleptic medication may consent or refuse consent to administration of the medication. The informed consent of a patient must be in writing.\n(a) There is a rebuttable presumption that a patient has the capacity to make decisions regarding administration of neuroleptic medication.\n(b) A patient has the capacity to make decisions regarding the administration of neuroleptic medication if the patient:\n(1) has an awareness of the nature of the patient's situation, including the reasons for hospitalization, and the possible consequences of refusing treatment with neuroleptic medications;\n(2) has an understanding of treatment with neuroleptic medications and the risks, benefits, and alternatives; and\n(3) communicates verbally or nonverbally a clear choice regarding treatment with neuroleptic medications that is a reasoned one not based on a symptom of the patient's mental illness, even though it may not be in the patient's best interests.\n(c) Disagreement with the medical practitioner's recommendation alone is not evidence of an unreasonable decision.\n(a) Upon request of any person, and upon a showing that administration of neuroleptic medications may be recommended and that the patient may lack capacity to make decisions regarding the administration of neuroleptic medication, the court shall appoint a substitute decision-maker with authority to consent to the administration of neuroleptic medication as provided in this section. A hearing is not required for an appointment under this paragraph. The substitute decision-maker must be an individual or a community or institutional multidisciplinary panel designated by the local mental health authority. In appointing a substitute decision-maker, the court shall give preference to a guardian, proxy, or health care agent with authority to make health care decisions for the patient. The court may provide for the payment of a reasonable fee to the substitute decision-maker for services under this section or may appoint a volunteer.\n(b) If the patient's treating medical practitioner recommends treatment with neuroleptic medication, the substitute decision-maker may give or withhold consent to the administration of the medication, based on the standards under subdivision 7. If the substitute decision-maker gives informed consent to the treatment and the patient does not refuse, the substitute decision-maker shall provide written consent to the treating medical practitioner and the medication may be administered. The substitute decision-maker shall also notify the court that consent has been given. If the substitute decision-maker refuses or withdraws consent or the patient refuses the medication, neuroleptic medication must not be administered to the patient except with a court order or in an emergency.\n(c) A substitute decision-maker appointed under this section has access to the relevant sections of the patient's health records on the past or present administration of medication. The designated agency or a person involved in the patient's physical or mental health care may disclose information to the substitute decision-maker for the sole purpose of performing the responsibilities under this section. The substitute decision-maker may not disclose health records obtained under this paragraph except to the extent necessary to carry out the duties under this section.\n(d) At a hearing under section 253B.08, the petitioner has the burden of proving incapacity by a preponderance of the evidence. If a substitute decision-maker has been appointed by the court, the court shall make findings regarding the patient's capacity to make decisions regarding the administration of neuroleptic medications and affirm or reverse its appointment of a substitute decision-maker. If the court affirms the appointment of the substitute decision-maker, and if the substitute decision-maker has consented to the administration of the medication and the patient has not refused, the court shall make findings that the substitute decision-maker has consented and the treatment is authorized. If a substitute decision-maker has not yet been appointed, upon request the court shall make findings regarding the patient's capacity and appoint a substitute decision-maker if appropriate.\n(e) If an order for civil commitment did not provide for the appointment of a substitute decision-maker or for the administration of neuroleptic medication, a treatment facility, state-operated treatment program, or community-based treatment program may later request the appointment of a substitute decision-maker upon a showing that administration of neuroleptic medications is recommended and that the patient lacks capacity to make decisions regarding the administration of neuroleptic medications. A hearing is not required in order to administer the neuroleptic medication unless requested under subdivision 10 or if the substitute decision-maker withholds or refuses consent or the patient refuses the medication.\n(f) The substitute decision-maker's authority to consent to treatment lasts for the duration of the court's order of appointment or until modified by the court.\n(g) If there is no hearing after the preliminary hearing, then the court shall, upon the request of any interested party, review the reasonableness of the substitute decision-maker's decision based on the standards under subdivision 7. The court shall enter an order upholding or reversing the decision within seven days.\n(a) When a patient lacks capacity to make decisions regarding the administration of neuroleptic medication, the substitute decision-maker or the court shall use the standards in this subdivision in making a decision regarding administration of the medication.\n(b) If the patient clearly stated what the patient would choose to do in this situation when the patient had the capacity to make a reasoned decision, the patient's wishes must be followed. Evidence of the patient's wishes may include written instruments, including a durable power of attorney for health care under chapter 145C or a declaration under section 253B.03, subdivision 6d.\n(c) If evidence of the patient's wishes regarding the administration of neuroleptic medications is conflicting or lacking, the decision must be based on what a reasonable person would do, taking into consideration:\n(1) the patient's family, community, moral, religious, and social values;\n(2) the medical risks, benefits, and alternatives to the proposed treatment;\n(3) past efficacy and any extenuating circumstances of past use of neuroleptic medications; and\n(4) any other relevant factors.\n(a) If the substitute decision-maker or the patient refuses to consent to treatment with neuroleptic medications, and absent an emergency as set forth in subdivision 3, neuroleptic medications may not be administered without a court order. Upon receiving a written request for a hearing, the court shall schedule the hearing within 14 days of the request. The matter may be heard as part of any other district court proceeding under this chapter. By agreement of the parties or for good cause shown, the court may extend the time of hearing an additional 30 days.\n(b) The patient must be examined by a court examiner prior to the hearing. If the patient refuses to participate in an examination, the court examiner may rely on the patient's medical records to reach an opinion as to the appropriateness of neuroleptic medication. The patient is entitled to counsel and a second court examiner, if requested by the patient or patient's counsel.\n(c) The court may base its decision on relevant and admissible evidence, including the testimony of a treating medical practitioner or other qualified physician, a member of the patient's treatment team, a court examiner, witness testimony, or the patient's medical records.\n(d) If the court finds that the patient has the capacity to decide whether to take neuroleptic medication or that the patient lacks capacity to decide and the standards for making a decision to administer the medications under subdivision 7 are not met, the treatment facility, state-operated treatment program, or community-based treatment program may not administer medication without the patient's informed written consent or without the declaration of an emergency, or until further review by the court.\n(e) If the court finds that the patient lacks capacity to decide whether to take neuroleptic medication and has applied the standards set forth in subdivision 7, the court may authorize the treatment facility, state-operated treatment program, or community-based treatment program and any other facility or program to which the patient may be transferred or provisionally discharged, to involuntarily administer the medication to the patient. A copy of the order must be given to the patient, the patient's attorney, the county attorney, and the treatment facility, state-operated treatment program, or community-based treatment program. The treatment facility, state-operated treatment program, or community-based treatment program may not begin administration of the neuroleptic medication until it notifies the patient of the court's order authorizing the treatment.\n(f) A finding of lack of capacity under this section must not be construed to determine the patient's competence for any other purpose.\n(g) The court may authorize the administration of neuroleptic medication until the termination of a determinate commitment. If the patient is committed for an indeterminate period, the court may authorize treatment of neuroleptic medication for not more than two years, subject to the patient's right to petition the court for review of the order. The treatment facility, state-operated treatment program, or community-based treatment program must submit annual reports to the court, which shall provide copies to the patient and the respective attorneys.\n(h) The court may limit the maximum dosage of neuroleptic medication that may be administered.\n(i) If physical force is required to administer the neuroleptic medication, the facility or program may only use injectable medications. If physical force is needed to administer the medication, medication may only be administered in a setting where the person's condition can be reassessed and medical personnel qualified to administer medication are available, including in the community, a county jail, or a correctional facility. The facility or program may not use a nasogastric tube to administer neuroleptic medication involuntarily.\nA substitute decision-maker who consents to treatment is not civilly or criminally liable for the performance of or the manner of performing the treatment. A person is not liable for performing treatment without consent if the substitute decision-maker has given written consent. This provision does not affect any other liability that may result from the manner in which the treatment is performed.\nA patient or other person may petition the court under section 253B.17 for review of any determination under this section or for a decision regarding the administration of neuroleptic medications, appointment of a substitute decision-maker, or the patient's capacity to make decisions regarding administration of neuroleptic medications.",
	"repealed": false
}