{
	"id": "317A.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.231",
	"title": "317A.231 BOARD MEETINGS.",
	"text": "Meetings of the board may be held as provided in the articles or bylaws in or out of this state. Unless the articles or bylaws provide otherwise, a meeting of the board must be held at least once per year. If the articles or bylaws or the board fail to select a place or method for selecting a place for a meeting, the meeting must be held at the registered office.\nMS 2000 [Paragraph (b) renumbered subd 3]\nAny meeting among directors may be conducted solely by one or more means of remote communication through which all of the directors may participate in the meeting, if the same notice is given of the meeting required by subdivision 4, and if the number of directors participating in the meeting is sufficient to constitute a quorum at a meeting. Participation in a meeting by that means constitutes presence at the meeting.\nMS 2000 [Renumbered subd 4]\nA director may participate in a board meeting by means of conference telephone or, if authorized by the board, by such other means of remote communication, in each case through which that director, other directors so participating, and all directors physically present at the meeting may participate with each other during the meeting. Participation in a meeting by that means constitutes presence at the meeting.\nMS 2000 [Renumbered subd 5]\n(a) Unless the articles or bylaws provide otherwise, a director may call a board meeting by giving five days' notice to all directors of the date, time, and place of the meeting. The notice must contain the substance of the proposed amendment to the articles but otherwise need not state the purpose of the meeting unless the articles or bylaws require it.\n(b) If the day or date, time, and place of a board meeting have been provided in the articles or bylaws, or announced at a previous meeting of the board, notice is not required. Notice of an adjourned meeting need not be given other than by announcement at the meeting at which adjournment is taken.\n(c) Any notice to a director given under any provision of this chapter, the articles, or the bylaws by a form of electronic communication consented to by the director to whom the notice is given is effective when given. The notice is deemed given if by:\n(1) facsimile communication, when directed to a telephone number at which the director has consented to receive notice;\n(2) electronic mail, when directed to an electronic mail address at which the director has consented to receive notice;\n(3) a posting on an electronic network on which the director has consented to receive notice, together with a separate notice to the director of the specific posting, upon the later of:\n(i) the posting; or\n(ii) the giving of the separate notice; and\n(4) any other form of electronic communication by which the director has consented to receive notice, when directed to the director.\nAn affidavit of the secretary, other authorized officer, or authorized agent of the corporation, that the notice has been given by a form of electronic communication is, in the absence of fraud, prima facie evidence of the facts stated in the affidavit.\n(d) Consent by a director to notice given by electronic communication may be given in writing or by authenticated electronic communication. Any consent so given may be relied upon until revoked by the director, provided that no revocation affects the validity of any notice given before receipt of revocation of the consent.\nA director may waive notice of a meeting of the board. A waiver of notice by a director entitled to notice is effective whether given before, at, or after the meeting, and whether given in writing, orally, by authenticated electronic communication, or by attendance. Attendance by a director at a meeting is a waiver of notice of that meeting, unless the director objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened and does not participate in the meeting.",
	"repealed": false
}