{
	"id": "103H.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/103H.101",
	"title": "103H.101 PROTECTING SENSITIVE AREAS.",
	"text": "The commissioner of natural resources in consultation with the Minnesota Geological Survey, soil and water conservation districts, local water planning authorities, and other interested parties shall develop specific criteria for identifying sensitive groundwater areas and adopt the criteria by rule.\nThe commissioner of natural resources shall, in consultation with the Minnesota Geological Survey, identify the location of sensitive areas by mapping and other appropriate methods after consulting the Minnesota Geological Survey, soil and water conservation districts, and local water planning authorities.\nThe commissioner of natural resources shall:\n(1) notify political subdivisions with planning or zoning authority and provide maps and other materials that show where sensitive areas are located and indicate the type of risk of groundwater degradation that may occur from activities at or near the surface; and\n(2) publish notification of sensitive areas in a newspaper of general circulation in the county where the sensitive areas are located.\nThe commissioner of natural resources shall coordinate the collection of state and local information to identify sensitive areas. Information must be automated on or accessible to systems developed at the Minnesota Geospatial Information Office.\n(a) The commissioner of agriculture for pollution resulting from agricultural chemicals and practices and the Pollution Control Agency for other pollutants must consider the type of risk identified under subdivision 3 when adopting best management practices, water resource protection plans, and water resource protection requirements to prevent and minimize groundwater degradation in sensitive areas.\n(b) To prevent and minimize groundwater degradation, state agencies must consider the type of risk identified under subdivision 3 when undertaking an activity within a sensitive area.\nUpon adoption of a comprehensive local water plan as defined in section 103B.101 to 103B.355 or a water management plan under chapter 473 or sections 103B.201 to 103B.255, a regulating authority must take into account the plan and any geological assessments referenced in the plan when taking appropriate actions in sensitive areas.\nEach state agency that has a program affecting activities that may cause or contribute to groundwater pollution shall identify and develop best management practices to ensure that the program is consistent with and is effective in achieving the goal of section 103H.001. For those activities which may cause or contribute to pollution of groundwater, but are not directly regulated by the state, best management practices shall be promoted through education, support programs, incentives, and other mechanisms.",
	"repealed": false
}