{
	"id": "336A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/336A.07",
	"title": "336A.07 TERMINATION STATEMENTS.",
	"text": "(a) A secured party shall within 30 days file a lien termination statement and termination statement for the effective financing statement when:\n(1) an outstanding secured obligation does not exist; and\n(2) a written commitment to make advances, incur obligations, or otherwise give value does not exist.\n(b) A lienholder shall file a termination statement with respect to a lien notice within 30 days after an outstanding lien notice obligation no longer exists.\n(a) Unless filed pursuant to section 336A.03, subdivision 4, in order to amend an effective financing statement or a lien notice, a termination statement for a lien notice or an effective financing statement must:\n(1) state the file number of the effective financing statement or lien notice;\n(2) state the date on which the lien or security interest was satisfied;\n(3) state that the secured party does not claim a security interest under the effective financing statement or that the lienholder does not claim a lien under the lien notice; and\n(4) be signed, authorized, or otherwise authenticated by the secured party or lienholder.\n(b) If a termination statement is filed pursuant to section 336A.03, subdivision 4, in order to amend an effective financing statement or a lien notice, the termination statement must:\n(1) state the file number of the effective financing statement or lien notice; and\n(2) be signed, authorized, or otherwise authenticated by the secured party or lienholder.\nA termination statement for an effective financing statement or a lien notice must be filed in the computerized filing system operated by the Office of the Secretary of the State.\nIf the secured party or lienholder fails to file a termination statement as required by subdivision 1, or within ten days after a debtor serves a written demand for the termination statement if the conditions in subdivision 1 exist, the secured party or lienholder is liable to the debtor for $100 plus any loss caused to the debtor by failing to file the termination statement. For the second and each subsequent time a secured party or lienholder is found liable to a debtor under this subdivision in any one calendar year, the secured party or lienholder is liable to the debtor for $250 plus any loss caused to the debtor.\n[Repealed by amendment, 2004 c 191 s 8]",
	"repealed": false
}