{
	"id": "25.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/25.40",
	"title": "25.40 RULES.",
	"text": "(a) The commissioner may adopt rules for commercial feeds, pet foods, and specialty pet foods as are authorized in sections 25.31 to 25.43 and other reasonable rules as may be necessary for the efficient enforcement of sections 25.31 to 25.43. In the interest of uniformity the commissioner shall by rule adopt, unless the commissioner determines that they are inconsistent with the provisions of sections 25.31 to 25.43 or are not appropriate to conditions which exist in this state, the official definitions of feed ingredients and official feed terms adopted by the Association of American Feed Control Officials and published in the official publication of that organization.\n(b) The Model Pet and Specialty Pet Food Regulation, as adopted by the Association of American Feed Control Officials, is adopted as the pet food and specialty pet food rules in this state.\nBefore the issuance, amendment, or repeal of any rule authorized by sections 25.31 to 25.43, the commissioner shall publish the proposed rule, amendment, or notice to repeal an existing rule in a manner reasonably calculated to give interested parties, including all current license holders, adequate notice and shall afford all interested persons an opportunity to present their views orally or in writing, within a reasonable period of time. After consideration of all views presented by interested persons, the commissioner shall take appropriate action to issue the proposed rule or to amend or repeal an existing rule. The provisions of this subdivision notwithstanding, if the commissioner, pursuant to the authority of sections 25.31 to 25.43, adopts the Model Pet and Specialty Pet Food Regulation, official definitions of feed ingredients, and official feed terms as adopted by the Association of American Feed Control Officials, any amendment or modification adopted by the association is adopted automatically under sections 25.31 to 25.43 without regard to the publication of the notice required by this subdivision unless the commissioner, by order specifically determines that the amendment or modification shall not be adopted.\nApplicable federal regulations including recodification contained in Code of Federal Regulations, title 21, parts 1 to 1299, not otherwise adopted herein, also are adopted as feed rules of this state.",
	"repealed": false
}