{
	"id": "157.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/157.17",
	"title": "157.17 ADDITIONAL REGISTRATION REQUIRED FOR BOARDING AND LODGING ESTABLISHMENTS OR LODGING ESTABLISHMENTS; SPECIAL SERVICES.",
	"text": "(a) \"Supportive services\" means the provision of supervision and minimal assistance with independent living skills such as social and recreational opportunities, assistance with transportation, arranging for meetings and appointments, and arranging for medical and social services. Supportive services also include providing reminders to residents to take medications that are self-administered or providing storage for medications if requested.\n(b) \"Health supervision services\" means the provision of assistance in the preparation and administration of medications other than injectables, the provision of therapeutic diets, taking vital signs, or providing assistance in dressing, grooming, bathing, or with walking devices.\nAt the time of licensure or license renewal, a boarding and lodging establishment or a lodging establishment that provides supportive services or health supervision services must be registered with the commissioner, and must register annually thereafter. The registration must include the name, address, and telephone number of the establishment, the name of the operator, the types of services that are being provided, a description of the residents being served, the type and qualifications of staff in the facility, and other information that is necessary to identify the needs of the residents and the types of services that are being provided. The commissioner shall develop and furnish to the boarding and lodging establishment or lodging establishment the necessary form for submitting the registration.\nHousing with services establishments registered under chapter 144D shall be considered registered under this section for all purposes except that:\n(1) the establishments shall operate under the requirements of chapter 144D; and\n(2) the criminal background check requirements of sections 299C.66 to 299C.71 apply. The criminal background check requirements of section 144.057 apply only to personnel providing home care services under sections 144A.43 to 144A.47 and personnel providing hospice care under sections 144A.75 to 144A.755.\nA boarding and lodging establishment or lodging establishment registered under subdivision 2 may provide health supervision services only if a licensed nurse is on site in the establishment for at least four hours a week to provide monitoring of health supervision services for the residents. A boarding and lodging establishment or lodging establishment that admits or retains residents using wheelchairs or walkers must have the necessary clearances from the Office of the State Fire Marshal.\n[Repealed, 1998 c 254 art 1 s 57]\nExcept those facilities registered under chapter 144D, a boarding and lodging establishment or lodging establishment may not admit or retain individuals who:\n(1) would require assistance from establishment staff because of the following needs: bowel incontinence, catheter care, use of injectable or parenteral medications, wound care, or dressing changes or irrigations of any kind; or\n(2) require a level of care and supervision beyond supportive services or health supervision services.\nThis section does not prohibit the provision of health care services to residents of a boarding and lodging establishment or lodging establishment by family members of the resident or by a registered or licensed home care agency employed by the resident.\nThis section does not apply to a boarding and lodging establishment or lodging establishment that is licensed by the commissioner of human services under chapter 245A.\nThe commissioner may revoke the establishment license if the establishment is found to be in violation of this section. Violation of this section is a gross misdemeanor.",
	"repealed": false
}