{
	"id": "259.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.43",
	"title": "259.43 BIRTH PARENT HISTORY; COMMISSIONER'S FORM.",
	"text": "In any adoption under this chapter, except a stepparent or an adult adoption under section 259.241, a birth parent or an agency, if an agency placement, shall provide a prospective adoptive parent with a complete, thorough, detailed, and current social and medical history of the child being adopted, if information is known after reasonable inquiry. Each child's social and medical history must be provided on a form or forms prepared by the commissioner and must include background and health history specific to the child, the child's birth parents, and the child's other birth relatives. Applicable background and health information about the child includes: the child's current health condition, behavior, and demeanor; placement history; education history; sibling information; and birth, medical, dental, and immunization information. Redacted copies of pertinent records, assessments, and evaluations shall be attached to the child's social and medical history. Applicable background information about the child's birth parents and other birth relatives includes: general background information; education and employment history; physical health and mental health history; and reasons for the child's placement. The child's social and medical history shall be completed in a manner that protects the identities of all individuals described in it. The commissioner shall make the form available to agencies and court administrators for public distribution. The child's social and medical history must be provided to the prospective adoptive family prior to adoptive placement, provided to the Department of Children, Youth, and Families with application for adoption assistance, if applicable, and filed with the court when the adoption petition is filed. In a direct adoptive placement, the child's social and medical history must be filed with the court with the motion for temporary preadoptive custody.",
	"repealed": false
}