{
	"id": "609.713",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.713",
	"title": "609.713 THREATS OF VIOLENCE.",
	"text": "Whoever threatens, directly or indirectly, to commit any crime of violence with purpose to terrorize another or to cause evacuation of a building, place of assembly, vehicle or facility of public transportation or otherwise to cause serious public inconvenience, or in a reckless disregard of the risk of causing such terror or inconvenience may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both. As used in this subdivision, \"crime of violence\" has the meaning given \"violent crime\" in section 609.1095, subdivision 1, paragraph (d).\nWhoever communicates to another with purpose to terrorize another or in reckless disregard of the risk of causing such terror, that explosives or an explosive device or any incendiary device is present at a named place or location, whether or not the same is in fact present, may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $3,000, or both.\n(a) Whoever displays, exhibits, brandishes, or otherwise employs a replica firearm or a BB gun in a threatening manner, may be sentenced to imprisonment for not more than one year and one day or to payment of a fine of not more than $3,000, or both, if, in doing so, the person either:\n(1) causes or attempts to cause terror in another person; or\n(2) acts in reckless disregard of the risk of causing terror in another person.\n(b) For purposes of this subdivision:\n(1) \"BB gun\" means a device that fires or ejects a shot measuring .18 of an inch or less in diameter; and\n(2) \"replica firearm\" means a device or object that is not defined as a dangerous weapon, and that is a facsimile or toy version of, and reasonably appears to be a pistol, revolver, shotgun, sawed-off shotgun, rifle, machine gun, rocket launcher, or any other firearm. The term replica firearm includes, but is not limited to, devices or objects that are designed to fire only blanks.",
	"repealed": false
}