{
	"id": "171.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.015",
	"title": "171.015 DRIVER'S LICENSE DIVISION.",
	"text": "A division in the Department of Public Safety to be known as the Driver's License Division is hereby created, under the supervision and control of a director. The commissioner may place the director's position in the unclassified service if the position meets the criteria established in section 43A.08, subdivision 1a. The director shall be assigned the duties and responsibilities prescribed in this section.\nAll the powers and duties now vested in or imposed upon the Department of Transportation and the commissioner of transportation in regard to drivers' licensing and safety responsibility as prescribed by this chapter and chapters 169 and 170, are hereby transferred to, vested in, and imposed upon the commissioner of public safety. The duties and responsibilities of the Department of Transportation and the commissioner of transportation, in relation to such matters as heretofore constituted, are hereby abolished.\nThe commissioner of public safety, with the approval of the governor, may transfer and assign to the Driver's License Division duties and responsibilities in relation to chauffeurs' licensing and school bus drivers' licensing as vested in and imposed upon the Division of Motor Vehicles.\n[Repealed, 1991 c 199 art 1 s 59]\nAll the powers and duties now vested in or imposed upon the Department of Education and the Department of Transportation relating to drivers' training as prescribed by section 171.04, are hereby transferred to, vested in, and imposed upon the commissioner of public safety. The duties of the Department of Education and the Department of Transportation with reference to such training as heretofore constituted are hereby abolished.\nThe commissioner of transportation shall provide space as required for driver and chauffeur license activities at such locations and under such contractual conditions as may be determined with the commissioner of public safety.\nMS 2022 [Repealed, 2023 c 13 art 1 s 12]",
	"repealed": false
}