{
	"id": "181.213",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.213",
	"title": "181.213 DUTIES OF THE BOARD; MINIMUM NURSING HOME EMPLOYMENT STANDARDS.",
	"text": "(a) The board must adopt rules establishing minimum nursing home employment standards that are reasonably necessary and appropriate to protect the health and welfare of nursing home workers, to ensure that nursing home workers are properly trained about and fully informed of their rights under sections 181.211 to 181.217, and to otherwise satisfy the purposes of sections 181.211 to 181.217. Standards established by the board must include standards on compensation for nursing home workers, and may include recommendations under paragraph (c). The board may not adopt standards that are less protective of or beneficial to nursing home workers as any other applicable statute or rule or any standard previously established by the board unless there is a determination by the board under subdivision 2 that existing standards exceed the operating payment rate and external fixed costs payment rates included in the most recent budget and economic forecast completed under section 16A.103. In establishing standards under this section, the board must establish statewide standards, and may adopt standards that apply to specific nursing home occupations.\n(b) The board must adopt rules establishing initial standards for wages for nursing home workers no later than November 1, 2024. The board may use the authority in section 14.389 to adopt rules under this paragraph. The board shall consult with the department in the development of these standards prior to beginning the rule adoption process.\n(c) To the extent that any minimum standards that the board finds are reasonably necessary and appropriate to protect the health and welfare of nursing home workers fall within the jurisdiction of chapter 182, the board shall not adopt rules establishing the standards but shall instead recommend the occupational health and safety standards to the commissioner. The commissioner shall adopt nursing home health and safety standards under section 182.655 as recommended by the board, unless the commissioner determines that the recommended standard is outside the statutory authority of the commissioner, presents enforceability challenges, is infeasible to implement, or is otherwise unlawful and issues a written explanation of this determination.\n(a) The board must investigate market conditions and the existing wages, benefits, and working conditions of nursing home workers for specific geographic areas of the state and specific nursing home occupations. Based on this information, the board must seek to adopt minimum nursing home employment standards that meet or exceed existing industry conditions for a majority of nursing home workers in the relevant geographic area and nursing home occupation. Except for standards exceeding the threshold determined in paragraph (d), initial employment standards established by the board are effective beginning January 1, 2025, and shall remain in effect until any subsequent standards are adopted by rules.\n(b) The board must consider the following types of information in making determinations that employment standards are reasonably necessary to protect the health and welfare of nursing home workers:\n(1) wage rate and benefit data collected by or submitted to the board for nursing home workers in the relevant geographic area and nursing home occupations;\n(2) statements showing wage rates and benefits paid to nursing home workers in the relevant geographic area and nursing home occupations;\n(3) signed collective bargaining agreements applicable to nursing home workers in the relevant geographic area and nursing home occupations;\n(4) testimony and information from current and former nursing home workers, worker organizations, nursing home employers, and employer organizations;\n(5) local minimum nursing home employment standards;\n(6) information submitted by or obtained from state and local government entities; and\n(7) any other information pertinent to establishing minimum nursing home employment standards.\n(c) In considering wage and benefit increases, the board must determine the impact of nursing home operating payment rates determined pursuant to section 256R.21, subdivision 3, and the employee benefits portion of the external fixed costs payment rate determined pursuant to section 256R.25. If the board, in consultation with the commissioner of human services, determines the operating payment rate and employee benefits portion of the external fixed costs payment rate will increase to comply with the new employment standards, the board shall report to the legislature the increase in funding needed to increase payment rates to comply with the new employment standards and must make implementation of any new nursing home employment standards contingent upon an appropriation, as determined by sections 256R.21 and 256R.25, to fund the rate increase necessary to comply with the new employment standards.\n(d) In evaluating the impact of the employment standards on payment rates determined by sections 256R.21 and 256R.25, the board, in consultation with the commissioner of human services, must consider the following:\n(1) the statewide average wage rates for employees pursuant to section 256R.10, subdivision 5, and benefit rates pursuant to section 256R.02, subdivisions 18 and 22, as determined by the annual Medicaid cost report used to determine the operating payment rate and the employee benefits portion of the external fixed costs payment rate for the first day of the calendar year immediately following the date the board has established minimum wage and benefit levels;\n(2) compare the results of clause (1) to the operating payment rate and employee benefits portion of the external fixed costs payment rate increase for the first day of the second calendar year after the adoption of any nursing home employment standards included in the most recent budget and economic forecast completed under section 16A.103; and\n(3) if the established nursing home employment standards result in an increase in costs that exceed the operating payment rate and external fixed costs payment rate increase included in the most recent budget and economic forecast completed under section 16A.103, effective on the proposed implementation date of the new nursing home employment standards, the board must determine if the rates will need to be increased to meet the new employment standards and the standards must not be effective until an appropriation sufficient to cover the rate increase and federal approval of the rate increase is obtained.\n(e) The budget and economic forecasts completed under section 16A.103 shall not assume an increase in payment rates determined under chapter 256R resulting from the new employment standards until the board certifies the rates will need to be increased and the legislature appropriates funding for the increase in payment rates.\nAt least once every two years, the board shall:\n(1) conduct a full review of the adequacy of the minimum nursing home employment standards previously established by the board; and\n(2) following that review, adopt new rules, amend or repeal existing rules, or make recommendations to adopt new rules or amend or repeal existing rules for minimum nursing home employment standards using the expedited rulemaking process in section 14.389, as appropriate to meet the purposes of sections 181.211 to 181.217.\nThe board shall adopt procedures for considering temporary variances and waivers of the established standards for individual nursing homes based on the board's evaluation of the risk of closure or receivership under section 144A.15, due to compliance with all or part of an applicable standard.\n(a) In the event of a conflict between a standard established by the board in rule and a rule adopted by another state agency, the rule adopted by the board shall apply to nursing home workers and nursing home employers.\n(b) Notwithstanding paragraph (a), in the event of a conflict between a standard established by the board in rule and a rule adopted by another state agency, the rule adopted by the other state agency shall apply to nursing home workers and nursing home employers if the rule adopted by the other state agency is adopted after the board's standard and the rule adopted by the other state agency is more protective or beneficial than the board's standard.\n(c) Notwithstanding paragraph (a), if the commissioner of health determines that a standard established by the board in rule or recommended by the board conflicts with requirements in federal regulations for nursing home certification or with state statutes or rules governing licensure of nursing homes, the federal regulations or state nursing home licensure statutes or rules shall take precedence, and the conflicting board standard or rule shall not apply to nursing home workers or nursing home employers.\nNothing in sections 181.211 to 181.217 shall be construed to:\n(1) limit the rights of parties to a collective bargaining agreement to bargain and agree with respect to nursing home employment standards; or\n(2) diminish the obligation of a nursing home employer to comply with any contract, collective bargaining agreement, or employment benefit program or plan that meets or exceeds, and does not conflict with, the minimum standards and requirements in sections 181.211 to 181.217 or established by the board.",
	"repealed": false
}