{
	"id": "17.134",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.134",
	"title": "17.134 SOIL HEALTH FINANCIAL ASSISTANCE PROGRAM.",
	"text": "The commissioner must establish and administer a program to support healthy soil management practices in accordance with this section.\nThe commissioner may award a grant under this section for any project on agricultural land in Minnesota that will:\n(1) increase the quantity of organic carbon in soil through practices, including but not limited to reduced tillage, cover cropping, manure management, precision agriculture, crop rotations, and changes in grazing management;\n(2) integrate perennial vegetation into the management of agricultural lands;\n(3) reduce nitrous oxide and methane emissions through changes to livestock, soil management, or nutrient optimization;\n(4) increase the usage of precision agricultural practices;\n(5) enable the development of site-specific management plans; or\n(6) enable the purchase of equipment, parts and materials, technology, subscriptions, technical assistance, seeds, seedlings, or amendments that will further any of the purposes in clauses (1) to (5).\nAny owner or lessee of farmland may apply for a grant under this section. The commissioner must give preference to owners and lessees that have not previously implemented an eligible project and owners and lessees that are certified or assessed and pursuing certification under sections 17.9891 to 17.993. Local government units, including cities; towns; counties; soil and water conservation districts; Minnesota Tribal governments as defined in section 10.65; and joint powers boards, are also eligible for a grant. A local government unit that receives a grant for equipment or technology must make those purchases available for use by the public.\nIn addition to the applicable grants management requirements imposed under sections 16B.97 to 16B.991, an owner or lessee that receives a grant under this section to purchase equipment must certify to the commissioner that the owner or lessee will not sell the equipment for at least ten years.\nBy January 15 each year, the commissioner must submit a report on the grants awarded under this section to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over agriculture policy and finance. The report must include the number of grants awarded by county and the combined value of those grants.",
	"repealed": false
}