{
	"id": "241.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.67",
	"title": "241.67 SEX OFFENDER TREATMENT; PROGRAMS; STANDARDS; DATA.",
	"text": "A sex offender treatment system is established under the administration of the commissioner of corrections to provide and finance a range of sex offender treatment programs for eligible adults and juveniles. Offenders who are eligible to receive treatment, within the limits of available funding, are:\n(1) adults and juveniles committed to the custody of the commissioner;\n(2) adult offenders for whom treatment is required by the court as a condition of probation; and\n(3) juvenile offenders who have been found delinquent or received a stay of adjudication, for whom the juvenile court has ordered treatment.\n(a) The commissioner shall adopt rules under chapter 14 for the certification of adult and juvenile sex offender treatment programs in state and local correctional facilities and state-operated adult and juvenile sex offender treatment programs not operated in state or local correctional facilities. The rules shall require that sex offender treatment programs be at least four months in duration. A correctional facility may not operate a sex offender treatment program unless the program has met the standards adopted by and been certified by the commissioner of corrections. As used in this subdivision, \"correctional facility\" has the meaning given it in section 241.021, subdivision 1i.\n(b) In addition to other certification requirements established under paragraph (a), the commissioner must require all programs certified under this subdivision to participate in the sex offender program evaluation project established by the commissioner under section 241.67, subdivision 8.\n(a) The commissioner shall provide for a range of sex offender programs, including intensive sex offender programs, within the state adult correctional facility system. Participation in any program is subject to the rules and regulations of the Department of Corrections. Nothing in this section requires the commissioner to accept or retain an offender in a program if the offender is determined by prison professionals as unamenable to programming within the prison system or if the offender refuses or fails to comply with the program's requirements. Nothing in this section creates a right of an offender to treatment.\n(b) The commissioner shall develop a plan to provide for residential and outpatient sex offender programming and aftercare when required for conditional release under section 609.3455, subdivision 3a, or as a condition of supervised release. The plan may include co-payments from the offender, third-party payers, local agencies, or other funding sources as they are identified.\nThe commissioner shall provide for sex offender treatment programs for juveniles committed to the commissioner by the courts under section 260B.198, as provided under section 242.195.\n[Repealed, 1993 c 326 art 8 s 17]\nThe commissioner of corrections shall develop in-service training for state and local corrections agents and probation officers who supervise adult and juvenile sex offenders on probation or supervised release. The commissioner shall make the training available to all current and future corrections agents and probation officers who supervise or will supervise sex offenders on probation or supervised release.\nA state or local corrections agent or probation officer may not supervise adult or juvenile sex offenders on probation or supervised release unless the agent or officer has completed the in-service sex offender supervision training. The commissioner may waive this requirement if the corrections agent or probation officer has completed equivalent training as part of a postsecondary educational curriculum.\nWhen an adult sex offender is placed on supervised release or is sentenced to probationary supervision, and when a juvenile offender is found delinquent by the juvenile court for a sex offense and placed on probation or is paroled from a juvenile correctional facility, a corrections agent or probation officer may not be assigned to the offender unless the agent or officer has completed the in-service sex offender supervision training.\n(a) Unless otherwise directed by the terms of a particular appropriations provision, the commissioner shall give priority to the funding of juvenile sex offender programs over the funding of adult sex offender programs.\n(b) Every county or private sex offender program shall provide the commissioner with any information relating to the program's effectiveness that the commissioner considers necessary. The commissioner shall deny state funding or reimbursement to any county or private program that fails to provide this information or that appears to be an ineffective program.\n(a) For the purposes of this subdivision, a sex offender is an adult who has been convicted, or a juvenile who has been adjudicated, for a sex offense or a sex-related offense which would require registration under section 243.166.\n(b) The commissioner shall:\n(1) collect follow-up information on each sex offender for a period of three years following the offender's completion of or termination from treatment for the purpose of providing periodic reports to the legislature;\n(2) provide treatment programs in several geographical areas in the state;\n(3) provide the necessary data to form the basis to recommend a fiscally sound plan to provide a coordinated statewide system of effective sex offender treatment programming; and\n(4) provide an opportunity to local and regional governments, agencies, and programs to establish models of sex offender programs that are suited to the needs of that region.\n(c) The commissioner shall establish an advisory task force consisting of county probation officers from Community Corrections Act counties and other counties, court services providers, and other interested officials. The commissioner shall consult with the task force on how best to implement the requirements of this subdivision.\n(a) All sex offender treatment facilities that provide treatment to sex offenders who begin treatment as a condition of probation shall provide the commissioner relevant information on the treatment of those offenders as the commissioner requests for the purpose of this evaluation. The information disclosed to the commissioner shall only be reported in aggregate and that information must not be used to designate additional sanctions for any individual offender.\n(b) All county corrections agencies or court services officers shall provide the commissioner information as requested regarding juveniles and adults as defined in subdivision 8, paragraph (a), for the purpose of completing the requirements of subdivision 8.",
	"repealed": false
}