{
	"id": "462C.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.14",
	"title": "462C.14 HOUSING PROGRAM AND DEVELOPMENTAL FINANCIAL SERVICES.",
	"text": "A city, as defined in section 462C.02, subdivision 6, may provide housing program and development financial services, including mortgage banking services, for housing financed or assisted under a housing program of the city. The services provided by the city may include all housing program and development financial services, including origination of loans or other indebtedness, administration and servicing of loans or other indebtedness, arranging for mortgage insurance from private or public sources, and other related services. For this purpose, the city may exercise any of the powers relating to housing or housing finance provided in this section and the powers of a city under this chapter, a housing and redevelopment authority under chapter 469, or the Minnesota Housing Finance Agency under chapter 462A. Housing program and development financial services provided by the city are determined to be for the public purpose of ensuring an adequate supply of affordable, decent, safe, and sanitary housing. A city may form a corporation under chapter 302A or 317A controlled by the city and delegate to it the power to exercise the powers granted to the city by this section.\nA city may provide housing program and development financial services only within its corporate boundaries, except to the extent that a joint powers agreement or contract authorizes a city to provide the services within the boundaries of another city or within the jurisdiction of a state agency.\nTwo or more cities, or housing and redevelopment authorities or port authorities authorized to exercise the powers of a city under this chapter, or a joint powers board formed by them, may act jointly pursuant to section 471.59 and this section or may delegate the exercise of their powers under this section to a corporation controlled by them. A city as defined in section 462C.02, subdivision 6, or other political subdivision or state agency may contract with the city or a joint powers board or a corporation for housing program and development financial services for housing.\nThe city may issue bonds or other obligations and apply their proceeds for any proper purpose of the city or a corporation formed by the city relating to housing program and development financial services. Bonds or other obligations issued for a specific program or development shall be issued only in accordance with sections 462C.01 to 462C.07 to the extent required by section 462C.08. Bonds or obligations issued for financial services purposes may be sold at public or private sale, without an election, on the terms and conditions the city shall determine. For that purpose, the city may exercise any of the powers that a housing and redevelopment authority may exercise under chapter 469, or the Minnesota Housing Finance Agency may exercise under chapter 462A, in either case without limitation under the provisions of chapter 475. The city or corporation may purchase real or personal property used or useful for housing program or development financial services under an installment contract, or lease real or personal property with an option to purchase under a lease purchase agreement. The city may issue bonds or other obligations secured by obligations under an installment contract or lease, in the manner provided in this section for other bonds or obligations issued for financial services purposes.",
	"repealed": false
}