{
	"id": "322C.1001",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.1001",
	"title": "322C.1001 DEFINITIONS.",
	"text": "For the purposes of sections 322C.1001 to 322C.1015, the terms defined in this section have the meanings given them.\n\"Constituent limited liability company\" means a constituent organization that is a limited liability company.\n\"Constituent organization\" means an organization that is party to a merger or exchange.\n\"Converted organization\" means the organization into which a converting organization converts pursuant to sections 322C.1007 to 322C.1010.\n\"Converting limited liability company\" means a converting organization that is a limited liability company.\n\"Converting organization\" means an organization that converts into another organization pursuant to section 322C.1007.\n\"Domesticated company\" means the company that exists after a domesticating foreign limited liability company or limited liability company effects a domestication pursuant to sections 322C.1011 to 322C.1014.\n\"Domesticating company\" means the company that effects a domestication pursuant to sections 322C.1011 to 322C.1014.\n\"Governing statute\" means the statute that governs an organization's internal affairs.\n\"Organization\" means a general partnership, including a limited liability partnership, limited partnership, including a limited liability limited partnership, limited liability company, business trust, corporation, or any other person having a governing statute. The term includes a domestic or foreign organization regardless of whether organized for profit.\n\"Organizational documents\" means:\n(1) for a domestic or foreign general partnership, its partnership agreement;\n(2) for a domestic or foreign limited partnership, its certificate of limited partnership and partnership agreement;\n(3) for a domestic or foreign limited liability company, its certificate or articles of organization and operating agreement, or comparable records as provided in its governing statute;\n(4) for a business trust, its agreement of trust and declaration of trust;\n(5) for a domestic or foreign corporation for profit, its articles of incorporation, bylaws, and other agreements among its shareholders which are authorized by its governing statute, or comparable records as provided in its governing statute; and\n(6) for any other organization, the basic records that create the organization and determine its internal governance and the relations among the persons that own it, have an interest in it, or are members of it, in each case as provided or authorized by its governing statute.\n\"Parent organization\" of a limited liability company means an organization that owns, directly or indirectly through one or more other wholly owned organizations, all of the rights to distributions and all of the management rights of a limited liability company.\n\"Personal liability\" means liability for a debt, obligation, or other liability of an organization which is imposed on a person that co-owns, has an interest in, or is a member of the organization:\n(1) by the governing statute solely by reason of the person co-owning, having an interest in, or being a member of the organization; or\n(2) by the organization's organizational documents under a provision of the governing statute authorizing those documents to make one or more specified persons liable for all or specified debts, obligations, or other liabilities of the organization solely by reason of the person or persons co-owning, ha ving an interest or interests in, or being a member or members of the organization.\n\"Surviving organization\" means an organization into which one or more other organizations are merged whether the organization preexisted the merger or was created by the merger.\n\"Wholly owned subsidiary\" means a limited liability company in which all of the rights to distributions and all of the management rights are owned directly or indirectly by a parent organization.",
	"repealed": false
}