{
	"id": "326B.099",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.099",
	"title": "326B.099 CONTINUING EDUCATION; COURSES.",
	"text": "(a) Each course of study shall have at least one sponsor, approved by the commissioner, who is responsible for supervising the program and ensuring compliance with all relevant law. Sponsors may engage an additional approved sponsor in order to assist the sponsor or to act as a substitute for the sponsor.\n(b) Sponsors must submit an application and sworn statement stating they agree to abide by the requirements of this section and any other applicable statute or rule pertaining to continuing education in the regulated industry.\n(c) A sponsor may also be an instructor.\n(d) Failure to comply with paragraph (b) may result in loss of sponsor approval for up to two years in accordance with section 326B.082.\nA sponsor is responsible for:\n(1) ensuring compliance with all laws and rules relating to continuing educational offerings governed by the commissioner;\n(2) ensuring that students are provided with current and accurate information relating to the laws and rules governing the regulated industry;\n(3) supervising and evaluating courses and instructors. Supervision includes ensuring that all areas of the curriculum are addressed without redundancy and that continuity is present throughout the entire course;\n(4) ensuring that instructors are qualified to teach the course offering;\n(5) furnishing the commissioner, upon request, with copies of course evaluations. Evaluations must be completed by students at the time the course is offered;\n(6) furnishing the commissioner, upon request, with copies of the qualifications of instructors;\n(7) investigating complaints related to course offerings or instructors. A copy of the written complaint must be sent to the commissioner within ten days of receipt of the complaint and a copy of the complaint resolution must be sent not more than ten days after resolution is reached;\n(8) maintaining accurate records relating to course offerings, instructors, tests taken by students if required, and student attendance for a period of three years from the date on which the course was completed. These records must be made available to the commissioner upon request. In the event the sponsor ceases operations before termination of the sponsor application, the sponsor must provide to the commissioner digital copies of all course and attendance records of courses held for the previous three years;\n(9) attending workshops or instructional programs as reasonably required by the commissioner;\n(10) providing course completion certificates within ten days of, but not before, completion of the entire course. A sponsor may require payment of the course tuition as a condition of receiving the course completion certificate. Course completion certificates must be completed in their entirety and shall contain the following:\n(i) the statement: \"If you have any comments about this course offering, please mail them to the Minnesota Department of Labor and Industry.\";\n(ii) the current address of the department, name of the provider, date and location of the course, educational program identification provided by the department, and hours of instruction or continuing education hours; and\n(iii) the licensee's or attendee's name and license, certificate, or registration number or the last four digits of the licensee's or attendee's Social Security number; and\n(11) notifying the commissioner in writing within ten days of any change in the information in an application for approval on file with the commissioner.\n(a) Each continuing education course shall have an instructor who is qualified by education, training, or experience to ensure competent instruction. Failure to have only qualified instructors teach at an approved course offering will result in loss of course approval. Sponsors are responsible to ensure that an instructor is qualified to teach the course offering.\n(b) Qualified continuing education instructors must have one of the following qualifications:\n(1) four years' practical experience in the subject area being taught;\n(2) a college or graduate degree in the subject area being taught;\n(3) direct experience in the development of laws, rules, or regulations related to the regulated industry; or\n(4) demonstrated expertise in the subject area being taught. Instructors providing instruction related to electricity, plumbing, or high pressure piping systems must comply with all applicable continuing education rules adopted by the Board of Electricity, the Plumbing Board, or the Board of High Pressure Piping Systems.\n(c) Qualified continuing education instructors are responsible for:\n(1) compliance with all laws and rules relating to continuing education;\n(2) providing students with current and accurate information;\n(3) maintaining an atmosphere conducive to learning in the classroom;\n(4) verifying attendance of students, and certifying course completion;\n(5) providing assistance to students and responding to questions relating to course materials; and\n(6) attending the workshops or instructional programs that are required by the commissioner.\n(a) In connection with an approved continuing education course, sponsors and instructors shall not:\n(1) recommend, promote, or disparage the specific services, products, processes, procedures, or practices of a particular person in the regulated industry;\n(2) encourage or recruit students to engage the services of, or become associated with, a particular business;\n(3) use materials for the sole purpose of promoting a particular business;\n(4) require students to participate in other programs or services offered by an instructor or sponsor;\n(5) attempt, either directly or indirectly, to discover questions or answers on an examination for a license;\n(6) disseminate to any other person specific questions, problems, or information known or believed to be included in licensing examinations;\n(7) misrepresent any information submitted to the commissioner;\n(8) fail to reasonably cover, or ensure coverage of, all points, issues, and concepts contained in the course outline approved by the commissioner during the approved instruction; or\n(9) issue inaccurate course completion certificates.\n(b) Sponsors shall notify the commissioner within ten days of a felony or gross misdemeanor conviction or of disciplinary action taken against an occupational or professional license held by the sponsor or an instructor teaching an approved course. The conviction or disciplinary action shall be grounds for the commissioner to withdraw the approval of the sponsor and to disallow the use of the sponsor or instructor.\nThe commissioner reserves the right to audit subject offerings with or without notice to the sponsor.",
	"repealed": false
}