{
	"id": "410.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/410.10",
	"title": "410.10 CHARTER ELECTION.",
	"text": "Upon delivery of such draft, the council or other governing body of the city shall cause the proposed charter to be submitted at the next general election thereafter occurring in the city within six months after the delivery of such draft, and if there is no general city election occurring in the city within six months after the delivery of such draft, then the council or other governing body of the city shall cause the proposed charter to be submitted at a special election to be held on a date authorized by section 205.10, subdivision 3a. The council or other governing body may call a special election for that purpose only at any time. If the election is held at the same time with the general election, the voting places and election officers shall be the same for both elections. At any time before the council has fixed the date of the election upon the proposed charter, the charter commission may recall it for further action; and the council may authorize recall of the charter by the commission at any later date prior to the first publication of the proposed charter.\nThe notice of election shall contain the complete charter and shall be published once a week for two successive weeks in the official newspaper of the city, or if there be none, in a legal newspaper of general circulation in the city. In every city of the first class, the publication shall be made in a newspaper having an aggregate regular paid circulation of at least 25,000 copies. The governing body may in addition thereto publish the notice in any other legal newspaper published in the city.\nThe ballot shall bear the printed words, \"Shall the proposed new charter be adopted? Yes.... No....,\" with a square after each of the last two words, in which the voter may place a cross to express a choice. If any part of such charter be submitted in the alternative, the ballot shall be so printed as to permit the voter to indicate a preference in any instance by inserting a cross in like manner.\nIf any charter so submitted be rejected the charter commission may propose others from time to time until one is adopted.",
	"repealed": false
}