{
	"id": "116S.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/116S.04",
	"title": "116S.04 POWERS OF CORPORATION.",
	"text": "(a) The corporation has the powers granted to a nonprofit corporation by section 317A.161, except as otherwise provided in this chapter.\n(b) Except as specified in section 116S.02, subdivision 10, the state is not liable for the obligations of the corporation.\n(c) Section 317A.161 applies to this chapter and the corporation in the same manner that it applies to business corporations established under chapter 317A.\n(d) The corporation is a state agency for purposes of the following accounting and budgeting requirements:\n(1) financial reports and other requirements under section 16A.06;\n(2) the state budget system under sections 16A.095, 16A.10, and 16A.11;\n(3) the state allotment and encumbrance, and accounting systems under sections 16A.14, subdivisions 2, 3, 4, and 5; and 16A.15, subdivisions 2 and 3; and\n(4) indirect costs under section 16A.127.\n(a) The corporation must qualify as a state development company for purposes of United States Code, title 15, section 697, as amended, and must comply with applicable Small Business Administration organizational, operational, regulatory, and reporting requirements.\n(b) The corporation must also comply with the requirements of the Small Business Administration's section 504 loan program, United States Code, title 15, section 697a, as amended.\nThe governor shall appoint at least 25 members of the corporation, who must be representatives of government, private-sector lending institutions, community organizations, and business organizations, as described in Code of Federal Regulations, title 13, section 108.503-1(d), as amended. The membership shall select the members of the board of directors in accordance with section 116S.02, subdivision 3. The board may submit names of persons for consideration by the governor in filling vacancies in the membership under this subdivision.",
	"repealed": false
}