{
	"id": "152.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.021",
	"title": "152.021 CONTROLLED SUBSTANCE CRIME IN THE FIRST DEGREE.",
	"text": "A person is guilty of controlled substance crime in the first degree if:\n(1) on one or more occasions within a 90-day period the person unlawfully sells one or more mixtures of a total weight of 17 grams or more containing cocaine or methamphetamine;\n(2) on one or more occasions within a 90-day period the person unlawfully sells one or more mixtures of a total weight of ten grams or more containing cocaine or methamphetamine and:\n(i) the person or an accomplice possesses on their person or within immediate reach, or uses, whether by brandishing, displaying, threatening with, or otherwise employing, a firearm; or\n(ii) the offense involves two aggravating factors;\n(3) on one or more occasions within a 90-day period the person unlawfully sells one or more mixtures of a total weight of ten grams or more, or 40 dosage units or more, containing heroin or fentanyl;\n(4) on one or more occasions within a 90-day period the person unlawfully sells one or more mixtures of a total weight of 50 grams or more containing a narcotic drug other than cocaine, heroin, fentanyl, or methamphetamine; or\n(5) on one or more occasions within a 90-day period the person unlawfully sells one or more mixtures of a total weight of 50 grams or more containing amphetamine, phencyclidine, or hallucinogen or, if the controlled substance is packaged in dosage units, equaling 200 or more dosage units.\n(a) A person is guilty of a controlled substance crime in the first degree if:\n(1) the person unlawfully possesses one or more mixtures of a total weight of 50 grams or more containing cocaine or methamphetamine;\n(2) the person unlawfully possesses one or more mixtures of a total weight of 25 grams or more containing cocaine or methamphetamine and:\n(i) the person or an accomplice possesses on their person or within immediate reach, or uses, whether by brandishing, displaying, threatening with, or otherwise employing, a firearm; or\n(ii) the offense involves two aggravating factors;\n(3) the person unlawfully possesses one or more mixtures of a total weight of 25 grams or more, or 100 dosage units or more, containing heroin or fentanyl;\n(4) the person unlawfully possesses one or more mixtures of a total weight of 500 grams or more containing a narcotic drug other than cocaine, heroin, fentanyl, or methamphetamine;\n(5) the person unlawfully possesses one or more mixtures of a total weight of 500 grams or more containing amphetamine, phencyclidine, or hallucinogen or, if the controlled substance is packaged in dosage units, equaling 500 or more dosage units; or\n(6) the person unlawfully possesses:\n(i) 50 kilograms or more of cannabis flower;\n(ii) ten kilograms or more of cannabis concentrate; or\n(iii) edible cannabis products, lower-potency hemp edibles, hemp-derived consumer products, or any combination of those infused with more than one kilogram of tetrahydrocannabinols.\n(b) For the purposes of this subdivision, the weight of fluid used in a water pipe may not be considered in measuring the weight of a mixture except in cases where the mixture contains four or more fluid ounces of fluid.\nNotwithstanding subdivision 1, sections 152.022, subdivision 1, 152.023, subdivision 1, and 152.024, subdivision 1, a person is guilty of controlled substance crime in the first degree if the person manufactures any amount of methamphetamine.\nA person is guilty of aggravated controlled substance crime in the first degree if the person violates subdivision 1, clause (1), (2), (3), (4), or (5), or subdivision 2, paragraph (a), clause (1), (2), or (3), and the person or an accomplice sells or possesses 100 or more grams or 500 or more dosage units of a mixture containing the controlled substance at issue and:\n(1) the person or an accomplice possesses on their person or within immediate reach, or uses, whether by brandishing, displaying, threatening with, or otherwise employing, a firearm; or\n(2) the offense involves two aggravating factors.\n(a) A person convicted under subdivisions 1 to 2a, paragraph (a), may be sentenced to imprisonment for not more than 30 years or to payment of a fine of not more than $1,000,000, or both.\n(b) If the conviction is a subsequent controlled substance conviction, a person convicted under subdivisions 1 to 2a, paragraph (a), shall be committed to the commissioner of corrections for not less than four years nor more than 40 years and, in addition, may be sentenced to payment of a fine of not more than $1,000,000.\n(c) If the defendant is convicted under subdivision 1, clause (1), (2), (3), (4), or (5), or subdivision 2, paragraph (a), clause (1), (2), or (3), and the defendant or an accomplice sold or possessed 100 or more grams or 500 or more dosage units of a mixture containing the controlled substance at issue, that person shall be committed to the commissioner of corrections for not less than 65 months or the presumptive fixed sentence under the Minnesota Sentencing Guidelines, whichever is greater, nor more than 40 years and may be sentenced to payment of a fine of not more than $1,000,000, or both. If a person to be sentenced under this paragraph for a conviction under subdivision 2, paragraph (a), clause (1), (2), or (3), has not previously been convicted of an offense under section 152.021, 152.022, or 152.023, or of a similar offense by the United States or another state, the prosecutor may, prior to the time of sentencing, file a motion to have the person sentenced without regard to the mandatory minimum sentence established by this paragraph. The motion shall be accompanied by a statement on the record of the reasons for it. When presented with the motion, or on its own motion, the court may sentence the person without regard to this mandatory minimum sentence if the court finds substantial and compelling reasons to do so; such a sentence is a departure from the Sentencing Guidelines.\n(d) A person convicted under subdivision 2b shall be committed to the commissioner of corrections for not less than 86 months or the presumptive fixed sentence under the Minnesota Sentencing Guidelines, whichever is greater, nor more than 40 years and may be sentenced to payment of a fine of not more than $1,000,000, or both.\n(e) In a prosecution under subdivisions 1 to 2b involving sales by the same person in two or more counties within a 90-day period, the person may be prosecuted for all of the sales in any county in which one of the sales occurred.",
	"repealed": false
}