{
	"id": "85.536",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.536",
	"title": "85.536 GREATER MINNESOTA REGIONAL PARKS AND TRAILS COMMISSION.",
	"text": "The Greater Minnesota Regional Parks and Trails Commission is created to undertake system planning and provide recommendations to the legislature for grants funded by the parks and trails fund to counties, cities, and Tribal governments outside of the seven-county metropolitan area for parks and trails of regional significance.\nThe commission shall include 13 members appointed by the governor with two members from each of the regional parks and trails districts determined under subdivision 5 and one member at large. Membership terms, compensation, and removal of members and filling of vacancies are as provided in section 15.0575, except that a commission member may be compensated at the rate of up to $125 a day.\nThe governor shall make the first appointment by June 15, 2013. The governor shall designate six of the first appointees to terms ending on the first Monday in January 2015, and the remainder of the first appointees shall serve terms ending the first Monday in January 2016.\nThe governor or the governor's designee shall convene the first meeting of the commission by July 15, 2013, and shall act as chair until the commission elects a chair. The commission shall elect a chair at its first meeting.\n(a) The commissioner of natural resources, in consultation with the Greater Minnesota Regional Parks and Trails Coalition, shall establish six regional parks and trails districts in the state encompassing the area outside the seven-county metropolitan area. The commissioner shall establish districts by combining counties and may not assign a county to more than one district.\n(b) The commission shall develop a strategic plan and criteria for determining parks and trails of regional significance that are eligible for funding from the parks and trails fund and meet the criteria under subdivision 6.\n(c) Counties within each district may jointly prepare, after consultation with all affected municipalities, and submit to the commission, and from time to time revise and resubmit to the commission, a master plan for the acquisition and development of parks and trails of regional significance located within the district. Districtwide plans and master plans for individual parks and trails must meet the protocols and criteria as set forth in the greater Minnesota regional parks and trails strategic plan. The counties, after consultation with the commission, shall jointly hold a public hearing on the proposed plan and budget at a time and place determined by the counties. Not less than 15 days before the hearing, the counties shall provide notice of the hearing stating the date, time, and place of the hearing and the place where the proposed plan and budget may be examined by any interested person. At any hearing, interested persons shall be permitted to present their views on the plan and budget.\n(d) The commission shall review each master plan to determine whether it meets the conditions of subdivision 6. If it does not, the commission shall return the plan with its comments to the district for revision and resubmittal.\nThe commission must determine whether a park or trail is regionally significant under this section based on the definitions and criteria determined in the greater Minnesota parks and trails strategic plan, along with the following criteria:\n(1) a park must provide a natural resource-based setting and should provide outdoor recreation facilities and multiple activities that are primarily natural resource-based;\n(2) a trail must serve more than a local population and where feasible connect to existing or planned state or regional parks or trails;\n(3) a park or trail must be utilized by a regional population that may encompass multiple jurisdictions; and\n(4) a park may include or a trail may pass unique natural, historic, or cultural features or characteristics.\n(a) In recommending grants under this section, the commission shall make recommendations consistent with master plans.\n(b) The commission shall determine recommended grant amounts through an adopted merit-based evaluation process that includes the level of local financial support. The evaluation process is not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(c) When recommending grants, the commission shall consider balance of the grant benefits across greater Minnesota.\n(d) Grants may be recommended only for parks and trails included in a plan approved by the commission under subdivision 5.\nThe commission shall annually elect from among its members a chair and other officers necessary for the performance of its duties.\nThe commission shall meet at least twice each year. Commission meetings are subject to chapter 13D.\nThe commission shall submit a report by January 15 each year listing its recommendations under subdivision 7, in priority order, to the chairs and ranking minority members of the committees of the senate and house of representatives with primary jurisdiction over legacy appropriations.\nA member of the commission may not participate in or vote on a decision of the commission relating to an organization in which the member has either a direct or indirect financial interest.\nFor purposes of this section, \"commission\" means the Greater Minnesota Regional Parks and Trails Commission established under this section.",
	"repealed": false
}