{
	"id": "256B.0711",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0711",
	"title": "256B.0711 QUALITY SELF-DIRECTED SERVICES WORKFORCE.",
	"text": "For purposes of this section:\n(a) \"Commissioner\" means the commissioner of human services unless otherwise indicated.\n(b) \"Covered program\" means a program to provide direct support services funded in whole or in part by the state of Minnesota, including the community first services and supports program under section 256B.85, subdivision 2, paragraph (e); consumer-directed community supports and extended state plan personal care assistance services available under programs established pursuant to home and community-based service waivers authorized under section 1915(c) of the Social Security Act, and Minnesota Statutes, including, but not limited to, chapter 256S and sections 256B.092 and 256B.49, and under the alternative care program under section 256B.0913; the personal care assistance choice program under section 256B.0659, subdivisions 18 to 20; and any similar program that may provide similar services in the future.\n(c) \"Direct support services\" means personal care assistance services covered by medical assistance under section 256B.0625, subdivisions 19a and 19c; assistance with activities of daily living as defined in section 256B.0659, subdivision 1, paragraph (b), and instrumental activities of daily living as defined in section 256B.0659, subdivision 1, paragraph (i); and other similar, in-home, nonprofessional long-term services and supports provided to an elderly person or person with a disability by the person's employee or the employee of the person's representative to meet such person's daily living needs and ensure that such person may adequately function in the person's home and have safe access to the community.\n(d) \"Individual provider\" means an individual selected by and working under the direction of a participant in a covered program, or a participant's representative, to provide direct support services to the participant, but does not include an employee of a provider agency, subject to the agency's direction and control commensurate with agency employee status.\n(e) \"Participant\" means a person who receives direct support services through a covered program.\n(f) \"Participant's representative\" means a participant's legal guardian or an individual having the authority and responsibility to act on behalf of a participant with respect to the provision of direct support services through a covered program.\nAll covered programs shall operate consistent with this section, including by affording participants and participants' representatives within the programs of the option of receiving services through individual providers as defined in subdivision 1, paragraph (d), notwithstanding any inconsistent provision of section 256B.0659.\nThe requirement under subdivision 2 shall not restrict the state's ability to afford participants and participants' representatives within the covered programs who choose not to employ an individual provider, or are unable to do so, the option of receiving similar services through the employees of provider agencies, rather than through an individual provider.\n(a) The commissioner shall afford to all participants within a covered program the option of employing an individual provider to provide direct support services.\n(b) The commissioner shall ensure that all employment of individual providers is in conformity with this section and section 179A.54, including by modifying program operations as necessary to ensure proper classification of individual providers, to require that all relevant vendors within covered programs assist and cooperate as needed, including providers of fiscal support, fiscal intermediary, financial management, or similar services to provide support to participants and participants' representatives with regard to employing individual providers, and to otherwise fulfill the requirements of this section, including the provisions of paragraph (f).\n(c) The commissioner shall:\n(1) establish for all individual providers compensation rates, payment terms and practices, and any benefit terms, provided that these rates and terms may permit individual provider variations based on traditional and relevant factors otherwise permitted by law;\n(2) provide for required orientation programs within three months of hire for individual providers newly hired on or after January 1, 2015, regarding their employment within the covered programs through which they provide services;\n(3) have the authority to provide for relevant training and educational opportunities for individual providers, as well as for participants and participants' representatives who receive services from individual providers, including opportunities for individual providers to obtain certification documenting additional training and experience in areas of specialization;\n(4) have the authority to provide for the maintenance of a public registry of individuals who have consented to be included to:\n(i) provide routine, emergency, and respite referrals of qualified individual providers who have consented to be included in the registry to participants and participants' representatives;\n(ii) enable participants and participants' representatives to gain improved access to, and choice among, prospective individual providers, including by having access to information about individual providers' training, educational background, work experience, and availability for hire; and\n(iii) provide for appropriate employment opportunities for individual providers and a means by which they may more easily remain available to provide services to participants within covered programs; and\n(5) establish other appropriate terms and conditions of employment governing the workforce of individual providers.\n(d) The commissioner's authority over terms and conditions of individual providers' employment, including compensation, payment, and benefit terms, employment opportunities within covered programs, individual provider orientation, training, and education opportunities, and the operation of public registries shall be subject to the state's obligations to meet and negotiate under chapter 179A, as modified and made applicable to individual providers under section 179A.54, and to agreements with any exclusive representative of individual providers, as authorized by chapter 179A, as modified and made applicable to individual providers under section 179A.54. Except to the extent otherwise provided by law, the commissioner shall not undertake activities in paragraph (c), clauses (3) and (4), prior to July 1, 2015, unless included in a negotiated agreement and an appropriation has been provided by the legislature to the commissioner.\n(e) The commissioner shall cooperate in the implementation of section 179A.54 with the commissioner of management and budget in the same manner as would be required of an appointing authority under section 179A.22 with respect to any negotiations between the executive branch of the state and the exclusive representative of individual providers, as authorized under sections 179A.22 and 179A.54. Any entity providing relevant services within covered programs, including providers of fiscal support, fiscal intermediary, financial management, or similar services to provide support to participants and participants' representatives with regard to employing individual providers shall assist and cooperate with the commissioner of human services in the operations of this section, including with respect to the commissioner's obligations under paragraphs (b) and (f).\n(f) The commissioner shall, no later than September 1, 2013, and then monthly thereafter, compile and maintain a list of the names and addresses of all individual providers who have been paid for providing direct support services to participants within the previous six months. The list shall not include the name of any participant, or indicate that an individual provider is a relative of a participant or has the same address as a participant. The commissioner shall share the lists with others as needed for the state to meet its obligations under chapter 179A as modified and made applicable to individual providers under section 179A.54, and to facilitate the representational processes under section 179A.54, subdivisions 9 and 10. In order to effectuate this section and section 179A.54, questions of employee organization access to other relevant data on individual providers relating to their employment or prospective employment within covered programs shall be governed by chapter 179A and section 13.43, and shall be treated the same as labor organization access to personnel data under section 13.43, subdivision 6. This shall not include access to private data on participants or participants' representatives. Nothing in this section or section 179A.54 shall alter the access rights of other private parties to data on individual providers.\n(g) The commissioner shall immediately commence all necessary steps to ensure that services offered under all covered programs are offered in conformity with this section, to gather all information that may be needed for promptly compiling lists required under this section, including information from current vendors within covered programs, and to complete any required modifications to currently operating covered programs by September 1, 2013.\n(h) Beginning January 1, 2014, the commissioner of human services shall specifically require that any fiscal support, fiscal intermediary, financial management, or similar entities providing payroll assistance services with respect to individual providers shall make all needed deductions on behalf of the state of dues check off amounts or fair-share fees for the exclusive representative, as provided in section 179A.06, subdivisions 3 and 6. All contracts with entities for the provision of payroll-related services shall include this requirement.",
	"repealed": false
}